[{"count": 0, "tags": [], "creator": "kennedy@callan.com", "text": "Using jakarta-tomcat-4.0.4-LE-jdk14.exe, index.html and jakarta graphics files \nin the ROOT directory are overwritten on install.  Old files are deleted, and \nthe new files written in their place.", "id": 18095, "time": "2002-06-19T17:22:21Z", "bug_id": 10021, "creation_time": "2002-06-19T17:22:21Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 10021, "is_private": false, "id": 18307, "time": "2002-06-21T13:52:27Z", "creator": "remm@apache.org", "creation_time": "2002-06-21T13:52:27Z", "tags": [], "text": "Maybe it could be fixed, but updating an existing installation using the\ninstaller isn't a very good idea. The recommended way is uninstall / install."}, {"count": 2, "tags": [], "text": "Changing this to an enhancement request to include an upgrade option in the \ninstaller.\n\nWhilst this would be nice to have, there are a number of potential issues such \nas updates to the configuration files that make this tricky to implement.", "is_private": false, "bug_id": 10021, "id": 49620, "time": "2003-12-23T17:19:24Z", "creator": "medthomas@ntlworld.com", "creation_time": "2003-12-23T17:19:24Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 10021, "attachment_id": null, "id": 70355, "time": "2005-02-02T10:51:51Z", "creator": "nikolaymetchev@gmail.com", "creation_time": "2005-02-02T10:51:51Z", "is_private": false, "text": "Any chance this could be looked at for Tomcat 5?"}, {"count": 4, "tags": [], "bug_id": 10021, "text": "Some random thoughts on this. If this is implemented, separating CATALINA_HOME / CATALINA_BASE is one way to go since that will simplify the upgrade process. That then raises a number of additional questions:\n- Are multiple HOMEs supported? If so how?\n- Are multiple BASEs supported? If so how?\n- Does uninstall remove a HOME, all HOMEs?\n- If a HOME is uninstalled what happens to BASEs using it?\n\nThat could all get quite complicated.\n\nThe other approach is to just update the binaries (*.exe, *.jar) leaving the config as is. The more I think about it, the more 'do-able' this sounds. May need an upgrade specific read-me for any recommended config updates (changes to defaults, new settings etc).\n\nI'm leaving this open as I think it is worth doing (well, at least worth looking at in more detail) but it feels like a fair amount of work to get right.", "id": 142743, "time": "2010-12-15T11:13:33Z", "creator": "markt@apache.org", "creation_time": "2010-12-15T11:13:33Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "text": "There's also the problem of somehow merging configurations: sometimes, server.xml is updated even within a stable line. The safest thing to do is simply leave server.xml alone, but we might still run across problems there.\n\nHow traumatic are changes allowed to be within a particular version line (6.0.x)? For example, the JreMemoryLeakDetectionListener was introduced at some point in 6.0.x but hasn't always been there. That's not a problem as /adding/ something isn't a big deal. Do we ever /remove/ anything that might cause a startup failure?\n\nSimilarly, sometimes configuration defaults change: do we have to detect whether the old defaults are in use and then explicitly set them to their old default values in server.xml/web.xml/context.xml?\n\nThe process of upgrading could seriously break someone's configuration.", "attachment_id": null, "bug_id": 10021, "id": 142744, "time": "2010-12-15T11:22:30Z", "creator": "chris@christopherschultz.net", "creation_time": "2010-12-15T11:22:30Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 10021, "attachment_id": null, "id": 145033, "time": "2011-03-16T08:54:39Z", "creator": "markt@apache.org", "creation_time": "2011-03-16T08:54:39Z", "is_private": false, "text": "I'm still mulling this one over. I'm currently on the fence between WONTFIX and the replace the JARs upgrade method (with a your config might break caveat).\n\nIf it does get implemented, it will be for Tomcat 7 onwards."}, {"count": 7, "tags": [], "bug_id": 10021, "text": "While this could get complex, I suspect that on the whole it will save committer time.  An installer with an upgrade option and a big fat warning would reduce those ever-present requests on the Tomcat mailing list for \"How do I upgrade Tomcat?\"\n\nI accept they might just change to \"why is this big fat warning here\", though.", "id": 146065, "time": "2011-05-02T17:09:19Z", "creator": "peter.crowther@melandra.com", "creation_time": "2011-05-02T17:09:19Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "text": "There are complications with the \"just over-write the binaries and JARs\" and include:\n- required changes to config files\n- changes in JAR names (e.g. JDT updates)\n\nI am leaning more towards WONTFIX as further complications are identified.", "attachment_id": null, "bug_id": 10021, "id": 152808, "time": "2012-01-15T20:59:40Z", "creator": "markt@apache.org", "creation_time": "2012-01-15T20:59:40Z", "is_private": false}, {"count": 9, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I've come to the conclusion that this is simply too complex a problem to solve for the benefit it would bring.\n\nTo upgrade safely would require a switch to using separate CATALINA_HOME / CATALINA_BASE which would make the installer more complicated.\n\nThe installer would also need to be able to patch the configuration files to add, for example, additional permissions required by the security manager or to modify defaults in web.xml, context.xml or server.xml. This introduces way to many complexities.\n\nWhile we could provide a \"simple\" upgrade process this would come with a stack of caveats and would likely require manual intervention to complete correctly.\n\nGiven that the installer now allows side-by-side installs of multiple versions, the 'manual' upgrade process of install a new version and copy your webapps is likely to be the simplest.", "id": 152984, "time": "2012-01-20T21:27:03Z", "bug_id": 10021, "creation_time": "2012-01-20T21:27:03Z", "is_private": false}]