[{"count": 0, "tags": [], "bug_id": 10107, "attachment_id": null, "id": 18283, "time": "2002-06-21T10:25:34Z", "creator": "matt@zevi.net", "creation_time": "2002-06-21T10:25:34Z", "is_private": false, "text": "I have recently upgraded to 2.0.39, and I have noticed a problem with view \npages in Netscape 4.x.\n\nI have checked this problem on Netscape 4.77 on a PC, 4.79 on a PC, and 4.73 on \na Mac, all have the same problem.  I have searched the mailing list archives, \nand have found nothing mentioned of this problem.  I have checked the error \nlogs, and nothing is written to them which might give any clue.\n\nMy platform in Windows 2000.\n\nThe problem is this - when I try to view a page in any of the above versions of \nNetscape, I get an error message.  The page sometimes doesn't load at all, the \npages sometimes half-loads, and sometimes there is no error message at all.  I \nhaven't noticed a pattern which occurs.  The error message is this: \"A network \nerror occured while Netscape was receiving data. (Network error: Connection \nreset by peer)\\n\\nTry connecting again.\"\n\nI uninstalled 2.0.39, and reinstalled 2.0.36 with the same conf file, and \nviewed the same HTML page, and it worked fine - therefore I assume it has \nsomething to do with the core of the new version.\n\nThe above URL (http://www.pencarrowlodge.co.nz) is one of the sites we host.\nIf it's any use to you, there are others:\nhttp://www.shoeclinic.wb.gs\nhttp://www.zevi.net/3d.asp\n\nThe last one you will notice is an ASP page - this is because there is an IIS \nweb server sitting on a different port (4040) on the same machine as we have \nsome ASP sites we host (I know, I know...)\n\nAll of the above sites do the same thing now, and all of the above sites were \nfine before I upgraded.\n\nI have tried adding the following line to httpd.conf:\nBrowserMatch Mozilla nokeepalive downgrade-1.0 force-response-1.0\nand a few other varieties of that line, like different combinations of the \nthree commands - I'm no genius, but I though it was worth a try - it didn't \nchange anything though.\n\nErm...  I don't think I've forgotten anything...  oh yes - all the sites work \nfine in Mozilla 1.1a on the PC, IE6 on the PC, and IE 5 on the Mac.\n\nAnd if you want to find a version of Netscape 4, you can find one at:\nhttp://wp.netscape.com/download/0402101/10000-----_qual.html\n\nGive me a yell if you need any more info, and I apologise hugely if I have \nwasted anyone's time - the last thing I want to do is take you away from making \nwhat is the world's most kick-ass web server...   :)\n\nThanks,\n\nMatt Parlane\nZevi Interactive\nmatt@zevi.net"}, {"count": 1, "tags": [], "text": "Just an update:\n\nI have still not found any solution or workaround to the problem, but I have \nhad to resort to downgrading to version 2.0.36 again as this is a production \nwebserver.  This means that all the links I gave you will work perfectly.  This \nalso means that I'm running a vulnerable webserver.  (help!!   :)\n\nI have also had reports of random problems with sites hosted here with browsers \nother than Netscape (IE 5 mostly).  I can't be at all specific as to details, \nbut there are just some \"problems\".  Not helpful at all I know, but that \nproblems with Netscape are still consistent.\n\nPlease let me know if you'd like me to install 2.0.39 again, as it is no \nproblem to do, but I will just need a timeframe (up to a few hours) when \nsomeone will be likely to look into it, as I don't want to be running an \ninaccesible webserver for too long.\n\nThanks again,\n\nMatt Parlane", "is_private": false, "bug_id": 10107, "id": 18445, "time": "2002-06-24T06:36:15Z", "creator": "matt@zevi.net", "creation_time": "2002-06-24T06:36:15Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "\n  Several connection-oriented fixes are in Apache 2.0.40 - please upgrade and\n  try repeating your tests.\n\n  Are you using SSL or anything else that would cause this naseua?\n", "is_private": false, "bug_id": 10107, "id": 21251, "time": "2002-08-18T21:00:17Z", "creator": "wrowe@apache.org", "creation_time": "2002-08-18T21:00:17Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "id": 21253, "time": "2002-08-18T21:19:53Z", "bug_id": 10107, "creation_time": "2002-08-18T21:19:53Z", "is_private": false, "text": "\n  Didn't mean to close without additional feedback, just yet."}, {"count": 4, "tags": [], "text": "\n  No response from submitter.  Assuming issue is resolved by at least 2.0.43.\n  If not, the EnableSendfile directive will exist in 2.0.44, suggest you try\n  disabling it.\n", "is_private": false, "bug_id": 10107, "id": 24515, "time": "2002-10-15T03:22:08Z", "creator": "wrowe@apache.org", "creation_time": "2002-10-15T03:22:08Z", "attachment_id": null}]