[{"count": 0, "tags": [], "bug_id": 10114, "attachment_id": null, "text": "Netscape 4.79 has been configured with languages de,en (in this order) - while\nclicking on our sites navigation menu some pages apear in german as they should\n- others apear in english - all URLS ending in / - so maybe the problem is in\nthe combination with the directoryindex config?", "id": 18298, "time": "2002-06-21T12:33:12Z", "creator": "hofmann@isl.org", "creation_time": "2002-06-21T12:33:12Z", "is_private": false}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "id": 18338, "time": "2002-06-21T16:05:25Z", "bug_id": 10114, "creation_time": "2002-06-21T16:05:25Z", "is_private": false, "text": "\n  The RFC spells out nothing in respect to order of languages as preference.\n\n  The logical approach would be to patch mod_negotation (or perhaps, the http\n  headers module) to transliterate a list such as de,en into de;q=.667,en;q=.333\n  or some other distributed weight model, based on 1) absense of any q values\n  and 2) number of entries.  This would extend beyond language to other negotiated\n  quality lists.\n\n  Bill"}, {"count": 2, "tags": [], "bug_id": 10114, "attachment_id": null, "text": "Not a bug.  Mark it as an enhancement request.", "id": 24678, "time": "2002-10-17T02:10:26Z", "creator": "slive@apache.org", "creation_time": "2002-10-17T02:10:26Z", "is_private": false}, {"count": 3, "tags": [], "creator": "apache@jth.net", "attachment_id": null, "id": 25584, "time": "2002-11-04T01:02:27Z", "bug_id": 10114, "creation_time": "2002-11-04T01:02:27Z", "is_private": false, "text": "This definitely is a bug as it is working in 1.3.x.\n"}, {"count": 4, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "is_private": false, "id": 25585, "time": "2002-11-04T01:20:47Z", "bug_id": 10114, "creation_time": "2002-11-04T01:20:47Z", "text": "I'm fairly certain this behavior has not changed since 1.3.  Several\nother things in negotiation has changed, so it is certainly possible\nthat this \"arbitrary\" (from the RFC perspective) choice goes a different\nway in 2.0.  Regardless, since it doesn't violate the RFC, it is not\na bug."}, {"count": 5, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "is_private": false, "id": 25587, "time": "2002-11-04T01:27:33Z", "bug_id": 10114, "creation_time": "2002-11-04T01:27:33Z", "text": "*** Bug 14205 has been marked as a duplicate of this bug. ***"}, {"count": 6, "tags": [], "text": "It definitely has changed since 1.3. I am currently migrating to 2.0 and have two servers running in \nparallel with duplicate homepages. Whenever I change IP-address in my hosts-file to the old \nserver, everything is working as expected. When I change the IP-address to the new server I see \nthe difference.\nPersonnally I have languages A-D in my browser (A my mother tongue, D a \nlanguage I somewhat understand). The browsers do not allow entering q-values, only a \nprioritized list of languages. As Apache2 is now I may very well get consistantly language D from \na website even if language A is available. ", "attachment_id": null, "bug_id": 10114, "id": 25602, "time": "2002-11-04T10:01:17Z", "creator": "apache@jth.net", "creation_time": "2002-11-04T10:01:17Z", "is_private": false}, {"count": 7, "tags": [], "text": "I have a question: Are you sure that the browser is not sending any q values?\nIt is true that few browsers actually allow you to enter q values, but \nmost browsers will calculate q values for you in order to enforce the\nordering that you select.  I haven't tried Opera, but Mozilla/Netscape\ncertainly do send q values.  Any browser that doesn't do this is broken.\n\nPut a sniffer on the line and look at the actual client/server transaction.\nIf the q values are being sent, then it is possible you are hitting one\nof the various other changes in mod_negotiation between 1.3 and 2.0.", "is_private": false, "bug_id": 10114, "id": 25710, "time": "2002-11-05T18:42:54Z", "creator": "slive@apache.org", "creation_time": "2002-11-05T18:42:54Z", "attachment_id": null}, {"count": 8, "tags": [], "creator": "hofmann@isl.org", "attachment_id": null, "id": 26765, "time": "2002-11-22T08:43:52Z", "bug_id": 10114, "creation_time": "2002-11-22T08:43:52Z", "is_private": false, "text": "We have now completly moved to Apache/2 - and the only problem is still the\nlanguage negotiation - the problem happens with Opera 6 and Netscape 4 as well\nas with Amaya 5.3 !!!\nWith Explorer 6 and Mozilla it works.\nSo we have 3:2 - for backward compatibility Apache/2 mod_negotiation should be\nfixed, because it is a bug from the point of user-friendliness and backward\ncompatibility!!!!\nThe mentioned browser do NOT send q values with them - but from my point of view\nnobody needs q values, because the ORDER of the languages is enough to make a\ndecission - also within a browser the user can only ORDER the languages in a\nlist - the item on top is what the user wants!"}, {"count": 9, "tags": [], "text": "I read the RFC 2296 and found the following in section 3.5:\n\n> The best variant, as determined by the remote variant selection\n> algorithm, is the one variant with the highest overall quality value,\n> or, if there are multiple variants which share the highest overall\n> quality, the first variant in the list with this value.\n\nin the case of absence of the quality factor q (which is the case for Netscape\n4, Opera etc.) all language variants have the same \"highest verall quality\" - so\nthe FIRST variant is the BEST variant!!!\n\nSo there is only one question left - in which ORDER should the algorithm work -\nthe order of the accept-language from the browser - or the order of the apache\n\"languagepriority\".\n\nIt looks to me that the real bug is the implementation of the apache\n\"languagepriority\"!\nThats because it should only have presedence when there is no Accep-Language\nfrom the browser - otherwise ALWAYS the browsers list order has to be used,\nbecause we serve the user and NOT the machine!\nSo when the algorithm uses the ORDER of the browsers accept-language - the\nresult would be correct - PLEASE FIX!\n", "attachment_id": null, "bug_id": 10114, "id": 26768, "time": "2002-11-22T09:33:49Z", "creator": "hofmann@isl.org", "creation_time": "2002-11-22T09:33:49Z", "is_private": false}, {"count": 10, "tags": [], "creator": "patchm@algonquincollege.com", "attachment_id": null, "id": 32424, "time": "2003-03-04T20:55:37Z", "bug_id": 10114, "creation_time": "2003-03-04T20:55:37Z", "is_private": false, "text": "Just wanted to echo that we are having the same problem with our international \npages on our Apache 2.0.44 server. We have many Netscape 4 users that specify \nin their preferences that they prefer chinese before english, yet they are \ndelivered an english page.\n\nWe had to re-setup Apache 1.3 on an separate server last August in order to get \nthese pages working properly again.\n\nWhen will this be fixed?\n\nThanks,\n-Mike"}, {"count": 11, "tags": [], "creator": "nd@perlig.de", "attachment_id": null, "id": 32495, "time": "2003-03-05T19:51:14Z", "bug_id": 10114, "creation_time": "2003-03-05T19:51:14Z", "is_private": false, "text": "Kai, RFC 2296 does not apply here, because neither Netscape nor Opera support\nTCN (RFC 2295). So please calm down.\n\nHowever, I'm changing this to ASSIGNED, until someone picks it up and fixes the\nissue.\n\nThanks."}, {"count": 12, "tags": [], "creator": "jim@apache.org", "attachment_id": null, "id": 106283, "time": "2007-08-03T08:04:15Z", "bug_id": 10114, "creation_time": "2007-08-03T08:04:15Z", "is_private": false, "text": "This is quite old. Please test/confirm with more recent versions and reopen if needed."}, {"count": 13, "tags": [], "text": "It appears as if recent browsers IE 7, Firefox 2.0.0.5, Opera 9.22 do not \nassign a q-value to the first language, but assign descending q-values to later \nlanguages and thus it is now working as expected.", "attachment_id": null, "bug_id": 10114, "id": 106458, "time": "2007-08-07T08:09:33Z", "creator": "apache@jth.net", "creation_time": "2007-08-07T08:09:33Z", "is_private": false}]