[{"count": 0, "text": "As I know there is a planned config feature to be able to \noverride the shebang line, but as I know there is no any \nresult for it, yet:\n------------------------------\n    * PR#4241: config\n      Need to be able to override shebang line to make CGI scripts\n      more portable.\n        Status: \nAND\n    4241 config   suspended Need to be able to override shebang line to make CGI\nscripts \\\n    more portable.\n------------------------------\n\nI would suggest a \"ShebangAlias\" directive for the Apache configuration file.\nI don't know if there is already something similar under development, \nbut this feature would be very important for those users who would like \nto use their Perl scripts with the least possible modification when they \nare porting their scripts, or are just developing under Windows \nenvironment, later are running their scripts on Unix server.\nThis would really help us to make CGI scripts more portable.\n\nWould look like following:\nShebangAlias /usr/local/bin/perl \"C:/Perl/bin/perl.exe\"\n\nThe idea already got a vote on Apache Dev list, so I also post it here.\nI hope others will like it, too, especially the Windows users, so they vote for it.\n\nThanks,\nWebmaster33", "bug_id": 10145, "attachment_id": null, "id": 18375, "time": "2002-06-22T08:35:33Z", "creator": "webmaster33@bigfoot.com", "creation_time": "2002-06-22T08:35:33Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "psychosos@gmx.at", "text": "On windows just use ScriptInterpreterSource Registry, works really fine.", "count": 1, "id": 21225, "time": "2002-08-18T14:12:49Z", "bug_id": 10145, "creation_time": "2002-08-18T14:12:49Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 10145, "attachment_id": null, "id": 21227, "time": "2002-08-18T14:35:44Z", "creator": "webmaster33@bigfoot.com", "creation_time": "2002-08-18T14:35:44Z", "is_private": false, "text": "I know about the ScriptInterpreterSource Registry feature! I suggest the\nShebangAlias feature, because it would really help us to make CGI scripts more\nportable.\n\nShebangAlias feature would help webmasters & developers to keep their scripts\n(shebang line) unchanged through several platforms. If you use a lot scripts and\nyou move to another platform ShebangAlias directive helps you (you may need to\nchange shebang line of script). If you develop your scripts on a platform, then\nyou put online on another platform, this feature also helps much.\n\nI know there are alternate solutions, like ScriptInterpreterSource Registry, or\nlinking under Unix systems, but ShebangAlias directive is a general solution\nright in Apache.\n\nAnyway my opinion is, it would be a helpful feature."}, {"count": 3, "tags": [], "text": "\n  Except on Win32 and a handful of others, Apache itself never looks at the\n  shebang line.\n\n  For a portable solution, you are really looking for a 'FileAction' directive\n  that would associate a given script type (like .pl) with a specific interpreter\n  (such as /usr/local/bin/perl or c:/program files/perl/bin/perl.exe).\n\n\n\n*** This bug has been marked as a duplicate of 7483 ***", "is_private": false, "id": 21254, "creator": "wrowe@apache.org", "time": "2002-08-18T21:30:23Z", "bug_id": 10145, "creation_time": "2002-08-18T21:30:23Z", "attachment_id": null}]