[{"count": 0, "text": "Actually I tried to find out how to escape ExtFilterDefine commands correctly. \nI defined\n\nExtFilterDefine sed-replace cmd=\"/bin/sed s/verdana/arial/g\"\n\nas an example (the actual problem was that cmd=\"/bin/sed 's/verdana/arial/g'\" \ndoesn't work). This external filter works okay with Set/AddOutputFilter.\nTo debug the command I added\n\nExtFilterOptions DebugLevel=9\n\nto the corresponding <Directory> context. But then the ExtFilter stops working \nand gives me\n\n[error] couldn't find definition of filter 'sed-replace'\n\nin my error_log and a related error is given back to UA. Nothing else has been \nchanged after adding the ExtFilterOptions directive.", "bug_id": 10147, "is_private": false, "id": 18379, "time": "2002-06-22T13:42:14Z", "creator": "cv@corbach.de", "creation_time": "2002-06-22T13:42:14Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 10147, "attachment_id": null, "text": "I wasn't able to reproduce the lost filter definition when using this configuration:\n\n<Directory /photo>\nDirectoryIndex index.cgi\nOptions Indexes ExecCGI\nAddHandler cgi-script .cgi\n\nSetOutputFilter sed-replace\nExtFilterOptions DebugLevel=9\n</Directory>\n\nExtFilterDefine sed-replace cmd=\"/bin/sed 's/photos/picurs/g'\"\n\n(I didn't see any output at the client because sed got confused by the single\nquotes.  When I remove the single quotes it works fine.)\n\nCan you spot something about my testcase which is inconsistent with your\ndescription, or can you perhaps supply a set of minimal changes to the\ndefault httpd-std.conf which would expose the problem?\n\nThanks so much!\n\n(Certainly I need to update the doc to describe quoting issues like this!!)\n", "id": 18380, "time": "2002-06-22T14:54:17Z", "creator": "trawick@apache.org", "creation_time": "2002-06-22T14:54:17Z", "is_private": false}, {"count": 2, "tags": [], "text": "I did it the other way 'round and tried to reproduce your situation :)\nIt does work if the ExtFilterDefine and the ExtFilterOptions statement are \nlocated _within the same VH_.\nIn my configuration ExtFilterDefine is located in the main config (so I can \nreuse it otherwhere) and ExtFilterOptions + SetOutputFilter in a directory \ncontext within a VH. Contrarily the ExtFilter works fine in this situation if \nExtFilterOptions is not set. So the bahaviour is inconsistent and I think one \nshould have the possibility to split Define and Options for ExtFilter just like \nI did.\nApart from that - wouldn't it be nice to have a separate logfile for ExtFilters \njust like with CGIs oder URL rewriting? I dunno if it's a enough for a formal \nfeature request.", "is_private": false, "id": 18386, "creator": "cv@corbach.de", "time": "2002-06-22T16:12:14Z", "bug_id": 10147, "creation_time": "2002-06-22T16:12:14Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "Thanks for the update...  I was able to reproduce and am working on a change\nto mod_ext_filter so that filter definitions can be used across multiple\nservers/vhosts.\n\n(I'm ignoring your feature request for the moment :) )\n\nThanks again!\n", "attachment_id": null, "id": 18479, "creator": "trawick@apache.org", "time": "2002-06-24T16:45:37Z", "bug_id": 10147, "creation_time": "2002-06-24T16:45:37Z", "is_private": false}, {"count": 4, "tags": [], "creator": "trawick@apache.org", "attachment_id": null, "id": 18620, "time": "2002-06-26T20:01:15Z", "bug_id": 10147, "creation_time": "2002-06-26T20:01:15Z", "is_private": false, "text": "mod_ext_filter has been changed to find filter definitions in the main\nserver in case they weren't defined in the vhost...  the patch as committed\nis below, and will be in the next release of Apache:\n\nhttp://cvs.apache.org/viewcvs.cgi/httpd-\n2.0/modules/experimental/mod_ext_filter.c.diff?r1=1.29&r2=1.30\n\nI tweaked the documentation to try to clarify how parameters to the\nexternal program are specified.  In addition, I added a new example\nwhich you might recognize.\n\nIf you really want to have stderr from the filter written to a file,\nplease write another PR for the feature request.  I don't personally\nplan on doing anything about that unless it is clear that there is\na widespread desire for it.  (Other folks may be interested however.)\nNote that the LogStderr option (on the ExtFilterOptions directive) can \nbe used to capture the external filter's stderr in the Apache error log.\n\nThanks again for your report!\n"}]