[{"attachment_id": null, "tags": [], "creator": "Thomas.Calrke@tellmi.demon.co.uk", "is_private": false, "count": 0, "id": 18495, "time": "2002-06-24T19:38:34Z", "bug_id": 10192, "creation_time": "2002-06-24T19:38:34Z", "text": "The 2.0 serise of apache for win 32 is quite impressive, however their is a \nsmall bug that needs to be addressed.\n\nDuring the incorprotation of the apache monitor the test configeration commands \nrestart, stop and start apache have changed.\n\nThey no longer wait for 20 seconds so that any valuable debuging infomation is \ndisplayed.\n\nIs their a command that can be passed to apache to wait for 20 seconds in this \ncircumstance or do i have to try and use cmd.exe or ms dos, which wouldn't work \nanyway. This is because it is compiled for win 32 and wilnot run on dos.\n\nThis seems quite silly but trying to hit the brake key at 12 o'clock in the \nevening is not the easist of things.\n\nEspecily just to find out that i foregot to uncomment the end of the proxy \nmodule directive. Don't laugh it's quite hard to do this sort of thing that \nlate in the evening.\n\nAnyway this needs to be sorted somehow. I would of thought that the apache \ntoolbox would come up with error messages if the configeration is incorrect. Is \nthat just too obvious?\n\nLittle things like this could help make apache a viable alternative!"}, {"count": 1, "tags": [], "bug_id": 10192, "attachment_id": null, "text": "\n  You are looking for the -w flag for the Win32 port, that was JUST introduced\n  to the code this last weekend.  It will be in the 2.0.40 release.\n", "id": 18551, "time": "2002-06-25T15:25:32Z", "creator": "wrowe@apache.org", "creation_time": "2002-06-25T15:25:32Z", "is_private": false}, {"count": 2, "tags": [], "creator": "HummerX123@hotmail.com", "attachment_id": null, "text": "I just install Apache 2.0.40 on my Win2k machine, and it seem that the -w flag \ndoesn't work yet, the window still close immediate on error.\n\n", "id": 21697, "time": "2002-08-25T01:42:40Z", "bug_id": 10192, "creation_time": "2002-08-25T01:42:40Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "wrowe@apache.org", "is_private": false, "count": 3, "id": 24511, "time": "2002-10-15T02:32:16Z", "bug_id": 10192, "creation_time": "2002-10-15T02:32:16Z", "text": "\n  The -w option for Apache.exe was recently introduced for 2.0.  This will solve\n  your issue, and the default shortcuts include that flag.\n"}]