[{"count": 0, "attachment_id": null, "bug_id": 10237, "is_private": false, "id": 18596, "time": "2002-06-26T07:37:56Z", "creator": "pwarren@thorlock.com", "creation_time": "2002-06-26T07:37:56Z", "tags": [], "text": "If using Apache 2.0.39 for Windows in combination with Chili!Soft ASP 3.6.2, \nthe Apache service fails to start. The following message is logged by Apache in \nthe application log:\n\n\nEvent ID: 3299\nSource: Apache Service\nCategory: Error\nDescription:\nThe Apache service named  reported the following error:\n>>> Apache.exe: module \"E:\\DEVELOPMENT\\CHILIASP\\CASPLIB\\NtWebServer\\apachmod20\n\\src\\Apachemod.c\" is not compatible with this version of Apache.\n\n\nI have witnessed this problem on both Windows 2000 Professional and Windows \nNT4.0 Server. I have also read reports of the problem on Windows 2000 Advanced \nServer.\n\nChili!Soft has recognised this problem and is working on a solution. The only \nknown workaround is to downgrade to Apache 2.0.36.\n\nThe download page for Apache 2.0.39 for Windows should mention this problem so \nthat Chili!Soft ASP users do not kill their servers.\n\nNOTE: I realise that this is probably a bug in Chili!Soft ASP and not Apache. \nHowever, I could not find a better method to inform the Apache/Chili!SoftASP \ncommunity of this issue as a lot of people will be looking at upgrading due to \nthe security problem with 2.0.36."}, {"count": 1, "tags": [], "text": "As you mentioned, this is a Chili!Soft issue and not an Apache issue.  2.0.39  is not binary-compatible with modules compiled for 2.0.36.  I'm going to go  ahead and close out this report.  Thanks for using Apache!   PS: I'm marking it as \"fixed\" assuming that Chili!Soft will fix it on their end -- it's not really \"invalid\" nor does it fit in the \"worksforme\" category, so \"fixed\" seemed like the most appropriate resolution status code. ", "is_private": false, "id": 18873, "creator": "jwoolley@apache.org", "time": "2002-07-02T19:50:16Z", "bug_id": 10237, "creation_time": "2002-07-02T19:50:16Z", "attachment_id": null}]