[{"count": 0, "tags": [], "creator": "nvick@capcollege.bc.ca", "attachment_id": null, "is_private": false, "id": 18689, "time": "2002-06-27T23:30:55Z", "bug_id": 10305, "creation_time": "2002-06-27T23:30:55Z", "text": "It would be very useful to me if Realm implementations could return an error \nmessage and this error message was set as a session attribute. This way, one \ncould configure a Servlet as the form login error page, and that Servlet could \ndisplay the Realm implementation's error message. This would be very useful for \nRealms where there are many reasons why a login attempt may have failed, and a \ngeneral error message is inadequate. \n\nFor example, with a Realm that I am working on that uses JNDI to access a \nNovell LDAP server, I need to return an error message that says \"Password \nexpired\" when a users's password has expired. A user may leave his or her \ncomputer on for a few weeks, during which their password may expire. If they \nthen try to access one of our secured Web applications, a general error message \nis too confusing for them. \n\nI also need to return an error message that says \"You have exceeded your \nconnection limit\" when the Novell LDAP server returns an error telling me that \nthe user has too many Novell connections. I also need to return \"The LDAP \nserver is down\" when our Novell LDAP server crashes because it crashes every \nweek or two.\n\nHere is one way to do this:\n\nCreate a new Realm interface with authenticate methods that have one extra \nparameter: a StringBuffer. When a Realm wishes to indicate an error, it adds an \nerror message to the StringBuffer and returns a null Principal. Tomcat's \nFormAuthenticator would then set a session attribute using a key such \nas \"org.apache.catalina.authenticator.FormAuthenticator.error_message\" with the \nvalue of the error message.\n\nNote, this could be a new Realm interface, for example Realm2, for backward \ncompatibility. Tomcat could use the Realm2 interface if a Realm implementation \nsupports it, or the Realm interface for implementations that have not yet been \nupdated to support the new interface."}, {"count": 1, "text": "The realm was designed that way on purpose. There were some messages in the\ntomcat-dev list about this.", "creator": "funkman@joedog.org", "attachment_id": null, "id": 52728, "time": "2004-02-21T14:54:40Z", "bug_id": 10305, "creation_time": "2004-02-21T14:54:40Z", "tags": [], "is_private": false}]