[{"count": 0, "tags": [], "creator": "raultman@fcci-group.com", "is_private": false, "text": "From the FOP devlist:\n\n> -----Original Message-----\n> From: Peter B. West [mailto:pbwest@powerup.com.au]\n> \n> The discussion has thrown up some interesting points, and I hope to see \n> Rhett get involved in this soon.\n> \n> I hope also that the work Rhett is talking about will give us a solid \n> framework for changes to our support framework, both with the JVM and \n> possibly with the frequently changing jars that we bundle.  There may be \n> other initiatives happening within Apache on that front.\n\nI think a multiplexing classloader would give us a really serious boost with \nregard to flexibility.  This is going to be an extremely important issue not \nonly as JVM versions become more important, but also as the differences between \neach vendor interpretation of the VM becomes apparrent.  By supplying a \nclassloader that can, based on various properties, deduce the correct class to \nload, we can keep FOP's implementation disentangled from most of these concerns.\n \nThe actual act of selecting the correct location for loading a class is really \nnot that hard, but a classloader that makes decisions for FOP is something \nthat's going to also need someone with good experience in FOP development.  \nCurrently, that person isn't me.  I think that maybe if I and someone who's a \nmore core FOP developer could get together in private email we could get a good \nstructure for this classloader hammered out.  From there, implementation of it \nwould be pretty easy for me to handle.\n\nSo, is anyone game?  Like I said, I can write it, but if I design this thing in \na vacuum, it may not be nearly as good as it could be.", "id": 18809, "time": "2002-07-01T16:48:33Z", "bug_id": 10379, "creation_time": "2002-07-01T16:48:33Z", "attachment_id": null}, {"attachment_id": 2263, "tags": [], "bug_id": 10379, "text": "Created attachment 2263\nInital proposal for FOP transparent multiplexing classloader", "count": 1, "id": 19024, "time": "2002-07-04T23:14:58Z", "creator": "raultman@fcci-group.com", "creation_time": "2002-07-04T23:14:58Z", "is_private": false}, {"count": 2, "tags": [], "text": "Created attachment 2557\nProposal for classloader \"rules document\"", "attachment_id": 2557, "id": 20537, "creator": "raultman@fcci-group.com", "time": "2002-08-01T13:17:34Z", "bug_id": 10379, "creation_time": "2002-08-01T13:17:34Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 10379, "attachment_id": null, "text": "This is no longer needed. Currently we don't need to have different code for different JDKs.", "id": 122093, "time": "2008-11-01T08:51:57Z", "creator": "jeremias@apache.org", "creation_time": "2008-11-01T08:51:57Z", "is_private": false}, {"count": 4, "tags": [], "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "is_private": false, "id": 156429, "creator": "gadams@apache.org", "time": "2012-04-01T13:47:56Z", "bug_id": 10379, "creation_time": "2012-04-01T13:47:56Z", "attachment_id": null}]