[{"count": 0, "tags": [], "text": "Hi\n\nIf I don't specify <error-page> for code 401 (unauthorized) in web.xml - all\nworks fine. \nBut if I specify it then the server sends the page with code 200 (I see it in\nlog), and browser does not show the name/password popup.\nThat is because org.apache.catalina.valves.ErrorDispatcherValve resets state of\nresponse in method custom.\nI've tried to comment the call out and it works, but I'm not sure that I don't\nneed the reset really. It would be better to call reset and then restore\nstate/message, but javax.servlet.http.HttpServletResponse has no getState() method.\n\nSo, problem is in file org/apache/catalina/valves/ErrorDispatcherValve.java,\nline 384.\n\nHope, you can find a better solution :)", "is_private": false, "id": 18794, "creator": "anatoli@aksoft.net", "time": "2002-07-01T11:22:38Z", "bug_id": 10373, "creation_time": "2002-07-01T11:22:38Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 10373, "attachment_id": null, "id": 18924, "time": "2002-07-03T08:14:22Z", "creator": "remm@apache.org", "creation_time": "2002-07-03T08:14:22Z", "is_private": false, "text": "It is unclear to me what the behavior should be. Since we're doing a forward to\na page, that's why the status is reset to a normal code at the moment."}, {"count": 2, "tags": [], "bug_id": 10373, "attachment_id": null, "id": 25243, "time": "2002-10-27T03:38:12Z", "creator": "chris@mindiq.com", "creation_time": "2002-10-27T03:38:12Z", "is_private": false, "text": "It seems clear to me that the current behavior is broken.  Lots of bugs have \nbeen closed or dismissed over this \"error pages do a RequestDispatcher \nforward\" thing, which seems to be a quirk of the Tomcat implementation, rather \nthan any specific requirement of the specification.  At least, if it is stated \nthere, I can't find it; section 9.8 pretty obviously avoids using the \nword \"forward\" in its description of what happens.  Unless you interpret the \nlast paragraph as applying to all errors, it makes no mention of changing the \nresponse code before serving the error page.\n\nIn any case, a 200 response code is obviously wrong; the only two \ninterpretations that seem tenable are to send the original response code, or \nto change it to 500.  For the sake of usability, I hope you decide on sending \nthe original response code.\n\nI fervently hope that implementation-level decisions don't affect what's \nperceived as the correct behavior in this case.\n\nApparently the correct response code is stored in an attribute \ncalled \"javax.servlet.error.status_code\" as a java.lang.Integer object.  As a \ntemporary work-around, would it be possible to set the correct status code \nagain in a scriptlet at the beginning of the error page servlet or JSP?  I \nhaven't tried this, but it looks promising.  I don't know off-hand whether \nRequestDispatcher.forward commits the response or not; if not, then this could \nwork.\n"}, {"count": 3, "tags": [], "bug_id": 10373, "text": "Oops... I should point out I was reading the 2.3 spec.  2.4 apparently \nclarifies the 500 response code thing by saying it only applies as a default \nif there are no other matches.", "id": 25244, "time": "2002-10-27T04:00:16Z", "creator": "chris@mindiq.com", "creation_time": "2002-10-27T04:00:16Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "funkman@joedog.org", "attachment_id": null, "id": 44554, "creation_time": "2003-09-23T23:55:33Z", "time": "2003-09-23T23:55:33Z", "bug_id": 10373, "text": "In error pages, it is the responsibility of the jsp page author to reset the\nerror code to the correct state. You find this behavior in other containers too.", "is_private": false}, {"count": 5, "tags": [], "creator": "cdsmith@twu.net", "attachment_id": null, "text": "This is a very questionable and unfortunate decision.", "id": 44557, "time": "2003-09-24T02:35:42Z", "bug_id": 10373, "creation_time": "2003-09-24T02:35:42Z", "is_private": false}]