[{"count": 0, "tags": [], "text": "I've been running 2.0.36 on a Windows 2000 box for some time now, using is\nto service SOAP requests using the ISAPI version of the Microsoft SOAP\nToolkit 2.0.  Everything was actually working great, until I put in 2.0.39\nthis morning.  Now, none of my SOAP calls (HTTP POST) work anymore.  In\nfact, in some cases, Apache itself crashes and burns -- restarting itself.\nI haven't built anything, I'm simply running with the Win32 Apache binaries.\n\nThe only real new warning/error message I've seen is this:\n[Wed Jun 19 10:36:50 2002] [warn] [client 192.168.1.3] ISAPI: asynch I/O\nresult HSE_STATUS_PENDING from HttpExtensionProc() is not supported:\nC:/Program Files/Common Files/MSSoap/Binaries/SOAPISAP.dll\n\nI never saw this warning under 2.0.36.  I did see that there were extensive\nchanges made to ISAPI support in 2.0.37, so I suspect something has changed\nthat breaks the 2.0.36 functionality that I was using.", "is_private": false, "id": 18848, "creator": "bbukovics@radiantsystems.com", "time": "2002-07-02T14:33:51Z", "bug_id": 10408, "creation_time": "2002-07-02T14:33:51Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "\n  Try the as-yet-undocumented directive\n\n    ISAPIFakeAsync on \n\n  in order to support a pseudo-async behavior.\n\n  Badly written isapi modules could consume a worker thread forever, without\n  timing out, so it isn't idea just yet.  But please reply if this solves the\n  bug and gets your SOAP .dll working again.", "attachment_id": null, "id": 18850, "creator": "wrowe@apache.org", "time": "2002-07-02T15:07:46Z", "bug_id": 10408, "creation_time": "2002-07-02T15:07:46Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 10408, "attachment_id": null, "id": 18932, "time": "2002-07-03T12:35:29Z", "creator": "bbukovics@radiantsystems.com", "creation_time": "2002-07-03T12:35:29Z", "is_private": false, "text": "Thanks for your help.  Yes, the \"ISAPIFakeAsync on\" appears to have solved my \nproblem, although I have some additional stress testing I want to do.  \n\nMy question at this point is should I go ahead and use this un-documented \ndirective now in a production environment with 2.0.39, or is it safer to wait \nfor an upcoming build where this has had some time to stabalize?  I know that's \nprobably not a fair question, but I'm looking for your opinion on the relative \nstablity of the rewritten mod_isapi in 2.0.39.\n\nThanks again for your help."}, {"count": 3, "tags": [], "text": "\n  That your module worked before was a happy accedent :-)\n\n  Yes, after sufficient stress testing, it is vastly preferable to use the\n  Apache 2.0.39 version of mod_isapi than any prior version (including 1.3).\n\n  Of course I cannot stress the mod_isapi in every way that it will be used\n  by isapi extension authors.  That is what field testing is all about.  I'm\n  glad to hear of your success, and expect that mod_isapi has sufficiently\n  stabilize to use in production, with proper monitoring.  Of course there\n  are no warrenties... if it breaks, you get to keep both pieces :-)\n\n", "attachment_id": null, "id": 19134, "creator": "wrowe@apache.org", "time": "2002-07-08T19:27:05Z", "bug_id": 10408, "creation_time": "2002-07-08T19:27:05Z", "is_private": false}]