[{"attachment_id": null, "tags": [], "creator": "kcarmich@ipapp.com", "text": "My servers are locking up on a regular basis (daily or more), I have added \nenough debug code to trace the lockup to be happening in prefork.c when the a \nprocess has the accept_mutex and the loop that actually does the accept never \nfinishes, all the child processes are stuck waiting for the mutex and the \nprocess with the mutex is stuck at an accept call.\n\nI have added more debug code to identify what results if any are being returned \nfrom the accept call that is not causing that process to bail out of that loop \nand unlock the mutex.\n\nthis is on an DEC Alpha system running Tru64", "count": 0, "id": 19015, "time": "2002-07-04T20:31:24Z", "bug_id": 10488, "creation_time": "2002-07-04T20:31:24Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "kcarmich@ipapp.com", "is_private": false, "count": 1, "id": 19030, "time": "2002-07-05T01:41:58Z", "bug_id": 10488, "creation_time": "2002-07-05T01:41:58Z", "text": "the initial call to accept is blocking on the request. a temporary patch I made \nwhich is working for me is to change the socket to non-blocking just before the \naccept and then switch it back to blocking after the accept call, I have seen a \ncouple of error messages generated that report that the accept would have \nblocked. The server now appears to be stable."}, {"count": 2, "tags": [], "text": "[This is a mass bug update.]\nThis bug reports a problem in an older version of Apache 2.\nCould you please update to the most recent version and see\nif you can reproduce this problem.  If the bug still exists,\nplease update the bug with the latest version number.  If \nthe bug no longer exists, please close the bug report.\n\nSorry for this impersonal response, but we get many more bug\nreports than our volunteers can keep up with.\nThanks for using Apache!", "is_private": false, "id": 24706, "creator": "slive@apache.org", "time": "2002-10-17T02:34:31Z", "bug_id": 10488, "creation_time": "2002-10-17T02:34:31Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "[This is a mass bug update.] [Resolve-20021102]\nNo response from submitter; assuming issue is resolved.\nIf the problem still exists in the lastest version,\nplease reopen this report and update appropriately.", "is_private": false, "bug_id": 10488, "id": 25532, "time": "2002-11-02T20:18:11Z", "creator": "slive@apache.org", "creation_time": "2002-11-02T20:18:11Z", "attachment_id": null}]