[{"count": 0, "tags": [], "text": "The build process fails on kaffe 1.0.7 in the buildstrap since ant requires\nSun's compiler (com.sun.something). Free java virtual machines usually don't\nimplement com.sun.* classes so it would be better if ant checked for other\nsupported compilers like kjc & jikes were available instead of failing because\nit can't find sun's javac.", "attachment_id": null, "id": 19060, "creator": "robilad@yahoo.com", "time": "2002-07-05T13:58:50Z", "bug_id": 10507, "creation_time": "2002-07-05T13:58:50Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 10507, "text": "It is unnecessary to further complicate the bootstrap since it is for \ndevelopment only, plus you won't even be able to compile all classes if you \ndon't have com.sun.*... so you're not going very far in development IMHO...\n", "id": 19502, "time": "2002-07-14T15:22:55Z", "creator": "sbailliez@apache.org", "creation_time": "2002-07-14T15:22:55Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "sbailliez@apache.org", "attachment_id": null, "text": "I forgot to say that I degraded to enhancement...it's in no way major.", "id": 19503, "time": "2002-07-14T15:24:25Z", "bug_id": 10507, "creation_time": "2002-07-14T15:24:25Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 10507, "text": "Stephane,\n\nregarding the \"you can't compile all classes argument without com.sun.*\"\nsrgument: you can't, for example, compile the\nsrc/main/org/apache/tools/ant/taskdefs/optional/sound/AntSoundPlayer.java on a\nstock jdk 1.1 from Sun either, you'd need jmf for the javax.sound imports to\nwork. That shouldn't mean that ant can not be built under jdk 1.1, it only means\nthat some parts should be (and as far as I know are) compiled conditionally,\ndepending on the capabilities of the build platform.\n\nAre there any classes used to bootstrap ant which have to use the undocumented\ncom.sun. classes and interfaces?\n\nRegarding the \"it's for development only\" argument: developping ant under\nalternative platforms can help to expose bugs, as shown by my small patches:\nhttp://archive.covalent.net/jakarta/ant-dev/2002/06/0692.xml\nhttp://archive.covalent.net/jakarta/ant-dev/2002/06/0693.xml\n\nCurrently, I have the bootstrap process failing because bootstrap.sh does not\nspecify all files required to rebuild ant. It relies on the compiler to compile\nfiles from packages that are not passed to it on the command line. That doesn't\nwork with compilers that adhere strictly to the JLS, as it doesn't say what the\ncompiler is supposed to do when a type is used that is not reachable: some\ncompilers try to figure out where these types might be and recompile them (like\njavac does), other like kjc don't, while jikes is somewhere in between.", "id": 19554, "time": "2002-07-15T13:37:59Z", "creator": "robilad@yahoo.com", "creation_time": "2002-07-15T13:37:59Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "I'm fine with this if you can provide a patch for jikes (that works as well \nunder cygwin of course), this should help it work with kjc as well...\n\nI don't think it is a negligible effort though, but I might be wrong.", "attachment_id": null, "id": 19555, "creator": "sbailliez@apache.org", "time": "2002-07-15T13:52:36Z", "bug_id": 10507, "creation_time": "2002-07-15T13:52:36Z", "is_private": false}]