[{"count": 0, "tags": [], "bug_id": 10541, "attachment_id": null, "id": 19099, "time": "2002-07-08T02:18:04Z", "creator": "steve5m@yahoo.com", "creation_time": "2002-07-08T02:18:04Z", "is_private": false, "text": "The Servlet 2.3 API spec on pages 186 (bottom) and 189 (top)\nstates that if a Servlet (and therefore a JSP also) is using a buffer\nand does not fill up\nthe buffer, (and is not using Chunked transfer encoding)\nthe container should automatically set the content-length header\nif the servlet itself doesn't do it.\n\nThis is really more important for JSP's, since custom Servlet's generally\nset the content length themselves and don't call response.setBuffer(size)\nanyway. JSP's on the other hand, are buffered by default (according to\nspec) and really benefit from having the container set the content length\nheader for them because they basically never bother to do this themselves.\n\nAnd the reason (in case you need one) that having the\ncontent length header set is important is that it effects performance.\nWeb browsers, giving a content length, can handle the response more\nefficently, and the server can also use persistent connections\n(keep-alive), which is impossible w/o content length headers.\n\nSo from my testing, Tomcat 4.0.4 doesn't ever set the content length\nheader automaticaly -- actually I should say I've tested a lot more\nwith JSP's than plain Servlets, but I assume the piece of code that\nwould do this is shared by both.\n\nThanks."}, {"count": 1, "tags": [], "bug_id": 10541, "attachment_id": null, "id": 19105, "time": "2002-07-08T08:36:37Z", "creator": "remm@apache.org", "creation_time": "2002-07-08T08:36:37Z", "is_private": false, "text": "Since both work fine and work transparently for a non broken HTTP/1.1 client,\nthe spec has no buisness specifying how the transport layer should behave. Also,\na number of intermediate protocols, like AJP, may not be able/willing to\nimplement the spec requirements.\n\nI think the spec is broken here.\n\nCoyote HTTP/1.1 does implement this requirement in some specific cases (many are\nnot implementable); the old HTTP connector will not be modified to fix it."}, {"count": 2, "tags": [], "bug_id": 10541, "text": "Please read the following comments - if you choose to set the bug\nback to \"resolved wontfix\" I won't continue to reopen, but please\ndo consider the following first: (thanks)\n\n1) The spec is not specifying how the transport layer behaves.\nThe spec is saying that asking a buffer to be used (even if used\nby default as with JSP's) also includes\nasking the container to set the content length for the servlet/jsp.\nIn other words, you can think if it in a similar manner to the actual\nservlet saying \"please call setContentLength()\" for me.\n\n2) HTTP 1.1 clearly does strongly encourage the use of the\nContent-length header (or chunked transfer encoding instead)\nwhenever possible -- see sections 4.4, 10.4.12, and 14.14 in RFC 2616.\n\n3) I don't see why you would need to change connectors to support this.\nNormally, if a servlet programatically sets the content length,\nthe AJP connector passes this header along fine.\nIf the servlet sets a buffer size, this is in fact asking the servlet\ncontainer to set the content length for it -- at this point nothing\nhas yet been passed to the connector, so there is no reason for the\nconnector to know the difference between the two situations.\n(let me know if I'm not explaining this clearly).\n\n4) Recent versions of Commercial servlet containers (e.g. BEA Weblogic)\nDO take care\nof the content length in the buffered situation, as the spec says.\nWhile this doesn't prove that what the spec says is the right thing to do,\nI think it makes a great deal of sense.\nI do hope you might re-consider adding this feature to Tomcat.\n\nAt any rate, thanks for all the great work you guys do!", "id": 19128, "time": "2002-07-08T18:40:37Z", "creator": "steve5m@yahoo.com", "creation_time": "2002-07-08T18:40:37Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 10541, "text": "As I said, this won't be fixed in the old HTTP connector.", "id": 19129, "time": "2002-07-08T18:48:04Z", "creator": "remm@apache.org", "creation_time": "2002-07-08T18:48:04Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 10541, "text": "I'll reopen the bug, since I also seem to have an itch with it. \nThe major problem is that it's hard to know ( from connector side ) when\nyou have this case, and the END will follow imediately after the first\nchunk. \nThe only way to detect it is higher - and distinguish between a SEND that\nhappens normally and the SEND+END that happens when the JSP/servlet\nfinishes the request and the container is automatically flushing the buffer.\n\nI don't see any other solution, at least at container level - you can't guess\nthat END will follow.\n\nThe problem is finding the exact point where the flushing happens.\n\nRemy - if you want to close this, please mark it as REMIND or LATER, I'll\nfix it ( if I figure out how :-)", "id": 24832, "time": "2002-10-17T22:12:16Z", "creator": "cmanolache@yahoo.com", "creation_time": "2002-10-17T22:12:16Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 24849, "time": "2002-10-18T07:58:35Z", "bug_id": 10541, "creation_time": "2002-10-18T07:58:35Z", "text": "I don't understand. Coyote HTTP/1.1 handles your SEND + END case correctly.\nHowever, it of course can't do anything if the servlet decides to flush. The\ncode which does it is in the o.a.coyote.tomcat4.OutputBuffer class, so it's\nsupposed to work the same with HTTP and AJP.\n\nThere's no bug left to fix here ...."}, {"count": 6, "tags": [], "text": "JSPs don't work yet because they do flush() first. \n\n", "attachment_id": null, "id": 25060, "creator": "cmanolache@yahoo.com", "time": "2002-10-23T17:50:55Z", "bug_id": 10541, "creation_time": "2002-10-23T17:50:55Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 10541, "attachment_id": null, "id": 72732, "time": "2005-03-20T23:15:51Z", "creator": "markt@apache.org", "creation_time": "2005-03-20T23:15:51Z", "is_private": false, "text": "Costin - I has been rather a long time since there has been any activity on this\nbug. Did you ever figure out a way to fix it?"}, {"count": 8, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "The content length is set for JSPs in the latest 4.1.x code and I suspect it has\nbeen like this for some time.", "id": 83927, "time": "2005-12-22T21:00:58Z", "bug_id": 10541, "creation_time": "2005-12-22T21:00:58Z", "attachment_id": null}]