[{"count": 0, "tags": [], "bug_id": 10556, "is_private": false, "text": "It would be desirable to be able to output image/pnm as well as the other format types when rasterizing SVG images. PNM output formats would then allow a bunch of PNM-type tools to convert and process generated images, rather than exporting in PNG format and then having to do a PNG2PNM translation", "id": 19121, "time": "2002-07-08T15:56:10Z", "creator": "Alex.Blewitt@ioshq.com", "creation_time": "2002-07-08T15:56:10Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 10556, "attachment_id": null, "is_private": false, "id": 39673, "time": "2003-06-30T15:29:29Z", "creator": "vincent.hardy@sun.com", "creation_time": "2003-06-30T15:29:29Z", "text": "Alex,\n\nI am not very familiar with PNM, but it seems that there are several formats\nthat correspond: PBM, PGM and PPM. Which one did you mean?\n\nYour report is not a bug but a request for extension, so I modified the\ncomponent accordingly.\n\nRegards,\nVincent."}, {"count": 2, "tags": [], "text": "PNM is, I think, a supertype of the lot. PNM is Portable aNyMap, which encompasses either PBM \n(Portable BitMap), PPM (Portable PixMap) and PGM (Portable GreyMap). So there isn't a file format for \nPNM per-se, but rather it is one of those files.\n\nI seem to think the reason there are different formats is that some image types require (or produce) \nspecifically black'n'white images (such as faxes). However, for colour images (which you'd have to \nassume would be produced by the rasterizer) you'd probably want to use PPM files.\n\nPBM: 1 bit per pixel (black/white) (P4)\nPGM: 16 bit per pixel grayscale (P5)\nPPM: 16 bit per pixel colour (P6)\n\nBasically they are the same format files though, with just a different magic number being used to \nidentify them (P4 is the magic number for PBM files, P5 for PGM and P6 for PPM).\n\nOn Unix systems, you can do 'man pbm' 'man pgm' and 'man ppm' for more information about the \nfile formats. A google search will also provide some information about it.\n\nMost of the pnm tools will take in any one of the above formats to process. However, some tools \n(like pbmtog3) only take a black-n-white image since G3 can only handle black and white.\n\nSo, I guess that ppm would be the most useful output format, but there might be reasons for \nwanting pbm output if the file is known to be just greyscale.", "attachment_id": null, "id": 39678, "creator": "alex_blewitt@yahoo.com", "time": "2003-06-30T15:44:44Z", "bug_id": 10556, "creation_time": "2003-06-30T15:44:44Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 10556, "attachment_id": null, "text": "This cannot be done for 1.5.", "id": 40169, "time": "2003-07-08T14:16:28Z", "creator": "vincent.hardy@sun.com", "creation_time": "2003-07-08T14:16:28Z", "is_private": false}]