[{"count": 0, "tags": [], "creator": "daveho@cs.umd.edu", "attachment_id": null, "id": 19141, "time": "2002-07-08T21:50:25Z", "bug_id": 10568, "creation_time": "2002-07-08T21:50:25Z", "is_private": false, "text": "This bug is in org.apache.jasper.servlet.JspServlet revision 1.28 from CVS\n(current as of July 8, 2002).  It's also in tomcat 4.0.3, which is what I'm running.\n\nThe loadJSP() method has the following code:\n\n URL [] urls = new URL[1];\n File outputDir = new File(normalize(ctxt.getOutputDir()));\n urls[0] = outputDir.toURL();\n jsw.loader = new JasperLoader(urls,ctxt.getServletClassName(),\n\t\t\t      parentClassLoader,\n\t\t\t      permissionCollection,\n\t\t\t      codeSource);\n\nThe problem is with the outputDir object, which is a java.io.File.  This object\ndoes not know that it represents a directory, and if you convert it to a string,\nit will not have a trailing separator character.  When a URL is created from\nthis file, it will not have a trailing separator character in its external form.\n\nIf you look at the documentation for URLClassLoader (which JasperLoader is a\nsubclass of), it says that \n\n\"Any URL that ends with a '/' is assumed to refer to a directory.  Otherwise,\nthe URL is assumed to refer to a JAR file which will be downloaded and opened as\nneeded.\"\n\n(This is a direct quote from the Sun JDK 1.4 API documentation.)\n\nSo, when outputDir is converted to a URL, it is reasonable to assume that it\nwill be treated as a jar file rather than a filesystem directory, which is\nobviously not what is intended.\n\nI assume that this bug has not manifested before because the Sun JDKs do not\nappear to implement the behavior that is described in the API documentation;\npresumably, if the base URL does not appear to be a jar file, the Sun\nimplementation will try to treat it as a directory.  However, from what I can\ntell from reading the API documentation, this extra behavior is not required.\n\nIn case you're wondering why I'm reporting this as a bug, I'm using a virtual\nmachine which does not use the Sun libraries.  The JasperLoader fails to load a\ncompiled JSP because it thinks the directory it's in is a jar file.\n\nTo fix this problem, I think the use of the File object should be eliminated. \nIt would be sufficient to create the URL as follows:\n\n  urls[0] = new URL(\"file:\" + normalize(ctxt.getOutputDir()));\n\nThis will preserve the trailing slash in the output directory path."}, {"count": 1, "tags": [], "bug_id": 10568, "text": "This part of jasper 2 has been revamped, and the part of the source you\nreferenced to is no longer there.  As far as I can tell, the url for the loader\nseems to be working as expected.", "id": 19823, "time": "2002-07-18T23:05:45Z", "creator": "kin-man.chung@sun.com", "creation_time": "2002-07-18T23:05:45Z", "is_private": false, "attachment_id": null}]