[{"count": 0, "tags": [], "bug_id": 10652, "attachment_id": null, "text": "I would like to propose that Ant should be enhanced with webdav features. \nIn a first step, it might be nice to have all ftp-like features available.\nUltimately, of course, one might also think about including DeltaV and/or DASL \nsupport.\n\nSince a stable Java Webdav Client API is already available as part of the Slide \nproject, it might not be all too complex to add webdav support to ant.\n\nWhat do you think?", "id": 19256, "time": "2002-07-10T15:33:06Z", "creator": "wtff@freenet.de", "creation_time": "2002-07-10T15:33:06Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 10652, "attachment_id": null, "id": 19259, "time": "2002-07-10T15:50:45Z", "creator": "stevel@apache.org", "creation_time": "2002-07-10T15:50:45Z", "is_private": false, "text": "I agree, webdav would transform deployment, and work well with Subversion.  \n\nFeel free to write it :)\n\nIt might be better to add the tasks to slide though, that being the bit of code\nit would have a tightest coupling to. \n\nNote that MacOS X, linux and WinXP all support DAV filesystems; once you mount a\nremote drive you can use <copy> to deploy. But a portable solution is preferable,"}, {"count": 2, "tags": [], "bug_id": 10652, "attachment_id": null, "text": ">>Note that MacOS X, linux and WinXP all support DAV filesystems; \n>>once you mount a remote drive you can use <copy> to deploy\n\nWOOOW! I knew that I can create web folders within the windows file explorer, \nbut can you tell me how I can address a webfolder from within the <copy> task?\nA Windows webfolder doesn't seem to have a driveletter and I don't knwo how to \ncreate a network drive mapping on a webfolder.\n\nBy the way: I was just eager to know whether a webdav support was already \nplanned and whether you guys appreciate the idea. I would so much like to help \ncoding things for so many opensource projects, including ant if I only found \nthe time. I would like to add webdav features to ant, but anything that I would \ncraft or anything that might be coded within slide could then only be added to \nant via task-defs, right? Or would you then take the slide-webdav tasks into \nyour optional package?", "id": 19263, "time": "2002-07-10T17:13:10Z", "creator": "wtff@freenet.de", "creation_time": "2002-07-10T17:13:10Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jakarta@ehatchersolutions.com", "text": "There was, and may still be, Ant tasks within the Slide codebase.  Have a look \ndeep there to find them.  I agree that WebDAV would be a nice addition, and \nsome work has already been done for a virtual filesystem layer which would \nencapsulate WebDAV too.\n\nAs for mapping a network drive to use <copy>: you can use WebDrive on Windows \nto do this, but not out of the box Windows, that I know of.", "id": 19265, "time": "2002-07-10T17:27:33Z", "bug_id": 10652, "creation_time": "2002-07-10T17:27:33Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 10652, "text": "erik says\n> you can use WebDrive on Windows to do this, but not out of the box Windows,\nthat I know of.\n\nsteve says: erik, not read all of ch18, \"Deployment\", in Hatcher and Loughran yet?\n\n\nhttp://msdn.microsoft.com/library/en-us/appendix/hh/appendix/enhancements5_33oz.asp\n\nnet use http://www.msnusers.com/fooname/files /u:yourpassportaccount@hotmail.com\n\nnote that I have not tested this yet. which I should do, dangerous to take the\nMS word for anything, n'est-quoi.\n\nNB, dont worry about taskdef importing of slide tasks in a slide.jar; you can\nbulk import a set of tasks from a single jar with taskdef, so it would only be a\noneliner to pull in a suite of webdav support. And we will point to the tasks\nfrom the ant pages. ", "id": 19271, "time": "2002-07-10T18:44:54Z", "creator": "stevel@apache.org", "creation_time": "2002-07-10T18:44:54Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 72589, "time": "2005-03-17T15:10:36Z", "bug_id": 10652, "creation_time": "2005-03-17T15:10:36Z", "is_private": false, "text": "support is provided by slide and/or commons-vfs (Jakarta Commons).  Since Ant\nwouldn't implement WebDAV itself but use Slide, the tasks are best kept with Slide\nIMHO.\n"}]