[{"count": 0, "tags": [], "bug_id": 10672, "attachment_id": null, "text": "In Ant 1.4.1, the keystore attribute to the signjar could be a URL, however, in\n1.5, this ability has been removed.  We were using this feature to sign jar\nfiles for signing release builds generically amongst platforms.  Is there a\nreason it has been removed?", "id": 19298, "time": "2002-07-11T04:04:03Z", "creator": "etheriau@accis.edu", "creation_time": "2002-07-11T04:04:03Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 10672, "attachment_id": null, "text": "What he said.  The fact that this doesn't work is *really* annoying and forces\nme to have to exec the JDK jarsigner, which is sort of silly.", "id": 21190, "time": "2002-08-17T02:11:25Z", "creator": "tara@bluemartini.com", "creation_time": "2002-08-17T02:11:25Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 10672, "attachment_id": null, "text": "Okay, we had a look at the code.  It appears at some point somebody went through\nand changed all the input attributes for the signjar task from strings to file\nobjects, which seems a likely culprit for the weird behavior we're seeing. \nWe're going to pull source and rebuild with it switched back to a string to see\nif that fixes the problem.", "id": 21568, "time": "2002-08-23T03:01:32Z", "creator": "tara@bluemartini.com", "creation_time": "2002-08-23T03:01:32Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 10672, "attachment_id": null, "id": 29513, "time": "2003-01-16T11:10:20Z", "creator": "conor@apache.org", "creation_time": "2003-01-16T11:10:20Z", "is_private": false, "text": "This has been reverted to a string. The behaviour is not quite like 1.4.1 in\nthat the code will attempt to resolve the string a s a file relative to the\nproject's basedir. If the resulting file does not exist, it is assumed to be a\nURL and passed directly. Hopefully this is the best of both worlds.\n\nI'm marking this as targetted for 1.6 for now but it may be merged into 1.5.2 if\ntime permits."}]