[{"count": 0, "tags": [], "text": "Hi,\n\nIn the FAQ of Xerces-J, it says that the parser supports a lot \nof encodings, including UTF-16.  But after I used version 1.3.0\nand 1.3.1 of the parser, I found that the encoding was not \nsupported.  Could someone please check that?  Thanks a lot.\n\nPeter Qi\n\nPS:  The following is the reply from Andy Clark <andyc@apache.org> \nabout the bug:\n\nPeter Qi wrote:\n> After I had the attached two files passed.  The following error\n> messages were generated:\n\nOkay, now I can reproduce your error. I think that this is just\na missing mapping in the MIME2Java table used by the parser to\ntranslate IANA encoding names into Java encoding names. Please\nopen a bug to this affect using Bugzilla at:\n\n  http://nagoya.apache.org/bugzilla/\n\nIn fact, you should put in the bug report that all of the\ndefined IANA mappings should be added to the mapping table --\nat least the ones where decoders are present in Java. The URL\nto the list of encodings (and their aliases) is at:\n\n  http://ww.isi.edu/in-notes/iana/assignments/character-sets\n\nPlease realize that bugs get fixed faster when *you* fix the\nbug and post the patch to the mailing list (as an file\nattachment and not inline).\n\nIncidentally, your attached XML document wasn't even encoded\nin UTF-16. It was just straight ASCII which would produce an\nerror separate from the one that you saw. Please make sure\nthat you generate a truly UTF-16 file if you're going to set\nthe encoding in the XMLDecl line.\n\nSome other points:\n\n1) Instead of being so specific about the endian-ness of your\n   document (because the parser will determine that by either\n   the BOM or the first few bytes in the file), just use\n   \"UTF-16\" as your encoding name. (Although, I made this\n   change and still get the same error. Strange...)\n2) Never put in a link to your DTD like that. Always use either\n   a relative or absolute URI and use an EntityResolver, if\n   needed, to locate the DTD. Otherwise your documents are not\n   portable.\n\n-- \nAndy Clark * IBM, TRL - Japan * andyc@apache.org", "is_private": false, "bug_id": 1070, "id": 1513, "time": "2001-03-21T11:25:52Z", "creator": "Peter.Qi@hummingbird.com", "creation_time": "2001-03-21T11:25:52Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "Peter.Qi@hummingbird.com", "is_private": false, "count": 1, "id": 1530, "time": "2001-03-21T12:43:37Z", "bug_id": 1070, "creation_time": "2001-03-21T12:43:37Z", "text": "The URL to the list of encodings (and their aliases) is at:\n\nhttp://www.isi.edu/in-notes/iana/assignments/character-sets"}, {"attachment_id": null, "tags": [], "creator": "neilg@ca.ibm.com", "is_private": false, "count": 2, "id": 3175, "time": "2001-06-21T11:50:12Z", "bug_id": 1070, "creation_time": "2001-06-21T11:50:12Z", "text": "We should now support all the IANA encoding names which have clear mappings to \nJava encodings.  "}]