[{"count": 0, "tags": [], "bug_id": 10759, "attachment_id": null, "id": 19450, "time": "2002-07-12T20:43:42Z", "creator": "gerein@gmx.net", "creation_time": "2002-07-12T20:43:42Z", "is_private": false, "text": "After running for a month, Tomcat crashed without reason with the following  output:  Unexpected Signal : 11 occurred at PC=0x4040890E  Function=at_call__C6PcDesc+0x6  Library=/opt/j2sdk1.4.0/jre/lib/i386/client/libjvm.so    Current Java thread:          at java.lang.Throwable.fillInStackTrace(Native Method)          at java.lang.Throwable.<init>(Throwable.java:180)          at java.lang.Exception.<init>(Exception.java:29)          at java.lang.RuntimeException.<init>(RuntimeException.java:32)          at java.lang.NullPointerException.<init>(NullPointerException.java:36)  [error occured during error reporting]      ****************  Another exception has been detected while we were handling last error.  Dumping information about last error:  ERROR REPORT FILE = (N/A)  PC                = 0x0x4040890e  SIGNAL            = 11  FUNCTION NAME     = at_call__C6PcDesc  OFFSET            = 0x6  LIBRARY NAME      = /opt/j2sdk1.4.0/jre/lib/i386/client/libjvm.so  Please check ERROR REPORT FILE for further information, if there is any.  Good bye.    This happened with Tomcat 4.0.3 and Sun JDK 1.4.0, but I had a similar crash  with JDK 1.3.1 and an older Tomcat4-Version some time ago (no log  unfortunately).    It looks like the error happened in the JVM, but it's very unfortunate, that  Tomcat and therefore my web-app die silently on it. The should at least be a automatic restart if the JVM reports an error, so that the downtime is minimized."}, {"count": 1, "tags": [], "bug_id": 10759, "attachment_id": null, "id": 19462, "time": "2002-07-12T23:24:20Z", "creator": "remm@apache.org", "creation_time": "2002-07-12T23:24:20Z", "is_private": false, "text": "As usual, VM crashes are not TC bugs, but JVM bugs. Sometimes, this can be\ntriggered by a Tomcat bug, but since this is usually not reproducable, you'll\nhave to isolate the bug for us.\n\nThe automatic restart is a feature that will hopefully eventually be in the\nlauncher which is developed as part of the commons-daemon project, and we're\nhoping to use it for Tomcat 5.0.\n\nIn the meantime, there's not much that can be done other that having some\nscripts to periodically check that the server is still alive, and restart it\nwhen needed."}]