[{"count": 0, "text": "We are running some JUnit tests.  We are also using the JUnitReport task to \ngenerate an xml based html page.  If we place a System.out.println inside a \ntestXXX() method, it doesn't get parsed by the XMLJUnitResultFormatter and \nhence it cannot be rendered inside the html page report.  This is important if \none needs to print a short description of each testcase and what was actually \ndone.\n\nThanks!", "bug_id": 10765, "is_private": false, "id": 19461, "time": "2002-07-12T23:20:21Z", "creator": "jtmolecule@hotmail.com", "creation_time": "2002-07-12T23:20:21Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "creator": "sbailliez@apache.org", "attachment_id": null, "is_private": false, "id": 19505, "time": "2002-07-14T15:52:47Z", "bug_id": 10765, "creation_time": "2002-07-14T15:52:47Z", "text": "I don't get it. AFAIK the output is captured by the formatters and for the xml \none the content is stored in the element named 'system-err' and 'system-out' \nin a CDATA section.\n\nnb: FWIW I don't think it is good practice to output the description of the \ntest...just make your method testXXXX meaningful. Plus the output can hardly \nbe associated to a test anyway. IMHO output of tests should be 'zero'. \nAbsolutely no one will read the output of hundred or thousands of tests."}, {"count": 2, "tags": [], "creator": "stevel@apache.org", "attachment_id": null, "text": "actually sometimes it is useful to parse the results of failed tests.\n\nexample, httpunit tests expects to get something like 'happy' in the response of\na URL, but instead it gets some other text string back. My httpunit test code\nprints out the entire response for diagnostics, so that I can see what the\nserver sent back...\n\nA meaninful test name is important, but not enough. \n\nIMO this should be downgraded to enhancement, the enhancement being changes to\nthe XSLT file to include the output results. ", "id": 19507, "time": "2002-07-14T19:04:08Z", "bug_id": 10765, "creation_time": "2002-07-14T19:04:08Z", "is_private": false}, {"count": 3, "tags": [], "creator": "sbailliez@apache.org", "attachment_id": null, "id": 19508, "time": "2002-07-14T19:15:36Z", "bug_id": 10765, "creation_time": "2002-07-14T19:15:36Z", "is_private": false, "text": "Ok, did not get that bug report was related to the xsl not using the output \nfor the html report, there was a talk about parsing, formatter etc that has \nnot much to do to me with the problem.\n\nThat said I'm partly convinced...the failed test just tell you that it \nfailed... you should not need some print..this is what the debugger is for. :)\n\nIt's also that in the current state all you can do is to add a page with the \noutput of all tests...you will barely be able to associate it to a given \ntestcase unless you add some print here and there in the test methods...\n\nChanging the summary to something more meaningful to me."}, {"count": 4, "tags": [], "text": "I'm the original submitter.  We are writing junit tests to perform some \ntestcases, and if it's successful, it would be more informative to know which \nsuccessful test cases were performed, rather than just seeing the \nword \"success\" on the html page.  That way, there can be an audit on which \ntests were performed without looking at the code.  At least with the fail\n(String) and assertEquals(String, *, *), we can print something out to say what \nfailed, but if it's successful, there is no trail on which ones became \nsuccessful.\n\nThe std-out and std-err is for the whole page and not for individual testXXX \nmethods.  Besides, I tried have a System.out.println() statement, and nothing \nshowed up on the html page.\n\nThanks for your feedbacks.", "is_private": false, "id": 19530, "creator": "jtmolecule@hotmail.com", "time": "2002-07-15T04:12:17Z", "bug_id": 10765, "creation_time": "2002-07-15T04:12:17Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "Nothing showed up on the report because the information is not used by the xsl.\nHowever you can customize the stylesheet so that it does it.", "attachment_id": null, "id": 19533, "creator": "sbailliez@apache.org", "time": "2002-07-15T05:28:54Z", "bug_id": 10765, "creation_time": "2002-07-15T05:28:54Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 10765, "text": "Closing this bug; stdout and stderr are displayed in junit reports now.", "count": 6, "id": 70516, "time": "2005-02-04T21:37:11Z", "creator": "stevel@apache.org", "creation_time": "2005-02-04T21:37:11Z", "is_private": false}]