[{"attachment_id": null, "tags": [], "bug_id": 10844, "text": "A few times on several boxes I've added a new virtual host and setup logging for\nthat vhost with the logging target in a directory that doesn't exist.  I would\nthen do something like apachectl graceful or restart and apache would choke.\n\nI think that httpd -t and -T should check if the directory of the target log\nexist , if not error out and say something useful.  I know in the error_log it\nsays: [error] (2)No such file or directory: could not open transfer log file\n<logfile> if the transfer log doesn't exist, but it dies with the following when\nthe error log doesn't exist: fopen: No such file or directory\nhttpd: could not open error log file <error log>.\n\nI can't imagine that I'm the first person that this has happened to.  Is there\nany reason this hasn't been added already, or is there something I'm missing?", "count": 0, "id": 19574, "time": "2002-07-15T21:12:13Z", "creator": "kyle@ptszone.com", "creation_time": "2002-07-15T21:12:13Z", "is_private": false}, {"count": 1, "tags": [], "creator": "rbb@apache.org", "attachment_id": null, "id": 19575, "time": "2002-07-15T21:17:47Z", "bug_id": 10844, "creation_time": "2002-07-15T21:17:47Z", "is_private": false, "text": "httpd -t is to test for a syntactically correct configuration file.  While it\nwould be possible to add checks for the logging directory, that is just one\nexample of a semantic problem that will not be caught by httpd -t.  Rather than\ntry to shoe-horn a semantic check into an option that is only meant to check for\nsyntacic errors, I am marking this bug WONTFIX.  Adding the check described\nwon't gaurantee a valid config file and will lead to a false sense of security\nafter running httpd -t.\n\nThe easiest way to determine if the Configuration file is Sematically correct,\nis to try to start the server.  If you are concerned about it conflicting with\nan existing server, you can use -C \"Port 8080\" to define the port that you want\nthe new server to listen on."}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "While everything you say is correct, Ryan, we do already check for DocumentRoot\nexisting in httpd -t, don't we?  It seems like checking for ErrorDocument might\nnot be a bad idea.  Just my opinion.", "id": 19608, "time": "2002-07-16T14:17:13Z", "bug_id": 10844, "creation_time": "2002-07-16T14:17:13Z", "is_private": false}]