[{"count": 0, "tags": [], "bug_id": 10932, "attachment_id": null, "is_private": false, "id": 19736, "time": "2002-07-18T02:23:45Z", "creator": "belg4mit@pthbb.org", "creation_time": "2002-07-18T02:23:45Z", "text": "I've googled, and fiddled to no ends. I have what I believe to\nbe a simple goal. I wish to:\n\n        <LocationMatch !\"^/bar\">\n                ProxyPass http://somehost\n        </LocationMatch>\n\n        <Location /bar>\n                handler\n        </Location>\n\nThe specific regexp used doesn't matter. the instant I add !\nwhich is supposed\nto be the negation character /bar is passed to the handler\nproperly, but\nanything else is not proxied but served from the local system\ninstead.\n\nSo to reiterate what is desired:\n        everything but /bar goes to somehost\n        /bar is handled locally"}, {"count": 1, "tags": [], "bug_id": 10932, "attachment_id": null, "text": "I don't believe that the LocationMatch/DirectoryMatch/FilesMatch sections\nallow negatives.  The \"!\" syntax is certainly not documented anywhere.\n\nI guess we could consider this bug report a request for such ability.  I have\nseen it requested elsewhere, and it shouldn't be that difficult to provide.\n\nAs far as your particular problem, it should be easy to get around using something\nlike\nRewriteEngine On\nRewriteCond %{REQUEST_URI} !^/bar\nRewriteRule / http://somehost/ [P]", "id": 19776, "time": "2002-07-18T15:11:11Z", "creator": "slive@apache.org", "creation_time": "2002-07-18T15:11:11Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 10932, "text": "It's possible support for such does not exist,\nI found examples of it out there on the web\nthough. However \"regexp\" is a nebulous term,\nand I was unable to find anything specific in\nthe documentation concerning exactly what\nregexp syntax was supported... (although\nfrom looking at the source tree it seems pcre\nis used, in which case it seems negation would\nbe extraordinarily easy)\n\nThe rewriterule while one means of a workaround,\ndoes not emulate the desired behavior. I am\ntrying to proxypass from somehost such that\nthe content appears to come from this host.\n(I'm actually proxying an apache 1.3 server\nbound to 127.0.0.1).\n\nI did think of workaround, which I have not\ntests, that is more of a hack and hideous.\n\n\"/[^b][^a][^r]\"", "count": 2, "id": 19824, "time": "2002-07-18T23:31:25Z", "creator": "belg4mit@pthbb.org", "creation_time": "2002-07-18T23:31:25Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 10932, "attachment_id": null, "id": 19864, "time": "2002-07-19T17:30:06Z", "creator": "slive@apache.org", "creation_time": "2002-07-19T17:30:06Z", "is_private": false, "text": "The RewriteRule does work.  Please look at the docs for RewriteRule with \nspecific reference to the \"P\" option which stands for Proxy."}, {"count": 4, "tags": [], "text": "Heh, so does it. Sorry about that.\n(Though it appears the last line needs to be\n    RewriteRule /(.*) http://localhost/$1 [P]\n)", "is_private": false, "bug_id": 10932, "id": 19870, "time": "2002-07-19T19:29:15Z", "creator": "belg4mit@pthbb.org", "creation_time": "2002-07-19T19:29:15Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "nd@perlig.de", "text": "Just for the records:\n\n<LocationMatch \"^/(?!bar)\">\n\nworks, too (since httpd-2), because of the advantages of pcre. The syntax is\ndescribed and explained in perldoc perlre. (which is online at perldoc.com).\nNo need to duplicate that manual stuff within the apache docs.\n\nThanks for using Apache!", "id": 32346, "time": "2003-03-03T16:05:07Z", "bug_id": 10932, "creation_time": "2003-03-03T16:05:07Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "text": "I'm surprised this isn't considered a useful enhancement. Negative matching is an integral part of \nregular expressions, and the fact that it's missing from the *Match directives is, to me, a serious \noversight. It seems very backwards to me to suggest that, since it can be worked around using other \nfeatures (without having identical functionality), this is not a useful feature to include.\n\nI would like to petition the devs to reconsider adding this functionality. If there is some reason I have \noverlooked that it would be dangerous or impractical for this to be added, I am very open to feedback.\n\nFor reference, here are a few threads I found on Google, some of which express the same incredulity \nthat this feature is not present, some of which are simply pleas for help on how to accomplish the same \nfunctionality. Note that in most, the negative assertion workaround is the recommended solution.\n\nhttp://mathforum.org/epigone/modperl/lulsmoxkhi\nhttp://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg145973.html\nhttp://www.apache-httpd.com/msg/5514.html\nhttp://www.issociate.de/board/post/167026/Exclude_images_from_match.html", "attachment_id": null, "bug_id": 10932, "id": 71441, "time": "2005-02-23T23:19:41Z", "creator": "morgan@doocy.net", "creation_time": "2005-02-23T23:19:41Z", "is_private": false}, {"count": 7, "tags": [], "creator": "morgan@doocy.net", "text": "I found another resource containing a quote which sums up the lack of negative matching pretty well:\n\n\"This option was added for two reasons - firstly that the <LocationMatch> directive is not allowed in a \n.htaccess file, and secondly that the built in Apache regular expressions are not terribly powerful (for \nexample they cannot do negative matches).\"\n\nSource: http://www.axkit.org/docs/guide.dkb?section=7", "id": 71442, "time": "2005-02-23T23:43:27Z", "bug_id": 10932, "creation_time": "2005-02-23T23:43:27Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 10932, "text": "It would be spectacular to see a simple, no-nonsense negation.  From\nwhat I understand after skimming the PCRE man page, this has to be\nexternal to the regexp because of the nature of regexp matching.\nProbably why it was never implemented, because it's extra work.  Maybe\nother things needed more attention so this was put aside, then\nforgotten about.\n\nFYI for those searching for answers, the \"^/(?!bar)\" syntax is referred\nto as a negative assertion.  It has some subtle syntax and can be a bit\nconfusing for the novice PCRE user even in a simple case, which may be\nmany of the admin running Apache.  I'm not too familiar with how nice it\nplays with more complex regular expressions.\n\nIn the config file, it's difficult if not impossible to specify each\nnegative Match rule for every possible negative Match condition when the\nnegative results may change frequently and at random, yet the positive\nMatch are few and static.  These cases seem to be very common.  If a\nregexp does not match the right answer, tell me it's the wrong answer.\nI won't sit and try to pre-define every conceivable wrong answer in the\nuniverse, when there are maybe 3-4 right answers that I care about.\nThat is computationally wasteful and redundant.\n\nLocationMatch is part of the core.  What if I don't want to use\nmod_rewrite for every tiny thing that isn't properly implemented in the\ncore?  I want to keep the server lean.  It's a shame to have to include\nanother module to do something that LocationMatch (from the view of a\nsysadmin) should be able to handle within it's own syntax.  It's 95%\nthere already when the PCRE returns and finds that there was no match.\nThe PCRE function returns -1?  So if there's a \"!\" negation character,\ncheck for \"-1\" return, and if so valued, perform the action specified.\n\nI'd have to look into the code and research more to see if there were\nany patches or to generate one.  I'm surprised that in all this time\nthere have been no patches.  Maybe it's uglier than I think in there.\n", "id": 73145, "time": "2005-03-31T11:54:20Z", "creator": "warp-9.9@usa.net", "creation_time": "2005-03-31T11:54:20Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 10932, "text": "Closing bug report due to inactivity and the issue is rather cosmetic.\nIf more information appears later, please re-open the bug.", "count": 9, "id": 104194, "time": "2007-06-08T06:46:41Z", "creator": "davi@apache.org", "creation_time": "2007-06-08T06:46:41Z", "is_private": false}]