[{"count": 0, "tags": [], "text": "Hi,\n\nI have discovered some memory leaks when creating dynamic reports with dynamic \n(gif) image files.\n\nThe problem is that image files seem to be cached and not released anymore, \neven when removing the fop driver object or calling the driver.reset() method.\n\nSince we are making dynamic reports and all charts in it are stored with unique \nfilenames (to prevent concurrency problems between users), every created report \nkeeps about 40 kb of memory in memory. After a few days, this results in tomcat \nto crash because the system gets out of memory (with heap size of 256 MB).\n\nWhen I always use the same GIF filenames and start a one user test repeatingly \nmaking reports for one user, one after the other, there is no memory leak. This \nmeans that the memory leak is caused by caching the image files and never \nreleasing them. When the same filenames are reused over and over again, the \ncached image files are overwritten for every new report.\n\nAfter investigating the FOP source code (0.20.4) I discovered at least one \nproblem in the FopImageFactory.java class:\n\nThere is a private static Hashtable \"m_urlMap\" that caches all image URLs but \nnever releases these URLs. Since it is a static map, the URLs are not even \nreleased after removing the fop objects from memory.\n\nWhen I solved this problem on my PC (by clearing the m_urlMap after calling the \nDriver.Reset method) there is still memory leak of about 30 kb left.\n\nDoes anyone know about this problem and is there a possible work around (except \nfrom reusing the filenames)?\n\nThanks,\n\nDominique De Ridder", "is_private": false, "bug_id": 10941, "id": 19755, "time": "2002-07-18T09:11:40Z", "creator": "d.deridder@customerdialogue.com", "creation_time": "2002-07-18T09:11:40Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "oleg@tkachenko.com", "text": "\n\n*** This bug has been marked as a duplicate of 8003 ***", "count": 1, "id": 26589, "time": "2002-11-19T17:03:33Z", "bug_id": 10941, "creation_time": "2002-11-19T17:03:33Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 10941, "attachment_id": null, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156530, "time": "2012-04-01T13:49:25Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:49:25Z", "is_private": false}]