[{"count": 0, "tags": [], "text": "We have a web server farm configured to reload a new httpd.conf whenever there \nhas been a change in AFS.  A script copies the new file and triggers a \ngraceful restart.  We have relied upon this feature to catch syntax errors \nthat we normally don't and prevent it from loading a bad config.\n\nToday we made a change in one of the SSL virtual hosts and there was a syntax \nerror where we mangled the Alias line.  Apache thought this was OK and \nreloaded the config.  This is where Apache crashed with an error because of \nthe bad syntax.  I even ran '/etc/init.d/apachectl configtest' and it \nreports \"Syntax OK\".  No matter what gibberish I place in a SSL virtual host, \nit never detects it until it actually loads the config.  Gibberish in any of \nthe other 120 virtual hosts (non-SSL) are detected correctly.", "is_private": false, "bug_id": 11139, "id": 20150, "time": "2002-07-24T19:21:24Z", "creator": "morris@unc.edu", "creation_time": "2002-07-24T19:21:24Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "trawick@apache.org", "attachment_id": null, "id": 20154, "time": "2002-07-24T19:39:41Z", "bug_id": 11139, "creation_time": "2002-07-24T19:39:41Z", "is_private": false, "text": "Was the syntax inside\n\n<IfDefine SSL>\n</IfDefine>\n\nand you use something like \"apachectl startssl\" to start Apache, which \ndefines SSL?  I'm not familiar with the mod_ssl patch to Apache 1.3, but\nit may be that in order to have \"apachectl configtest\" check inside\n<IfDefine SSL> you need to edit apachectl to include the -DSSL option\nin the definition of the HTTPD variable somewhere around line 28.\n\nAn alternate solution is to yank the <IfDefine SSL> stuff from your config\nfile unless you actually want to be able to start Apache without SSL\nsupport.\n\nI'm marking the bug as INVALID for now.  I suspect that you are getting\nbit by the lack of -DSSL when you do \"apachectl configtest\" and that is\nnot something that Apache 1.3 can help out with since the SSL support\nfor Apache 1.3, even the minimal tweaks for apachectl, comes from a third party \nand not from the ASF.\n"}]