[{"count": 0, "tags": [], "bug_id": 11178, "attachment_id": null, "id": 20203, "creation_time": "2002-07-25T18:37:06Z", "time": "2002-07-25T18:37:06Z", "creator": "josmhinkle@netscape.net", "text": "These are points not yet seen in the few bug reports on this subject.\n\nmod_cgid does not seem to flush buffers until the CGI program ends, and mod_cgi \nfollows some unhelpful rules in flushing buffers.  This strongly affects tabular \ndata sent from cgi programs.  mod_cgi seems to flush buffers when an HTML <BR> \nline break is detected, but not necessarily a line terminator \"\\n\", and possibly \nwhen the character count reaches 80.  A <BR> character is not the only display \nline ending, so are </TR> in a table, and </LI> in list items.  It would be very \nmuch better if the module only detected control characters, which are not \ndisplayed in a page, and did not depend on page content to determine \ntransmission controls.\n\nThe effects are such that nothing is displayed in a browser until a complete \npage is generated by a CGI program, meaning the user cannot see pushed material \nuntil his session ends.  \n\nmod_cgi and mod_cgid should display the same behaviours regarding data handling. \n Their difference is in threading, not as alternate page display methods.  To \nhave them dissimilar would force a good deal of software to become utterly \nunportable.  Already I have had to derive 3 versions of some CGI programs to \nallow them to work (hopefully) on mod_cgi, mod_cgid, and Apache 1.3.  One has \nnot been portable at all to mod_cgid so far.", "is_private": false}, {"count": 1, "tags": [], "bug_id": 11178, "is_private": false, "id": 23862, "creation_time": "2002-10-03T19:58:54Z", "time": "2002-10-03T19:58:54Z", "creator": "javier@vrweb.cl", "text": "I cant port any of my perl scripts from apache 1.3 to apache 2.0.39 because \nflush buffer ($| = 1;) simply dont work in apache2, i use worker mode and i \nbeen looking for info to make flush buffer works but there isnt more \ninformation, it just dont work. Please someone check it, i need to use $| = 1; \nin my scripts with apache2.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 11178, "attachment_id": null, "id": 23863, "time": "2002-10-03T20:08:46Z", "creator": "trawick@apache.org", "creation_time": "2002-10-03T20:08:46Z", "is_private": false, "text": "A couple of bugs fixed in the last couple of days broke streaming output from \nsome CGIs.  Output would be held until the CGI was done or until a threshhold\nwas reached.  Instead, pending output should be sent as soon as we find out\nthat no more data will arrive from the CGI for a while.\n\nmod_cgi itself was okay, but core code needed this patch (which will\nbe in the next release of Apache):\n\nhttp://cvs.apache.org/viewcvs.cgi/httpd-2.0/server/protocol.c.diff?\nr1=1.118&r2=1.119\n\n(URL is all one line)\n\nThe mod_cgid fix is more extensive (parts of it in APR and parts of it\nin mod_cgid), so you probabably want to wait until it is all bundled\nup in a new release (probably the one after 2.0.43).\n\nPlease try the mod_cgi fix in 2.0.43 (when it comes out) or apply the\npatch above to 2.0.42.  If the problems with your CGIs are not resolved,\nplease re-open this bug.\n\nThanks!"}, {"count": 3, "tags": [], "bug_id": 11178, "is_private": false, "id": 24139, "creation_time": "2002-10-08T15:14:19Z", "time": "2002-10-08T15:14:19Z", "creator": "javier@vrweb.cl", "text": "I upgraded my apache to 2.0.43 but the problem still there, i cant get any \nunbuffered perl output with apache (i use it in worker mode). \n\n$| = 1 just dont work, i have a test in http://desarrollo.vrweb.cl/cgi-\nbin/test.pl thats a simple script that set $| = 1 and send 2000 numbers, with a \nline feed and a <br> at the end, with pauses in between. In apache 2.0.39, it \nbuffered some numbers and print to screen in parts (big ones) but with this new \nrelease of apache it just buffer everything and prints only at the end... \n\nPlease check this, print unbuffered perl output is very useful for a lot of \naplications and i need it a lot :)\n\nJavier Vargas\nSantiago, Chile\n", "attachment_id": null}, {"count": 4, "tags": [], "creator": "trawick@apache.org", "is_private": false, "id": 24140, "creation_time": "2002-10-08T15:22:00Z", "time": "2002-10-08T15:22:00Z", "bug_id": 11178, "text": "Please attach a copy of your perl CGI if it doesn't contain any\nproprietary information.  \n\nAlso, please verify that mod_cgid is not loaded (i.e., look for \n\"LoadModule cgid_module\" in your config file) and mod_cgid is not \nbuilt-in (i.e., look for \"mod_cgid.c\" in the output of httpd -l).\n\nFWIW, the testcase used while developing the fix that went into \n2.0.43 was a perl script with '$| = 1\".\n\nThanks!\n", "attachment_id": null}, {"count": 5, "attachment_id": null, "creator": "javier@vrweb.cl", "text": "Thanks a lot Jeff, you where right, i was using mod_cgid (i was in worker \nmode), now i used prefork mode and i forced mod_cgi and $| = 1 worked ok.\n\nI hope that soon $|=1 will work with mod_cgid to be able to use worker :)\n\nBye, Javier Vargas.\n", "id": 24584, "time": "2002-10-15T19:44:45Z", "bug_id": 11178, "creation_time": "2002-10-15T19:44:45Z", "tags": [], "is_private": false}]