[{"attachment_id": null, "tags": [], "bug_id": 1123, "text": "Jasper cannot start properly with a clean repository (no compiled JSP pages)\nunder high load, because each new request for a page starts an independent\ncompilation process, regardless of whether or not that page is currently being\ncompiled.  Thus the number of compilations will grow quickly to unmanageable\nlevels, which the system cannot recover from.\n\nTo verify: blow away your repository and restart your web server under high\nload.  Take a thread dump of tomcat.  You will see many more threads inside the\nsun java compiler than there are pages being compiled in the repository.\n\nThere should be at most one compilation started per uncompiled page, no matter\nwhat the request pattern looks like.  Other requests should block on the first\ncompile.  They should not start the compile again, either.\n\nIt is acceptable for the web server to compile only one page at a time if that\nmakes the fix easier.  That's probably what will happen in practise anyway\nbecause compilation is fairly CPU intensive.", "count": 0, "id": 1603, "time": "2001-03-26T13:55:31Z", "creator": "pogo_tomcat@yahoo.com", "creation_time": "2001-03-26T13:55:31Z", "is_private": false}, {"count": 1, "tags": [], "creator": "marc.saegesser@apropos.com", "attachment_id": null, "text": "There was a thread synchronization bug that was fixed in Tomcat 3.2.2b2 that \nshould fix this problem.  Could you please try that version and verify that it \nreally did fix your problem.  If the problem still exists in 3.2.2b2 then \nplease re-open this bug report.", "id": 1604, "time": "2001-03-26T14:12:06Z", "bug_id": 1123, "creation_time": "2001-03-26T14:12:06Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 1123, "attachment_id": null, "text": "This problem appears to be fixed in 3.2.2b2, as you suggest.  Thanks.", "id": 1633, "time": "2001-03-28T14:19:04Z", "creator": "pogo_tomcat@yahoo.com", "creation_time": "2001-03-28T14:19:04Z", "is_private": false}]