[{"count": 0, "tags": [], "creator": "dh@uptime.at", "attachment_id": null, "is_private": false, "id": 20317, "time": "2002-07-27T20:10:57Z", "bug_id": 11236, "creation_time": "2002-07-27T20:10:57Z", "text": "Greetings. I am not quite sure if you should classify this as a bug, but I\nthought it would be interesting to pass it along. On all redhat systems and many\nothers I had a look at, the standard installation of Apache logs the full path\nto a file that produces a 404 file not found or 414 Request URI-Too Large.\n\nI was experimenting witht he following command:\nwget `perl -e 'print \"host\"; print \"A\"x######; print \"/\";'`\n\nWhile doing this I simply tailed the access log of the server I used to test\nthis on. I tried numbers between 6000 and 64000. I did not bother to try larger\nnumbers due to the limitations of wget. However I noticed, that access_log wrote\nall of the xxxx thousand \"A\" I put into the request into the logfile.\nEven when the request URI was obviously too large all of the xxx chars in the\npath are logged.\nThis creates a possible space exhaustion on the partition apache logs upon. If I\ncan write more than 64000 chars per request into the logfile it should be farily\neasy to cram the logfile. Also I noticed a slight delay while apache is writing\nthe 64000 chars to the logfile.\n\nIs this a valid concern? Thank you."}, {"count": 1, "tags": [], "creator": "dh@uptime.at", "text": "I tested this also in a more complicated setup. I sent 200 requests from 5\ndifferent hosts to a server with 64000 A in each overlong URL. This seemed to\nslow the response times fromt he server to a 6th host down significally, since\nthe server seemed so busy writing tot he log files.\n\n", "id": 20345, "time": "2002-07-29T07:49:06Z", "bug_id": 11236, "creation_time": "2002-07-29T07:49:06Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "dh@uptime.at", "attachment_id": null, "text": "A friend of mine has tested this on his own system and the same behaviour can be\nreproduced.", "id": 20638, "time": "2002-08-04T15:30:06Z", "bug_id": 11236, "creation_time": "2002-08-04T15:30:06Z", "is_private": false}]