[{"count": 0, "tags": [], "text": "Dear Sir/Madam,\n\nUnfortunately SSI does not work whatsoever under Windows 98. I guess my \nhttpd.conf file is configured OK, and I always restart the server after I \nmodify the httpd.conf file. This file, the .shtml test file and the output are \nbelow.\n\nCould you please help me solve this problem?\n\nThanks a lot,\n\nJoao Carlos E. Ferreira\n========================================= httpd.conf\n#\n# Based upon the NCSA server configuration files originally by Rob McCool.\n#\n# This is the main Apache server configuration file.  It contains the\n# configuration directives that give the server its instructions.\n# See <URL:http://www.apache.org/docs/> for detailed information about\n# the directives.\n#\n# Do NOT simply read the instructions in here without understanding\n# what they do.  They're here only as hints or reminders.  If you are unsure\n# consult the online docs. You have been warned.  \n#\n# After this file is processed, the server will look for and process\n# C:/Arquivos de programas/Apache Group/Apache/conf/srm.conf and then \nC:/Arquivos de programas/Apache Group/Apache/conf/access.conf\n# unless you have overridden these with ResourceConfig and/or\n# AccessConfig directives here.\n#\n# The configuration directives are grouped into three basic sections:\n#  1. Directives that control the operation of the Apache server process as a\n#     whole (the 'global environment').\n#  2. Directives that define the parameters of the 'main' or 'default' server,\n#     which responds to requests that aren't handled by a virtual host.\n#     These directives also provide default values for the settings\n#     of all virtual hosts.\n#  3. Settings for virtual hosts, which allow Web requests to be sent to\n#     different IP addresses or hostnames and have them handled by the\n#     same Apache server process.\n#\n# Configuration and logfile names: If the filenames you specify for many\n# of the server's control files begin with \"/\" (or \"drive:/\" for Win32), the\n# server will use that explicit path.  If the filenames do *not* begin\n# with \"/\", the value of ServerRoot is prepended -- so \"logs/foo.log\"\n# with ServerRoot set to \"/usr/local/apache\" will be interpreted by the\n# server as \"/usr/local/apache/logs/foo.log\".\n#\n# NOTE: Where filenames are specified, you must use forward slashes\n# instead of backslashes (e.g., \"c:/apache\" instead of \"c:\\apache\").\n# If a drive letter is omitted, the drive on which Apache.exe is located\n# will be used by default.  It is recommended that you always supply\n# an explicit drive letter in absolute paths, however, to avoid\n# confusion.\n#\n\n### Section 1: Global Environment\n#\n# The directives in this section affect the overall operation of Apache,\n# such as the number of concurrent requests it can handle or where it\n# can find its configuration files.\n#\n\n#\n# ServerType is either inetd, or standalone.  Inetd mode is only supported on\n# Unix platforms.\n#\nServerType standalone\n\n#\n# ServerRoot: The top of the directory tree under which the server's\n# configuration, error, and log files are kept.\n#\n# Do NOT add a slash at the end of the directory path.\n#\nServerRoot \"C:/Arquivos de programas/Apache Group/Apache\"\n\n#\n# PidFile: The file in which the server should record its process\n# identification number when it starts.\n#\nPidFile logs/httpd.pid\n\n#\n# ScoreBoardFile: File used to store internal server process information.\n# Not all architectures require this.  But if yours does (you'll know because\n# this file will be  created when you run Apache) then you *must* ensure that\n# no two invocations of Apache share the same scoreboard file.\n#\nScoreBoardFile logs/apache_runtime_status\n\n#\n# In the standard configuration, the server will process httpd.conf (this \n# file, specified by the -f command line option), srm.conf, and access.conf \n# in that order.  The latter two files are now distributed empty, as it is \n# recommended that all directives be kept in a single file for simplicity.  \n# The commented-out values below are the built-in defaults.  You can have the \n# server ignore these files altogether by using \"/dev/null\" (for Unix) or\n# \"nul\" (for Win32) for the arguments to the directives.\n#\n#ResourceConfig conf/srm.conf\n#AccessConfig conf/access.conf\n\n#\n# Timeout: The number of seconds before receives and sends time out.\n#\nTimeout 300\n\n#\n# KeepAlive: Whether or not to allow persistent connections (more than\n# one request per connection). Set to \"Off\" to deactivate.\n#\nKeepAlive On\n\n#\n# MaxKeepAliveRequests: The maximum number of requests to allow\n# during a persistent connection. Set to 0 to allow an unlimited amount.\n# We recommend you leave this number high, for maximum performance.\n#\nMaxKeepAliveRequests 100\n\n#\n# KeepAliveTimeout: Number of seconds to wait for the next request from the\n# same client on the same connection.\n#\nKeepAliveTimeout 15\n\n#\n# Apache on Win32 always creates one child process to handle requests.  If it\n# dies, another child process is created automatically.  Within the child\n# process multiple threads handle incoming requests.  The next two\n# directives control the behaviour of the threads and processes.\n#\n\n#\n# MaxRequestsPerChild: the number of requests each child process is\n# allowed to process before the child dies.  The child will exit so\n# as to avoid problems after prolonged use when Apache (and maybe the\n# libraries it uses) leak memory or other resources.  On most systems, this\n# isn't really needed, but a few (such as Solaris) do have notable leaks\n# in the libraries.  For Win32, set this value to zero (unlimited)\n# unless advised otherwise.\n#\n# NOTE: This value does not include keepalive requests after the initial\n#       request per connection. For example, if a child process handles\n#       an initial request and 10 subsequent \"keptalive\" requests, it\n#       would only count as 1 request towards this limit.\n#\nMaxRequestsPerChild 0\n\n#\n# Number of concurrent threads (i.e., requests) the server will allow.\n# Set this value according to the responsiveness of the server (more\n# requests active at once means they're all handled more slowly) and\n# the amount of system resources you'll allow the server to consume.\n#\nThreadsPerChild 50\n\n#\n# Listen: Allows you to bind Apache to specific IP addresses and/or\n# ports, in addition to the default. See also the <VirtualHost>\n# directive.\n#\n#Listen 3000\n#Listen 12.34.56.78:80\n\n#\n# BindAddress: You can support virtual hosts with this option. This directive\n# is used to tell the server which IP address to listen to. It can either\n# contain \"*\", an IP address, or a fully qualified Internet domain name.\n# See also the <VirtualHost> and Listen directives.\n#\nBindAddress *\n\n#\n# Apache Modules compiled into the standard Windows build\n#\n# The following modules are bound into the standard Apache binary distribution\n# for Windows.  To change the standard behavior, uncomment the following lines \n# and modify the list of those specific modules to be enabled in the server.\n#\n# WARNING: This is an advanced option that may render your server inoperable!\n# Do not use these directives without expert guidance.\n#\n#ClearModuleList\n#AddModule mod_so.c mod_mime.c mod_access.c mod_auth.c mod_negotiation.c\n#AddModule mod_include.c mod_autoindex.c mod_dir.c mod_cgi.c mod_userdir.c\n#AddModule mod_alias.c mod_env.c mod_log_config.c mod_asis.c mod_imap.c\n#AddModule mod_actions.c mod_setenvif.c mod_isapi.c\n\n#\n# Dynamic Shared Object (DSO) Support\n#\n# To be able to use the functionality of a module which was built as a DSO you\n# have to place corresponding `LoadModule' lines at this location so the\n# directives contained in it are actually available _before_ they are used.\n# Please read the file README.DSO in the Apache 1.3 distribution for more\n# details about the DSO mechanism and run `apache -l' for the list of already\n# built-in (statically linked and thus always available) modules in your Apache\n# binary.\n#\n# Note: The order in which modules are loaded is important.  Don't change\n# the order below without expert advice.\n#\n#LoadModule anon_auth_module modules/mod_auth_anon.so\n#LoadModule dbm_auth_module modules/mod_auth_dbm.so\n#LoadModule digest_auth_module modules/mod_auth_digest.so\n#LoadModule cern_meta_module modules/mod_cern_meta.so\n#LoadModule digest_module modules/mod_digest.so\n#LoadModule expires_module modules/mod_expires.so\n#LoadModule headers_module modules/mod_headers.so\n#LoadModule proxy_module modules/mod_proxy.so\n#LoadModule rewrite_module modules/mod_rewrite.so\n#LoadModule speling_module modules/mod_speling.so\n#LoadModule info_module modules/mod_info.so\nLoadModule status_module modules/mod_status.so\n#LoadModule usertrack_module modules/mod_usertrack.so\n\n#\n# ExtendedStatus controls whether Apache will generate \"full\" status\n# information (ExtendedStatus On) or just basic information (ExtendedStatus\n# Off) when the \"server-status\" handler is called. The default is Off.\n#\nExtendedStatus On\n\n### Section 2: 'Main' server configuration\n#\n# The directives in this section set up the values used by the 'main'\n# server, which responds to any requests that aren't handled by a\n# <VirtualHost> definition.  These values also provide defaults for\n# any <VirtualHost> containers you may define later in the file.\n#\n# All of these directives may appear inside <VirtualHost> containers,\n# in which case these default settings will be overridden for the\n# virtual host being defined.\n#\n\n#\n# Port: The port to which the standalone server listens.  Certain firewall\n# products must be configured before Apache can listen to a specific port.\n# Other running httpd servers will also interfere with this port.  Disable\n# all firewall, security, and other services if you encounter problems.\n# To help diagnose problems use the Windows NT command NETSTAT -a\n#\nPort 80\n\n#\n# ServerAdmin: Your address, where problems with the server should be\n# e-mailed.  This address appears on some server-generated pages, such\n# as error documents.\n#\nServerAdmin jcf@grucon.ufsc.br\n\n#\n# ServerName allows you to set a host name which is sent back to clients for\n# your server if it's different than the one the program would get (i.e., use\n# \"www\" instead of the host's real name).\n#\n# Note: You cannot just invent host names and hope they work. The name you \n# define here must be a valid DNS name for your host. If you don't understand\n# this, ask your network administrator.\n# If your host doesn't have a registered DNS name, enter its IP address here.\n# You will have to access it by its address (e.g., http://123.45.67.89/)\n# anyway, and this will make redirections work in a sensible way.\n#\n# 127.0.0.1 is the TCP/IP local loop-back address, often named localhost. Your \n# machine always knows itself by this address. If you use Apache strictly for \n# local testing and development, you may use 127.0.0.1 as the server name.\n#\nServerName einstein.grucon.ufsc.br\n\n#\n# DocumentRoot: The directory out of which you will serve your\n# documents. By default, all requests are taken from this directory, but\n# symbolic links and aliases may be used to point to other locations.\n#\nDocumentRoot \"C:/Arquivos de programas/Apache Group/Apache/htdocs\"\n\n#\n# Each directory to which Apache has access, can be configured with respect\n# to which services and features are allowed and/or disabled in that\n# directory (and its subdirectories). \n#\n# First, we configure the \"default\" to be a very restrictive set of \n# permissions.  \n#\n<Directory />\n    Options FollowSymLinks\n    AllowOverride None\n</Directory>\n\n#\n# Note that from this point forward you must specifically allow\n# particular features to be enabled - so if something's not working as\n# you might expect, make sure that you have specifically enabled it\n# below.\n#\n\n#\n# This should be changed to whatever you set DocumentRoot to.\n#\n<Directory \"C:/Arquivos de programas/Apache Group/Apache/htdocs\">\n\n#\n# This may also be \"None\", \"All\", or any combination of \"Indexes\",\n# \"Includes\", \"FollowSymLinks\", \"ExecCGI\", or \"MultiViews\".\n#\n# Note that \"MultiViews\" must be named *explicitly* --- \"Options All\"\n# doesn't give it to you.\n#\n    Options Indexes FollowSymLinks MultiViews Includes\n\n#\n# This controls which options the .htaccess files in directories can\n# override. Can also be \"All\", or any combination of \"Options\", \"FileInfo\", \n# \"AuthConfig\", and \"Limit\"\n#\n    AllowOverride None\n\n#\n# Controls who can get stuff from this server.\n#\n    Order allow,deny\n    Allow from all\n</Directory>\n\n#\n# UserDir: The name of the directory which is appended onto a user's home\n# directory if a ~user request is received.\n#\n# Under Win32, we do not currently try to determine the home directory of\n# a Windows login, so a format such as that below needs to be used.  See\n# the UserDir documentation for details.\n#\n<IfModule mod_userdir.c>\n    UserDir \"C:/Arquivos de programas/Apache Group/Apache/users/\"\n</IfModule>\n\n#\n# Control access to UserDir directories.  The following is an example\n# for a site where these directories are restricted to read-only.\n#\n#<Directory \"C:/Arquivos de programas/Apache Group/Apache/users\">\n#    AllowOverride FileInfo AuthConfig Limit\n#    Options MultiViews Indexes SymLinksIfOwnerMatch IncludesNoExec\n#    <Limit GET POST OPTIONS PROPFIND>\n#        Order allow,deny\n#        Allow from all\n#    </Limit>\n#    <LimitExcept GET POST OPTIONS PROPFIND>\n#        Order deny,allow\n#        Deny from all\n#    </LimitExcept>\n#</Directory>\n\n#\n# DirectoryIndex: Name of the file or files to use as a pre-written HTML\n# directory index.  Separate multiple entries with spaces.\n#\n<IfModule mod_dir.c>\n    DirectoryIndex index.html\n</IfModule>\n\n#\n# AccessFileName: The name of the file to look for in each directory\n# for access control information.\n#\nAccessFileName .htaccess\n\n#\n# The following lines prevent .htaccess files from being viewed by\n# Web clients.  Since .htaccess files often contain authorization\n# information, access is disallowed for security reasons.  Comment\n# these lines out if you want Web visitors to see the contents of\n# .htaccess files.  If you change the AccessFileName directive above,\n# be sure to make the corresponding changes here.\n#\n# Also, folks tend to use names such as .htpasswd for password\n# files, so this will protect those as well.\n#\n<Files ~ \"^\\.ht\">\n    Order allow,deny\n    Deny from all\n</Files>\n\n#\n# CacheNegotiatedDocs: By default, Apache sends \"Pragma: no-cache\" with each\n# document that was negotiated on the basis of content. This asks proxy\n# servers not to cache the document. Uncommenting the following line disables\n# this behavior, and proxies will be allowed to cache the documents.\n#\n#CacheNegotiatedDocs\n\n#\n# UseCanonicalName:  (new for 1.3)  With this setting turned on, whenever\n# Apache needs to construct a self-referencing URL (a URL that refers back\n# to the server the response is coming from) it will use ServerName and\n# Port to form a \"canonical\" name.  With this setting off, Apache will\n# use the hostname:port that the client supplied, when possible.  This\n# also affects SERVER_NAME and SERVER_PORT in CGI scripts.\n#\nUseCanonicalName On\n\n#\n# TypesConfig describes where the mime.types file (or equivalent) is\n# to be found.\n#\n<IfModule mod_mime.c>\n    TypesConfig conf/mime.types\n</IfModule>\n\n#\n# DefaultType is the default MIME type the server will use for a document\n# if it cannot otherwise determine one, such as from filename extensions.\n# If your server contains mostly text or HTML documents, \"text/plain\" is\n# a good value.  If most of your content is binary, such as applications\n# or images, you may want to use \"application/octet-stream\" instead to\n# keep browsers from trying to display binary files as though they are\n# text.\n#\nDefaultType text/plain\n\n#\n# The mod_mime_magic module allows the server to use various hints from the\n# contents of the file itself to determine its type.  The MIMEMagicFile\n# directive tells the module where the hint definitions are located.\n# mod_mime_magic is not part of the default server (you have to add\n# it yourself with a LoadModule [see the DSO paragraph in the 'Global\n# Environment' section], or recompile the server and include mod_mime_magic\n# as part of the configuration), so it's enclosed in an <IfModule> container.\n# This means that the MIMEMagicFile directive will only be processed if the\n# module is part of the server.\n#\n<IfModule mod_mime_magic.c>\n    MIMEMagicFile conf/magic\n</IfModule>\n\n#\n# HostnameLookups: Log the names of clients or just their IP addresses\n# e.g., www.apache.org (on) or 204.62.129.132 (off).\n# The default is off because it'd be overall better for the net if people\n# had to knowingly turn this feature on, since enabling it means that\n# each client request will result in AT LEAST one lookup request to the\n# nameserver.\n#\nHostnameLookups Off\n\n#\n# ErrorLog: The location of the error log file.\n# If you do not specify an ErrorLog directive within a <VirtualHost>\n# container, error messages relating to that virtual host will be\n# logged here.  If you *do* define an error logfile for a <VirtualHost>\n# container, that host's errors will be logged there and not here.\n#\nErrorLog logs/error.log\n\n#\n# LogLevel: Control the number of messages logged to the error.log.\n# Possible values include: debug, info, notice, warn, error, crit,\n# alert, emerg.\n#\nLogLevel warn\n\n#\n# The following directives define some format nicknames for use with\n# a CustomLog directive (see below).\n#\nLogFormat \"%h %l %u %t \\\"%r\\\" %>s %b \\\"%{Referer}i\\\" \\\"%{User-Agent}i\\\"\" \ncombined\nLogFormat \"%h %l %u %t \\\"%r\\\" %>s %b\" common\nLogFormat \"%{Referer}i -> %U\" referer\nLogFormat \"%{User-agent}i\" agent\n\n#\n# The location and format of the access logfile (Common Logfile Format).\n# If you do not define any access logfiles within a <VirtualHost>\n# container, they will be logged here.  Contrariwise, if you *do*\n# define per-<VirtualHost> access logfiles, transactions will be\n# logged therein and *not* in this file.\n#\nCustomLog logs/access.log common\n\n#\n# If you would like to have agent and referer logfiles, uncomment the\n# following directives.\n#\n#CustomLog logs/referer.log referer\n#CustomLog logs/agent.log agent\n\n#\n# If you prefer a single logfile with access, agent, and referer information\n# (Combined Logfile Format) you can use the following directive.\n#\n#CustomLog logs/access.log combined\n\n#\n# Optionally add a line containing the server version and virtual host\n# name to server-generated pages (error documents, FTP directory listings,\n# mod_status and mod_info output etc., but not CGI generated documents).\n# Set to \"EMail\" to also include a mailto: link to the ServerAdmin.\n# Set to one of:  On | Off | EMail\n#\nServerSignature On\n\n# \n# Apache parses all CGI scripts for the shebang line by default.\n# This comment line, the first line of the script, consists of the symbols\n# pound (#) and exclamation (!) followed by the path of the program that \n# can execute this specific script.  For a perl script, with perl.exe in\n# the C:\\Program Files\\Perl directory, the shebang line should be:\n\n   #!c:/program files/perl/perl\n\n# Note you _must_not_ indent the actual shebang line, and it must be the\n# first line of the file.  Of course, CGI processing must be enabled by \n# the appropriate ScriptAlias or Options ExecCGI directives for the files \n# or directory in question.\n#\n# However, Apache on Windows allows either the Unix behavior above, or can\n# use the Registry to match files by extention.  The command to execute \n# a file of this type is retrieved from the registry by the same method as \n# the Windows Explorer would use to handle double-clicking on a file.\n# These script actions can be configured from the Windows Explorer View menu, \n# 'Folder Options', and reviewing the 'File Types' tab.  Clicking the Edit\n# button allows you to modify the Actions, of which Apache 1.3 attempts to\n# perform the 'Open' Action, and failing that it will try the shebang line.\n# This behavior is subject to change in Apache release 2.0.\n#\n# Each mechanism has it's own specific security weaknesses, from the means\n# to run a program you didn't intend the website owner to invoke, and the\n# best method is a matter of great debate.\n#\n# To enable the this Windows specific behavior (and therefore -disable- the\n# equivilant Unix behavior), uncomment the following directive:\n#\nScriptInterpreterSource registry\n#\n# The directive above can be placed in individual <Directory> blocks or the\n# .htaccess file, with either the 'registry' (Windows behavior) or 'script' \n# (Unix behavior) option, and will override this server default option.\n#\n\n#\n# Aliases: Add here as many aliases as you need (with no limit). The format is \n# Alias fakename realname\n#\n<IfModule mod_alias.c>\n\n    #\n    # Note that if you include a trailing / on fakename then the server will\n    # require it to be present in the URL.  So \"/icons\" isn't aliased in this\n    # example, only \"/icons/\"..\n    #\n    Alias /icons/ \"C:/Arquivos de programas/Apache Group/Apache/icons/\"\n\n    <Directory \"C:/Arquivos de programas/Apache Group/Apache/icons\">\n        Options Indexes MultiViews\n        AllowOverride None\n        Order allow,deny\n        Allow from all\n    </Directory>\n\n    #\n    # ScriptAlias: This controls which directories contain server scripts.\n    # ScriptAliases are essentially the same as Aliases, except that\n    # documents in the realname directory are treated as applications and\n    # run by the server when requested rather than as documents sent to the \nclient.\n    # The same rules about trailing \"/\" apply to ScriptAlias directives as to\n    # Alias.\n    #\n    ScriptAlias /cgi-bin/ \"C:/Arquivos de programas/Apache Group/Apache/cgi-\nbin/\"\n\n    #\n    # \"C:/Arquivos de programas/Apache Group/Apache/cgi-bin\" should be changed \nto whatever your ScriptAliased\n    # CGI directory exists, if you have that configured.\n    #\n    <Directory \"C:/Arquivos de programas/Apache Group/Apache/cgi-bin\">\n        AllowOverride None\n        Options None Includes\n        Order allow,deny\n        Allow from all\n    </Directory>\n\n</IfModule>\n# End of aliases.\n\n#\n# Redirect allows you to tell clients about documents which used to exist in\n# your server's namespace, but do not anymore. This allows you to tell the\n# clients where to look for the relocated document.\n# Format: Redirect old-URI new-URL\n#\n\n#\n# Directives controlling the display of server-generated directory listings.\n#\n<IfModule mod_autoindex.c>\n\n    #\n    # FancyIndexing is whether you want fancy directory indexing or standard\n    #\n    # Note, add the option TrackModified to the IndexOptions default list only\n    # if all indexed directories reside on NTFS volumes.  The TrackModified flag\n    # will report the Last-Modified date to assist caches and proxies to \nproperly\n    # track directory changes, but it does _not_ work on FAT volumes.\n    #\n    IndexOptions FancyIndexing\n\n    #\n    # AddIcon* directives tell the server which icon to show for different\n    # files or filename extensions.  These are only displayed for\n    # FancyIndexed directories.\n    #\n    AddIconByEncoding (CMP,/icons/compressed.gif) x-compress x-gzip\n\n    AddIconByType (TXT,/icons/text.gif) text/*\n    AddIconByType (IMG,/icons/image2.gif) image/*\n    AddIconByType (SND,/icons/sound2.gif) audio/*\n    AddIconByType (VID,/icons/movie.gif) video/*\n\n    AddIcon /icons/binary.gif .bin .exe\n    AddIcon /icons/binhex.gif .hqx\n    AddIcon /icons/tar.gif .tar\n    AddIcon /icons/world2.gif .wrl .wrl.gz .vrml .vrm .iv\n    AddIcon /icons/compressed.gif .Z .z .tgz .gz .zip\n    AddIcon /icons/a.gif .ps .ai .eps\n    AddIcon /icons/layout.gif .html .shtml .htm .pdf\n    AddIcon /icons/text.gif .txt\n    AddIcon /icons/c.gif .c\n    AddIcon /icons/p.gif .pl .py\n    AddIcon /icons/f.gif .for\n    AddIcon /icons/dvi.gif .dvi\n    AddIcon /icons/uuencoded.gif .uu\n    AddIcon /icons/script.gif .conf .sh .shar .csh .ksh .tcl\n    AddIcon /icons/tex.gif .tex\n    AddIcon /icons/bomb.gif core\n\n    AddIcon /icons/back.gif ..\n    AddIcon /icons/hand.right.gif README\n    AddIcon /icons/folder.gif ^^DIRECTORY^^\n    AddIcon /icons/blank.gif ^^BLANKICON^^\n\n    #\n    # DefaultIcon is which icon to show for files which do not have an icon\n    # explicitly set.\n    #\n    DefaultIcon /icons/unknown.gif\n\n    #\n    # AddDescription allows you to place a short description after a file in\n    # server-generated indexes.  These are only displayed for FancyIndexed\n    # directories.\n    # Format: AddDescription \"description\" filename\n    #\n    #AddDescription \"GZIP compressed document\" .gz\n    #AddDescription \"tar archive\" .tar\n    #AddDescription \"GZIP compressed tar archive\" .tgz\n\n    #\n    # ReadmeName is the name of the README file the server will look for by\n    # default, and append to directory listings.\n    #\n    # HeaderName is the name of a file which should be prepended to\n    # directory indexes. \n    #\n    # If MultiViews are amongst the Options in effect, the server will\n    # first look for name.html and include it if found.  If name.html\n    # doesn't exist, the server will then look for name.txt and include\n    # it as plaintext if found.\n    #\n    ReadmeName README\n    HeaderName HEADER\n\n    #\n    # IndexIgnore is a set of filenames which directory indexing should ignore\n    # and not include in the listing.  Shell-style wildcarding is permitted.\n    #\n    IndexIgnore .??* *~ *# HEADER* README* RCS CVS *,v *,t\n\n</IfModule>\n# End of indexing directives.\n\n#\n# Document types.\n#\n<IfModule mod_mime.c>\n\n    #\n    # AddEncoding allows you to have certain browsers (Mosaic/X 2.1+) uncompress\n    # information on the fly. Note: Not all browsers support this.\n    # Despite the name similarity, the following Add* directives have nothing\n    # to do with the FancyIndexing customization directives above.\n    #\n    AddEncoding x-compress Z\n    AddEncoding x-gzip gz tgz\n    #\n    # AddLanguage allows you to specify the language of a document. You can\n    # then use content negotiation to give a browser a file in a language\n    # it can understand.\n    #\n    # Note 1: The suffix does not have to be the same as the language\n    # keyword --- those with documents in Polish (whose net-standard\n    # language code is pl) may wish to use \"AddLanguage pl .po\" to\n    # avoid the ambiguity with the common suffix for perl scripts.\n    #\n    # Note 2: The example entries below illustrate that in quite\n    # some cases the two character 'Language' abbriviation is not\n    # identical to the two character 'Country' code for its country,\n    # E.g. 'Danmark/dk' versus 'Danish/da'.\n    #\n    # Note 3: In the case of 'ltz' we violate the RFC by using a three char\n    # specifier. But there is 'work in progress' to fix this and get\n    # the reference data for rfc1766 cleaned up.\n    #\n    # Danish (da) - Dutch (nl) - English (en) - Estonian (ee)\n    # French (fr) - German (de) - Greek-Modern (el)\n    # Italian (it) - Korean (kr) - Norwegian (no)\n    # Portugese (pt) - Luxembourgeois* (ltz)\n    # Spanish (es) - Swedish (sv) - Catalan (ca) - Czech(cz)\n    # Polish (pl) - Brazilian Portuguese (pt-br) - Japanese (ja)\n    # Russian (ru)\n    #\n    AddLanguage da .dk\n    AddLanguage nl .nl\n    AddLanguage en .en\n    AddLanguage et .ee\n    AddLanguage fr .fr\n    AddLanguage de .de\n    AddLanguage el .el\n    AddLanguage he .he\n    AddCharset ISO-8859-8 .iso8859-8\n    AddLanguage it .it\n    AddLanguage ja .ja\n    AddCharset ISO-2022-JP .jis\n    AddLanguage kr .kr\n    AddCharset ISO-2022-KR .iso-kr\n    AddLanguage no .no\n    AddLanguage pl .po\n    AddCharset ISO-8859-2 .iso-pl\n    AddLanguage pt .pt\n    AddLanguage pt-br .pt-br\n    AddLanguage ltz .lu\n    AddLanguage ca .ca\n    AddLanguage es .es\n    AddLanguage sv .se\n    AddLanguage cz .cz\n    AddLanguage ru .ru\n    AddLanguage tw .tw\n    AddCharset Big5         .Big5    .big5\n    AddCharset WINDOWS-1251 .cp-1251\n    AddCharset CP866        .cp866\n    AddCharset ISO-8859-5   .iso-ru\n    AddCharset KOI8-R       .koi8-r\n    AddCharset UCS-2        .ucs2\n    AddCharset UCS-4        .ucs4\n    AddCharset UTF-8        .utf8\n\n    # LanguagePriority allows you to give precedence to some languages\n    # in case of a tie during content negotiation.\n    #\n    # Just list the languages in decreasing order of preference. We have\n    # more or less alphabetized them here. You probably want to change this.\n    #\n    <IfModule mod_negotiation.c>\n        LanguagePriority en da nl et fr de el it ja kr no pl pt pt-br ru ltz ca \nes sv tw\n    </IfModule>\n\n    #\n    # AddType allows you to tweak mime.types without actually editing it, or to\n    # make certain files to be certain types.\n    #\n    # For example, the PHP 3.x module (not part of the Apache distribution - see\n    # http://www.php.net) will typically use:\n    #\n    #AddType application/x-httpd-php3 .php3\n    #AddType application/x-httpd-php3-source .phps\n    #\n    # And for PHP 4.x, use:\n    #\n    #AddType application/x-httpd-php .php\n    #AddType application/x-httpd-php-source .phps\n\n    AddType application/x-tar .tgz\n\n    #\n    # AddHandler allows you to map certain file extensions to \"handlers\",\n    # actions unrelated to filetype. These can be either built into the server\n    # or added with the Action command (see below)\n    #\n    # If you want to use server side includes, or CGI outside\n    # ScriptAliased directories, uncomment the following lines.\n    #\n    # To use CGI scripts:\n    #\n    AddHandler cgi-script .cgi\n\n    #\n    # To use server-parsed HTML files\n    #\n    AddType text/html .shtml\n    AddHandler server-parsed .shtml\n\n    #\n    # Uncomment the following line to enable Apache's send-asis HTTP file\n    # feature\n    #\n    #AddHandler send-as-is asis\n\n    #\n    # If you wish to use server-parsed imagemap files, use\n    #\n    #AddHandler imap-file map\n\n    #\n    # To enable type maps, you might want to use\n    #\n    #AddHandler type-map var\n\n</IfModule>\n# End of document types.\n\n#\n# Action lets you define media types that will execute a script whenever\n# a matching file is called. This eliminates the need for repeated URL\n# pathnames for oft-used CGI file processors.\n# Format: Action media/type /cgi-script/location\n# Format: Action handler-name /cgi-script/location\n#\n\n#\n# MetaDir: specifies the name of the directory in which Apache can find\n# meta information files. These files contain additional HTTP headers\n# to include when sending the document\n#\n#MetaDir .web\n\n#\n# MetaSuffix: specifies the file name suffix for the file containing the\n# meta information.\n#\n#MetaSuffix .meta\n\n#\n# Customizable error response (Apache style)\n#  these come in three flavors\n#\n#    1) plain text\n#ErrorDocument 500 \"The server made a boo boo.\n#  n.b.  the single leading (\") marks it as text, it does not get output\n#\n#    2) local redirects\n#ErrorDocument 404 /missing.html\n#  to redirect to local URL /missing.html\n#ErrorDocument 404 /cgi-bin/missing_handler.pl\n#  N.B.: You can redirect to a script or a document using server-side-includes.\n#\n#    3) external redirects\n#ErrorDocument 402 http://some.other_server.com/subscription_info.html\n#  N.B.: Many of the environment variables associated with the original\n#  request will *not* be available to such a script.\n\n#\n# Customize behaviour based on the browser\n#\n<IfModule mod_setenvif.c>\n\n    #\n    # The following directives modify normal HTTP response behavior.\n    # The first directive disables keepalive for Netscape 2.x and browsers that\n    # spoof it. There are known problems with these browser implementations.\n    # The second directive is for Microsoft Internet Explorer 4.0b2\n    # which has a broken HTTP/1.1 implementation and does not properly\n    # support keepalive when it is used on 301 or 302 (redirect) responses.\n    #\n    BrowserMatch \"Mozilla/2\" nokeepalive\n    BrowserMatch \"MSIE 4\\.0b2;\" nokeepalive downgrade-1.0 force-response-1.0\n\n    #\n    # The following directive disables HTTP/1.1 responses to browsers which\n    # are in violation of the HTTP/1.0 spec by not being able to grok a\n    # basic 1.1 response.\n    #\n    BrowserMatch \"RealPlayer 4\\.0\" force-response-1.0\n    BrowserMatch \"Java/1\\.0\" force-response-1.0\n    BrowserMatch \"JDK/1\\.0\" force-response-1.0\n\n</IfModule>\n# End of browser customization directives\n\n#\n# Allow server status reports, with the URL of http://servername/server-status\n# Change the \".grucon.ufsc.br\" to match your domain to enable.\n#\n<Location /server-status>\n    SetHandler server-status\n    Order deny,allow\n    Deny from all\n    Allow from .grucon.ufsc.br 127.0.0.1 127.0.0.2\n</Location>\n\n#\n# Allow remote server configuration reports, with the URL of\n# http://servername/server-info (requires that mod_info.c be loaded).\n# Change the \".grucon.ufsc.br\" to match your domain to enable.\n#\n<Location /server-info>\n    SetHandler server-info\n    Order deny,allow\n    Deny from all\n    Allow from .grucon.ufsc.br 127.0.0.1 127.0.0.2\n</Location>\n\n#\n# There have been reports of people trying to abuse an old bug from pre-1.1\n# days.  This bug involved a CGI script distributed as a part of Apache.\n# By uncommenting these lines you can redirect these attacks to a logging \n# script on phf.apache.org.  Or, you can record them yourself, using the script\n# support/phf_abuse_log.cgi.\n#\n#<Location /cgi-bin/phf*>\n#    Deny from all\n#    ErrorDocument 403 http://phf.apache.org/phf_abuse_log.cgi\n#</Location>\n\n#\n# Proxy Server directives. Uncomment the following lines to\n# enable the proxy server:\n#\n#<IfModule mod_proxy.c>\n#    ProxyRequests On\n\n#    <Directory proxy:*>\n#        Order deny,allow\n#        Deny from all\n#        Allow from .grucon.ufsc.br\n#    </Directory>\n\n    #\n    # Enable/disable the handling of HTTP/1.1 \"Via:\" headers.\n    # (\"Full\" adds the server version; \"Block\" removes all outgoing Via: \nheaders)\n    # Set to one of: Off | On | Full | Block\n    #\n#    ProxyVia On\n\n    #\n    # To enable the cache as well, edit and uncomment the following lines:\n    # (no cacheing without CacheRoot)\n    #\n#    CacheRoot \"C:/Arquivos de programas/Apache Group/Apache/proxy\"\n#    CacheSize 5\n#    CacheGcInterval 4\n#    CacheMaxExpire 24\n#    CacheLastModifiedFactor 0.1\n#    CacheDefaultExpire 1\n#    NoCache a_domain.com another_domain.edu joes.garage_sale.com\n\n#</IfModule>\n# End of proxy directives.\n\n### Section 3: Virtual Hosts\n#\n# VirtualHost: If you want to maintain multiple domains/hostnames on your\n# machine you can setup VirtualHost containers for them. Most configurations\n# use only name-based virtual hosts so the server doesn't need to worry about\n# IP addresses. This is indicated by the asterisks in the directives below.\n#\n# Please see the documentation at <URL:http://www.apache.org/docs/vhosts/>\n# for further details before you try to setup virtual hosts.\n#\n# You may use the command line option '-S' to verify your virtual host\n# configuration.\n\n#\n# Use name-based virtual hosting.\n#\n#NameVirtualHost *\n\n#\n# VirtualHost example:\n# Almost any Apache directive may go into a VirtualHost container.\n# The first VirtualHost section is used for requests without a known\n# server name.\n#\n#<VirtualHost *>\n#    ServerAdmin webmaster@dummy-host.example.com\n#    DocumentRoot /www/docs/dummy-host.example.com\n#    ServerName dummy-host.example.com\n#    ErrorLog logs/dummy-host.example.com-error_log\n#    CustomLog logs/dummy-host.example.com-access_log common\n#</VirtualHost>\n\n# Include the configuration for Apache JServ 1.1.2\nInclude \"C:\\Arquivos de programas\\Apache JServ 1.1.2\\conf\\jserv.conf\"\n\n\nApJServVMTimeout 30\nApJServMount /alph /alphzone\nApJServAction .jsp /alph/gnujsp\nApJServAction .shtml /servlets/org.apache.servlet.ssi.SSI\n\n============================================ test1.shtml\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 3.2 Final//EN\">\n<HTML>\n<HEAD><TITLE> Test Server Side Includes </TITLE></HEAD>\n<BODY BGCOLOR=\"#FFFFFF\">\nCurrent Date: <!--#echo var=\"DATE_LOCAL\" -->\n<P>Document Name: <!--#echo var=\"DOCUMENT_NAME\" --> \n<P>Environmental Variables:<BR>\n<PRE><!--#printenv  --></PRE>\n</BODY>\n</HTML>\n\n==================================== Output (both on Netscape and on IExplorer)\nCurrent Date: \nDocument Name: \nEnvironmental Variables:", "is_private": false, "id": 20495, "creator": "jcf@grucon.ufsc.br", "time": "2002-07-31T16:24:32Z", "bug_id": 11333, "creation_time": "2002-07-31T16:24:32Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "text": "\n  Please do NOT post configuration problems to the bugzilla database... \n  you need to raise your questions on the appropriate user forum, either\n  the users list, or the appropriate newsgroup.", "id": 20498, "time": "2002-07-31T17:26:50Z", "bug_id": 11333, "creation_time": "2002-07-31T17:26:50Z", "is_private": false, "attachment_id": null}]