[{"count": 0, "attachment_id": null, "bug_id": 11419, "is_private": false, "id": 20607, "time": "2002-08-02T14:53:36Z", "creator": "mstover1@apache.org", "creation_time": "2002-08-02T14:53:36Z", "tags": [], "text": "Web sites often lead users down side paths (such as via opening a new temporary\nbrowser window), and then bring the user back to the main path.  JMeter has no\nnotion of such side paths, and everything is strictly linear. \n\nHowever, frequently, JMeter needs the next request to access values that were\npresent 3 or 4 requests ago (this is referring to Response-Based modifiers and\nparsers).  Thus, I'd like JMeter to be able to grab those values when they are\navailable, and then store them and allow requests down the line to re-use those\nvalues.\n\nFunctions and modifiers should be given access to a central location (each\nthread holds separate values though) where such values can be named and stored.\n This should allow one function to store it's values and obviate the need to\nhave multiple instances of that function in various different parameters and\nfields, which should increase performance."}, {"attachment_id": null, "tags": [], "bug_id": 11419, "is_private": false, "count": 1, "id": 21267, "time": "2002-08-19T15:13:52Z", "creator": "mstover1@apache.org", "creation_time": "2002-08-19T15:13:52Z", "text": "done.  All functions have access to a thread's variables and can retrieve or set\nvariable values.  Any test element that wants access simply needs to implement\nthe ThreadListener interface."}, {"count": 2, "tags": [], "text": "Marking all bugs RESOLVED before JMeter 1.8's release date as VERIFIED.\nYes, it's pretty poor QA procedure, but there's bugs here lingering since JMeter\n1.6, and we need to clean up a little.", "is_private": false, "bug_id": 11419, "id": 28496, "time": "2002-12-27T16:20:31Z", "creator": "jsalvata@atg.com", "creation_time": "2002-12-27T16:20:31Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 11419, "is_private": false, "id": 28718, "creation_time": "2002-12-29T14:25:36Z", "time": "2002-12-29T14:25:36Z", "creator": "jsalvata@atg.com", "text": "Bulk-closing all bugs RESOLVED before JMeter 1.8 release date.", "attachment_id": null}]