[{"count": 0, "tags": [], "bug_id": 11476, "attachment_id": null, "id": 20663, "time": "2002-08-05T17:54:49Z", "creator": "umina@theuminas.com", "creation_time": "2002-08-05T17:54:49Z", "is_private": false, "text": "This bug occurs randomly over time running Apache 2.039 and previous versions, \nbut I have recently determined how to invoke the bug.  System is XP \nProfessional.  The bug causes the blue screen of death, requiring a power down \nto restart the sytem and gives the following error message:\n\nPROCESS_HAS_LOCKED_PAGES\n\nTechnical Information:\n\n*** STOP: 0x00000076 (0x00000000,0x819EBB30, 0x00000001, 0x00000000)\n\n\nTo cause Apache to fail in this manner, one has merely to use Frontpage 2002 to \npublish a simple website to the machine running Apache (one that does not \nrequire any of the extensions to operate, just a few linked pages).  Shortly \nafter publishing Apache will stop serving.  If you then use the applet to \nrestart Apache, it will restart and begin serving correctly.\n\nAfter working for a minute or so, the system will crash with the above error \nmessage.  As I mentioned this failure will appear over time on it's own.\n\nAbout the configuration here:\n\nMy websites are all simple.  I have one IP and multiple virtual sites on the \nmachine.  The configuration for Apache is almost as distributed with the \nexception of the mods required to activate the virtual sites.  The XP Pro \nsystem runs only MDaemon and Apache and Zone Alarm Pro.  Without Apache, the \nsystem runs continuously with no problems for extended periods of time (usually \nuntil I shut it down) and is power conditioned by APC UPS.\n\nThe configuration of XP is minimal.  All features not being used (most of them) \nhave been removed.\n\nAgain, Frontpage isn't the problem, the problem happens over time by itself, \nbut I can make it happen quickly with frontpage.  If you have trouble \nduplicating the problem please let me know.  This problem is documented for \nWindows 2000 in Microsoft's database, but not for XP.  In the W2000 article \nthey attribute this failure to an I/O driver or sofware that fails to clean up \nafter itself and eventually overloads the OS.  They have procedures to figure \nout which one it is using registry edits, but this is not workable in XP due to \ndifferent flags and naming conventions.\n\nOn the sytem that I can repeatedly create the problem, all updates are \ncurrent.  The system is a 800 Mhz Compaq with 512 Mb of memory.\n\n/Len\n\nPS I will be happy to test any code you generate to fix the problem, but I will \nneed a compiled package.  I do not use C here."}, {"count": 1, "tags": [], "text": "The problem is almost certainly a known bad iteraction with zonealarm.\n\n*** This bug has been marked as a duplicate of 7932 ***", "is_private": false, "id": 20668, "creator": "slive@apache.org", "time": "2002-08-05T21:04:15Z", "bug_id": 11476, "creation_time": "2002-08-05T21:04:15Z", "attachment_id": null}]