[{"count": 0, "tags": [], "bug_id": 11686, "text": "I am facing the problem using Ant tool. I have got this ant tool from java \nwebservices development pack. It was working fine for past two days. now \nwhenever I start Apache Tomcat and then I use this ant, it gives me this \napplication error message.\n\"The instruction at \"0x780118f2\" referenced memory at \"0x443b7261\". The memory \ncould not be read.\nClick OK to terminate the program.\nclick on Cancel to debug the program.\n\nI dont know where is the error. I tried to uninstall java webservices tool kit. \nBut I couldnt uninstall it.\nI am using windows 2000 server.\nKindly help\nthanks in advance\ns.arun prasath", "id": 21016, "time": "2002-08-14T09:45:13Z", "creator": "arunprasath.s@polaris.co.in", "creation_time": "2002-08-14T09:45:13Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "Given the jwsdp came from sun, and they produced their own builds of everything\nand packaged it together, you should really be directing your support calls to\nthem. Really: the version of ant that they ship is a special build of ant1.4\nthat nobody on this team had anything to do with.\n\nI uninstalled the jwsdp and did not have any problems doing so, even during the\nbeta program. Try again from the control panel:add/remove programs. If you cant.\nagain, take it up with Sun. ", "bug_id": 11686, "attachment_id": null, "id": 21041, "time": "2002-08-14T16:23:34Z", "creator": "stevel@apache.org", "creation_time": "2002-08-14T16:23:34Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "patrick.luby@planamesa.com", "attachment_id": null, "text": "I have some familiarity with JWSDP and, from your errors, it sounds like the\nJava Virtual Machine (JVM) is having problems. When you get errors like \"The\ninstruction at \"0x780118f2\" referenced memory at \"0x443b7261\", they usually mean\nthat the JVM is crashing. I don't believe that this is an Ant problem as there\nis no native C code in JWSDP.\n\nSince this worked for 2 days, the obvious question is did you reboot your\nmachine? Windows is known for its lack of stability and many applications don't\nwork right after Windows has been running continuously. Also, have you installed\nor uninstalled other applications that may have tweaked your Java installation?\n\nLastly, if none of the above works, delete your entire JWSDP installation,\nreboot your machine, and reinstall JWSDP. It is true that JWSDP can be\nuninstalled using the Windows Add/Remove Programs panel, but the uninstaller is\nwritten in Java. So, if Java is crashing, you will be stuck.\n\n", "id": 21042, "time": "2002-08-14T16:36:37Z", "bug_id": 11686, "creation_time": "2002-08-14T16:36:37Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 11686, "text": "Thank you for replying.\nPatrick, yes I rebooted windows machine and only after that this error is \noccuring. I have tried to uninstall java webservices tool kit. but I couldnt. \nso I deleted the folders and cleaned the registry using regcleaner. and I \nrebooted the machine and installed freshly again java webservices tool kit. \neven then this error occurs. ant works properly before starting the tomcat that \ncomes along with java webservices tool kit. but error occurs in javaw.exe only \nwhen I start the tomcat.kindly help.\n thanks in advance for ur suggestions.\ns.arun prasath", "id": 21514, "time": "2002-08-22T05:05:26Z", "creator": "arunprasath.s@polaris.co.in", "creation_time": "2002-08-22T05:05:26Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 11686, "attachment_id": null, "id": 21546, "time": "2002-08-22T16:51:19Z", "creator": "stevel@apache.org", "creation_time": "2002-08-22T16:51:19Z", "is_private": false, "text": "1. this is probably not an ant bug. You keep talking about tomcat, and\ntomcat!=ant. So perhaps you should change the product flag in the bugrep to be\ntomcat.\n\n\n2. if there are jwsdp problems, take them up with the supplier, who in this case\nis sun. there may be a lot of apache stuff in there, but they took it and made\nchanges, changes we dont know about, so cant field problems.\n\n3. the next escalation step is to uninstall and reinstall java. Get the latest\nrelease version that works with jwsdp, which is 1.4.01\n\n4. if that doesnt work, start worrying about the OS and hardware, specifically\nmemory. If DRAM is playing up, it can sometimes surface in code this way."}]