[{"count": 0, "tags": [], "bug_id": 11759, "text": "Forgetting to create an index.html file is a common security lapse, that lets\nintruders prowl around the directory using mod_autoindex.\n\nTherefore, there should be a configuration directive to disable mod_autoindex\nat either the global level, in a virtual server block, or in a directory block.\nSomething like \"AutoIndex On\" to enable auto-indexing, and \"AutoIndex Off\"\nto disable it, would do the job.\n\nA typical way to use it would be to set \"AutoIndex Off\" in httpd.conf,\ndisabling auto-indexing by default.  Individual directories could override\nthe default and enable auto-indexing in their .htaccess file, if AllowOverrides\nis set to allow overriding mod_autoindex directives.  Alternatively, \nauto-indexing could be enable for specific directories using AutoIndex\ndirectives in <directory> blocks for those directories.", "id": 21146, "time": "2002-08-16T02:40:33Z", "creator": "phr-apache@nightsong.com", "creation_time": "2002-08-16T02:40:33Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 11759, "text": "\nYou are overlooking the flexibility and control of a global <Directory \"/\">\nsection.  The bug database is for tracking problems with the code, please\nrefer to the appropriate users list to discuss how to accomplish what you\nare attempting to do.\n", "id": 21148, "time": "2002-08-16T05:54:29Z", "creator": "wrowe@apache.org", "creation_time": "2002-08-16T05:54:29Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 11759, "attachment_id": null, "text": "Reopened as documentation bug.  The doc for mod_autoindex should explain the\nway to disable indexing: set \"Options -Index\" in the appropriate containing block.\n\nI was able to figure this out by examining mod_autoindex.c and then finding\nthe single place where OPT_INDEXES was set, then checking the doc for the\nOptions command.  That's an unreasonable thing to ask of user.\n\nBefore initially opening this bug, I had already asked on the Usenet web\nservers group how to turn off indexing, and no one responded, so it shows\nhow obscure that Options command was.  Apache configuration questions generally\nget answered pretty quickly on that group.  So the doc update is definitely\nappropriate.", "id": 21150, "time": "2002-08-16T06:37:32Z", "creator": "phr-apache@nightsong.com", "creation_time": "2002-08-16T06:37:32Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 11759, "text": "Bug summary updated to reflect suggestion.  \"Options Index\" should be\nmentioned/described in the \"Summary\" section of the mod_autoindex doc.\nIMO the doc should also advise that \"Options -Index\" is preferred if the site\ncontains any non-public files.  Directories wanting indexing should enable it\nexplicitly in those cases.  With indexing enabled, it's very easy to leave a\ndirectory auto-indexed by accident, with undesired consequences, and many sites\nhave done that.", "id": 21151, "time": "2002-08-16T06:51:23Z", "creator": "phr-apache@nightsong.com", "creation_time": "2002-08-16T06:51:23Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 11759, "text": "The mod_autoindex docs do say \"Automatic index generation is enabled with using\nOptions +Indexes. See the Options directive for more details.\" which pretty\nmuch sums up the situation.\n\nI do not believe that recommending \"Options -Indexes\" for sites with non-public\nfiles is a good idea.  Private files should not be kept in the web tree at all.\n\nIt is true that the mod_autoindex docs could use some rewriting.  I'll try to\nget to that eventually.\n\nThanks for using Apache.", "id": 21164, "time": "2002-08-16T14:26:48Z", "creator": "slive@apache.org", "creation_time": "2002-08-16T14:26:48Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 11759, "text": "It's often fine to put private files in a web tree for use by people who know\nthe unpublished URL's.  Of course that's not as secure as using HTTP Basic\nauthentication to protect the files, but it's more convenient.  HTTP Basic Auth\nis in turn less secure than Basic Auth over SSL, which is in turn less secure\nthan SSL with client certificates, which is in turn less secure than client\ncertificates whose secret keys are embedded in tamper resistant hardware tokens.\n There's a continuum of security/convenience levels that the site operator can\nlegitimately choose among depending on his/her specific requirements. \nUnprotected files with unadvertised URL's is a perfectly legitimate point in\nthat continuum, and is one of the easiest to use.  \n\nAnyway, empirically in the real world, this method is widely used, regardless of\nwhether it's objectively smart or not.  And even if that security strategy isn't\nchosen on purpose, sometimes private files get left laying around in directories\nby accident.  Apache should try to be resilient in the event of such errors, not\ntry to punish its users for being careless.  \n\nI hope the mod_autoindex docs do get updated to at least describe Options\n-Indexes.  If no recommendation is made there, perhaps the issue could be\nmentioned in the Security Tips part of the Apache docs.\n\nRegards\n\nPaul\n", "id": 21167, "time": "2002-08-16T15:14:56Z", "creator": "phr-apache@nightsong.com", "creation_time": "2002-08-16T15:14:56Z", "is_private": false, "attachment_id": null}]