[{"count": 0, "tags": [], "bug_id": 11836, "is_private": false, "id": 21335, "creation_time": "2002-08-19T22:20:08Z", "time": "2002-08-19T22:20:08Z", "creator": "rfeak@cox.net", "text": "Currently properties are not usable in the attributes of targets.\n\nI have recently run into a situation where this would be useful. I have to set \nup a build system where there are multiple sub-components. Each one should be \nbuildable and testable within itself. In addition I have to have a master build \nfile that will build and test everything. This is totally doable. However, I do \nnot want to \"own\" the build system, so the easier I can make it the better.\n\nOne thing I want to do is have a common set of targets for each component so \nthat the master build can assume what targets are available. Also, I would like \nto make a utilities.xml file that has those targets in them. In the simplest \ncase (no dependancies, nothing special) the individual components could just \nsource the utilities.xml. In more complex cases, I would like the components to \nbe able to source the utilities.xml also, but be able to set additional \ndependancies for some of the compile targets. Those additional dependancies \ncould then be placed in that components build.xml.\n\nA system like this is a little complex to setup initially, but not too bad. \nEasy to add new components to in the long run, and minimizes the amount of code \nthat gets copy and pasted.\n\nUnfortunately I cannot create a property that describes what dependancies exist \nfor a particular target. It seems like this should be an easy thing to add, if \nyou deem it worthy.", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 11836, "attachment_id": null, "id": 43752, "creation_time": "2003-09-05T15:40:34Z", "time": "2003-09-05T15:40:34Z", "creator": "jan@materne.de", "text": "For the master-subcomponent the new <subant> could help.\n\nThe utilities.xml can be made with xml-includes or the new <include>.\n\n\"Overriding\" ... there is a new <macrodef> ... maybe that could help ... ", "is_private": false}, {"count": 2, "text": "No echo and solution provided.", "bug_id": 11836, "is_private": false, "id": 56114, "time": "2004-04-20T15:49:52Z", "creator": "jan@materne.de", "creation_time": "2004-04-20T15:49:52Z", "tags": [], "attachment_id": null}]