[{"count": 0, "tags": [], "creator": "craig@brumfield.com", "attachment_id": null, "id": 21647, "time": "2002-08-23T21:00:05Z", "bug_id": 11990, "creation_time": "2002-08-23T21:00:05Z", "is_private": false, "text": "I am using the new Checksum task to calculate a checksum for a list of files.  \nThe list of files to include are specified using a FileSet.  However, the \nchecksum that is calculated is difference when run on the same files in \ndifferent directories (or on another system) because the order in which the \nfiles are processed is not predictable.  I have tested a change to the Checksum \ntask that sorts the list of files first and this does indeed, fix the problem.  \nI think a better place for this change would be in the FileSet task.  Another \nproperty (sort=ascending|descending|directory) would control if results are \nsorted or not, and in which order.  This may be useful when using FileSet with \nother tasks in addition to Checksum.\n\nThanks,\nCB"}, {"count": 1, "tags": [], "creator": "larry.shatzer@mirotechnologies.com", "attachment_id": null, "id": 46254, "creation_time": "2003-10-24T17:09:26Z", "time": "2003-10-24T17:09:26Z", "bug_id": 11990, "text": "Can you test this with the beta for 1.6, and if it still is broken, attach an \nexample build file?", "is_private": false}, {"count": 2, "tags": [], "creator": "mbenson@apache.org", "attachment_id": null, "text": "CVS HEAD contains support for the concept of ResourceCollections, including\nfileset et al.  The <sort> resource collection should satisfy this request. \nInitially only a few tasks--concat, pathconvert, length and\nresourcecount--support these directly; however tasks that accept paths \nshould\nautomagically work with filesystem-based resource collections wrapped \nin paths.\n Feel welcome to submit patches to add ResourceCollection support to \nyour\nfavorite task!", "id": 75244, "time": "2005-05-23T22:17:41Z", "bug_id": 11990, "creation_time": "2005-05-23T22:17:41Z", "is_private": false}]