[{"count": 0, "tags": [], "bug_id": 12000, "attachment_id": null, "id": 21657, "time": "2002-08-24T01:19:16Z", "creator": "eric_97@pobox.com", "creation_time": "2002-08-24T01:19:16Z", "is_private": false, "text": "Version: CVS, 23-Aug-2002, 19:15 (and for several preceding weeks at least)\n\n[I mentioned this a while ago on jmeter-user (7-Aug-2002).  I now\nhave a bit more information, so it seems worth filing a bug\nreport.]\n\nIf I watch the Graph Results display during a test run, the \"No\nof Samples\" counts up nicely for the most part, but occasionally\nit'll display a huge, many-digit number very briefly, then go\nback to (as far as I can tell) where it should be.  Something\nlike:\n        318\n        319\n        320\n        323322321\n        324\n        325\n\nI just made those numbers up; they are NOT an accurate replay of\nan example I've seen, since the values flip by too quickly to\nmake that possible.\n\nThe bogus sample \"numbers\" seem to be the string-concatenation of\na few legitimate values.  I'll punctuate the example:\n        318\n        319\n        320\n        323.322.32[1]\n        [324]\n        [325]\n\nThe \".\"s are just for readability.  The \"[]\"s indicate values\nI've guessed at, and which thus shouldn't be trusted too much:\n  - I don't know that the sequence picks up where it should (at\n    324 in this case), again because the numbers aren't on the\n    screen long enough for me to tell\n\n  - The sample-number field clips after 8 digits, so I'm guessing\n    at the last digit of the bogus value.  For all I know, it might\n    sometimes be even longer before clipping:\n        320\n        325.324.32[3.322.321]\n        [326]\n\nFWIW, it once happened that the test run ended with a bogus value\nstill displayed:\n        797\n        800.799.79[8]\nwhere the total sample count expected was 800.  Random chance,\nI presume...\n  \nI've often seen them in decreasing order as shown above; I can't\nrecall whether I've also seen them in increasing order:\n        321.322.32[3]\n\nThis seems to happen more (or exclusively?) with a high number of\nthreads."}, {"count": 1, "tags": [], "bug_id": 12000, "attachment_id": null, "is_private": false, "id": 21663, "time": "2002-08-24T04:27:33Z", "creator": "mstover1@apache.org", "creation_time": "2002-08-24T04:27:33Z", "text": "I'm hoping going to a single-threaded model for notifying listeners will fix this."}, {"count": 2, "tags": [], "creator": "jsalvata@atg.com", "attachment_id": null, "text": "Marking all bugs RESOLVED before JMeter 1.8's release date as VERIFIED.\nYes, it's pretty poor QA procedure, but there's bugs here lingering since JMeter\n1.6, and we need to clean up a little.", "id": 28309, "time": "2002-12-27T16:14:34Z", "bug_id": 12000, "creation_time": "2002-12-27T16:14:34Z", "is_private": false}, {"count": 3, "tags": [], "text": "Bulk-closing all bugs RESOLVED before JMeter 1.8 release date.", "attachment_id": null, "id": 28531, "creator": "jsalvata@atg.com", "time": "2002-12-29T14:19:46Z", "bug_id": 12000, "creation_time": "2002-12-29T14:19:46Z", "is_private": false}]