[{"count": 0, "tags": [], "bug_id": 12113, "text": "I cannot get log4j log output to display to the console, nor can I get \nSystem.out.println to display either.  But the weird thing is, in my servlet's \ninit method I start a java TimerTask, and inside the task I do a log and \nprintln.  These do in fact get displayed in the tomcat console.  This tells me \nI have log4j set up properly to use the ConsoleAppender.  However all the other \nlogging (done in classes called by my servlet) does not show up.  \n\nI've posted this question several times to the mailing list and have not gotten \na response on this.  Please email me for more information.\n\nMichael", "id": 21867, "time": "2002-08-28T06:48:44Z", "creator": "michael@idtect.com", "creation_time": "2002-08-28T06:48:44Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 12113, "is_private": false, "count": 1, "id": 21871, "time": "2002-08-28T07:30:08Z", "creator": "remm@apache.org", "creation_time": "2002-08-28T07:30:08Z", "text": "Those should end up in the logs (there should be a sys.out redirector)."}, {"count": 2, "tags": [], "bug_id": 12113, "attachment_id": null, "id": 21872, "time": "2002-08-28T07:48:09Z", "creator": "michael@idtect.com", "creation_time": "2002-08-28T07:48:09Z", "is_private": false, "text": "This still isn't clear to me.  The problem is log4j's ConsoleAppender is not \nshowing up in the console window.  Are you saying it's not supposed to?  This \nworked with 4.0.4 but stopped working with 4.1.9.  Was this a design change?  \nDebugging is very very difficult without any output in the console.\n\nMichael\n"}, {"count": 3, "tags": [], "bug_id": 12113, "attachment_id": null, "id": 21892, "time": "2002-08-28T13:56:16Z", "creator": "michael@idtect.com", "creation_time": "2002-08-28T13:56:16Z", "is_private": false, "text": "I uninstalled 4.1.9 and installed 4.0.4. When I start tomcat I get pages and \npages of debug log messages on the console from the apache tools I'm using \n(Struts, messenger, etc.).  I uninstalled 4.0.4 and installed 4.1.9 and when I \nrun it I only get 4 lines.  I haven't changed anything in my code or the tomcat \ndirectory.  So I'm 100% positive something is broken in 4.1.9 regarding \noutputing messages to the console.\n\nMichael\n"}, {"attachment_id": null, "tags": [], "bug_id": 12113, "is_private": false, "count": 4, "id": 21939, "time": "2002-08-29T00:11:40Z", "creator": "glenn@apache.org", "creation_time": "2002-08-29T00:11:40Z", "text": "Here is the change that was made in the 4.1 Tomcat branch to\nstdout/stderr logging:\n\nFor those running unix, stdout/stderr has always gone to catalina.out.\nOn windows this goes to the console.\n\nOn a production system a web application may be using API's which end\nup using stdout/stderr for output becuase they aren't aware of the \nServletContext log.  It is more appropriate for this output which is\nrelated to a web application context to get logged to that web application\ncontexts log rather than to the console or catalina.out.  This makes it\neasier to debug problems on a production system.\n\nStarting in the 4.1 version the stdout and stderr generated by code running\nwithin a web application is now logged to that web applications context log.\n\nAnother option called \"swallowOutput\" has been added when configuring a \ncontext which allows you to enable or disable this.  It will be available \nafter tonights nightly build and in the Tomcat 4.1.10 release.\n"}, {"count": 5, "tags": [], "bug_id": 12113, "attachment_id": null, "text": "I think making it configurable is a great solution, especially for developers \nusing IDEs with small monitors.  Thank you for taking the time to add this.\n\nMichael\n", "id": 21943, "time": "2002-08-29T06:52:57Z", "creator": "michael@idtect.com", "creation_time": "2002-08-29T06:52:57Z", "is_private": false}, {"count": 6, "tags": [], "text": "I think the problem has been addressed.", "is_private": false, "id": 22491, "creator": "remm@apache.org", "time": "2002-09-09T10:40:44Z", "bug_id": 12113, "creation_time": "2002-09-09T10:40:44Z", "attachment_id": null}]