[{"count": 0, "tags": [], "creator": "damian.frach@sun.com", "attachment_id": null, "id": 21903, "time": "2002-08-28T15:39:55Z", "bug_id": 12129, "creation_time": "2002-08-28T15:39:55Z", "is_private": false, "text": "The JSP generated servlets have the \"org.apache.jsp\" package. \n\nBut there is no directory structure described by this package (for example \norg/apache/jsp/my_jsp@jsp.java). When we integrate the Tomcat with the \nNetbeans/Forte IDE, the missing package directory structure makes us a lot of \nproblems. Our core code, which we have to use, expects a right directory \npackage structure. Than this core code is not able to find the generated \nservlet, which we mount into the IDE. The mounting is necessary for the \ndebugging.\n\nOnly one work around (which we have found) is we will make a copy of the \nservlet in a good directory structure. But this is not very elegant solution.\n\nDo you want and are you able to fix it?"}, {"count": 1, "tags": [], "bug_id": 12129, "text": "The way package names are handled following the jsp spec. (see JSP.8.2)", "id": 21904, "time": "2002-08-28T16:15:33Z", "creator": "jakarta@trollingers.com", "creation_time": "2002-08-28T16:15:33Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 12129, "attachment_id": null, "text": "It's a long way from   The JSP Page implementation object belongs to an implementation-dependent named package. The package used may vary between one JSP and another, so minimal assumptions should be made.  To   All pages named foobar.jsp are created as org.apache.jasper.foobar_jsp regardless of what webapp and directory they are in.  This is the same problem that JspC has compiling webapps for standard servlet containers.   While it may be spec compliant, as it's just barely defined by the spec, it is a quality of implementation issue. As it stands, the Jasper2 code is very difficult, to impossible, to use outside the Tomcat environment.    ", "id": 21941, "time": "2002-08-29T01:12:16Z", "creator": "steve.downey@netfolio.com", "creation_time": "2002-08-29T01:12:16Z", "is_private": false}]