[{"count": 0, "tags": [], "bug_id": 12228, "text": "See the SVG 1.0 or SVG 1.1 test suite. For example, full-script-handle-03-t.svg\nin the SVG 1.1 test suite.", "id": 22115, "time": "2002-09-02T13:20:05Z", "creator": "vincent.hardy@sun.com", "creation_time": "2002-09-02T13:20:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 12228, "text": "This is a tough one.\n\nCurrently, the Bridge simply does not load the scripts for images.\n\nWhat would need to be done:\n\na. In the Bridge's BaseScriptingEnvironment, modify the loadScript method so\nthat it recursively processes all scripts referenced through <images>. We should\nnot deal with scripts referenced from <use> as our <use> model is broken.\n\nb. The InterpreterPool binds the top-level document object to the \"document\"\nglobal variable. This breaks in the context of scripts for <images>. Therefore,\nwe could either create a separate interpreter for each document or rebind the\ndocument object to each interpreter. The former solution is probably the only\nreal one because different documents will need separate execution contexts to\navoid collisions (e.g., if the same document, using global variables, is loaded\ntwice).\n", "id": 39854, "time": "2003-07-02T14:13:04Z", "creator": "vincent.hardy@sun.com", "creation_time": "2003-07-02T14:13:04Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "After initial work on this bug, I think we should not get into this. We are\nhitting hard limitations of the Batik design. For example:\n\n- Load a root.svg file with references A.svg\n- A.svg contains a reference to a Java handler which starts threads. If the\nreference in root.svg changes from A.svg to B.svg, how do we stop threads in\nA.svg. This has not been accounted for.\n\nAnother difficulty:\n\nPast the initial loading of scripts, how do we / should we handle images which\nare brought in the document (e.g., insertion of an <image> element) or removed\n(e.g., node removal)? There is currently no infrastructure or design to handle\nthe lifecycle of script interpreters. This is very much needed to handle\n<script> elements in <images>", "attachment_id": null, "bug_id": 12228, "id": 39859, "time": "2003-07-02T15:01:19Z", "creator": "vincent.hardy@sun.com", "creation_time": "2003-07-02T15:01:19Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 12228, "is_private": false, "text": "Can't you stop the threads by creating a ThreadGroup for the Java\nHandler?\n\nInterpreters do now have some life cycle management, you can\nnow 'dispose' of an interpreter (and it should drop all it's refs).", "id": 44808, "time": "2003-09-28T23:55:47Z", "creator": "deweese@apache.org", "creation_time": "2003-09-28T23:55:47Z", "attachment_id": null}]