[{"count": 0, "tags": [], "creator": "eric_97@pobox.com", "text": "A U.I. nit:  The inputs to the two styles of random timers have different\nsemantics.  In the Gaussian timer, the Delay Offset provides a \"center point\"\naround which the delays cluster.  In the uniform timer, it provides a strict\nminimum.  They should both work the same way.\n\nMy preference would be for the Gaussian's center-point style.  What one wants to\nsay, in all of the timers, is \"delay for X, plus-or-minus a random delta `tuned'\nby Y\".  Gaussian lets me say that directly (so does the Constant timer,\ntrivially; the delta is always 0).  But uniform makes me do some arithmetic to\nget there.\n\nThe uniform delay calculation could be something like this:\n            delayTime = this.delay + (nextRandom() * 2 - 1) * this.range;\n\nWith this change, the \"Constant Delay Offset\" in both random timers could be\nrelabelled \"Average Delay\", a much less cryptic description, IMO.", "id": 22290, "time": "2002-09-04T20:18:36Z", "bug_id": 12314, "creation_time": "2002-09-04T20:18:36Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "jsalvata@atg.com", "text": "I agree that \"Constant delay offset\" should be renamed to \"Average delay\" in the\ngaussian case, but I disagree with the change in the Uniform Random Timer -- I'd\nrather just rename the \"Constant delay offset\" there to \"Minimum delay\".\n\nWhy? Beacause Min/Max is much easier to understand than Average/Delta. And doing\nit the way you suggest wouldn't actually be uniform either -- one would be using\nthe maximum deviation, the other the standard deviation. And using the standard\ndeviation in the Uniform Random Timer would be ridiculously complex for the user.", "id": 28290, "time": "2002-12-27T10:12:38Z", "bug_id": 12314, "creation_time": "2002-12-27T10:12:38Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 12314, "attachment_id": null, "text": "I liked Jordi's suggestion and did that.", "id": 36134, "time": "2003-04-25T17:58:40Z", "creator": "mstover1@apache.org", "creation_time": "2003-04-25T17:58:40Z", "is_private": false}]