[{"count": 0, "tags": [], "creator": "zacjacobson@hotmail.com", "attachment_id": null, "is_private": false, "id": 22384, "time": "2002-09-06T19:02:37Z", "bug_id": 12375, "creation_time": "2002-09-06T19:02:37Z", "text": "I just installed Apache 1.3.26 on a RedHat7.3 box, and everything seems to work,\nbut when I hit the host with a browser, with IE I get the English page, and with\nMozilla I get French. I sent requests to a little server on my local machine to\nsee what they were sending, and here are the headers:\n\nIE:\nAccept-Language: en-ca,en-gb;q=0.8,en-us;q=0.5,fr-ca;q=0.3\n\nMozilla:\nAccept-Language: en-ca, en-gb;q=0.75, en-us;q=0.50, fr-ca;q=0.25\n\nCould it be the whitespace in the Mozilla Accept-Language line messing up\nApache? I don't think it should be... Why would Apache take the last entry?\n\n\nFull headers:\nIE (returns english page):\nGET / HTTP/1.1\nAccept: */*\nAccept-Language: en-ca,en-gb;q=0.8,en-us;q=0.5,fr-ca;q=0.3\nAccept-Encoding: gzip, deflate\nUser-Agent: Mozilla/4.0 (compatible; MSIE 5.5; Windows NT 5.0; T312461; .NET CLR\n1.0.3705)\nHost: localhost\nConnection: Keep-Alive\n\nMozilla (returns french page):\nGET / HTTP/1.1\nHost: localhost\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.0; en-US; rv:1.1) Gecko/20020826\nAccept:\ntext/xml,application/xml,application/xhtml+xml,text/html;q=0.9,text/plain;q=0.8,video/x-mng,image/png,image/jpeg,image/gif;q=0.2,text/css,*/*;q=0.1\nAccept-Language: en-ca, en-gb;q=0.75, en-us;q=0.50, fr-ca;q=0.25\nAccept-Encoding: gzip, deflate, compress;q=0.9\nAccept-Charset: ISO-8859-1, utf-8;q=0.66, *;q=0.66\nKeep-Alive: 300\nConnection: keep-alive"}, {"count": 1, "tags": [], "bug_id": 12375, "is_private": false, "text": "You haven't told us how the server is setup, so I'm going to guess you\nare talking about the default configuration with the apache \"welcome\" page.\n\nIf so, neither of the Accept-Language headers you quoted match ANY documents.\nThe server is not allowed to match an \"en\" document against a request for\n\"en-ca\", etc.  See http://ppewww.ph.gla.ac.uk/~flavell/www/lang-neg.html\nfor a discussion of this issue.\n\nNow, given that fact, I would have thought you would get a \"No Acceptable Variants\"\nmessage from Apache.  The fact that you aren't getting that could be due\nto some files in the directory without a language attached to them.\n\nI won't close this report yet, but my guess is that this is not a bug.", "id": 22386, "time": "2002-09-06T19:38:46Z", "creator": "slive@apache.org", "creation_time": "2002-09-06T19:38:46Z", "attachment_id": null}, {"count": 2, "text": "Sorry, by \"just installed\" I meant that I had done zero configuration after the\ninstall.\n\nI was mistaken, IE gets french too, not english.\n\nSo for both browsers I've tested, the default welcome page returned is the\nlanguage listed in the locale specified last, not first in the Accept Language\nlist. The document you link to says\n\nIf the server finds no available variant which meets the user's requirements,\nthen one of two procedures can be followed.\n[...]\n   2. Return one of the available variants (presumably the one with highest\nsource quality) as a normal (status 200 OK) response, relying on other means\n(such as the explicit links to other language variants that were already\nrecommended above) for the reader to make any other choice.\n\nDoesn't that mean that if a specific varient is not there, you can make a best\nfit? Can't it go back to the start of the list, and use the first language with\nthe varient stripped? Certainly last language is not a good choice. There is no\nfr-ca doc in the default htdocs directory.\n\nI did add a generic English to my list before fr-ca, and the English doc is now\nshown.", "bug_id": 12375, "is_private": false, "id": 22387, "time": "2002-09-06T20:10:57Z", "creator": "zacjacobson@hotmail.com", "creation_time": "2002-09-06T20:10:57Z", "tags": [], "attachment_id": null}, {"count": 3, "text": "> So for both browsers I've tested, the default welcome page returned is the\n> language listed in the locale specified last, not first in the Accept Language\n> list.\n\nNo.  Apache is returning a document that matches NONE of the languages you\nrequested.  \"fr\" on the server does not match \"fr-ca\" in the Accept-Language.\n\n> Doesn't that mean that if a specific varient is not there, you can make a best\n> fit?\n\nApache is making a best fit.  It just hapens to be using an algorithm you don't\nlike. Of course, you can\nget the algorithm you want simply by configuring your browser correctly.\n\n> Can't it go back to the start of the list, and use the first language with\n> the varient stripped?\n\nSee the ForceLanguagePriority directive in Apache 2.0.  It is highly unlikely\nthat this feature will make it into 1.3.\n\nI'm still a little curious about why you get the french version rather\nthan \"no acceptable variants\", but the bug you originally reported\ndoes not exist, so I will close this.", "bug_id": 12375, "is_private": false, "id": 22388, "time": "2002-09-06T20:24:47Z", "creator": "slive@apache.org", "creation_time": "2002-09-06T20:24:47Z", "tags": [], "attachment_id": null}, {"count": 4, "tags": [], "creator": "zacjacobson@hotmail.com", "text": "> Apache is making a best fit.  It just hapens to be using an algorithm you don't\n> like.\n\nActually, the doc you link to says that by listing fr-ca but not fr, I am\nexplicitly saying I do not want the generic french version. So that it returns\nthe french version is exactly an algorithm I don't like.\n\nI think it should, like you say, return an error if there's not a language-less\ndocument available, or maybe revert to the internal LanguagePriority setting.\n\nBut I guess the behavior that I originally reported does make sense now. Thanks.", "id": 22391, "attachment_id": null, "bug_id": 12375, "creation_time": "2002-09-06T20:44:01Z", "time": "2002-09-06T20:44:01Z", "is_private": false}]