[{"count": 0, "attachment_id": null, "bug_id": 12460, "is_private": false, "id": 22555, "time": "2002-09-09T21:20:04Z", "creator": "jian.cai@sun.com", "creation_time": "2002-09-09T21:20:04Z", "tags": [], "text": "Tomcat5 server hangs when trying to get the database connection with Pointbase \n4.2. \n\nFrom pointbase server, it seems the connection has been made. But the container \nhangs and gives no response during getConnection() while the system is kept \nbusy.\n\nThe datasource was looked up successfully by:\n\ndatasource = (DataSource) ic.lookup(JNDINames.WORKFLOW_DATASOURCE);\n\nBut container hangs when web applicaiton calls:\n\ndbConnection = datasource.getConnection();\n\nThe same code and config worked on Tomcat 4.0 with no problem."}, {"count": 1, "tags": [], "creator": "bob@jadn.com", "text": "Ok, that sounds weird... I would imagine a class loader issue.\n\nHow do I set this up?  Download from pointbase.com?  install DB?  Create users? \n", "id": 22835, "time": "2002-09-13T16:37:58Z", "bug_id": 12460, "creation_time": "2002-09-13T16:37:58Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 12460, "is_private": false, "id": 25727, "time": "2002-11-05T21:42:36Z", "creator": "topher1120@hotmail.com", "creation_time": "2002-11-05T21:42:36Z", "tags": [], "text": "I don't know how you are coming along with the fix of this one, but I can \nsupply a little more information...\nThis is also apparent in Tomcat 4 and only affects Windows installs.  I have \ntried tomcat 4.1.12 with a Win2k machine trying to connect to a Cloudscape db \nas well as an Oracle db.  I have also tried tomcat 4.1.12 on WinXP connecting \nto MySQL and MS SQL Server.  Both installs hung when trying to get a \nconnection.  The code I used is nearly identical to that referenced in 'JDBC \nDataSource HOW-TO'. Finally, I installed tomcat 4.1.12 on Mandrake and the \nexact code I ran on the WinXP machine succeeded, giving me a connection to the \nMySQL and MS SQL Server db's.  I could not try the Oracle db because it is at \nanother company.\nHope this helps a little.\nThanks,\nChris Marks"}, {"count": 3, "tags": [], "creator": "remm@apache.org", "text": "This cannot be a bug in Tomcat. Doing a thread dump should confirm this. You\nmight want to file a bug against commons-dbcp (with at least some stack\ninformation added).", "id": 26380, "time": "2002-11-15T13:53:22Z", "bug_id": 12460, "creation_time": "2002-11-15T13:53:22Z", "is_private": false, "attachment_id": null}]