[{"count": 0, "tags": [], "text": "Hi,\n\nI am countering a problem on Solaris 8 with Apache 2.0.39. After I had my \napplication running for couple days, I saw some images broken. After refreshing \nthe browser, it could be ok or other images could be broken. I checked the \napache error_log, I found the apache ran out of file descriptors, the message \nshowed:\n\n[Mon Sep 09 19:01:42 2002] [warn] new file descriptor 1357 is too large; you \nprobably need to rebuild Apache with a larger FD_SETSIZE (currently 1024) \n\nBefore we built Apache, we already set file descriptor to 4096 with set \nrlim_fd_max=4096 and set rlim_fd_cur=4096 in /etc/system. \n\nThe workaround of problem is that stop and start Apache server again, so it \nseems to me that Apache is leaking fds. I am wondering anyone has seen the same \nproblem and what is the solution. It apparently very critical for our \nproduction customer.\n\nThanks a lot!\n\nMaggie Cai", "attachment_id": null, "id": 22853, "creator": "mcai@ariba.com", "time": "2002-09-13T21:39:53Z", "bug_id": 12635, "creation_time": "2002-09-13T21:39:53Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 12635, "attachment_id": null, "text": "[This is a mass bug update.]\nThis bug reports a problem in an older version of Apache 2.\nCould you please update to the most recent version and see\nif you can reproduce this problem.  If the bug still exists,\nplease update the bug with the latest version number.  If \nthe bug no longer exists, please close the bug report.\n\nSorry for this impersonal response, but we get many more bug\nreports than our volunteers can keep up with.\nThanks for using Apache!", "id": 24726, "time": "2002-10-17T02:34:58Z", "creator": "slive@apache.org", "creation_time": "2002-10-17T02:34:58Z", "is_private": false}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "[This is a mass bug update.] [Resolve-20021102]\nNo response from submitter; assuming issue is resolved.\nIf the problem still exists in the lastest version,\nplease reopen this report and update appropriately.", "id": 25548, "time": "2002-11-02T20:18:34Z", "bug_id": 12635, "creation_time": "2002-11-02T20:18:34Z", "is_private": false}]