[{"text": "mod_negotiation seems to have unpleasant and uncontrolled interactions with\nRedirectMatch.  Here's one example: take an empty directory on a fresh standard\nApache configuration.  Add the MultiViews option and AllowOverride All.  Create\na file called, say, \"google2.txt\" (see URI on this bug report for an example),\nbut do _not_ create a file called \"google2\".  Further create a .htaccess file\ncontaining the single line \"RedirectMatch Permanent google2.*$\nhttp://www.google.com/\" (see the .htaccess file in the URI on this bug report,\nwhich is publicly readable).  Now use a browser and try to access \"google2\"\n(with no extension) in the directory in question.  This results in a 404 error\nsaying \"google2\" does not exist.  This is true, of course, but the behavior is\nunacceptable: either the RedirectMatch should be heeded before MultiViews (in\nwhich case the browser should be redirected to Google) or after (in which case\ngoogle2 should be treated as google2.txt but should anyway be redirected to\nGoogle); but the 404 error should certainly not occur.\n\nNote that if the file \"google2.txt\" does not exist (see the example of \"google1\"\nfrom the URI on this bug report) or on the contrary if the file \"google2\" _does_\nexist (see the example of \"google3\" from the URI) then the redirection works as\nexpected.\n\nI am told that even stranger things can happen if some files are actually\ndirectories.  I have not tested this.", "tags": [], "creator": "david.madore@ens.fr", "attachment_id": null, "count": 0, "id": 22884, "time": "2002-09-15T19:09:26Z", "bug_id": 12664, "creation_time": "2002-09-15T19:09:26Z", "is_private": false}, {"count": 1, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "[This is a mass bug update.]\nThis bug reports a problem in an older version of Apache 2.\nCould you please update to the most recent version and see\nif you can reproduce this problem.  If the bug still exists,\nplease update the bug with the latest version number.  If \nthe bug no longer exists, please close the bug report.\n\nSorry for this impersonal response, but we get many more bug\nreports than our volunteers can keep up with.\nThanks for using Apache!", "id": 24711, "time": "2002-10-17T02:34:38Z", "bug_id": 12664, "creation_time": "2002-10-17T02:34:38Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 12664, "attachment_id": null, "id": 25536, "time": "2002-11-02T20:18:17Z", "creator": "slive@apache.org", "creation_time": "2002-11-02T20:18:17Z", "is_private": false, "text": "[This is a mass bug update.] [Resolve-20021102]\nNo response from submitter; assuming issue is resolved.\nIf the problem still exists in the lastest version,\nplease reopen this report and update appropriately."}]