[{"count": 0, "text": "In the current code of the <script> optional task that uses BSF,\nit is failing to create a majority of useful 'beans' becaus the code\ncurrently will only use declareBean() on the BSF manager and only if\nany bean name is Character.isJavaIdentifier valid...\n\nThus, the code then ends up excluding any property of the ant project that \nincludes a dot \".\" and a vast majority of the properties as well as a common\nconvention for user properties ends up not being defined.\n\nWhile it is desirable for all ant project properties to be automatically\ndefined using declareBean on the BSF Manager,\nit would also be just as useful and feature complete if the script task\nwould not just throw away properties not valid for declareBean,\nbut instead define them at least using\nBSF Manager's  registerBean() so that all properties could be found\nusing bsf.lookupBean() which uses the string of the bean name and does\nnot carry the naming restriction that declareBean does\n\nThat way, all properties could be found with bsf's lookupBean instead\nof just those that happen to work with declareBean\n\nPlease consider adding this to the script task functionality as it really\nlimits a script's access to all the properties defined.\n\nThe current workaround is to know\n\nproject.getProperties().get(\"ant.file\")\n\nwhere at least\n\nbsf.lookupBean(\"ant.file\")\n\ncould be made to work\n\nThanks\nJeff", "bug_id": 12709, "attachment_id": null, "id": 22958, "time": "2002-09-16T21:51:48Z", "creator": "jadams@enteract.com", "creation_time": "2002-09-16T21:51:48Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "peter.reilly@corvil.com", "attachment_id": null, "id": 47777, "time": "2003-11-21T14:36:51Z", "bug_id": 12709, "creation_time": "2003-11-21T14:36:51Z", "is_private": false, "text": "I am marking this as WONTFIX.\nOne can access all the properties via project.getProperty(name)\nhaving non valid names as varible names will not work for most BSF supported\nlanguages.\n"}, {"count": 2, "tags": [], "bug_id": 12709, "attachment_id": null, "is_private": false, "id": 47778, "time": "2003-11-21T14:48:02Z", "creator": "jadams@enteract.com", "creation_time": "2003-11-21T14:48:02Z", "text": "That is a reasonable reason to not add them if one can still access them,\nbut then I would question the current consistency of\nhaving some declared as beans and some not solely on the style\nof their name.\n\nIf it is recommended to use project.getProperty(name) perhaps\nno properties should be declared as beans for consistency sake.\n\nThanks for looking at this\nJeff"}]