[{"count": 0, "tags": [], "text": "Hi there,\n\nI am using the jdbc taglibs to retrieve some data from mySQL. When i look at \nthe data in my mySQL client, the international characters show up as they are \nsupposed to. But when I use the taglibs and show the data on a webpage, the \ncharacters show up as ??. I have looked over the code for one of the classes \nand I think that you can solve the problem with international characters if you \nuse getAsciiStream() instead of getCharacterStream(). The getCharacterStream \nreturns unicode characters, and it looks like java dosen't know how to \ntranslate properly from unicode to asci.??\n\nThe characters that i have noticed that dosent come out right are: &aelig; \n&oslash; &aring; &Aelig; &Oslash; &Aring; (escaped)\n\nWhen i create a connection to the database with the regular jdbc and do my sql \nand retrieves the data from the resultset with rs.getString(\"fieldname\") then \neverything turns up as supposed.\n\nI am running on a Solaris 8/Intel with Danish character set. 640 Megs of ram \nand mySQL 3.22.25.  The jdbc driver I am using is: org.gjt.mm.mysql.Driver\n\nI could fix the problem myself, but I would rather have you do the fixes, so i \ncan cotinue to upgrade the taglibs. \n\nThank you in advance.\n\nBjorn Smith", "is_private": false, "bug_id": 1273, "id": 1793, "time": "2001-04-09T11:15:02Z", "creator": "bbs@smithfamily.dk", "creation_time": "2001-04-09T11:15:02Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 1273, "attachment_id": null, "is_private": false, "id": 3102, "time": "2001-06-19T22:53:15Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-06-19T22:53:15Z", "text": "This seems a problem with the taglib, not with tomcat. I don't know how to transfer this bug to jakarta-taglibs, please file it again in the right \nproduct.\n\nEncoding problems are quite difficult, and most of the time it's the browser who refuse to send the charset on the request - so nobody knows what's the right one to use. And of course, the default in the servlet api is 8859_1,\nnot UTF8, so unless you have a magic browser ( lynx is the only one to send \nthe encoding ) you can have problems. In 3.3 we use per/session encoding, and \nyou can set a default per context."}]