[{"count": 0, "tags": [], "creator": "jfletcher@quark.com", "is_private": false, "text": "http://server:port/ - An origin server, in my case it's not running Apache, but \nI doubt that that matters.\nhttp://proxy:port/ - A 2.0.40 Apache server acting as a proxy.\n\nIf I hit http://server:port/ in the browser, the server replies with a 301\nand the browser's URL changes to the the new Location.  Fine.\n\nIf I set up the Apache proxy server with:\n<IfModule mod_proxy.c>\n\tProxyRequests On\n\tProxyPass / http://server:port/\n\tProxyPassReverse / http://server:port/\n</IfModule mod_proxy.c>\n\nAnd hit http://proxy:port/ in the browser, there is a delay, equal to the\nApache proxy Timout setting, before the reply ends up in the browser.\nWhen I hit http://proxy:port/, the origin server is responding with the 301\nimmediately, and it really seems like Apache is waiting (for the Timeout\nduration) before it does the new request.\n\nIf I hit http://proxy:port/resource/that/exists.html, I get the reply\nimmediately.\n\nThis same configuration works fine for me in Apache 1.3.22, which I also\nhave installed and set up as a proxy to the same origin server.  In this\ncase, I do not get the Timeout delay.", "id": 23020, "time": "2002-09-18T12:07:19Z", "bug_id": 12767, "creation_time": "2002-09-18T12:07:19Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "slive@apache.org", "is_private": false, "text": "[This is a mass bug update.]\nThis bug reports a problem in an older version of Apache 2.\nCould you please update to the most recent version and see\nif you can reproduce this problem.  If the bug still exists,\nplease update the bug with the latest version number.  If \nthe bug no longer exists, please close the bug report.\n\nSorry for this impersonal response, but we get many more bug\nreports than our volunteers can keep up with.\nThanks for using Apache!", "id": 24696, "time": "2002-10-17T02:34:16Z", "bug_id": 12767, "creation_time": "2002-10-17T02:34:16Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 12767, "text": "[This is a mass bug update.] [Resolve-20021102]\nNo response from submitter; assuming issue is resolved.\nIf the problem still exists in the lastest version,\nplease reopen this report and update appropriately.", "count": 2, "id": 25525, "time": "2002-11-02T20:18:02Z", "creator": "slive@apache.org", "creation_time": "2002-11-02T20:18:02Z", "is_private": false}]