[{"count": 0, "tags": [], "creator": "hmerrill@redhat.com", "is_private": false, "text": "After upgrading my machine to Apache 2.0.40 and Perl 5.8.0, my Perl CGI script\nis acting funny.  This script does a POST back into itself by *not* specifying\nan ACTION.  For debugging, I put a 'print STDERR \"Some text\\n\";' at the top of\nmy script - the 1st time into this script, that print appears in the Apache\nerror_log, but after the POST, the print should appear again, but it doesn't.  I\nknow execution *is* coming back into the same script, because if I remove the\nSTDERR from the print(so that it is printing to STDOUT), I get the typical \"Bad\nheader\" error.\n\nIs this a bug with Apache 2.0?  Using 'print STDERR \"blah blah\\n\";' always\nworked for me before this - those prints always appeared in the Apache error_log.", "id": 23093, "time": "2002-09-19T12:59:45Z", "bug_id": 12812, "creation_time": "2002-09-19T12:59:45Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "slive@apache.org", "text": "[This is a mass bug update.]\nThis bug reports a problem in an older version of Apache 2.\nCould you please update to the most recent version and see\nif you can reproduce this problem.  If the bug still exists,\nplease update the bug with the latest version number.  If \nthe bug no longer exists, please close the bug report.\n\nSorry for this impersonal response, but we get many more bug\nreports than our volunteers can keep up with.\nThanks for using Apache!", "id": 24724, "time": "2002-10-17T02:34:56Z", "bug_id": 12812, "creation_time": "2002-10-17T02:34:56Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "slive@apache.org", "is_private": false, "text": "[This is a mass bug update.] [Resolve-20021102]\nNo response from submitter; assuming issue is resolved.\nIf the problem still exists in the lastest version,\nplease reopen this report and update appropriately.", "id": 25547, "time": "2002-11-02T20:18:33Z", "bug_id": 12812, "creation_time": "2002-11-02T20:18:33Z", "attachment_id": null}]