[{"count": 0, "tags": [], "bug_id": 1304, "text": "I like to use properties in the link tag of a javadoc task (which isn't a \nproblem). This makes it possible for somebody else to override the location of\nthe linked documentation. But what happens if he doesn't have a special \ndocumentation and is not interested in obtaining it? The task will not work\nproperly.\n\nTherefore I suggest to add the attribute \"if\" to the link tag to achieve \nconditional linking of the documentation.", "id": 1833, "time": "2001-04-11T01:27:41Z", "creator": "boris@i3.informatik.rwth-aachen.de", "creation_time": "2001-04-11T01:27:41Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "nico@apache.org", "text": "Have you tried to use something like the following? \n\n<target name=\"javadoc\" depends=\"default-javadoc,custom-javadoc\"/>\n\n<target name=\"custom-javadoc\" if=\"javadocProperty\">\n  <javadoc ...>\n</target>\n\n<target name=\"default-javadoc\" unless=\"javadocProperty\">\n  <javadoc ...>\n</target>\n\nThat should do what you want (although it's a little bit more typing and you \nget nearly duplicate targets)", "id": 1834, "time": "2001-04-11T01:47:50Z", "bug_id": 1304, "creation_time": "2001-04-11T01:47:50Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 1304, "text": "No I didn't but the problem with such a soulution is that it would be \nexponentially raise the number of targets which is not desirable. \n\nAn example: You want links to J2SEE, J2EE, Log4j and Xerces documentation. \nSomeone might be interested in all and antoher one wants to skip Log4j and \nXerces. Now you have a real problem.\n\nSo I suggest to add an `if' attribute like the one used in `target'. Since it\nshould be possible to change the property from the outside and an empty URL is\nacceptable from my point of view to indicate that a javadoc is not installed we \nneed some to identify an empty property with a not-defined property (maybe \nthat's already the case, I don't know).\n\nIt may also be a good idea to allow the definition of a well-known URL for \njavadoc's which is used if you have web access and the property isn't defined. \nI'd like to make a difference between the well-known URL and a custom one \nbecause some people (like me) tend to have the javadoc's installed localy. But I\nthink this is gold-plating and not really necessary.", "id": 1838, "time": "2001-04-11T02:39:02Z", "creator": "boris@i3.informatik.rwth-aachen.de", "creation_time": "2001-04-11T02:39:02Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "gholam@xtra.co.nz", "attachment_id": null, "text": "I have done this previously but the patch was part of the filterset patch.\nI will submit a patch for just this.\n\nMichael", "id": 1900, "time": "2001-04-18T12:28:02Z", "bug_id": 1304, "creation_time": "2001-04-18T12:28:02Z", "is_private": false}, {"count": 4, "tags": [], "creator": "gholam@xtra.co.nz", "attachment_id": 97, "text": "Created attachment 97\nA patch to add conditional support to javadoc links.", "id": 1901, "time": "2001-04-18T13:18:33Z", "bug_id": 1304, "creation_time": "2001-04-18T13:18:33Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 1304, "text": "I have changed javadoc so that if the package-list is not found for offline \nlinks, the link is skipped (with a verbose message). I think this may be a \nbetter approach than using \"if\" conditionals at the nested element level. The \nsame could be done for non-offline links by checking if the href is empty \nalthough I haven't changed this and it still gives an error. It could also be \nchecked to see if it is a valid URL. Let me know.", "id": 3493, "time": "2001-07-07T23:27:47Z", "creator": "conor@apache.org", "creation_time": "2001-07-07T23:27:47Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 1304, "attachment_id": null, "id": 3505, "time": "2001-07-09T02:01:59Z", "creator": "boris@i3.informatik.rwth-aachen.de", "creation_time": "2001-07-09T02:01:59Z", "is_private": false, "text": "You are right. But I think it should be checked if non-empty links are empty, too\n(as you suggested). I don't think that it is really necessary to check if a URL is\nvalid."}, {"count": 7, "tags": [], "creator": "conor@apache.org", "attachment_id": null, "text": "Now checks for link being present non empty and a valid URL. If this i not the\ncase the link is skipped (with a message logged).\n\nFixed on 1.5 branch", "id": 15237, "time": "2002-05-01T12:22:55Z", "bug_id": 1304, "creation_time": "2002-05-01T12:22:55Z", "is_private": false}]