[{"count": 0, "tags": [], "bug_id": 13179, "attachment_id": null, "text": "Have one thread consisting of two Simple Controllers.  The first consisting of \na single HTTP Request used to setup of the form.  The second consisting of a \nsingle HTTP Request for post processing of the form.  The script looks like the \nfollowing:\n\nThread\n-Simple Controller\n--HTTP Request (Form Setup - GET method)\n-Simple Controller\n--Modification Controller\n---HTML Parameter Mask\n---HTML Parameter Mask\n---HTML Parameter Mask\n---HTTP HTML Link Parser\n---HTTP Request (Form Processor - POST method)\n\nThe HTML Parameter Masks work as they should, but for some reason JMeter just \ncan't seem to find the form values to use with the parser.  The parameters that \nare to use the parser in the form processer have been specified and with a \nvalue of .* .  Please send me any feedback you can.  \n\nThis is a simple test and should be reproducable.  As a side note, the requests \nare accessing JSP pages.  I have taken a look at the returned html after \nrendering of the page to html and the appropriate form fields do exist.", "id": 23693, "time": "2002-10-01T16:11:17Z", "creator": "bfunk@ptc.com", "creation_time": "2002-10-01T16:11:17Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 13179, "is_private": false, "text": "Does it work now with 1.8?\n\nIf it doesn't, please send attach Test Case and the form page to this bug\nreport. (You can obtain the form page with your browser and do a \"Save page\").\nEven better if you can reproduce this on some site accessible over the Internet\nso that we can actually try out.\n", "id": 29164, "time": "2003-01-10T22:33:39Z", "creator": "jsalvata@atg.com", "creation_time": "2003-01-10T22:33:39Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "jsalvata@atg.com", "text": "Can't reproduce this with some more info. Anyway, it should be possible to work\naround the problem using regexFunctions. So I'm setting this to medium priority.", "id": 29652, "time": "2003-01-18T16:03:33Z", "bug_id": 13179, "creation_time": "2003-01-18T16:03:33Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "mstover1@apache.org", "attachment_id": null, "id": 30192, "time": "2003-01-28T18:36:43Z", "bug_id": 13179, "creation_time": "2003-01-28T18:36:43Z", "is_private": false, "text": "this is impossible to debug as is. I'd recommend closing it since we haven't\nheard from the reporter in a while.  It could be he's using a bad regular\nexpression, or has some other problem we'd never guess.  "}]