[{"count": 0, "text": "In StringManager.java(line 115), ResourceBundle is used to load in a resource \nfile.  No classloader is specified on this call, this causes the ClassLoader \nthat ResourceBundle.class was loaded with to be used.\n\nI'm trying to embed Tomcat into my application by using my own ClassLoader.  \nThings work fine, except when Tomcat uses system classes to load resources.  \nSince the system classes, like ResourceBundle, were loaded prior to my \nClassLoader...Tomcat can't find the resource specified in its own jar files.\n\nA more flexable approach would be to call ResourceBundle.getBundle\n(\"bundlename\", defaultLocale, getClass().getClassLoader()).\n\nThis would enable folks to more easily embed the catalina code in their systems.\n\nThanks,\nRay", "bug_id": 13307, "attachment_id": null, "id": 23945, "time": "2002-10-04T18:33:43Z", "creator": "ray.roberts@lmco.com", "creation_time": "2002-10-04T18:33:43Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 13307, "text": "I'm confused. Did you test and did it help ?\n\nResourceBundle.getBundle does not use ResourceBundle.class's loader but *the \ncaller's* loader, i.e. StringManager's. That renders your change a noop.\n\nResourceBundle#getBundle:\nGets a resource bundle using the specified base name, the default locale, and \nthe caller's class loader.\n", "id": 51168, "time": "2004-01-26T00:07:25Z", "creator": "ernst.matthias@gmail.com", "creation_time": "2004-01-26T00:07:25Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 13307, "text": "It's been awhile since I looked at this code, and I don't have the source in \nfront of me now.  But going from my first paragraph, If you don't specify a \nclassLoader to ResourceBundle, then it uses the classloader that ResourceBundle \nwas loaded with.(<--Which is not necessarily the classloader that the calling \nclass was loaded with.).\n\nIf that doesn't wash with what you know, let me know and I'll investigate it \nsome more when I get back to work and have access to the source.\n\nI gave up on trying to embed Catalina within my application.  We had originally \nbeen using Jetty, but were told at the time that we weren't allowed to use it \nbecause of it's Foreign origins.(You know...you can't trust those Aussies. ;-\n) )  I then tried to embed Tomcat, but found that it was easier to write my own \nsimple servlet container.  Eventually, we convinced our security folks to trust \nthe Aussies and we reverted to using Jetty.  We still use Tomcat for most of \nour stuff, but Jetty is infinitely easier to embed.\n\nHope this helps.", "id": 51169, "attachment_id": null, "creator": "ray.roberts@lmco.com", "creation_time": "2004-01-26T05:01:45Z", "time": "2004-01-26T05:01:45Z", "is_private": false}, {"count": 3, "text": "I have confirmed the comment from Matthias Ernst that the change you requested \nwould have no effect.\n\nI am therefore going to mark this as WONTFIX. If you do revisit this at some \npoint in the future and identify an alternative solution, please feel free to \nreopen this bug report.", "bug_id": 13307, "attachment_id": null, "id": 51204, "time": "2004-01-26T18:48:03Z", "creator": "markt@apache.org", "creation_time": "2004-01-26T18:48:03Z", "tags": [], "is_private": false}]