[{"count": 0, "tags": [], "bug_id": 13323, "attachment_id": null, "text": "the property files loose all the formating and comments of the properties when \nbeing updated using propertyfile task. \nI have a fix that I applied to my own ant installation I would like to see it \nin the subsequent ant version.", "id": 23976, "time": "2002-10-04T23:29:18Z", "creator": "sgabriel@brainfuse.com", "creation_time": "2002-10-04T23:29:18Z", "is_private": false}, {"count": 1, "attachment_id": 7111, "bug_id": 13323, "text": "Created attachment 7111\nNew property file task that uses enhanced properties object", "id": 40027, "time": "2003-07-06T23:48:57Z", "creator": "sgabriel@brainfuse.com", "creation_time": "2003-07-06T23:48:57Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "sgabriel@brainfuse.com", "attachment_id": 7112, "is_private": false, "id": 40028, "time": "2003-07-06T23:49:25Z", "bug_id": 13323, "creation_time": "2003-07-06T23:49:25Z", "text": "Created attachment 7112\nthe enhanced properties object used by the porperty file task"}, {"count": 3, "tags": [], "bug_id": 13323, "attachment_id": null, "id": 40029, "time": "2003-07-06T23:49:58Z", "creator": "sgabriel@brainfuse.com", "creation_time": "2003-07-06T23:49:58Z", "is_private": false, "text": "Any body is interested in this fix. It is really a big deal for me and I am \nsure for a lot of other people. \nI am attaching my fix. I am positive it doesn't fit the style for every you \nguys, But let me know and I will change it.\n"}, {"count": 4, "tags": [], "creator": "sgabriel@brainfuse.com", "attachment_id": null, "text": "The heart of the solution resides in overriding the java.util.Properties to \nprovide a better writing mechanism. I had to copy some of the private methods \nwritten in the java.util.Properties to change the loading and saving scheme of \nfiles. \nThe PropertyFile task doesn't change except for initializing the class \nvariable into EnhancedProperties class instead of java.util.Properties and \nthen everything else works the same way.\nThis solution has been used for over a year in our project and I really would \nappreciate if one of the commiters would insert it into cvs.\n", "id": 40030, "time": "2003-07-06T23:56:37Z", "bug_id": 13323, "creation_time": "2003-07-06T23:56:37Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 13323, "text": "I'd like to see this added, and here's why..\n\nSince you have written a customized property file writing mechanism I was\nlooking at it to see if it solves one of my problems. I think if an option to\nnot write the date comment could be provided it would help my application. I\nwind up with a whole bunch of spurious cvs commits in an automated mechanism\nthat I wrote for recording symlinks on my website with my <symlink> task. The\nproblem is due to dates changing in otherwise identical property files. While\nIdeally, I should simply not write the file if there are no changes, but that\ntakes some work of checking for an existing file, loading it and comparing the\nresults. I think my task will probably run faster if I just write the file as I\nam doing and this could be a simpler fix to my problem.\n\nSo if you can find a way to throw in a nodate option, I will probably rework my\n<symlink> code to take advantage of it... \n\nOn the level of details I notice that yor code will probably need some changes\nbefore the committers accept it. Ant uses these code conventions\n\nhttp://java.sun.com/docs/codeconv/html/CodeConvTOC.doc.html\n\nquick issues I saw included lines over 80, single line ifs that don't have {} and \n\n if ( propLine == null )\n        {\n\ninstead of\n\n if ( propLine == null ) {\n\nAlso I noticed some funny randomish spacing around some asignments.", "id": 40187, "time": "2003-07-08T15:46:21Z", "creator": "gus.heck@olin.edu", "creation_time": "2003-07-08T15:46:21Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 13323, "attachment_id": null, "text": "If this contains copied Sun code, it won't be accepted.", "id": 75462, "time": "2005-05-26T23:39:12Z", "creator": "mbenson@apache.org", "creation_time": "2005-05-26T23:39:12Z", "is_private": false}]