[{"count": 0, "attachment_id": null, "bug_id": 13353, "text": "I discovered the hard way that if I use <delete> to delete a temporary directory\ncreated by the build then I must be very careful not to create symbolic links,\nfor test purposes say, to directories outside of my test data. I lost about 6\nhours recovering and only because I had a fairly recent backup. It wasn't that I\nwas completely stupid ;-) but that I made a series of changes none of which\nintroduced obvious risk.\n\nI consider this a bug because this sort of thing does not happen with other\ntools available on platforms that support symbolic links. I believe it was\nintroduced sometime since August judging by ant-dev archive. I have a patch that\nuses utils/FileUtils in taskdefs/Delete.java to check that a directory is not a\nsymbolic link before descending into it, but I am not sure of issues such as\nbackward compatibility. I suggest it might be optional but the default should\nnot descend such links.", "id": 24051, "time": "2002-10-07T04:13:35Z", "creator": "JimWright@quick.cz", "creation_time": "2002-10-07T04:13:35Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "JimWright@quick.cz", "attachment_id": null, "is_private": false, "id": 24118, "time": "2002-10-08T08:16:05Z", "bug_id": 13353, "creation_time": "2002-10-08T08:16:05Z", "text": "I will wait for comment from \"insiders\" before submitting my trivial patch.\nThe other issue is perhaps interpretion of filesets etc.\n\nOne never actually wants to follow symbolic links outside of the directory\nbeing deleted - that's the other main reason this is a bug and not the behaviour\nof native tools.\n\nThe other part of the fix might be an appropriately worded warning in the docs\nbecause even if symbolic links are recognised, if you export a Linux file system\nusing SAMBA and compile under windows, they will not be recognised. Ant being\ncrossplatform, that is exactly the sort of thing one might want to do."}, {"count": 2, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "text": "I'd be very interested in your \"trivial patch\" when it comes to the samba\nand Windows issue you describe.  How do you detect a symlink on a samba shared\ndrive from within Java?\n\nFor backwards compatibility Ant will have to follow symlinks by default.  Does\ndelete follow them if you set the followsymlinks attribute to false on\nyour filesets?", "id": 24119, "time": "2002-10-08T08:39:43Z", "bug_id": 13353, "creation_time": "2002-10-08T08:39:43Z", "is_private": false}, {"count": 3, "tags": [], "text": "I suspect that this is a duplicate of 1550 is it not? ", "attachment_id": null, "bug_id": 13353, "id": 24159, "time": "2002-10-08T22:14:05Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-10-08T22:14:05Z", "is_private": false}, {"count": 4, "tags": [], "text": "Yes this looks like a duplicate of 1550 which was fixed. My suspicion is that it\nhas been reintroduced.\n\nRegarding my patch, it is not only trivial but probably insufficient which is\nwhy I have not submitted it and the point I was making Stefan. You made it even\nbetter! (Also, it looks more complicated than it is due to increased indentation\ninside new if statement.)\n\nI'm not sure about this backward compatibility issue, especially if 1550 was\nrecently re-introduced. It seems to me you have to balance this with the\nquestion of whether it does the right thing by default. Few people if any will\nbe relying on it doing the wrong thing but many more may end up deleting their\ndata accidentally.\n\nSo I still think, change the default, possibly add new features and put a\nwarning in the docs re SAMBA etc.\n\nI will look into followsymlinks on filesets if I find time.\n\nRegards\n", "attachment_id": null, "bug_id": 13353, "id": 24242, "time": "2002-10-09T22:34:58Z", "creator": "JimWright@quick.cz", "creation_time": "2002-10-09T22:34:58Z", "is_private": false}, {"count": 5, "tags": [], "creator": "JimWright@quick.cz", "is_private": false, "text": "Sorry, original comments about bug being introduced since August were probably\nwrong. There is some discussion about something similar here:\n\nhttp://marc.theaimsgroup.com/?l=ant-dev&m=102953577003770&w=2\n\nbut no sign of any such changes in taskdefs.Delete.removeDir(File) or exec().\n\nMy <delete> task was <delete dir=\"test/unit/output\"/> and I haven't tried a\nfileset but think that even if there is a way of not deleting symbolic links, it\nis still a bug. It seems to me that any cases where you want to follow a\nsymbolic link to directory and delete files (because you are not picking them up\ndirectly) are very obscure.", "id": 24324, "time": "2002-10-10T23:50:34Z", "bug_id": 13353, "creation_time": "2002-10-10T23:50:34Z", "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 13353, "is_private": false, "id": 24354, "time": "2002-10-11T13:48:05Z", "creator": "bodewig@apache.org", "creation_time": "2002-10-11T13:48:05Z", "tags": [], "text": "Well, it all is about backwards compatibility, sorry.\n\n<delete dir=\"somedir\"/>\n\nis the traditional way to say \"delete this directory and all its contents,\ndon't ask any questions.  The kind of task you use when running a \"clean\" target.\n\nIf you want to do anything more sophisticated, use nested filesets.\n\n<fileset> in turn didn't know about symbolic links until Ant 1.5 (as Java doesn't\nknow about them and we are still not sure whether the code we use works for\nall operating systems - especially systems that are not Unix-like).  To have\nthe complete same semantics as Ant 1.4, the only possible choice for Ant\nis to follow symbolic links by default.\n\n<delete> is special in a certain sense - it supports an followsymlinks attribute\n(inherited by MatchingTask) but ignores it unless you've also specified\nsome include or exclude patterns.  This is going to be fixed in CVS in a few\nminutes.  After that,\n\n<delete dir=\"foo\" followsymlinks=\"false\"/>\n\nis going to be close to what you want, but still not the default.\n"}, {"count": 7, "tags": [], "bug_id": 13353, "text": "Yep, you spotted the one case that isn't obscure, as I did after sending last\ncomment.And we don't want to get into \"somedir/\" versus \"somedir\" for a\ncrossplatform tool.\n\nAssuming <delete dir=\"foo\" followsymlinks=\"false\"/> is in the docs then I'm\nhappy. (I am anyway, because I won't make the same mistake again.) Thanks for\nyour rapid response.\n\nWe could still point out in the docs that it won't necessarily work, over\nnetworks etc. but the main thing is to draw attention to the issue by\ndocumenting the feature, as usual.", "id": 24381, "time": "2002-10-12T00:06:54Z", "creator": "JimWright@quick.cz", "creation_time": "2002-10-12T00:06:54Z", "is_private": false, "attachment_id": null}]