[{"count": 0, "tags": [], "bug_id": 13368, "attachment_id": null, "text": "We are currently running both MS IIS5 and Apache 1.3.27 simulatenously on \nseveral Windows 2000 Advanced Servers (W2K,sp3,current on all service/hotfixes \nas of 10/04), each web server has its own dedicated IP address.  Now we are \ntrying to upgrade to the new 2.x series of Apache and it is not working.   \n\nFYI: Even with the 1.3.x series, we always have to start MS IIS first, then the \nApache service, but at least it works this way, but not at all with 2.x.\n\nWe have two IPs bound to the same NIC in the machines.   I have configured IIS \nto bind specifically to its own IP in both the FTP and IIS settings within the \nMS Console.   \n-------------\nIIS is bound to 165.xxx.xxx.237\nApache is bound to 165.xxx.xxx.238\n-------------\nStarting Apache2 from command-line for the moment (starting via services yields \nthe same failure) yields the following:\n\nD:\\Apache2\\bin\\Apache.exe -w -n \"Apache2\" -k start\n(730048)Only one usage of each socket address (protocol/network address/port)  i\ns normally permitted.  : make_sock: could not bind to address 165.xxx.xxx.238:80\nno listening sockets available, shutting down\nUnable to open logs\n\n*Please NOTE that is says 238 is occupied and unusable... IIS is bound to 237 \nnot 238.  This works fine on 1.3.27\n\nThe only change I have made at this point to the stock httpd.conf is around \nline #124 regarding the LISTEN directive:\n\nListen 165.xxx.xxx.238:80\n\nIf I change the LISTEN directive to use a non-80 port, then it fires up just \nfine with IIS5 running.  Once again I repeat, IIS5 is on IP#1 (237), Apache is \non IP#2 (238).   \n-------------\nIf I take a stock Apache 1.3.27 httpd.conf, then I apply the following to the \nLISTEN and BIND directives:\n\nListen 165.xxx.xxx.238:80\nBindAddress 165.xxx.xxx.238\n\nI can run Apache 1.3.x and IIS5 at the same time without any problems.  I can \nreplicate this problem on 3 different servers (W2K Server, and (2) W2K Advanced \nServers)\n-------------\nMy guess is that Apache 2.x is \"incorrectly\" detecting IIS's bind to the OTHER \nIP address on port 80, and then failing.... something in the startup bind/logic \nwhich was changed in the 2.x seems to be the blame at this point.  \n\nI have not seen anyone else having similar issues when I have run Google \nweb/group searches, and posting to the HTTP mailing list has yielded no one \nwith a similar setup.\n--------------\nI have confirmed this as working with Apache 1.3.24/26/27 and NOT working with \nApache 2.0.42/43.\n\nI am using the PRE-compiled binaries provided by Apache.org and at the moment \nusing PURE vanilaa stock httpd.conf setups just to prove the bug.", "id": 24077, "time": "2002-10-07T16:35:53Z", "creator": "brian@bsmanagement.com", "creation_time": "2002-10-07T16:35:53Z", "is_private": false}, {"count": 1, "tags": [], "text": "****\nAdditional information:\n\nIt was suggested that I run Apache 2.0.43 by itself to see if it \"bound\" \ncorrectly.\n\n1) I tried: Listen 165.xxx.xxx.238:80 (with IIS _NOT_ running)\nIt correctly answered on 238, but did not answer on 237\n\n2) I then tried: Listen 80 (with IIS _NOT_ running)\nIt correctly answered on 237 and 238\n\n\nTo add flame to the fire.  When option #1 was running bound to only 1 IP, IIS \nrefused to start claiming \"port in use\".  When in reality Apache was only \nanswering on 1 IP, which leads me to believe Apache 2.x.x is incorrectly \nbinding to all IPs even when instructed NOT to.\n", "attachment_id": null, "id": 24096, "creator": "brian@bsmanagement.com", "time": "2002-10-07T20:20:29Z", "bug_id": 13368, "creation_time": "2002-10-07T20:20:29Z", "is_private": false}, {"count": 2, "tags": [], "text": "All the symptoms you describe are equally consistent with IIS trying to \nbind to both ports.  Are you absolutely sure you have IIS configured\ncorrectly to bind only to the single port?", "attachment_id": null, "id": 24101, "creator": "slive@apache.org", "time": "2002-10-07T21:22:26Z", "bug_id": 13368, "creation_time": "2002-10-07T21:22:26Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 13368, "attachment_id": null, "text": "\n  IIS ALWAYS attempts to bind to all ports (e.g. 0.0.0.0:80)\nupon startup.  There is no clean way to disable this behavior.\n\n  Apache 1.3 added the -W svc argument to specify additional\nservices that Apache needs to be run 'W'ith before that service\ncan be started.  Apache 2.0 doesn't support this arg yet.\n\n  Once it supports that arg, apache -k config -W w3svc \nwould force IIS to glom all adapters, release them, \nglom the correct adapters, and then Apache can start.\n\n\n", "id": 24103, "time": "2002-10-07T22:00:50Z", "creator": "wrowe@apache.org", "creation_time": "2002-10-07T22:00:50Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 13368, "attachment_id": null, "text": "Joshua: Yes. I am 100% sure that all the IP binding are set to the specific IP \naddress.\n\nWill: Thanks for the additional information on the -W.  Hell, I have been using \nApache on Win32 for 4 years and didn't realize that option was there.   \n\nI added the dependency to my 1.3 Apache and that helped a bit.  I hacked a \nregistry entry for the Apache2 series with the following regedit:\n\nWindows Registry Editor Version 5.00\n\n[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Apache2]\n\"DependOnService\"=hex(7):54,00,63,00,70,00,69,00,70,00,00,00,41,00,66,00,64,00,\\\n  00,00,57,00,33,00,53,00,56,00,43,00,00,00,00,00\n\nThis added the W3SVC as a dependency for Apache2... but you are right \napparently the 2.x series does not support the -W params yet.  \n\n--\n\nSo would this be considered a bug? (since it works on 1.3)  or an enhancement \nrequest, since 2.0 is missing the -W function?\n\nI really would like to move on to 2.x, but I'm afraid I am stuck with IIS on \nthe same box and everything has to be on standard 80/443 ports, otherwise I \nwould go with an altnerate 8000 port and move on.\n", "id": 24137, "time": "2002-10-08T14:49:18Z", "creator": "brian@bsmanagement.com", "creation_time": "2002-10-08T14:49:18Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 13368, "attachment_id": null, "text": "Gentlemen, I would like to add my situation with running Apache 2.0 and IIS 5.0\non the same computer.\n\nBackgroud:\nI have a W2KPro setup with IIS 5.0 and Apache 2.0 installed.  I had problems\nwith installation because IIS was holding on to 0.0.0.0 when Apache was trying\nto bind to it.\nI stopped IIS and reinstalled, everything ok.\nSince it is a Windows machine, I let IIS start automatically on boot up and\nApache on Manual.\n\nThe Problem:\nI would like to switch when I need to between IIS and Apache. I would normally\ndo this by stopping one service and starting the other. I know this is odd to\nsome but I am lazy and an elementary developer. I am sure there is a better way.\nAnywho, when I go to the Windows 'Services' window Apache is stopping but gets\n\"frozen\" and then in few seconds, it will completely reboot my computer.\n\nThis is big pain and I am not sure why this happens.", "id": 30136, "time": "2003-01-27T20:06:22Z", "creator": "john@corniel.com", "creation_time": "2003-01-27T20:06:22Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 13368, "text": "I had the same problem. IIS binds to ALL IP addreses even there is no web site \nor Host Header Name configured to it.\nHave you read this?\nhttp://support.microsoft.com/default.aspx?scid=kb;en-us;Q238131\nI run IIS and Apache 2.0 about year on Win2k server without conflicting \nproblems.", "id": 33536, "time": "2003-03-20T10:37:28Z", "creator": "aa.ss@inbox.lv", "creation_time": "2003-03-20T10:37:28Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "jorton@redhat.com", "text": "From reading all above it doesn't seem like there's any real httpd bug which can\nbe fixed here, just IIS issues.  Marking INVALID.", "id": 72130, "time": "2005-03-10T14:40:04Z", "bug_id": 13368, "creation_time": "2005-03-10T14:40:04Z", "is_private": false, "attachment_id": null}]