[{"count": 0, "attachment_id": null, "creator": "vincent@up4c.com", "text": " ", "id": 24165, "time": "2002-10-09T00:13:39Z", "bug_id": 13430, "creation_time": "2002-10-09T00:13:39Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 13430, "attachment_id": null, "text": "Just like bug #12194, for Tomcat 3\n\nWhen a web app contains an error page for code 401 like\n<error-page> \n  <error-code>401</error-code> \n  <location>/401.html</location> \n</error-page>\n\nThe \"WWW-Authenticate\" Header is not sent, causing agents not to prompt for\ncredentials. When no \"error-page\", Tomcat behaves as expected.\n\n\nSo this code never works :\n\noResponse.setHeader(\"WWW-Authenticate\", \"BASIC realm=\\\"Intranet\\\"\");\noResponse.sendError(HttpServletResponse.SC_UNAUTHORIZED);\n\n\nUsing Apache 1.3 + mod_jk + Tomcat 4.1.12 + IBM JDK 1.3.1.", "id": 24168, "time": "2002-10-09T00:18:31Z", "creator": "vincent@up4c.com", "creation_time": "2002-10-09T00:18:31Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 13430, "attachment_id": null, "text": "Thi is a dupe of a 4.0.x bug, I think.\nThe spec doesn't require supporting error pages for internal container status\ncodes (as per an answer given by Craig). The problem here is that we have to\nreset the response to some kind of knwon state. It was proposed that only the\ncritical headers be reset during the operation. See the ErrorDispatcherValve for\nmore info. If you could submit a patch, that would help (otherwise, this won't\nget fixed anytime soon).", "id": 24183, "time": "2002-10-09T06:02:16Z", "creator": "remm@apache.org", "creation_time": "2002-10-09T06:02:16Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 13430, "attachment_id": null, "id": 42936, "time": "2003-08-18T18:58:28Z", "creator": "juancarlos.estibariz@quest.com", "creation_time": "2003-08-18T18:58:28Z", "is_private": false, "text": "I finaly got the WWW-Authenticate header by changing \norg.apache.coyote.tomcat4.CoyoteResponse to keep that header, I'm attaching a \npatch with my change "}, {"count": 4, "tags": [], "bug_id": 13430, "text": "Created attachment 7880\nKeeping the WWW-Authenticate header in reset(int, String)", "id": 42938, "time": "2003-08-18T19:09:40Z", "creator": "juancarlos.estibariz@quest.com", "creation_time": "2003-08-18T19:09:40Z", "is_private": false, "attachment_id": 7880}, {"count": 5, "attachment_id": null, "creator": "justis@oculan.com", "text": "We were able to solve this in our local applications by turning the 401.html page into a 401.jsp and adding the following code:\n\n  response.setHeader(\"WWW-Authenticate\", \"BASIC realm=\\\"myrealm\\\"\");\n\nThis caused the browser to once again display the authentication dialog.  If the user presses \"cancel\", or fails login multiple times, the browser gives up on the dialog and displays the underlying HTML in the 401.jsp file.  If they succeed in authenticating, they are directed to the originally requested page.\n\nIMO, the ability to *entirely* override the authentication process is a valuable tool, but the way it was specified in web.xml is very confusing.  What we are doing here is entirely delegating the authentication to an external JSP or servlet.  This is a great tool, because it allows you to make dynamic decisions that you can't do inside of web.xml.  For example, you could send a \"WWW-Authenticate: BASIC\" to most systems, but if the request matches a certain pattern or if it comes from a specified IP, etc, you could instead send a \"WWW-Authetnicate: Digest\"; or perhaps you could send a redirect to force SSL.  Anyhow, it's a nice tool to be able to extend the functionality here.\n\nThe problem is that the way the user above stumbled across this (and the way I stumbled across it, too) is by having a preexisting login-config to use BASIC auth, and then later added the 401.html page.  My intent here was to display a link that allows the user to reset his or her password and have it emailed back to the email associated with their account.  I was *very* confused when adding the error-page mapping completely disabled my login-config.\n\nPerhaps there is a better way to document this functionality?  It seems to me that this is a reasonably common desire among developers:  To use BASIC auth but to still provide user friendly tools when the user fails authentication.\n\nMy recommendation is that this bug be marked \"WONTFIX\", but that the documentation be updated to explain it more clearly.  Implementing Juan's patch would take away the ability to delegate the whole authentication process to another JSP, which would be a loss.  I just wish it were easier to understand...", "id": 44246, "time": "2003-09-16T19:12:03Z", "bug_id": 13430, "creation_time": "2003-09-16T19:12:03Z", "tags": [], "is_private": false}, {"count": 6, "tags": [], "bug_id": 13430, "attachment_id": null, "text": "That workaround is easy for BASIC authentication but I'm using DIGEST and \ngenerating the WWW-Authenticate header is not trivial. \n \nAnd don't forget you can always forward or redirect to do custom \nauthentication with either a JSP or a servlet. ", "id": 44247, "time": "2003-09-16T19:44:32Z", "creator": "juancarlos.estibariz@quest.com", "creation_time": "2003-09-16T19:44:32Z", "is_private": false}, {"count": 7, "tags": [], "text": "Yet another solution is to call RequestDispatcher.forward after\nsetting the return code to 401, auth header etc to send the client\nthe HTML (or whatever) you want them to see if they give up \ntrying to authenticate.\n\nMy vote (if I have one) is that since there are lots of workarounds \nand the current behviour is so clean that this isnt a bug at all.", "attachment_id": null, "id": 57618, "creator": "sam@redspr.com", "time": "2004-05-18T17:26:22Z", "bug_id": 13430, "creation_time": "2004-05-18T17:26:22Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 13430, "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of 18040 ***", "id": 72808, "time": "2005-03-24T23:39:17Z", "creator": "markt@apache.org", "creation_time": "2005-03-24T23:39:17Z", "is_private": false}]