[{"count": 0, "tags": [], "bug_id": 13441, "text": "All of our dynamic pages generated from Tomcat 4.1.12 hooked into our Apache \nserver (2.0.40) via mod_webapp are now broken when viewed with IE 6 (upgraded \nto Service Pack 1).  It seems that static pages from the server work OK but all \nof the dynamic pages are broken.  When the same pages are viewed through \nmod_rewrite by proxying directly to port 8080 on Tomcat, they work fine.  It \nseems that the only difference between the pages that work and those that don't \nis the status response code for the pages that are served properly.  For the \npages that work, the status line in the response header is\n\nHTTP/1.1 200 OK\n\nfor the WebApp served pages, it is \n\nHTTP/1.1 OK\n\nThis URL worked OK with the previous version of IE but breaks IE 6 SP 1.\n\nThis problem does not affect loading of these dynamic pages on any Netscape \nbrowsers I have tried but Netscape 4.77 pops up a dialog saying \"Unknown Status \nCode 0!\" before loading the page.  I think this is occuring because it is \ntrying to parse the \"OK\" as a number because the 200 status code is missing.\n\nThis problem started occurring when we upgraded both Tomcat and the Apache \nserver recently on our main Linux Web server and a client testing another \ndynamic site encountered this problem the day after the switchover occurred.  \n\np.s. the mod_rewrite solution mentioned above serves as a viable workaround to \nthe problem but and redirects would have to be modified to be absolute URLs or \npossible changed to server HTML with meta tag refreshes.\n\nHope this description and sample URL help fix the bug right away.", "id": 24182, "time": "2002-10-09T05:52:06Z", "creator": "robert@dotinc.net", "creation_time": "2002-10-09T05:52:06Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 13441, "attachment_id": null, "is_private": false, "id": 24528, "time": "2002-10-15T04:56:34Z", "creator": "robert@dotinc.net", "creation_time": "2002-10-15T04:56:34Z", "text": "It appears that this bug report may have been premature.  I went back to the \nconnector source tree to double check my compilation and it looks like I may \nnot have compiled the module correctly.  I reconfigured and recompiled the \nmodule against the binary distribution of Apache 2.0.40 and everything seems to \nbe working now.  I hope I didn't waste anyone's time."}]