[{"count": 0, "tags": [], "bug_id": 13511, "is_private": false, "text": "If the error log can't be written, it appears that any process that\ntries to write to the error log is quietly terminated.   This can \ncause serious errors where no serious errors existed.\n\nSuggest 1) \"quiet termination\" should be noisier, to attract attention.\n2) there should be some sort of overall status information that could be\nroutinely monitored for such \"alarm\" conditions as the inability to make\nlog file entries.\n\nHere are some details from an event that led to this report.  The \"symptom\"\nwas that some scripted emails arrived blank.  There was no other indication\nof a problem, but once someone complained about the blank emails, It was \nnoticed that the error_log was 2GB in size and had stopped growing due to \nmaximum file size.  The web site was otherwise operating normally, except\nthat errors weren't being logged.\n\nFurther investigation showed that a CGI subprocess invlolved in sending the \nemail was routinely emitting a warning message, which was logged, and the\ninability to log the warning caused the process to terminate.  Since the main \nthread emitting HTML didn't fail, the user's screen didn't indicate any \nproblem.", "id": 24314, "time": "2002-10-10T19:38:05Z", "creator": "ddyer@real-me.net", "creation_time": "2002-10-10T19:38:05Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "slive@apache.org", "text": "Hmmm... I'm not really an expert in this, but it seems it is the CGI script\nthat needs to guard against the out-of-space condition, not Apache.\nWhat could Apache do to prevent this?", "id": 24639, "time": "2002-10-16T16:58:56Z", "bug_id": 13511, "creation_time": "2002-10-16T16:58:56Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "creator": "ddyer@real-me.net", "text": "\nNo, the CGI is not even aware that a log file is being written; it\nis merely emitting some text on stderr.  For its pains, it gets\nterminated by apache.\n\n", "id": 24648, "time": "2002-10-16T17:18:52Z", "bug_id": 13511, "creation_time": "2002-10-16T17:18:52Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 13511, "is_private": false, "text": "Again, I'm not an expert in this, but Apache is just attaching the stderr pipe to \nthe error log.  If this pipe can't be written, the OS is probably just sending\nSIGPIPE to your CGI.  If you CGI doesn't handle that, it will die.\n\nI don't see anything that Apache could do about this.", "id": 24669, "time": "2002-10-17T01:35:13Z", "creator": "slive@apache.org", "creation_time": "2002-10-17T01:35:13Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "ddyer@real-me.net", "attachment_id": null, "is_private": false, "id": 24757, "time": "2002-10-17T05:27:54Z", "bug_id": 13511, "creation_time": "2002-10-17T05:27:54Z", "text": "Apache can't be doing anything as simpleminded as you\nsuggest, because it is running many concurrent CGI threads.\nSo the fate of this particular thread could be better.\n\nSecondarily, as I suggested, apache must know that globally\nspeaking, it's log file is not working.  There should be some\nalert procedure - it shouldn't just allow shit to happen until\nsomeone notices the mess and deduces the cause and cure.\n\n"}, {"count": 5, "tags": [], "bug_id": 13511, "is_private": false, "text": "I don't understand your first paragraph at all.  How does multiple CGI\nprocesses have anything to do with it?  They are all handled identically.\n\nRegarding behaving better when the error log is full, that seems\nkind of absurd to me.  Apache writes errors to the the error log.\nIf it can't do that, what is it supposed to do?  Write to another\nlog file?  What if that log can't be written to?  Send a message to\nyour pager?  Walk down the hall and tap you on the shoulder? ;-)\n\nAt some point it needs to be the administrator's responsibility\nto maintain available system resources.", "id": 24779, "time": "2002-10-17T13:30:42Z", "creator": "slive@apache.org", "creation_time": "2002-10-17T13:30:42Z", "attachment_id": null}, {"count": 6, "attachment_id": null, "creator": "wrowe@apache.org", "text": "\n  In this case, this minimum requirement is that a 500 error (with no\n  additional 'helpful information') should be sent to the client of this\n  terminated script.\n", "id": 24783, "time": "2002-10-17T14:52:17Z", "bug_id": 13511, "creation_time": "2002-10-17T14:52:17Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "bug_id": 13511, "is_private": false, "text": "Re: multiple CGI processes - it their output was tee'd directly from\nstderr to a log file, the output from multiple processes would be \nchaotically interspersed.  That in itself would be a problem. The \noutput from DTDOUT is clearly handled individually, so why not STDERR?\n\nFor the momement, lets separate the question of what happened to \nthis particular CGI from that happens in general.\n\n1) For this particular CGI, a warning message caused the process to terminate,\neffectively turning friendly glitch audit trail into a black hole.  Clearly \nnot a desirable outcome.\n\n2) From the viewpoint of apache as a whole, if log files are not being maintained\nand processes are being killed randomly, the system as a whole is in serious\njeopordy.  Perhaps Apache should shut down (which will surely get someone's\nattention) but at the very least there should be an emergency channel of some\nsort throug which apache reports serious internal problems.  The standard log\nfiles are not a good place for this, because apache's (rare we hope) internal\nproblems would be lost in mountains of routine log data.\n\nConsider the current case; Apache knows exactly what is wrong, and can/should\ntell the sysop \"error log can't be written\".    Consider the current behavior\nas a debugging problem \"my email arrived blank\".  Which would you rather deal\nwith?\n", "id": 24817, "time": "2002-10-17T18:08:01Z", "creator": "ddyer@real-me.net", "creation_time": "2002-10-17T18:08:01Z", "attachment_id": null}, {"count": 8, "tags": [], "creator": "trawick@apache.org", "attachment_id": null, "is_private": false, "id": 31316, "time": "2003-02-14T21:41:32Z", "bug_id": 13511, "creation_time": "2003-02-14T21:41:32Z", "text": "This is the 2GB log file problem :(\n\n32-bit builds of Apache (1.3 or 2.0) don't currently handle \"large\" files. \nApache child processes will die trying to write logs which have reached 2GB in\nsize.  The obvious place to report the proble is -- you guessed it -- the\nlog file that we can't write to.\n\nThe current message to users is that they need to use log rotation to keep the\nsize well under 2GB.\n\nYes this sucks, yes it will eventually get fixed, yes there are issues that make\nit problematic to enable on some platforms (including Linux).\n\nSorry :(\n"}, {"count": 9, "tags": [], "bug_id": 13511, "is_private": false, "text": "*** Bug 20160 has been marked as a duplicate of this bug. ***", "id": 37629, "time": "2003-05-22T18:39:46Z", "creator": "trawick@apache.org", "creation_time": "2003-05-22T18:39:46Z", "attachment_id": null}, {"count": 10, "tags": [], "bug_id": 13511, "is_private": false, "text": "Yeah, you can improve the failure mode for this problem by setting SIGXFSZ (the\nsignal which kills the process when it write()s past 2gb) to SIG_IGN.  It's a\ntrivial change - I'll submit a patch.", "id": 37633, "time": "2003-05-22T19:56:59Z", "creator": "joe@manyfish.co.uk", "creation_time": "2003-05-22T19:56:59Z", "attachment_id": null}, {"count": 11, "attachment_id": null, "creator": "jorton@redhat.com", "text": "Fixed in HEAD by allowing >2Gb log files on platforms which have this limit;\nwill be proposed for backport for the next 2.0 release.", "id": 56917, "time": "2004-05-06T10:53:07Z", "bug_id": 13511, "creation_time": "2004-05-06T10:53:07Z", "tags": [], "is_private": false}, {"count": 12, "tags": [], "bug_id": 13511, "attachment_id": null, "text": "*** Bug 28968 has been marked as a duplicate of this bug. ***", "id": 57400, "time": "2004-05-14T11:06:17Z", "creator": "jorton@redhat.com", "creation_time": "2004-05-14T11:06:17Z", "is_private": false}, {"count": 13, "tags": [], "bug_id": 13511, "attachment_id": null, "id": 62431, "time": "2004-08-24T20:37:16Z", "creator": "jorton@redhat.com", "creation_time": "2004-08-24T20:37:16Z", "is_private": false, "text": "*** Bug 30170 has been marked as a duplicate of this bug. ***"}, {"count": 14, "tags": [], "bug_id": 13511, "attachment_id": null, "id": 72072, "time": "2005-03-09T19:36:59Z", "creator": "jorton@redhat.com", "creation_time": "2005-03-09T19:36:59Z", "is_private": false, "text": "*** Bug 33937 has been marked as a duplicate of this bug. ***"}]