[{"count": 0, "tags": [], "creator": "yurtesen@ispro.net.tr", "attachment_id": null, "id": 24505, "time": "2002-10-14T22:58:30Z", "bug_id": 13620, "creation_time": "2002-10-14T22:58:30Z", "is_private": false, "text": "ChildPerUserId Directive documentation says the following...\n----\nSpecify a user id and group id for a specific child process. The number of \nchildren is set by the NumServers directive. For example, the default value for \nNumServers is 5 and that means children ids 1,2,3,4 and 5 are available for \nassigment. If a child does not have an associated ChildPerUserID, it inherits \nthe User and Group settings from the main server \n----\nIt says \"specific child process\" but it should be perhaps changed to \"a number \nof child processes\" or change the whole sentence, the number entered as the \nlast variable of the directive effects how many child processes should be \ncreated by the uid/gid specified. Thus specifying 2 doesnt change the uid/gid \nof the child process number 2 but it lets you have 2 child processes with the \nuid/gid specified. Also the total of the ChildPerUserID directive cant be more \nthan NumServers directive, which cant be more than ServerLimit directive. \nAlthough there is not much documented in ServerLimit directive manuals about \nperchild module.\n\nand I believe there should be a warning message for people who want to use php \nwith perchild module because if you forget to compile apache with perchild \nmodule then (I guess) it returns -1 uid thus php is complaining if the safe \nmode is on but still the created files are owned by the normal user of the \napache. I dont know if my assumption this is correct though.\n\nThanks ;)"}, {"count": 1, "tags": [], "bug_id": 13620, "is_private": false, "id": 24506, "creation_time": "2002-10-14T23:16:19Z", "time": "2002-10-14T23:16:19Z", "creator": "rbb@apache.org", "text": " The docs were changed a few days ago, although they haven't been updated on  the web site yet. If you don't use perchild, then Apache will use whatever user is configured in the config file, so there shouldn't be a warning required. ", "attachment_id": null}]