[{"count": 0, "tags": [], "creator": "brian@ecompcon.com", "attachment_id": null, "id": 24555, "creation_time": "2002-10-15T16:53:20Z", "time": "2002-10-15T16:53:20Z", "bug_id": 13659, "text": "Categories are showing up as numbers instead of strings in my Windows 2000\nevent log. Also, username is always displayed as N/A. I've posted a patch\nto the log4j-dev list with corrections and a couple of other enhancements\nto add to the flexibility of the NTEventLogAppender.\n\nNTEventLogAppender changes in patch:\n      - Fixed logging of event categories so the text strings show up in the\n        NT Event Log instead of numbers.\n      - Added a flag to NTEventLogAppender class and support for it in \n        nteventlog.cpp, that allows the programmer to turn on or off the \n        display for the current username in the NT Event Log. Instead of N/A.\n      - Added a way for the programmer to specify their own resource only\n        DLL so they can user their own custom event categories, instead of\n        the ones compiled into NTEventLogAppender.dll. Very useful since \n        categories were never really intended to convey the level of the log\n        messages anyway.\n      - Added a new class called CategorizedMessage. It's used a wrapper \n        around an existing log message so a category number can be associated\n        with it.\n      - Added a way for the programmer to specify their own resource only\n        DLL so they can user their own custom event mesage, instead of\n        the one compiled into NTEventLogAppender.dll. Not very useful since\n        there can still be only one event message and the ID has to be 4096,\n        but it was easy and leaves room for future enhancements like supporting\n        multiple event messages.\n\nThanks.", "is_private": false}, {"count": 1, "tags": [], "creator": "yoavs@computer.org", "attachment_id": null, "id": 68358, "time": "2004-12-13T16:33:39Z", "bug_id": 13659, "creation_time": "2004-12-13T16:33:39Z", "is_private": false, "text": "If you still care about this, then please reopen this issue, attach the patch \nhere, and note what log4j version the patch was creted against.  Thanks."}]