[{"count": 0, "tags": [], "bug_id": 1371, "attachment_id": null, "text": "software:\n  web server - tomcat 3.2.1 running on win2k sp1 with latest hot fixes.  it is \nrunning as an out of process container.  IIS (version that come with win2k) is \nfiltering pages over to tomcat by way of the isapi_redirect.dll (most recent \nversion)\n  firewall - raptor firewall 6.5 running on winnt 4.0 sp 6a.  \n  web client - ie 5.5 running on win98.\n\nsetup:  \n  tomcat lives behind the raptor firewall.  the firewall has one outside ip \naddress.  it allows requests to the outside address, port 80 in and redirects \nthem to the ip address of tomcat's host, port 80.  the client machine lives on \nthe outside of the firewall and access the web server and tomcat by pointing his \nweb browser to the outside address of the firewall.\n\nwork flow:  \n  on the server side i have login.jsp that has an html form in it that gets a \nuser name and password.  the action for the form is loginprocess.jsp.  in \nloginprocess.jsp the username and password are checked and the user is \nredirected (using response.sendRedirect(\"input.jsp\"))over to his page \n(input.jsp).\n\nissue: \n  when a web client is using ie 5.5, and puts in his user name and password, the \nfirst time through, it works by bring up input.jsp.  if the user pushes the back \nbutton and tries to login again, it fails to bring up input.jsp.  instead the \nbrowser just sits there and waits for the page to load, which it never does.  if \nthe user goes to home.html by way of clicking on a link (as opposed to using the \nback button again, which i have not tried) and then clicks to the login page, \nand tries to login again, it works by bringing up input.jsp.  the firewall \nprovides a small clue in its logs.  sometimes it will have an error associated \nwith the failure that says in it \"200 -- HTTP/0.9\" and \"(Unexpected client \nclose)\".  the raptor people say that this indicates that something is using HTTP \nversion 0.9 and they can't help me with that since their firewall is proxy \nbased and the proxy only works with HTTP/1.0 and HTTP/1.1.  this problem does \nnot arise with any netscape version or ie 4.0.  it also is not a problem with ie \n5.5 when it connects directly to the web server (not through the firewall).  \n\nnow this would all sound like an ie 5.5 problem and in some ways i guess that it \nis, except that talking to microsoft is impossible about such things....and \nbesides, i was able to work around the problem programmatically.  i changed out \nthe response.sendRedirect(\"input.jsp\") with <jsp:forward page=\"input.jsp\"/> in \nloginprocess.jsp.  \n\ni am sending this bug report for a few reasons.....\n1)  i don't know exactly what the interaction was to that made this happen \n(perhaps the tomcat implementation has something to do with it, although i doubt \nit)\n2)  this was very confusing to me and it held me up for days.  i would love for \nthis work around to appear somewhere that others can access it so that they can \nquickly resolve the problem.  \n\nyou can feel free to contact me for clarification.  i hope that this was a good \nbug posting (my first).", "id": 1891, "time": "2001-04-18T08:45:03Z", "creator": "adam@dmscomp.com", "creation_time": "2001-04-18T08:45:03Z", "is_private": false}, {"count": 1, "tags": [], "creator": "cmanolache@yahoo.com", "attachment_id": null, "id": 1965, "time": "2001-04-20T17:36:28Z", "bug_id": 1371, "creation_time": "2001-04-20T17:36:28Z", "is_private": false, "text": "I don't think we can resolve this for 3.3 ( unless you can find a fix or \nmore details), but probably in a future bug fix release."}, {"count": 2, "tags": [], "bug_id": 1371, "text": "*** Bug 1449 has been marked as a duplicate of this bug. ***", "id": 2511, "time": "2001-05-17T12:55:59Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-05-17T12:55:59Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "cmanolache@yahoo.com", "is_private": false, "id": 5494, "time": "2001-09-13T16:12:04Z", "bug_id": 1371, "creation_time": "2001-09-13T16:12:04Z", "tags": [], "text": "We don't have enough data to reproduce, I don't think we can fix it."}]