[{"count": 0, "tags": [], "creator": "mm@arcus.com.au", "is_private": false, "id": 25015, "attachment_id": null, "bug_id": 13866, "creation_time": "2002-10-23T03:41:24Z", "time": "2002-10-23T03:41:24Z", "text": "Just realized that patches should go into BugZilla\n==================================================\n\nFinally got around to do the patch.\n\nIts against the current version from the maintenance branch.\n\nThe patch, apart from adding support for CCFFilters for TIFF images in PDF \nfiles, attempts a few other fixes:\n\n1. The FopImageFactory had code with needed explicit uncommenting to support \nJAI. This is now done dynamically, no source editing required, based on a \nClassForName test if JAI is present.\n\n2. The build scripts have been changed to include the jai_codec and jai_core \njars in the class path. As for Jimi, which was already included, it doesn't \nmatter if they are not there. This means to build fop with JAI support the only \naction required is to put the JAI jars into the lib directory (same as for \nJimi).\n\n3. A CCITT Group 4 encoded TIFF file has been added to the docs/graphics \ndirectory and the docs/examples/fo/image.fo file has been modified to include \nthis TIFF file as an external graphic. Note: This graphic will not display if \nfop is compiled without JAI support however a valid PDF file will still be \nproduced.\n\n4. The FopImageFactory has been modified to now, hopefully correctly, resolve \nURIs relative to the baseDir configuration parameter. The previous \nimplementation of resolving relative URIs was broken, especially with respect \nto the current test cases in docs/examples/fo.\n\n5. The Fop ant task has been modified to set the baseDir parameter given to it. \nThe previous implementation accepted the baseDir parameter but never set it in \nthe Configuration. This caused the automatic builds of the example suite to \nfail (with respect to resolving relative URIs in external-graphic tags).\n\n6. The shell script to make the example suite was also modified to include the \nJAI jars.\n\nI hope the attached file with the diffs and the new files is in the correct \nformat and one of the committers finds the time to look at it and if acceptable \ninclude it into the upcoming 20.5 release.\n\nUnfortunately some of the diffs are pretty big because my text editor changed \nthe line endings to LFs and tabs to spaces as per published Apache conventions.\n\nAnd a final note: Would it be possible to include logkit-1.0.jar in the \ndistribution? Without it, or another avalon compatible logger, the scripts for \nbuilding the examples or running the tests don't work. Its just nicer if \nthings \"work out of the box\".\n\nManuel\n\n-----Original Message-----\nFrom: Jeremias Maerki [mailto:dev.jeremias@greenmail.ch]\nSent: Tuesday, 13 August 2002 12:54\nTo: fop-dev@xml.apache.org\nSubject: Re: Encoding Filters(Formally Re: Hope this helps-\nRunLengthEncod eFilter)\n\n\nManuel\n\nLooks like I missed this. At least, I can say that I could profit from\nCCITT group 4 because we have a project at work where we have to include\nseveral different monochrome images in a lot of documents. So this may\ndecrease file size when compared to the FlateEncodeFilter. If it's\ndependent on JAI, so be it. That just means we have to make it optional,\nsomehow. Want to send a patch?\n\n\nOn 13.08.2002 04:49:56 Manuel Mall wrote:\n> I did (sort of) integrate the CCITT/TIFF compression based on JAI earlier\n> this year. See http://marc.theaimsgroup.com/?l=fop-dev&m=101125782918974&w=2\n> \n> But nobody seemed to be interested at the time.\n\nJeremias Maerki"}, {"count": 1, "tags": [], "creator": "mm@arcus.com.au", "is_private": false, "id": 25016, "attachment_id": 3572, "bug_id": 13866, "creation_time": "2002-10-23T03:42:34Z", "time": "2002-10-23T03:42:34Z", "text": "Created attachment 3572\nTAR archive with diff's and the enw files"}, {"count": 2, "tags": [], "bug_id": 13866, "is_private": false, "id": 26476, "creation_time": "2002-11-18T15:09:36Z", "time": "2002-11-18T15:09:36Z", "creator": "christian.geisert@isu-gmbh.de", "text": "Thanks for your contribution.\n\nI've committed everything except the change concerning relative URIs\n(current code works for me under Linux)\n\nAvalon-framework contains ConsoleLogger and examples are working out\nof the box for me.", "attachment_id": null}, {"count": 3, "tags": [], "creator": "mm@arcus.com.au", "text": "Christian,\n\nthanks for accepting and committing my patch. I hope to be able to contribute \nmore in the future. \n\nRegarding the resolving of URIs in FopImageFactory you say it works for you \nunder Linux. I can say it doesn't work for me under Linux. Could it be that we \nare using different JDKs (I use IBM 1.3.0) and that the behaviour of the URL \nconstructor \"new URL(context, spec)\" has changed? Any way, what I observe is \nthat if basedir is something like \"file:/...\" and the URL in the external-\ngraphics tag is also \"file:/...\", ie. has the protocol included (which it has \nfor all the FOP examples), then the constructor mentioned above does not \nresolve any relative paths in \"spec\" as it contains a protocol component which \naccording to the URL RFC means it is an absolute URL.\n\nAnd could a difference in the jdk also account for your observation that the \nlogging works out of the box for you but not for me?", "id": 26531, "attachment_id": null, "bug_id": 13866, "creation_time": "2002-11-19T01:20:49Z", "time": "2002-11-19T01:20:49Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 13866, "text": "I just had a look a the current source with regards to relative URLs.\n\nThe relative part is done with a URL.getFile() which returns the path\nwithout \"file:\" on the Sun JDK. Is this different with the IBM JDK?\n\n\nI don't think that the Logger problem has to do with the JDK\nWhat kind of error do get?", "id": 27115, "time": "2002-11-28T14:01:59Z", "creator": "christian.geisert@isu-gmbh.de", "creation_time": "2002-11-28T14:01:59Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 13866, "is_private": false, "text": "Moved the discussion of the image URL resolution issue to a new bug 14948.", "id": 27157, "time": "2002-11-29T07:22:50Z", "creator": "mm@arcus.com.au", "creation_time": "2002-11-29T07:22:50Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 13866, "text": "Ok, discussion is moved to bug 14948, but this one we can close happily.", "id": 27253, "time": "2002-12-02T15:54:51Z", "creator": "oleg@tkachenko.com", "creation_time": "2002-12-02T15:54:51Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "gadams@apache.org", "text": "batch transition pre-FOP1.0 resolved+fixed bugs to closed+fixed", "id": 155763, "attachment_id": null, "bug_id": 13866, "creation_time": "2012-04-01T06:39:42Z", "time": "2012-04-01T06:39:42Z", "is_private": false}]