[{"count": 0, "tags": [], "bug_id": 13861, "text": "Into the original /examples/WEB-INF/web.xml file, I added the following\nsecurity constraint just before the Example Security Constraint.\n\n    <security-constraint>\n      <web-resource-collection>\n         <web-resource-name>Protected by tomcat role and SSL</web-resource-name>\n         <url-pattern>/jsp/snp/*</url-pattern>\n      </web-resource-collection>\n      <auth-constraint>\n         <role-name>tomcat</role-name>\n      </auth-constraint>\n      <user-data-constraint>\n         <transport-guarantee>CONFIDENTIAL</transport-guarantee>\n      </user-data-constraint>\n    </security-constraint>\n\nNo other changes to this web.xml file were made.\n\nNow, my browser hangs when I try to access \nhttp://localhost:8080/examples/jsp/snp/snoop.jsp.\nIt appears that Catalina cannot redirect to login.jsp and\nchange to port 8443 at the same time.\n\nIf I remove the <auth-constraint> tag, SSL works fine.\n\nIf I remove the <user-data-constraint> tag, authentication works fine.\n\nHow can I get them to BOTH work at the same time?", "id": 25012, "time": "2002-10-23T00:30:11Z", "creator": "ttps@pacbell.net", "creation_time": "2002-10-23T00:30:11Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "mech@rz.fh-augsburg.de", "is_private": false, "text": "I can confirm this bug. \n\nActually the problem is only\n<transport-guarantee>CONFIDENTIAL</transport-guarantee> (or INTEGRAL).\n\nin connection with the MS Internet Explorer 6.x!\n\nUsually I expected a redirect to https on port 8443 whenever I try to access a\nsecured http url. Of course, you need SSL running.\n\nThe interesting thing is that this behaviour works fine when I use Mozilla or\nOpera browser. \nI enter a http url into my Internet Explorer however, I only get the ssl warning\npopup (because using a self-signed test certificate, of course. so far so good.\nthat is normal) and after that IE stops loading! \nThe status bar is moving slowly but it stalls doing nothing anymore. But it\nworks fine if i access the page directly with https. So actually the redirection\ni not working when using IE.\n\nOne more thing I found out after studying some related messages in the\ntomcat-user list, was that it's obviously working with IE when http/https are\nrunning on standard ports 80/443, although i haven't tried myself.\n\nMore related info here:\nhttp://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg73342.html\n\nhttp://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg59950.html\n\n(There seem to be many related mails like this, but most users obviously think,\nit's a self-made SSL configuration issue instead of a bug!)\n\nMaybe the url rewriting with IE just changes the protocol from http to https\nwhen sending the new request leaving the port unchanged which can only work with\nstandard ports.\n\nHope some solution can be found for this soon. Otherwise container managed\nsecurity is nearly useless. I don't want to hardcode absolute \"https\" urls in my\ncode and all links to make sure that any IE client is not hanging.\n\nAt least it should be noted that this is a bug otherwise more users try to\nfigure out what is wrong with their SSL and container managed security setups.\n", "id": 26414, "time": "2002-11-16T14:05:09Z", "bug_id": 13861, "creation_time": "2002-11-16T14:05:09Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "larry.shatzer@mirotechnologies.com", "is_private": false, "text": "I'm experiencing the same thing, but when it times out, I get the url with a \njsessionid attached to it. Also it changes http to https, but not the port \nnumber. Now if I keep the jsessionid and the rest of the url, and switch it \nback to http://localhost:8080, it will then magically redirect to \nhttps://localhost:8443\n\nSee my comments in this post to the tomcat-users list for more details...\n\nhttp://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg74611.html\n\n", "id": 26804, "time": "2002-11-22T16:27:45Z", "bug_id": 13861, "creation_time": "2002-11-22T16:27:45Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 13861, "text": "Updated to Tomcat 4.1.18 today. Thus I'll change the version from 4.1.12 to\n4.1.18 now.\n\nThe problem is still present. Internet Explorer 6.0 won't automatically redirect\nfrom http to https when using ports 8080/8443 instead of 80/443.\nI wonder if this is a Tomcat or an IE bug because all other browsers that I\ntried work as expected even with 8080/8443.\n\nOnly workaround: use port 80/443 with Tomcat or place Apache on ports 80/433 in\nfront of Tomcat using a jk-Connector (not forget to set redirect attribute to\n443, too.)", "id": 28276, "time": "2002-12-26T23:09:52Z", "creator": "mech@rz.fh-augsburg.de", "creation_time": "2002-12-26T23:09:52Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "mech@rz.fh-augsburg.de", "is_private": false, "text": "Created attachment 4278\nworkaround: web.xml", "id": 28516, "time": "2002-12-28T16:55:04Z", "bug_id": 13861, "creation_time": "2002-12-28T16:55:04Z", "attachment_id": 4278}, {"count": 5, "tags": [], "bug_id": 13861, "text": "Created attachment 4279\nworkaround: loginforward.jsp", "id": 28517, "time": "2002-12-28T16:55:35Z", "creator": "mech@rz.fh-augsburg.de", "creation_time": "2002-12-28T16:55:35Z", "is_private": false, "attachment_id": 4279}, {"count": 6, "tags": [], "text": "Created a \"workaround\" for this bug. Finally I found out how to avoid that IE is\nforced to redirect to https AND a login at the same time.\n\nYou can implement a two-phase login that works with IE and Tomcat on ports\n8080/8443.\n\n1. Your login link should load the loginforward.jsp (in any case you should\navoid to link to your login.jsp directly because of several other issues with\nj_security)\nThis loginforward.jsp resource is protected with a security constraint\n\"confidential\", but NO login/role (check web.xml). Thus IE will successfully\nload this page via https. The http-to-https redirect mechanism works for this case.\n\n2. loginforward.jsp will now force the client browser to do a refresh. The page\nto come up after refresh is either the login form page or (if already logged in)\nthe index.jsp of the protected directory. This will now also work for IE because\nIE already changed to https protocol beforehand.\n\nMaybe somebody can confirm this workaround. Certainly not a perfect solution for\nthis annoying problem, but works for me. \nFrom the usability point of view it's nearly transparent for the user as he\nwon't see much of the loginforward.jsp.", "is_private": false, "id": 28518, "creation_time": "2002-12-28T17:08:00Z", "time": "2002-12-28T17:08:00Z", "creator": "mech@rz.fh-augsburg.de", "bug_id": 13861, "attachment_id": null}, {"count": 7, "attachment_id": null, "creator": "medthomas@ntlworld.com", "is_private": false, "id": 40923, "time": "2003-07-17T22:51:45Z", "bug_id": 13861, "creation_time": "2003-07-17T22:51:45Z", "tags": [], "text": "I have looked into this and this is still present in 4.1.24. I'll update the \nversion associated with this bug accordingly.\n\nIt is not present in 5.x.x. This is because 5.x.x uses forward rather than \nredirect for form logins. (see bug 21666)"}, {"count": 8, "tags": [], "text": "As far as I can tell this is an IE bug. Using the snoop example, Tomcat first \nredirects to SSL and then performs a second redirect to the form login jsp.\nThe response sent by IE to the first redirect comes in on port 8443 but the \nrequest headers refer to port 8080 (read in \norg.apache.coyote.http11.Http11Processor.parseHost()). This causes the second \nredirect to fail because the port in the request is used when constructing the \nsecond redirect.\n\nYou will not see this problem if the standard ports are used because Tomcat \ndefaults to these if the port is not specified in the headers.\n\nWork arounds are as suggested in the previous posts\n1. Use the standard ports\n2. Use a two stage re-direct\n\nI'll start a discussion on the developers list to gather opinions as to what, \nif anything, we should do about what looks very much like an IE bug.", "is_private": false, "id": 40924, "creation_time": "2003-07-17T23:04:04Z", "time": "2003-07-17T23:04:04Z", "creator": "medthomas@ntlworld.com", "bug_id": 13861, "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 13861, "attachment_id": null, "text": "Having found the time to have a look at swapping the order of the redirects \n(for FORM only) as suggested by Bill Barker on the TomcatDev list, there is an \nunexpected side-effect that I wasn't expecting. The first re-direct is to \nhttp://server:8080/myapp/protected/Login.html as expected. However, the second \nre-direct that you would expect to use https doesn't occur. The reason is that \nthe user data constraint is picked up from the login user data constraint and \nnot the app user data constraint. If the app is configured for ssl but the \nlogin is not, then the login will be in the clear. The current code, where the \nredirect for user data constraint occurs first ensures that the apps user data \nconstraint is applied to the login as well, even if the login does not have \none.\n\nGiven the above plus\n- the bug is really an IE bug, not a tomcat one\n- there is a work around available\n- the bug only appears when using non-standard ports\n\nI am now of the opinion that this should be a WONTFIX.", "id": 42469, "time": "2003-08-09T18:19:36Z", "creator": "medthomas@ntlworld.com", "creation_time": "2003-08-09T18:19:36Z", "is_private": false}]