[{"count": 0, "tags": [], "creator": "woolfel@yahoo.com", "attachment_id": null, "id": 25371, "time": "2002-10-30T12:31:12Z", "bug_id": 14088, "creation_time": "2002-10-30T12:31:12Z", "is_private": false, "text": "As more sites start to evaluate the use of gzip compression, it may be good to \nbuild in support for it. I haven't looked at the Http generator code in the \nlatest version, but in previous version it didn't support gzip compression. \nAdding the logic wouldn't be that hard."}, {"count": 1, "tags": [], "creator": "nathanc@tni.com", "text": "Would it be necessary to decompress the gzipped file on the first iteration of\nsupport?  JMeter does not currently try to \"render\" the HTML file before\nreporting it's download speed.\n\nHowever, I do see the importance of timing the decompression because the gzipped\nfile needs to be decompressed to be in the same \"ready for rendering\" state that\na non-gzipped file would be in.  This, of course, opens up the problem of which\nfiles are actually gzipped and which are not, which is answered by the\nContent-Encoding header field of the response.\n\n\nUnless I am mistaken, in order to get the server to send you a gzipped file, all\nyou have to send as a header field is:\n\nAccept-Encoding: gzip, deflate\n\n(e.g. conn.setRequestProperty(\"Accept-Encoding\", \"gzip, deflate\") in the\nsetupConnection() method of the HTTPSampler.java file.)", "id": 30703, "time": "2003-02-04T23:47:04Z", "bug_id": 14088, "creation_time": "2003-02-04T23:47:04Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 14088, "attachment_id": null, "text": "JMeter shouldn't be asked to unzip because JMeter should not simulate client\nprocessing - JMeter is one machine simulating many clients on a single CPU.  If\nyou have JMeter render HTML, unzip gzip files, execute javascript, etc, it would\nonly be meaningful if you stuck to a single thread.  Otherwise, it'll just bog\ndown the test machine and tell you nothing about how your server would perform\nwith 50 separate clients.\n\n", "id": 36308, "time": "2003-04-29T19:43:00Z", "creator": "mstover1@apache.org", "creation_time": "2003-04-29T19:43:00Z", "is_private": false}]