[{"count": 0, "tags": [], "bug_id": 14095, "is_private": false, "text": "The default config for Content-Type (set by DefaultType) on Mac OS X is\ntext/plain (I can't confirm this on other systems). This is just wrong. Perhaps\nsome time ago, back in the unix everything-is-a-text-file days this made sense,\nbut today, random unknown flies that aren't in the MIME types table are far more\nlikely to be binary data than text/plain.\n\nThe new default should be either application/octet-stream (which is in the MIME\nspec) or application/x-unknown-content-type (which is new to me, but maybe\nappropriate). application/octet-stream will allow the user agent to save the\nfile or prompt the user to make a decision, while\napplication/x-unknown-content-type will allow the user agent to actually sniff\nat the data and try to figure out what it is.\n\nThis is particularly a problem for Mozilla. see\nhttp://bugzilla.mozilla.org/show_bug.cgi?id=175848 amongst other bugs (that's\nfor Chimera light-weight mozilla on Mac OS X).", "id": 25381, "time": "2002-10-30T17:22:05Z", "creator": "sbwoodside@yahoo.com", "creation_time": "2002-10-30T17:22:05Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 14095, "text": "\"application/x-unknown-content-type\" is not a registered type and is just\nsomething used internally within Mozilla to mark content with no type specified.\n Please do not start sending this as an actual content-type over the Net, under\nany circumstances....\n\nSee also bug 13986", "count": 1, "id": 25383, "time": "2002-10-30T17:34:38Z", "creator": "bzbarsky@mit.edu", "creation_time": "2002-10-30T17:34:38Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 14095, "is_private": false, "id": 25390, "time": "2002-10-30T18:44:05Z", "creator": "dan@tobias.name", "creation_time": "2002-10-30T18:44:05Z", "tags": [], "text": "It would be better not to send a content type at all if the type is unknown,\nrather than a bogus type.  Technically, under the standards, a user agent is\nallowed to sniff for content if no MIME type is sent, but not if one is sent\n(even if it's some \"x-\" value that is unknown)."}, {"count": 3, "tags": [], "bug_id": 14095, "attachment_id": null, "text": "OK, forget about application/x-unknown-content-type, obviously I was off in\nla-la-land with that one.\n\nAs Dan said, once bug 13986 is fixed then the DefaultType should change to\nnothing. until then, application/octet-stream is better than status quo (text/plain)", "id": 25398, "time": "2002-10-30T21:38:51Z", "creator": "sbwoodside@yahoo.com", "creation_time": "2002-10-30T21:38:51Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 14095, "text": "\n\n*** This bug has been marked as a duplicate of 13986 ***", "id": 50109, "time": "2004-01-05T21:57:22Z", "creator": "erik@codefaktor.de", "creation_time": "2004-01-05T21:57:22Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 14095, "is_private": false, "count": 5, "id": 50117, "time": "2004-01-05T23:00:55Z", "creator": "bzbarsky@mit.edu", "creation_time": "2004-01-05T23:00:55Z", "text": "Erik, I'm sorry, but I have to reopen this.  The other bug is rather difficult\nto resolve, involving changes in core architecture and such (see the objections\nraised to my proposed patch).  It's not likely to be a change that happens in a\nminor point release.\n\nThis bug is requesting a one-line change in the default config file that can be\nmade by anyone who can type.  It could happen in a maintenance release, imo...\n(and should have happened by now if the Apache group is at all interested in\ntrying to resolve the browser makers' concerns about this behavior).\n\nTo be truthful, I am _very_ close to just hardcoding a check for the Apache\nserver in Mozilla and just ignoring any type sent by such servers, since it's\nclearly bogus so much of the time.  Our built-in content-sniffing would do a\nbetter job.  It pains me to say this, but IIS has the right behavior here; I\ncan't figure out why the Apache group is so set on screwing over people trying\nto write browsers complying with the HTTP standards."}, {"count": 6, "tags": [], "creator": "nd@perlig.de", "text": "you're  at the wrong group of people. We are not responsible for people who are\nnot configuring theirs servers properly.\n\nThat is, I don't see, how a sample server config file a browser's HTTP\ncompliance affects. Please calm down a bit.\n\nSaid that, I've startet a thread on dev@ wrt the issue anyway.", "id": 50119, "time": "2004-01-05T23:57:08Z", "bug_id": 14095, "creation_time": "2004-01-05T23:57:08Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 14095, "text": "\"you're looking at the wrong ...\"", "id": 50120, "time": "2004-01-05T23:58:08Z", "creator": "nd@perlig.de", "creation_time": "2004-01-05T23:58:08Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 14095, "is_private": false, "text": "Boris, no need to be sorry for reopening, but I've to disagree with you :)\n\nYou're right that #13986 is much more complex to resolve and I'm basically in favour of the \nproposed solution but the issue raised here at #14095 is simply a workaround for the other bug.\n\nAs Dan and Simon already put it: \"once bug #13986 is fixed then the DefaultType should change to \nnothing. until then, application/octet-stream is better than status quo (text/plain)\".\n\n> This bug is requesting a one-line change in the default config file that can be\n> made by anyone who can type.\n\nRight and everyone can do so in his/her httpd.conf. No problem here. IMHO the problem would be \nthe same with 'application/octet-stream', just the other way round... Again, the _real_ solution \nwould be to have #13986 fixed, at least in my eyes.", "id": 50121, "time": "2004-01-06T00:23:13Z", "creator": "erik@codefaktor.de", "creation_time": "2004-01-06T00:23:13Z", "attachment_id": null}, {"count": 9, "tags": [], "creator": "bzbarsky@mit.edu", "text": "André, I realize that you just distribute a sample config.  Too bad most people\njust use it without modifying it...\n\nThe reason your config affects browser compliance is that IE ignores the type\nyou send.  That means that all other browsers look \"broken\" when they follow the\nHTTP, since IE clearly \"works\" (does what the person serving the page wanted it\nto do).  This means that other browsers either have to fail on many real-world\npages or break the HTTP spec; in practice they are starting to choose the latter\nat this point.\n\nI've been pretty calm for over a year now (ever since bug 13986 got filed and I\nattempted to start a thread on the issue on the dev list only to be completely\nignored).  In that time, I have had to deal with dozens of Mozilla bug reports\nrequesting that we simply ignore the type because of Apache's default config (I\nam not counting the hundreds of bug reports filed in the same period of time\nthat got reassigned to evangelism to contact the site and ask them to pretty\nplease make the change that this bug requests be made in the default config). \nIt's hard to be calm when so much of my time is being wasted on this issue,\nwhich is why I am considering explicitly checking for Apache at this point -- it\nwould simply save me enormous amounts of time, especially if there are no plans\nto address either this bug or bug 13986.\n\nErik, as I pointed out the default setup of IIS is to send\napplication/octet-stream as the \"unknown data\" type.  There would be no problem\nin the reverse direction, because as soon as Apache started sending\napplication/octet-stream people who fail to configure their servers would see\ntheir pages \"break\" in IE AND WOULD FIX THEIR SETUPS.  Which is what we all\nwant.  It's unfortunate that the MIME bugs in IE make the text/plain behavior\nacceptable because, on average, the users simply don't notice it.  Changing to a\ntype they _do_ notice would have very beneficial consequences, imo.", "id": 50122, "time": "2004-01-06T00:37:49Z", "bug_id": 14095, "creation_time": "2004-01-06T00:37:49Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 14095, "text": "This is a very real problem at the browser end. The easiest way to fix it (even\nfor people who take \"sample\" files for face value and don't double-check\neverything themselves) is in the Apache default config. The fix is extremely\neasy to implement. Why, oh why, can't the fix go in now? We could *then* wait\nfor bug 13986. \n\nTo turn the situation around: Anyone who is informed and still wants the\ntext/plain default could be expected to change the default config. (And I think\nturning the expectation around this way is more realistic than just shrugging\nthe issue off by saying that each and every server admins should fix this\nseparately.)", "count": 10, "id": 50137, "time": "2004-01-06T18:22:19Z", "creator": "hsivonen@iki.fi", "creation_time": "2004-01-06T18:22:19Z", "is_private": false}, {"count": 11, "attachment_id": null, "creator": "nd@perlig.de", "is_private": false, "id": 50138, "time": "2004-01-06T19:01:08Z", "bug_id": 14095, "creation_time": "2004-01-06T19:01:08Z", "tags": [], "text": "Funny. What are you talking about? Guess what I'm going to do if there there\ncome no objections in the thread I've started? Did you read my posting?\n\nFolks, please tone down. There's no reason to become rude. We're not the ones\nwho fail to configure their server. I don't see why someone should take any\naction if he listens these attitudes all the time."}, {"count": 12, "tags": [], "creator": "dark1@myrealbox.com", "text": "I would like to point out that this bug (xor bug 13986 -- whichever way you look\nat it) causes the binary executables of the Apache HTTP Server for Microsoft\nWindows (on the http://apache.org download page) to be sent as plain/text (so\nthey display within the browser window), where the mantainers of the mirrors of\nthe Apache.org server have made the (incorrect) assumption that Apache works\ncorrectly (i.e.: sends correct Internet content-types) by default (whereas, in\nactual fact, it sends incorrect and particularly specific* ones by default when\nit has absolutely no idea of the actual content-type of the data).  I filed this\nproblem as bug 25650 a while back.\n\nI would also like to second the penultimate and the triultimate post which\nexplain why it *is* _preferable_ to sometimes send application/octet-stream as\nthe content type when it should be text/plain, as opposed to sometimes sending\ntext/plain as the content type when it should be application/octet-stream . \nObviously it is vastly preferable to either method to send nothing when unsure\n(i.e.:to fix bug 13986) but in the mean time...\n\n*that is, application/octet-stream is IMO less specific than text/plain .", "id": 50139, "time": "2004-01-06T19:21:03Z", "bug_id": 14095, "creation_time": "2004-01-06T19:21:03Z", "is_private": false, "attachment_id": null}, {"count": 13, "tags": [], "bug_id": 14095, "attachment_id": null, "text": "As I pointed out in bug 25650, the underlying problem is configuration,\nnot any bug in the server.  Apache expects users to configure mime types.\n\nThe problems here are:\n1. Users who don't configure mime types correctly; and\n2. MSIE, which created an expectation that incorrect configurations\nwork.  This is not only wrong, it is also a security problem.\n\nIndividually, neither of these problems would be a big deal.  Together,\nthey create an issue that we probably should address.\n\nOne thing to think about, Andre: DefaultType actually serves two purposes.\n1. It determines the type for files with unmatched extensions.\n2. It determines the type for files with NO extensions.\n\nFiles of the second type are quite likely to be text/plain\n(think README, etc), which is probably why that is currently the default.  \nAnd Apache provides no easy way to set the type of these files other than\nDefaultType.\n\nBut given the balance of harm, it is probably still a good idea both to\nchange the DefeaultType, and to allow for no Content-Type.\n\nEveryone should be aware, however, that this won't magically fix all the\nbroken servers out there.  Servers with this type of problem are also the\nones that are least likely to have an admin that will carefully inspect\nchanges in default config files.", "id": 50145, "time": "2004-01-06T21:00:28Z", "creator": "slive@apache.org", "creation_time": "2004-01-06T21:00:28Z", "is_private": false}, {"count": 14, "tags": [], "bug_id": 14095, "attachment_id": null, "text": "  Quoting an earlier comment...\n\n  \"application/octet-stream will allow the user agent to save the file or prompt \n   the user to make a decision, while application/x-unknown-content-type will \n   allow the user agent to actually sniff at the data and try to figure out what \n   it is.\"\n\n  is entirely wrong w.r.t. Microsoft IE.\n\n  IE has the irritating distinction of treating BOTH text/plain and also\n  application/octet-stream as content type '*', parsing the data for some \n  possible meaning.  This causes IE to succumb to all sorts of mallicious\n  purposes and undesirable side-effects of file naming.  (e.g. refusing to\n  simply display a nice text/plain result of a result uri named 'test.pl',\n  but instead insisting it aught to be locally executed or saved.)\n\n  I agree with the spirit of the proposal, that our default become\n  application/octet-stream until such time as we provide *no* content-type \n  whatsoever if the user has left it unconfigured.", "id": 50495, "time": "2004-01-13T22:05:49Z", "creator": "wrowe@apache.org", "creation_time": "2004-01-13T22:05:49Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 14095, "text": "Note that apparently the next IE service pack will significantly scale back the\ntypes of sniffing IE will do (for security reasons, amusingly enough).  As a\nresult, eg, it will no longer treat text/plain files as HTML even if they look\nlike HTML.", "count": 15, "id": 50496, "time": "2004-01-13T22:13:37Z", "creator": "bzbarsky@mit.edu", "creation_time": "2004-01-13T22:13:37Z", "is_private": false}, {"count": 16, "tags": [], "bug_id": 14095, "attachment_id": null, "text": "Sorry, I'm a little bit confused here. I've read through this bug report, and\nthere seems to be a disagreement. But I can't figure out over what, unless it's\nthe duplicate-marking of this report.\n\nIf one were to create a patch that changed the default DefaultType in the default\nconfig, as requested by the reporter, would that patch be accepted?\n", "id": 52903, "time": "2004-02-25T01:30:53Z", "creator": "fantasai@escape.com", "creation_time": "2004-02-25T01:30:53Z", "is_private": false}, {"count": 17, "attachment_id": null, "creator": "bzbarsky@mit.edu", "is_private": false, "id": 52904, "time": "2004-02-25T01:36:52Z", "bug_id": 14095, "creation_time": "2004-02-25T01:36:52Z", "tags": [], "text": "Dirk-Willem (see bug 13986 comment made at 2004-02-14 00:35) says that just\nmaking that change would break the following:\n\n1)  Sending \"README\" files as plaintext\n2)  Interaction with systems like akamai\n3)  interaction with certain caching proxies\n\nSo the impression I got is that the answer is \"no\""}, {"count": 18, "tags": [], "bug_id": 14095, "text": "> Dirk-Willem (see bug 13986 comment made at 2004-02-14 00:35) says that just\n> making that change would break the following:\n\n> 1)  Sending \"README\" files as plaintext\n\nThis is a legitimate problem.  The ideal solution it to allow the \"no extension\"\ncase to be configured separately from the \"unknown extension\" case.\n\nBut I don't think it would hurt anyone severly to switch the config-file \ndefault to application/octet-stream. People who need text/plain can always\nmake the switch, and apache now requires README.txt or README.html for\nits autoindex files anyway. \n\n> 2)  Interaction with systems like akamai\n> 3)  interaction with certain caching proxies\n\nI have no idea what this means.  How could changing from one wrong mime type\nto another (slightly less) wrong mime type hurt proxies?", "id": 52936, "time": "2004-02-25T15:28:21Z", "creator": "slive@apache.org", "creation_time": "2004-02-25T15:28:21Z", "is_private": false, "attachment_id": null}, {"count": 19, "tags": [], "text": "No idea.  You'll have to ask Dirk-Willem; I never quite understood his\nexplanation of the proxy issue.", "is_private": false, "id": 52940, "creator": "bzbarsky@mit.edu", "time": "2004-02-25T15:47:19Z", "bug_id": 14095, "creation_time": "2004-02-25T15:47:19Z", "attachment_id": null}, {"count": 20, "tags": [], "bug_id": 14095, "is_private": false, "text": "*** Bug 27499 has been marked as a duplicate of this bug. ***", "id": 53568, "time": "2004-03-07T01:16:49Z", "creator": "slive@apache.org", "creation_time": "2004-03-07T01:16:49Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "slive@apache.org", "text": "*** Bug 27500 has been marked as a duplicate of this bug. ***", "count": 21, "id": 53570, "time": "2004-03-07T01:17:46Z", "bug_id": 14095, "creation_time": "2004-03-07T01:17:46Z", "is_private": false}, {"count": 22, "tags": [], "creator": "jwalden+apache@mit.edu", "attachment_id": null, "text": "So, honestly, if you're going to WONTFIX I think you should at least explain why...", "id": 106185, "time": "2007-08-02T12:02:37Z", "bug_id": 14095, "creation_time": "2007-08-02T12:02:37Z", "is_private": false}, {"count": 23, "tags": [], "bug_id": 14095, "text": "Changing a long-standing default is a big/disruptive thing on a stable product.\n Let alone a long-obsolete product like Apache 1.3 (the 1998 release).\n\nFeel free to argue your case for future releases.  But you'd do that on the dev\nmailinglist, not bugzilla.", "id": 106188, "time": "2007-08-02T12:25:47Z", "creator": "nick@webthing.com", "creation_time": "2007-08-02T12:25:47Z", "is_private": false, "attachment_id": null}, {"count": 24, "tags": [], "bug_id": 14095, "text": "For what it's worth, when I brought this up on the dev mailing list almost five\nyears ago (when the bug was filed) the answer was a deafening silence.  I have\nno reason to believe that things would be any different now.\n\nAs I said in bug 13986, at this point things are pretty much moot: all the\nbrowsers have been forced to work around this Apache issue by breaking the HTTP\nspec and either sniffing for the \"real\" type (e.g. IE) or just trying to guess\nwhether the data should really be application/octet-stream (e.g. Gecko) when\nthey get a type of text/plain.\n\nGiven that, trying further to get you guys to change this broken behavior is\njust a waste of time: chances are there will be no response anyway, and even if\nthere is it won't help HTTP UAs, who'll have to continue working around this\nproblem in all the existing Apache installs.", "id": 106190, "time": "2007-08-02T12:36:42Z", "creator": "bzbarsky@mit.edu", "creation_time": "2007-08-02T12:36:42Z", "is_private": false, "attachment_id": null}, {"count": 25, "tags": [], "creator": "nick@webthing.com", "text": "**** DON'T **** add other people's names to a Cc: list, SPAMMER.\n\n(In reply to comment #24)\n> For what it's worth, when I brought this up on the dev mailing list almost five\n> years ago (when the bug was filed) the answer was a deafening silence.\n\nYou have the advantage of me.  I don't recollect your post, so I can't say\nwhether it had anything like a coherent argument.\n\n> As I said in bug 13986, at this point things are pretty much moot: all the\n> browsers have been forced to work around this Apache issue by breaking the HTTP\n> spec and either sniffing for the \"real\" type (e.g. IE) or just trying to guess\n> whether the data should really be application/octet-stream (e.g. Gecko) when\n> they get a type of text/plain.\n\nUtter rubbish.  MSIE has *always* broken HTTP.  That's how the first email worms\ngot into Outlook (which shares the same bug), back in about 1997.\n\n> Given that, trying further to get you guys to change this broken behavior is\n> just a waste of time: chances are there will be no response anyway, and even if\n> there is it won't help HTTP UAs, who'll have to continue working around this\n> problem in all the existing Apache installs.\n\nAs it happens, I'd support changing this particular default.  But not\nretrospectively.  Nor so strongly as to take the driving seat.  And I'm\ncertainly not going to argue the case in bugzilla: I just need to remove myself\nfrom getting mailed twice due to some moron messing with Cc: lists.", "id": 106193, "time": "2007-08-02T12:50:23Z", "bug_id": 14095, "creation_time": "2007-08-02T12:50:23Z", "is_private": false, "attachment_id": null}, {"count": 26, "tags": [], "creator": "bzbarsky@mit.edu", "attachment_id": null, "text": "> **** DON'T **** add other people's names to a Cc: list, SPAMMER.\n\nCustoms apparently differ.  In other bugzillas you do that if you're having a\ndiscussion with someone in a bug so that they don't miss part of it.\n\n> Utter rubbish.  MSIE has *always* broken HTTP.\n\nIndeed.  Apache's behavior has just force Gecko, Webkit, Opera, to follow suit.\n\n> But not retrospectively. \n\nNo one's asking for this to be changed in shipped stable software.  At the time\nthis bug was filed it was filed on what was the current version.  I can't help\nthe fact that your bug tracking system doesn't have a way to track bugs\napplicable to \"whatever the current development version is\".", "id": 106198, "time": "2007-08-02T13:01:53Z", "bug_id": 14095, "creation_time": "2007-08-02T13:01:53Z", "is_private": false}, {"count": 27, "tags": [], "text": "OK, let's try getting this fixed in a more recent release.  See also discussion\non the public-html@w3.org mailing list about issues related to server type\nmisconfiguration and MIME type sniffing on the client side.", "is_private": false, "id": 107257, "creator": "bzbarsky@mit.edu", "time": "2007-08-25T12:17:54Z", "bug_id": 14095, "creation_time": "2007-08-25T12:17:54Z", "attachment_id": null}, {"count": 28, "tags": [], "bug_id": 14095, "text": "Though really, fixing bug 13986 would be much much better.  This bug was just\nmeant as a temporary workaround pending the work needed to handle modules, etc,\nwell for that bug...", "id": 107258, "time": "2007-08-25T12:30:46Z", "creator": "bzbarsky@mit.edu", "creation_time": "2007-08-25T12:30:46Z", "is_private": false, "attachment_id": null}, {"count": 29, "attachment_id": null, "creator": "fielding@apache.org", "is_private": false, "id": 107295, "time": "2007-08-27T10:31:10Z", "bug_id": 14095, "creation_time": "2007-08-27T10:31:10Z", "tags": [], "text": "Changing the default to application/octet-stream is not going to happen.\nAnyone can do that in their own server using DefaultType, and if we did\nit on all servers that would just lead to yet another sniffed type.\n\nFixing #13986 is easier (socially, not technically).  Marking this\nas a duplicate because it has shared state.\n\n\n*** This bug has been marked as a duplicate of 13986 ***"}]