[{"attachment_id": null, "tags": [], "bug_id": 14246, "is_private": false, "count": 0, "id": 25658, "time": "2002-11-05T08:37:07Z", "creator": "bloch@clearwellsystems.com", "creation_time": "2002-11-05T08:37:07Z", "text": "Dunno if this is spose to work or not.\n\nBut if you try to run Tomcat4.1 against the JRE alone\nthis script fails because it can't find jdb and javac.\n\nAt the very least, this is a change in behavior since 4.0\n\n-Eric"}, {"count": 1, "tags": [], "bug_id": 14246, "text": "I think it's always been clear in the documentation that Tomcat requires the\nJDK, and not the JRE. Of course, this is only needed for Jasper.", "id": 25659, "time": "2002-11-05T08:54:29Z", "creator": "remm@apache.org", "creation_time": "2002-11-05T08:54:29Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "Sure... but deployment environments often only have the JRE installed\nand it's dorky at best that the startup scripts that are shipped don't work\nw/out the JDK... especially when the scripts don't really need them.\nIn fact, javac shouldn't be required at all... only the tools.jar should\nbe needed, I think.\n\nIt'd be a snap to fix the scripts to only error when jdb or javac are\nneeded *and* missing rather than when they are just missing. I'd be\nhappy to submit fixed scripts, if you want em.\n\nE\n\n\n", "is_private": false, "bug_id": 14246, "id": 25661, "time": "2002-11-05T09:10:28Z", "creator": "bloch@clearwellsystems.com", "creation_time": "2002-11-05T09:10:28Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "ian779@darwinsys.com", "attachment_id": null, "text": ">Sure... but deployment environments often only have the JRE... And then some time later you want to put in a JSP instead of a Servlet - guess what, JSPs need to be compiled on the \"deployment only\" machine. Will you then be complaining that we need JDK for that too? Or will you be too busy replacing the JRE with the JSDK at that point? :-)  But you're right, perhaps we should let you hang yourself by not detecting this problem until you actually try to compile a JSP. This is known as \"lazy evaluation\". Please feel free to send patches to the batch file. ", "id": 25730, "time": "2002-11-05T22:31:23Z", "bug_id": 14246, "creation_time": "2002-11-05T22:31:23Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 14246, "is_private": false, "count": 4, "id": 25739, "time": "2002-11-06T01:00:47Z", "creator": "bloch@clearwellsystems.com", "creation_time": "2002-11-06T01:00:47Z", "text": "At the very least, the error messages are wrong/misleading as they\nstand.  \n\nCan I simply remove the check for javac sine none of the scripts\nactually use it?  \n\n-Eric"}, {"count": 5, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I have improved the error message.\n\nThe documentation is clear that the JDK is required and the startup scripts \nshould check for this. The scripts have no way of determining if a JSP will \nneed to be compilied at some point in the future and therefore this check \ncannot be made optional.", "id": 52209, "time": "2004-02-12T21:40:41Z", "bug_id": 14246, "creation_time": "2004-02-12T21:40:41Z", "is_private": false}]