[{"count": 0, "tags": [], "text": "The depends=\"yes\" option on the FTP task does not work when uploading files to \nan IBM AIX 4.3 plafform. The FTP task consequently uploads all specified files \nwith no respect to the last modified timestamp. \n\nI have tracked it down to the method \nisUpToDate(FTPClient ftp, File localFile, String remoteFile) in the FTP.java \nfile where the lines:\n\nlong remoteTimestamp = files[0].getTimestamp().getTime().getTime();\nlong localTimestamp = localFile.lastModified();\n\nproduce results like:\n\nremoteTimestamp = -62167482000000\nlocalTimestamp = 1036573322465\n\nmaking it quite obvious why depends=\"yes\" does not work.\n\nMaybe there is a bug in the FTPClient class from Net Components library?", "attachment_id": null, "id": 25848, "creator": "lars@fastrup.net", "time": "2002-11-07T09:29:50Z", "bug_id": 14333, "creation_time": "2002-11-07T09:29:50Z", "is_private": false}, {"count": 1, "tags": [], "creator": "laurent.martin@siemens.com", "attachment_id": 3773, "id": 25908, "time": "2002-11-08T10:19:39Z", "bug_id": 14333, "creation_time": "2002-11-08T10:19:39Z", "is_private": false, "text": "Created attachment 3773\nAnother bug for the option depends of the task FTP"}, {"count": 2, "tags": [], "bug_id": 14333, "attachment_id": null, "id": 26124, "time": "2002-11-12T09:58:27Z", "creator": "lars@fastrup.net", "creation_time": "2002-11-12T09:58:27Z", "is_private": false, "text": "did some more research into this bug and found the actual cause. It figures out \nthat the FTP task only recognizes one date format in the remote filelist. E.g. \nit does not recognize the timestamp of the following file:\n\n-r--r--r--   1 nobody   nobody        1142 24 okt 14:02 afile.txt\n\nDate formats are localized and the FTP task should ideally support this. This \nbest solution would be to force the UNIX ls command to always deliver the \ntimestamp in a specific format but it does not seem to have any options \navailable to do this.\n\nAnother problem with the unix file listing is also the lack of year and seconds \nin the timestamp making it impossible to compare the timestamp of a remote file \nwith a local file, which was I wanted the FTP task to do.\n"}, {"attachment_id": null, "tags": [], "bug_id": 14333, "text": "Usually Unices replace the time after the date with the year when an file is\nolder than an uncertain number of days (less than a year), so that the year\nshould't be a problem. The listing format is determined by the command actually\nexecuted by the FTP deamon. An FTP deamon is allowed to use almost anything as\nreturn format.\n\nUnix ls commands commonly have the options to force a certain data/time format\n(sometimes even including the milliseconds) but these are not common amongst\nunices and are normally not passed via ftp client and ftp server towards the\nunix ls comman that is executed.\n\n\n", "count": 3, "id": 26141, "time": "2002-11-12T17:24:51Z", "creator": "jkf@apache.org", "creation_time": "2002-11-12T17:24:51Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 14333, "text": "I am experiencing similar issues.  But only in 1.5.1.  1.4.1 works fine.  The \nFTP tasks is trying to create directories as it copies each file included in \nthe fileset when it does not need to.  This causes a build exceptiona as the \ndirectory already exist.", "id": 29086, "time": "2003-01-09T19:20:48Z", "creator": "sbella02@sprintspectrum.com", "creation_time": "2003-01-09T19:20:48Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 14333, "text": "I have the same problem as Scott. ", "count": 5, "id": 32493, "time": "2003-03-05T19:44:15Z", "creator": "david.m.ishee@lmco.com", "creation_time": "2003-03-05T19:44:15Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 14333, "text": "I have been talking about this on the commons-dev mailing list as it pertains to commons-net (formerly NetComponents).  Fixing it there will be a prerequisite of fixing it here.  First off, I am talking only about date parsing and the depends/newer option.  The other problem identified by Scott Bellamy and David Ishee seems like a totally different problem which should be addressed in a separate bug report rather than tacked on to this one as its solution will be completely different.  You should know that there are new parsing options in commons-net that can and should be supported in the <ftp> task.  FTP parsers for NT, OS2, and VMS FTP servers have been created in addition to unix and support for these could now be added to ant.  However these only take us part of the way toward solving this bug and implementation of the ant-side fix may want to wait until the net-components piece is fixed.  Here is what I wrote on the commons-dev mailing list:  ---------------------------------------------------------------  I have been thinking about the issue, though, in particular where commons-net.ftp might have to go in order to really implement the ambitious spec laid out for it by clients such as ant, which have chosen to use it.   Of particular note here is the \"depends\" (or synonym \"newer\") attribute of the ant <ftp> task.  This runs aground on the issue of parsing the date.  In the first place, there are the issues of general listing format (unix, NT, VMS, etc.).  In the second place, though, within these categories are issues of date format.  This devolves into a thicket of locale-type issues:   Does month come before date?  In which language are the names of the months coded?   To solve this, the scope of parser definition needs to be significantly expanded.   Things might be better if there was any mechanism within the FTP specification for the server to expose its format to a client.  No such mechanism exists, however.  In fact RFC959, the FTP spec is intentionally vague on this point:   \"Since the information on a file may vary widely from system  to system, this information may be hard to use automatically  in a program, but may be quite useful to a human user.\"   http://www.ietf.org/rfc/rfc959.txt   In other words, FTP was never meant to be used in such an automated fashion.   Nonetheless, with the specification of parameters easily passed in by something like an ant task, it might be possible to define a parser sufficiently to perform this task.  These parameters include:   1) os type of FTP server(unix, NT, OS2, VMS, etc.) 2) date format - to define ordering of date components -  \"MMM dd\" or \"dd MMM\", etc. as in simple date format 3) locale - to define actual abbreviations of the months.    From 2 and 3 it is possible to build a Locale-specific SimpleDateFormat  capable of parsing dates on a particular system.  This object contains the     names and abbreviations of the month.   This immediately raises the question of how to divvy up the parsing duties between the regular expression and the SimpleDateFormat.   It seems as if the format string must be used to construct the part of the regex in the correct order.  Then the SimpleDateFormat would be used to actually parse the date.  All \"optimizations\" such as assuming a constant character width of 3 for month abbreviations are out the window here - they work for many languages, but not for all.  French, for example, uses periods and varying lengths.   A cautionary note: one would have to inspect actual ftp sites to determine whether they actually the abbreviations specified in java Locales.   ----------------------------------------------  What I would like, especially from those who submitted and added to this bug, are the addresses of particular ftp non-English ftp servers that I could log into for the purposes of \"getting the lay of the land\" before I begin coding a solution   ", "count": 6, "id": 32755, "time": "2003-03-10T02:32:39Z", "creator": "scohen@apache.org", "creation_time": "2003-03-10T02:32:39Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 14333, "text": "Created attachment 5237\nlengthy comments on this problem", "id": 32756, "time": "2003-03-10T02:38:13Z", "creator": "scohen@apache.org", "creation_time": "2003-03-10T02:38:13Z", "is_private": false, "attachment_id": 5237}, {"count": 8, "attachment_id": null, "creator": "scohen@apache.org", "text": "Damn, why did Bugzilla not respect my line feeds. I am going to submit my whole comment as an attachment. ", "id": 32758, "time": "2003-03-10T02:39:47Z", "bug_id": 14333, "creation_time": "2003-03-10T02:39:47Z", "tags": [], "is_private": false}, {"count": 9, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "id": 42356, "time": "2003-08-07T20:38:51Z", "bug_id": 14333, "creation_time": "2003-08-07T20:38:51Z", "is_private": false, "text": "I have tested the reported bug against 3 ftp servers :\n\n-  FTP server (Version 6.00LS) on FreeBSD 4.8-STABLE US Locale\n\n-  FTP server (Hummingbird Ltd. (HCLFTPD) Version 7.0.0.0) on Windows 2000, \nGerman locale\n\n- FTP server (GNU inetutils 1.3.2) on Windows 2000, German locale\n\nIn the 3 cases I am able to obtain the real date and time of remote files in the \nftp task, using ant 1.6alpha with commons-net 1.0.0\n\nTherefore I close the bug as WORKSFORME in ant 1.6alpha.\n\nThere is however a possibility that the ftp task, and actually the commons-net \ncode have problems with systems configured in languages other than German or \nEnglish.\n\nPeople experiencing problems should write to the jakarta-commons user list, \nattaching samples of ftp directory listings obtained on the server where they \nare experiencing problems.\n"}, {"count": 10, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "text": "Actually, my test does not indicate whether it would work with German ftp \nservers, my ftp servers seem to print the dates in English, although they are \nbased on German OS. I think it would not work if the dates were printed in \nGerman for months which have different short spelling in German such as Okt \n(October).", "id": 42357, "time": "2003-08-07T20:50:23Z", "bug_id": 14333, "creation_time": "2003-08-07T20:50:23Z", "is_private": false}]