[{"count": 0, "attachment_id": null, "bug_id": 14382, "is_private": false, "id": 25906, "time": "2002-11-08T08:44:24Z", "creator": "mdangus@psychtest.com", "creation_time": "2002-11-08T08:44:24Z", "tags": [], "text": "Binary distributions of Apache since 2.0.39 have not been able to be installed \nas a service under Windows 2000 from the MSI package. What happens is the \ninstallation program seems to run perfectly, and claims to have completed \nsuccessfully. \n\nBut the little tray icon with the feather in the bottom right of the screen \nshows a red mark in the circle, raqther than a green mark, and further \ninspection shows no service has been installed under windows, even though one \nhas been requested during installation. \n\nI assume most of us are still running ver. 2.0.39 under windows 2000, because \nthat is the last distribution which actually installs itself as a service from \nthe MSI package. This has me a bit worried, as I would like to get the security \nfixes available since then."}, {"count": 1, "attachment_id": null, "bug_id": 14382, "is_private": false, "id": 25951, "time": "2002-11-08T16:08:33Z", "creator": "wrowe@apache.org", "creation_time": "2002-11-08T16:08:33Z", "tags": [], "text": "\n  I won't ask you why you want to run a vulnerable (.39 revision) server.\n\n  All of the packages successfully install the service.  None of them can\n  install the service if you ALREADY have a web server running on port 80.\n\n  After you REMOVE or STOP the running server (use the command netstat -an \n  to decide if a server is running on port 80), or you modify your httpd.conf\n  file to Listen on a different port, you may use this command from your\n  installed Apache2 directory (usually c:\\program files\\apache group\\apache2)\n\n    bin\\apache -k install -n Apache2\n\n  If it can't install, it will yell at you.  Future releases will yell at you\n  during installation, but that required the -w option that was just introduced\n  in 2.0.43 (it holds the window open if there is an error, even within the\n  .msi installer, when it's specified.)\n"}, {"count": 2, "tags": [], "bug_id": 14382, "attachment_id": null, "text": "Thanks you for the solution you suggest. Unfortunately it does not resolve \nissue. I am familiar with installing Windows software, and did try to install \nonly after having stopped the Apache service, the MSI prompts to uninstall!! \nmanually -- in addition to stopping the service. And I did thistoo . \n\nAfter uninstalling and removing the previous version from the system, your \ncomment about  bin\\apache -k install -n Apache2\nis perhaps helpful, but still not a resolution. The command you describe \nresults in report of a failure to load \"cannot execute \nC:\\php\\SAPI\\php4apache2.dll\" ", "id": 25986, "time": "2002-11-09T04:41:41Z", "creator": "mdangus@psychtest.com", "creation_time": "2002-11-09T04:41:41Z", "is_private": false}, {"count": 3, "tags": [], "creator": "wrowe@apache.org", "text": "\n  This bug, too, will be addressed by the installer as of 2.0.44.  It won't \n  successfully install [you have plugged in php4apache2.dll built for an\n  older version of Apache!  Get an updated binary first!]\n\n  The console slammed closed because we didn't put the 'hooks' in early enough\n  to report some errors and keep the window open until you dismissed it.  So\n  this result is by design, and you need to update your module.  We need to\n  release 2.0.44 so users can SEE the problem when attempting to install.\n", "id": 26005, "time": "2002-11-09T17:28:33Z", "bug_id": 14382, "creation_time": "2002-11-09T17:28:33Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 14382, "attachment_id": null, "text": "Of course before reporting a bug I did upgrade to the latest version of PHP -- \njust as I tried to upgrade to a later version of \nApache2.  \n\nI suppose from what you have written that the versions of Apache after 2.0.39 \nhave not worked with any of the available PHP-for-Apache2 distributions. \n\nIn case I have not understood what you write, is it true that if we want \nApache2 with PHP, then the lastest version of Apache we can use is 2.0.39?", "id": 26017, "time": "2002-11-09T20:23:10Z", "creator": "mdangus@psychtest.com", "creation_time": "2002-11-09T20:23:10Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 14382, "attachment_id": null, "text": "*** Bug 14802 has been marked as a duplicate of this bug. ***", "id": 26916, "time": "2002-11-25T05:30:07Z", "creator": "wrowe@apache.org", "creation_time": "2002-11-25T05:30:07Z", "is_private": false}]