[{"count": 0, "tags": [], "bug_id": 14446, "text": "It would be _very_ helpful for any new features added to the documentation to \ncontain some sort of \"since\" comments.  This would allow an ant user to only \nkeep one version of the ant documentation available but easily determine what \nfeatures are available on prior versions.  Many open-source projects that use \nant require a minimum ant version for their build process, and that ant version \nis usually not the current ant version available.", "id": 26072, "time": "2002-11-11T14:56:31Z", "creator": "thierry.lach@bbdodetroit.com", "creation_time": "2002-11-11T14:56:31Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 14446, "attachment_id": null, "id": 27026, "time": "2002-11-26T23:19:35Z", "creator": "rxh@gers.com", "creation_time": "2002-11-26T23:19:35Z", "is_private": false, "text": "I'd just like to add an example of how helpful this information would be.\nAt this URL: \nhttp://devedge.netscape.com/library/manuals/2000/javascript/1.5/reference/array.\nhtml#1193137\n\nYou can easily see when the feature was implemented and what type of \nenhancements were added in other versions.\n"}, {"count": 2, "tags": [], "bug_id": 14446, "attachment_id": null, "text": "I second this request; at least for every task the doco should\ngive the lowest Ant version where this task surfaced first (similar to the \nsince fieldin the Javadocs). This helps a lot to write \"portable\" build files\nwithout having to keep many versions of the Ant Manual around...\n\nThe proposed solution goes a step further trying to document even changes\nin task attributes/subelements (at least that's how I understand it), but\nhaving a since field for every task would be a promising start...", "id": 32547, "time": "2003-03-06T10:49:05Z", "creator": "landers@in.tum.de", "creation_time": "2003-03-06T10:49:05Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 14446, "attachment_id": null, "text": "Maybe the @since comment can be used for set<attribute>() and \nadd|create<nestedElement>() also. So it can be used for generating the doko via \nXDoclet. (There was a discussion about that generation, I guess.)", "id": 32549, "time": "2003-03-06T10:52:37Z", "creator": "jan@materne.de", "creation_time": "2003-03-06T10:52:37Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 14446, "attachment_id": null, "is_private": false, "id": 75464, "time": "2005-05-26T23:55:28Z", "creator": "mbenson@apache.org", "creation_time": "2005-05-26T23:55:28Z", "text": "This is a request whose implementation is an ongoing process.  Present\n custom in Ant's Java source is to add @since javadoc tags in the Java source \nat the class level for new classes and at the method level for new \nattributes/elements.  In the manual, similarly, new tasks and types are labeled \nat the page level while new attributes and elements are directly labeled with \nsome form of \"since\" notation."}]