[{"attachment_id": null, "tags": [], "bug_id": 1449, "is_private": false, "count": 0, "id": 1968, "time": "2001-04-21T12:11:54Z", "creator": "rkreisel@mediaone.net", "creation_time": "2001-04-21T12:11:54Z", "text": "When displaying the page generated by the example servlet, (from the outside \nworld), the wait cursor continues until the server times out. If the port \nnumber (8080) is included the page displays and the wait cursor stops. This \nproblem is confusing because I get different (but consistent) results when I \naccess the servlet from inside my firewall. All of the urls below point to the \nsame class file on my server.\n\nrkreisel.dhs.org/examples/servlets/RequestInfoExample - works on my internal \nnetwork regardless of OS, but \"hangs\" if accessed via an external ISP\n\nrkreisel.dhs.org:8080/examples/servlets/RequestInfoExample - works regardless \nof OS or ISP of requestor, (unless the requestor is behind another firewall, \nlike at work, where that firewall blocks 8080. In that case nothing is returned \nbecause my server never receives the request??)\n\nnt40srvr/examples/servlets/RequestInfoExample - on the internal network the \npage is displayed, but the wait cursor continues until timeout under Win 9x, \nbut it works under NT 4.0 (workstation)\n\nnt40srvr:8080/examples/servlets/RequestInfoExample - on the internal network it \nworks correctly (completes) regardless of the OS\n\np.s. This applies to jsp's as well\n\nI would like to use Tomcat in a \"production\" environment for a small site I \nmaintain on my server, but this bug will confuse my users (my junior and senior \nhigh Sunday School class)\n\np.s. I noticed a couple postings on this topic in the mail list, but the \nsuggested solutions were no help.\n\np.p.s. This may be a duplicate bug report, but I could not find anything \nthrough the search engine. This one is difficult to describe in a few keywords!"}, {"count": 1, "attachment_id": null, "creator": "rkreisel@mediaone.net", "text": "Server is NT 4.0 (sp6a).\nWeb server is IIS 3.0 (I know Tomcat has only been tested w/4.0, but I'm hoping \nthis is not an IIS problem).\nServer also runs Winproxy which contains a firewall. I have opened ports 8080 \nand 8007 for both incoming and outgoing TCP and UDP.\nInternet connection is a cable \"modem\".", "id": 1978, "time": "2001-04-21T14:51:13Z", "bug_id": 1449, "creation_time": "2001-04-21T14:51:13Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 1449, "is_private": false, "count": 2, "id": 2117, "time": "2001-04-26T07:29:41Z", "creator": "rkreisel@mediaone.net", "creation_time": "2001-04-26T07:29:41Z", "text": "I have given up on Tomcat and gone to Resin (which, by the way, works fine). As \na result, I re-targeted the \"examples\" context. The above URL, therefore, will \nnot work. If someone comes up with a solution I would still like to know, \nbecause Tomcat is a little easier to configure than Resin, and I would prefer \nto use it instead."}, {"count": 3, "attachment_id": null, "creator": "cmanolache@yahoo.com", "text": "\n\n*** This bug has been marked as a duplicate of 1371 ***", "id": 2512, "time": "2001-05-17T12:56:00Z", "bug_id": 1449, "creation_time": "2001-05-17T12:56:00Z", "tags": [], "is_private": false}]