[{"count": 0, "tags": [], "creator": "johann.uhrmann@xpecto.com", "attachment_id": null, "id": 26206, "time": "2002-11-13T17:15:16Z", "bug_id": 14515, "creation_time": "2002-11-13T17:15:16Z", "is_private": false, "text": "The following configuration makes tomcat (or the http-Connector?) transmit\nthe document (html page or jsp) twice. \nThis causes the page to be shown twice on the client:\n\n- An external site (not hosted on tomcat) has a form which is sent via\n  POST on a tomcat page.\n\n- The document on the tomcat server is the index document for that web \n  application.\n\n- There is a filter for that web application which reads the parameters given\n  by the post request and sets some session parameters and a cookie.\n  It also wraps the request to overload getRemoteUser and isUserInRole.\n  (That filter is actually used for single-sign-on authentication.)\n\n- The referring site is hosted on the same machine, but on an Apache web server:\n  http://www/apostform.html --[http-post]---> http://www:8081/myapp/index.jsp\n\n\nAccording to tcpdump, the page is transmitted twice as a reply for a single\npost request. The reply is also transmitted in a single packet (if it's small\nenough) which may indicate that the output buffers on tomcat have nut been flushed."}, {"count": 1, "tags": [], "creator": "remm@apache.org", "text": "There is no way Coyote HTTP/1.1 can be made to generate two responses to only\none HTTP request. I encourage you to investigate further, as this is too complex\nto reproduce, and I will not have time to look into it.", "id": 26256, "time": "2002-11-14T07:58:58Z", "bug_id": 14515, "creation_time": "2002-11-14T07:58:58Z", "is_private": false, "attachment_id": null}, {"count": 2, "text": "Under certain conditions the filter described in the bug report calls\ndoFilter(reqestwrapper, response) twice which causes the described\nbehaviour.\n\nSorry ;-/\n", "bug_id": 14515, "attachment_id": null, "id": 26259, "time": "2002-11-14T09:20:12Z", "creator": "johann.uhrmann@xpecto.com", "creation_time": "2002-11-14T09:20:12Z", "tags": [], "is_private": false}]