[{"count": 0, "tags": [], "creator": "joe@kafsemo.org", "attachment_id": null, "id": 26203, "time": "2002-11-13T17:03:09Z", "bug_id": 14513, "creation_time": "2002-11-13T17:03:09Z", "is_private": false, "text": "AddDefaultCharset is currently only applied to a small list of MIME types. XHTML\nshould also be included.\n\nAs far as I can see, this simply involves adding \"application/xhtml+xml\" to the\n'needcset' array in server/protocol.c; ideally this array would be replaced with\nconfigurable settings, as a number of other XML-based MIME types would also\nqualify for this treatment (text/xml and image/svg, for example).\n\n(Whilst XML may well include its charset in the header, I believe it should also\nbe sent as part of the MIME type; perhaps the file could be checked for the\ncorrect encoding to declare before imposing the site's default?)"}, {"count": 1, "tags": [], "creator": "nd@perlig.de", "attachment_id": null, "id": 33546, "time": "2003-03-20T16:40:53Z", "bug_id": 14513, "creation_time": "2003-03-20T16:40:53Z", "is_private": false, "text": "Yes we need some more generic solution for this, such as AddCharsetByType or\nsomething. Changing to assigned until someone feels to code it up.\n\nThanks for your report and thanks for using Apache."}, {"count": 2, "tags": [], "bug_id": 14513, "attachment_id": null, "id": 43741, "time": "2003-09-05T12:27:58Z", "creator": "xjogg@trashmail.net", "creation_time": "2003-09-05T12:27:58Z", "is_private": false, "text": "Hello!\n\nHere are other informations related to this problem. I'll try to make it easy to\nunderstand.\n\n* Context : I have a website running Apache 2.0.47. My pages are all valid\naccording to XHTML 1.1 strict.\n\n* What I did : I specified the\ncontent-type=\"application/xhtml+xml; charset=utf-8\"\nin the meta tag of my pages.\nI also indicated the optional XML prolog :\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\nSo, as a XHTML author, I did my best to use UTF-8.\n\n* What happens : my UTF-8 characters appear badly in Mozilla 1.4 and Opera 7.11\nbecause the ISO-8859-1 charset is used! Only Konqueror 3.1 displays UTF-8 correctly.\n\n* Why I suspect Apache : the problem only happens if the line \"AddDefaultCharset\nISO-8859-1\" is active in \"commonhttpd.conf\". If I remove this line, then the\nfiles encoded with UTF-8 appear correctly in all three browsers.\n\n* My explanation : by default, Konqueror 3.1 may not use Apache's charset\ninformation, if it finds later the charset information in the XHTML meta tag.\nOpera and Mozilla, on the other hand, trust Apache, and do not check the XHTML\ncode, which leads to pages being displayed as ISO-8859-1.\n\n* What can we do :\n1st solution : comment out the \"AddDefaultCharset\" directive in\n\"commonhttpd.conf\" by default, so that the browsers are forced to use the XHTML\nmeta tag.\n\n2nd solution : replace the AddDefaultCharset value, ISO-8859-1, with UTF-8.\nHowever, this could cause a similar problem with other languages which do not\nuse UTF-8 but another charset... However, on the long term, everything will be\nencoded as UTF-8, and not as ISO8859-1, so it would still be more acceptable\nthan the current setting.\n\n3rd solution : make Apache read the XHTML document so that it sets the MIME type\ncorrectly, depending on the web page and not on the server. The problem is all\nthere : Apache does not check the character set specified inside the XHTML code\nat all, and the browsers trust Apache way too much.\n\n4th solution : leave the thing as is, and tell the browsers companies that their\nsoftware should preferably use the XHTML meta tag than Apache's information,\nwhich can be wrong.\n\nGreg"}, {"count": 3, "tags": [], "creator": "xjogg@trashmail.net", "attachment_id": 8074, "id": 43742, "time": "2003-09-05T12:43:39Z", "bug_id": 14513, "creation_time": "2003-09-05T12:43:39Z", "is_private": false, "text": "Created attachment 8074\nA XHTML document which use UTF-8"}, {"count": 4, "tags": [], "bug_id": 14513, "attachment_id": 8075, "id": 43744, "time": "2003-09-05T12:54:07Z", "creator": "xjogg@trashmail.net", "creation_time": "2003-09-05T12:54:07Z", "is_private": false, "text": "Created attachment 8075\nA XHTML document which use UTF-8 (the previous was not XHTML, sorry!)"}, {"count": 5, "tags": [], "text": "The last line of this attachment should display :\n    \"Tiu pag^o, la mas^inlingvo.\"\nwith the \"^\" sign above the \"g\" and the \"s\".\n\nNOTE : if you click this attachment in Mozilla or Opera, it will appear\ncorrectly. This does not mean that my comment is wrong, it simply means that\n\"nagoya.apache.org\" has been reconfigured. You should copy this attachment to a\nnew Apache server, and access it with Mozilla or Opera, in order to reproduce\nthe problem.\n\nThanks.\n", "attachment_id": null, "id": 43766, "creator": "xjogg@trashmail.net", "time": "2003-09-05T18:55:09Z", "bug_id": 14513, "creation_time": "2003-09-05T18:55:09Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 14513, "text": "I finally found the light :\nhttp://www.w3.org/Protocols/rfc2616/rfc2616-sec3.html#sec3.4.1\nThat's HTTP 1.1 about missing charsets. Quote:\n\n<q>Some HTTP/1.0 software has interpreted a Content-Type header without charset\nparameter incorrectly to mean \"recipient should guess.\" Senders wishing to\ndefeat this behavior MAY include a charset parameter even when the charset is\nISO-8859-1 and SHOULD do so when it is known that it will not confuse the recipient.\n\nUnfortunately, some older HTTP/1.0 clients did not deal properly with an\nexplicit charset parameter. HTTP/1.1 recipients MUST respect the charset label\nprovided by the sender; and those user agents that have a provision to \"guess\" a\ncharset MUST use the charset from the content-type field if they support that\ncharset, rather than the recipient's preference, when initially displaying a\ndocument. See section 3.7.1.</q>\n\nThe second paragraph clearly says that recipients MUST respect the charset label\nprovided by Apache. So Mozilla and Opera do their job. On the other hand, Apache\nshould NOT force a default charset if it cannot be sure that it will not\n\"confuse the recipient\". Here, the default character set is definitely confusing\nfor the recipient. So Apache should not use any charset.\n\nI correct my first comment :\n- Solution #1 cannot be applied because Apache must provide a default charset\nfor some recipients who would not be able to detect the charset by themselves.\n- Solution #2 cannot be applied because ISO-8859-1 is HTTP 1.1 default charset,\nUTF-8 is not (maybe a future HTTP will correct that).\n- Solution #4 cannot be applied because the browsers are fully HTTP 1.1 compliant.\n\nSo, only the third solution can solve this problem: Apache should look at the\nXHTML header and sets the charset accordingly. But I guess it would be too slow\nand people would complain.\n\nWell, I guess I will have to use the \"header\" PHP function:\n  header(\"Content-type: application/xhtml+xml; charset=utf-8\");\nThat's the \"do it yourself\" solution.\n\nGreg\n", "id": 43775, "time": "2003-09-05T22:03:07Z", "creator": "xjogg@trashmail.net", "creation_time": "2003-09-05T22:03:07Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "text": "The right solution is to comment out AddDefaultCharset from httpd.conf,\nbecause sending no charset info is still better than sending the wrong\ninfo. I do not know ANY http client that follows the iso-8859-1 default\nfor HTTP (although some personal configurations of clients may do so).\nAdding application/xhtml+xml into the influence of AddDefaultCharset\nwithout further configurability would be a step in the wrong direction.\nDoing it without removing AddDefaultCharset from httpd.conf as shipped\nwould be a disaster.", "attachment_id": null, "id": 44709, "creator": "duerst@w3.org", "time": "2003-09-25T18:53:02Z", "bug_id": 14513, "creation_time": "2003-09-25T18:53:02Z", "is_private": false}, {"count": 8, "tags": [], "creator": "duerst@w3.org", "attachment_id": null, "is_private": false, "id": 44718, "time": "2003-09-25T20:21:34Z", "bug_id": 14513, "creation_time": "2003-09-25T20:21:34Z", "text": "see also bug 23421\nhttp://nagoya.apache.org/bugzilla/show_bug.cgi?id=23421"}, {"count": 9, "tags": [], "bug_id": 14513, "attachment_id": null, "text": "The original report was to add application/xhtml+xml to the list\nof types to apply AddDefaultCharset.  That request has been considered\nand rejected because AddDefaultCharset is only intented for adding charset\nto legacy content.  The charset for XHTML can be set internally, as\npreferred, or by use of the AddCharset directive and a filename\nextension specific to the actual charset in use.\n\nThe rest of the report is people adding comments about issue 23421\nwhich has been resolved.  AddDefaultCharset will not be in the default\nconfiguration for future releases.\n", "id": 68305, "time": "2004-12-11T07:31:34Z", "creator": "fielding@apache.org", "creation_time": "2004-12-11T07:31:34Z", "is_private": false}]