[{"count": 0, "tags": [], "creator": "max@eos.dk", "attachment_id": null, "is_private": false, "id": 26269, "time": "2002-11-14T13:59:46Z", "bug_id": 14553, "creation_time": "2002-11-14T13:59:46Z", "text": "In our buildenvironment we attempt to keep the CLASSPATH as clean as possible \n(read: it is empty) - so it will not influence other java programs.\n\n\n\n\nThus it would be nice to be able to set an ANTCLASSPATH that would be included \non the LOCALCLASSPATH when running ant.\n\n\n\n\nIt is not an viable option to copy the needed libraries to ant's lib directory \nbecause that would lead to having duplicats of the same .jars in the build \nenvironment - and that is not good.\n\n\n\n\nA simple cahnge to do in ant.cmd\n\n\n\n\nset LOCALCLASSPATH=%CLASSPATH%\n\n\n\n\nshould read\n\n\n\n\nset LOCALCLASSPATH=%ANTCLASSPATH%;%CLASSPATH%"}, {"count": 1, "tags": [], "bug_id": 14553, "is_private": false, "id": 32920, "creation_time": "2003-03-11T07:02:45Z", "time": "2003-03-11T07:02:45Z", "creator": "stevel@apache.org", "text": "The only libraries you need in the ant dirs are the things that the various\noptonal ant tasks need: junit, NetComponents, whatever and the xml parsers. But\nyou can isolate your <javac> and <java> tasks from these details; I never\ninclude the ant lib when I build and run things. \n\nWhat is so wrong with that process? Are you trying to use different versions of\njunit with the <junit> task for different projects?", "attachment_id": null}, {"count": 2, "tags": [], "creator": "max@eos.dk", "attachment_id": null, "is_private": false, "id": 33046, "time": "2003-03-12T15:56:14Z", "bug_id": 14553, "creation_time": "2003-03-12T15:56:14Z", "text": "I need this functionallity to be able to have Ant find optional and homebuild \ntasks. And the libraries needed for this I do not see the need for putting it in \neach and every ant installation on developers machines (e.g. ant/lib).\n\n\nAnd we actually have 3-4 versions of ant installed as different projects are \nusing different Ant's...\n\n\n\n\nFurthermore I do not like that the classpath contains .jars that ONLY ant needs, \nnot my application etc. It should be as clean as possible!\n\n\n\n\nThus if the wrapper script \"listened\" to e.g. ANTCLASSPATH as mentioned in my \nfirst message, then I could clear the CLASSPATH all together and only add ant \nrelated .jars to the ANTCLASSPATH - thus ensuring that my app is not \n\"influenced\" by any .jars needed by ant.\n\n\n\n\n"}, {"count": 3, "tags": [], "bug_id": 14553, "text": "You do not need this functionality for home built tasks; you just include a\nclasspath in the <taskdef> declarations. You may need it for optional tasks, but\nyou really ought to have the versions of things (like junit) that ant was built\nagainst, as differences cause trouble.\n\nYou may want to know that the startup scripts cause an inordinate amount of\nsupport calls, especially related to win9x, cygwin, 4nt, and obscure unix\nvariants, spaces in file and directory names and other little gotchas. For this\nreason we are very leery of changing them when they seem to work, and are mostly\non 'touch only when support calls come in as pre-release testing is impossible'.\nFor this reason, even simple changes are viewed as dangerous. You are of course,\nfree to change your copies. I have been known to have different versions of\nrunant.pl for different projects for related purposes.\n\nIn ant1.6 we are actually looking at replacing the .bat based classloading\nprocess with a boot loader jar, similar to that of tomcat, though performance is\n potentially an issue there. supporting a new env variable in that process may\nwork. \n\nLeaving the report as open till that time.", "id": 33067, "time": "2003-03-12T17:15:18Z", "creator": "stevel@apache.org", "creation_time": "2003-03-12T17:15:18Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "max@eos.dk", "is_private": false, "id": 33101, "attachment_id": null, "bug_id": 14553, "creation_time": "2003-03-13T06:57:34Z", "time": "2003-03-13T06:57:34Z", "text": "With 40++ build.xml files spread across many projects it is VERY worthwile to be \nable to specify an ANTCLASSPATH instead of having to keep the 40++ build.xml's \nuptodate when a new task is developed inhouse. And yes - ofcourse all 40++ \nbuild.xml files does not need to know about all the new tasks, but via the \nANTCLASSPATH the job is a lot easier :)\n\n\n\n\nIf I have 5 custom tasks, each build.xml file has to specify 5 <taskdefs>, that \nis very \"noisy\" when it can be done much simpler IMHO :)\n\n\n\n\n(or can one just do <taskdef resource=\"tasks.properties\" classpath=\"${companyx.\nanttasks.jar}\"/> ...hmm, that will help ...isn't that a rather \"new\" feature ?).\n.\n\n\n\n\nOk - I almost rest my case :) ... by using taskdef resource/file one can reduce \nit to a one-liner, but I still see it as a much cleaner way to specify the tasks \navailable to ant from the \"outside\" instead of locally in each build.xml file\n\n\n\n\n"}, {"count": 5, "tags": [], "bug_id": 14553, "is_private": false, "id": 33125, "creation_time": "2003-03-13T16:25:22Z", "time": "2003-03-13T16:25:22Z", "creator": "ddevienne@lgc.com", "text": "> Ok - I almost rest my case :) ...\n> by using taskdef resource/file one can reduce\n> it to a one-liner, but I still see it as a much\n> cleaner way to specify the tasks available to ant\n> from the \"outside\" instead of locally in each build.xml file\n\nActually, I much prefer this one liner that an ANTCLASSPATH.\nAt least some Ant committers prefer explicit things, and the taskdef\nat the top of all of your build files makes it explicit they are using\ncustom tasks/types. You'll have a hard time introducing a magic feature\nwhen there's a clean and simple explicit way to do the same... --DD", "attachment_id": null}, {"count": 6, "text": "1. Do you know about how to import XML fragments into a build file? Look in the\nant in anger document with your ant install. Ant1.6 provisionally has an\n<import> task to do this more cleanly.\n\n2. if you have 5 custom tasks in one single jar, you only need one <taskdef>\n-just point it at a properties file listing taskname=classname mappings. ", "bug_id": 14553, "attachment_id": null, "id": 33130, "time": "2003-03-13T16:56:02Z", "creator": "stevel@apache.org", "creation_time": "2003-03-13T16:56:02Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "bug_id": 14553, "attachment_id": null, "text": "Max, \n\nAnt 1.6 will add to Ant's classpath everything in \n\n${user.home}/.ant/lib\n\nIt even has a -noclasspath option to ignore the CLASSPATH enviroment variables.\n\nDoes this suit your requirements? If so, please mark this bug as fixed.", "id": 70518, "time": "2005-02-04T21:47:03Z", "creator": "stevel@apache.org", "creation_time": "2005-02-04T21:47:03Z", "is_private": false}, {"count": 8, "tags": [], "creator": "jan@materne.de", "attachment_id": null, "is_private": false, "id": 91101, "time": "2006-07-11T09:52:24Z", "bug_id": 14553, "creation_time": "2006-07-11T09:52:24Z", "text": "I think the -lib option should make Max happy."}]