[{"count": 0, "tags": [], "bug_id": 1463, "text": "I think it'd be useful to generate Makefiles from build.xml ... The reasons\ngiven for the creation of Ant had to do with pitfalls of writing Makefiles.\nPerhaps one generated from build.xml would remove that problem. Pulling up a JVM\nto run Ant is simply too slow at times.", "id": 2050, "time": "2001-04-23T12:36:21Z", "creator": "richip@mozcom.com", "creation_time": "2001-04-23T12:36:21Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "steve_l@iseran.com", "text": "Other reasons for ant are 'to work across platforms', and address modern \ndeployment issues, which makefiles do not do. \n\nTo generate a makefile from a complex buildfile, one including, say, SQL,\nEJB, telnet tasks as well as javac, you would need.\n\n1. command line wrappers for all such tasks with the same parameters and\nbehaviour, on every supported platform: all versions of unix, win32, the\nmacintosh, whatever.\n\n2. some means for every task to generate the appropriate commands to call\nthese tasks\n\n3. some means for every task to list out what its current dependencies are\nby expanding the includes and filesets and whatever.\n\nItem 1 doesnt exist yet; someone would have to write them, test them,\nsupport them. Many ant tasks are more complex than the command line\nequivalents; telnet with its output recognition and the SQL command are\ncases in point. How you would you write a universal cross platform SQL\ncommand line client? It could be done on windows with ODBC, but for unix there\nis no common equivalent, except JDBC.\n\nItem 2 doesnt exist ; someone would have to write them, test them, support\nthem\n\nItem 3 needs to be re-evaluated every run to maintain ant-like behavior of \nincorporating new files automatically. \n\nEven if these were all done, still encounter the JVM startup latencies if\nyou use any java based app -like javac, anyway. \n\nIf there is an issue with startup delays, try using antidote.\n", "id": 2073, "attachment_id": null, "bug_id": 1463, "creation_time": "2001-04-24T15:37:59Z", "time": "2001-04-24T15:37:59Z", "is_private": false}]