[{"count": 0, "tags": [], "bug_id": 14646, "attachment_id": null, "text": "make has a command-line flag \"-n\" which, instead of doing what it thinks it\nneeds to do, just prints out what it would do, but doesn't do it. This is very\nuseful when running newly constructed Makefiles for the first time: instead of\ndeleting files, for example, it only prints out which files it wants to delete,\nthus giving me the opportunity to fix the script first before it deletes all my\nfiles ...\n\nI cannot find something similar for ant, and I would hate losing data ...\n\nFor example, <dependset> may delete the target files, which may be specified as\na wildcard. Short of executing the command, how do I check that it will actually\ndelete the right files? An \"ant -n\" would be highly useful. It should print out\nsomething like\n  <dependset>Delete /this/file1\n  <dependset>Delete /that/other/file2\n\nThis needs to be done across ant, for all tasks, not just dependset.", "id": 26505, "time": "2002-11-18T19:25:49Z", "creator": "jernst@acm.org", "creation_time": "2002-11-18T19:25:49Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 14646, "text": "One of the differences of make is that all dependencies are handled by the tool\nitself, not the programs it calls, and the dependencies are so simple (And\nexplicit). Ant hands off dependency checking to the individual tasks, and\nalthough timestamps are the core metric, sometimes file contents and signatures\nare checked,. It would be a lot harder to do a -n option.\n\nNot necessarily impossible, merely requiring a complete redesign and\nreimplementation of a lot, including most tasks, that would need to incorporate\nthe -n action into their code and declare what output files they'd end up\ncreating (if they knew). \n\nLeaving open as an enhancement...", "id": 26508, "time": "2002-11-18T20:14:26Z", "creator": "stevel@apache.org", "creation_time": "2002-11-18T20:14:26Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "peter.reilly@corvil.com", "text": "Since this calls for a complete redesign of ant, and all\nthird party tasks, which will not happen, I am changing this to WONTFIX.\n\nThe -n makes sense when the dependences are explicit in the makefile\n(or in msbuild), but not in ant where tasks can do what they like\nwhen the \"execute\" method is used.", "id": 50458, "time": "2004-01-13T11:52:41Z", "bug_id": 14646, "creation_time": "2004-01-13T11:52:41Z", "is_private": false, "attachment_id": null}]