[{"count": 0, "tags": [], "creator": "erik@bruchez.org", "attachment_id": null, "text": "getWriter() seems to be implemented as a PrintWriter. This means that all the\nexceptions are eaten. This is due to the fact that PrintWriter does not forward\nIOExceptions, but sets an internal variable called \"trouble\" to true. This\nvariable is supposed to be cheked with checkError() regularly, but here is is not.\n\nThis is bad in particular when writing a large document and the user closes his\nbrowser connection. The servlet will keep writing unaware of the error, and\npotentially thousands of exceptions will be caught silently. This can completely\nkill a server if many connections are interrupted, because exception handling is\npretty slow.\n\nI tried working around this by casting the Writer to a PrintWriter and calling\ncheckError() manually, but the PrintWriter is recycled which means that once an\nerror occurs, all subsequent requests fail.\n\nTo solve this, Tomcat should call checkError() and throw an exception or make it\nso that the subsequent calls on the writer do not cause so many exceptions to be\nthrown and eaten after the first exception is caught. I am fine if those\nexceptions are eaten, but the performance hit is unacceptable (some of my\nrequests that usually complete in a few seconds take over 30 seconds to complete\nin this exception-eating mode).", "id": 26519, "time": "2002-11-18T23:17:04Z", "bug_id": 14658, "creation_time": "2002-11-18T23:17:04Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 14658, "text": "Correction: I didn't actually need to cast it to a PrintWriter since getWriter()\nalready returns a PrintWriter. The issue of checkError() and bad performance\nremain though.", "id": 26522, "time": "2002-11-18T23:41:00Z", "creator": "erik@bruchez.org", "creation_time": "2002-11-18T23:41:00Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 14658, "attachment_id": null, "id": 26523, "time": "2002-11-19T00:03:02Z", "creator": "erik@bruchez.org", "creation_time": "2002-11-19T00:03:02Z", "is_private": false, "text": "The legacy connector, org.apache.catalina.connector.http.HttpConnector, does not\nexhibit this behavior. If I interrupt a stream from my browser, I see no\ndegratation in performance."}, {"count": 3, "tags": [], "bug_id": 14658, "is_private": false, "id": 26575, "attachment_id": null, "creator": "remm@apache.org", "creation_time": "2002-11-19T15:10:06Z", "time": "2002-11-19T15:10:06Z", "text": "This looks like a legitimate report. I will try to fix it."}, {"count": 4, "tags": [], "text": "This has been fixed in CVS (CoyoteWriter now fully reimplements PrintWriter;\nplease test it if you can) and will be available in 4.1.16 and 5.0.1.", "is_private": false, "id": 26651, "creator": "remm@apache.org", "time": "2002-11-20T13:59:57Z", "bug_id": 14658, "creation_time": "2002-11-20T13:59:57Z", "attachment_id": null}]