[{"count": 0, "tags": [], "bug_id": 14695, "attachment_id": null, "id": 26613, "time": "2002-11-19T21:48:58Z", "creator": "fredrik.westermarck@mdh.se", "creation_time": "2002-11-19T21:48:58Z", "is_private": false, "text": "If tagpooling in Tomcat 4.1.x is enabled (which it is by default) fmt:setBundle\nand the following fmt:message tags always return the same messages.\n\nThe fist time the JSP-page is accessed the correct ResourceBundle is used. But\nafter changing the browser settings to a different (and also supported\nLocale/Accept-Language) the same ResourceBundle that was requested with the\nfirst access is used. I've tried setting the scope for the setBundle-tag to both\npage and request with the same result.\n\nIf the tagpooling in Tomcat 4.1.x is disabled the tags work as expected. There\nis probably some problems with the cleanup in the tag.\n\nI haven't had the time to examine this more closely, but I can provide a\ntestcase that confirms the problem if you wish."}, {"count": 1, "tags": [], "bug_id": 14695, "text": "This has been fixed in release 1.0.2.\n\n*** This bug has been marked as a duplicate of 11204 ***", "id": 27360, "time": "2002-12-03T21:14:17Z", "creator": "pierre.delisle@sun.com", "creation_time": "2002-12-03T21:14:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 14695, "attachment_id": null, "id": 27545, "time": "2002-12-09T12:39:50Z", "creator": "fredrik.westermarck@mdh.se", "creation_time": "2002-12-09T12:39:50Z", "is_private": false, "text": "Actually if the tagpooling feature is enabled the problem still exists when\nusing standard taglib 1.0.2 and Tomcat 4.1.15.\n\nThe bundle that get used is always the same as the one that was used for the\nfirst request - no matter what language the browser accepts or in what order."}, {"count": 3, "tags": [], "text": "Fredrik was right; there still was a bug when the <fmt:message> tag was pooled \nand reused and a bundle was not specified explicitely.\n\nIt has now been fixed (in both EL and RT) by resetting the localizationContext \nto null when bundle is not specified explicitely as an attribute.\n", "attachment_id": null, "id": 27909, "creator": "pierre.delisle@sun.com", "time": "2002-12-16T22:40:02Z", "bug_id": 14695, "creation_time": "2002-12-16T22:40:02Z", "is_private": false}]