[{"count": 0, "tags": [], "text": "In the documentation pages for tasks (the Built-In Tasks and Optional \nTasks) sections, in the tables describing attributes, it would probably \nhelp if the tables had a column that indicated the data type or possible \nvalues for each attribute.\n\nHaving an explicit column would help documentation authors remember to \ndocument the data types or possible values of attributes.  \n\nHaving clearer and more complete documentation would reduce the need to \nguess and experiment to figure out what's required, letting users proceed\nmore directly to using Ant to get the job done.\n\n(Note that one reason explicit documentation is important is that those \ndata types and values are not as obvious to all users as an experienced \nuser/developer/documenter might think.  \n\nFor example, note that some boolean attributes take \"yes\" and \"no\", some \ntake \"true\" and \"false\", some take \"on\" and \"off\".  \n\nNow consider an attribute whose description implies that it's a boolean \nattribute, but specifies nothing else.  For example, see JavaDoc's nohelp \nattribute, whose description says only:\n\n  Do not generate help link\n\nHow can the user know which value (\"yes\"? \"true\"?) is needed to activate \nthe feature?  (Or might just the presence of the attribute suppress the\nhelp link?)\n\nSome other specific examples:\n- Chmod.perm:  Is the form \"go+rw\" supported?\n- Jar.whenempty:  The Parameters table says only \"Behavior to use if no files\n  match.\"  (The table doesn't list the possible values.)\n\n)\n\n\nHaving this data-type information consistently would improve the quality of\nthe documentation and make Ant easier to use.  \n\nHaving a specific column for the data-type information would remind authors\nto provide the information.\n\n\nAlso, providing a listing of common type descriptions in a table up front \nmight make it easier for authors by providing pre-written text for them to \nuse in their tasks' tables.\n\nHere's a partial listing:\n- \"true\"/\"false\" boolean\n- \"yes\"/\"no\" boolean\n- \"on\"/\"off\" boolean\n- (relative or absolute) file or directory pathname\n- (relative or absolute) file pathname\n- (relative or absolute) directory pathname\n- property name\n- (qualified) class name (not class _file_ name as written in many places)\n- (qualified) general resource name\n- comma-separated list of file names\n- file name pattern\n- comma-separated list of file name patterns\n- path element (Jar file name / class/resource root directory name)\n- search path (colon-/semi-colon separated list of path elements)\n- path ID\n- pattern ID\n- target name\n- integer for milliseconds\n- enumeration of values that are specific to the task and the attribute\n  (e.g., Apply's \"type' attribute, with \"file\", \"dir\", \"both\"; FixCRLF's\n  \"cr\" attribute with \"add\", \"asis\", \"remove\")\n- other general string value that is specific to the task and the attribute\n  (e.g., Cvs's \"command\" attribute, Echo's \"message\" atribute)\n\n\n\nAnother idea would be to have a template or recommended convenitions for \ndocumenting Ant tasks.  If authors followed it, that would enhance \nconsistency and make things clear.  \n\n(Inconsistencies such as sometimes used fixed-width font for values but \nother times using italics makes it a little harder for readers to \nrecognize what the documentation is trying to convey.   Sometimes having\nattribute documentation prose above the table but sometimes below makes \nit a little harder to find information.)", "is_private": false, "id": 2062, "creator": "Daniel.Barclay@digitalfocus.com", "time": "2001-04-24T08:08:23Z", "bug_id": 1477, "creation_time": "2001-04-24T08:08:23Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "This is definitively a good idea for Ant2 when we are going to brush up or\ndocumentation system - going over all files now to just change them again in \nfew weeks/months seems a little bit to much effort.", "is_private": false, "id": 2929, "creator": "bodewig@apache.org", "time": "2001-06-13T08:03:07Z", "bug_id": 1477, "creation_time": "2001-06-13T08:03:07Z", "attachment_id": null}]