[{"count": 0, "tags": [], "bug_id": 14834, "text": "Here's my current beef with the custom selector.\n\n1) Custom selector can only take <param> nested elements, instead of complex \ndata types!\n   All extensions points in Ant need to support the normal set/add/create Bean \npattern used by tasks and types. No just selectors, but filters, selectors, \nconditions, and xml catalog resolvers...\n\n2) Custom selector doesn't call setProject() on the loaded class when it's a \nProjectComponent.\n   To turn around (1), I defined a pathref <param> taking the id as value. \nUnfortunately, one needs access to the Project to be able to resolve the id!!!\nThis is achieved using the code below.\n\npublic class ExtendSelector extends BaseSelector {\n...\n    public void verifySettings() {\n    ...\n        if (dynselector instanceof ProjectComponent) {\n            ((ProjectComponent)dynselector).setProject(getProject());\n        }\n    }\n}\n\n3) Even if (2) was solved, I would still be not happy because then I would fall \ninto a classloader problem. The id I reference is a custom type extending Path \nloaded using a special loaderef, and Custom selector doesn't allow using a \ncustom loaderef, thus I would end up with a ClassCastException because although \nusing the same classpath, and same classname, the instance loaded under an id \nin Project would be laoded from another classloader than the instance reference \nI would be casting it into!!!\n\nI'm down to being forced to passing my datatype as a string into the param, and \nhaving to reparse it in my custom selector to make it work...\n\nReally, I mean really, all Ant extension points should be handled exactly the \nsame, with proper bean access, classloading, and initialization.\n\nEven if I'm gripping about selectors here because it's what I'm using, this is \nvalid in general for Ant, and is critical in my mind for Ant's health.\n\nCould please the expert debate this please? Thanks, --DD", "id": 26964, "time": "2002-11-25T20:38:12Z", "creator": "ddevienne@lgc.com", "creation_time": "2002-11-25T20:38:12Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "umagesh@apache.org", "is_private": false, "id": 26978, "time": "2002-11-26T04:26:06Z", "bug_id": 14834, "creation_time": "2002-11-26T04:26:06Z", "tags": [], "text": "> Could please the expert debate this please?\n\nPoint taken - I am experimenting on a solution - may not be fancy, but will get\nthis issue behind us.  Will try to propose a patch soon.\n\n"}, {"count": 2, "attachment_id": null, "creator": "peter.reilly@corvil.com", "is_private": false, "id": 38896, "time": "2003-06-16T08:02:45Z", "bug_id": 14834, "creation_time": "2003-06-16T08:02:45Z", "tags": [], "text": "The points raised by this bug report have\nbeen fixed.\n\n1)\nThere is a new way to add custom selectors.\nUse <typedef name=\"mycustomselector\"\n     classname=\"x.y.customselector\"/>\n\nIf x.y.customselector implements FileSelector, it\ncan be used as a normal selector xml element\nsupporting set/add/create Bean pattern.\n(This needs to be documented).\n\n2) setProject is now called on (hopefully) all ant created\nobjects.\n"}, {"count": 3, "tags": [], "bug_id": 14834, "text": "*** Bug 21511 has been marked as a duplicate of this bug. ***", "id": 40467, "time": "2003-07-11T13:57:25Z", "creator": "peter.reilly@corvil.com", "creation_time": "2003-07-11T13:57:25Z", "is_private": false, "attachment_id": null}]