[{"count": 0, "tags": [], "text": "Hi,\n\nI am trying to deploy an application via Java Web Start. It is necessary that \nall uses JAR-Files are signed so that the application can use all ressource of \nthe computer. When I am signing the JAR-Files via the integrated signjar-task \nthe ClassLoader of WebStart doesn't recognize the signment. Because of this the \napplication cannot be startet.\n\nWhen I sign the JAR-files via the jarsigner tool from Sun everything works \nfine. I am using JDK1.4.1_01", "is_private": false, "id": 27158, "creator": "tinoscho@gmx.de", "time": "2002-11-29T09:23:55Z", "bug_id": 14950, "creation_time": "2002-11-29T09:23:55Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 14950, "text": "It might be interesting (and helpful) to know if there was a difference between\nthe two forms of signing when you did a jarsigner -verify -verbose <jarfilename>\non a file that was signed with ant and on the same file signed with jarsigner. I\nam not an expert in jar signing, and probably can't do the fixing for this, but\nI am fiddling around with webstart and was thinking about using the ant task to\nsign things. Does the ant task appear to sign the jar at all? \n\nIf webstart is completely refusing to start it I think that means it thinks the\njar never got signed at all, or the file appears to be modified since signing.\n\nIt would be worth checking that you don't do anything to update the jar\nafter it is signed. \n\nI notice the documentiation for jar doesn't specify whether update or \noverwrite is the default behavior for jar task. A doc patch for this\nwould probably be good in any case.", "id": 27417, "time": "2002-12-04T17:29:59Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-04T17:29:59Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 14950, "text": "If you run Ant with the -verbose switch, it will log the commandline it uses\nto run jarsigner internally.  In what way is it different from your manual\ninvocation?", "count": 2, "id": 67332, "time": "2004-11-22T12:56:00Z", "creator": "bodewig@apache.org", "creation_time": "2004-11-22T12:56:00Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 14950, "text": "please reopen if you have more details.", "count": 3, "id": 72216, "time": "2005-03-11T17:15:28Z", "creator": "bodewig@apache.org", "creation_time": "2005-03-11T17:15:28Z", "is_private": false}]