[{"count": 0, "tags": [], "creator": "webmaster33@bigfoot.com", "is_private": false, "id": 27172, "creation_time": "2002-11-29T18:34:09Z", "time": "2002-11-29T18:34:09Z", "bug_id": 14966, "text": "I was just reading the Netcraft Web Server Survey (November 2002), where I read:\nApache has 60.80%, MS has 28.69% of the market.\nhttp://www.netcraft.com/survey/\n\nWhat can be the reason, the MS gains so big piece of the market? I know Apache\nis gaining back some, but how long can it do this? \nWill the Apache-MS war finish like IE-Netscape? Hopefully not, but Apache\ndevelopers should do something new, to avoid this. Apache Monitor can be the\nfundament of this goal.\nMS always attracted a lot users to their products, because they provided good,\neasy-to-use user interface, even for beginner users. This also means Short\nLearning Curve, and THIS is the main reason, why MS gained so much percent of\nthe market in all of their products (including Windows, Office, IE, and IIS). \n(BTW: security or stability was never too important for MS under the development\nprocess, comparing to GUI or Ease-of-use...)\nAnd the competitors like Linux, Openoffice, Mozilla, IIS, had to PROVE VERY MUCH\nto show they are really good, stable, safe products, better & safer than MS\nproducts.\n\nIf IIS would not have so much security bugs, IIS would already own even 40-50%\nof the market.\n\nI know how much of Linux users/developers hate the GUI interfaces, but there is\na NEED for it, to be able to compete with MS products.\n\nSo I suggest a good, very well thought-out GUI, which can be easily used by\nbeginners, too. Should be available on Unix, but especially on Windows.\nI know about Commanche, but the 3.x version is still weak, almost unusable by a\nbeginner, or even by an intermediate webmaster. Unfortunately currently editing\nof httpd.conf with a text editor is easier, than to use Commanche... :(\n\nCommanche would be need a real good successor, which is developed by more\ndevelopers, to create a quickly growing project. Regular releases are important.\n\nBefore attacking my opinion, read again the text from beginning and try to\nunderstand my view-point. It is not possible to defend against MS with other\ntool, what was their success strategy. Think about it...\n\nIf my words will reach main Apache developers, I hope they will feel my opinion\nwell reasoned, and will organize a developer team for the GUI task.\n\nKeep up the good job!\n\nBest regards,\nWebmaster33", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 14966, "is_private": false, "id": 27184, "creation_time": "2002-11-30T04:12:45Z", "time": "2002-11-30T04:12:45Z", "creator": "wrowe@apache.org", "text": "\n  Feel free to submit one.  Or rather, submit the baseline and request\n  to begin such a project.  Reviewing gui.apache.org (quite out of date)\n  would be a good start.  If you are contributing, and the project needs\n  updating, dev@httpd.apache.org would be an appropriate place to discuss.\n\n  I'm afraid this is entirely outside of what naygoya.apache.org/bugzilla\n  is meant to track.  This database is only for tracking bugs, that is,\n  operational errors in the software itself.\n\n  Closing.\n  ", "attachment_id": null}, {"count": 2, "tags": [], "creator": "webmaster33@bigfoot.com", "attachment_id": null, "is_private": false, "id": 27187, "time": "2002-11-30T09:21:25Z", "bug_id": 14966, "creation_time": "2002-11-30T09:21:25Z", "text": "As long Apache 2.0 Windows version has a GUI interface to start/stop Apache\nservice, and it really belongs to Apache 2.0 project, then it is reasoned to\nsuggest GUI enhancements here on Bugzilla.\n\nI'm not C programmer, so I can not contribute in the project, just an Apache\nuser. As you say, gui.apache.org is quite out of date. The Apache developers\nshould at least coordinate the Apache GUI projects, but would be better to\nimplement the GUI configuration editor into the Apache Monitor itself!\nCommanche 3.x GUI was not really successful (at least for me). The DST Apache\nConfiguration Editor (DSTACE) v1.1 is closer to the desired user friendly GUI. (\nhttp://www.darkphoton.com/darkstar/DSTACE/index.html )\n\nI will contact dev@httpd.apache.org list, but the GUI efforts should be\ncoordinated here and since naygoya.apache.org/bugzilla HAS the Enhancement\noption, this suggestion/enhancement report has a good reason to be posted here\nin Bugzilla.\n\nI do not feel that gui.apache.org is a real project, but rather a link\ncollection, which lists the efforts what was ever done for an Apache GUI goal,\nand additionally it is really outdated. Also it is a good idea to refresh the\ngui.apache.org. My opinion is that GUI efforts really belongs to Bugzilla & core\nApache 2.0 developments. \n\nRemember, MS loses market share because it has security holes. But sometime they\nwill correct them... Once they corrected security holes, they will be able to\nincrease their market share again. And if Apache GUI effors will be not\nrefreshed, MS would have chance to also win the webserver war, too :-( \n\nThis is not what we want.  Will Rowe, you should really think about what I wrote.\nPlease consider Reopening this enhancement bug, and make it as starting point to\ncoordinate GUI efforts. Or start a new Component named \"GUI\" or \"User Interface\"\nfor Apache httpd-2.0, and move this enhancement bug there.\n\nWebmaster33"}, {"count": 3, "tags": [], "bug_id": 14966, "is_private": false, "id": 27206, "creation_time": "2002-12-01T03:31:29Z", "time": "2002-12-01T03:31:29Z", "creator": "slive@apache.org", "text": "A few notes:\n\n1. Most Apache developers don't care about beating IIS.  They care about making\nthe best possible open-source webserver.\n\n2. This bug won't be reopened because it is out-of-scope, and because it will do\nno good here.  This is not a good place to coordinate large new \ndevelopment efforts.\n\n3. As Will suggested, the best way to get this done is to contribute.  You don't\nneed to be a programmer to contribute.  One thing you could consider is helping\nto get gui.apache.org back in shape.  If the current managers aren't receptive,\nit may even be possible to reclaim the website for another try.  That could\nbe discussed on dev@httpd.apache.org.\n\nSuggestions and contributions are always appreciated, but the bug database\nis not the best place to actually get things done.", "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 14966, "text": "Don't forget that IIS-users and Apache-users are two different kind of people. \n\nAlso, IIS is so easy to setup and use, it is inherently unsafe. All the \nproblems that IIS causes does not only lie with the software itself but also \nwith the people who do not (properly) setup, configure and update it.\nThis is someting you currently are starting to see with Apache, since Linux-\ndistributions are becomming more easely accessible for people and many include \nApache.", "id": 27220, "time": "2002-12-01T23:00:11Z", "creator": "info@orangexl.com", "creation_time": "2002-12-01T23:00:11Z", "tags": [], "is_private": false}]