[{"count": 0, "tags": [], "bug_id": 15025, "attachment_id": null, "id": 27331, "time": "2002-12-03T15:56:54Z", "creator": "jstrachman@athenium.com", "creation_time": "2002-12-03T15:56:54Z", "is_private": false, "text": "I am trying to use the URL Rewriter.  It works just fine, except that for\nwhatever reason not all the pages in my app have the session ID in the HTML. \nOnce it hits one of these pages, it \"loses\" the Session ID, and then sets it to\nblank for the next request.  (This is because I am using the URL Rewriter\nattached to the Threadgroup.)  \n\nOne option would be to add it manually prior to each request that needs it. \nHowever, this is extremely cumbersome, especially if you have made a large\nscript that contains many requests.  Also, this might not work in some cases.\n\nI'd like to be able to submit a request, get the SessionID from the resulting\nHTML, then store it in a variable and use that variable's value for the\nSessionID wherever it occurs for the rest of the requests in the Threadgroup. \nIn fact, I'm wondering whether the URL Rewriter should have worked this way in\nthe first place?"}, {"count": 1, "tags": [], "text": "FYI, I found a way around this for my app, so unless anyone else needs this \nfunctionality, you might just want to mark it as WONTFIX.", "is_private": false, "id": 27366, "creator": "jstrachman@athenium.com", "time": "2002-12-03T22:55:25Z", "bug_id": 15025, "creation_time": "2002-12-03T22:55:25Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 15025, "text": "I am trying to use JMeter for load test of a web application deployed in \nBroadVision. BroadVision tracks session id in the URL. I am trying to use \"HTTP \nURL Re-writing Modifier\" in JMeter. But, it does not work. It is not retaining \nthe session ids for all the HTTP requests. I saw your mail in the jmeter bug \nlist mentioning that you have found a work around for this. Can you please \nwrite me the work around for this. Your help is greatly appreciated.\n ", "count": 2, "id": 57378, "time": "2004-05-13T19:40:05Z", "creator": "sonybals2002@yahoo.com", "creation_time": "2004-05-13T19:40:05Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jstrachman@athenium.com", "attachment_id": null, "id": 57379, "time": "2004-05-13T19:59:24Z", "bug_id": 15025, "creation_time": "2004-05-13T19:59:24Z", "is_private": false, "text": "The problem is that the sessionID must be in the HTML for all of your HTML\npages.  If there is one page or frame in your application that does not have it,\nfor instance a decorative frame, then it will \"lose\" the sessionID.  So, in\norder to make this work, you will need to remove any frames from your test that\ndon't contain the sessionID."}, {"count": 4, "tags": [], "bug_id": 15025, "text": "It would be helpful to have the option of retaining the session id until it is \nset to a new value.  This would be helpful in testing the entire app as it is \ncurrently working rather than having to remove test elements that invalidate \nthe session id.", "id": 60069, "time": "2004-06-30T19:14:54Z", "creator": "udele.malabanan@na.whiteclarkegroup.com", "creation_time": "2004-06-30T19:14:54Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 15025, "text": "This is a real pain to resolve.  I have pages that mix Post and Get requests \nand appears that my Session ID is being losted when I do a Post request.  The \ncomment about making a variable that can be used as a parameter is the best way \nthis should work.  ", "id": 63678, "time": "2004-09-16T20:29:22Z", "creator": "tdaggett@ebmail.gdeb.com", "creation_time": "2004-09-16T20:29:22Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 15025, "text": "This has now been added as an option (selected by default) in the 2.1 branch.\nFinally!", "id": 88533, "time": "2006-04-27T00:10:35Z", "creator": "sebb@apache.org", "creation_time": "2006-04-27T00:10:35Z", "is_private": false, "attachment_id": null}]