[{"count": 0, "tags": [], "bug_id": 15169, "attachment_id": null, "id": 27535, "time": "2002-12-09T04:57:30Z", "creator": "tony@absolutejava.com", "creation_time": "2002-12-09T04:57:30Z", "is_private": false, "text": "I'm not sure of the correct \"component\" so I just guessed -- (Standard \nTaglib) . :)\n\nThis may be a minor point but I wanted to mention it. \n\nI downloaded v1.0.2 of the standard taglibs (JSTL).\n\nSince Tomcat v4.1.12 is a JSP v1.2-complient container, I decided to remove\nall the \"<taglib>\" elements from the \"web.xml\" file in the \"standard-examples\"\nwebapp that's distributed with Apache's JSTL. \n\nAfter removing the \"<taglibs>\" form \"web.xml\", everything still worked great\nwhen I ran the \"standard-examples\" app -- except for a minor thing: I could no\nlonger display the source code of the JSP by clicking on the \"screwdriver\"\nicon. I'm referring here to the \"screwdriver\" icon that is intended to display\nthe JSP source code containing the JSTL code. \n\nIt turns out that the \"jstl-examples.tld\" does not have a \"<uri>\" element in\nits \"<tablib>\". As a result, there is no way for Tomcat to map the\n\"/jstl-examples-taglib\" URI in \"ShowSource.jsp\" to a TLD. \n\nAnyway, I thought maybe this should be fixed or at least people should know\nabout it. \n\nThanks"}, {"count": 1, "tags": [], "bug_id": 15169, "attachment_id": null, "id": 27850, "time": "2002-12-15T16:04:17Z", "creator": "pierre.delisle@sun.com", "creation_time": "2002-12-15T16:04:17Z", "is_private": false, "text": "Added <uri> definition in WEB-INF/jstl-examples.tld for\n/jstl-examples-taglib.\n\nHowever, please note that that the problem reported will still persist\nwith tomcat 4.x because of bug 14200. Hans Bergsten is working with\nthe JSP expert group to resolve this issue.\n\nUnfortunately, TLD mapping is often source of great confusion.\n\nFor JSP 1.2, the simplest model is the following:\nWhen creating a taglib:\n  - define the <uri> element in the TLD\n  - jar the taglib with the TLD in it\n\nThen all a client webapp has to do is\n  - drop the taglib jar file into WEB-INF/lib of the webapp\n  - use the uri defined for the taglib in the <taglib> directive\n\nWith that model, no modification of the webapp's deployment\ndescriptor (web.xml) is required.\n\nI've therefore modified web.xml to remove all the mappings\nfor the JSTL TLDs since they are not necessary, and simply adds\nto the confusion. The mapping for jstl-examples has been\nleft in there for now because of bug 14200.\n\n[One could argue that the taglib defined in the examples\nwebapp should also be built as a jar file. This should\ndefinitely be the case if that taglib was to be reused \noutside of the examples web-app. But since this is not the case, \nwe'll leave it as is (otherwise we'd have to create another\ndirectory in standard, examples-taglib, that would specifically\nhost the code for the examples taglib...)]"}]