[{"count": 0, "tags": [], "text": "If followsymlinks is true, symbolic links are followed and the referenced \nmaterial will be stored in the tar file.\n\nApparently if followsymlinks is false, symbolic links are not followed and \nNOTHING will be stored for them in the tar file.\n\nI would prefer that in this case symbolic links should be stored as relative or \nabsolute pointers in the tar file. In my opinion this is the standard behaviour \nof GNU tar.", "is_private": false, "bug_id": 15244, "id": 27618, "time": "2002-12-10T17:27:42Z", "creator": "schu@telenet-ag.de", "creation_time": "2002-12-10T17:27:42Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Though not strictly a duplicate, this bug is almost exactly the same issue as \nbut 14320 \n\nReading bug 1550 will also shed light on why this is quite a difficult problem\nto address. \n\nThe symlink task provides a means by which to record links in an abosolute form,\nbut this probably won't meet your needs unless you are untaring the tarballs\nwith ant and can use the symlink task to recreate the links.\n\nRelative links are unfortunately impossible to percieve due to the limmitations\nof Java. I did find a fairly cool way to get relative links on linux though by\nrecording and unpacking the links in a temp file that always resides in the\nexact same location in the filesystem. When you do this, you can exec \"symlinks\n-rcs\" in the top level directory twice before recording and twice after\nexpansion to get identical relative links (mixed relative and aboslute would\nrequire creative use of apply and symlinks).\n\nIf I find some time I hope to add this tip/trick in more explicit/clearer form\nto the docs for symlinks. Unfortunately, it is horribly platform/os specific\nthough :(. I don't think all unicies have a symlinks command.", "is_private": false, "bug_id": 15244, "id": 27629, "time": "2002-12-10T21:02:22Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-10T21:02:22Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "oops I typoed! I meant to refer you to bug 14320 \n\n*blush*", "is_private": false, "bug_id": 15244, "id": 27630, "time": "2002-12-10T21:03:23Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-10T21:03:23Z", "attachment_id": null}]