[{"count": 0, "tags": [], "bug_id": 15291, "attachment_id": null, "id": 27693, "time": "2002-12-11T22:39:17Z", "creator": "istvan@site.uottawa.ca", "creation_time": "2002-12-11T22:39:17Z", "is_private": false, "text": "While you admit you did not test running Tomcat with a security manager,\nit does not work. In other words, it is not possible to prevent someone\nto call System.exit and expect it to be blocked. We are running a server\nat the University for graduate students. Well, it would be all great if\nthey could not sabotage each other's work. Is there a version of Tomcat\nwhere one can specify -secure at the command line and expect this to work\ntoo?"}, {"count": 1, "tags": [], "bug_id": 15291, "attachment_id": null, "id": 27695, "time": "2002-12-11T22:43:22Z", "creator": "jfarcand@apache.org", "creation_time": "2002-12-11T22:43:22Z", "is_private": false, "text": "Hi,\n\nI don't what you are doing, but the security manager works perfectly as it\nshould. Please verify your scripts. Doing System.exit(0) certainly doesn't works\nwhen Tomcat is started using catalina run -security.\n\n-- Jeanfrancois\n\n"}, {"count": 2, "tags": [], "creator": "ian_d_stewart@bankone.com", "is_private": false, "text": "(untested): the -D parameter that sets catalina.profile in catalina.sh uses the\ncomparison operator (==) instead of the assignment operator.  In theory, this\nshould present the Catalina profile from being used.  \n\nI'm not familiar enough with either Security Management or java's command-line\nprocessing routines to say exactly what is going on, but I would think that\nfixing this would resolve the issues that the original submitter was reporting", "id": 36839, "time": "2003-05-07T15:48:21Z", "bug_id": 15291, "creation_time": "2003-05-07T15:48:21Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "funkman@joedog.org", "attachment_id": null, "text": "Resolving as works for me based on \"Jean-Francois Arcand\" comments and lack of\nfollowup to present a test case.\n\nThe == is intentional. (I forget why but it was discussed in a tomcat-dev thread)\n", "id": 43414, "time": "2003-08-28T01:09:09Z", "bug_id": 15291, "creation_time": "2003-08-28T01:09:09Z", "is_private": false}]