[{"count": 0, "tags": [], "bug_id": 15394, "text": "I recently started using ant 1.5.1, and it seems like ant is causing my windows \nexplorer to crash. Several other services crashes or stops working at the same \ntime and a reboot is required to continue work.\n\nI see no fixed pattern as to when explorer crashes, but it typically does 5 - \n10 times per day.\n\nAt first I thought that it couldn't be ant that caused this behaviour, but some \nobservations make me quite sure that it is related to ant.\n\n1) I've never seen this behaviour before I installed ant\n2) After a reboot, it never happens before I start compiling programs\n3) It also happens on my home computer (Also Win2k)\n\nIt often happens when I use window explorer (expand a catalog, move the window, \netc), but sometimes it happens without me touching explorer.\n\nMy system properties tells me that I have Windows 2000 5.00.2195\nMy ant -v tells me that my ant is built on Oct 2, 2002\nIf it has any relevance my java version is j2sdk1.4.1_01", "id": 27874, "time": "2002-12-16T13:29:24Z", "creator": "kp@seacrown.net", "creation_time": "2002-12-16T13:29:24Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 15394, "text": "This is really surprising, because we've never encountered this before, it is so\nunlikely, yet you say you can replicate it across machines. Can you post your\nbuild file, so we can see if there is something special about it. Also, are you\nusing clearcase?", "id": 27889, "time": "2002-12-16T18:37:34Z", "creator": "stevel@apache.org", "creation_time": "2002-12-16T18:37:34Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "kp@seacrown.net", "attachment_id": 4184, "text": "Created attachment 4184\nOne of three build files related to problem", "id": 27892, "time": "2002-12-16T19:30:43Z", "bug_id": 15394, "creation_time": "2002-12-16T19:30:43Z", "is_private": false}, {"count": 3, "tags": [], "text": "Created attachment 4185\none of three build files related to problem", "attachment_id": 4185, "id": 27893, "creator": "kp@seacrown.net", "time": "2002-12-16T19:32:52Z", "bug_id": 15394, "creation_time": "2002-12-16T19:32:52Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 15394, "is_private": false, "id": 27894, "attachment_id": 4186, "creator": "kp@seacrown.net", "creation_time": "2002-12-16T19:33:20Z", "time": "2002-12-16T19:33:20Z", "text": "Created attachment 4186\none of three build files related to problem"}, {"count": 5, "tags": [], "bug_id": 15394, "text": "I understand that you think this is unlikely, I thought so too at first. But\nthis only happens when I'm working with ant. I've been using three different\nbuild files, I haven't noticed if any particular is causing problems. Anyway, I\nhave attached all three, they are quite similar and small.", "id": 27895, "time": "2002-12-16T19:33:46Z", "creator": "kp@seacrown.net", "creation_time": "2002-12-16T19:33:46Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 15394, "text": "There is nothing in here that is particularly unique or unusual, so no obvious\ncause springs out. One possibility is simply the clean target; that used to lock\nup my clearcase filing system, and even bulk dir deletion can confuse explorer\nas things it thought existed disappeared. But we'd have heard by now if that was\ncommon; we do hear often of times when <delete> fails because explorer is\nholding on to a dir and wont let it be deleted. \n\nBecause there are no obvious problems, I see no obvious solutions. One cause may\njust be memory consumption...track in taskman what the memory consumption is,\nand maybe the shell keels over when there isnt enough. If you were getting\nbluescreens in a build I'd certainly suggest a bad DRAM block, but the explorer\non its own is less clear cut. \n\nMaybe you could try using jikes as your compiler, instead of the sun one. At the\nvery least, it will be faster, but it also has a different memory pattern.\n\n-steve", "id": 27901, "time": "2002-12-16T20:55:11Z", "creator": "stevel@apache.org", "creation_time": "2002-12-16T20:55:11Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "kp@seacrown.net", "attachment_id": null, "text": "What you say about <delete> is interesting. I could clearly see that explorer \nhad trouble updating the tree view from time to time. I will remove all the \n<delete> stuff and see what happens. Thanks for your help so far.", "id": 27907, "time": "2002-12-16T22:08:17Z", "bug_id": 15394, "creation_time": "2002-12-16T22:08:17Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 15394, "is_private": false, "id": 32922, "attachment_id": null, "creator": "stevel@apache.org", "creation_time": "2003-03-11T07:11:13Z", "time": "2003-03-11T07:11:13Z", "text": "Knut, is this a problem still, or we going to have file this as a WORKSFORME?"}, {"count": 9, "tags": [], "bug_id": 15394, "attachment_id": null, "is_private": false, "id": 32930, "time": "2003-03-11T07:38:47Z", "creator": "kp@seacrown.net", "creation_time": "2003-03-11T07:38:47Z", "text": "I think we can safely close this one. In fact I have see this behaviour from \nWindows explorer lately even before I run ant for the first time, so this is \nclearly a Microsoft bug."}]