[{"count": 0, "tags": [], "bug_id": 15417, "text": "I havn't actually had a problem with it yet, but it seems like anyone who\nfigures out that a site is using a heavyweight jsp page, could mount a\nsubstantial CPU utilization DOS by sending lots of jsp_precompile requests.\n\nIt seems that there should be a way to turn it of on production servers.\nDiscussion on IRC seems to indicate that there is currently no way to turn it\noff. (One of the individuals claimed that he was reading the source and couldn't\nfind any facility for disabling it).\n\nAn alternate/additional idea to jsp_precompile is to replace this feature with\none that allows the server configuration to specify a port number to open in\nparallel to the main port, but force a recompile for every access on that port.\n(and then send back the newly compiled page to the developer, unlike\njsp_precompile) This could easily be controled at the firewall level by blocking\naccess to that port, and disabled (never enbabled?) for a production server.\n\nThe need for such a feature comes up when (for example) one goes from working on\na HEAD revision to working on a branch where the file mod times can get older.\nYou don't want to see the version left over from the newer HEAD when you attempt\nto view your work in the branch. In this case you actually want to recompile\nwhen the file got older, making an always recompile interface useful.", "id": 27900, "time": "2002-12-16T20:49:58Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-16T20:49:58Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 15417, "attachment_id": null, "id": 27904, "time": "2002-12-16T21:54:15Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-16T21:54:15Z", "is_private": false, "text": "Jason Brittain helped me find this missing feature (jason_brittain@yahoo.com)\nand wishes some credit in the matter. Credit is definately due, as he explained\njsp_precompile to me :) (I had been entirely confused by it's name, jsp_compile\nwould have made a lot more sense to me)"}, {"count": 2, "tags": [], "bug_id": 15417, "text": "(he is also the one who was reading the source code)", "id": 27905, "time": "2002-12-16T21:56:22Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-16T21:56:22Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 15417, "text": "A request to a page with jsp_precompile option is just like the request without\nthe option, except that the request is not delivered, i.e.\nhttp://foo.bar.jsp?pre_compile is not more expensive that http://foo.bar.jsp. \nThe compilation is done only once, and if the JSP page has been compiled, the\ncompilation won't happen.  Therefore I fail to see how this can be used as a DOS\nattack.\n\nA production application should precompile all JSP pages, and that will reduce \njsp_precompile to a nop.\n\nA more useful server option is probably one that tells it that the JSP pages in\nan application have been precompiled, and that it should not have to check for\nthe time stamps for the pages and their servlet files.  This might improve the\nperformance of the pages somewhat.", "id": 27908, "time": "2002-12-16T22:33:44Z", "creator": "kin-man.chung@sun.com", "creation_time": "2002-12-16T22:33:44Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 15417, "attachment_id": null, "id": 27943, "time": "2002-12-17T07:09:48Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-17T07:09:48Z", "is_private": false, "text": "Ok but my requested enhancement still stands even if there is no DOS attack.\n\nI did further direct testing of various timestamps/request combinations, and I \nhad begun to suspect that it was in fact as you described.\n\nHowever as noted here, and in the end comment of bug 14165 version control \nsystems can provide \"updated\" versions of files with older time stamps. It \nseems unreasonable that developers should have to maually (or with a script) \ntouch JSP pages just to view a coherent set of pages when moving between \nbranches, or from Trunk to Branch. \n\nI am reopening with a new summary title because I am requesting a feature that \nallows forced recompilation of pages for every load, preferably simply by \naccessing them on a second port. \n\nThis is my rational for this suggestion stated another way:\n\nAs a developer I am quite willing to wait compilation time to see a page I am \ntesting correctly. Waiting for compilation is something we all acknowledge as \nbeing part of the business. My suggetion provides a developer oriented \ninterface. A developer generally doesn't care how fast the page loads (within \nreason). If it isn't loading the code he just wrote, or just checked out of \nthe repository, it is worse than useless, it is confusing.\n\nOne of the worst maifestations of this is that a Developer checks out the \nbranch B, edits foo.jsp and fixes a typo in bar.jsp. Then the next week the \ndeveloper needs to make changes to Branch A, which contains an older older \nversion of bar.jsp than B. The developer is editing barhelp.html in branch A \nand wants to make links and add text relating to bar.jsp.\n\nThe problem is that since tomcat has cached bar.jsp when the developer was \nworking on B (last week) when he looks at bar.jsp in his browser he gets the \nBranch B version of it even though he hasn't worked on branch B for a week. So \nbasing his changes on what he sees in his browser, the developer edits \nbarhelp.html, commits his changes, and as far as he can see all the links work \nand all the wigits he mentions are there. Of course when it gets moved to a \nnew (read production) server, the cached pages have all been carefully cleared \nas part of a release procedure or are empty because it is a fresh install, \nsuddenly barhelp.html turns out to have broken links to sections of bar.jsp \nthat don't exist in the A version and talk about wigits that only exist in the \nB version.\n\nAn extreme example, perhaps, but the point is it is really quite confusing to \ndelete your entire directory, checkout a whole different branch, (perhaps even \nrestart tomcat for good measure), and find yourself looking at a mix of pages \nfrom two different branches.\n\nThe newest version of each file among all branches you have ever worked on is \nwhat you see when you browse around a devlopment server, unless you regularly \ndelete the contents of the work directory or give up on having sensible \nmodification dates and write a file touching script."}, {"count": 5, "tags": [], "bug_id": 15417, "attachment_id": null, "text": "I have also discovered that because version systems retain the mod date of the\nfile, one can update from an older branch to a newer branch and still have this\nproblem because the files in the newer branch are older than the day you were\nworking on the older branch, and therefore older than the classfiles. \n\nCan you honestly tell me this isn't confusing :) Sure be nice if I could spend\nmy brain cycles writing code rather than keeping track of what tomcat is doing\nto my branches.", "id": 27964, "time": "2002-12-17T16:55:21Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-12-17T16:55:21Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 15417, "text": "\n\n*** This bug has been marked as a duplicate of bug 33453 ***", "id": 142812, "time": "2010-12-17T09:14:37Z", "creator": "markt@apache.org", "creation_time": "2010-12-17T09:14:37Z", "is_private": false, "attachment_id": null}]