[{"count": 0, "tags": [], "bug_id": 15515, "attachment_id": null, "text": "I have a task that executes javac on a set of java source files (task1), then\nexecutes the jar command.  I then execute another task (task2) that again\ncompiles some additional java source and updates the above jar file.  I then\nexecute another task (task3) that uses the javac task using the above jar file\nin the classpath.  This task fails because one of the .java files is unable to\nlocate a package that should be in above jar file.  If I look at the jar file,\nthe package is indeed there.  The package was added to the jar in task2.  It\nseems as though ANT is only referencing the packages that were added in task1\nand not task2 that used the \"update\" option of the jar task.  This only seems to\nhappen if I try and run all three task together ant task1 task2 task3.  If I run\nant execute task 1 and 2 (ant task1 task2.  Then run ant again to execute task 3\n(ant task3), it finds the package and works fine.", "id": 28038, "time": "2002-12-19T04:41:33Z", "creator": "jwoodie@paradyne.com", "creation_time": "2002-12-19T04:41:33Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 15515, "attachment_id": null, "id": 28039, "time": "2002-12-19T04:53:51Z", "creator": "jwoodie@paradyne.com", "creation_time": "2002-12-19T04:53:51Z", "is_private": false, "text": "Changing severity."}, {"text": "It's not really Ant that is caching the JARs as much as the JVM itself.  You've\nbeen lucky that you didn't get any stranger errors, as modifying a jar that is\non the CLASSPATH is quite unhealthy for the VM.\n\nThinking about it, the jar probably isn't on the CLASSPATH but specified as\nan argument to <javac>, yes?  Sun's javac seems to cache jars as well (at least in\ncertain VMs), so using an external compiler like jikes or forking javac should\nfix the situation.\n\nThis is out of Ant's control, so it is a CANTFIX more than a WONTFIX.", "tags": [], "bug_id": 15515, "attachment_id": null, "count": 2, "id": 28904, "time": "2003-01-06T11:50:49Z", "creator": "bodewig@apache.org", "creation_time": "2003-01-06T11:50:49Z", "is_private": false}]