[{"attachment_id": null, "tags": [], "bug_id": 15597, "text": "It would seem that after installing apache on windows 2000, should you \nuninstall the application it seems to delete settings within windows and causes \nInternet Sharing to be lost within a network.  This was quite disatrous, as on \nthe first occasion i was forced to reinstall windows 2000 to get internet \nsharing back up.  Believing it to be a simple mistake on my end, i ignored it \nand kept fait in Apache.\n\nIn an attempt to learn more about Apache, i reinstalled it on my home network, \nyet was forced to remove it once again.  Like last time i lost my settings and \nso internet sharing was lost within the network.  It took me 3 hours of playing \nwith dns, ips, and gateways to get the computers to see each other again.  \n\nBoth times when i uninstalled it i used windows uninstaller, and didnt touch \nthe files apache leaves behind.  I had a search and was unable to find anyone \nelse having this problem but perhaps i was searching the wrong thing.  I hope \nthis is looked into, as my first attempt to install apache was for an intranet \nat a company and now view apache as poor software and will not reconsider it.", "count": 0, "id": 28144, "time": "2002-12-21T11:45:30Z", "creator": "rhansford@ihug.com.au", "creation_time": "2002-12-21T11:45:30Z", "is_private": false}, {"count": 1, "tags": [], "text": "Have you some firewall software or other special stuff running?", "attachment_id": null, "bug_id": 15597, "id": 32313, "time": "2003-03-03T12:52:34Z", "creator": "nd@perlig.de", "creation_time": "2003-03-03T12:52:34Z", "is_private": false}, {"count": 2, "tags": [], "text": "No firewall or special software, just a standard windows 2000 server and a hub", "is_private": false, "bug_id": 15597, "id": 32392, "time": "2003-03-04T08:45:57Z", "creator": "rhansford@ihug.com.au", "creation_time": "2003-03-04T08:45:57Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "nd@perlig.de", "text": "Hmm. Looks more like a broken windows installation or installer service.\nThe httpd (and the installer) doesn't change anything in your system's config.\nIt puts its files into the desired directory, tailors the httpd.conf and writes\nsome registry keys (look into HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\)\n\nIs your hardware 100% okay (esp. network card, harddisk, RAM)?\n\nDid you try, however, a newer version of Apache, such as 2.0.44?", "id": 33170, "time": "2003-03-14T01:12:40Z", "bug_id": 15597, "creation_time": "2003-03-14T01:12:40Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 41445, "time": "2003-07-24T18:03:40Z", "bug_id": 15597, "creation_time": "2003-07-24T18:03:40Z", "is_private": false, "text": "No response from submitter; assuming the issue is resolved."}]