[{"count": 0, "tags": [], "bug_id": 15622, "attachment_id": null, "text": "agreed, it is o.k. to provide\nhttp://www.apache.org/dist/httpd/httpd-2.0.43.tar.gz.asc without additional\nprotection, but it would be good to serve the pgp verification keys from a more\nsecure source. Sure, this is mingling the two trust models between x509 and PGP,\nbut...\n- since no systematic mutual signing among the provided pgp keys took place ( i)\nBen Laurie as the first entry in the file does have some other people endorsing\nhim, but none out of the group featured in this file nor any among the people in\nthe base public key file shipped by pgp at download and ii) even mod_ssl guru\nEngelschall appears not to be overtly trusted by anybody?)\n- since there are no phone numbers/URL to call and verify the fingerprint\nneither inside the PGP keys (admitted, as PGP only allows for e-mails and\nphotos, going for any further binding of address information is not foreseen by\nthe programm and would require overloading/misuing their \"add name\" feature) nor\nin the surrounding (unfortunately non-https) web pages.\n\nit may still be useful to add one such extra assurance (that admittedly has its\nown limitations) since most httpd admins never will bother properly\nbootstrapping the security of keys used for the signatures you provide.", "id": 28187, "time": "2002-12-23T06:54:47Z", "creator": "hauser@acm.org", "creation_time": "2002-12-23T06:54:47Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 15622, "attachment_id": null, "text": "If you'd like to donate a valid SSL certificate for us to use, we'd welcome it.  Otherwise, we're currently trying to raise the funds to pay for a certificate.\n\nWe have been increasing our web of trust with PGP keysigning parties at conventions.  But, this is a painstakingly slow process.\n\nClosing since this isn't a bug.\n\nThanks for using Apache HTTP Server.", "id": 31383, "time": "2003-02-17T01:13:27Z", "creator": "jerenkrantz@apache.org", "creation_time": "2003-02-17T01:13:27Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 15622, "attachment_id": null, "text": "I am happy to donate the ~$50 to get a certificate from e.g.\nhttp://www.comodogroup.com/products/certificate_services/index.html\n\nWhere and how would I donate? (the \"support...\" link appears to be dead - see\nhttp://nagoya.apache.org/bugzilla/show_bug.cgi?id=17115). I see\nhttp://www.apache.org/foundation/contributing.html#how-to-donate, but how would\nI ensure that it is used for the very purpose of this bug/enhancement?\nI could send the money to you personally through paypal or ask friend of mine at\nIrvine to give it to you in cash?\n\nMaybe you are right, it could be classified as an enhancement rather than a bug.\n\nSure, pgp signing parties are a good thing, but it is still more than\nastonishing that Ben and Ralf (the mod_ssl key persons as mentioned in\nhttp://httpd.apache.org/docs-2.0/mod/mod_ssl.html) never made it to one of those\nand even yourself only got Aaron to sign your key.\nAFAIK, out-of-band channels (e.g. calling Engelschall by phone in Munich) are\nanother legitimate option to establish trust.\n\nI would even go one step further and suggest that in\nhttp://www.apache.org/dist/httpd/KEYS, out-of-band approaches should be\ndescribed just to verify the signers' fingerprints (with no expectation of\nsubsequent cross-signing) for arbitrary apache downloading users. Sure, you\nmight argue that you don't want to sit on the phone 7x24 repeating your\nfingerprint, but I contend that security awareness and knowledge among users\nunfortunately is such that the phone would only ring very rarely!\nEven setting up an answering machine somewhere that just reads down the list of\nPGP fingerprints is IMHO better than the status quo. Shall I open an new RFE for\nthis?\n\nHoping that all the above qualifies for a \"Reopen\" of this enhancement request.", "id": 31408, "time": "2003-02-17T07:10:00Z", "creator": "hauser@acm.org", "creation_time": "2003-02-17T07:10:00Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 15622, "text": "Heh.  Okay, okay.  You got us.\n\nWe're trying to setup a PayPal account so that people can donate money to us officially.  This is an outstanding issue that our treasurer is in the process of completing.  We've officially asked the board for money to purchase SSL certificates at this Wednesday's board meeting.\n\nSSL certs are going to happen.  And, you'll be able to donate money directly to the ASF shortly.  (Since we're a 501c3, we have to issue receipts upon donations.)\n\nSo, file those components as, \"SOON TO BE FIXED\" by the board.\n\nAs far as giving out our phone numbers, we could indicate, \"Please email people directly if you wish to certify our PGP keys out-of-band.  Or, call 411, and ask for one of our phone numbers and feel free to wake us up at 3AM.  Or, drive up to our house if that suits your fancy.\"  If you have some text that you'd like to see added that describes good policy for OOB, please submit a patch to the development lists (dev@httpd.apache.org).\n\nMeanwhile, I'll leave this as invalid.  <grin />\n\nThanks!", "id": 31410, "time": "2003-02-17T08:00:27Z", "creator": "jerenkrantz@apache.org", "creation_time": "2003-02-17T08:00:27Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 15622, "attachment_id": 4897, "text": "Created attachment 4897\npatch for the KEYS file - more to follow in my next post", "id": 31417, "time": "2003-02-17T09:37:48Z", "creator": "hauser@acm.org", "creation_time": "2003-02-17T09:37:48Z", "is_private": false}, {"count": 5, "tags": [], "creator": "hauser@acm.org", "is_private": false, "text": "Justin,\n\nThanks your quick response and the additional insight.\n\nI am surprised that even in Apache.org \"Red Tape\" appears to have priority over\nsecurity (I am sure the authorities don't complain if you accept my money now\nand do the paper-work/proper accounting end of year - maybe you want to set-up a\nprivate project \"FundAdmin\" in this bugzilla and record such a todo in there -\nsee RFE http://bugzilla.mozilla.org/show_bug.cgi?id=193658).\n\nAnyway - the money is on the way to you.\n\nThe requested patch - is above. For it to make sense, please see \nhttp://nagoya.apache.org/bugzilla/show_bug.cgi?id=17119. I hope this would\nbe more professional and feasible than your \"411-3am\" nightmare scenario.\nEspecially your institution Irvine could certainly agree that you answering\nyour office phone a few times a week to read a fingerprint is in line \nwith its (and your research grant's) mission.\nSimilarly, I would expect this to be acceptable for William's firm Covalent too.\nI would be more than happy if it really turns out that Sanders is getting\ninundated with such phone calls (then the world is better than I think it is).\nIf so, I am happy to sponsor him an extra phone line and an answering machine\nfor a year!\n\nRgds  Ralf", "id": 31419, "time": "2003-02-17T10:01:40Z", "bug_id": 15622, "creation_time": "2003-02-17T10:01:40Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 15622, "attachment_id": null, "text": "Aaron: <<2) We should not imply to anyone that by downloading the KEYS\n    file from an SSL server that they can suddenly trust the\n    _contents_ of the KEYS file. Sure, they can better trust\n    that the contents weren't altered during transmission ...>>\nIt would be sad, if legitimate, but half-thought through legal questions result\nin a service degradation.\nTherefore I suggest to\n1) Further add to the KEYS file:\n<<On apache's own site and some mirrors, you can download the KEYS under https.\nThis reduces the exposure to some imaginable attacks, but this by no means\nimplies that this file is authentic.\nFor the proper way to determine whether you are satisfied with the KEYS'\nauthenticity, please consult http://www.gnupg.org/gph/en/manual.html#AEN335>>\n2) If you deem the \"provided as is\" part in http://www.apache.org/LICENSE.txt to\nbe insufficient protection for the foundation, perhaps it is time to add general\nTerms&Conditions (e.g. as http://www.apache.org/foundation/T_and_C.html) to the\nsite every visitor/user has to abide by to remedy that.\nIf you want an example for such T&Cs, I am happy to provide one, but I am sure\nyou have the better lawyers than I do ...\n\nPerhaps I should open two separate RFEs for 1) and 2)?", "id": 31470, "time": "2003-02-17T18:38:47Z", "creator": "hauser@acm.org", "creation_time": "2003-02-17T18:38:47Z", "is_private": false}, {"count": 7, "tags": [], "creator": "jerenkrantz@apache.org", "is_private": false, "text": "In reality, I would suggest that the best way is to send email to the person setting up an OOB conversation.  We could make it a policy to reply to that message signed with the respective key.  That way you are sure that the person who has the private key is responding to you with correct OOB details.\n\nChicken-and-egg on the trust, but I'd be loathe to publish my phone number on the website.\nWhile my office number is probably public knowledge, I never answer it anyway (it's a party line shared with others).  But, I'd be willing to give my cell phone number if someone asked politely.", "id": 31473, "time": "2003-02-17T19:05:11Z", "bug_id": 15622, "creation_time": "2003-02-17T19:05:11Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "jerenkrantz@apache.org", "is_private": false, "count": 8, "id": 31475, "time": "2003-02-17T19:42:37Z", "bug_id": 15622, "creation_time": "2003-02-17T19:42:37Z", "text": "http://www.apache.org/dist/httpd/KEYS\n\nI did a bunch of wordsmithing on the file to attempt to illustrate what we've discussed here.\n\nThanks!"}, {"count": 9, "tags": [], "bug_id": 15622, "attachment_id": null, "id": 31480, "time": "2003-02-17T20:51:04Z", "creator": "hauser@acm.org", "creation_time": "2003-02-17T20:51:04Z", "is_private": false, "text": "Thanks, this looks like progress to me - how about changing this to\n\"resolve-fixed\" or even better \"reopen\".\nJust because in other places, statistics have been run against my \"bug success\"\nrate and I would hope you didn't think of this as a pure waste everybody's time..."}, {"count": 10, "tags": [], "bug_id": 15622, "attachment_id": null, "text": "Reopen to change resolution.", "id": 38128, "time": "2003-06-01T17:24:10Z", "creator": "nd@perlig.de", "creation_time": "2003-06-01T17:24:10Z", "is_private": false}]