[{"count": 0, "tags": [], "creator": "hauser@acm.org", "is_private": false, "id": 28191, "attachment_id": null, "bug_id": 15626, "creation_time": "2002-12-23T07:45:11Z", "time": "2002-12-23T07:45:11Z", "text": "Security should become part of the standard distribution. If there are still\nlegal impediments for the outright inclusion in the \"tarballs\", there should at\nleast be good documentation how to fill this gap by oneself.\n\nsee also: http://nagoya.apache.org/bugzilla/show_bug.cgi?id=15625"}, {"count": 1, "tags": [], "bug_id": 15626, "is_private": false, "id": 69239, "creation_time": "2005-01-05T14:30:22Z", "time": "2005-01-05T14:30:22Z", "creator": "rbowen@apache.org", "text": "While I agree that there should be very clear documentation regarding what\nmodules are included in the binary builds, the description here:\n\n> Security should become part of the standard distribution. If there are still\n> legal impediments for the outright inclusion in the \"tarballs\", there should at\n> least be good documentation how to fill this gap by oneself.\n\ncovers three distinct things.\n\n* Every binary distribution should contain, in a README available for download\nin the same place, a list of what's in there.\n\n* mod_ssl should start to be included in binary distributions.\n\n* There should be clear documentation on how to add modules to an existing\nbinary installation.\n\nWhile I agree on all three things, it's a little confusing to have them all in\none bug report. The question of legal requirements regarding mod_ssl has been\ndiscussed again recently, and I'm *still* not sure what the official answer is\nthere. It would be nice to have a definitive answer on that one. However,\nwhichever way that one goes, I think that the README should have a list of all\nmodules that come with the binary distribution. Seems that's almost a\nrequirement so that people know what they're getting. I'll poke around a little\nbit and see what I can find out.\n", "attachment_id": null}]