[{"count": 0, "tags": [], "bug_id": 15651, "attachment_id": null, "is_private": false, "id": 28243, "time": "2002-12-24T14:11:31Z", "creator": "rajeshb@sapient.com", "creation_time": "2002-12-24T14:11:31Z", "text": "We are using Tomcat 3.3.1 with Apache 1.3.27 in Solaris 2.8 ( 4 CPU, 4GB RAM ). \n\n- Under heavy loads, sometimes apache stops processing the requests. At this \ntime, we don't see anything in the access logs. So it is not even accepting the \nrequests.\n- We do NOT have much sockets in TIME_WAIT mode. Its around 400 at peaktime. So \nits not because of these sockets in TIME_WAIT state. We have \ntcp_time_Wait_interval to 60000 which is good enough.\n- We have set the MaxClients to 100 and there are about 70-80 child httpd \nprocess at peak time. Rarely in error_log, we find \"MaxClients reached\". This \nmeans its queueing the requests. But this happens rarely.\n- Is it a bug in 1.3.27. We were using 1.3.20 previously. We did not face this \nproblem before.\n- The problem seems to be there for a while, and apache returns to normal \noperation after 10 or 15 minutes. But for this 10-15 minutes, it is not even \nserving a single request. \n- We don;t see any CPU usage, iowait, kernel usage or other abnormal things \nhappening at this point. \n- Could anyone have a look at it. It would be of great help.\n\nregards\nRajesh.B"}, {"count": 1, "tags": [], "creator": "jerenkrantz@apache.org", "attachment_id": null, "id": 31386, "time": "2003-02-17T01:20:28Z", "bug_id": 15651, "creation_time": "2003-02-17T01:20:28Z", "is_private": false, "text": "*** Bug 15652 has been marked as a duplicate of this bug. ***"}, {"attachment_id": null, "tags": [], "bug_id": 15651, "is_private": false, "count": 2, "id": 31903, "time": "2003-02-25T09:54:24Z", "creator": "henk.de.haan@myrealbox.com", "creation_time": "2003-02-25T09:54:24Z", "text": "I seem to have the same problem. However I'm still using Apache 1.3.26 on a RH\nlinux 7.1 (a custom built version of apache, not the RH version). The server\nuses mod_ssl in combination with client certificate requests. \nAccording to the logs, MaxClients is reached. For our system MaxClients is set\nto 20 but only about 10 clients are actually started.\nOur experience is that it does not recover on its own, but only recovers after a\nrestart of apache. Because of the usage of the system there is no time to wait\nfor recovery in about 15 minutes.\nWhen the problem occurs I have difficulty logging in on the console. The load on\nthe host is < 0.5 and apache does not seem to use cpu-time.\n\nNote that even though all processes, apache and other, run very slowly, they\nstill keep running. Requests are being processed very sloooowly, but are being\nprocessed (well it seems that way because users do not experiance timeouts in\ntheir browser)"}, {"count": 3, "tags": [], "bug_id": 15651, "attachment_id": null, "is_private": false, "id": 31994, "time": "2003-02-26T11:55:21Z", "creator": "trawick@apache.org", "creation_time": "2003-02-26T11:55:21Z", "text": "During one of these intervals you need to see what the Apache child processes\nare doing.  For Solaris, pstack can get backtraces, truss can show system calls\nbeing issued.  For Linux there is a pstack which may or may not work, but\ncertainly gdb will be able to display backtraces, and strace can show system\ncalls being issued.\n\nHopefully some digging with such tools will give hints on what the processes are\ndoing.\n"}, {"count": 4, "tags": [], "creator": "henk.de.haan@myrealbox.com", "attachment_id": null, "id": 32142, "time": "2003-02-28T08:44:37Z", "bug_id": 15651, "creation_time": "2003-02-28T08:44:37Z", "is_private": false, "text": "Due to the fact that our system is installed as a production system, neither\npstack nor gdb are available on the system. Next time this issue occurs I will\ntry  to gather more info like process state and function call as reported by\ntop. Currently there is nothing more I can do, when the time is available I'll\ntry to set up a test environment to reproduce this error. I cannot promise to do\nso for the next weeks though (sorry)."}, {"count": 5, "tags": [], "bug_id": 15651, "attachment_id": null, "id": 34735, "time": "2003-04-08T15:13:17Z", "creator": "jim@apache.org", "creation_time": "2003-04-08T15:13:17Z", "is_private": false, "text": "It would be useful during this \"hung\" state to simply telnet to port 80 on the server and \nsee if Apache responds. It's possible that, for example, Tomcat is slow and Apache is \nwaiting for it to respond. Just because something isn't logged doesn't mean what you \nthink, because stuff is logged *after* handled, not as soon as the request comes in."}, {"count": 6, "text": "No response from submitter.  Assuming the issue is resolved.", "creator": "slive@apache.org", "is_private": false, "id": 41448, "time": "2003-07-24T18:07:51Z", "bug_id": 15651, "creation_time": "2003-07-24T18:07:51Z", "tags": [], "attachment_id": null}]