[{"attachment_id": null, "tags": [], "creator": "srikanth_s_india@hotmail.com", "text": "Hi,\n\nProduct: \t\tJava Web Application\nOperating system:\tWindows NT/2000 server, Linux, FreeBSD\nWeb Server:\t\tIIS, Apache etc\nApplication server:\tTomcat 3.2.4+\nDatabase server:\tMySQL 3.23.49, MS-SQL, Oracle etc\nJava Architecture:\tJSP (presentation) + Java Bean (Business logic)\n\n     We have been facing the following problem for quite some time now. As more \nand more people are visiting and browsing the site, the Java.exe/Tomcat.exe \nsize keeps growing and finally we end up with \"Out of memory\" error. Even if we \nleave the server inactive for hours, the memory doesn't get released and the \nonly option is to restart the Tomcat server. We have posted this problem in \nmany forums and in the Tomcat bug database also (both 3.* and 4). But we didn't \nget any solutions and also we were told that the problem could lie with our \napplication. \n     Since our application has to run on any application server, we have our \nown implementation of Database connection pooling. The following part of the \ncode we used to close the idle connections.\n\n private synchronized void removeConnection(Connection f_obj_conn)throws \nException\n   {\n      f_obj_conn.close();\n      f_obj_conn = null;\n   }\n\n     But, we found that only the database connections got closed which we \nverfied with both MS-SQL and MYSQL. However, the memory allocated to the \nconnection objects never got released, neither the heap memory allocated nor \nthe process memory (Tomcat.exe). Now, after removing all the idle connections, \nwe have tried \"System.gc();\" and found that both the heap and the process \nmemory are being released promptly. Is it the right way to do? Should the same \nnot happen automatically? Will it have any effect on the performance?\n\nthanks in advance,\n\nSrikanth. S.", "count": 0, "id": 28269, "time": "2002-12-26T10:35:07Z", "bug_id": 15667, "creation_time": "2002-12-26T10:35:07Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "funkman@joedog.org", "text": "A profiler will help pin down where the memory leak is. If you see an issue,\npost it to tomcat-user and they are usually helpful.", "count": 1, "id": 35593, "time": "2003-04-18T20:26:44Z", "bug_id": 15667, "creation_time": "2003-04-18T20:26:44Z", "is_private": false}]