[{"count": 0, "text": "When recording via the HTTP Proxy Server I find my sequence correctly recorded\nexcept some request have missing parameters. Also the parameters are recorded in\nthe wrong order.\n\nParameters are lost when I have many of the same name, especially when some of\nthem have the same value. Also parameters are not recorded in the correct order.\nAnd parameters that have no value are also lost. To some it might seem silly to\nhave many parameters of the same name and the same value or with no value so\nI'll explain.\n\nMy application is well tried and tested under many browsers, so I believe the\nbehaviour I expect is legitimate. The form in question consists of a matrix of\nvalues, I send them in sequence. So for a 3 x 4 matrix I might send:\n\nmatrix.html?update=yes&d=1&d=2&d=&d=&d=&d=&d=&d=1&d=2&d=1&d=&d=\n\nTo know the position of values in my matrix it is important to send the\nparameters which have the same name, same value, blank ones and to preserve the\ncorrect order.\n\nMy experiments suggest that this needs correcting for the proxy server, for data\nentry and for saving to disk.\n\nI've also noticed that a request parameter of action=Login >> looses the space\nbetween Login and >>.\n\nHope this information is sufficient.\n\nRegards,\nPete Hargreaves\n\nP.S. Jmeter is otherwise BRILLIANT thankyou.", "creator": "pdh@totalise.co.uk", "is_private": false, "id": 28500, "time": "2002-12-27T21:22:19Z", "bug_id": 15687, "creation_time": "2002-12-27T21:22:19Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "text": "Verified on version 1.8 too.\n\nI noticed that the parameters disappear when I save the Test plan. This might \nbe an easy fix.\n", "attachment_id": null, "id": 29070, "creator": "g.bronzini@k-tech.it", "time": "2003-01-09T15:14:44Z", "bug_id": 15687, "creation_time": "2003-01-09T15:14:44Z", "is_private": false}, {"count": 2, "tags": [], "text": "Assigning this to myself. Note this can actually be several different bugs: one\nfor the proxy, one for the save/load.", "attachment_id": null, "id": 29208, "creator": "jsalvata@atg.com", "time": "2003-01-12T16:55:40Z", "bug_id": 15687, "creation_time": "2003-01-12T16:55:40Z", "is_private": false}, {"count": 3, "tags": [], "text": "After tracing these arguments through at least 13 different classes, I've found\nthey end up being merged into an empty collection by the 'value instanceof\nCollection' case of AbstractTestElement.mergeIn(TestElement).\n\nThis same merging operation is occuring before saving the test plan. I don't\nknow why, but that's how it is.\n\nThe way this merging is implemented guarantees all elements in the result\ncollection will be unique.\n\n- I don't know in which cases this merging operation is actually used (not only\nmerging against an empty collection).\n- I don't know why it ends up being invoked in those two cases.\n- I don't know why HTTP Arguments needs to be TestElement and go through all\nthis pain.\n\nAnyone knowing please drop me a word.\n\nI'll give it a crack, but will mostly be trial-and-error, I guess...", "attachment_id": null, "id": 29218, "creator": "jsalvata@atg.com", "time": "2003-01-12T23:21:33Z", "bug_id": 15687, "creation_time": "2003-01-12T23:21:33Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 15687, "text": "The main issue in this bug is now fixed.\n\nI couldn't reproduce the issue about the space inside a parameter being lost.\nIt's most likely fixed, because there's been work in that area recently.", "id": 29220, "time": "2003-01-13T01:11:55Z", "creator": "jsalvata@atg.com", "creation_time": "2003-01-13T01:11:55Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 15687, "text": "Bulk-editing to close all bugs reported fixed by 1.8.1.", "id": 32793, "attachment_id": null, "creator": "jsalvata@atg.com", "creation_time": "2003-03-10T09:39:57Z", "time": "2003-03-10T09:39:57Z", "is_private": false}]