[{"count": 0, "tags": [], "creator": "lmarlow@yahoo.com", "attachment_id": null, "is_private": false, "id": 28770, "time": "2002-12-31T00:34:27Z", "bug_id": 15729, "creation_time": "2002-12-31T00:34:27Z", "text": "The StarTeam rootLocalFolder property is currently a String and is evaluated \nrelative to the current working directory and not the project base directory.  \nI was able to fix this by simply changing the type of the property to \njava.io.File."}, {"count": 1, "tags": [], "bug_id": 15729, "text": "Created attachment 4304\nchanged rootLocalFolder to java.io.File", "id": 28771, "time": "2002-12-31T00:40:00Z", "creator": "lmarlow@yahoo.com", "creation_time": "2002-12-31T00:40:00Z", "is_private": false, "attachment_id": 4304}, {"count": 2, "tags": [], "bug_id": 15729, "text": "While this fixes the behavior, it also introduces a backwards incompatibility.\nThere may be people relying on the interpretation relative to CWD.\n\nI see a couple of options:\n\n(1) Add a new attribute\n\n(2) Try to see whether rootLocalFolder as defined by the attribute exists.  If it\ndoesn't, use getproject().resolveFile() to see whether this one exists.  If so,\nlog a warning and use it.\n\nI don't understand Starteams concepts well enough to know whether option (2)\nis feasible at all.", "id": 33892, "attachment_id": null, "creator": "bodewig@apache.org", "creation_time": "2003-03-27T07:50:45Z", "time": "2003-03-27T07:50:45Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 15729, "text": "I don't think this patch solves anything.  And may break uses that were\ndepending on the relative path.  Nothing stops the user from specifying an\nabsolute reference as the root local folder if that is what he wants.\n\nPossibly storing of this property as a File is a good idea but I cannot endorse\nthis patch without a lot of investigation and further testing.", "id": 33919, "time": "2003-03-27T14:35:13Z", "creator": "scohen@apache.org", "creation_time": "2003-03-27T14:35:13Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "scohen@apache.org", "attachment_id": null, "is_private": false, "id": 33922, "time": "2003-03-27T14:41:13Z", "bug_id": 15729, "creation_time": "2003-03-27T14:41:13Z", "text": "Perhaps my previous comment was too harsh.  But I don't see the use case you're\ntrying to solve.  If you can explain a concrete situation where this is a\nproblem I will be happy to take a look at it."}, {"count": 5, "tags": [], "creator": "j_a_fernandez@yahoo.com", "text": "My two cents:\n\nAnything in ANT that is suppose to point to a file or directory is by \nconvention assumed to be relative to ${basedir} (unless you specify a full \npath). By having the parameter be of type File, ANT takes care of this \ntransparently.\n\nUsing CWD for relative files means that buildfiles cannot be used correctly\nwhen called <ant> from one another.\n\nIt seem not only worth, but a bug not to work that way.", "id": 34441, "time": "2003-04-03T14:26:47Z", "bug_id": 15729, "creation_time": "2003-04-03T14:26:47Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "lmarlow@yahoo.com", "text": "I believe Jose has captured very well what my intention was.  The problem is \nthe rootLocalFolder property is not consistent with how the rest of ant works.  \nI ran into this problem because I expected all relative file paths to be \nrelative to ${basedir}.", "count": 6, "id": 34469, "time": "2003-04-03T20:20:16Z", "bug_id": 15729, "creation_time": "2003-04-03T20:20:16Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 15729, "text": "It is a little bit more complicated than you are making it out to be, but not much.\n\nThe problem is that there is another \"default\" behavior with StarTeam - the\ndefault behavior of checking out the the \"default folder\" registered in the\nStarTeam GUI.\n\nAdmittedly, this is of dubious utility with ant.  I, for one, don't see the use\nfor it, have never used it, and in fact, got involved with this project\nprimarily to make it possible to get away from it.  \n\nBut this is what the task currently does when NO rootLocalFolder is specified.\nUnder your proposed change, this would change to a default of basedir.\n\nI could change this along the lines that you are suggesting, while allowing for\nthis possibility as follows:\n\n1. I could make relative paths default to being calculated from basedir.\n2. Absolute paths would continue to be treated as such.\n3. no rootlocalfolder specified would equate to basedir.\n4. I could accomodate the \"default folder\" use case by adding yet another\nparameter to the task.  This might break a few existing usages, but as I said, I\nthink this usecase is of limited utility with ant.\n\nI rather think I will implement this based on your comments.  Conceptual unity\nwith the rest of ant is an important advantage.\n\nFurther Comments?\n", "id": 34478, "time": "2003-04-03T22:29:08Z", "creator": "scohen@apache.org", "creation_time": "2003-04-03T22:29:08Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "creator": "bodewig@apache.org", "text": "Jose Alberto, not everything is resolved to basedir, unfortunately.  Sometimes\nthe code predates IntrospectionHelper, sometimes people just didn't know about\nthe magic of File attributes.\n\nWhenever we change an attribute to resolve files relative to basedir and not the\ncurrent working directory, we run the danger of breaking backwards compatibility.\nAs an example, several Jakarta builds got broken when <style>'s stylesheet\nattribute was changed.  I had to revert to the tactics we use now - which pretty\nmuch is option (2) from my last comment.\n\nConsistency is good.  Breaking backwards compatibility for consistency's sake is\nnot.", "id": 34485, "attachment_id": null, "bug_id": 15729, "creation_time": "2003-04-04T06:24:11Z", "time": "2003-04-04T06:24:11Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "j_a_fernandez@yahoo.com", "is_private": false, "count": 9, "id": 34542, "time": "2003-04-04T17:49:06Z", "bug_id": 15729, "creation_time": "2003-04-04T17:49:06Z", "text": "Well by that no bug should be fixed because it is a backward compatibility \nissue ;-P\n\nNo seriously, I think the StarTeam people needs to decide whether allowing\nwhether to do <ant> to a file in a different directory should break a build\n(because CWD is different) or it should work because files are relative to \nbasedir. I think the later is much better. Maybe some backward comp option\nshould be OK or warning message.\n\nWe should audit the code to see how many cases of this issues we stil have.\n"}, {"count": 10, "tags": [], "bug_id": 15729, "attachment_id": null, "is_private": false, "id": 34543, "time": "2003-04-04T17:59:02Z", "creator": "scohen@apache.org", "creation_time": "2003-04-04T17:59:02Z", "text": "I'm still leaning toward making this change.\n\nOne problem with evaluating the backward compatability issue is that I literally\nhave NO idea how many clients are using the task as it is.  The number of\norganizations that I know for a fact are using it (from emails, bug reports,\netc.) is still in the single-digits.  I would be surprised to learn that it is\nas high as 50.  I could be way off on this but that's my gut feeling.\n\nAs I said previously, I think the use case of using the StarTeam default\ndirectory is not one that fits in well at all with ant and I would be even more\nsurprised to learn that a substantial proportion of our unknown user-base was\ntied to it.  I think that with a new parameter and some kind of info in the\nreadme, we would be sufficiently taking account of backward compatability IN\nTHIS CASE.\n\n"}, {"attachment_id": null, "tags": [], "bug_id": 15729, "text": "Now, that at last, I have some free time, I am taking a fresh look at this bug.\n If I may summarize the discussion to this point:\n\nLee Marlow (supported by Jose Alberto Fernandez) wants the rootlocalfolder\nattribute to be set relative to basedir when not specified as an absolute path.\n They point out that this gives more conceptual unity with the rest of ant.\n\nStefan Bodewig worries that this will break backward compatibility with users\nwho expect it to be relative to current working directory.\n\nI, Steve Cohen, point out that while backward compatibility will break, Stefan\nincorrectly understands part of what current functionality is.  While it is true\nthat if rootlocalfolder is specified as a relative path, that will currently be\ninterpreted relative to CWD, there is a further twist that if NO rootlocalfolder\nis specified, rlf will be the default local directory stored in starteam.  This\nis primarily useful in the StarTeam GUI itself, and losing this functionality in\nant would be no great loss, IMHO.  (It could be remedied by adding yet another\nattribute to the task, possibly).  But Stefan is correct, there would still be a\nsignificant backward compatibility issue when relative paths are specified.  I\nwasn't thinking about THAT issue at the time of my earlier comments.\n\nHowever, I am inclined to press forward despite this.  Current functionality is\na mess:\n1) if an absolute path is specified, use that.\n2) if a relative path is specified, it is relative to CWD\n3) if no rootlocalfolder is specified, the starteam default is used.\n\nThe problem is that 2 is undocumented (no documentation is provided on what\nhappens when a relative rootlocalfolder is specified).  Additionally, its lack\nof documentation makes it inconsistent with 3.  User is arguably entitled to\nassume that not specifying the attribute would be the same as specifying a\nrelative \".\".\n\nIn my use cases, it would make no difference.  I always specify rootlocalfolder\nas an absolute path (perhaps unconsciously aware of the relative path ambiguity\nhere).\n\nSo what I propose to do is that whenever a relative path is specified, print a\nWARNING message indicating that the meaning of this attribute has changed from\nwhat it meant in 1.5.  Something along the lines of\n\nWARNING - a relative rootlocalfolder is now interpreted relative to basedir and\nnot to the current working directory as it was in Ant versions prior to 1.6.", "count": 11, "id": 43562, "time": "2003-09-01T18:46:48Z", "creator": "scohen@apache.org", "creation_time": "2003-09-01T18:46:48Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "bodewig@apache.org", "is_private": false, "count": 12, "id": 43615, "time": "2003-09-02T15:57:16Z", "bug_id": 15729, "creation_time": "2003-09-02T15:57:16Z", "text": "Steve, I'll trust ypur judgement here.  If you say a relative path has never\nmade too much sense anyway (and there is no way to detect what the user wanted\nat runtime), go ahead and change it.\n\nPrinting a warning is good.  We should also add a not to Ant's WHATSNEW file\nin the \"this can break your build\" section."}, {"attachment_id": null, "tags": [], "creator": "antoine@apache.org", "text": "starteam ant tasks have been removed starting with Ant 1.8.0", "count": 13, "id": 165934, "time": "2013-03-18T02:25:41Z", "bug_id": 15729, "creation_time": "2013-03-18T02:25:41Z", "is_private": false}]