[{"count": 0, "tags": [], "text": "I have noticed that Tomcat (4.0b1 and 4.0b3) is starting up slowly and that \nduring that time, the java runtime is taking up 100% of the CPU time.\n\nWithin my projects I have made the experience that the creation of a \nSAXParserFactory is quite slow and also uses up all CPU power for about second.\n(I usually take Xerces for XML parsing...)\n\nTherfore I don't create a new SAXParserFactory every time I process a new XML \ndoc, but instead create a new SAXParserFactory once within the constructor of a \nclass and hold it within a private member variable. This way, after the factory \nhas been created, parsing is very fast.\nI have seen, that within the catalina sources, there are two \nfiles \"XmlMapper.java\" and \"ParserXJspSax.java\" that create the \nSAXParserFactory every time, a new document is parsed.\n\nThe SAXParserFactory instance has to be created only once, whereas it is \nrecommended to create a new SAXParser instance for every parse operation.\n\nFor this is the first report I issued, let me just say that I love your product!\ngreetings\nSascha", "attachment_id": null, "bug_id": 1575, "id": 2163, "time": "2001-04-29T13:51:28Z", "creator": "scoenen@gmx.de", "creation_time": "2001-04-29T13:51:28Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 1575, "attachment_id": null, "id": 2255, "time": "2001-05-03T23:33:50Z", "creator": "remm@apache.org", "creation_time": "2001-05-03T23:33:50Z", "is_private": false, "text": "Reclassified the bug as medium/enhancement, as this performance problem \nwouldn't really impact a production server. In a development environment, the \nstartup time has a bigger impact, though\nAccording to Costin, the performance of the XML mapper is really bad overall."}, {"count": 2, "tags": [], "bug_id": 1575, "attachment_id": null, "id": 4924, "time": "2001-08-27T13:13:50Z", "creator": "newman@mindless.com", "creation_time": "2001-08-27T13:13:50Z", "is_private": false, "text": "High CPU utilization and startup time is actually the first thing I noticed \nabout Tomcat 4.0-b7 after using Tomcat 3.2. I'm starting and stopping Tomcat \nprogrammatically as an \"embedded\" server for a Windows application. Other than \nthis issue, I think Tomcat 4.0 is a great improvement. I just wanted to mention \nthat for my purposes, and I would suspect for at least some others, startup \ntime does matter, and not just in a development environment.\n"}, {"count": 3, "tags": [], "creator": "newman@mindless.com", "attachment_id": null, "text": "I'd still like to see Tomcat's startup performance improve, but saving the \nSAXParserFactory instance alone didn't give a perceivable benefit on my \nmachine. I first tried Sascha's suggestion, but noticed that each of about 5 \nXmlMapper instances only seemed to parse one file. As a quick hack, I tried \nusing a static variable for the SAXParserFactory, but this didn't help much \neither. I'm not using JSP's, so I didn't look at ParserXJspSax.\n", "id": 5017, "time": "2001-08-29T15:06:10Z", "bug_id": 1575, "creation_time": "2001-08-29T15:06:10Z", "is_private": false}, {"count": 4, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "Sorry for not mentioning it sooner, but the cause of this has been found out. \nThe \"problem\" is that now 4.0 validates the web.xml files using a validating \nXML parser. About 40% of the startup time is actually spent inside the XML \nparser code.\nThe rest is due to lots of objects creation through the introspection happy XML \nmapper. 3.2 creates much less objects on startup, so isn't impacted as much.\n\nI'll mark the bug as \"later\".", "id": 5191, "time": "2001-09-06T21:03:42Z", "bug_id": 1575, "creation_time": "2001-09-06T21:03:42Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 1575, "attachment_id": null, "id": 9887, "time": "2002-01-24T20:33:07Z", "creator": "remm@apache.org", "creation_time": "2002-01-24T20:33:07Z", "is_private": false, "text": "Reopen."}, {"count": 6, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "Validation will be used, so a significant amount of time is spent in the XML\nparser to do that. The digester has improved performance quite a bit, but\nunfortunately more web applications are included in the default configuration,\nso overall the startup time between 4.0 and 4.1 will likely stay about the same\n(which will be an improvement if you choose to remove the webapps you may not need).", "id": 9889, "time": "2002-01-24T20:37:12Z", "bug_id": 1575, "creation_time": "2002-01-24T20:37:12Z", "is_private": false}]