[{"count": 0, "tags": [], "creator": "jsalvata@atg.com", "attachment_id": null, "id": 28848, "time": "2003-01-03T11:14:37Z", "bug_id": 15777, "creation_time": "2003-01-03T11:14:37Z", "is_private": false, "text": "I've found no documentation on whether the ORO classes are thread-safe. The\ncompilers and matchers aren't (we've discovered this the hard way). The caches\nare (I've checked the source). This makes perfect sense, but should be\ndocumented somewhere (e.g. in the API)."}, {"count": 1, "tags": [], "creator": "dfs@apache.org", "attachment_id": null, "id": 28854, "time": "2003-01-03T17:20:22Z", "bug_id": 15777, "creation_time": "2003-01-03T17:20:22Z", "is_private": false, "text": "Classes that perform some special form of synchronization or use thread-local\nvariables or somehow automatically handle concurrency issues require special\ndocumentation.  By default, classes are assumed to not perform any special\nconcurrency handling.  Therefore I do not consider this a bug.  Nonetheless,\ninformation regarding how to properly use the package used to be contained\nin both a FAQ and a user's guide.  These are on the TODO list, so I'm marking\nthis bug with a resolution of LATER.\n\nAs a side note, Perl5Compiler and Perl5Matcher are in fact thread-safe.  You\njust have to use a separate instance for each thread if you do not want\nto manually synchronize accesses.  If you want to share Perl5Pattern\ninstances between concurrently executing instances of Perl5Matcher, you must\ncompile the patterns with Perl5Compiler.READ_ONLY_MASK.  The classes would\nnot be thread-safe if separate instances shared global state even when \nseparate instances are used in each thread.  Thread-safe is a word that is\ntoo often used to mean \"doesn't do what I want it to do\" rather than \"cannot\nbe used in a program with concurrently executing threads without producing \ninconsistent/unexpected results.\"\n\nThis commentary in no way invalidates the general problem causing the bug \nreporter to file this problem report.  The library would be a lot easier to\nuse with a good user's guide and FAQ.  Because these won't be prepared in\ntime for the next version and to forestall further requests (under the\nassumption that if one person finds this to be a problem, others will),\nI'm actually going to contradict what I said in the first paragraph and\ninsert a few sentences in the API docs for Perl5Matcher and Perl5Compiler\nand mark this bug as FIXED.\n\nOne last side, note.  When documentation problems are found, you are\ngreatly encouraged to submit a patch to the oro-dev mailing list.  The\nproject would have made a lot more progress on documentation if more users\nwould submit a paragraph here and a paragraph there detailing things that\nthey think should be more clear.  Before you know it, we'd have a user's guide!\nFurther discussion should occur on the mailing list."}, {"count": 2, "tags": [], "bug_id": 15777, "attachment_id": null, "id": 32527, "time": "2003-03-06T03:46:26Z", "creator": "dfs@apache.org", "creation_time": "2003-03-06T03:46:26Z", "is_private": false, "text": "Closing report as it has been resolved for a couple of months."}]