[{"count": 0, "tags": [], "text": "On Unix or Linux system, some operations, like installation, can only be done \nby user root, and it would be unwise to run the entire ANT script as root \nbecause of these operations. In some cases, we need to run the same ANT script \nunder different users due to permission. It will be great if ANT can provide a \ntag so that tasks within the tag will be executed under the user specified. For \nexample,\n\n<context user=\"xyz\">\n\n   <!-- tasks will be executed by userid xyz -->\n\n</context>\n\nOf course, authentication mechanism is required and I'll let you figure this \nout.", "attachment_id": null, "bug_id": 15804, "id": 28883, "time": "2003-01-05T05:14:58Z", "creator": "kmtang@yahoo.com", "creation_time": "2003-01-05T05:14:58Z", "is_private": false}, {"count": 1, "tags": [], "creator": "gus.heck@olin.edu", "attachment_id": null, "is_private": false, "id": 28911, "time": "2003-01-06T15:54:36Z", "bug_id": 15804, "creation_time": "2003-01-06T15:54:36Z", "text": "This is an Idea I've thought about a bit, but I havn't seen a good answer. I\nactually have a case where I need to run as root so I can set strong\npermissions, but I don't want the sub builds to run as root because I want to\nmake them writeable by various individuals, and it would be nice if I didn't\nhave to trust them all with root access.\n\nI think the core problem is that you can't easily change what user the jvm\nrunning ant is. Ant can't respond to prompt so using things like su -c and sudo\nonly works from root down to lesser users.\n\nI know sudo from root to other users is possible by execing sudo (I had to do\nthis to make CVS happy, it didn't like root commits). \n\nThis would be a nice feature, but any change of user will probably need to work\nthrough sudo -S. (unless the information is written to a file and you <waitfor>\nthat file :) ). "}, {"count": 2, "tags": [], "creator": "stevel@apache.org", "attachment_id": null, "id": 32928, "time": "2003-03-11T07:21:25Z", "bug_id": 15804, "creation_time": "2003-03-11T07:21:25Z", "is_private": false, "text": "This is just way to scary to even contemplate trying to do in a cross platform\nbuild tool. What are you going to do on NT? On netware? On a mainframe?\n\nRemember, ant is not an install tool, it is a build tool. We dont do a lot of\nstuff you want in an installer (like have atomic builds and uninstallation). Sorry."}]