[{"attachment_id": null, "tags": [], "bug_id": 15917, "text": "Hi,\n\nI'm actually using the PVCS task in ANT 1.5.1\nEverything is fine with it, ant it works well with Windows 2000 and PVCS v6.8 \n(for the knowlegde).\n\nBut, in my opinion, a little something is missing in it, and I would like to \nknow your opinion about it.\nIn fact, when you get your archives, the task doesn't \"get\" it if the \ndestination directory doesn't exists... I actually use the task to build \npackages from scratch, and I must create all of them (the destination \ndirectories) in a previous task.\nMy project is big enough so that it is very tiring to do it, and if someone \nadds a directory in the PVCS project, I must add it (them!) in my specific \ntask, with the risk to have an incomplete package if I forget it.\n\nIn PVCS, the get command creates the destination directories if they are not.\nIs it possible to have an option in the task to do the same thing or not?\n\nThanks a lot guys...", "count": 0, "id": 29065, "time": "2003-01-09T13:06:47Z", "creator": "stephane.bocquet@delta-diffusion.fr", "creation_time": "2003-01-09T13:06:47Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 15917, "attachment_id": null, "id": 29073, "time": "2003-01-09T16:37:28Z", "creator": "snewton@io.com", "creation_time": "2003-01-09T16:37:28Z", "is_private": false, "text": "Can the submitter please attach a copy of the target where you call the PVCS\ntask?  There code to automatically create the directories is there, in the\ncreateFolders() method, so perhaps there is some other issue with either PVCS or\nthe configuration. I've been using it for quite some time now and have never had\nto manually create the directories if I've specified the correct values for pvcs\ntask. Typically this means setting the filenameFormat and lineStart correctly."}, {"count": 2, "text": "Hi,\n\nOk, I've set the correct values for PVCS task (lineStart). That wasn't easy and \nvery clear for me to understand in the Javadoc.\n\nSo, for the info:\nIf you are on a Windows Platform and accessing the repository of PVCS by a \nconnected drive, you must set the value of the lineStart option to the drive \nletter of your connected drive.\n\ne.g. : My repository is :\n<property name=\"pvcs.repository\" value=\"${pvcs.home}/DEVT/WATOO\"/>\nand my lineStart option is :\n<property name=\"pvcs.linestart\" value=\"&quot;J:\"/>\n\nPerhaps we could improve all this. I don't know how, but there is surrely a to \ndo that.\n\nHope this could help someone...", "creator": "stephane.bocquet@delta-diffusion.fr", "is_private": false, "id": 29074, "time": "2003-01-09T16:52:26Z", "bug_id": 15917, "creation_time": "2003-01-09T16:52:26Z", "tags": [], "attachment_id": null}, {"count": 3, "tags": [], "creator": "snewton@io.com", "is_private": false, "text": "Agree the lineStart property hasn't worked out too well. There's a proposal in\nbug 3219 with some source code that changes the behavior to accept paths with\nany alpha followed by a colon, in addition to / or \\\\, and this seems a better\nsolution.\n\n*** This bug has been marked as a duplicate of 3219 ***", "id": 29078, "time": "2003-01-09T17:00:26Z", "bug_id": 15917, "creation_time": "2003-01-09T17:00:26Z", "attachment_id": null}]