[{"count": 0, "tags": [], "bug_id": 16028, "attachment_id": null, "text": "Hi,\n\n   I would like the following officially clarified. Please think on it .. don't\njust close the issue as INVALID.\n\n   Specifically, it is impossible to *safely* use JNI under Tomcat 4.x (I assume\nthe same is true for 5.x) because of a JVM limitation whereby a native shared\nlibrary may only be loaded once per JVM. This leads to the following problem:\n\n- class A uses library L\n- Since Tomcat makes use of multiple classloaders and might load the same bean\nmultiple times in different classloaders, System.loadLibrary() (which is\nrequired for JNI) might get executed multiple times across different classloaders.\n- This isn't a problem if we know for a fact that the old bean was unloaded\nbefore the new one was loaded. I believe the shared library is unloaded with the\nold instance.\n- Sun's Bug Parades suggests the only way to solve this problem is to make sure\nthat across all classloaders, all instances of class A make use of a utility\nclass B which does the actual System.loadLibrary() call. It is suggested that\nthe developer guarantee that class B (System.loadLibrary()) is only loaded once\nper JVM whereas class A may be loaded multiple times in multiple classloaders.\nThat is, as long as class B is loaded in a parent classloader to class A's\nclassloader everything will be fine. Furthermore, only one instance of B may\nexist per JVM.\n- The problem with the above workaround is that Tomcat provides no framework\nmecanism that guarantees JNI library loaders (as mentioned above as class B)\nwill only be loaded once.\n- I urge you to contact Sun engineers for more details so you're aware of all\nthe issues before responding.\n\nThank you,\nGili", "id": 29269, "time": "2003-01-13T15:39:44Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2003-01-13T15:39:44Z", "is_private": false}, {"count": 1, "tags": [], "creator": "remm@apache.org", "text": "This is a system call, there's nothing Tomcat can do to improve that situation.\nBTW, if you put a class in common/lib or common/classes, it will be loaded once.", "id": 36459, "time": "2003-05-01T19:21:09Z", "bug_id": 16028, "creation_time": "2003-05-01T19:21:09Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 16028, "is_private": false, "id": 36749, "time": "2003-05-06T13:20:28Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2003-05-06T13:20:28Z", "tags": [], "text": "Is there a way to guarantee a class will be loaded *at most* once? Or is placing\na class in common/lib or common/classes guarantee it will be loaded *exactly*\nonce (i.e. loaded even if it's never used)?\n\nThanks,\nGili"}]