[{"count": 0, "tags": [], "bug_id": 16060, "attachment_id": null, "text": "The \"Retrieve All Images...\" option on HTTP Requests is does not mimic the\nfunctionality provided by a browser cache (all images are loaded for every\nrequest rather than just the first time they are hit).\n\nOliver Rossmueller suggested the creation of a new test element similar to\ncookie/header/auth handling that does image caching per thread.\n\nIn the mean time the work around is to manually request the images in their own\nHTTP Request test elements.", "id": 29346, "time": "2003-01-14T11:04:45Z", "creator": "seade@apache.org", "creation_time": "2003-01-14T11:04:45Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 16060, "attachment_id": null, "is_private": false, "id": 43526, "time": "2003-08-31T22:19:06Z", "creator": "mramshaw@alumni.concordia.ca", "creation_time": "2003-08-31T22:19:06Z", "text": "This isn't clear to me. The HTTP Sampler only downloads duplicated images once per request, \nso that - at the request level - the Sampler does mimic the functionality provided by a browser \ncache. \n \nAre you saying that the downloaded images should be cached at the thread level, so that the \nthread grouping would function as a browser session (actually this does seem to make sense \nto me) ? Or would we need to introduce a new element that would function as a users' browser \nsession ? \n \nHow exactly do you see the session/thread grouping working ? "}, {"count": 2, "tags": [], "creator": "seade@apache.org", "text": "I am a little rusty as to the exact symptoms of the problem, but the essesence\nwas that I would expect the \"Retrieve All Images...\" functionality to pull down\nimages in the same fashion as the caching mechanism of a regular browser - i.e.\neach thread (perhaps even each cycle) should pull down all referenced images\nonce and only once (since further requests would come from the cache if a\nbrowser was hitting the site).  If I recall correctly only a subset of the\nimages were being downloaded and this seemed to occur for every request.", "id": 43529, "time": "2003-08-31T22:47:23Z", "bug_id": 16060, "creation_time": "2003-08-31T22:47:23Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 16060, "text": "I am a bit confused by this bug submission. The way netscape 3-6 and IE work is \nthe browser caches all images by the URL. The only time a browser retrieves the \nsame images on subsequent pages is if the browser is set to download all images \nall the time. The way the samplers work, it will always retrieve all images \nonce, since the images are added to a list. Duplicate images are not added. the \nimages are then retrieved by the sampler. The sampler does not immitate a \nbrowser strictly, since a browser will launch multiple threads to get the \nimages at the same time. This is specified in W3C's HTTP specification. HTTP1.0 \nlimits the number of concurrent connections to the same server to 4 and HTTP1.1 \nlimits it to 2 concurrent connections to the same server. If we really want to \nimmitate browser behavior, you can achieve this without writing a new \ncontroller to cache the images. Simply make a separate thread group that gets \nthe images. You should be able to figure this out by looking at the number of \nhits per page and comparing to the number of times each image is downloaded.", "id": 51094, "time": "2004-01-24T02:50:36Z", "creator": "woolfel@yahoo.com", "creation_time": "2004-01-24T02:50:36Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Yes, I understand the intent of this bug is to request a new configuration\nelement (in the lines of the cookie handler) that keeps track of which images\nhave already been downloaded by a particular client and prevents repeated downloads.\n\nIt makes a lot of sense, and I'm ready to work on this -- but only once we\nundertake the migration to Apache Jakarta Commons HTTPClient.", "is_private": false, "id": 51103, "creator": "jsalvata@atg.com", "time": "2004-01-24T11:50:21Z", "bug_id": 16060, "creation_time": "2004-01-24T11:50:21Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "sebb@apache.org", "is_private": false, "text": "*** Bug 40768 has been marked as a duplicate of this bug. ***", "id": 106766, "time": "2007-08-14T15:11:33Z", "bug_id": 16060, "creation_time": "2007-08-14T15:11:33Z", "attachment_id": null}, {"count": 6, "tags": [], "text": "JMeter 2.3.2 now has a CacheManager which holds details of downloaded resources", "is_private": false, "bug_id": 16060, "id": 121151, "time": "2008-10-02T08:21:54Z", "creator": "sebb@apache.org", "creation_time": "2008-10-02T08:21:54Z", "attachment_id": null}]