[{"count": 0, "tags": [], "creator": "iblesa@tissat.es", "attachment_id": null, "id": 29408, "time": "2003-01-15T16:52:40Z", "bug_id": 16114, "creation_time": "2003-01-15T16:52:40Z", "is_private": false, "text": "On a jsp like:\n\n---a.jsp>>>\n&lt;html>\n.\n.\n.\n.\n&lt;MyCustomTags:myFirstTag ..... />\n.\n.\n.\n.\n&lt;/body>\n&lt;/html>\n\n\nThe problem is that if miFirstTag does an output to the jsp output (writing to\npageContext.getOut() on handler of type Tag or writing to getPreviousOut() on\nhandler of type BodyTag) it does not appears on a.jsp (or only appears part of\nall the content that has been writen on the custom tag). I have seen that the\noutput is not flushed when the custom tag handler finishes.\n\nOn previous 4.1.x (at least on 4.1.12) versions it worked fine."}, {"count": 1, "tags": [], "creator": "iblesa@tissat.es", "attachment_id": null, "id": 29506, "time": "2003-01-16T09:26:28Z", "bug_id": 16114, "creation_time": "2003-01-16T09:26:28Z", "is_private": false, "text": "I have made some tests with Tomcat and I have found that, the problem is not\nwhat I had said. It is different. Sorry for this :(\n\nThe problem is a very simple one. \nWhen a Jsp finishes its execution it does not flush its output. On JSP 1.2\nspecification, autoFlush (attribute of the page directive) is true by default,\nthen flush should be done automatically."}, {"count": 2, "text": "I have tested autoflush and it works as expected. However, autoflush is not \nrelated to flushing output on execution (which also works as expected).\n\nIf you still experience this issue, please provide a simple as possible test \ncase (eg a complete JSP) that demonstrates the bug.\n\nFor now, I am resolving this as invalid as the report doesn't quote make sense \nand the things it mentions are working correctly.", "bug_id": 16114, "is_private": false, "id": 63837, "time": "2004-09-19T22:09:07Z", "creator": "markt@apache.org", "creation_time": "2004-09-19T22:09:07Z", "tags": [], "attachment_id": null}]