[{"count": 0, "tags": [], "creator": "dbronaugh@linuxboxen.org", "attachment_id": null, "is_private": false, "id": 29668, "time": "2003-01-18T20:31:19Z", "bug_id": 16236, "creation_time": "2003-01-18T20:31:19Z", "text": "With Apache, when you Include a file within, say, a <Directory> section, it is\nnot treated as if it is within the <Directory> section -- it is treated as if it\nwere just included into the main config.\n\nI consider this a major bug; it means you can't have a sensible configuration\nsystem. Because of this, I cannot include a file which defines how my auth\nsystem works from within each <Directory> in which it is required (since the\nAuth directives are not valid within the main config). This means massive\nduplication of data, a situation that should (in my opinion) be avoided at all\ncosts.\n\nI wish I could submit a patch for this, but at this point I can't, because I'm\nbusy as hell. Perhaps within the next week I may submit something. Otherwise, I\nhope someone else will take this on.\n\nAnd yes, I am aware that this could break a number of existing configurations...\nif they're really stupid."}, {"count": 1, "text": "Should have mentioned this.\n\nHere is the config that triggered this bug for me:\n\nhttpd.conf includes vhosts.conf within the context of the main config file.\n\nvhosts.conf includes auth-cics.conf within the context of the vhost\n\nauth-cics.conf defines a number of <directory> sections for authentication.\nWithin each directory section, I include mysql_auth.conf, which defines how to\nconnect to the database I'm using for auth (mod_auth_mysql), how it is\nstructured, etc.\n\nThe simplest config that will trigger the bug is this:\n\nhttpd.conf:\n<Directory />\n    Include \"conf/foo.conf\"\n</Directory>\n\nfoo.conf:\nAuthType Basic\n\nThat will trigger this bug.\n\nI haven't checked this on Apache2, however I suspect the situation is the same.", "bug_id": 16236, "is_private": false, "id": 29670, "time": "2003-01-18T20:56:41Z", "creator": "dbronaugh@linuxboxen.org", "creation_time": "2003-01-18T20:56:41Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 16236, "text": "Reports suggest this bug does not affect Apache 2.0", "id": 29673, "time": "2003-01-18T21:38:37Z", "creator": "dbronaugh@linuxboxen.org", "creation_time": "2003-01-18T21:38:37Z", "is_private": false, "attachment_id": null}]