[{"count": 0, "tags": [], "bug_id": 16251, "text": "When I try to stop the Apache server, it seems to be trying to stop for a \ncouple of minutes, then my computer reboots without any warning. I have tried \nto stop the server three times and got a reboot each time.", "id": 29696, "time": "2003-01-20T08:45:07Z", "creator": "eric.pauker@telus.net", "creation_time": "2003-01-20T08:45:07Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 16251, "text": "When I try to stop the Apache server, it seems to be trying to stop, but after \na couple of minutes my computer reboots. I have tried to stop the server three \ntime and got a reboot each time.", "id": 29697, "time": "2003-01-20T08:46:56Z", "creator": "eric.pauker@telus.net", "creation_time": "2003-01-20T08:46:56Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 16251, "attachment_id": null, "text": "\n  Just an educated guess, you have Zone Alarm installed.\n\n  See the original bug report for further details.\n\n\n*** This bug has been marked as a duplicate of 7932 ***", "id": 29735, "time": "2003-01-20T21:53:52Z", "creator": "wrowe@apache.org", "creation_time": "2003-01-20T21:53:52Z", "is_private": false}, {"count": 3, "tags": [], "creator": "eric.pauker@telus.net", "is_private": false, "text": "The Zone Alarm bug has nothing to do with this bug, I am not using Zone Alarm \nand I didn't say anything about getting a BSOD. The Apache server refuses to \nshut down and while attempting to shut down it reboots my computer.\n\nHere's what happens:\n\n1. I select \"stop\" from the Apache menu off the start button, or I select stop \nin the Apache server monitor, or I select the Apache server in the services \nlist and then select stop.\n\n2. The server spends a couple of minutes trying to stop.\n\n3. My monitor goes black (no warnings or messages of any kind), and my computer \nreboots.\n", "id": 29748, "time": "2003-01-21T00:54:26Z", "bug_id": 16251, "creation_time": "2003-01-21T00:54:26Z", "attachment_id": null}, {"text": "And are you running any other firewall, anti-virus program, or other\nprogram that places with winsock/the tcp/ip stack?", "tags": [], "creator": "slive@apache.org", "is_private": false, "count": 4, "id": 29754, "time": "2003-01-21T02:48:42Z", "bug_id": 16251, "creation_time": "2003-01-21T02:48:42Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "wrowe@apache.org", "text": "\n  Please detail exactly what antivirus or firewall software is installed\n  on this specific PC.  Please indiciate exactly which version of the OS.\n  And finally, please inidicate exactly what Network drivers are installed\n  (protocol, interfaces and adaptors) for the given network.\n", "id": 29757, "time": "2003-01-21T04:53:26Z", "bug_id": 16251, "creation_time": "2003-01-21T04:53:26Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 16251, "text": "My system specs:\n\n- No firewall running.\n- No Antivirus running.\n- Standard Windows 2000 TCP/IP network drivers.\n- Realtek RTL8139(A) PCI Fast Ethernet Apdapter card installed, using Microsoft \ndriver 5.366.818.1999.\n- Microsoft Windows 2000 Professional Version 5.0.2195 Service Pack 1 Build \n2195 NOTE: I have tried to install service pack 2 and 3 in the past and each \ntime they have trashed my system, so it is not an option for me to try them.\n\n\nI pressed ctrl-alt-del to see what processes were running on my machine, and I \nnoticed that Apache.exe was in the list three times. Is this normal?\n", "id": 29760, "time": "2003-01-21T07:09:42Z", "creator": "eric.pauker@telus.net", "creation_time": "2003-01-21T07:09:42Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "wrowe@apache.org", "text": "\n  Apache.exe should be running twice (a parent 'watchdog' process that assures\n  the server remainins running in case of some fault, and a child 'worker'\n  process that serves requests.)  You will note that the child consumes many\n  more resources than the parent.\n\n  ApacheMonitor.exe may be running if you have the monitor running in the\n  taskbar, displaying the status of the running apache process.\n\n  You mention both SP2 and SP3 'trash' your system.  If the system is that\n  unstable, there is possibly no help we can provide.\n\n  Finally, you mention you can't 'stop' apache, and it reboots your machine \n  when you attempt to stop it.  How are you stopping apache?  Is it running\n  as a service, or as a console application?\n\n\n", "id": 29761, "time": "2003-01-21T07:23:42Z", "bug_id": 16251, "creation_time": "2003-01-21T07:23:42Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "text": "I mentioned in a previous post how I attempt to stop Apache. Basically I have \ntried every possible way to stop it and none have worked. It is running as a \nservice.\n\nI don't have the Apache monitor running, it is Apache.exe that appears three \ntimes in the process list.\n\nAs far as the service packs go, they are buggy pieces of junk. I have tried \nreformatting my harddrive, installing just Windows 2000 and then the service \npacks. They trash Windows 2000 every time. I worked for a government office a \ncouple of years ago, and the network techs there discovered that the Windows \n2000 service packs would trash any machine that had a certain Intel motherboard \nin it, so they made a policy that no service packs would be installed ever. \nThey verified with Microsoft that there is a problem with the service packs on \ncertain motherboards, but MS decided it wasn't worth their time to fix it.", "is_private": false, "id": 29772, "creator": "eric.pauker@telus.net", "time": "2003-01-21T10:09:38Z", "bug_id": 16251, "creation_time": "2003-01-21T10:09:38Z", "attachment_id": null}, {"text": "I've had the reboot problem on win2k with other network software (a java proxy\nfor example), but not (yet?) with apache. I'd say this looks like a serious\nproblem in windows' tcp/ip module (in conclusion with some hardware as you\nmentioned).\n\nYou may try another network card or something (was helpful in my case). There's\nprobably nothing that we can do within the apache code. Therefore I'm marking\nthis report invalid. Sorry.\n\nThanks for using Apache!", "tags": [], "bug_id": 16251, "is_private": false, "count": 9, "id": 32318, "time": "2003-03-03T13:10:29Z", "creator": "nd@perlig.de", "creation_time": "2003-03-03T13:10:29Z", "attachment_id": null}]