[{"count": 0, "tags": [], "bug_id": 16268, "attachment_id": null, "id": 29719, "time": "2003-01-20T17:45:13Z", "creator": "gus.heck@olin.edu", "creation_time": "2003-01-20T17:45:13Z", "is_private": false, "text": "I just noticed that the new site at ant.apache.org is shot through with\nformatting tables.\n\nTables are not for formatting :) tables are for tabular data. CSS is for\nformatting. Since the ant site is getting revamped we ought to do it in a proper\nstructured markup manner rather yet another non-accessable, slow downloading,\ntable based set of pages to the internet."}, {"count": 1, "tags": [], "text": "edit above comment: rather yet  == rather than add yet", "is_private": false, "id": 29720, "creator": "gus.heck@olin.edu", "time": "2003-01-20T17:47:43Z", "bug_id": 16268, "creation_time": "2003-01-20T17:47:43Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 16268, "attachment_id": null, "is_private": false, "id": 29721, "time": "2003-01-20T17:51:48Z", "creator": "alexeys@inventigo.com", "creation_time": "2003-01-20T17:51:48Z", "text": "Tables are actually very good for formatting becase of their dynamic column\nwidth feature. And they are very portable."}, {"count": 3, "tags": [], "text": "If your only criteria is do the bits eventually wind up in the right location on\nthe screen then you are correct. However there are other criteria for a good web\ndocument. The logic you employ comes from a desk top publishing perspective,\nwhich is different from web publishing in several critical ways.\n\n1. Desk top publishing (DTP) results in paper output, which can only be read in\none manner. It can only be read by people, and can only be read with the eye.\nAll support for the handicaped, is entirely separate from the document produced\nin desk top publishing. Nobody can actually look at a web document. (geeks who\nshave and read memory chips with microscopes aside... I've heard that can be\ndone.) One can only read it with the aid of a computerized device. That device\n*might* be a standard web browser on a desk top platform, which is what you are\nassuming. However increasingly likely is the posibility that is palm base, or\nphone based browsing, which in some cases treat tables very differently from\nplain text. If the person is blind, it could be a text reader. If the person is\nstuck somewhere they can't fire up a GUI, it could be a text only browser like\nLynx. Furthermore, unlike the paper produced by DTP, a web document may be read\nby a *machine*. Machines have no way of understanding that this table is for\nformatting and that table actually contains tabular data. If you dobut that, I\nchallenge you to write an algorithm for distingishing the two types of table...\n\n2. Structured markup (such as xhtml) properly used describes what a document is\nand what it contains. Formatting information is contained in the style sheet. It\nis even possible to have a style sheet that specifies formating for visual,\nprint and aural media. This makes it possible for a (properly writen) browser to\nrender the page appropriately regardless of context.\n\nSimplified structured markup is what HTML was originally supposed to be, but web\ndesigners were in short supplie and Graphics Artists trained for print media\nwere in over supply, so much of the web design of the past decade was done by\npeople who only ever considered where the pixel lands on the screen. Many of\nthese people published books that sold well because there were a bunch of\n(formerly starving) Graphic Artists trying to learn how to get on the Web gravy\ntrain. \n\nDon't get me wrong, I don't fault them, every thing they did was logical and\nexpediant from their perspective. The web wouldn't be what it is today without\nthem, but the web can be more than it is, and we should be helping that process\nnot hindering it.", "attachment_id": null, "id": 29722, "creator": "gus.heck@olin.edu", "time": "2003-01-20T18:30:12Z", "bug_id": 16268, "creation_time": "2003-01-20T18:30:12Z", "is_private": false}, {"count": 4, "tags": [], "creator": "gus.heck@olin.edu", "is_private": false, "text": "Suggested Reading:\n\nLie, Hakon Wium and Bert Bos. _Cascading_Style_Sheets,_ Designing for the Web.\nSecond Ed. Addison-Wesley 1999.", "id": 29724, "time": "2003-01-20T18:43:13Z", "bug_id": 16268, "creation_time": "2003-01-20T18:43:13Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 16268, "attachment_id": null, "is_private": false, "id": 29726, "time": "2003-01-20T18:49:48Z", "creator": "alexeys@inventigo.com", "creation_time": "2003-01-20T18:49:48Z", "text": "Gus, you sound a little harsh (sorry for a personal remark, but you sound like a\nyoung person that just finished a web design course). In general the science\nteaches us that we should use minimal means to solve problems. Using tables\n(however wrong they can be) seem that minimal (and the most portable) way to\nachieve the existing layout. If we continue this discussion even further about\nthe right way of doing a web design, we should agree that XML document with XSL\nstylesheets should be used instead of HTML at all."}, {"count": 6, "tags": [], "bug_id": 16268, "attachment_id": null, "id": 29728, "time": "2003-01-20T18:55:33Z", "creator": "nick@chalko.com", "creation_time": "2003-01-20T18:55:33Z", "is_private": false, "text": "Let me be even more harsh.\nIf the table layout bothers you.\nSupply a Patch. \n"}, {"count": 7, "tags": [], "creator": "gus.heck@olin.edu", "is_private": false, "text": "Alexy, \n\nYou know as well as I that xml/xsl that you propose is correct but a strawman,\nbecause, finding a web browser that supports it is quite difficult. FYI I have\nnever taken a web design course :), and if 31 is young then I suppose I am\nguilty of that. I was being a bit harsh because your response struck me as flippant.\n\nNick - That's not harsh :). It is a fair open source challenge :). I suppose I\nshould, though I came in on a holiday today to do other work, so it won't happen\ninstantly. The semester is starting and I have stuff I need to do to support a\ncourse this semester, so time is in short supply. Also, my first patch this year\nwill be to my symlink task, so it doesn't rewrite recorded symlink files if no\nnew symlinks have been added. \n\nMostly I just wanted to raise the issue and start a discussion.", "id": 29730, "time": "2003-01-20T20:00:11Z", "bug_id": 16268, "creation_time": "2003-01-20T20:00:11Z", "attachment_id": null}, {"count": 8, "tags": [], "creator": "angus@pobox.com", "is_private": false, "text": "I think the XML/XSLT suggestion is not a straw man at all, but rather a \ngood suggestion.\n\nServing XML and XSLT content directly from the site is clearly not the way \nto go, as relatively few browsers handle this reliably. However, if the site is \nauthored in XML, you can generate content offline in the desired format - \nHTML with tables, HTML with CSS, XSL-FO for generating PDFs etc. - \nfrom the XML sources using a stylesheet processor such as Xalan. You \nthen serve the generated content. This is the way that I now develop \nwebsites, and is the reason why I'm interested in Ant: I wanted a build tool \nto manage the task of transforming my XML-based documents into \nbrowser-friendly HTML. \n\nOn the subject of tables, I recommend staying with them for the time \nbeing. Yes, separation of logical and visual structure (which using \nminimalistic XHTML and CSS would theoretically give you) is the way to \ngo in the long run, but in the short run there are still many users whose \nbrowsers won't reliably handle XHTML or CSS-based layout. These \npeople will be locked out of using the Ant site, something which I think is \ncontrary to the spirit of Ant and Apache.\n\nI'd recommend going the XML route, but - as I am now in the throes of \nconverting a vast HTML website to XML - I can tell you that it's quite a lot of \nwork.", "id": 29732, "time": "2003-01-20T20:33:06Z", "bug_id": 16268, "creation_time": "2003-01-20T20:33:06Z", "attachment_id": null}, {"count": 9, "tags": [], "text": "A lot of the site is currently in XML and is converted to HTML using\nAnakia/Velocity - Just FYI.", "attachment_id": null, "id": 29738, "creator": "conor@apache.org", "time": "2003-01-20T22:08:47Z", "bug_id": 16268, "creation_time": "2003-01-20T22:08:47Z", "is_private": false}, {"count": 10, "tags": [], "text": "Ok so I partially redid the front page of ant.apache.org. Basically the header\nportion is formated via css, and degrades reasonably in Netscape 4. (IE 5.5,\n6.0, Mozilla 1.1, Opera 6.0 and Konqueror 3.0.0 all render it in full css, with\nmozilla of course taking top honors and getting nothing wrong.)\n\nThe one glitch I couldn't fix in CSS seems to be that (with the exception of\nmozilla) none of the browsers seem to correctly predict the height of a div.)\n\nThe result is that one might have to give up the rounded corners, but everything\nelse works fine.\n\nFor some reason some of the spacer.gifs come out funny, but that is all in parts\nof the page I didn't touch, so don't worry about that.\n\nAnyway, if you want to peek at it I have put it up temporarily, at\nhttp://bugzilla.cs101.org/showpage/ant.html\nhttp://bugzilla.cs101.org/showpabe/page.css\n\nGus", "is_private": false, "id": 29750, "creator": "gus.heck@olin.edu", "time": "2003-01-21T02:25:02Z", "bug_id": 16268, "creation_time": "2003-01-21T02:25:02Z", "attachment_id": null}, {"count": 11, "tags": [], "bug_id": 16268, "attachment_id": null, "id": 29751, "time": "2003-01-21T02:30:37Z", "creator": "gus.heck@olin.edu", "creation_time": "2003-01-21T02:30:37Z", "is_private": false, "text": "The spacer.gif thing was a perm problem... now it works."}, {"count": 12, "tags": [], "bug_id": 16268, "is_private": false, "id": 29873, "attachment_id": null, "creator": "conor@apache.org", "creation_time": "2003-01-22T14:07:54Z", "time": "2003-01-22T14:07:54Z", "text": "I'm changing this to an enhancement since while using tables may be gauche, it\nisn't a bug :-)\n\n"}, {"count": 13, "tags": [], "bug_id": 16268, "is_private": false, "id": 34483, "attachment_id": null, "creator": "conor@apache.org", "creation_time": "2003-04-04T04:23:03Z", "time": "2003-04-04T04:23:03Z", "text": "Removed the bulk of formatting tables and replaced them with CSS based layout.\nTwo tables remain - one for the logo bar and one for the search form (also in\nthe logo bar). I can remove both of these on Mozilla but IE cannot cope with the\n<input> boxes and inserts a blank white line - ugly.\n\n"}]