[{"count": 0, "tags": [], "bug_id": 16274, "attachment_id": null, "text": "I managed to configure the JAASRealm authenticator that I found was part of\nCatalina. The jaas.conf, I initially set to use the JAASMemoryLoginModule (that\nallows JAAS to use the tomcat-users.xml file to perform authentication). On\nstarting tomcat can with the -security flag and passing the jaas related VM\nflags I found that the VM was not finding the LoginModule which is part of\ncatalina.jar . I placed catalina.jar in the vm classpath but this resulted in\ncatalina not starting at all. (LifeCycle Classdefnotfound). I tried placing\ncatalina.jar in all the places I could think off but to no avail. I then\nextracted the JAAS related class (and org.apache.catalina.Realm) and placed it\nin a seperated jar (loginmodule.jar) and placed it in bin and add the jar to the\nclasspath (after bootstrap.jar). This also failed to resolve the issue as\nJAASMemoryLoginModule implements Realm. This interface is part of the\ncatalina.jar and essentially I ended up with the same results as having\ncatalina.jar in the classpath (LifeCycle classdefnotfound).  As an experiment I\ndecided to create a new LoginModule with no dependencies to catalina except for\nJAASCallbackHandler (principals and roles were statically initialized in the\nclass to simulate authentication). Up on placing this jar in the classpath and\nleaving the rest of tomcat the way it was seems to have done the trick. \nI presume that the LoginModule needs to be in the classpath as of jdk1.4 as JAAS\nis shipped with the jdk. If this is true then I thik it would be necessary to\nrepackage the JAAS related functionality in a seperate jar and do with it the\nsame as bootstrap.jar.\n\nRegards\nsuhail", "id": 29733, "time": "2003-01-20T20:51:39Z", "creator": "ilyanov@mac.com", "creation_time": "2003-01-20T20:51:39Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 16274, "text": "This has been fixed in CVS and will be included in 4.1.32+\n\nThe JAAS realm remains experimental and there is still work to be done (there\nare some fixes that should be ported from TC5) but it is now possible to use the\nJAAS realm to authentication against tomcat-users.xml on a 1.4 JDK.", "id": 77089, "time": "2005-07-08T00:43:51Z", "creator": "markt@apache.org", "creation_time": "2005-07-08T00:43:51Z", "is_private": false, "attachment_id": null}]