[{"count": 0, "tags": [], "bug_id": 16303, "attachment_id": null, "text": "I have been troubleshooting an issue with my perl cgi scripts not working for \nabout 3 weeks now.  I am running on FreeBSD 4.7 and using apache 1.3.27 with \nmod_ssl version 2.8.12 as well as mod_php4-4.2.3.  All of my perl scripts that \nworked on the previous system now produce premature end of script headers.  I \nam using a known working httpd.conf file (it worked on my previous install).  \nMy scripts work correctly from the command line and produce proper HTTP1.0 \nheaders.  I have also compiled a hello.c file to test if it was just perl and \nthat is not the case.\n\nThe interesting issue on this one is that these scripts all the sudden started \nworking when I did essentially nothing to solve the problem.  Well, I had to \nmake a change to httpd.conf (or so I thought) because all of my perl scripts \nwould now only accept GET data and not POST.  When I restarted apache using \napachectl graceful, again, all my cgi scripts broke.  PHP works fine.  This is \nan error that is way outside all of the usual FAQ's on cgi's not working as I \nam wits end on how to solve it.\n\nI'm almost wondering if apache is trying to execute the cgi scripts and is \nunable to do so for some reason.  Maybe not able to start a new process.  Also, \nfor about 10 seconds today after the cgi's broke, the perl and C scripts both \nexecuted, and then stopped again.\n\nSo, any ideas?  I'm not sure if I found a bug in apache or not, but this is way \noutside of my knowledge base.\n\nThanks!\nRusty Nejdl\nHostmaster, Ring of Saturn", "id": 29804, "time": "2003-01-21T18:52:17Z", "creator": "rnejdl@ringofsaturn.com", "creation_time": "2003-01-21T18:52:17Z", "is_private": false}, {"count": 1, "tags": [], "text": "What was you're previous system? Which version of Perl are you using? Perhaps \nyou could paste your httpd.conf and a small none-working perl-script.", "attachment_id": null, "id": 29996, "creator": "info@orangexl.com", "time": "2003-01-24T12:16:36Z", "bug_id": 16303, "creation_time": "2003-01-24T12:16:36Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 16303, "is_private": false, "text": "The previous system was also FreeBSD 4.7 running apache with mod_php.  I'm not\nsure of the exact version (actually versions) because I continued to upgrade as\nnew releases came out.  I have tried both Perl 5.005_03 as well as 5.6.1.   Both\nproduced the same problem.\n\nAgain, there is no problem with the perl scripts.  Here's an test program for\nwhat it's worth:\n\n#!/usr/bin/perl\nprint \"Content-type: text/html\\r\\n\\r\\n\";\nprint \"blah<BR>\\n\";\n\nThe issue is that if I restart apache, the perl CGI's stop working for a period\nof around a few hours and then slowly start to work again.  (This is both perl\ncgi's and a compiled c program hello.cgi)  Even when they do start working,\nhowever, CGI's are no longer able to handle posts, only gets.  PHP on the other\nhand can handle posts and gets no problem.\n\nI still wonder what's up with the time delay on the cgi's working, though.\n\nRusty", "id": 30009, "time": "2003-01-24T14:27:58Z", "creator": "rnejdl@ringofsaturn.com", "creation_time": "2003-01-24T14:27:58Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "I'm not sure, but my personal experience is that using /r/n in perl cgi-scripts \ncan cause weird problems. But this is just from experience, and does not have a \ntheoretical basis. I also never found out why this sometimes causes problems.\n\nHowever, I believe that the HTTP-specs state that you should use \\n\\n to \nseparate the head from the body. ", "is_private": false, "id": 30194, "creator": "info@orangexl.com", "time": "2003-01-28T19:15:58Z", "bug_id": 16303, "creation_time": "2003-01-28T19:15:58Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Again, this was simply a sample of one of many scripts that worked previously. \nNormally, I use the CGI.pm's print $cgi->header function to print the correct\nheader information.  Again, the scripts only stop working when HTTP is restarted\nand then they will start working hours after the restart, for no apparent\nreason.  Even after they start running, however, POST will not work, while GET\nwill, which is completely unrelated to the http header issue.\n\nRusty", "attachment_id": null, "id": 30196, "creator": "rnejdl@ringofsaturn.com", "time": "2003-01-28T19:18:09Z", "bug_id": 16303, "creation_time": "2003-01-28T19:18:09Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 16303, "is_private": false, "text": "Sorry, I don't think I can help you in that case, I thought it could be related \nto http://nagoya.apache.org/bugzilla/show_bug.cgi?id=16578 .\n\nMy best guess is that is is a FreeBSD problem, perhaps a reinstall?\nPS: What does \"$>perl -v\" say? ", "id": 30367, "time": "2003-01-30T19:12:50Z", "creator": "info@orangexl.com", "creation_time": "2003-01-30T19:12:50Z", "attachment_id": null}, {"count": 6, "tags": [], "text": "Yeah, from reading this link that someone sent me:\n\nhttp://bugs.php.net/bug.php?id=19702\n\nI'm guessing that it's a problem with mod_php4 being built incorrectly on\nFreeBSD.  I emailed the port maintained to see what the current status is on\nthis.  I'll probably look at compiling from source manually this weekend.\n\nRusty", "attachment_id": null, "id": 30370, "creator": "rnejdl@ringofsaturn.com", "time": "2003-01-30T19:22:27Z", "bug_id": 16303, "creation_time": "2003-01-30T19:22:27Z", "is_private": false}]