[{"count": 0, "tags": [], "creator": "jfarcand@apache.org", "attachment_id": null, "is_private": false, "id": 29905, "time": "2003-01-22T22:52:53Z", "bug_id": 16347, "creation_time": "2003-01-22T22:52:53Z", "text": "HI,\n\nattached is a tentative patch that allow a Task object to run\nasychronously. I have tested the patch on Solaris and win2k and\neverything works fine (without breaking backward compatibility).\n\nTo use the functionality, you just have to add to a task the spawn\nattribute, e.g.:\n\n<exec dir=\"c:/src/jakarta-tomcat-5/build/bin/\" executable=\"sh\" spawn=\"true\">\n\nSince some task needs a couple of seconds to start/stop, I also added a\nspawnWaitUntil attribute where you can set the time required before\nmoving to the next Task.\n\nI did no wrote a <spawn> task because I think the functionality should\nbe available to every Task. For now I did not add the functionality to\nJava, Javac, Jar.\n\nLet me know what you think. At least I have something use when <gump>ing \ntomcat :-)\n\nThanks,\n\n-- Jeanfrancois\n----------------------------------------------------------------------------\nDominique Devienne wrote:\n\n>Thanks for all the hard work Jean-Francois.\n>\n>1) Could you open a new BugZilla enhancement, and attach you patch there?\n>This would allow to discuss you changes there, easily referenceable.\n>\n>2) Why did you have to modify Task.java? It doesn't seem warranted, and\n>probably will not fly well with the committers.\n\nI shouldl read the email list more often :-) In my opinion, a spawn\nfunctionality could be available not only for Exec, but also for Copy, Java,\nJavac, Jar etc. It is maybe a false assumption.....\n\n\n>\n>3) Any chance you might be able to write unit tests specific to the 'spawn'\n>mode of <exec>?\n\nWill do. I should know that working on Tomcat :-)\n\n\n>\n>Also, what happens of the spawned process stdin/stdout/stderr? Do you force\n>redirecting to a file? If I spawn a process from Ant, Ant finishes, and I\n>close the console, will the program stop and/or hang and/or its output will\n>simply be lost???\n\nthe spawnWaitUntil attribute cover partially that purpose. The\nstdin/stdout/stderr will be gathered until this value timeout. That's probably\nnot the proper behaviour if we want to gather all the stdin/stdout/stderr. The\ncurrent patch will loose the stdin/stdout/stderr. That should not be difficult\nto force ant to listen until all spawn tasks complete. A simple\nsubsriber/listener mechanim can do that.\n\nOne question. Should we kill all spawned task if ant is stopped?\n\n>\n>Thanks, --DD\n>\n\nThanks.\n\n-- Jeanfrancois"}, {"count": 1, "tags": [], "creator": "jfarcand@apache.org", "attachment_id": 4516, "id": 29906, "time": "2003-01-22T22:53:29Z", "bug_id": 16347, "creation_time": "2003-01-22T22:53:29Z", "is_private": false, "text": "Created attachment 4516\nTentative patch"}, {"count": 2, "tags": [], "creator": "jfarcand@apache.org", "attachment_id": null, "is_private": false, "id": 29910, "time": "2003-01-23T01:10:31Z", "bug_id": 16347, "creation_time": "2003-01-23T01:10:31Z", "text": "Just use the parallel task instead (works for my purpose)."}]