[{"count": 0, "tags": [], "text": "The access log filename date format is currently hardcoded in\norg.apache.catalina.valves.AccessLogValve.  I would like to be able to provide\nmy own date format in the valve descriptor in server.xml. e.g.,\n\n<Valve className=\"org.apache.catalina.valves.AccessLogValve\"\n   directory=\"logs\"  prefix=\"access_log.\"\n   dateFormat=\"yyyy.MM.dd\" suffix=\"\"\n   pattern=\"common\" resolveHosts=\"false\"/>\n\nI am willing to provide the patch for this functionality, but I have a couple of\npoints on which I would like feedback.\n\n1. In the current AccessLogValve implementation, the hardcoded date format is\nused in the filename, and it is also used to detect whether the log should be\nrotated (i.e., if the string produced by the date format changes, the log should\nrotate).  If I simply make that date format configurable, the filename will\nchange, but the rotation interval could also change, depending on how often the\nresulting date string changes.  Responses on the tomcat-dev list suggest that\nthese two concerns should be separate.  Is there any disagreement?\n\n2. If the provided date format is invalid, the creation of the SimpleDateFormat\nthrows IllegalArgumentException, which is a RuntimeException.  If the exception\nis uncaught, Tomcat startup fails, and the exception is not logged. \nIllegalArgumentException should be caught, and a new DateFormatException thrown.\n This new Exception class will also have to be created.\n\n3. If the provided date format does not result in a string which changes on a\ndaily basis, when the log rotates (daily), the new filename will be the same as\nthe old filename, simply over-writing the previous day's log.  In this case,\nthis is probably the correct behavior.  Note that if the provided date format\ncontrols both the filename and the rotation (see point 1), this problem goes away.\n\nComments?", "is_private": false, "bug_id": 16374, "id": 29966, "time": "2003-01-23T19:50:15Z", "creator": "mheinrichs@rogers.com", "creation_time": "2003-01-23T19:50:15Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "funkman@joedog.org", "is_private": false, "text": "done in tomcat5. If stable in 5, might backport to 4.1", "id": 38371, "time": "2003-06-04T17:02:46Z", "bug_id": 16374, "creation_time": "2003-06-04T17:02:46Z", "attachment_id": null}]