[{"count": 0, "attachment_id": null, "bug_id": 16407, "text": "I wrote a bit of code to emulate much of what a servlet filter does, in a bean.\nBasically, I created a ResponseWrapper that returned a custom OutputStream, from\nwhich I could capture the output. However, with Tomcat 4.1.18 and 4.0.4, I saw\nthat getWriter() was being called, but the writer was not being used (I trapped\nsome of the various output methods and saw no use, even though the writer was a\nwrapper for a ByteArrayOutputStream.) I tested this on other containers (Orion\nand Resin) and got the expected behaviour, which leads me to believe that Tomcat\nmight be doing something incorrectly.", "id": 30028, "time": "2003-01-24T20:48:27Z", "creator": "epesh@hotmail.com", "creation_time": "2003-01-24T20:48:27Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "epesh@hotmail.com", "text": "Created attachment 4543\nThis is the full source and deployable webapp used to demonstrate the bug.", "id": 30029, "time": "2003-01-24T20:49:21Z", "bug_id": 16407, "creation_time": "2003-01-24T20:49:21Z", "is_private": false, "attachment_id": 4543}, {"count": 2, "tags": [], "text": "Thanks for the test app. I have stepped through the code and the root cause is \nthe way you are constructing the PrintWriter. When creating a PrintWriter \ndirectly from an OutputStream an intermediate OutputStreamWriter is created. \nWhen, at the end of processing the included page (in PageContextImpl)\nout.flushBuffer() is called the content of the included page is written to the \nPrintWriter which in turn writes to the OutputStreamWriter but because, unlike \nflush(), flushBuffer() does not propogate through the Writers the data never \nmakes it to your OutputStream. Adding a out.flush() to the end of your \nincluded page fixes this.\n\nAFAIK Tomcat is behaving correctly in this case.", "attachment_id": null, "bug_id": 16407, "id": 53465, "time": "2004-03-04T23:09:35Z", "creator": "markt@apache.org", "creation_time": "2004-03-04T23:09:35Z", "is_private": false}]