[{"count": 0, "tags": [], "bug_id": 16428, "attachment_id": null, "id": 30057, "time": "2003-01-26T03:50:38Z", "creator": "per@velschow.com", "creation_time": "2003-01-26T03:50:38Z", "is_private": false, "text": "Now that Ant has chosen to define a lot of optional tasks via the optional.jar \nin the ant/lib directory, we are forced to put the required 3rd party libraries \nin that directory. To me that is work only half done. \n\nI do understand that the Ant distribution cannot include all the required \nlibraries (due to license and maintenance issues). But this requirement is the \nonly thing that prevents us from checking all the needed libraries for a \nproject into a source control system and simply asking users to checkout and \ntype ant. \n\nOk, that was the problem. Here is how I think it could be solved. There are a \nfew ways as I see it. \n\nOption 1) AFAIK, Ant implements its own ClassLoader. Wouldn't it be possible to \nsomehow pass the location of required libraries to that class loader at startup \ntime? \n\nOption 2) Extend the Ant wrapper scripts with a classpath argument that will be \nappended to the the classpath before executing Ant. \n\nOption 3) Extend the Ant wrapper scripts so that it will include a .antrc from \nthe directory of the build file. \n\nThe first option is in my view the right way of doing it. The second and third \nare a work-arounds that for most cases would probablt be good enough. \n\nI am aware that you can have the wrapper scripts read a .antrc from the user's \nhome directory. But this is not good enough because different projects have \ndifferent library requirements."}, {"count": 1, "tags": [], "bug_id": 16428, "attachment_id": null, "text": "Ant 1.6 uses a new Launcher. I adds all JARs in the ANT_HOME/lib, \nUSERHOME/.ant/lib and all JARs added via -jar option to Ant´s classpath.", "id": 56093, "time": "2004-04-20T13:31:10Z", "creator": "jan@materne.de", "creation_time": "2004-04-20T13:31:10Z", "is_private": false}]