[{"count": 0, "tags": [], "bug_id": 16466, "attachment_id": null, "text": "When I click the online ANT API documentation from the Ant home page I get the \nfollowing error message:\n\n\n   \"Apache Ant API has not been generated \"", "id": 30123, "time": "2003-01-27T17:56:30Z", "creator": "Tracy.Monteith@level3.com", "creation_time": "2003-01-27T17:56:30Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 16466, "is_private": false, "id": 30152, "time": "2003-01-28T05:36:40Z", "creator": "conor@apache.org", "creation_time": "2003-01-28T05:36:40Z", "tags": [], "text": "Why do you need the API docs online? \n\nWith the disk that houses the Ant site currently at 98% utilisation, and the\nfact that the version-appropriate API docs are included in all the binary\ndownloads, we need a good use case for requiring the docs online"}, {"text": "I think on-line API docs are just a given for a serious open source project.\nIt should be the last stable release - serious developers can always get the\nlatest - so it should be the \"for the masses\" version.\n\nIn a way it is advertising to the world that we are\nhere and we are documented (ready for prime time)!\n\nUse cases: Many IDEs have docs as separate downloads but ant built-in.\nStudents learning Java will likely be given an environment which will\nallow them to surf the web and run Java programs but it might not be\neasy for them to see docs for things like ant.  Convincing managers to\nuse ant will be facilitated if you can show them web sites with doco.", "tags": [], "bug_id": 16466, "is_private": false, "count": 2, "id": 30153, "time": "2003-01-28T06:08:37Z", "creator": "king@asert.com.au", "creation_time": "2003-01-28T06:08:37Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 16466, "text": "But the masses, as you call them, are probably not developing Ant tasks in Java\n- they are developing Ant build files. What they need is the task reference\nonline and that is there. \n\nhttp://ant.apache.org/manual/index.html\n\nThe only people who need API docs are task (and listener, etc) developers. Such\npeople will, I assume, have installed Ant and the API reference will be right\nthere on their harddisk.\n\nHaving API docs online would be nice but there are resource constraints at this\ntime. I will try to link to Ernest's online copy.\n", "id": 30154, "time": "2003-01-28T06:27:08Z", "creator": "conor@apache.org", "creation_time": "2003-01-28T06:27:08Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "gus.heck@olin.edu", "text": "If the disk is at 98%  you are about 8% overdue for a new/added disk anyway.\nReally sort of silly to let hardware get this far maxed. I don't know what sort\nof system is serving the ant pages, but in general disk space is awfully cheap\nthese days. How much would it cost to add a disk anyway? If the machine hosts a\nbunch of projects (as I suspect) they could all chip in... \n\nPost the specs and you might even get a donation. Disk space is only an excuse\nin the short term.", "id": 30177, "time": "2003-01-28T15:57:40Z", "bug_id": 16466, "creation_time": "2003-01-28T15:57:40Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 16466, "attachment_id": null, "text": "We're all development professionals here.  We must consider the question of \nmanaging user expectations.  When a user sees an link labeled \"API\" he expects \nto be given the API.  Here API isn't available for one of the following \nreasons:    technical-inadequate drive space.\nnon-technical - The organizational policy that should be looking elsewhere.\n\nWhen the user sees \"API not generated\", it appears to be a bug and \nexpectations are not met.  \n\nAs a strong proponent of opensource software, I believe should maintain our \nweb pages to the highest professional level possible.  That said, I recommend \nthe fix to be one of the following:\n1.  Fix the link\n2.  Remove the link\n3.  When clicked, Direct the user elsewhere.\n\nHope this helps.\n\n\n\n", "id": 30203, "time": "2003-01-28T20:37:57Z", "creator": "Tracy.Monteith@level3.com", "creation_time": "2003-01-28T20:37:57Z", "is_private": false}, {"count": 6, "attachment_id": null, "bug_id": 16466, "is_private": false, "id": 30245, "time": "2003-01-29T09:56:30Z", "creator": "conor@apache.org", "creation_time": "2003-01-29T09:56:30Z", "tags": [], "text": "The page in question has been updated to provide more explanation and to point\nto the latest API docs generated by Gump. I think this is OK now.\n\nAs for the disk issue, all I can say is that the volunteers who keep Apache\nrunning do a great job giving us a highly available service. The space issue is\nbeing addressed and it is more than just an issue of disk drive prices. \n\nIf anyone really does want to donate to the Apache Software Foundation, you'll\nfind more information here\nhttp://www.apache.org/foundation/contributing.html"}]