[{"count": 0, "tags": [], "bug_id": 16579, "text": "Could the page layout for Tomcat documentation please be reconsidered?\nIt stops _all_ regular text from wrapping to fit the window when _any_ \nline of fixed-width text is wider than the window. \n\nSpecifically, using an HTML table to put navigation links to the left of\nthe main page text forces the browser to ignore the width of the browser \nwindow and wrap wrappable text to match the width of the longest fixed-width\nline.  Then, when the user uses a window that is not as wide as the longest\nline, the user must scroll horizontally to read _every_ line.  \n\n(If the browser weren't constrained by the table, it could wrap all the\nwrappable text to fit the window, and only the long, fixed-width lines \nwould require horizontal scrolling to see.)\n\n\nI realize that avoiding putting the body text inside a table may prevent\nhaving a list of navigation links on the left.\n\nHowever, PLEASE re-consider the layout.  \n\nOne option is to put navigation elements at the top of the page.  (You don't\nneed a table to do that, so the body text doesn't need to be in a table, so\nwrappable text can still wrap to fit the browser window.)\n\nAnother thing to consider is whether every detail page really needs a list of \nlinks to every sibling page.  (Books don't have a copy of the table of contents\nat the start of each chapter.)  Each detail page needs only an up link to one\ncommon index page that lists the various detail pages. (Of course, you'd\nprobably have more links that just that absolute minimum.))\n\nConsider some precedents:\n\nSun's JavaDoc layout for a class:\n- Class description text and member description text wraps to fit even very\n  narrow windows, even if summary tables don't fit within the window.\n  (Also, notice that each summary table is independent.  If one is too wide\n  and requires horizontal scrolling, the others can still fit.)\n- The page for one class is not cluttered with links to a bunch of sibling\n  classes.\n- The page has an up link to the page for the containing package, which does\n  list the sibling classes of the given class.\n- The navigation is on the top, not the left.  (That allows most of the text\n  to wrap to fit within the window width.)\n\nLinux HOW-TO documents in HTML generated from DocBook:\n- Wrappable text wraps to fit the browser window, even if some fixed-width text\n  or images are wider.\n- There are some basic Next/Previous/section number links at the top.\n- The pages are not cluttered with multiple links to sibling documents, just\n  a simple up link or two.\n\n\n\nRelatedly, when thinking about page widths, please don't assume that all\nreaders use full-screen browser windows.  Especially for technical \ndocumentation, readers are likely to be reading documentation in one window\nand using it (e.g., editing code, running some tool) in another window.\n\nAlso note how wide pages such as\nhttp://jakarta.apache.org/tomcat/tomcat-4.0-doc/jndi-resources-howto.html are.\nOn my system, that page requires a 1086-pixel-wide browser window to display\nthe entire width!  Display just the body does fit in 800 pixels, but you'd\nneed 1600 pixels across to see the text without scrolling on one side of your\nscreen and edit something in a same-sized window on the other side.", "id": 30324, "time": "2003-01-30T05:16:01Z", "creator": "dsb@smart.net", "creation_time": "2003-01-30T05:16:01Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 16579, "text": "Yes, having to scroll horizontally is one of the top annoyances in web browsing.\n\nSee also bug #15915 that I added some time ago, which is also concerned with\ntable-based layout. Even if using a table doesn't automatically mean that the\ntext cannot wrap, a standards-based layout using CSS for presentation has many\nbenefits for all kinds of users. As you can see in the attachment I created for\nthat bug, the visual appearance of the page in standards compliant browsers does\nnot have to change. However, the page becomes more accessible for users in\nnon-visual browsing situations, as well as in visual browsing environments from\nPDAs to large screens.\n\nI'm willing to work on this, but so far haven't had any feedback on this matter.\n", "id": 30326, "time": "2003-01-30T09:23:03Z", "creator": "seibert@cs.uni-bonn.de", "creation_time": "2003-01-30T09:23:03Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 16579, "text": "I agree that the changes described here are worthy of consideration. It should \nbe noted that the chances of changes being made to documentation are greatly \nincreased if a patch is provided.\n\nFor your information, the tomcat docs are written in xml and then transformed \ninto static html. Patches need to be against the .xml files or tomcat-docs.xsl\nhttp://cvs.apache.org/viewcvs.cgi/jakarta-tomcat-4.0/webapps/tomcat-docs/", "id": 53557, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2004-03-06T16:36:00Z", "time": "2004-03-06T16:36:00Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 16579, "attachment_id": null, "text": "Still want to look at this at some point. Moving to Tomcat 7. Some more things to consider:\n- Tomcat 7 docs\n- Tomcat website\n- the new ASF CMS\n- the new Tomcat 7 start page", "id": 144793, "time": "2011-03-07T05:18:25Z", "creator": "markt@apache.org", "creation_time": "2011-03-07T05:18:25Z", "is_private": false}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "The duplicate has a better description and some clear action points so lets track progress there.\n\n*** This bug has been marked as a duplicate of bug 55383 ***", "id": 169279, "time": "2013-08-07T21:21:52Z", "bug_id": 16579, "creation_time": "2013-08-07T21:21:52Z", "is_private": false}]