[{"count": 0, "tags": [], "text": "Add a sentence which indicates that the glob mapper is case sensitive.\n\nFor instance, this mapper:\n\n<mapper type=\"glob\" from=\"*.ini\" to=\"*.ini.bak\"/>\n\nwould map \"xxx.ini\" but will not map \"XXX.INI\".", "is_private": false, "bug_id": 16684, "id": 30527, "time": "2003-02-02T23:27:34Z", "creator": "gjfdh@yahoo.com", "creation_time": "2003-02-02T23:27:34Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "kovesp@sympatico.ca", "attachment_id": null, "text": "This BTW is a good argument for allowing multiple mappers.  It is also an \nargument for allow \"attributes\" to be passed to specific implementations.\n\nThe simplest way that I see to make these ideas usable everywhere that mappers \nare allowed\n1. For multiple mappers: introduce a mapper element without any attributes to \nact as a container:\n<mapper>\n   <mapper type=\"glob\" from=\"*.ini\" to=\"*.ini.bak\"/>\n   <mapper type=\"glob\" from=\"*.INI\" to \"*.INI.bak\"/>\n</mapper>\nSemantics could be either a. cummulative: mappers are applied in the given \nsequence; if all return null, the mapper container returns null; otherwise a \nmapper later in the sequence is applied to the result of earlier mappers, \nexcept ones returning null or empty array are skipped; b. exclusive: mappers \nare applied in undefined sequence, the result of the first to return non-null \nis used (in other words, if the mappers are not disjoint the result is \nundefined).\n\n2. For mapper specific attributes: introduce a new attribute to the mapper \nelement called props. The value is a sequence of name='value' items separated \nby comma, e.g., props=\"casesensitive='no',prefix='hello'\". Introduce a \nsubinterface of FileNameMapper, FileNameMapperWithProperties (unless you want \nto call it FileNameMapper2 in the MS tradition B-{) ). It has a single new \nmethod\n\nvoid setProperties(Properties props)\n\nThis method is caledd called on mappers implementing the new interface with \nthe value of the props attribute translated into a Properties instance. \n\nThen with a suitably updated glob mapper we could have:\n<mapper type=\"glob\" from=\"*.ini\" to=\"*.ini.bak\" props=\"casesensitive='no'\"/>\n", "id": 36637, "time": "2003-05-04T23:31:32Z", "bug_id": 16684, "creation_time": "2003-05-04T23:31:32Z", "is_private": false}]