[{"count": 0, "tags": [], "bug_id": 16699, "attachment_id": null, "is_private": false, "id": 30550, "time": "2003-02-03T12:25:16Z", "creator": "s.i.warhurst@rl.ac.uk", "creation_time": "2003-02-03T12:25:16Z", "text": "We have had a problem where a user clicks on a link and they get the following \nerrors (2 browsers tested - more prominent on Netscape):\n\n1) On Internet Explorer 5.5 they get a \"page cannot be found\" page, yet\nsometimes if you hit the back button on the browser the page you were trying\nto navigate to is actually there in the cache!\n\n2) If they are using Netscape 4.79 they get a \"network error\" OK dialog box \ncome up,\neven though the page they were trying to navigate to actually comes up\nbeneath.\n\nI don't know much about the inner workings of clients/web servers but it's\nalmost as if the client makes that initial \"hello\" contact with the web\nserver, starts retrieving the document (and indeed often gets it) but there\nis no \"there you are, you've got it now - goodbye\" message back from the\nserver and therefore the client thinks there was an error and throws up page\ncannot be found or network error.\n\nThe problem seems to happen more when the server is under heavier load but is \nintermittent. It also seems to have only started happening since about Apache \nversion 2.035 or 2.036, though that may be coincidental.\n\nIn the error logs, there are lots of (>500 a day) lines like this:\n\n\"[date/time] [warn] (xxxxxx)The specified network name is no longer \navailable.  : winnt_accept: Asynchronous AcceptEx failed.\"\n\nThe server we use is a Pentium 4 2.2Ghz / 1 gig RAM system with a SCSI disk and \nthe O/S is Windows 2000 Server SP2. It's connected to a fast network which is \nin turn connected to the net via a >2Gb pipe."}, {"attachment_id": null, "tags": [], "bug_id": 16699, "is_private": false, "count": 1, "id": 30561, "time": "2003-02-03T14:49:04Z", "creator": "stephan.hochberger@roccas.de", "creation_time": "2003-02-03T14:49:04Z", "text": "I encountered a similar problem.\nMost time the server performs fine, but occasionally responses are extremely \nslow (up to 20 seconds) or return never (either local requests, via lan or \nleased line).\nChecking logs there are allways \"winnt_accept: Asynchronous AcceptEx failed.\" \n(OS-Error 64, ERROR_NETNAME_DELETED) errors arround when this occurs.\n\nThis happens preferably during times of \"high\" load (average 10req/sec, peak 40 \nsec/sec). Anyway Apache-requests and system-load are far below critical values \nor maximum settings.\n\nRunning a test-script (1 request every minute) for some days we receive the \nerror during daytime about 2 times per hour. With regular load near zero we \nstill receive the error, but only about one time in 5 hours.\nNetwork trace shows correct initialization and the HTTP-Get with ACK from the \nserver. The response returns never or very late.\nThe winnt_accept is logged with the Timestamp of the response, and in most \ncases there are other identical messages arround within a few sconds.\n\nOS is Win2k Server SP2"}, {"count": 2, "text": "Yes I am also experiencing this problem on a windows 2000 SP3 site with Apache \n2.0.44. Load wasn't even that high, it seemed more to be related to how long \nthe server was up. I left the server for about 3 hours with light load (3-5 \nreq/sec) and when I came back to it, the server was not responding (site could \nnot be found error in IE) and the logfile was full of these errors.\n\nThe apache service keeps running through this, just doesnt serve anything.", "bug_id": 16699, "attachment_id": null, "id": 33424, "time": "2003-03-19T09:36:58Z", "creator": "carl@voodoomedia.co.uk", "creation_time": "2003-03-19T09:36:58Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 16699, "attachment_id": null, "id": 58551, "time": "2004-06-02T14:47:51Z", "creator": "kris.renaud@cgi.com", "creation_time": "2004-06-02T14:47:51Z", "is_private": false, "text": "I have encountered identical problems running Apache 2.0.47 on Win2K, SP4, \n2xCPU@1.0GHz, 2GB RAM.  Max simultaneous users is 50. CPU never spikes higher \nthan 5% throughout the day.\nRunning Apache essentially as a Proxy Pass to an Application Server, using the \nrewrite_module to rewite pages, adding 8 hour expiry on static pages and \nProxPass'ing dynamic contect to the Application Server.  The exact error is\n\n(OS 64)The specified network name is no longer available.  : \ncore_output_filter: writing data to the network\n\nThis occurs approx 200 times per day but without rhyme or reason, the user \neither recieves a blank grey page or a \"page cannot be displayed\" error. \nHitting refresh or back will return them to a valid page, where they can then \nretry.  We have investigated all aspects of the network to ensure there are no \nissues and have localized the error to just the Apache server. We have even \nresorted to restarting the Apache service daily, without affecting the \nfrequency of the errors.  The error does not appear to be related to high usage \nas it has manifested with only a single user on the server."}, {"count": 4, "text": "For any AcceptEx-like error messages, upgrade to 2.0.49 and try the\nWin32DisableAcceptEx directive:\n\nhttp://httpd.apache.org/docs-2.0/mod/mpm_winnt.html#win32disableacceptex", "bug_id": 16699, "attachment_id": null, "id": 58686, "time": "2004-06-03T22:46:08Z", "creator": "jorton@redhat.com", "creation_time": "2004-06-03T22:46:08Z", "tags": [], "is_private": false}]