[{"count": 0, "tags": [], "creator": "smagoun@mac.com", "text": "I'm trying to use the copy task in conjunction with a Filterset. My source\ndirectory contains both binary and text files, and I want all of the files\ncopied. I found that using using the filterset causes corruption in my binary\nfiles (most jpgs). Nothing in the ant documentation indicates that I can't do this.\n\nI've enclosed a very simple test case: it's a build script and an image to be\ncopied. To use it, unpack + run the build script. It will copy a .jpg from one\ndirectory to another using the copy task and a filterset. The new, filtered file\nwill be corrupt (use any image viewer or web browser to open it).\n\nThe behavior is 100% repeatable and affects all of the binary files I've tried\n(about 20 so far). Changing the arguments to the filter task doesn't seem to\naffect the bug.\n\nThere are workarounds (use the copy and replace tasks separately).\n\nI'm running Ant 1.5.1 on Mac OS X 10.2.3 with JDK 1.3.1.", "id": 30685, "time": "2003-02-04T21:19:11Z", "bug_id": 16780, "creation_time": "2003-02-04T21:19:11Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 16780, "text": "Created attachment 4729\nZipped-up test case with build script and example file", "id": 30686, "time": "2003-02-04T21:20:23Z", "creator": "smagoun@mac.com", "creation_time": "2003-02-04T21:20:23Z", "is_private": false, "attachment_id": 4729}, {"count": 2, "tags": [], "bug_id": 16780, "text": "In Using Ant, under, the heading \"Token Filters\", it does say, \"Warning: If you\ncopy binary files with filtering turned on, you can corrupt the files. This\nfeature should be used with text files only.\"", "id": 30697, "time": "2003-02-04T22:32:31Z", "creator": "snewton@io.com", "creation_time": "2003-02-04T22:32:31Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "gus.heck@olin.edu", "is_private": false, "text": "I beleive filters are only intended for use with text files.\n\nI think the normal way to handle this is to have 2 copy commands, one that\nexcludes the binaries and employs the filterset, The other includes only the\nbinaries and does not employ the filterset. Are you unable to create an excludes\nthat identifies your binaries?", "id": 30698, "time": "2003-02-04T22:36:15Z", "bug_id": 16780, "creation_time": "2003-02-04T22:36:15Z", "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 16780, "is_private": false, "id": 30701, "time": "2003-02-04T23:11:11Z", "creator": "smagoun@mac.com", "creation_time": "2003-02-04T23:11:11Z", "tags": [], "text": "There's absolutely nothing in the Filterset docs that indicates that they should\nonly be used on text files. I appreciate that there's a warning (bold text,\neven!) in the \"Using Ant:Token Filters\" section. That section doesn't mention\nfiltersets, though, so anyone who greps for \"filterset\" will miss the warning. \n\nFurthermore, there's no warning on the Filterset documentation page itself\n/manual/CoreTypes/filterset.html) or even in the docs for the copy task.\n\nThe \"Using Ant\" page is very helpful for newbies, but for people who've been\nusing ant for a long time the actual task docs are the place to start, not the\n\"Using Ant\" page.\n\nMy request: If filterset is indeed behaving properly by munging my binary files,\nplease document that behavior on the filterset page of the manual! IMHO that\nbehavior violates the Law of Least Astonishment, and therefore merits some\ndocumentation.\n\nGus: I can make the copy in 2 passes (binaries, then text-only), but that's a\nreal pain to do and it's fragile. It's also twice as much code to maintain.\nInstead I copy everything, and then used the replace task to do the filtering.\nIt's a bit ugly, but it works. So much for filtersets..."}, {"count": 5, "tags": [], "creator": "jakarta@ehatchersolutions.com", "text": "I would argue that its your directory structure that needs to be refactored also.  If you have binary content in your source directory, that seems more the issue here than filtersets not being friendly enough.  Separate the binary files out of your source tree and treat them separately - its a better practice.", "id": 30711, "time": "2003-02-05T05:51:40Z", "bug_id": 16780, "creation_time": "2003-02-05T05:51:40Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 16780, "text": "I've added appropriate warnings to the <copy> and <filterset> documentation.", "id": 30741, "time": "2003-02-05T13:16:59Z", "creator": "conor@apache.org", "creation_time": "2003-02-05T13:16:59Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "text": "*** Bug 25047 has been marked as a duplicate of this bug. ***", "is_private": false, "bug_id": 16780, "id": 48236, "time": "2003-11-27T10:04:47Z", "creator": "peter.reilly@corvil.com", "creation_time": "2003-11-27T10:04:47Z", "attachment_id": null}]