[{"count": 0, "tags": [], "creator": "blackened@austin.rr.com", "attachment_id": null, "is_private": false, "id": 30863, "time": "2003-02-07T05:11:20Z", "bug_id": 16867, "creation_time": "2003-02-07T05:11:20Z", "text": "I guess Ant doesn't work in Windows Millenium, because when I pull up a command \nprompt and try to run ant, it scrolls by a bunch of crap which is basically \nstandard error output.  Because it's Windows, command prompt doesn't have a \nscroll bar.  Because it's standard error, I can't redirect the output to a \nfile.  Because -logfile doesn't print standard error, I can't use command line \nswitches to save the output.  Basically, unless Ant produces less than like 20 \nlines of output, or unless it starts printing output to standard output, or \nunless I find an alternative to dos command prompt that isn't a piece of shit, \nI can't use Ant on Windows.  And I'm pissed because I just wasted 2 hours \ntrying to find a way around this, searching google groups, downloading command \nprompt alternatives, and nothing f***ing works.  You guys should really \nconsider redoing the output of Ant so that it works under Windows if you want \nWindows users to use it, because not everyone has the latest and greatest \nwindows with scrollbar support in command prompt.  Windows f***ing sucks and if \nit wasn't for the project's need to work on Windows, I would have ditched it a \nlong time ago.  I can't believe how rediculous this is, a program that prints \noutput that you can't read.  Sorry for my frustration but it really, really, \nreally really really pisses me off.."}, {"id": 30864, "tags": [], "bug_id": 16867, "is_private": false, "count": 1, "text": "\n\n*** This bug has been marked as a duplicate of 13582 ***", "time": "2003-02-07T05:19:43Z", "creator": "conor@apache.org", "creation_time": "2003-02-07T05:19:43Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 16867, "attachment_id": null, "text": "How is this a duplicate?  13582 has to do with ant.bat checking for paths and \nwhether or not files/directories exist under Windows 98.  My bug has to do with \nnot being able to see the output when I run ant because it scrolls down a ton \nof text using standard error, meaning that (1) I can't scroll back because \nWindows sucks, and (2) I can't redirect the stderr output to a file because \nwindows sucks.  I don't see what this has to do with 13582.  I think it's a bug \nbecause Ant should provide a means for command output under Windows \n95/98/Millenium, and scrolling a bunch of text down a command prompt window so \nyou can't read it doesn't seem like the route to go.", "id": 30868, "time": "2003-02-07T05:57:25Z", "creator": "blackened@austin.rr.com", "creation_time": "2003-02-07T05:57:25Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 16867, "attachment_id": null, "is_private": false, "id": 30869, "time": "2003-02-07T06:14:14Z", "creator": "conor@apache.org", "creation_time": "2003-02-07T06:14:14Z", "text": "You said:\n\"I guess Ant doesn't work in Windows Millenium, because when I pull up a command \nprompt and try to run ant, it scrolls by a bunch of crap which is basically \nstandard error output. \"\n\nMy assumption is that this results from the problem in ant.bat. If you make that\nfix, Ant should work. You should then be able to use -logfile. If this does not\nwork for you, I apologize for the incorrect assumption\n\nAs for Ant producing too much output for Windows ME, I'm afraid that is a\nlimitation of Windows ME. There are many other limitations to Windows ME and it\nis not feasible for Ant to try and fix all of them.\n\nSome alternatives would be to install cygwin and use the rxvt terminal which\ncomes with a scrollbar or to use an editor such as jEdit (free) or UltraEdit\nwhich can store the output into a window with a scroll bar."}, {"count": 4, "tags": [], "creator": "levylambert@tiscali-dsl.de", "attachment_id": null, "is_private": false, "id": 30870, "time": "2003-02-07T07:54:48Z", "bug_id": 16867, "creation_time": "2003-02-07T07:54:48Z", "text": "Can you also try to capture the standard error output if you do :\nant  2> myerrors.txt\nAnother \npossibility would be that you install emacs or xemacs on your PC, then run ant from the shell buffer \nof emacs, which should be big enough and lets you scroll through the results.\nOther editors \nmight also have big shell buffers. For instance UltraEdit32 can run commands for you and display \nboth stderr and stdout in the resulting buffer."}, {"count": 5, "tags": [], "bug_id": 16867, "attachment_id": null, "is_private": false, "id": 30871, "time": "2003-02-07T08:35:49Z", "creator": "jakarta@ehatchersolutions.com", "creation_time": "2003-02-07T08:35:49Z", "text": "I don't know WindowsME, but in Windows 95/98/NT/2000 (all of which I've used), it requires you set the vertical buffer to something larger than the screen height and scroll bars will then appear.  I'm assuming WindowsME has the same feature."}, {"count": 6, "tags": [], "creator": "levylambert@tiscali-dsl.de", "attachment_id": null, "is_private": false, "id": 30872, "time": "2003-02-07T08:46:27Z", "bug_id": 16867, "creation_time": "2003-02-07T08:46:27Z", "text": "Erik is right, you should be able to right click on the title bar of your DOS Command window, then a \npopup menu appears. If you choose from this menu \"Properties\", you can adjust the size of the \nwindow and more importantly the size of the buffer up to 9999 lines."}, {"count": 7, "tags": [], "bug_id": 16867, "attachment_id": null, "id": 30875, "time": "2003-02-07T09:55:34Z", "creator": "conor@apache.org", "creation_time": "2003-02-07T09:55:34Z", "is_private": false, "text": "No, unfortunately in Windows 98 (and I suspect 95 and ME) it is not possible to \nhave a scroll bar on a command window. You can set the window to a maximum of \n50 lines."}, {"count": 8, "tags": [], "bug_id": 16867, "is_private": false, "text": "Yes, I tried multiple options under properties, to no avail.  I haven't tried \nredirecting stderr with 2>, so maybe I should give that a try.  I thought that \nwas a unix-only thing, although I did try >& (used in csh for stderr).\n\nUsing UltraEdit32 or whatever sounds like a good idea too, I'll try that.  I \nguess I've been working in unix for too long, so it's extremely painful to deal \nwith Windows command-line after getting spoiled by all the features of unix.\n\nThanks for the help,\nDustin", "id": 30888, "time": "2003-02-07T12:42:18Z", "creator": "blackened@austin.rr.com", "creation_time": "2003-02-07T12:42:18Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 16867, "attachment_id": null, "is_private": false, "id": 30911, "time": "2003-02-07T18:16:31Z", "creator": "stevel@apache.org", "creation_time": "2003-02-07T18:16:31Z", "text": "I love titles that blame us, but I guess you are just venting your\ndisatisfaction with WinME/\n\nI agree the Windows command line sucks, and I agree we didnt take it into\naccount. But we did and still do jump through inordinate hoops in the batch file\nto make sure that Ant runs under win9x, which is a lot harder than you think, as\nthe .BAT execution sucks badly too. \n\nThe rest, we leave to you\n\nCan I suggest.\n\n1. ant | more  to get paged stuff\n2. 4DOS command shell (very nice add on)\n3. run ant inside an IDE \n4. antidote (feel free to help)\n\nAlso, what was it you expected? That we should recognise that win9x and suddenly\nadd a fancy gui with scroll bars just to make your life easier? But what about\neveryone running ant as part of some batch mode?\n\n-Steve\n\n\n\n"}, {"count": 10, "tags": [], "bug_id": 16867, "is_private": false, "text": "Nope, I wouldn't expect you to improve Windows or include an Ant-specific\nservice pack for Windows with Ant, that's silly.  But when your program doesn't\nwork, or when a user cannot see output, I think you have a serious problem. \nImagine if you wrote a Windows application that only ran at a resolution of\n1280x1024 and announced to the world that anyone with Windows can run it!  But\nwhen users downloaded it, some of them realized they couldn't run it because it\nwas made to run at only 1280x1024.  Well, I would say that's a serious flaw with\nyour software, and unless there was a really good reason for forcing 1280x1024\nresolution for your software, it's probably a dumb idea.  \n\nExcuse the crappy analogy, but nonetheless, I think it applies.  If you write an\napp for Windows but don't take into account the limitations of Windows, you're\nsetting yourself and your users up for trouble.  Trust me, I'm not trying to\nbash Ant, I know you guys wrote some code that I'm able to download for free and\nplay with, so obviously if I don't like it, you have no obligation to support\nme.  It was simply a recommendation, that if you're going to design a program\nfor windows that's dependent on the evil MSDOS Command Prompt, then either\nadjust the output of Ant so that it accomodates this limitation, or provide some\nlinks or something to some software that will enable Ant to run a little more\ngracefully under Windows.  In my case, I was running ant, but getting an error\nmessage that I couldn't understand because it was beyond the border of my\ncommand prompt.  That's a serious problem for Windows users running Ant.  In\nmost cases piping output or doing |more will work, but in this case, it didn't.\n For whatever reason, I guess stderr doesn't pipe to the more command.\n\nSo don't take it as me bashing your software, but instead read it as me making a\nrecommendation as a frustrated user.  I know Windows sucks for things like this,\nand it must be a real headache, I sympathize.  But nothing would be better than\nto have Ant performing as the most robust build system on all platforms.\n\nThanks again for all the recommendations, and continue the good work.\n\n-Dustin", "id": 30915, "time": "2003-02-07T20:02:58Z", "creator": "blackened@austin.rr.com", "creation_time": "2003-02-07T20:02:58Z", "attachment_id": null}]