[{"count": 0, "tags": [], "bug_id": 16874, "attachment_id": null, "text": "The expire(boolean notify) method of StandardSession is not safely synchronized.\n\n    public void expire(boolean notify) {\n\n        // Mark this session as \"being expired\" if needed\n        if (expiring)\n            return;\n        expiring = true;\n\n        ...\n\n        expiring = false;\n\n    }\n\nIn my opinion, it is possible that the expire() method can call twice. As a\nresult of that, the same session object will be added in the recycled list twice.\nSo the generateSession() of the ManagerBase will get the same session object\ntwice. As the result the same session will be shared by different clients!\n\nSo it were nice, if somebody with more background can review the source files\nand comment this issue.", "id": 30883, "time": "2003-02-07T11:32:25Z", "creator": "thomas.siedschlag@gmx.net", "creation_time": "2003-02-07T11:32:25Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 16874, "is_private": false, "count": 1, "id": 30976, "time": "2003-02-10T01:27:17Z", "creator": "remm@apache.org", "creation_time": "2003-02-10T01:27:17Z", "text": "That method doesn't look very well synced indeed. However, I don't see many\ncases where a race condition can occur on that particular method, and how the\nsession can then get recycled twice. If you experienced the condition, I can add\na sync in the expire method (which is the only place which calls recycle).\nSession recycling doesn't seem terribly useful overall (generation of the\nsession id is likely to be at least as expensive as a few collection creation ...)."}, {"count": 2, "tags": [], "creator": "thomas.siedschlag@gmx.net", "text": "Thanks for your review Remy.\n\nI agree that this bug seems to be a theoretical problem.\n\nBut for a while we had a problem in production. Two users (with different\nbrowsers) had the same session. We found this bug after an intensive code review\nof our application sources and the sources of tomcat.\n\nI can't say, that our problem is definitly related with this bug, because we\ncan't reproduce it.\n\nOn the other side, I think it is a very important, that the session management\nis also theoretical safe.\n\nCan I introduce you with another problem, that we can reproduce? It is also\nrelated with recycling of sessions.\n\nhttp://nagoya.apache.org/bugzilla/show_bug.cgi?id=16705\n\nThat's why I suggest to create always a new session object instead of recycling\nsession objects. What do you mean?", "id": 31002, "time": "2003-02-10T13:59:18Z", "bug_id": 16874, "creation_time": "2003-02-10T13:59:18Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "vladimir.prodan@antwerpes.de", "text": "I have the same problem with two users accessing a servlet from different \ncomputers and getting the same session. I can't regenerate this situation but \nit's happening from time to time.", "count": 3, "id": 35404, "time": "2003-04-17T11:23:38Z", "bug_id": 16874, "creation_time": "2003-04-17T11:23:38Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "remm@apache.org", "text": "Session recycling has been removed in Tomcat 4.1.24, due to lack of any real\nbenefit, and possible (although never actually reproduced) problems.", "count": 4, "id": 35406, "time": "2003-04-17T11:34:07Z", "bug_id": 16874, "creation_time": "2003-04-17T11:34:07Z", "is_private": false}, {"count": 5, "tags": [], "creator": "nicechildmoony@yahoo.com", "attachment_id": null, "text": "We are still getting the same problem as Thomas Siedschlag mentioned earlier in \n4.1.24.", "id": 89045, "time": "2006-05-11T15:31:15Z", "bug_id": 16874, "creation_time": "2006-05-11T15:31:15Z", "is_private": false}, {"count": 6, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 89060, "time": "2006-05-12T01:10:24Z", "bug_id": 16874, "creation_time": "2006-05-12T01:10:24Z", "is_private": false, "text": "Session recycling is disabled in 4.1.24 onwards so you can't be seeing the same\nproblem (you could of course be seeing the same symptoms). Since this must be a\nnew issue, please open a new bugzilla issue. You will need to provide sufficient\ninformation for your issue to be reproduced in order for the issue to be\ninvestigated."}]