[{"count": 0, "tags": [], "bug_id": 16886, "text": "Assume one has a parameter in the HTTP Request Defaults object with a name \nof \"store\" and an value of \"666.\"  Later, during recording, one might record a \nrequest that contains store 666.\n\nIt would make for easier script maintenance if the \"store\" \"666\" information \nwere not recorded in the specific request.  It is unnecessary, because it is \nalready in the defaults object.", "id": 30909, "time": "2003-02-07T17:21:30Z", "creator": "kcassell@360Commerce.com", "creation_time": "2003-02-07T17:21:30Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "alf@i100.no", "text": "I think this is almost handled by the Proxy Server today.\nFrom\nhttp://jakarta.apache.org/jmeter/usermanual/component_reference.html#HTTP_Proxy_Server\n\"\n If the HTTP Proxy Server finds enabled HTTP Request Defaults  directly within\nthe controller where samples are being stored, or directly within any of its\nparent controllers, the recorded samples will have empty fields for the default\nvalues you specified. You may further control this behaviour by placing an HTTP\nRequest Defaults element directly within the HTTP Proxy Server, whose non-blank\nvalues will override those in the other HTTP Request Defaults. See  Best\nPractices with the Proxy Server  for more info.\n\nSimilarly, if the HTTP Proxy Server finds User Defined Variables (UDV) directly\nwithin the controller where samples are being stored, or directly within any of\nits parent controllers, the recorded samples will have any occurences of the\nvalues of those variables replaced by the corresponding variable. Again, you can\nplace User Defined Variables directly within the HTTP Proxy Server to override\nthe values to be replaced. See Best Practices with the Proxy Server for more info. \n\"\n\nFrom the text from the manual, I thought that the functionality in this bug was\npresent. But when doing some testing, I found that it actually is not working.\n\nOne thing that does not seems like it is supported by the HTTP Proxy Server, is\nif you define some parameters in the \"Send Parameters With the Request:\" table\nin the \"HTTP Request Defaults\", and put that \"HTTP Request Defaults\" inside the\n\"Target Controller\". These default parameters will not be removed from the\nSampler put into the Test plan.\nBut if you add a \"User Defined Variables\" element inside the \"Target\nController\", then the values are subsitituted by the variable name, if the\nvalues match. So this is a work around that should take care of most situations.", "id": 100541, "time": "2007-03-18T06:38:47Z", "bug_id": 16886, "creation_time": "2007-03-18T06:38:47Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "Http parameters are a special case as there may be multiple values.\n\nIf there are multiple default parameters, but not all of them match, does it \nmake sense to remove just the ones that do match?", "attachment_id": null, "bug_id": 16886, "id": 111470, "time": "2007-12-05T16:47:58Z", "creator": "sebb@apache.org", "creation_time": "2007-12-05T16:47:58Z", "is_private": false}, {"count": 3, "attachment_id": null, "creator": "shmulikk@gmail.com", "text": "Sebb - I would expect this to replace any parameter with the given KEY in the HTTP Request Defaults, no matter what is the VALUE during recording.\n\nI think that the one who put the HTTP Request Defaults in the \"Target Controller\" of the recorded requests, should take into account that this will override any VALUE for a given KEY.\n\nBTW - this is the same in 2.5", "id": 148775, "time": "2011-08-23T06:52:09Z", "bug_id": 16886, "creation_time": "2011-08-23T06:52:09Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 164305, "time": "2013-01-01T17:48:53Z", "bug_id": 16886, "creation_time": "2013-01-01T17:48:53Z", "is_private": false, "text": "Current behaviour seems fine for 99% of cases, changing this might be risky and ROI very low."}]