[{"count": 0, "tags": [], "creator": "paul@priorartisans.com", "attachment_id": null, "id": 30920, "time": "2003-02-07T21:07:22Z", "bug_id": 16891, "creation_time": "2003-02-07T21:07:22Z", "is_private": false, "text": "I just checked out source from CVS, and am encountering 2 errors during a bootstrap:\n\n1.  NPE in PumpStreamHandler.start(): inputThread is null, since the PSH was\nconstructed (from Execute) without an input argument, so inputThread is never\ninitialized.  I fixed that by adding a \"if ( inputThread != null )\" as a\npre-check before starting the thread.  But not really understanding what's going\non, I'm not sure if this is the appropriate fix or not.\n\n2.  Compiler error:\nC:\\src\\jakarta\\jakarta-ant\\src\\main\\org\\apache\\tools\\ant\\taskdefs\\optional\\perforce\\P4Submit.java:110:\ncannot resolve symbol\nsymbol  : method split (java.util.Vector,java.lang.String)\nlocation: class org.apache.oro.text.perl.Perl5Util\n                    util.split(myarray, line);\n\nWhere should I get the org.apache.oro library from?  Is it a prereq for building\nAnt?\n\nI merely commented out that line (since I don't need the task), and the rest of\nthe bootstrap process worked fine."}, {"count": 1, "tags": [], "bug_id": 16891, "text": "Fixed the NPE in PumpStreamHandler - thanks\n\nThe ORO problem is caused by an old version of ORO being in your path. That code\nrequires ORO 2.04+ You may have ORO in unexpected places (e.g. Velocity.jar).\nI'll see if I can add an ORO version check (not sure how easy to detect\ndifferent ORO versions)", "id": 30924, "time": "2003-02-07T23:20:17Z", "creator": "conor@apache.org", "creation_time": "2003-02-07T23:20:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 16891, "attachment_id": null, "text": "Took me a while, but I finally found the ORO classes.  They are included in\nlib/vamp.jar that came with the CVS download.  I don't use those classes in any\nway, so I had to peruse the jars on the classpath generated in the bootstrap.bat\nto find them.\n\nIs it possible to include a compatible version, or to exclude those classes from\nvamp.jar (I realize that this project isn't responsible for vamp, but it seems\nthere's now a problem with inconsistent versions in the ant downloads)", "id": 31024, "time": "2003-02-10T17:49:28Z", "creator": "paul@priorartisans.com", "creation_time": "2003-02-10T17:49:28Z", "is_private": false}]