[{"count": 0, "tags": [], "bug_id": 16906, "attachment_id": null, "text": "As part of our build process sometimes we need to run large data processing\ntasks that can take hours, so we put it on a beefy multi-cpu box and let it run\novernight.  The problem is that unless we are content to use one CPU or make one\nseperate sequenctial portion for each CPU it's no more efficint that running it\non a desktop.  Running them all under the same parallel causes huge memory\nconsumption beyond physical memory and leads to massive disk thrashing.  \n\nThe attached patch allows the user to specify the maximum number of tasks to\nexecute at once, and an optional multiplier per processor (including jdk 1.4\nintrospection tricks and a fallback).  A smoke and (a fragile) ordering test is\nalso included.\n\nThis will by no means create for perfect execution time, since the duration of\nthe execution of the tasks is an unknown and dorting those for maxamum parallel\nusage is a NP complete knapcask variant.  But it does make for easier tweaking,\nexpecially when the target build machine is moved.", "id": 30935, "time": "2003-02-08T19:38:29Z", "creator": "shemnon@yahoo.com", "creation_time": "2003-02-08T19:38:29Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 16906, "attachment_id": 4790, "is_private": false, "id": 30936, "time": "2003-02-08T19:39:19Z", "creator": "shemnon@yahoo.com", "creation_time": "2003-02-08T19:39:19Z", "text": "Created attachment 4790\npatch against 8 feb 2003 codeline, in -u3 format"}, {"attachment_id": null, "tags": [], "bug_id": 16906, "is_private": false, "count": 2, "id": 31059, "time": "2003-02-11T11:29:59Z", "creator": "conor@apache.org", "creation_time": "2003-02-11T11:29:59Z", "text": "That is committed - can you check it out and make sure it is OK, since I did\nsome other changes in <parallel> just bnefore applying this one. You'll need to\nupdate the documentation too, please. \n\nBTW, you are still an Ant committer."}, {"attachment_id": null, "tags": [], "bug_id": 16906, "text": "I've reworked parallel a bit since your patch. In particular I removed the\npollInterval (well it is still there but currently has no effect). I'd like to\nremove it altogether. Could you check it out?", "count": 3, "id": 41318, "time": "2003-07-24T14:32:44Z", "creator": "conor@apache.org", "creation_time": "2003-07-24T14:32:44Z", "is_private": false}]