[{"count": 0, "tags": [], "creator": "jhealy@obs.com", "attachment_id": null, "id": 31085, "time": "2003-02-11T19:26:43Z", "bug_id": 16972, "creation_time": "2003-02-11T19:26:43Z", "is_private": false, "text": "The \"META-INF/INDEX.LIST\" file created by the core Jar task does not correctly\nindex files with null package space names.\n\nAs defined by the Jar spec (which you quote from on the Jar task's manual page),\nthe INDEX.LIST file should simply list package directories instead of putting in\na line for every class file (this reduces overhead).  However, to quote:\n\n\"Only for classes with null package name, and resource files which reside in the\nroot directory, will the mapping be recorded at the individual file level.\"\n\nThe Jar task currently does not provide for this exception; when building the\nINDEX.LIST file, the Jar task simply iterates over the \"addedDirs\" Hashtable\nfrom the Zip superclass and prints the directory names out to the index file.\n\nThus, suppose the following directory structure:\n\ncom/obs/test/TestClass.class\nresources/foo.xml\nresources/bar.gif\nroot.xml\nbaz.gif\n\nThe correct INDEX.LIST file (as generated by `jar -i` would contain the entries:\n\ncom\ncom/obs\ncom/obs/test\nresources\nroot.xml\nbaz.gif\n\nWhereas the Ant-generated Jar would contain only\ncom\ncom/obs\ncom/obs/test\nresources\n\n(The root-level elements 'root.xml' and 'baz.gif' would be missing).\n\nAs a temporary work-around, the following are possible:\n\n- Do not build indices for Jar files in Ant (set index=\"no\")\n- Build indices manually with direct calls to Java's 'jar' tool (jar -i)\n- Place all resources in non-root level of Jar heirarchy\n\nI'm not submitting a patch, as I'm not sure how you wish to address the problem.\n Most likely, you'll need to create another hashtable of root elements, and add\nto it when you process a file with no directory prefix (line 789 of Zip.java in\nv1.5.1 looks like a cozy spot for that)."}, {"count": 1, "tags": [], "bug_id": 16972, "is_private": false, "id": 34401, "attachment_id": null, "creator": "bodewig@apache.org", "creation_time": "2003-04-03T06:43:53Z", "time": "2003-04-03T06:43:53Z", "text": "should be fixed in nightly buil,d 2003-04-04."}]