[{"count": 0, "tags": [], "text": "as per http://nagoya.apache.org/bugzilla/show_bug.cgi?id=15622\n\nPossibly, also add a \"Preferred way to reach me out of band for public key\nverification\" field per contributor. This especially applies to\nhttp://httpd.apache.org/contributors/#wrowe and\nhttp://httpd.apache.org/contributors/#striker, since they right now appear to\nsign the most important part of the downloads...\nBoth apparently have unfortunately never been participants of the mentioned key\nsigning parties (or is just being with Justin already a party ?  ;)    )", "is_private": false, "id": 31416, "creator": "hauser@acm.org", "time": "2003-02-17T09:22:03Z", "bug_id": 17119, "creation_time": "2003-02-17T09:22:03Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 17119, "text": "Almost all of the people listed in the KEYS file have established trust relationships amongst each other.  Therefore, you probably only need to find one person from the KEYS file to trust, then the whole 'web of trust' thing takes over.  Preferably, you can find a person in your region to contact face-to-face or via a cheap phone call.", "count": 1, "id": 31471, "time": "2003-02-17T18:55:00Z", "creator": "jerenkrantz@apache.org", "creation_time": "2003-02-17T18:55:00Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 17119, "text": "1) If they have - why doesn't the KEYS file reflect that?\nAre its keys out of date (or are you claiming that I am using a buggy version of\nPGP ? It is freeware 7.0.3)\n2) Most addresses/keys in KEYS do not define the geography the key owner lives\nin - therefore, I do suggest that they give some hints how to do that in\ncontributors ...", "count": 2, "id": 31472, "time": "2003-02-17T19:02:32Z", "creator": "hauser@acm.org", "creation_time": "2003-02-17T19:02:32Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 17119, "text": "Look at the statistics as Justin claims that \"most of the people in this file\nhave attempted to sign each others' keys\":\n\nThe total is 40 keys representing 32 unique individuals.\n\nAaron: 6 others have signed his key\nBjoern: 0 out 31 possible\nBen: 0 out of these 31 (with 3 unknown others)\nBill: 0\nBrad: 0\nChuck: 0\nCliff: 1\nDaniel: 0\nDean: 0\nDirk: 0\nDoug: 0\nGraham: 5\nGreg A: 0\nGreg S: 0\nIan: 0\nJim: 0\nJustin: 1\nLars: 7\nMarc: 0\nMark: 0\nMartin: 0\nPaul R: 0\nPaul S: 0\nRalf: 0\nRandy: 0\nrbb: 0\nRobert: 0\nKen: 2\nRoy: 2\nsameer: 0\nSander: 1\nWilliam: 0\n\nI guess the numbers speak for themselves, but let me try some math here:\nThere are 25 mutual signatures (probably some unique pairs less if a-b is\nassumed to equal b-a). \nIf I remember right, there are factorial 32 possible signature pairs, i.e.\n2.6*10^35 ...\n===> the text should probably say \"a few of the people have obtained a few\nsignatures from others...\"", "id": 31479, "time": "2003-02-17T20:46:38Z", "creator": "hauser@acm.org", "creation_time": "2003-02-17T20:46:38Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 17119, "attachment_id": null, "id": 31500, "time": "2003-02-18T09:39:50Z", "creator": "hauser@acm.org", "creation_time": "2003-02-18T09:39:50Z", "is_private": false, "text": "just coming back to math: instead of factorial, it is probably just\n31+30+29+...+2+1=496 possible trust relationships\n\n==> considering the above 25 I counted, thus at most 5% of them are evident in\nthe KEYS file"}, {"count": 5, "tags": [], "bug_id": 17119, "text": "Those keys are out of date with respect to the signatures.  (Approx. 8 people in that list have signed my key.)  You'd have to retrieve the updated signatures from the public keyservers in order to get an accurate list.  We will not update the KEYS file everytime someone signs a key.\n\nOnce you get the keys, you know the ID number/fingerprint.  Doing an update on the keys will get you updated signatures.", "id": 31569, "time": "2003-02-19T05:48:45Z", "creator": "jerenkrantz@apache.org", "creation_time": "2003-02-19T05:48:45Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 17119, "text": "Sure, updating the file every time a key gets signed appears to be exaggerated,\nbut how about monthly?\n\nAsking people to update the keys from (by far not always available) keyservers\nlooks to me rather like practical assigment in school than the service of a\nleading open source project that prides itself to have mass-appeal....", "id": 31570, "time": "2003-02-19T06:00:33Z", "creator": "hauser@acm.org", "creation_time": "2003-02-19T06:00:33Z", "is_private": false, "attachment_id": null}, {"id": 31572, "tags": [], "bug_id": 17119, "attachment_id": null, "count": 7, "text": "The reason to distribute the KEYS file at all is to know what keys are the 'right ones' rather than obtaining current signatories for the keys.  If you wish to obtain the current list of signatures for a key, you need to consult the public key server.\n\nIt is unreasonable to expect us to update the keys on a regular basis when people outside of our control may sign our keys and update the key servers without our intervention.  (Why they would do it without consulting us is beyond me, but we've had people sign all of our keys whom we don't know.)\n\nWe're providing the KEYS file as a mechanism for bootstrapping, but that only goes so far.", "time": "2003-02-19T06:08:34Z", "creator": "jerenkrantz@apache.org", "creation_time": "2003-02-19T06:08:34Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 17119, "text": "I almost would have said \"well not regularly/monthly, but after each major of\nyour key-signing party...\"\nBut now that you say that on the public servers, there end up endorsing\nsignatures on your key building the possibility for a trust web you perhaps\nperfer to be not part of, this is even more the reason that the KEYS should be\nkept relatively up to date at the center once rather than having thousands of\npeople over and over downloading keys that are beyond your control and may\ncontain misleading facets...", "id": 31573, "time": "2003-02-19T06:30:01Z", "creator": "hauser@acm.org", "creation_time": "2003-02-19T06:30:01Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 17119, "text": "There are several issues mentioned in this bug, but I think that they are all\nWONTFIX\n1) I regenerated a KEYS file with all the updated signatures. This made the KEYS\nfile 500k rather than 150k. I think that people should simply --refresh-keys\nrather than having to dowload a .5M keys file. Doing a refresh added about 2200\nsignatures.\n2) I don't expect there's any way that we're going to add personal contact\ninformation to the keys file. Email addresses are already contained in that\ninformation, and seems sufficient. Nobody wants to have their phone numbers in\nhere, so that's not going to happen.\n", "id": 63240, "time": "2004-09-08T19:58:00Z", "creator": "rbowen@apache.org", "creation_time": "2004-09-08T19:58:00Z", "is_private": false, "attachment_id": null}]