[{"count": 0, "tags": [], "bug_id": 17162, "is_private": false, "text": "I cannot catch IllegalStateException with web.xml after exceeding \nmaxActiveSessions limit.\nI set the attribute maxActiveSessions for my context in server.xml.  When the \nthe limit is reached it throws an IllegalStateException (in the browser it \nshows 500 error with 'IllegalStateException:createSession:Too many active \nsessions')\nI can't find an easy way to handle this exception with Tomcat.  \nI tried adding <error-page> tags in web.xml to catch this exception but that \ndidn't work.  It seems that after the exception Tomcat doesn't use web.xml the \nsame.  \nI tried testing with the servlet SessionExample that comes with Tomcat.  I set \nthe maxActiveSessions to 3.  Then added an <error-page> tag for error code 404 \nto the web.xml to test this.  With fewer than three sessions, on a file not \nfound error it fowarded to the page I specified.  After 3 sessions it did not \nforward to the page I had specified.\n\nIs there a way for Tomcat to handle this exception it throws?  Basically I \nonly want a website saying \"too many users.\"  Do I have to handle this somehow \nin my code?\n\nThank you for you time and for the great product you produce.", "id": 31516, "time": "2003-02-18T14:22:11Z", "creator": "jochim@itc.it", "creation_time": "2003-02-18T14:22:11Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "jochim@itc.it", "attachment_id": null, "is_private": false, "id": 31680, "time": "2003-02-20T14:39:52Z", "bug_id": 17162, "creation_time": "2003-02-20T14:39:52Z", "text": "I found my problem.  My web.xml was working properly but I had been directing \nit to a JSP.  I found out that JSPs by default use a session.  So I was \nreceiving the IllegalStateException a second time from directing to a JSP.  \nWhen I directed to an HTML it works fine (or I guess a JSP with the tag <%@ \npage session=\"false\" %>.\nMy apologies.\nNonetheless thank you for your time and once again for this product."}, {"count": 2, "tags": [], "bug_id": 17162, "attachment_id": null, "text": "The comments show this was fixed by the reporter - so just doing some cleanup by\nmarking INVALID.", "id": 35596, "time": "2003-04-18T20:38:54Z", "creator": "funkman@joedog.org", "creation_time": "2003-04-18T20:38:54Z", "is_private": false}]