[{"count": 0, "tags": [], "bug_id": 17300, "attachment_id": null, "id": 31778, "time": "2003-02-21T19:53:58Z", "creator": "praveen_s@yahoo.com", "creation_time": "2003-02-21T19:53:58Z", "is_private": false, "text": "A log replay option would be very helpful in running load tests simulating the\nactual production scenario. Currently we have written a small tool that we use\nto read the access log and replay it exactly as the way it happened in\nproduction. This helps us to determine how our servers will behave given the\ncharacteristics of the load."}, {"count": 1, "text": "I am not aware of any tool that is available today in the market either\ncommercial or open source that can do this. Servers do not exhibit the same\nbehavior as they do in production while running a bunch of predetermined\nrequests. Replaying the log as it happened helps in reproducing problems and\nalso determining potential problems.\n\nAt the least, we should be able to feed a access log to JMeter and JMeter should\nbe able to use those requests to run the load. Our tool that we have written\ncovers two scenarios or has two features.\n\n1. Run n number of requests continuosly every second. This simulates n number of\nrequests/sec.\n\n2. Replay the requests in the access log based on the timestamp. If n requests\nare available in the access log for ss:mm:hh, play those requests at ss:mm:hh.\nThis simulates a actual production load as it happened and when it happened. We\ncould start the requests at ss:mm:hh or we could start the requests from the top\nof the access log but replayed at the same interval and number of requests/second.\n\nHope will will have atleast the first feature in JMeter if not for the second.", "creator": "praveen_s@yahoo.com", "is_private": false, "id": 36118, "time": "2003-04-25T16:36:31Z", "bug_id": 17300, "creation_time": "2003-04-25T16:36:31Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "text": "There is now an Access log sampler. If this does not do what you want, please \nre-open the call with details of what is missing/", "attachment_id": null, "id": 51069, "creator": "sebb@apache.org", "time": "2004-01-23T17:54:38Z", "bug_id": 17300, "creation_time": "2004-01-23T17:54:38Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 17300, "attachment_id": null, "is_private": false, "id": 51079, "time": "2004-01-23T20:49:18Z", "creator": "woolfel@yahoo.com", "creation_time": "2004-01-23T20:49:18Z", "text": "please give the access log sampler a try. it supports tomcat common log format \ncurrently. when I get time, I plan to support other popular log formats. if \nyou're using a server that doesn't match the common log format, you can write \nyour own parser and drop it in. if you run into problems, please feel free to \nemail me directly."}]