[{"count": 0, "tags": [], "bug_id": 1738, "text": "(This bug occures within Tomcat 4.0 beta2, beta3 and beta4 versions, wheras \nbeta1 works correctly.)\n\nFrom within a filter I create a session and store an object as a session \nattribute. Then I use a jsp page to access this object. Therefore I have to \ncast the object to its type when using session.getAttribute().\nThis works fine, as long as the application is not reloaded.\nAfter a reload (which I initiated using the manager application) a \nClassCastExceptio occurs. For reproducing this bug, it seems to be crucial that \nthe session is created within a filter and that the object stored as a session \nattribute is also created there. The object should be a self-written test-\nobject that belongs to the web-application's code.\nI have registered the web-app within the server.xml file. It is no war file.\nI have written a small demonstration web-app which can be downloaded from \nHTTPS://spares.airbus.com/demo1.zip\n\nThis application has an index.jsp file that also contains a short description \nof what has to be done exactly to reproduce this bug.", "id": 2429, "time": "2001-05-14T05:48:52Z", "creator": "scoenen@gmx.de", "creation_time": "2001-05-14T05:48:52Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 1738, "text": "Meanwhile I have downloaded and tested Tomcat 4.0 beta 5 \nand the bug exists in this version as well.", "id": 2442, "time": "2001-05-15T07:00:03Z", "creator": "scoenen@gmx.de", "creation_time": "2001-05-15T07:00:03Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "remm@apache.org", "text": "It was a classloading problem, very similar to the one reported by Jon Stevens \nwhen trying to run Scarab.\nThe test case does not fail after reloading with the current (fixed) code from \nCVS.", "id": 2730, "attachment_id": null, "bug_id": 1738, "creation_time": "2001-06-02T21:32:12Z", "time": "2001-06-02T21:32:12Z", "is_private": false}]