[{"count": 0, "tags": [], "bug_id": 1744, "attachment_id": null, "id": 2434, "creation_time": "2001-05-14T10:43:00Z", "time": "2001-05-14T10:43:00Z", "creator": "Daniel.Barclay@digitalfocus.com", "text": "In the documentation for the \"apply\" task, the description of the \"dest\" \nattribute says:\n\n  the directory where the target files will be placed.\n\nThis is not as clear as it seems.\n\nAnt and the apply task obviously can't know what command option (if any) \nto give to specify where the output goes for any arbitrary system command.\n\nSo what does the \"dest\" option do?\n\nI would guess that it sets the current directory for the command.  If so, \nthen the documentation should say that (e.g., with the wording of exec's\ndir attribute: \"the directory in which the command should be executed.\" ). \n\n(If that is the case, then shouldn't the name of the attribute be changed \nto \"dir\", to match <exec dir=\"...\">, <ant dir=\"...\">, etc.?", "is_private": false}, {"count": 1, "tags": [], "bug_id": 1744, "attachment_id": null, "is_private": false, "id": 2529, "time": "2001-05-18T07:32:08Z", "creator": "conor@apache.org", "creation_time": "2001-05-18T07:32:08Z", "text": "The current wording is correct. Of course, the apply task does not force the \noutput files there. What the dest attribute is saying is that this is where the \napply task expects the command to place its output. This is important since \napply checks whether the target files in the dest directory are out of date \nwith respect to the source files (mapped through a mapper) and only applies the \ncommand for the out of date files.\n\nPerhaps the wording should be\nthe directory where the <apply> expects the target files will be placed by the \ncommand.\n"}, {"count": 2, "tags": [], "creator": "conor@apache.org", "is_private": false, "id": 3479, "creation_time": "2001-07-07T07:58:07Z", "time": "2001-07-07T07:58:07Z", "bug_id": 1744, "text": "Made the documentation change", "attachment_id": null}]