[{"count": 0, "tags": [], "creator": "eddiew@oakleafconsultancy.com", "attachment_id": null, "text": "In completing our performance testing of our web-application running under \nTomcat we are experiencing the following error:\n\nUnexpected Signal : 11 occurred at PC=0x401bf49a\nFunction name=scavenge_oop_with_check__8ScavengePP7oopDesc\nLibrary=/usr/local/j2sdk1.3.1/jre/lib/i386/client/libjvm.so\n\n#\n# HotSpot Virtual Machine Error : 11\n# Error ID : 4F530E43505002C4\n# Please report this error at\n# http://java.sun.com/cgi-bin/bugreport.cgi\n#\n# Java VM: Java HotSpot(TM) Client VM (Blackdown-1.3.1_02b-FCS mixed mode)\n\nAfter this error all Tomcat processes are terminated.\n\nThe first time this happened I reported the bug to both Blackdown and Sun who \nhave suggested that it is an application or tomcat problem. As it has now \nhappened again and I can find no trace of a problem in our application I am \nraising it here. \n\nI cannot re-produce (at will) this error but it seems to happen when Tomcat is \nbusy - the latest occurence was when we were load testing the system with 40 \nusers continuously hitting the server (a stress test). \n\nReading various forums and posts on the internet this seems to be a common \nproblem with people pointing to system resource issues as the root cause but I \ndo think this is the case here as we have loads of spare disk and 2Gb of RAM - \nalso at the time of occurence the system was not doing anything other than the \nload testing described above.\n\nHas anyone seen this ? Is this is a bug in Tomcat ? Is it a resource issue ? \nWhatever I would appreciate some help as this is causing us serious problems.", "id": 32076, "time": "2003-02-27T12:14:05Z", "bug_id": 17481, "creation_time": "2003-02-27T12:14:05Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 17481, "attachment_id": null, "id": 35550, "time": "2003-04-18T14:56:39Z", "creator": "funkman@joedog.org", "creation_time": "2003-04-18T14:56:39Z", "is_private": false, "text": "Marking as invalid unless it can proven that tomcat is causing the crash and is\nnot the fault of the JVM. In the meantime, I recommend:\n- Getting all patches\n- Upgrading (or maybe downgrading) JVM \n- Check with Sun Bug parade\n- Look for various tuning guides with respect to allowable files open, stack\nsize, tcp buffer tweaks,... (I don;t know of any off the top of my head but\ngoogle is helpful for this)"}]