[{"count": 0, "tags": [], "creator": "James_Sloan@alumni.hmc.edu", "text": "Starting with Tomcat 4.0, Jasper is checking to see whether or not a BodyTag's body is empty before emitting the code to call doInitBody(), setBodyContent(), and doAfterBody().  If it is, it skips the call, ignores the result of doStartTag(), and simply emits a call to doEndTag().\n\nThe problem occurs for tags which contain logic in doAfterBody() which might emit results even if the body is empty.  Our project contains several tags which, for reuse purposes, may either take their parameter(s) as subelements or as attributes.  If the body is empty, the attribute value will be used in its stead.\n\nWhen I attempted to install our application using Tomcat 4.1.18, none of these tags actually did anything.  :-)\n\nA simple removal of the check for a null body fixed the problem for me.", "id": 32120, "time": "2003-02-27T22:24:13Z", "bug_id": 17509, "creation_time": "2003-02-27T22:24:13Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "All the tag handler lifecycle methods have been clarified in the\nupcoming JSP 2.0.\n\nThe latest javax.servlet.jsp.tagext.BodyTag, available from\njakarta-servletapi-5/jsr152, has this:\n\n * <p>Note that which methods are invoked after the doStartTag() depends on \n * both the return value and on if the custom action element is empty\n * or not in the JSP page, not how it's declared in the TLD.\n *\n * <p>\n * If SKIP_BODY is returned the body is not evaluated, and doEndTag() is\n * invoked.\n *\n * <p>\n * If EVAL_BODY_INCLUDE is returned, and the custom action element is not\n * empty, setBodyContent() is not invoked,\n * doInitBody() is not invoked, the body is evaluated and\n * \"passed through\" to the current out, doAfterBody() is invoked\n * and then, after zero or more iterations, doEndTag() is invoked.\n * If the custom action element is empty, only doStart() and \n * doEndTag() are invoked.\n *\n * <p>\n * If EVAL_BODY_BUFFERED is returned, and the custom action element is not\n * empty, setBodyContent() is invoked,\n * doInitBody() is invoked, the body is evaluated, doAfterBody() is\n * invoked, and then, after zero or more iterations, doEndTag() is invoked.\n * If the custom action element is empty, only doStart() and doEndTag() \n * are invoked.\n\nThis means that if a custom action is empty, we don't even need to check the\nreturn value of doStartTag(), and may simply proceed to calling doEndTag().\n", "bug_id": 17509, "attachment_id": null, "id": 33886, "time": "2003-03-27T02:32:22Z", "creator": "jan.luehe@sun.com", "creation_time": "2003-03-27T02:32:22Z", "tags": [], "is_private": false}]