[{"count": 0, "tags": [], "creator": "marc@kenamea.com", "attachment_id": null, "is_private": false, "id": 32131, "time": "2003-02-28T02:23:27Z", "bug_id": 17512, "creation_time": "2003-02-28T02:23:27Z", "text": "When compiling a large number of classes at once, it appears that when\nAnt is configured to use jikes it will create a temporary file called\n\"filexxxx\" or \"file-xxxx\" where xxxx is some random number.  The\ntemporary file contains a list of all the java files being compiled.  It\nthen removes this file when the jikes is complete.  However, if the\ncompile is interrupted (such as hitting CTRL-C when a long list of\ncompile errors is being spewed back), it will fail to delete the\ntemporary file.  If I switch the compiler to \"javac\" it doesn't appear\nto create any temporary file.\n\nI have created a fix for this based on the current CVS code.  This fix includes \na new method to FileUtils called deleteOnExit(...) which uses reflection to \ndetermine if JDK1.2+ is being used and if so, calls File.deleteOnExit() on the \nfile passed in as a parameter.  The patch calls this new method in the \nDefaultCompilerAdapter class when a temporary file is created.  The patch seems \nto get rid of this problem."}, {"count": 1, "tags": [], "creator": "marc@kenamea.com", "attachment_id": 5086, "id": 32132, "time": "2003-02-28T02:24:43Z", "bug_id": 17512, "creation_time": "2003-02-28T02:24:43Z", "is_private": false, "text": "Created attachment 5086\nPatch to fix this bug"}, {"count": 2, "tags": [], "text": "I've tried to hunt down all temporary files that we create and marked them as\ndeleteOnExit (without reflection as Ant 1.6 drops the 1.1 dependency).\n\nMy reading of this method's Javadocs is that you are lucky if this happens to\nremove the temporary files when you hit ^C (Deletion will be attempted only for\nnormal termination of the virtual machine).\n\nFixed in CVS HEAD and Ant 1.6beta2.", "is_private": false, "bug_id": 17512, "id": 45605, "time": "2003-10-14T13:23:55Z", "creator": "bodewig@apache.org", "creation_time": "2003-10-14T13:23:55Z", "attachment_id": null}]