[{"count": 0, "tags": [], "text": "(This bug was originally directed at Redhat's bug database. It involves the \nversion of apache they ship, 2.0.40, which is not the most recent, but since \nothers might look for data here and/or RedHat might point fingers at apache, \nand I haven't been able to find a duplicate here, I'm including a copy anyway)\n\nDescription of problem:\nRed hat distributes Apache Webserver 2.0.40 with Redhat 8.0, and has not \nreleased a newer version in it's updates. This version of apache (perhaps in \nconcert with PHP 4.2.2, also distributed in RH8.0 updates) appears to have a \nbug in how it handles POST requests. In particular, the content of the post \nrequest (which takes the form \"key1=val1&key2=val2..\", I believe) appears to \nbe chopped up randomly and rearranged before PHP parses the values out. Thus, \nincoming variables take on values like:\n\necho \"text= '$text'\";\n-output-\n'Here is somtext=Here is some example text'\n\n(in real examples, this may take several hundred characters to replicate)\n\nThis was discussed in PHP's bug list, (PHP BUG #18648, \nhttp://bugs.php.net/bug.php?id=18648 ) appears to be an apache bug, and they \nreport that the latest build of apache (2.0.44) seems to fix the problem. The \nlast comment confirms that RH8.0 ships with 2.0.40, and that someone should \nnotify RedHat. (I venture this is the appropriate place :)\nI've searched apache's bug list and found no substantial counterpart, but \napache doesn't recommend posting bugs on software versions they do not \nconsider \"up to date\". See apache bug #15808, \nhttp://nagoya.apache.org/bugzilla/show_bug.cgi?id=15808 for an example of this \nattitude.\n\nI'd recommend either releasing a newer version of apache in updates, or a new \npatchlevel for 2.0.40 addressing this issue. (I'm not really a packager, but I \nplay one on tv :)\n\nVersion-Release number of selected component (if applicable):\nhttpd 2.0.40-11, tested against php 4.2.2-8.0.7\n\nHow reproducible:\n99%\n\nSteps to Reproduce:\n1. build a simple web form with a textarea element (lets say it's named \"foo\") \nand a submit button, that submits using POST method.\n1a. To aid reproduceability, make sure the textarea is the only named form \nelement, no name for the submit button.\n1b. Some people have suggested that multiple named form elements either make \nthe bug go away or else make it harder to spot (corrupting variables you don't \nuse), either way diminishing reproduceability\n2. in response page, using php, <? print_r($_POST) ?>\n2a. Some have reported php_info() confirms the error when it dumps incoming \nPOST values, I haven't tried that.\n3. Enter several kilobytes of data, just to be sure, into the text area and \nsubmit the form.\n    \nActual results:\nPHP will report that $_POST['foo'] contains a value with portions copied and \nspliced around, perhaps delimited by \"foo=\".\n\nExpected results:\nPHP should report that $_POST['foo'] matches your input text, give or take the \neffects of magic quotes and the like.\n\nAdditional info:\nFair discussion of the problem:\nPHP BUG #18648, http://bugs.php.net/bug.php?id=18648", "attachment_id": null, "id": 32190, "creation_time": "2003-02-28T22:41:44Z", "time": "2003-02-28T22:41:44Z", "creator": "heckler@bendnet.com", "bug_id": 17549, "is_private": false}, {"count": 1, "tags": [], "bug_id": 17549, "text": "Please try reproduce the problem with the latest Apache (currently 2.0.44) and\nthe latest PHP (4.3.?).  There have been various problems with Apache+PHP which\nare solved with the latest code.  We look forward to hearing whether or not you\ncan reproduce the problem with current code.\n\nThanks!\n", "id": 32222, "time": "2003-03-01T15:06:23Z", "creator": "trawick@apache.org", "creation_time": "2003-03-01T15:06:23Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "nd@perlig.de", "text": "No further response. Assuming fixed - it works for me anyway.\nPlese reopen this report if there are further issues.\n\nThanks for using Apache.", "id": 33118, "time": "2003-03-13T14:24:01Z", "bug_id": 17549, "creation_time": "2003-03-13T14:24:01Z", "tags": [], "is_private": false}]