[{"count": 0, "tags": [], "creator": "mightypile@hotmail.com", "attachment_id": null, "is_private": false, "id": 32216, "time": "2003-03-01T07:51:46Z", "bug_id": 17560, "creation_time": "2003-03-01T07:51:46Z", "text": "I've found several people in newsgroups who have had the same error trying to \ncompile the openssl code under Visual C++ and WinNT (different flavors from NT \nto XP).  In each case, running \"perl Configure VC-WIN32\" caused the problem to \ngo away.  I thought it would be helpful to add this line to the instructions \non your page since this is where I started and where I ran into the problem.\n\nThanks,\n   Mike Schmidt\n   mightypile@hotmail.com"}, {"count": 1, "tags": [], "bug_id": 17560, "attachment_id": null, "text": "The openssl instructions do include that line, as the first line you run.  \nUnless you need to set up your environment.  Read the install.w32(?) file under \nopenssl\\; not the Apache site. ", "id": 36006, "time": "2003-04-24T18:16:27Z", "creator": "towerofpower@operamail.com", "creation_time": "2003-04-24T18:16:27Z", "is_private": false}, {"count": 2, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "is_private": false, "id": 67336, "time": "2004-11-22T14:38:41Z", "bug_id": 17560, "creation_time": "2004-11-22T14:38:41Z", "text": "Building openssl is pretty far beyond the scope of the Apache httpd\ndocumentation, but, then, I suppose most of this particular doc is likewise\nbeyond our stated scope. I've seen remarks a few places to the effect that this\ndoc is moderately out of date, and needs some significant updates for 2.x, but,\nunfortunately, the number of people who can do this update is pretty small.\n\nYour remark that a particular line makes the problems go away is only half\nhelpful. When, in the order of other commands, should that line be added? An\nactual patch to the doc would be the most helpful, but just answering that one\nquestion would be somewhat helpful to getting this problem resolved. Please look\nat the latest version of this doc, and let us know if the instructions still\nwork for you.\n\nThanks.\n"}]