[{"text": "I encountered a strange problem when using table-omit-footer-at-\nbreak=\"true\" resulting in exception at \norg.apache.fop.layout.Area.removeChild(Area.java:282).\n\nWhen I removed the table-omit-footer-at-break property on line 337 in \nstyle sheet (this property on line 107 was present) everything renders \ncorrectly. \n\nI made some experiments and this error sometimes disappeared when I \nused different font (I think this is because other font has different \nmetric which leads into slightly different layout.). As well on \ndifferent input documents the error sometimes appear and sometime \ndoesn't. So I expect that this error rises only when some specific \nsituation in layout occurs. This behavior is demonstrated by files in \nbr.zip archive.\n\nWhen I made variant of stylesheet with table-omit-footer-at-break \nremoved on line 107 and present on line 337 in stylesheet i got \nfollowing message: \"WARNING: footer could not fit on page, moving last \nbody row to next page\" and on top of page 3 is drawn strange line \nbetween yellow and green region. After removing table-omit-footer-at-\nbreak on line 337 it works fine so I thing it is somehow related to \nproblem described above. demonstration is in br2.zip archive. \n\nI also have encountered situation in which I run into endless loop when \non every page i got \"WARNING: footer could not fit on page, moving last \nbody row to next page\" and it continued over and over so I had to \nintwerrupt it. This happened with stylesheet very similar with ones in \nabovae cases, but I am unable to reproduce it again just now.\n\nMaybe all these problems are because of usage of table-omit-footer-at-\nbreak on table which is nested in other table.", "tags": [], "bug_id": 1759, "attachment_id": null, "count": 0, "id": 2449, "time": "2001-05-15T15:10:32Z", "creator": "pand6029@artax.karlin.mff.cuni.cz", "creation_time": "2001-05-15T15:10:32Z", "is_private": false}, {"count": 1, "tags": [], "creator": "pand6029@artax.karlin.mff.cuni.cz", "attachment_id": 154, "is_private": false, "id": 2450, "time": "2001-05-15T15:26:04Z", "bug_id": 1759, "creation_time": "2001-05-15T15:26:04Z", "text": "Created attachment 154\nproblem description 2"}, {"count": 2, "tags": [], "creator": "pand6029@artax.karlin.mff.cuni.cz", "attachment_id": 155, "is_private": false, "id": 2451, "time": "2001-05-15T15:26:59Z", "bug_id": 1759, "creation_time": "2001-05-15T15:26:59Z", "text": "Created attachment 155\nproblem demonstration 1"}, {"count": 3, "tags": [], "text": "No crash nor a warning with 0.20.3. I assume the problem is fixed.", "attachment_id": null, "bug_id": 1759, "id": 15516, "time": "2002-05-05T20:29:37Z", "creator": "j3322ptm@yahoo.de", "creation_time": "2002-05-05T20:29:37Z", "is_private": false}, {"count": 4, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 155976, "time": "2012-04-01T06:51:12Z", "bug_id": 1759, "creation_time": "2012-04-01T06:51:12Z", "text": "batch transition pre-FOP1.0 resolved+fixed bugs to closed+fixed"}]