[{"count": 0, "tags": [], "creator": "jochim@itc.it", "attachment_id": null, "id": 32356, "time": "2003-03-03T17:32:01Z", "bug_id": 17609, "creation_time": "2003-03-03T17:32:01Z", "is_private": false, "text": "I want to control the number of maxActiveSessions so set I the attribute in \nserver.xml for my context and then added the appropriate <error-page> tags to \nthe application's web.xml.  The first browser window that exceeds the limit \nshows the error page which is defined in web.xml and it works correctly.  \nEvery subsequent browser window shows the Tomcat's default error page and the \nstack trace.\nBoth errors are exactly the same but one goes to the page specified by web.xml \nand one does not.\nThe application is on Tomcat 4.1.12.\n\nTo test this behavior I started Tomcat 4.0.3 and used the SessionExample \nservlet provided with Tomcat.  The only changes I made were to add the <error-\npage> tags in the web.xml, add an html page that it points to, and set the \nmaxActiveSessions limit.  On Tomcat 4.0.3 it all worked perfectly.  Every page \nafter exceeding the maxActiveSession limit showed the error page correctly.\nI duplicated this exact test in Tomcat 4.1.12, using SessionExample.java, \nchanging web.xml, adding the maxActiveSessions in server.xml, and adding the \nhtml.\nWith Tomcat 4.1.12 the first page over the limit showed the error page \ncorrectly, but every one after shows the stack trace for the \nIllegalStateException.\nI also downloaded 4.1.18 and tried it but it was the same at Tomcat 4.1.12.\n\nThis is also the behavior from IE 6.0.  All browsers malfuntion but in \ndifferent ways it seems.  With Netscape 7 if I press reload it alternates \nbetween the correct error page and the stack trace with each click on 'reload.'\nThank you in advance for any help."}, {"count": 1, "tags": [], "bug_id": 17609, "is_private": false, "text": "I have just tested this with the latest source for TC4 and I don't see this \nbehaviour.\n\nI am assuming that this has been fixed somewhere between 4.1.18 and 4.1.30.", "id": 53951, "time": "2004-03-13T17:23:00Z", "creator": "markt@apache.org", "creation_time": "2004-03-13T17:23:00Z", "attachment_id": null}]