[{"count": 0, "tags": [], "bug_id": 17659, "attachment_id": null, "text": "Hi,\n\nI like ant and use it in all projects. I use it often and find one its aspect as\nannoying - it takes too much time to start. I know, one big problem is JVM,\nsecond is parsing of XML file. But there is one solution, which would help a\nlot: provide interactive interface.\n\nMy use case:\n\nI develop web application and modify some files. Then I run ant target to deploy\nthem. Then I load a page in browser. I find some misspelling so I modify source\ncode, deploy via ant and then reload page. Last sentence takes 10 second in\ntotal, 7 seconds of it is taken by ant, which simply copies the file from one\ndirectory to another.\n\nI would love to be able to run ant in interactive mode.\n\nant -interactive\n>deploy\nCopying 1 file to /home/literakl/abc/deploy/WEB-INF/templates\nSUCCESS\n>deploy\nCopying 2 file to /home/literakl/abc/deploy/WEB-INF/templates\nSUCCESS\n>deploy\nSUCCESS\n\nThis would save me lot of time. What do you think? It would be great for cases,\nwhen you run some target periodically or very often ...\n\nSincerelly\n\nLeo", "id": 32448, "time": "2003-03-05T08:11:42Z", "creator": "literakl@centrum.cz", "creation_time": "2003-03-05T08:11:42Z", "is_private": false}, {"count": 1, "attachment_id": null, "creator": "stevel@apache.org", "text": "have you tried the ant support in jedit? it gives you this from inside its own JVM.", "id": 32921, "time": "2003-03-11T07:10:20Z", "bug_id": 17659, "creation_time": "2003-03-11T07:10:20Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "literakl@centrum.cz", "attachment_id": null, "is_private": false, "id": 32952, "time": "2003-03-11T14:11:09Z", "bug_id": 17659, "creation_time": "2003-03-11T14:11:09Z", "text": "no. I dont want to run other tool than ant."}, {"count": 3, "tags": [], "bug_id": 17659, "is_private": false, "text": "well, we are happy providing a tool for other IDEs and things to use; jedit is\none of the many that provides a good wrapper around ant. I have key bindings set\nup in the editor to do things like 'deploy', so can go straight from editing a\njsp page to deploying it without switching apps.\n\nFeel free to add your own command line interface, as a related project to ant,\nbut doing a new interactive mode for the core seems a bit of a distraction for\nthe core team. \n\nThere is also the Antidote Ant gui project that you can join to produce a\nstandalone ant gui. \n\nFinally, you can also help profile ant and speed up that XML parsing. That would\nprovide the most fundamental speedup, as JVM startup is usually pretty neglible,\nreally.", "id": 32971, "time": "2003-03-11T16:41:28Z", "creator": "stevel@apache.org", "creation_time": "2003-03-11T16:41:28Z", "attachment_id": null}]