[{"count": 0, "tags": [], "creator": "epesh@hotmail.com", "attachment_id": null, "is_private": false, "id": 32560, "time": "2003-03-06T14:21:15Z", "bug_id": 17724, "creation_time": "2003-03-06T14:21:15Z", "text": "According to the JSP spec (1.1, section 2.3 and 2.0, section 1.5.1), the\nfollowing code should not compile and run:\n\n&lt;!-- &lt;% String foo=\"hello\"; %&gt; --&gt;\n&lt;%= foo %&gt;\n\nOnly JSP scriptlets are processed within HTML comments. It may be that the spec\nis (and has been) in error here, as JSP does not generate ONLY HTML markup.\nHowever, as it stands, the spec does not allow this code to compile. To wit,\nhere's the text from the spec:\n\n\"These comments are treated as uninterpreted template text by the JSP container.\nIf the generated comment is to have dynamic data, this can be obtained through\nan expression syntax, as in:\"\n\nIt then follows with the use of the jsp expression syntax."}, {"count": 1, "text": "Please note that I didn't know if my text would be interpreted as literal HTML,\nor enocded; the actual JSP text should be: \n\n<!-- \n<% String foo=\"hello\"; %>\n-->\n\n<%= foo %>", "bug_id": 17724, "attachment_id": null, "id": 32561, "time": "2003-03-06T14:28:12Z", "creator": "epesh@hotmail.com", "creation_time": "2003-03-06T14:28:12Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "is_private": false, "id": 53953, "attachment_id": null, "bug_id": 17724, "creation_time": "2004-03-13T18:18:45Z", "time": "2004-03-13T18:18:45Z", "text": "Tomcat 4 implements the JSP 1.2 spec, not the 1.1 spec.\n\nThat being said, pretty much identical text can be found in JSP.2.5\n\nHaving read this section carefully I do not agree with your interpretation. I \ndon't see anything that says that your example is invalid. It does give the \nexample of using the expression sytax within a HTML comment but it does not \nstate that scriplets are invalid in this location."}, {"count": 3, "tags": [], "creator": "kin-man.chung@sun.com", "attachment_id": null, "id": 54045, "time": "2004-03-16T02:35:21Z", "bug_id": 17724, "creation_time": "2004-03-16T02:35:21Z", "is_private": false, "text": "I agree with Mark here.  In fact JSP is agnostic about HTML comments, and treats\nthen tags as template texts, so scriptlets is definite allowed there."}]