[{"count": 0, "tags": [], "creator": "kenkyee@excite.com", "attachment_id": null, "is_private": false, "id": 32602, "time": "2003-03-06T21:13:43Z", "bug_id": 17743, "creation_time": "2003-03-06T21:13:43Z", "text": "After a long dig for info on how to do this on the Tomcat/JBoss mailing lists \nand various web forums, I came to the conclusion that there's no clean way to do \nthis w/o a hack (I'll describe the hack later).\n\nBy \"automatic login\", I mean the feature where you have some web sites that will \noffer to remember your username/password for you via a persistent cookie.  The \nproblem is there's no hook for this (though a Valve might do it).  What you \nusually do is put some code on a page that initiates the login process by \ncalling a container's authentication system.  The only way I could do this was \nto have a servlet simulate a POST to j_security_check; it works fine, but it'd \nbe nice if I could do this in a supported way by calling a Tomcat function to \ndo the authentication instead of doing the simulated POST hack.  This hack only \nworks if you use Form based authentication as well.\n\nThe problem w/ this approach is that if a user bookmarks a URL that has been \nrestricted via container-managed declarative security, this technique won't \nwork.  The user will get prompted for username/password.\n\nA somewhat related feature is the ability to have principals/roles propogate \nthrough all URLs of a web app instead of the way it is now where they are only \nreadable in servlets/JSPs in the restricted URLs.  I've found FAQs that indicate \nthis is the way it is because the servlet spec is vague, but I'll give you a \ncase where it is needed: you have a home page that has a hidden link that is \nonly visible if a user has the Admin role.  The home page is not restricted but \nthe user does have the Admin role.\n\nI'd like to see this in the 4.x codestream as well, but 5.0 sounds like it's \nclose to release :-)"}, {"count": 1, "tags": [], "bug_id": 17743, "attachment_id": null, "id": 33218, "time": "2003-03-14T21:12:07Z", "creator": "kenkyee@excite.com", "creation_time": "2003-03-14T21:12:07Z", "is_private": false, "text": "Please delete this RFE.  There's no need to do this as long as Tomcat5 uses the \nsame Catalina container as Tomcat4.  I was able to figure out how to do it using \nTomcat4's Catalina container by creating my own authenticator.\n\n"}]