[{"count": 0, "tags": [], "creator": "yw119232@iplanet.com", "attachment_id": null, "is_private": false, "id": 32884, "time": "2003-03-10T21:35:43Z", "bug_id": 17845, "creation_time": "2003-03-10T21:35:43Z", "text": "In my Solaris 8, I created a counter with ref name R3 and checked Track Counter\nIndependently for each User option. In my sampler fields I use  ${R3} to\ngenerate dynamic value for the HTTP request. But it keeps sending ${R3} instead\nof the numbers that counter should do."}, {"count": 1, "attachment_id": null, "creator": "jkb@stian.freeserve.co.uk", "is_private": false, "id": 32936, "time": "2003-03-11T10:45:33Z", "bug_id": 17845, "creation_time": "2003-03-11T10:45:33Z", "tags": [], "text": "This is really a documentation bug: \n\nthe TRUE/FALSE parameter determines whether the function return is per-thread \nor not - it has no effect on the value saved in a variable.\n\nIf a variable name is supplied (e.g. R3), it is actually used as a PREFIX to \ncreate the actual variable names, which are then R£_TRUE and R3_FALSE.\n\nIf X is not defined as a variable, then ${X} will be left as it is."}, {"count": 2, "tags": [], "creator": "kurowski@symphoniq.com", "attachment_id": null, "is_private": false, "id": 47666, "time": "2003-11-20T03:35:07Z", "bug_id": 17845, "creation_time": "2003-11-20T03:35:07Z", "text": "I believe jkb has misunderstood the reporter of the bug.  The reporter was NOT \ntalking about the built-in __counter function.  He was talking about the \nCounter Pre-Processor, as evidenced by reference to the checkbox for \"Track \ncounter independently for each user\".\n\nThe documentation section 13.7.3 HTML Parameter Mask is marked as deprecated, \nand the user is told to use Counter instead (section 13.7.6).  When I use \nCounter (on both solaris and windows), sometimes I get the same problem \nreported in this bug (the \"*{RefName}\" gets sent as text rather than being \ncoverted to an integer), but sometimes it works for a while and then fails.  \nThis happens whether or not I check the checkbox.  I have not been able to \nisolate the problem, but I would certainly appreciate it if someone out there \nwould try to reproduce it and fix it, given that I'd bet a lot of money that \nthe bug affects more than just two of us.  :-(\n\nThanks!"}, {"count": 3, "attachment_id": null, "creator": "jsalvata@atg.com", "is_private": false, "id": 48899, "time": "2003-12-11T13:25:15Z", "bug_id": 17845, "creation_time": "2003-12-11T13:25:15Z", "tags": [], "text": "I've been trying to reproduce this. Here's what I did:\n\nThread Group: 10 threads\n  HttpRequest: GET http://localhost/?num=${test}\n    Counter: reference name \"test\"\n    Response Assertion: NOT CONTAINS \"test\"\n  Aggregate report\n\nNo matter how long I run it (my patience is short, but I've waited for half a\nmillion requests to go through), no matter whether I track the counter\nindependently for each user or not, I don't see the problem. I've verified by\ngrepping my Apache access.log for \"test\".\n\nMark: can you provide a reproducible test case?\n\nIs this really Solaris-specific, as the summary suggests? I find this just too\nsurprising.\n\nRaising priority and severity -- it's a really awful bug if it is still there!"}, {"count": 4, "tags": [], "bug_id": 17845, "text": "No additional input since my last message, almost one month ago.\n\nResolving as unreproducible.", "id": 50785, "time": "2004-01-19T22:28:41Z", "creator": "jsalvata@atg.com", "creation_time": "2004-01-19T22:28:41Z", "is_private": false, "attachment_id": null}]