[{"count": 0, "tags": [], "bug_id": 17851, "attachment_id": null, "id": 32892, "time": "2003-03-10T23:29:23Z", "creator": "ddj@aisb.org", "creation_time": "2003-03-10T23:29:23Z", "is_private": false, "text": "I'm building a web application by making a JAR file for the guts of the\napplication and a bunch of JSPs for the application itself.  As long as I don't\nuse any classes from my JAR file, things work, but it appears that the \"javac\"\nused to build .class files out of my .jsp files doesn't have that JAR file in\nits classpath.  The same appears to be true of classes in the WEB-INF/classes\ndirectory.\n\nHere's the simplest way I have to reproduce the problem:\n\nI created a directory under \"webapps\" called \"playground\", and created a\nWEB-INF/classes directory under that.  Elsewhere, I wrote a public class named\n\"Hello\" (no package, that's the whole name) with one public method, \"public\nString run()\", which just returns the string \"Hello, sailor!\".  I compiled it to\na .class file and dropped that in WEB-INF/classes (on another occasion I\npackaged that into a JAR and put that into WEB-INF/lib -- nothing changes).\n\nThen, I created an \"index.jsp\" that contains nothing but the line:\n<jsp:useBean id=\"h\" class=\"Hello\" />\n\nWhen I go to that page, I get an error saying it can't be compiled because the\nsymbol \"Hello\" can't be found.  But if I change it to:\n<jsp:useBean id=\"h\" class=\"Hello\" type=\"Object\" />\n\nIt actually compiles.  And if I add the following line:\n<%= h %>\n\nI get a string of the form \"Hello@...\", so I can tell the Java runtime was able\nto correctly load the class and call its constructor and everything.  And if I\nadd a \"toString\" method to my \"Hello\" class, its return value is correctly shown\nthere.\n\nSo it looks to me like WEB-INF/{lib,class} are in the classpath at the JSP's\nruntime, but not at its compile-time.\n\nI have tested this on MacOS X with JDK 1.3.1 and 1.4.1, and on Solaris with JDK\n1.4.1, and on Linux with JDK 1.4.1.  It behaves the same way in all those cases."}, {"count": 1, "tags": [], "bug_id": 17851, "attachment_id": null, "is_private": false, "id": 32898, "time": "2003-03-11T00:13:30Z", "creator": "kin-man.chung@sun.com", "creation_time": "2003-03-11T00:13:30Z", "text": "\n\n*** This bug has been marked as a duplicate of 10036 ***"}]