[{"count": 0, "tags": [], "bug_id": 17867, "attachment_id": null, "text": "While I'm testing new host with new context in current session, it works. after \nrestart it reports an error \"HTTP Status 500 - No Context configured to process \nthis request\"", "id": 32939, "time": "2003-03-11T11:06:38Z", "creator": "seredkin@nm.ru", "creation_time": "2003-03-11T11:06:38Z", "is_private": false}, {"count": 1, "tags": [], "text": "Cannot reproduce.  Make sure you have saved your current the newly added host \nand context information using \"commit\" before restarting.  Otherwise they will \nbe lost after restart.  Please reopen if you can still reproduce the error.", "is_private": false, "id": 33206, "creator": "amyroh@apache.org", "time": "2003-03-14T18:14:29Z", "bug_id": 17867, "creation_time": "2003-03-14T18:14:29Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Created attachment 6601\nThis is my configuration.  Also, go to http://www.cltractor.com to see this not working.", "is_private": false, "bug_id": 17867, "id": 38197, "time": "2003-06-02T17:26:16Z", "creator": "wchandler@redesetgrow.com", "creation_time": "2003-06-02T17:26:16Z", "attachment_id": 6601}, {"count": 3, "tags": [], "creator": "wchandler@redesetgrow.com", "text": "I'm having this same problem.  I go into the admin application and add a virtual\nhost.  Everything will work for a while.  Then it appears that after the log\nfile is updated I have problems.  I have noticed that with autodeploy if i have\na WEB-INF directory under a directory then I will have a new context deployed in\nmy file.  Thus the server.xml file has been overwritten.  I also notice that\nwhen I change the file with VI I have problems after a save and restart.  I have\nyet to figure out how to add a vhost by the text file.  When I do it just\ndoesn't work.  I don't know if it is the xml parser or what, but all I get is no\ncontext configured.  But the same values work when created by the admin tool and\ncommit changes, but to get it working again I always have to delete the\nconfiuration (the entire host) then add it all back, aliases, contexts, anything\nand everything.  Not good.  I kept it simple this time.  No alias and only one\ncontext other than the default.  And, it still did the same thing.\n\nOS: Red Hat Linux 9\nKernel: 2.4.20-13.9\nJDK: 1.4.1_02 SUN  same thing with 1.3.1 SUN\nTomcat: 4.1.24", "id": 38198, "time": "2003-06-02T17:35:00Z", "bug_id": 17867, "creation_time": "2003-06-02T17:35:00Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Here is some more info.  When I log into my admin after the no context defined\nerror.  I get this error when I try to click on the Default Context to edit it.\n===================================================\ntype Status report\n\nmessage Error retrieving attribute debug\n\ndescription The server encountered an internal error (Error retrieving attribute\ndebug) that prevented it from fulfilling this request.\n====================================================\n\nto correct this the only work around I have found is to remove the configuration\nfor the vhost and re-enter it all through the admin tool.\n\n:-(", "is_private": false, "id": 38200, "creator": "wchandler@redesetgrow.com", "time": "2003-06-02T18:09:02Z", "bug_id": 17867, "creation_time": "2003-06-02T18:09:02Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "Well, I couldn't leave the site down long enough to show any body.  So, I\nbrought it back up.  But, I have to reconfigure every reboot.  Anyways, I guess\nI'll bite the bullet and start looking at the start up code for catalina.  I'm a\nsoftware engineer and programmer, and java happens to be my forte.  I'll let you\nknow if I find the problem.  I haven't had a reply as of yet, and I'm not\nexactly sure how to get involved in the dev process.  If I find an issue who\nshould I contact to get it in the code base?  Well, that's it for now.  It's\neither I fix it or just use a different server.  But, I really like tomcat.", "attachment_id": null, "id": 38399, "creator": "wchandler@redesetgrow.com", "time": "2003-06-04T23:27:40Z", "bug_id": 17867, "creation_time": "2003-06-04T23:27:40Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 17867, "attachment_id": null, "id": 56328, "time": "2004-04-24T17:06:01Z", "creator": "markt@apache.org", "creation_time": "2004-04-24T17:06:01Z", "is_private": false, "text": "This works for me. The steps I followed in the admin app (saving at each \nstage) were:\n1. Configured my PC so testhost points to the local machine.\n2. Create a new host (testhost).\n3. Copy the root webapp to the testhost appbase\n4. Add a root context to test host pointing to ROOT\n5. Commit the changes so server.xml gets re-written.\n6. Restart tomcat\n\n... and it all works.\n\nI was using the latest (built from CVS) version of TC4."}]