[{"count": 0, "tags": [], "creator": "jswap@yahoo.com", "text": "To recreate this problem:\n- Request a page that is protected by realm authentication. You should see the \nlogin page.  \n- Allow enough time to elapse that the session expires (usually 30 minutes)\n- Now try logging in with a valid username and password.  You will see an error \npage with a message to the effect \"Direct reference to the login page\".  \n\nBecause the session expired, the originally requested URL was lost by the \ncontainer.  This should never happen as it is very frustrating and confusing to \nthe end-user.  The obvious solution is to save the URL as a request parameter, \nrather than saving it in the user's session.", "id": 33204, "attachment_id": null, "bug_id": 18005, "creation_time": "2003-03-14T17:58:27Z", "time": "2003-03-14T17:58:27Z", "is_private": false}, {"count": 1, "attachment_id": null, "creator": "markt@apache.org", "text": "Could you provide more information regarding the use case for this. I can't \nsee a situation where a user would request a page, receive the login form and \nthen not attempt to login for anything more than the session timeout unless \nthe session timeout is extremely short.\n\nWithout a valid use case, I am minded to resolve this as invalid.", "id": 53971, "time": "2004-03-14T19:49:17Z", "bug_id": 18005, "creation_time": "2004-03-14T19:49:17Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 18005, "text": "Here's a use case:\n\n- User requests a protected page, and gets the login page.\n- User's friend stops by and says it's time to go to lunch.\n- User comes back an hour later and tries to login.  \n- User gets the \"direct reference to the login page\" error.\n- User clicks the \"Back\" button on their browser and repeatedly tries logging \nin, but to no avail.\n- User then wastes his time and others' by calling the help desk, asking why \nthe site is down.\n\nGranted, this does not happen a lot; however, it should not happen at all.  \nFurther, \"not a lot\" is relative.  Can you image how many dozens of times a \nday this problem would occur at a site like yahoo.com? \n\nThis bug is different issue than a user's session timing out after they were \nlogged in.  In the case of a normal timeout, the user will just be prompted to \nlogin again, and they can get back to what they were doing.  However, in the \ncase of timing out on the login screen, it takes semi-expert knowledge on how \nto recover from the problem, and is not at all intuitive.", "id": 53983, "time": "2004-03-14T22:56:26Z", "creator": "jswap@yahoo.com", "creation_time": "2004-03-14T22:56:26Z", "tags": [], "is_private": false}, {"count": 3, "text": "OK. A rare use case but a valid one. I'll have a look and see what I can do.", "bug_id": 18005, "attachment_id": null, "id": 54033, "time": "2004-03-15T19:15:12Z", "creator": "markt@apache.org", "creation_time": "2004-03-15T19:15:12Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 18005, "attachment_id": null, "text": "I should probably also mention that there is a work-around for this problem.  \nBy placing the following tag into the head of the login page's html, the \nsession won't timeout:\n\n<META HTTP-EQUIV=\"Refresh\" CONTENT=\"600\">\n\n\n", "id": 54038, "time": "2004-03-15T21:38:37Z", "creator": "jswap@yahoo.com", "creation_time": "2004-03-15T21:38:37Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 18005, "text": "The best I can do with this is a better error message. I'll post a fix for \nthis shortly.", "id": 54039, "time": "2004-03-15T22:06:16Z", "creator": "markt@apache.org", "creation_time": "2004-03-15T22:06:16Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 18005, "attachment_id": null, "id": 54040, "time": "2004-03-15T22:26:37Z", "creator": "markt@apache.org", "creation_time": "2004-03-15T22:26:37Z", "is_private": false, "text": "I have added an improved error message for this scenario in TC4 and TC5."}, {"count": 7, "tags": [], "bug_id": 18005, "attachment_id": null, "text": "*** Bug 27754 has been marked as a duplicate of this bug. ***", "id": 54189, "time": "2004-03-17T20:59:04Z", "creator": "markt@apache.org", "creation_time": "2004-03-17T20:59:04Z", "is_private": false}]