[{"count": 0, "tags": [], "text": "I have tried numerous ways to fix this problem, and I am stuck!\nI've searched the bug db, and I can't find anything about it.\nI've searched the web and can't find solutions to it, but have found others \nw/same issue.\nI have tried shutting down all other processes except apache & apache still \ntakes up 100% CPU.\nI am using Windows XP Professional (2600).\nI would really like to use Apache2, and haven't had this issue with earlier \nversions (1.3)... has anybody ran into this issue before???", "is_private": false, "id": 33250, "creator": "iq@atari.net", "time": "2003-03-16T11:33:54Z", "bug_id": 18037, "creation_time": "2003-03-16T11:33:54Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Matt,\n\nAre you aware of the following problem that is fixed in CVS, but not 2.0.44?\n\n  *) Win32: Avoid busy wait (consuming all the CPU idle cycles) when\n     all worker threads are busy.\n\nThe key thing here is that all of the worker threads become busy before the CPU\nis pegged.  Is that possible in your situation?  \n\nCheers, Greg\n", "attachment_id": null, "id": 33697, "creator": "gregames@apache.org", "time": "2003-03-24T15:29:14Z", "bug_id": 18037, "creation_time": "2003-03-24T15:29:14Z", "is_private": false}, {"count": 2, "tags": [], "creator": "fthielem@mplace.de", "attachment_id": null, "id": 34622, "time": "2003-04-07T15:10:02Z", "bug_id": 18037, "creation_time": "2003-04-07T15:10:02Z", "is_private": false, "text": "2.0.45 is not fixing the problem. tried today, fresh install, with and without \n3rd party modules like PHP, with and without hyperthreading, switched off \nblackd and McAfee. 1.3.27 on the same machine doesn't show this behavior. \nOther servers like built-in of phpED works too."}, {"count": 3, "tags": [], "text": "I am having the exact same problem.  No problems with 1.3 but 2.0.45 and \nearlier versions of 2.0 max out CPU and do not allow access to http://localhost\nI have a Dell Latitude notebook with WinXP Professional.  The service starts \nbut I can never access it.", "attachment_id": null, "id": 35479, "creator": "keith_conn@4conns.com", "time": "2003-04-18T02:54:43Z", "bug_id": 18037, "creation_time": "2003-04-18T02:54:43Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 18037, "attachment_id": null, "id": 35525, "creation_time": "2003-04-18T13:48:45Z", "time": "2003-04-18T13:48:45Z", "creator": "slive@apache.org", "text": "Please search the bug database for reports of problems with win32 software\nfirewalls.  Many of them are very broken.\n\nMatt: feel free to reopen this report if you can reproduce the problem after\nuninstalling all virus checkers and firewalls and installing 2.0.45.", "is_private": false}, {"count": 5, "tags": [], "bug_id": 18037, "is_private": false, "id": 42298, "creation_time": "2003-08-06T21:46:07Z", "time": "2003-08-06T21:46:07Z", "creator": "emmanuel_ae@yahoo.com", "text": "On Win XP Pro its Mcafee Virusscan 7 (both home and pro editions) that cause \nthe problem with or without the firewall installed. After uninstalling mcafee \nviruscan 7 and rebooting the problem disappears. \nHowever the problem excessive cpu usage does not occur with apache 1.3. I \nshifted to that and it seems to work fine. That may be a solution.\nI did try to probe a bit into the differences between apache 1.3 and 2.0. \n2.0 has been written from scratch for windows.\nSuperficially the differences that i could see was that 1.3 does not have a \ntray monitor and has a much bigger conf file. \nHowever exiting the apache monitor also does not help.\nIt must be something about apache 2.0's bind code i guess. And i dont think \nasking mcafee to change their product will prove useful. It maybe easier to \nfigure out whats causing the problem in apache 2.0 and fix it. \nTill then use apache 1.3\n\n", "attachment_id": null}, {"count": 6, "tags": [], "creator": "nd@perlig.de", "text": "Blaming Apache for other software's wrong usage of system libraries doesn't make\nthe report valid.\n\nThe difference between 1.3 and 2.0 is, that 2.0 makes actually use of winsock2\nfeatures, which will be broken by (for example) the mcaffee virusscanner. That's it.", "id": 42299, "time": "2003-08-06T22:00:59Z", "bug_id": 18037, "creation_time": "2003-08-06T22:00:59Z", "is_private": false, "attachment_id": null}]