[{"count": 0, "tags": [], "bug_id": 18055, "text": "When using Microsoft's jvc compiler for the javac task, rt.jar from the Java\ninstall running Ant gets included in the compilation classpath. This is a\nproblem since code meant to be compiled with jvc is linked against Sun class\nlibraries which leads to compilation errors.\n\nDelving into the addJavaRuntime() method in org.apache.ant.tools.types.Path\nreveals the following statement intended to be called when using the jvc compiler:\n\nif\n(System.getProperty(\"java.vendor\").toLowerCase(Locale.US).indexOf(\"microsoft\")\n>= 0) {\n   ...\n}\n\nThe problem is this will never get called, as System.getProperty(\"java.vendor\")\nwill return the vendor of the Java install being used to run Ant. Instead, the\nmethod will (incorrectly) add the rt.jar of the Java install running Ant.\n\nThis can be fixed by altering includeJavaRuntime in\norg.apache.tools.ant.taskdefs.compilers.JVC to always be false if no\nbootclasspath has been supplied.", "id": 33280, "time": "2003-03-17T06:16:40Z", "creator": "simon.lieschke@orion.co.nz", "creation_time": "2003-03-17T06:16:40Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 18055, "attachment_id": null, "id": 33435, "time": "2003-03-19T10:24:20Z", "creator": "bodewig@apache.org", "creation_time": "2003-03-19T10:24:20Z", "is_private": false, "text": "The codesnippet actually is for the case where you are running Ant in a VM by\nMicrosoft, not necessarily for running jvc.\n\nI'm not sure that you will always want to set includeJavaRuntime to false when\nrunning jvc and would prefer to leave that decision to the user explicitly.\n\nWhat is wrong with setting the attribute to false in your build files?\n"}, {"attachment_id": null, "tags": [], "creator": "simon.lieschke@orion.co.nz", "text": "From http://ant.apache.org/manual/index.html:\n\n\"Note: The Microsoft JVM/JDK is not adequate on its own, although the MS\ncompiler is supported.\"\n\nThe comment is a bit vague, but I take it to mean that running Ant with a\nMicrosoft VM is not supported. (Correct me if I am wrong.) If this is the case,\nthen why is does Ant have code that is only going to be used if running in a\nMicrosoft VM?\n\nOtherwise if you do actually support running in the Microsoft VM, yes, the user\nshould be given the choice of what to set includeJavaRuntime to. But if we are\ncompiling with jvc from Ant running in the Sun VM, the Java runtime should never\nbe included, as including Sun's Java runtime when compiling with Microsoft's\ncompiler is always wrong. I would argue Ant should be smart enough to work this\nstuff out.\n\nFinally, (and I overlooked this in my original report), we have explicitly set\nincludeJavaRuntime to false, but kept having problems. Having another look into\norg.apache.tools.ant.taskdefs.compilers.JVC reveals includeJavaRuntime is set to\ntrue if I don't specify a bootclasspath.\n\nSo I can get things working by setting includeJavaRuntime to false, and include\na nonsense bootclasspath so includeJavaRuntime is not set to true when running\nAnt using Sun's VM. I am happy to set includeJavaRuntime to false, but I believe\nshouldn't have to include a nonsense bootclasspath for this to work.", "count": 2, "id": 33497, "time": "2003-03-19T22:26:48Z", "bug_id": 18055, "creation_time": "2003-03-19T22:26:48Z", "is_private": false}, {"count": 3, "attachment_id": null, "creator": "bodewig@apache.org", "text": "About the Microsoft VM - I have no idea, I've never tried to run Ant on a\nMicrosoft OS, much less a Microsoft VM 8-)  Ant 1.5.x is supposed to work on\nJava 1.1 compatible VMs, so it might work.\n\nI'll take care of the implicitly re-setting includeJavaRuntime.  BTW, false is\nthe default for the attribute, the docs in 1.5.2 (and earlier) have been wrong.\n", "id": 33526, "time": "2003-03-20T08:55:36Z", "bug_id": 18055, "creation_time": "2003-03-20T08:55:36Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 18055, "is_private": false, "text": "OK, fixed, thanks for the detailed analysis.", "id": 33527, "time": "2003-03-20T09:13:13Z", "creator": "bodewig@apache.org", "creation_time": "2003-03-20T09:13:13Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 18055, "text": "Shouldn't you make it clear whether you support running Ant with a Microsoft VM\nor not? Its no use have code for something that you think might work, but may\nindeed not work. Either it should be supported and work, or not supported.\nAnyway  it's not a big issue since I don't use the Microsoft VM.\n\nYes I realised the docs for the includeJavaRuntime attribute were wrong, I\nlogged that too ;)\n\nAnyway, I'm closing this as I am satisfied with the resolution.", "id": 33575, "time": "2003-03-20T21:53:01Z", "creator": "simon.lieschke@orion.co.nz", "creation_time": "2003-03-20T21:53:01Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 18055, "attachment_id": null, "text": "I am running ant version 1.5.3(.1) and ant -debug shows my javac task (which is \nconfigured to use jvc) is still including the jre\\lib\\ext libraries despite \nhaving the includeJavaRuntime property set to \"no\".  ant is setting the \nclasspath as shown below:\n\n    [javac] '/cp:p'\n    [javac] 'C:\\j2sdk1.4.2\\jre\\lib\\ext\\dnsns.jar;C:\\j2sdk1.4.2\\jre\\lib\\ext\\ldaps\nec.jar;C:\\j2sdk1.4.2\\jre\\lib\\ext\\localedata.jar;C:\\j2sdk1.4.2\\jre\\lib\\ext\\sunjce\n_provider.jar'\n", "id": 42301, "time": "2003-08-06T23:33:11Z", "creator": "sean.rohead@usa.net", "creation_time": "2003-08-06T23:33:11Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 18055, "attachment_id": null, "text": "I have taken out the extdirs for jvc when includejavaruntime is false.", "id": 42407, "time": "2003-08-08T14:36:13Z", "creator": "conor@apache.org", "creation_time": "2003-08-08T14:36:13Z", "is_private": false}]