[{"count": 0, "tags": [], "creator": "hysterisis@indiatimes.com", "is_private": false, "id": 33416, "creation_time": "2003-03-19T09:04:42Z", "time": "2003-03-19T09:04:42Z", "bug_id": 18134, "text": "Hi,\n\nI am using Log4j 1.2.7. The Appender that I am using is the \nDailyRollingAppender.\n\nLogging in the log file stops, if I reload the context using the manager \ncontext of tomcat. I also found that if I set the context as reloadable=\"true\" \nand if I modify a class while tomcat is running and try to access the modified \nclass, logging stops, in such a way that no more logging occurs. \n\nSince my application is going  to be installed on a Shared tomcat instance with \nreloadable=\"true\", can you please let me know as to how I am avoid this problem.\n\nAlthough by staging server is on Windows XP, my production server is going to \nbe Linux, here also I am facing a similar issue.\n\nRegards\n\nKartik Shah", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 18134, "attachment_id": null, "is_private": false, "id": 33471, "time": "2003-03-19T17:16:58Z", "creator": "hoju@visi.com", "creation_time": "2003-03-19T17:16:58Z", "text": "do you call LogManager.shutdown() upon context shutdown?  This can be done in a\nservlet context listener (contextDestroyed()).  If you don't do this, then the\nJVM may keep a handle on your file and not allow another process to write to it\n(the other process, of course, being Log4j in the restarted context).  See if\nthat fixes your issue.\n\nI'm not sure about the \"reloadable\" attribute issue.  However, it is not\nrecommended that you put an app in production with reloadable=\"true\".  That is\nreally meant for ease of development.  I wouldn't trust something that brings\nthat kind of complexity for production.\n\nJake\n\n"}, {"count": 2, "attachment_id": null, "bug_id": 18134, "text": "Thanks a lot.\n\nUsing the Context listener, I was able to get the logger working for reloading \nthe context using the manager context. I have still not test for the reloadable \ncontext. Shall let you know my findings once I do so.\n\nRegards\n\nKartik", "id": 33585, "time": "2003-03-21T05:46:50Z", "creator": "hysterisis@indiatimes.com", "creation_time": "2003-03-21T05:46:50Z", "tags": [], "is_private": false}]