[{"count": 0, "text": "Windows XP (latest patches), McAffe virus scan (latest version), Apache 2.0.44.\n\nI have tried both WebDAV and web pages (with basic authentication).\n\nWhen accessing the Apache-based pages (or Webfolders), very basic pages get \nthrough (i.e. the main page with no authentication), but all other pages hang-\nup Internet Explorer or take a very long time (45 minutes or more) and do not \nallow java applets to be run (probably due to a timeout).\n\nFurthermore, when using DAV, the web folder can only be mounted using:\n\nnet use * http:\\\\ipaddress\\DAVfolder /user:username *\n\nThe command line (cmd.exe) can list files, and you can use the command line \neditor to edit files (or the copy command to copy the files to a local \ndirectory), but when you use Internet Explorer or the windows Explorer, all \nactivity ceases (freezing all copies of Internet Explorer and Explorer, \nincluding the desktop).\nWhen the McAffe virus checker is diabled (or uninstalled), all works fine.\n\nHowever opening any file using the latest Microsoft Word works fine (as if Word \nwas not using explorer nor the GUI shell to list directories and open files).\n\nFurthermore, if you configure McAffe to exclude the mounted Apache data \n(windows drive containing the Web folder mounted using the \"net use\" command), \nthere will be no more problem ... as long as the Web folder is mounted AFTER \nthe user has fully logged in (using the option net use ... /PERSISTENT:YES will \nresult in GUI shell hangup, regardless of the exclusion settings).\n\nI hope I have given enough details, please do not hesitate to contact me for \nmore info.\n\nRegards, and thanks for Apache, great software ;-)", "bug_id": 18140, "is_private": false, "id": 33438, "time": "2003-03-19T11:02:15Z", "creator": "fgenolini@hotmail.com", "creation_time": "2003-03-19T11:02:15Z", "tags": [], "attachment_id": null}, {"count": 1, "text": "Between the Apache Web server and the Windows XP PC there are 2 SonicWall \nfirewalls (different models with different BIOS versions) and a Linux box that \ndoes destination NAT and firewalling.\nMaybe that has an impact on the bug.\n", "bug_id": 18140, "is_private": false, "id": 33441, "time": "2003-03-19T12:06:30Z", "creator": "fgenolini@hotmail.com", "creation_time": "2003-03-19T12:06:30Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 18140, "attachment_id": null, "is_private": false, "id": 33442, "time": "2003-03-19T12:08:54Z", "creator": "fgenolini@hotmail.com", "creation_time": "2003-03-19T12:08:54Z", "text": "This setup used to work under older versions of Apache (2.0.39 I seem to \nremember) and Windows 2000 (or Windows NT).\n"}, {"attachment_id": null, "tags": [], "bug_id": 18140, "text": "\n  This has been reported multiple times - I'm honestly sick of looking up\n  the number.  McAfee doesn't play by the rules of WinSock and there isn't\n  (much) we can do for you.  I'm marking INVALID - you can find the other\n  reports easily enough searching this bugzilla database.\n\n  However, some small changes were made in .45 that could help you - you might\n  try upgrading to bugfixed mcafee software + apache 2.0.45.\n\n  Finally, the next release may contain a WindowsUseAcceptEx or \n  WindowsSocketsWorkaround directive to cripple Apache to Windows 95 semantics,\n  to try blowing past these sorts of buggy firewall/antivirus/vpn filters.\n", "count": 3, "id": 34678, "time": "2003-04-08T06:38:18Z", "creator": "wrowe@apache.org", "creation_time": "2003-04-08T06:38:18Z", "is_private": false}]