[{"count": 0, "tags": [], "bug_id": 18206, "text": "Per this thread:\n\nhttp://marc.theaimsgroup.com/?l=ant-user&m=104499187225668&w=2\n\nAttached is a simple EJB and buildfile that reproduces this behavior.  The\nMANIFEST.MF has an entry on the last line; the ejbjar task removes that entry,\nreplacing it with an empty line.  The jar task preserves that line, adding two\nempty lines at the end of the manifest.", "id": 33572, "time": "2003-03-20T21:35:36Z", "creator": "kadams@gfs.com", "creation_time": "2003-03-20T21:35:36Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 18206, "attachment_id": 5453, "text": "Created attachment 5453\nTest to reproduce this bug", "id": 33573, "time": "2003-03-20T21:37:25Z", "creator": "kadams@gfs.com", "creation_time": "2003-03-20T21:37:25Z", "is_private": false}, {"count": 2, "tags": [], "creator": "conor@apache.org", "text": "Thanks for the detailed test case. Strictly speaking the manifest you have\nprovided is not quite valid. The grammar for a manifest section is as follows:\n(see\nhttp://java.sun.com/j2se/1.4.1/docs/guide/jar/jar.html#Manifest%20Specification) \n\nindividual-section:             Name : value newline *perentry-attribute\n\nYour manifest does not contain the required newline for the last section. \n\nThere is however a note in the spec:\n# Before parsing:\n\nIf the last character of the file is an EOF character (code 26), the EOF is\ntreated as whitespace. Two newlines are appended (one for editors that don't put\na newline at the end of the last line, and one so that the grammar doesn't have\nto special-case the last entry, which may not have a blank line after it).\n\nIt appears the JDK's Manifest class does not do this. You can look at the\nsrc.zip that comes with the JDK to confirm this. (Ant's Manifest does not have\nthis problem).\n\nWe could raise a bug against the JDK but that has already been done\nhttp://developer.java.sun.com/developer/bugParade/bugs/4489716.html\nand rejected (The rejection is bogus in light of the above comment in the spec,\nIMHO).\n\nWorkaround is to add the newlines required to your manifest. We could preprocess\nthe Manifest through Ant's manifest class to handle this. I'll close this as a\nWONTFIX now but feel free to follow up.\n", "id": 34005, "time": "2003-03-28T02:40:31Z", "bug_id": 18206, "creation_time": "2003-03-28T02:40:31Z", "is_private": false, "attachment_id": null}]