[{"count": 0, "tags": [], "bug_id": 18246, "attachment_id": null, "is_private": false, "id": 33638, "time": "2003-03-22T10:40:20Z", "creator": "paul.smith@lawlex.com.au", "creation_time": "2003-03-22T10:40:20Z", "text": "The attached zip file contains some patch files, and some additional files \nwhich extend some classes to support, or to extend support for MDC.\n\nGeneral Changes:\n\n* XMLLayout now includes any MDC details by encoding in CDATA sections MDC \nKey/Value pairs.\n\n* PatternLayout - the %X option used to require a secondary option to indicate \nwhich key to output.  This option is now no longer required, and if not \nspecified, then ALL the MDC Key/Value pairs are output using a format similar \nto Hashtable.toString( e.g.\"{{key1,val1},{key2,val2}}\")\n\nNotes:\n======\n* The patch-dtd-mdcextensions.txt patches the log4j.dtd to allow an log4j:event \nto include MDC details.  This DTD change may not be entirely the way we want to \ngo, and I would appreciate someone with XML experience looking over it a bit \nmore thoroughly as I was not able to test the change as much as I would like.\n\n* patch-src-*.txt - patches XMLLayout, PatternParser, and PatternLayout to \nenable MDC to appear, or to provide additional support.\n\n* patch-test-*.txt - patches some Test case files to validate the source changes\n\n* pattern.mdc.1.properties - a tests/input property file to configure a Test \ncase\n\n* patternLayout.mdc.1 - witness file for the PatternLayout change & test cases\n\n* xmlLayout.mdc.* - witness files for the XMLLayout change & test cases\n\n* Chainsaw has _NOT_ been modified to read in the MDC details from a standalone \nXML file.  My home computer was having a Blue Screen of Death everytime \nChainsaw started up, so I was not able to even start on that change.  Hope to \naddress that @ work during the week."}, {"count": 1, "tags": [], "text": "Created attachment 5465\nSeries of Patch files, plus some additional new files for additional MDC support", "attachment_id": 5465, "bug_id": 18246, "id": 33639, "time": "2003-03-22T10:42:07Z", "creator": "paul.smith@lawlex.com.au", "creation_time": "2003-03-22T10:42:07Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 18246, "attachment_id": null, "is_private": false, "id": 33668, "time": "2003-03-24T07:10:58Z", "creator": "mwomack@apache.org", "creation_time": "2003-03-24T07:10:58Z", "text": "I have applied the source patches, and they look good to me.  I will install \nthe test cases tomorrow, test and review some more, and then check in the \npatches.  Thanks, Paul!"}, {"count": 3, "tags": [], "creator": "mwomack@apache.org", "is_private": false, "id": 33809, "creation_time": "2003-03-26T06:35:51Z", "time": "2003-03-26T06:35:51Z", "bug_id": 18246, "text": "These changes and test cases look good to me, and I have committed them to \ncvs.  A couple of issues to followup on:\n\n1) I would prefer that XMLLayout not sort the MDC keys.  The appender needs to \nbe as fast as possible, and sorting the MDC keys for each output will affect \nperformance.  The test case should be modified to handle the order of the keys \npossibly being different.  Ceki might have an idea on how to do this with some \npattern matching support test code?\n\n2) The order of the keys output for the PatternLayout and helpers/PatternParser \ntest cases could be different for different jvm versions, since the order of \nthe keys is indeterminate.  We'll see if this affects the Gump build/tests.  \nAgain, Ceki might have some idea how to create a pattern match version in the \ntest case.\n\nI had to update the PatternParser_mdc witness file since the %X changes \naffected it (yes, the test cases worked!).  I reviewed the new output and the \ntest case, verified the new output is correct, and checked in a new witness \nfile.\n\nI will leave this bug open for now so tht we can deal with the two issues.  \nThanks for the changes, Paul.  Well done.", "attachment_id": null}, {"count": 4, "tags": [], "text": "Marking this as closed.  Not sorting the MDC keys is a potential performance enhancement, but might not \noffer much benefit.  At least not enough to motivate somebody to change the test cases, etc.", "is_private": false, "id": 92801, "creator": "carnold@apache.org", "time": "2006-08-31T15:42:03Z", "bug_id": 18246, "creation_time": "2006-08-31T15:42:03Z", "attachment_id": null}]