[{"count": 0, "tags": [], "bug_id": 18258, "attachment_id": null, "id": 33657, "time": "2003-03-23T19:00:29Z", "creator": "steve5m@yahoo.com", "creation_time": "2003-03-23T19:00:29Z", "is_private": false, "text": "If you have a jsp with a jspInit method, and you preload this jsp, the jspInit \nmethod gets called, as it should, upon server startup. But now if you hit that \njsp with your web browser, Tomcat calls the jspInit method again. (If you hit \nthe jsp a second time, it's ok, doesn't call jspInit a third time.)\nI will attach a war file that demonstrates this problem. Simply load this \napplication (test_app.war) and two pages (preload1.jsp, preload2.jsp) each \nprint out that their jspInit methods are called. Then hit the pages \n(http://host:port/test_app/preload1.jsp, etc.) and see that they print out (to \nSystem.out) that their jspInit methods are called once more.\n\nNote I did previously file this same bug against Tomcat 4.1.16 (bug#15084) but \nI thought it was probably good to file again against the current release\nso it is clear the problem still exists.\n\nWhy this is issue is important to me: I often do something fairly intenstive \nin my init methods, like load some data from a database (to cache it) - I don't\nwant this happening twice for no good reason.\n\nPlease note that other servlet containers, including Tomcat 3.x, Tomcat 4.0.6, \nWeblogic 7, and Resin, don't exhibit this \"double-init\" behavior."}, {"count": 1, "attachment_id": 5471, "creator": "steve5m@yahoo.com", "text": "Created attachment 5471\ntest war file", "id": 33658, "time": "2003-03-23T19:01:25Z", "bug_id": 18258, "creation_time": "2003-03-23T19:01:25Z", "tags": [], "is_private": false}, {"count": 2, "text": "I had already commented on the original bug (and had examined carefully your\ntest case), and determined it was not a bug. Please don't file duplicates, it\ndoes not help (you can update the original bug instead).\n\n*** This bug has been marked as a duplicate of 15084 ***", "creator": "remm@apache.org", "attachment_id": null, "id": 33659, "time": "2003-03-23T19:08:23Z", "bug_id": 18258, "creation_time": "2003-03-23T19:08:23Z", "tags": [], "is_private": false}]