[{"attachment_id": null, "tags": [], "bug_id": 18337, "text": "There is no documentation (that I could find) indicating that the order of \nAddModule statements within the configuration file.\n\nThis was apparent when attempting to use VirtualDocumentRoot and UserDir \noperators.  The idea configuration would be to have document roots specified by \nthe hostname, except where ~<uid> was used in the path.  In this case, the \npublic_html directory specified by UserDir should take precidence.\n\nIn the initial configuration, AddModule mod_userdir.c preceeded AddModule \nmod_vhost_alias.c.  This caused all ~<uid> requests to be mapped to the \ndocument root of the host.  After swapping the two directives (mod_userdir.c \nafter mod_vhost_alias.c), the ~<uid> requests were successful as well as \nvirtual document root request.\n\nHad this been documented in the AddModule reference, a couple of hours work \nwould have been saved.", "count": 0, "id": 33786, "time": "2003-03-25T20:02:32Z", "creator": "jjolly@mindless.com", "creation_time": "2003-03-25T20:02:32Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 18337, "is_private": false, "text": "Not a bad sugestion.  But the best we can do is say \"AddModule order is\nimportant\" and perhaps provide an example.  There are too many particular\ninteractions to document all of them.\n\nThis problem goes away in 2.0 where module ordering is determined by the\nmodules themselves.", "id": 33805, "time": "2003-03-26T02:26:16Z", "creator": "slive@apache.org", "creation_time": "2003-03-26T02:26:16Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 18337, "text": "I think the suggestion to document that \"AddModule order is important\" with an \nexample is a good one.  Even including a statement after the example indicating \nmodule interaction is very complex and not all possible interactions can be \nshown.\n\nA couple more specifics, though.  It might be good to explain a little how \nmodule loading occurs.  That the modules are accessed in order from the last \nAddModule, bottom-up to the first AddModule.  Also, describing that a module \ncan indicate that it has handled a particular job (such as redirection in my \ncase) and Apache at that point will stop calling other modules.\n\nJust some suggestions.  As you can see, my documentation skills are very \nunderdeveloped so I rely on people more adept at writing documentation to \norganize the ideas I have into a more lucid form.  So far, I think the changes \nsuggested will help conciderably.", "id": 33837, "time": "2003-03-26T16:28:54Z", "creator": "jjolly@mindless.com", "creation_time": "2003-03-26T16:28:54Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 18337, "text": "Doc updated with a note on AddModule ordering.\n\nThanks for your suggestion.", "id": 34585, "time": "2003-04-06T18:02:44Z", "creator": "slive@apache.org", "creation_time": "2003-04-06T18:02:44Z", "is_private": false, "attachment_id": null}]