[{"count": 0, "tags": [], "text": "AFAIK Servlet API v2.3 defines that in case of URL rewriting session id should \nbe put into the uri before query params separated by semicolon, like:\n\nwww.xxx.com/uri;jsessionid=...?params\n\nThe problem is, that MS IIS doesn't let such URL go through to the application \nserver, at least not using forwarding by extension – it just doesn’t recognize \nthe extension it should.\n\nUsing the previous API (session id as one of the query params) worked perfectly.\n\nNow currently we use WebLogic v6.1 as our application server. Starting with SP3 \nI can set a dedicated parameter forcing WLS to use a query param instead \nof “;jsessionid” in the uri.\n\nWe are now planning to migrate from WLS to Tomcat, but: I have looked into \nTomcat’s source code, this method of rewriting URLs is not parametrized, so I \ncannot persuade Tomcat to do the same.\n\nPossible solutions:\na)\tget a fix for IIS – our webmaster has called MS, they say they knew \nabout it but did not plan to do anything. We could make our own isapi DLL, but \nwe are on our own. In fact we do use IIS v4, because of instabilities in IIS v5 \n(says our webmaster).\nb)\tforward based by path not the extension: it hasn’t been tested so is \nnot guaranteed to work, and we have so many apps using the same path for static \nand dynamic content, where the static content should remain on IIS, and where \nstatic is under the control of CMS, that it might be even more difficult than \nto make an isapi.dll :-)\nc)\tmake a Tomcat specific filter (valve, connector – I am yet not sure), \nwhich would parse outgoing responses and exchange “;jsessionid=…” with a query \nparam, then parse incoming requests and set sessionid based on this param\nd)\tpatch Tomcat using inheritance. Not so easy, since the required methods \n(HttpProcessor.processRequest, HttpResponseBase.toEncoded) are private. \nHttpResponseFacade is final, so I can’t overwrite encodeURL as well. Make my \nown Façade?\ne)\tpatch Tomcat: don’t like the idea, since I am then cut off from the \nfuture Tomcat development\nf)\tsimilar solution as WLS: a parameter that decides how to construct URLs \nduring rewriting. Is it sensible? What would you say to that?\n\nAny other ideas?", "is_private": false, "id": 33820, "creation_time": "2003-03-26T12:04:46Z", "time": "2003-03-26T12:04:46Z", "creator": "tomasz@rtsoftware.com", "bug_id": 18361, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 18361, "text": "Another solution: \n\nDon't use IIS.  Use Apache's http server to front Tomcat.  We did this on our \nwin2k servers and even noticed a marked speed improvement (and that's with \nonly using the mod_proxy).  Plus we were finally able to use mod_gzip!", "id": 33823, "time": "2003-03-26T14:17:09Z", "creator": "cbendell@point2.com", "creation_time": "2003-03-26T14:17:09Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 18361, "text": "This one is out of question. \n\nThe whole story happens in a multi-thousand-employees company - the inert ion \nof such a big animal is enormous. Actually the applications servers and web \nservers do not belong to the same department. We have absolutely no influence \non what web server do the others choose, besides they have software relying on \nIIS that must be used. \n\nThe good (and surprising) is that they take apache into account at all, just \nthat it will take some time until they have tested it and found replacements \nfor all the stuff they have.\n\nAnd waiting until they migrate to apache is another solution that won’t work.\n", "id": 33826, "time": "2003-03-26T14:45:10Z", "creator": "tomasz@rtsoftware.com", "creation_time": "2003-03-26T14:45:10Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "cbendell@point2.com", "attachment_id": null, "is_private": false, "id": 33827, "time": "2003-03-26T14:58:44Z", "bug_id": 18361, "creation_time": "2003-03-26T14:58:44Z", "text": "IIS doesn't handle forwarding very well in the first place.  This is an IIS \nlimitation  - not a tomcat limitation.  You could try forwarding by path (I'm \nassuming you are using BEA's wlforward ISAPI plugin)."}, {"count": 4, "tags": [], "creator": "tomasz@rtsoftware.com", "is_private": false, "id": 33835, "attachment_id": null, "bug_id": 18361, "creation_time": "2003-03-26T16:01:43Z", "time": "2003-03-26T16:01:43Z", "text": "I have never stated that this were a Tomcat limitation, I was just looking for \na feedback from Tomcat community  - and I got it. That’s okay.\n\nOTOH IIS with its limitations is fact of life, organisations like mine also. In \nthis case BEA has chosen a solution that’s easy for its customers, even if it \ndoesn’t follow the standard and we were happy they did it - don’t take me \nwrong, I now Tomcat is open source and nobody gets paid for the working on it, \ncontrary to people working on BEA WebLogic. \n\nIf the migration starts and the only solution my boss accepts would be to patch \nTomcat, would you accept a change (I already submitted patches for Eclipse for \nthat matter)? Or would you say “it’s non-standard so we won’t use it”?\n"}]