[{"count": 0, "attachment_id": null, "bug_id": 18436, "text": "I'm seeing some inconsistant behavior when using a ServletContextListener in \nregards to JNDI lookups.  My ServletContextListener kicks off a process which \nneeds to do some resource cleanup (it's getting pooled data connections via \nJNDI) in the contextDestroyed() method.  This resource cleanup happens to be \ntaking place in a different thread than ServletContextListener is running in.\n\nIf I \"reload\" my application, everything works great.  If I simply remove my \napplication (or shut down Tomcat), I run into problems.  Apparently the JNDI \nresources are unavailable in threads outside the main one.\n\nIt seems to me that all the Context's resources should be available when the \ncontextDestroyed() method is called, but maybe that's just my interpretation of \nthe servlet specs.  In any case, behavior should be consistent between an \napplication reload and an application stop + start.\n\nTaking a quick look at the code, it should just be a matter of changing the \norder of where listenerStop() is called in the stop() and reload() methods in \nStandardContext.  I'd suggest moving it directly after the filterStop() call \nbut before the Lifecycle STOP_EVENT is issued.  That would more closely \nresemble a mirror image of the start() method.  But what do I know...\n\nI'm attaching a war file which should demonstrate the behavior.", "id": 33997, "time": "2003-03-28T01:08:42Z", "creator": "mike.vannoord@brainna.com", "creation_time": "2003-03-28T01:08:42Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 18436, "attachment_id": 5550, "text": "Created attachment 5550\nHere's a WAR file which will kick out some statements to standard out when it is loaded and unloaded.", "id": 33998, "time": "2003-03-28T01:11:21Z", "creator": "mike.vannoord@brainna.com", "creation_time": "2003-03-28T01:11:21Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 18436, "text": "Listener stop is done earlier. This should fix the issue. The fix will be in \n4.1.25 (and 5.0.2).", "id": 36322, "time": "2003-04-29T20:37:13Z", "creator": "remm@apache.org", "creation_time": "2003-04-29T20:37:13Z", "is_private": false, "attachment_id": null}]