[{"count": 0, "tags": [], "creator": "jeremy_a@bigfoot.com", "attachment_id": null, "text": "JMeter's resizing behavior isn't ideal.  In particular, if your JMeter window is\nlarge, and then you switch to a new component, then make the window smaller, the\ncomponent will not resize.  Instead, scrollbars will appear and the component\nwill remain the same size.\n\nThe cause of this behavior is in the MainFrame class.  When a new component is\nselected, it will set the component's preferred size to the current available\nspace.  Since the component is inside a scrollpane, this means that the\ncomponent will never resize below this currently available space, resulting in\nthe behavior described above.\n\nThe fix for this in MainFrame is quite simple.  But unfortunately, many of the\nJMeter components rely on this behavior to get a reasonable initial size.  So\nseveral other components need to be updated when this change is made.\n\nThe patch I'm attaching includes the MainFrame fix as well as adjustments to\nseveral other components which obviously needed it.  I took a quick look at each\nof the components and I think I caught all of the key ones, but I can't promise\nthat all of the components will start with a reasonable size and resize properly\nafter this fix.  If you find a component that is not correct, please let me know\nand I'll work on it.", "id": 34138, "time": "2003-03-30T21:53:20Z", "bug_id": 18503, "creation_time": "2003-03-30T21:53:20Z", "is_private": false}, {"count": 1, "tags": [], "creator": "jeremy_a@bigfoot.com", "attachment_id": 5567, "text": "Created attachment 5567\nPatch to fix MainFrame and various components", "id": 34139, "time": "2003-03-30T21:54:04Z", "bug_id": 18503, "creation_time": "2003-03-30T21:54:04Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jeremy_a@bigfoot.com", "attachment_id": null, "text": "Added [PATCH] to Summary", "id": 34140, "time": "2003-03-30T21:54:46Z", "bug_id": 18503, "creation_time": "2003-03-30T21:54:46Z", "is_private": false}]