[{"text": "Currently, main targets that show up in ant -projecthelp are determined by \nwhether or not the target has a description attribute.  This is somewhat \nannoying when I have target names that are pretty much self-explanatory and I \ndon't want to bother with a description.\n\nI've observed an interesting convention where non-main targets are prefixed \nwith a \"-\".  This really improves the ability to glance at build file source \nand know what are the main targets and what are the helper targets.\n\nSo what I propose is that -projecthelp uses a standard (and/or configurable) \nprefix to determine non-main targets.", "tags": [], "bug_id": 18506, "attachment_id": null, "count": 0, "id": 34148, "time": "2003-03-31T03:55:01Z", "creator": "j.c.yip@computer.org", "creation_time": "2003-03-31T03:55:01Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 18506, "attachment_id": null, "text": "I am going to be cruel here and leave as is. You may think your targets are self\nexplantory, but they may not be in a years time, which is why if you want to\ndifferentiate entry points and helper targets, you have to describe them. It's\nfor your own good. If you leave off any descriptions, then all your targets get\nlisted.\n\nthe - prefix convention is actually more than a convention, its a trick that\nknows that you cannot call any target with the - prefix from the command line,\nalmost, but not quite, a scope marker. ", "id": 34149, "time": "2003-03-31T04:55:51Z", "creator": "stevel@apache.org", "creation_time": "2003-03-31T04:55:51Z", "is_private": false}, {"count": 2, "tags": [], "text": "Heh, just learned that the \"-\" prefix was a trick.  Will this continue to be \nsupported in future releases?\n\nYou shouldn't have said \"It's for your own good.\"... :)\n\nAs a counter argument, differentiating entry points and describing targets are \ntwo logically separate tasks.  It's not immediately obvious to a new user that \nadding a description marks a target as an entry point since why wouldn't you \nwant to add descriptions to helper targets as well?  It would seem preferable \ninstead to have a way to explicitly define an entry point or helper target that \nis not associated with descriptions.\n\nI would expect most entry point target names to be chosen such that they are \ncompletely obvious in terms of what they do, even in a years time.  Those that \nare more complicated would have descriptions.\n\nBorrowing an example from Java Development with Ant, starting p.350:\n\nXML comment says \"Default starting point\", no description...\n<target name=\"main\" depends=\"ear\"/>\n\nI might have renamed clean to clean-all and would have removed the description.\nI would have renamed build-db to build-sample-db\nI would have removed the description from middlegen, xdoclet, compile, ejb-jar, \nand ear\n\nI don't see how the descriptions added value at all.  I don't see how this is \ndifferent from using comments to make up for bad identifier names.  We want \nclear, understandable, and maintainable build files which is not equivalent to \ndescriptions on every entry point.", "attachment_id": null, "bug_id": 18506, "id": 34159, "time": "2003-03-31T09:36:02Z", "creator": "j.c.yip@computer.org", "creation_time": "2003-03-31T09:36:02Z", "is_private": false}, {"count": 3, "tags": [], "text": "1. Nobody has any plans to kill the '-' prefix trick, because its a side effect\nof us using - as the prefix for ant commands.  \n\n2. yes, we should have put a comment in on the JDwA example you cite :) And I\nagree, description could be decoupled from scope.\n\nThere are (open) enhancement reqs for us to actually provide scope (public,\nprivate) to ant. They are still open as we havent decided what to do there.", "attachment_id": null, "bug_id": 18506, "id": 34194, "time": "2003-03-31T17:12:33Z", "creator": "stevel@apache.org", "creation_time": "2003-03-31T17:12:33Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 18506, "attachment_id": null, "text": "I just want to add that is you want to document your ANT code you are wellcome \nto use <!-- Comments --> on the XML file. Description tags are provided\nto have the content of what to display on the -projecthelp.\n", "id": 34461, "time": "2003-04-03T18:16:58Z", "creator": "j_a_fernandez@yahoo.com", "creation_time": "2003-04-03T18:16:58Z", "is_private": false}]