[{"count": 0, "tags": [], "creator": "jph@us.ibm.com", "attachment_id": null, "text": "I've deployed a servlet that uses container-managed security, meaning that \nI use the <security-constraint> tag in my web.xml file specifying a \n<url-pattern> of the pages I want to protect, which in my case is all the \npages except the login and login failure pages (and a couple of image files).  \nThis all works fine.  The problem is that my users are frequently complaining \nthat they get login failures (i.e., they see my login failure page).  When \nthis happens, I see the message:\n\n        From login without a session\n\non the Tomcat console.  What appears to be going on is that people are\nsaving the URL of the login page as a bookmark, and starting from that page\nlater instead of the welcome page, which is URL I sent them.  The result is \nthat AccessInterceptor.java finds no existing session once login\ncompletes, and gives the error message I listed above.\n\nIt seems to me that in this case AccessInterceptor could create a new \nsession.  The only information it appears to need from the session is the \nURL to redirect to upon a successful login.  I suggest that if no \n\"tomcat.auth.originalLocation\" attribute is found in the session, that it\nredirect instead to the servlet's welcome page.  I realize that in the\ngeneral case, the welcome page may not be in the protected area, but\neven in that case, it still seems like the most reasonable place to \nredirect to.\n\nThe reason I think it would be useful to fix this is that I find it\ndifficult to explain to my users why they can bookmark any page, including\npages in the protected area, just not the login page.  Since the login\npage is the first page they see rendered by the browser when they try to\naccess the URL I give them, it is the natural one for them to want to \nbookmark.\n\nI encountered this with Tomcat 3.2.1.  From examining the source code, \nTomcat 3.3 seems to behave the same.  I tried looking at Tomcat 4, but\ncouldn't find the equivalent place in the code, so I don't know how it\nbehaves.", "id": 2606, "time": "2001-05-22T11:52:23Z", "bug_id": 1861, "creation_time": "2001-05-22T11:52:23Z", "is_private": false}, {"count": 1, "tags": [], "text": "AFAIK this is how the spec is written, and de addition you suggest will make \nTomcat a non compliant container..\n\nI sugest to follow the later conversations on Tomcat-dev to get a explanation \nof how it's now and how the Spec is made in this regards..\n\nWith one big caveat, from the spec it's suppoused that the login page is \nforwarded not redirected.., so a user is unable to bookmark the login page at \nanytime, currently Tomcat 3.x does a redirection instead of a forward , thus \npermitting users bookmark the page.., \n\n", "attachment_id": null, "bug_id": 1861, "id": 3286, "time": "2001-06-26T17:00:05Z", "creator": "nacho@apache.org", "creation_time": "2001-06-26T17:00:05Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jph@us.ibm.com", "attachment_id": null, "text": "I've finally gotten a chance to examine the proposed final draft of the Servlet\nspecification 2.3, 2nd version.  I cannot find anything that implies that my\nsuggestion would violate the specification.  In fact, the specification seems to\nbe deficient in describing how a login should be handled if the login page was\nnot shown because of an attempt to access the protected resource.  The closest\nmention is in section SRV.12.5.3.1, where it says \"If the form based login is\ninvoked because of an HTTP request, the original request parameters must be\npreserved by the container for use if, on successful authentication, it\nredirects the call to the requested resource.\".  But there is no description\nanywhere of how to handle the login if it was NOT triggered by an HTTP request\nfor a protected resource.  So I continue to believe my suggestion is a valid and\nreasonable way to handle that situation.\n\nAlso, I cannot find any statement in the spec to confirm your assertion that a\nforward should be used to show the login page.  Section SRV.12.5.3 of the spec\ndescribes that processing, and it doesn't say whether a forward or a redirect\nshould be used.", "id": 3841, "time": "2001-07-19T08:19:40Z", "bug_id": 1861, "creation_time": "2001-07-19T08:19:40Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 1861, "text": "The reason we do a redirect is simple - most people use relative links in the\nlogin page, and expect them to be relative to the login page - not to the\noriginal request ( which can be anywhere ). In other words, if we don't\nredirect  the login page can't use relative links. \n\nAs for your sugestion - it makes sense, even if the spec doesn't mention what\nshould happen if the user goes directly to the login page. Patches are welcomed,\nif not - as soon as we get the time, it's not a showstoper ( even if it would be\nvery nice to solve this )\n", "id": 4756, "time": "2001-08-22T22:05:59Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-08-22T22:05:59Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 1861, "text": "*** Bug 4048 has been marked as a duplicate of this bug. ***", "id": 6646, "time": "2001-10-12T13:05:12Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-10-12T13:05:12Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 1861, "text": "The reason I entered this bug as bug #4048 is that 1. I did not find this bug \nwhen I searched the bug databasae and 2. Weblogic forwards the user to one of \nthe listed welcome pages when the forward address is null. This led me to \nthink that it is a bug in Tomcat. I do not know how other application servers \nhandle this condition, but forwarding to a welcome page seems reasonable.\n", "id": 6651, "time": "2001-10-12T15:38:47Z", "creator": "curtis@radsoft.com", "creation_time": "2001-10-12T15:38:47Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 1861, "attachment_id": null, "id": 6672, "time": "2001-10-13T04:16:10Z", "creator": "Tonu.Poeld@andmevara.ee", "creation_time": "2001-10-13T04:16:10Z", "is_private": false, "text": "This bug was also present in Tomcat 4.0. They solved it by returning \nBAD_REQUEST response. (bug #4104, bug #3839)"}, {"count": 7, "tags": [], "bug_id": 1861, "attachment_id": null, "id": 6699, "time": "2001-10-14T20:59:12Z", "creator": "jph@us.ibm.com", "creation_time": "2001-10-14T20:59:12Z", "is_private": false, "text": "Returning BAD_REQUEST is an interesting way to solve the protocol conundrum, but\nin no way improves the usability problem.  With this implementation, if my users\ngo to the bookmark for the login page, I imagine they will get an error page\nfrom their browser after attempting to log in.  This will result in a phone call\nto me, as the author of the servlet, just as surely as it does now when the\nlogin failure page is shown.  It is not, in my opinion, as good a solution as\nsimply redirecting to the welcome page."}]