[{"count": 0, "attachment_id": null, "creator": "zipc@jnana.com", "text": "When I generate an FO file and pass it to FOP in java, my PDF output doesn't \nhave special characters rendered properly (like bullets, & copyright [©] \nsymbols for example). However when I run FOP from the command line with the \nsame identical FO file as input, the special symbols are rendered correctly in \nthe PDF output.\n\nIt seems as though the command line FOP is encoding the text, thus allowing \nspecial chars to be handled properly.  Can you tell me how to set the proper \nFOP options in java so that this encoding takes place the the special chars can \nbe handled correctly?\n\nThanks,\n\nZip", "id": 34656, "time": "2003-04-07T23:32:55Z", "bug_id": 18787, "creation_time": "2003-04-07T23:32:55Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": null, "creator": "jeremias@apache.org", "text": "You should ask this kind of question on the fop-user mailing list. Bugzilla is \nfor reporting bugs, posting requests for enhancement and patches.\n\nIt's difficult to tell what you're doing wrong without seeing your code. Have \na look at the embedding examples in the examples/embedding directory. The \nclass ExampleFO2PDF.java should work with special characters. Compare that \ncode to yours. In case you have special fonts you register with the -c \nargument on the command line make sure you initialize the Options class. See \nthe Embedding page on the FOP site on how to do this. If you have any more \nquestions please post them on the fop-user mailing list. This way, more people \nwill also profit from answers.", "id": 34675, "time": "2003-04-08T06:26:23Z", "bug_id": 18787, "creation_time": "2003-04-08T06:26:23Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 18787, "attachment_id": null, "id": 156758, "time": "2012-04-01T13:52:19Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:52:19Z", "is_private": false, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs"}]