[{"count": 0, "tags": [], "creator": "tony@absolutejava.com", "attachment_id": null, "text": "Hello,\n\nI've submitted this issue to both the Tomcat Users List and Tomcat Developer's \nList. As far as I can tell this seems to be a documentation bug (but I'm not \n100% sure). My comments are based on a \"fresh install\" of TC v4.1.24 on Win 2k.\n\nPlease go to \"http://jakarta.apache.org/tomcat/tomcat-4.1-\ndoc/config/context.html\"\n\nHere's a quote from that page:\n\n\"...you MUST define a Context with a context path equal to a zero-length \nstring. This Context becomes the default web application for this virtual host, \nand is used to process all requests that do not match any other Context's \ncontext path.\"\n\nOkay, that makes sense, but then when I look at conf/server.xml I see this:\n\n<!-- Tomcat Root Context -->\n<!--\n    <Context path=\"\" docBase=\"ROOT\" debug=\"0\"/>\n-->\n\n\nWhy is this commented out? According to the documentation cited above there\nMUST be a \"context path equal to a zero-length string\". The quote I cited\nseems to contradict what I'm seeing in server.xml.\n\nEven though the <Context> element is commented out TC seems to run fine, in \nspite of what the documentation says. It seems teh \"ROOT\" directory is being \nprocessed as teh default context.\n\nBased on what people on the Tomcat User and Developer's List have said, the \nname \"ROOT\" is special. In other words, if I have a context named \"ROOT\" in \nwebapps then I do *not* need a \"context path equal to a zero-length string\", in \nspite of what the documentation says.\n\nThe fact that \"ROOT\" seems to be a \"special\" name is not mentioned in the \ndocumentation. So, either this is a documentation omission or, possibly Tomcat \nis picking up ROOT as the default context when in fact it shouldn't be.\n\nCan someone let me know the status of this?\n\nThanks.", "id": 34663, "time": "2003-04-08T01:28:41Z", "bug_id": 18790, "creation_time": "2003-04-08T01:28:41Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 18790, "is_private": false, "id": 35499, "attachment_id": null, "creator": "remm@apache.org", "creation_time": "2003-04-18T13:24:13Z", "time": "2003-04-18T13:24:13Z", "text": "I don't think the current documentation really targets \"doc lawyers\", so you\ncould likely file 100 bugs like this one. Experimenting during a fraction of the\namount of time it took you to write thise would have brought an answer, which,\nas you would have found out, is logical and simple enough (at least to me).\n\nDedicated people willing to expand the Tomcat docs are welcome to contribute\nstuff (but, please, no one line patches, we would be looking at ovehauls, not\nsmall incremental changes)."}, {"count": 2, "tags": [], "bug_id": 18790, "attachment_id": null, "is_private": false, "id": 35652, "time": "2003-04-20T06:07:51Z", "creator": "tony@absolutejava.com", "creation_time": "2003-04-20T06:07:51Z", "text": "Yes, you are correct when you say, \"Experimenting during a fraction of the\namount of time it took you to write this would have brought an answer...\"\n\nBut think of the hundreds or thousands of users having to do the *same* \nexperiment to reach the *same* conclusion: that ROOT is \"special\".\n\nThat's why I took the time to write the original report. Two or three sentences \nof added explanation in the docs could clarify this point and save many users \nfrom wasting time \"experimenting\".\n\nReally, I have to say this is a very sloppy attitude -- expecting users to \nexperiment in order to determine correct behavior when it's so simple to add a \nsingle sentence to the docs. Why are you not interested in incremental \nimprovements to the docs? The docs are just as important as the underlying \ncode. Think of these small doc changes as being analogous to \"bug fixes\" to the \ndocumentation.\n\nActually, the issue is quite black and white. It has nothing to do with being \na \"doc lawyer\". The documentation clearly states: \"...you MUST define a Context \nwith a context path equal to a zero-length string.\" This sentence is simply not \ntrue. It has nothing to do with being a \"doc lawyer\". The existing \ndocumentation is flat out wrong. There's nothing subtle about it.\n\nI'm just trying to help. You (not you, personally) ask for bugs in the \ndocumentation, right? Well here it is."}]