[{"count": 0, "tags": [], "bug_id": 18890, "attachment_id": null, "id": 34847, "time": "2003-04-10T04:01:27Z", "creator": "paul.smith@lawlex.com.au", "creation_time": "2003-04-10T04:01:27Z", "is_private": false, "text": "The attachment contains some patches and some new files. \n\nThe patch modifies PatternParser to allow a PatternLayout to use %P to output \nall the Property KVP for the event, or %P{key} to output a single value for \nthat key (exactly the same as MDC now does).\n\nPatch also modifies XMLLayout to output the contents of the propertySet, and \nthe log4j.dtd has been modified to specific the allowable log4j:propertySet as \nan element of the event, containing log4j:data (thanks to Scott Deboy for some \ncode which he gave me, I tweaked only minorly).\n\nNote: The property keys are sorted as MDC is done, and I know this is not \nideal, but when the group can decide the best way to co-ordinate this for \ntesting runs only, I can patch both MDC & Property set stuff. \n\nPatch also patches some test cases, which uses the additional files as \nwitnesses. \n\nHope I haven't stuffed anything up.\n\ncheers,\n\nPaul Smith"}, {"count": 1, "tags": [], "creator": "paul.smith@lawlex.com.au", "attachment_id": 5760, "is_private": false, "id": 34848, "time": "2003-04-10T04:02:08Z", "bug_id": 18890, "creation_time": "2003-04-10T04:02:08Z", "text": "Created attachment 5760\nPatches and new files for propertySet support"}, {"count": 2, "tags": [], "text": "Paul, you're a committer now, so you have the ability to commit your own \npatch ;)  Because it's been a year and a half since this issue was opened, I'm \nassuming you've lost interest, so I'm closing this item.  If you're still \ninterested, by all means feel free to commit these changes or even simply \nreopen this Bugzilla issue, changing its version to 1.3 so we know it's current \nand relevant.", "attachment_id": null, "bug_id": 18890, "id": 68511, "time": "2004-12-14T21:23:13Z", "creator": "yoavs@computer.org", "creation_time": "2004-12-14T21:23:13Z", "is_private": false}]