[{"count": 0, "tags": [], "bug_id": 18950, "attachment_id": null, "is_private": false, "id": 34959, "time": "2003-04-11T11:07:21Z", "creator": "jkb@stian.freeserve.co.uk", "creation_time": "2003-04-11T11:07:21Z", "text": "It would be useful to be able to specify a jar file which was to be updated \nwith any new class files created. This might speed up incremental builds.\n\n[[Might be tricky to work out the names of nested class files.\nOne way might be to parse the -verbose output; another might be to write the \nclass files into a temporary directory first.]]\n\nIf the target jar file did not exist, then the update command should probably \nbe ignored, as the build is probably a full build."}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "text": "If the jar is on the classpath (and it is probably going to end up there, at least\nfor <javac>), you won't be able to alter its content on Windows - it will be\nlocked.\n\nIf you manage to change the jar (on Unix systems for example) you run a good chance\nof destroying the stability of your VM.  Many VMs scan the CLASSPATH upfront and\nget really confused if an archive changes during their lifetime.", "id": 34967, "time": "2003-04-11T13:29:15Z", "bug_id": 18950, "creation_time": "2003-04-11T13:29:15Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jkb@stian.freeserve.co.uk", "attachment_id": null, "id": 35064, "time": "2003-04-12T17:59:17Z", "bug_id": 18950, "creation_time": "2003-04-12T17:59:17Z", "is_private": false, "text": "Point taken - but one doesn't have to use the feature if it causes problems.\n\nI was thinking of projects such as JMeter, where the output jars (apart from \njorphan) are not on the classpath."}, {"count": 3, "tags": [], "creator": "peterreilly@apache.org", "attachment_id": null, "id": 106907, "time": "2007-08-19T10:28:57Z", "bug_id": 18950, "creation_time": "2007-08-19T10:28:57Z", "is_private": false, "text": "I do not see this been done any time soon."}]