[{"count": 0, "tags": [], "text": "Several people reported the following problem in the log4j user group. I also \nencountered. All logging is lost when the roll happens.\n\n\"My problem arose when using the DailyRollingFileAppender with Tomcat.\nWhenever the webapp reloaded for any reason, the file the Appender was\nwriting to would apparently not get closed, and I would get the \n\"log4j:ERROR Failed to rename.....\" message for every subsequent rollover\nattempt.\" -- Jeffrey Snyder\n\n\"When using PropertyConfigurator.configureAndWatch(...), an instance of \norg.apache.log4j.helpers.FileWatchdog is instantiated\nand started in a separate thread. Redeployment of the application (meaning\nremoval and deployment) does not remove this thread. So, after redeployment \nthere are two such threads in the server's VM instance. The second one cannot \naccess (and therefore not rename) the logfile, because it is locked by the \nremaining previous FileWatchDog-thread. Tricky and dangerous: I am constantly \nproducing dead threads in the server's VM instance.\" --Ursprüngliche Nachricht\n\n\"I am using log4j within a web application server (SAP Web AS).The logging \nitself works fine.\nAt rolling time, the following message occurs on the server process \nconsole output: log4j:ERROR Failed to rename [./log/Log4JTest.log] to \n[./log/Log4JTest.log.2003-01-08-13-11].\" -- HaJo Odlozinski", "attachment_id": null, "bug_id": 18965, "id": 35010, "time": "2003-04-11T18:19:39Z", "creator": "sdoherty@kc.rr.com", "creation_time": "2003-04-11T18:19:39Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 18965, "attachment_id": null, "text": "Try adding a servlet context listener which does the following...\n\npublic void contextDestroyed(ServletContextEvent sce) {\n    LogManager.shutdown();\n}\n\nThat should cleanly shut down all loggers and appenders.  Once you find that\nthis works for you (it should), make sure to resolve this bug.\n\nJake", "id": 35013, "time": "2003-04-11T18:52:13Z", "creator": "hoju@visi.com", "creation_time": "2003-04-11T18:52:13Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "ceki@apache.org", "is_private": false, "count": 2, "id": 58306, "time": "2004-05-28T12:14:50Z", "bug_id": 18965, "creation_time": "2004-05-28T12:14:50Z", "text": "Hello,\n\nThe PropertyConfigurator.configureAndWatch method is unsafe because it\nnever cleans up after the watchdog thread. This method will be removed\nin future log4j versions. Please do not use\nPropertyConfigurator.configureAndWatch.\n\nI am closing and marking this bug as invalid. Note that this does not\nmean that there aren't any other problems with\nDailyRollingFileAppender. They will be addressed separately. Thank you\nfor your understanding.\n"}]