[{"count": 0, "tags": [], "bug_id": 18974, "is_private": false, "text": "Ive had apache 2.0.45 runing on my system for a while and had php running as a \ncgi. i had to switch it to a module because of security reasons. basicaly i \nwanted to use php_admin_value to set php values for a unique virtual host. \nsome reason php_admin_value doesnt work when its a cgi (it says \"invalid \ncommand\"), but thats not my issue...\n\nMy issue is that after putint php on as a module, the most basic php command, \nphpinfo() comes up blank. this means that i type it in my browser, hit enter, \nand nothing comes up. i hit refresh and it goes to the site before i started \ntyping. or if i opened a blank window, it just stays blank. if i refresh it a \nfew times, it starts refreshing on its own contantly until it loads. when i \nhad it as a cgi only half of it loaded on a remote system. sometimes when go \nto one of my pages the top section of it loads and then shows \"page cannot be \ndisplayed\", which i find very odd.\n\nive tried downgrading php and apache (2.0 series), and it still doesnt work.\n\nhere is a bug report i sent to php.net.... http://bugs.php.net/?id=22983&edit=2\n\ni have confirmed this on another system.\n\nits been weeks and i havent heard a word for them. not sure whats going on.... \ni hope its something that can be fixed.", "id": 35047, "time": "2003-04-12T02:26:36Z", "creator": "luke@cywh.com", "creation_time": "2003-04-12T02:26:36Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "nd@perlig.de", "text": "Hmm. I've recently installed a php-snapshot on my 2.0.45 which run fine (but\nit's win2k). Dou you have the latest SP for XP installed? Do you have some\nfirewall software running?\n\nAnd finally: which PHP sapi module did you choose?", "id": 36882, "time": "2003-05-08T02:21:04Z", "bug_id": 18974, "creation_time": "2003-05-08T02:21:04Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 18974, "is_private": false, "id": 37742, "creation_time": "2003-05-24T17:46:38Z", "time": "2003-05-24T17:46:38Z", "creator": "slive@apache.org", "text": "No response from submitter.", "attachment_id": null}]