[{"count": 0, "tags": [], "bug_id": 1902, "attachment_id": null, "text": "With Tomcat 4.0 b5 if you use a filter to wrap the request object, the wrapping \nfails to take effect on the first request but appears to work for later \nrequests.  Symptoms during the first request are that the filter executes but \nthe wrapped request isn't truly passed on and the class type of the request \nobject is the standard org.apache.catalina.core.ApplicationHttpRequest.  A \nreload will show the class type change to the wrapped class as expected.  Odd.\n\nThis is a spec non-compliance issue.  It's also an issue for me with an article \nI'm writing showing how to wrap a request object.  :-(\n\nI have a testwrap.war available to reproduce the problem.  I'll email it to \nanyone who asks.", "id": 2651, "time": "2001-05-25T03:00:49Z", "creator": "jhunter@apache.org", "creation_time": "2001-05-25T03:00:49Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 1902, "attachment_id": null, "text": "I think it would be more convinient if you attached the test case to the bug \nreport.", "id": 2663, "time": "2001-05-25T16:19:09Z", "creator": "remm@apache.org", "creation_time": "2001-05-25T16:19:09Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 1902, "attachment_id": null, "text": "Final fix is pending discussion in the JSR-053 expert group.\n\nThe proximate cause of the problem is that Catalina currently uses a request \nwrapper to implement the parameter merging and attribute adding done for a \nrequest dispatcher include or forward.  The spec issue is whether or not this is \nlegal for the container to do.\n\nA workaround for the presented test case would be to define a <servlet-mapping> \nfor the servlet, rather than using the invoker (/servlet/*) capability which is \nnot portable across all containers.\n\nBy the way, the reason this problem shows up only the first time is that the \nTomcat invoker dynamically establishes a servlet mapping that is used for all \nsubsequent requests, to make them execute faster.\n", "id": 2709, "time": "2001-06-01T15:54:21Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-06-01T15:54:21Z", "is_private": false}, {"count": 3, "tags": [], "creator": "craig.mcclanahan@sun.com", "attachment_id": null, "id": 3745, "time": "2001-07-16T17:14:45Z", "bug_id": 1902, "creation_time": "2001-07-16T17:14:45Z", "is_private": false, "text": "Fixed by changes to ApplicationDispatcher (to not wrap the request provided by \nthe filter) and InvokerServlet (to not try to use RequestDispatcher.forward()).\n"}]