[{"count": 0, "tags": [], "bug_id": 19132, "attachment_id": null, "text": "It currently works fine, but moving forward in 1.0, the CommandLineOptions \nclass should probably be better encapsulated:\n\n(1) CLO is currently involved in creating InputHandlers, Starter objects and \ndetermining Driver Renderers but these actions are outside the usual scope for \na command-line parsing object.  \n  \n(2) The predefined constants for the (correctly private) inputmode and \noutputmode member variables are being declared PRIVATE instead of PUBLIC. This \nlimits the ability of CLO to communicate with objects legitimately requesting \nthis data via inputmode/outputmode's accessor functions.\n\nFor (1) above, the three classes getInputHandler(), getRenderer(), and \ngetStarter() are the functions that appear outside of scope.  I think the more \nproper design would be to have the CLO just supply the parsed options it knows \nof to classes requesting that information, and in turn have those classes use \nthe business logic contained within those functions to determine which object \nto create.\n\nFor these three functions in CLO:\n\n-- CLO.getInputHandler() is called only once, within CommandLineStarter.  It \nmay be better to have CommandLineStarter call CLO.getInputMode() instead and \nsubsequently use appropriate business logic to determine which InputHandler to \ncreate.  \n\n-- CLO.getStarter() is also only called once, within class Fop.  Likewise, the \nFop class should call getOutputMode() instead, and after getting a response, \ndetermine the proper Starter object to create.  \n\n-- CLO.getRenderer() is called once within CommandLineStarter.  This function \nplaces the burden on the CLO to determine the Renderer that the Driver class \nshould use, based on the Output Mode parsed out by the CLO.  But this \ndetermination should be for the Driver class to make, not the command-line \nparser.  The Driver class appears to need a setRendererbyOutputMode() function \nfor CommandLineStarter to call:\n\nso, in CommandLineStarter (line 99), perhaps move from\ndriver.setRenderer(commandLineOptions.getRenderer());\nto something like\ndriver.setRendererByOutputMode(commandLineOptions.getOutputMode());\n\nwhich essentially moves CLO's getRenderer functionality to the Driver class, \nand (properly, I think) removes all references to the Driver class within the \nCLO.\n\nAs for (2) above:  the predefined constants for the inputmode and outputmode \nvariables need to be externally viewable.  FO_INPUT, XSLT_INPUT, PDF_OUTPUT, \nAWT_OUTPUT, etc., need to be made public so classes accessing CLO's \ninputmode/outputmode information via their accessor functions can work \nmeaningfully with these two fields.\n\nGlen", "id": 35472, "time": "2003-04-17T23:57:30Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-04-17T23:57:30Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 19132, "attachment_id": null, "id": 35566, "time": "2003-04-18T16:38:54Z", "creator": "jeremias@apache.org", "creation_time": "2003-04-18T16:38:54Z", "is_private": false, "text": "FYI: We have been discussing whether we should rewrite the CLI using Jakarta \nCommons CLI. Oleg said, that it may not be possible to recreate the original \nfunctionality using Commons CLI, however.\n\nIMO it is probably a bit premature to work on the CLI already because the API \nwill change (We're still in the process of creating a new one). But I'm happy \nto see that you're interested in the redesign code. I hope we get some patches \nfrom you. Don't hesitate to work on the CLI, just keep the above in mind.\n\nAh, what was the motivation to open a Buzilla entry for this?"}, {"count": 2, "tags": [], "creator": "glenmazza@yahoo.com", "attachment_id": 5895, "is_private": false, "id": 35584, "time": "2003-04-18T19:55:48Z", "bug_id": 19132, "creation_time": "2003-04-18T19:55:48Z", "text": "Created attachment 5895\nPatch file to solve part (2) - making get input/output mode constants public"}, {"count": 3, "text": "\"On second thought\" <red face/> I am more doubtful on Part 1--getInputHandler \nrequires more complex retrieval of xml/xsl or fo files, and that type of logic \nmay be more properly handled within the CommandLineObject.\n\nI might still recommend that the patch below be applied--so long as you \nmaintain accessor functions getInputMode() and getOutputMode() calling \nfunctions should programmatically have access to those constants.  But that \nwould the limit of this \"bug\"--it can be closed either way.", "bug_id": 19132, "attachment_id": null, "id": 35591, "time": "2003-04-18T20:23:51Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-04-18T20:23:51Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 19132, "attachment_id": 5984, "id": 35936, "time": "2003-04-23T23:49:08Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-04-23T23:49:08Z", "is_private": false, "text": "Created attachment 5984\nDIFF -u of all changes:  AWTStarter, CommandLineOptions, CommandLineStarter, Fop, Driver classes"}, {"count": 5, "tags": [], "bug_id": 19132, "attachment_id": null, "id": 35937, "creation_time": "2003-04-24T00:04:57Z", "time": "2003-04-24T00:04:57Z", "creator": "glenmazza@yahoo.com", "text": "This latest patch replaces the previous one (that one can be ignored).\n\nThis patch shows all the changes I was suggesting w.r.t. the Command Line \nOptions class, as well as the corresponding changes that would be needed to \nother classes interacting with this version.  The code compiles cleanly and has \nbeen tested, albeit weakly--it will generate PDF documents as-is.\n\nMain suggestions (all included in this patch):\nCommandLineOptions class:  \na) input/output mode constants (*not* the variables themselves) made accessible \nthroughout application\nb) CLO no longer creates starters or inputHandlers, determines InputFiles or \nDriver class renderers, nor supplies loggers to other classes.\nc) CLO will no longer accept invalid input parameters with warnings.  Returns \nan error message and stops instead.\n\nCLSStarter:\na) Determines the InputHandler to create based on what the CLO has parsed\n\nFOP:\na) Determines the Starter to create based on the information it retrieves from \nthe CLO\nb) Creates a logger for the Starter and CLO to use\n\nDriver:\na) Driver constants now defined in terms of CLO constants\nb) as a result, Driver setRender(int) is now called equivalently with CLO \nconstants (FOP command line via CommandLineStarter class) and Driver.RENDER_XXX \n(embedded Servlet calls).\n\nThanks,\nGlen", "is_private": false}, {"count": 6, "tags": [], "bug_id": 19132, "text": "Kind of out-of-date by now, my thinking has evolved/changed on many of these \nsuggestions, so I wish to remove these from consideration.", "id": 36881, "time": "2003-05-08T01:15:52Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-05-08T01:15:52Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 19132, "attachment_id": null, "id": 156557, "time": "2012-04-01T13:49:45Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:49:45Z", "is_private": false, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs"}]