[{"text": "Attempted to start tomcat by executing startup.sh script under \nCATILINA_HOME\\bin. I received the following messages\n\n\"rsx not found, DPMI not supported by emx\"\n\nbrowsing did not find http://localhost:8080/", "tags": [], "creator": "dewayne.c.dantzler@boeing.com", "is_private": false, "count": 0, "id": 35822, "time": "2003-04-22T21:13:31Z", "bug_id": 19234, "creation_time": "2003-04-22T21:13:31Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 19234, "is_private": false, "text": "I have never seen that report on tomcat-user or bugzilla.\nCheck that JAVA_HOME points to the JDK home directory, and that you're not using\na \"normal\" version of the JDK (I recommend you try with Sun JDK 1.4.1). Also try\nwith the default Tomcat installation (you might want to try the Windows\ninstaller version also). Reopen the bug if you still have the problem, and can\ngive steps to reproduce the problem (and please give details about your\nconfiguration).", "id": 35847, "time": "2003-04-23T07:22:08Z", "creator": "remm@apache.org", "creation_time": "2003-04-23T07:22:08Z", "attachment_id": null}, {"text": "Ok, I would expect it to work for you, but I was more concerned about why the \nscript would report the error message. If I knew what would cause that, then I \ncould possible determine what is wrong with my setup. \n\nWhat is rsx, DPMI, and emx? Are these Windows 2002 applications? \nAlso, where can I get a \"Default\" tomcat installation? Or a Windows installer \nversion? What do you mean by more \"details\" about my configuration? Are you \ntalking about the PC, the version of JDK or tomcat? Specifics would be very \nhelpful. I admit to being a novice and not an expert, so any details would be \ngreatly appreciated. \n\nThanks", "tags": [], "creator": "dewayne.c.dantzler@boeing.com", "is_private": false, "count": 2, "id": 35914, "time": "2003-04-23T17:26:08Z", "bug_id": 19234, "creation_time": "2003-04-23T17:26:08Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 19234, "attachment_id": null, "id": 36221, "time": "2003-04-28T10:47:50Z", "creator": "remm@apache.org", "creation_time": "2003-04-28T10:47:50Z", "is_private": false, "text": "Default install = get the zip, extract it somewhere, don't change anything, and\ntry to run Tomcat.\nIf you're on Windows, don't try to run the .sh script (even if you're on\nCygwin). It is for Unix.\nI think I mentioned the JDK you should use (IMO).\n\nIf you need help, use the tomcat-user mailing list rather than Bugzilla.\nBugzilla is for reporting confirmed *Tomcat* bugs (or at least, when you are\nreally convinced there's a flaw in Tomcat)."}]