[{"count": 0, "tags": [], "text": "I have tested this on several servers.\n\nI am running 2.0.45 with mod_ssl (source compile) on RedHat Linux 7.3 and \nRedHat Enterprise Linux WS 2.1. In both cases, the startup script \ncalls \"apachectl startssl\". \n\nThe problem is that when httpd tries to start, I am not prompted for the PEM \nPassphrase at the console as with Apache 1.3. This effectively brings the \nprocessing of the /etc/rc3.d/ scripts to a halt, and it never fully loads. I \nend up having to SSH into the server and kill the startup process, then run \nthe startup script from the command line.\n\nWe really need the functionality of entering the passphrase upon startup at \nthe console window.\n\nI already posted this issue to the lists and all I got was a response similar \nto the below google groups thread - just disable the password on the private \nkey. How terribly secure!\n\nThanks for any assistance or guidance you can provide on this bug.\n\nhttp://groups.google.com/groups?hl=en&lr=&ie=UTF-\n8&th=1575236c2083e36d&seekm=fa.jdgcqf9.1i7q3q9%40ifi.uio.no&frame=off", "is_private": false, "id": 36036, "creator": "ostermmg@whitman.edu", "time": "2003-04-25T00:02:51Z", "bug_id": 19300, "creation_time": "2003-04-25T00:02:51Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 19300, "is_private": false, "id": 37492, "time": "2003-05-20T18:03:38Z", "creator": "madhum@hp.com", "creation_time": "2003-05-20T18:03:38Z", "tags": [], "text": "AIUI, you want to enable the password encryption on the Private Key file (and \nnot disable it). This way, you'll be prompted to enter the password.\n\nBTW, that was the default behaviour for mod_ssl/Apache 1.3.x\n\nTo enable password encryption, do \n\nopenssl rsa -des3 -in server.key -out server.key.crypt\n\n--> It will prompt you for password\ncp server.key.crypt server.key\n\nLet us know how it works !\n\n-Madhu"}, {"count": 2, "tags": [], "text": "Hello -\n\nActually, our key is already encrypted. The core problem is that:\n\n1. It DOES prompt for the PEM passphrase once the system is fully loaded and I \nam logged into the bash shell either at the console or via an SSH session.\n\n2. It DOES NOT prompt for the passphrase during startup at console where it \nused to on 1.3.x. It goes through all the motions, and displays \"Starting \nhttpd.....\", but the passphrase prompt does not appear as it should. Ignoring \nits absence, typing the PEM passphrase and sending a carriage return does not \nfix it. The machine simply does not continue to boot, as there is never \na \"succeeded\" for httpd in the boot script display. My guess is that whatever \nis generating the script is not directing it to prompt for the PEM passphrase \nvia STDIN. \n\nNote: This has been replicated on several different Dell PowerEdge servers \n(just in case hardware is somehow an issue?) on RedHat Enterprise Linux WS \n2.1, RedHat 7.3, and RedHat 9.0.\n\nThank you for your assistance.\n\nClear as mud?", "is_private": false, "id": 37508, "creator": "ostermmg@whitman.edu", "time": "2003-05-20T23:22:09Z", "bug_id": 19300, "creation_time": "2003-05-20T23:22:09Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 19300, "text": "I can't reproduce this; password entry from an httpd started by init works fine\nusing 2.0.40 on RHL9 and 2.0.46 on RHEL3.   It may be an issue with how you're\nstarting httpd from the init script, in which case it's not an Apache httpd bug.\n\nOnce httpd hangs during startup, check what fd 0 points from an ssh session\nusing \"ls -l /proc/<pid>/fd\" where <pid> is the pid of the hung httpd; it should\nbe /dev/console, if it's not, that's the problem", "count": 3, "id": 58643, "time": "2004-06-03T16:06:43Z", "creator": "jorton@redhat.com", "creation_time": "2004-06-03T16:06:43Z", "is_private": false}]