[{"count": 0, "attachment_id": null, "creator": "stevenharris@prodigy.net", "is_private": false, "id": 36182, "time": "2003-04-27T03:30:15Z", "bug_id": 19358, "creation_time": "2003-04-27T03:30:15Z", "tags": [], "text": "I am interacting with an FTP server in a different timezone. That means that I \ncan't use the depends=\"yes\" (or newer) since it expects the times are within \nthe same timezone. I would recommend that a timezone attribute be added which \naccounts for this problem. For example, it could be the number of hours to \nadd/subtract from the remote server's timestamps."}, {"count": 1, "tags": [], "text": "I will work on it.\n", "is_private": false, "id": 42364, "creation_time": "2003-08-07T22:39:49Z", "time": "2003-08-07T22:39:49Z", "creator": "antoine@apache.org", "bug_id": 19358, "attachment_id": null}, {"count": 2, "tags": [], "text": "I am wondering whether it is not better, instead of putting a number of hours, \nto use the timezone ids that Java can recognize such as PST or GMT.\nOr accept both and recognize what the attribute is based on numeric parsing \nworking or not.\nThe advantage of the official timezone is that it might suffer less from summer \ntime discrepancies between countries. (otherwise you have to change your build \nfile twice or even 4 times a year, this is not cool, and gets forgotten).", "is_private": false, "id": 42365, "creation_time": "2003-08-07T22:43:24Z", "time": "2003-08-07T22:43:24Z", "creator": "antoine@apache.org", "bug_id": 19358, "attachment_id": null}, {"count": 3, "tags": [], "creator": "stevenharris@prodigy.net", "attachment_id": null, "id": 42442, "time": "2003-08-08T23:59:32Z", "bug_id": 19358, "creation_time": "2003-08-08T23:59:32Z", "is_private": false, "text": "I agree with the concept of using the Java Std. timezones, but, we may want to \ndo both. The reason - clocks are not always set to the correct time, and it may \nat times be very useful to be able to specify with greater precision than by \ntimezone. So, why not accept both? Or, support two attributes, one for \ntimezone, and one to deal with incorrectly set clocks."}, {"count": 4, "attachment_id": null, "creator": "antoine@apache.org", "is_private": false, "id": 42456, "time": "2003-08-09T08:57:47Z", "bug_id": 19358, "creation_time": "2003-08-09T08:57:47Z", "tags": [], "text": "OK, I will implement both options (timezone and time difference entered by \nhand) starting with the time difference entered by hand."}, {"count": 5, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "is_private": false, "id": 42779, "time": "2003-08-14T21:05:31Z", "bug_id": 19358, "creation_time": "2003-08-14T21:05:31Z", "text": "OK. I have prepared an implementation of this report.\nThere are 2 new attributes, timeDiffAuto and timeDiffMillis\n\nIf you set timeDiffAuto to \"true\", the ant ftp task will automatically find out \nthe time difference between local and remote.\n\ntimeDiffMillis is the number of milliseconds of time difference.\n\ntimeDiffAuto is better (except if the time difference has changed and you know \nfor a fact that you want to use another time difference than the current - or if \nyou do not have write access to the remote directory.\n\nYou will be able to download the nightly build 2003-07-15 or later from http:\n//cvs.apache.org/builds/ant/nightly."}]