[{"count": 0, "tags": [], "creator": "robert.widmer@omv.com", "attachment_id": null, "id": 36388, "time": "2003-04-30T15:06:08Z", "bug_id": 19483, "creation_time": "2003-04-30T15:06:08Z", "is_private": false, "text": "I am using Tomcat 4.1.24 on AIX 4.3.3. In tomcat-users.xml there is the password\nof the admin user in plain text. To make the file unreadable for other users I\nchanged it to mode 600 (rw-------). But after a Tomcat restart the file is being\nreset to mode 644 (rw-r--r--) and everybody can read the passwords.\n\nCan this be configured anywhere or is it a bug?\n\nregards\nRobert"}, {"count": 1, "tags": [], "bug_id": 19483, "text": "It's a feature. The new user database rewrites the file (to allow you to\nprogrammatically modify the user list, for example through the admin webapp), so\nthis causes what you see. You can use the old user DB of Tomcat 4.0 to avoid\nthat, but in any case you shouldn't use the std impl with sensitive passwords.\n\nA side task, if you're interested in contributing, would be to provide other\nimplementations of the user database.", "id": 36391, "time": "2003-04-30T15:20:10Z", "creator": "remm@apache.org", "creation_time": "2003-04-30T15:20:10Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 19483, "text": "A feature!?\nThe admin webapp can be used to configure Tomcat and to change passwords. The\nuser with admin role is also in tomcat-users.xml. So everybody can read the\nadmin password, login to the admin webapp and do anything he wants. I would not\ncall that a feature...\n\nWhat can be done to hide the admin webapp admin password?", "id": 36395, "attachment_id": null, "creator": "robert.widmer@omv.com", "creation_time": "2003-04-30T15:38:03Z", "time": "2003-04-30T15:38:03Z", "is_private": false}, {"count": 3, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "id": 36403, "time": "2003-04-30T17:18:10Z", "bug_id": 19483, "creation_time": "2003-04-30T17:18:10Z", "is_private": false, "text": "Well, read my answer. The default realm is not secure to people logged in\nlocally (a thing which doesn't hash passwords is not secure anyway, no matter\nwhat you do), and you need to use another realm, or another user database provider."}, {"count": 4, "tags": [], "bug_id": 19483, "text": "I would be quite happy with the default realm - if I only could set the\nread/write rights myself on this file. I can't see any need for Tomcat to reset\nthe rights. If the Tomcat process (in my case user \"tomcat\") is the file owner\nand has read-write access to tomcat-users.xml, nobody else needs to do anything\nwith the file. \nSo the only thing I ask for (in the next release) - just don't change the file\npermissions on restart!", "id": 36527, "time": "2003-05-02T07:36:26Z", "creator": "robert.widmer@omv.com", "creation_time": "2003-05-02T07:36:26Z", "is_private": false, "attachment_id": null}]