[{"id": 36414, "tags": [], "bug_id": 19502, "is_private": false, "count": 0, "text": "My university allows students to create pages that can be restricted so that\nonly registered students can view the page (the Apache server can be set to use\nauthentication over kerberos).  They also offer the web page authors the ability\nto deliver pages over a secure sockets layer (https) connection.  Together these\ntwo facilities allow authors to make pages that I am happy to view using my\nuniversity login.\n\nThe users can also cause my browser to prompt me for a password using basic or\ndigest autentication and there is no way for me to know which it is.  The\nproblem is that I do not trust the users who make the web pages and the\nauthentication method determines whether or not they can see my password.\n\nI would like the httpd to have a configuration option that appends to the realm\n'Kerberos: ' if that method of authentication is used and something like 'Not\nKerberos: ', 'Basic: ' or 'Digest: ' if one of the other methods is used.  I can\nthen enter my password knowing that the author of the page does not see my\nauthentication secret.", "time": "2003-04-30T22:10:22Z", "creator": "James@a-le.co.uk", "creation_time": "2003-04-30T22:10:22Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 19502, "text": "See Mozilla bug 203984 (http://bugzilla.mozilla.org/show_bug.cgi?id=203984) for\nthe other part of my problem.", "id": 36415, "time": "2003-04-30T22:12:53Z", "creator": "James@a-le.co.uk", "creation_time": "2003-04-30T22:12:53Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 19502, "is_private": false, "id": 36442, "time": "2003-05-01T14:03:55Z", "creator": "slive@apache.org", "creation_time": "2003-05-01T14:03:55Z", "tags": [], "text": "I understand your problem, but there is really nothing that we can \ndo about it.  We do not distribute kerberos auth with any of our packages,\nso your university must be using a custom/third-party module.  In addition,\nit is really the client, not the server, which is responsible for presenting\nsuch information to the user."}]