[{"count": 0, "attachment_id": null, "creator": "steve_2000g@yahoo.co.uk", "text": "When calling addHeader, setCookie or setContentType this exception is thrown. A\nNullPointerException is also thrown when I tried using version 4.0.6 - this\nmakes me thinks I'm doing something wrong, but I thought I'd report it anyway.\n\nI'm trying to write a Tunnel/Proxy and one implementation is a HTTP Proxy using\nthe service(HSReq, HSRes) method on HttpServlet. In that I kick of two relay\nthreads - a (client input ala reconstructing the HTTP request/proxy socket\noutput) and another (proxy socket input/client output with a little header\nparsing). During the header parsing and adding the parsed headers to the\nHttpServletResponse is where it all goes horribly wrong.\n\nThe stacktrace is pasted below:\njava.lang.NullPointerException\n\tat\norg.apache.coyote.tomcat4.CoyoteResponseFacade.isCommitted(CoyoteResponseFacade.java:244)\n\tat\norg.apache.coyote.tomcat4.CoyoteResponseFacade.addHeader(CoyoteResponseFacade.java:382)\n\tat aiu.dubrtc.tunnel.io.HttpCheckPoint.addHeadersToRes(HttpCheckPoint.java:117)\n\tat aiu.dubrtc.tunnel.io.HttpCheckPoint.commit(HttpCheckPoint.java:61)\n\tat aiu.dubrtc.tunnel.Relay.run(Relay.java:108)\n\nI'm about to get the Tomcat source and dig around and see if I can figure out\nwhat is causing it. If I do I'm append it to the Buziller bug report.\n\nCheers,\nSteve", "id": 36577, "time": "2003-05-02T13:08:13Z", "bug_id": 19590, "creation_time": "2003-05-02T13:08:13Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 19590, "text": "Your application will likely not work with that kind of design. Basically, none\nof the container provided objects are synced, so whatever you do you could run\ninto issues.\nHere, you're trying to access the response object after the end of the servlet\ninvocation (which is obviously not allowed), where the response is set to null\nin the facade. If a new request quickly follows the previous one, you could as\nwell end up accessing it by accident (note: unless you're using the security\nmanager, in which case the facade is never reused).", "id": 36579, "time": "2003-05-02T13:28:18Z", "creator": "remm@apache.org", "creation_time": "2003-05-02T13:28:18Z", "is_private": false, "attachment_id": null}]