[{"count": 0, "tags": [], "bug_id": 19789, "attachment_id": null, "is_private": false, "id": 36938, "time": "2003-05-09T01:28:12Z", "creator": "bugzilla@justgotta.com", "creation_time": "2003-05-09T01:28:12Z", "text": "When jsp fails to compile, \"An error occurred at line: in the jsp file: \nGenerated servlet error:\" and corresponding javac messages is sent to the \nbrowser followed by the html headers and finally the custom error page defined \nin web.xml.  4.1.20 will only show the custom error page (minus the javac \nmessages).  Issue appears to be in ErrorDispatcherValve changes in 4.1.21."}, {"attachment_id": null, "tags": [], "bug_id": 19789, "is_private": false, "count": 1, "id": 36960, "time": "2003-05-09T07:57:18Z", "creator": "remm@apache.org", "creation_time": "2003-05-09T07:57:18Z", "text": "I do believe that this report is completely invalid (there is almost no way the\nHTML headers can get embedded inside a response body given the Tomcat\narchitecture). I tried to reproduce it, but couldn't. Please don't reopen the\nreport unless you can provide a ready to run WAR exhibiting the problem."}, {"count": 2, "tags": [], "creator": "bugzilla@justgotta.com", "attachment_id": null, "id": 36967, "time": "2003-05-09T11:46:58Z", "bug_id": 19789, "creation_time": "2003-05-09T11:46:58Z", "is_private": false, "text": "Wow, I would have expected a more professional answer.  As I said, the same \ncode exhibits different behavior from v20 to 21 and moving the \nErrorDispatcherValve class from 20's jasper.jar to 21's causes the issue to go \naway.  I'll consider putting a war together, but I hope someone new can look \ninto the issue."}, {"count": 3, "tags": [], "bug_id": 19789, "attachment_id": null, "text": "I attempted to reproduce the problem according to the information you provided,\nand could not. In a bug report, you have to point out *precisely* at a specific\nflaw, especially when the report is hinting at a very noticeable flaw in a build\nthat has recieved wide testing and usage since its release. We cannot be\ncreative and imaginative when dealing with bug reports.\nAlso, you should make sure that what you post is accurate. This is clearly not\nthe case in your reply.\n\nPlease don't reopen the bug unless you can provide a ready to use test case.", "id": 36972, "time": "2003-05-09T12:44:00Z", "creator": "remm@apache.org", "creation_time": "2003-05-09T12:44:00Z", "is_private": false}, {"count": 4, "tags": [], "creator": "bugzilla@justgotta.com", "attachment_id": null, "id": 36973, "time": "2003-05-09T12:49:19Z", "bug_id": 19789, "creation_time": "2003-05-09T12:49:19Z", "is_private": false, "text": "You're right, it should have said catalina.jar.  To say that my report \nwas \"completely invalid\" sounded like you believe I'm making up the whole \nthing.  I'll figure it out what's going on."}, {"count": 5, "tags": [], "bug_id": 19789, "attachment_id": 6295, "id": 36980, "time": "2003-05-09T15:18:29Z", "creator": "bugzilla@justgotta.com", "creation_time": "2003-05-09T15:18:29Z", "is_private": false, "text": "Created attachment 6295\nexample that purposefully triggers a compile-time error in test.jsp"}, {"count": 6, "tags": [], "bug_id": 19789, "attachment_id": 6296, "id": 36981, "time": "2003-05-09T15:21:18Z", "creator": "bugzilla@justgotta.com", "creation_time": "2003-05-09T15:21:18Z", "is_private": false, "text": "Created attachment 6296\nserver.xml to use with attached war"}, {"count": 7, "tags": [], "creator": "bugzilla@justgotta.com", "attachment_id": null, "id": 36982, "time": "2003-05-09T15:24:57Z", "bug_id": 19789, "creation_time": "2003-05-09T15:24:57Z", "is_private": false, "text": "Ok, here's a war file and accompanying server.xml.\n\nFirst off, this is an unusual example that purposefully triggers a compile-time \nexception while also defining an error-page for java.lang.Throwable in web.xml. \nAgain, dropping this example into v4.1.21-24 is where I see the issue (also \ntested 18-20).  Using xp and w2k at the moment.\n\nAt first I thought it was the code in ErrorDispatcherValve that says \"if the \nerror wasn't one of those defined with a custom error-page, forcefully trigger \nit as an error 500\", but unfortunately I can't pinpoint the precise flaw (if it \nis a flaw) without learning the internals of Tomcat more deeply.  One thing I \nhave noticed (relevant or not) is removing the FileLogger from server.xml seems \nto change the behavior and the browser shows an empty screen.\n\nIf this example doesn't reproduce the problem or if it's not a concern to \nanyone else, just call me crazy and I'll live with it.  Sorry for not adding it \nto the initial post; this is my first bug report and what I was writing seemed \nto make perfect sense to me.  But I thought someone would work with me rather \nthan immediately flagging it as invalid.  I'll leave it invalid seeing as how I \nseem to have already upset things here and I don't claim to be an expert."}]