[{"count": 0, "tags": [], "bug_id": 19879, "text": "We have problems with tomcat on a HP-UX11 system on which tomcat consumes more \nthan 200 % cpu on a 5 cpu machine after several hours of running.\n\nBut the load of the tomcat is almost idle.\n\nWe do not use tomact with apache. It is serving static pages only.", "id": 37112, "time": "2003-05-13T06:24:44Z", "creator": "a.vanderende@chello.nl", "creation_time": "2003-05-13T06:24:44Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "remm@apache.org", "text": "I have yet to witness a situation where Tomcat consumes CPU doing nothing.\n\nA bug report should either include detailed information on how to reproduce it,\na ready to use test case, or at least enough information so that developers have\na good idea about where the problem comes from. You seem to assume that the\nproblem is obvious enough so that we ought to notice it (which is not the case).\nIn any case, you'll have to investigate the issue more (a starting point would\nbe to get a thread dump to get an overview of threads or portions of the code\nwhich could be posing problems). If you need general support on Tomcat, please\ntry the tomcat-user mailing list.", "id": 37114, "time": "2003-05-13T07:36:20Z", "bug_id": 19879, "creation_time": "2003-05-13T07:36:20Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "a.vanderende@chello.nl", "text": "Then tell me how I can force a thread dump , if the command kill -3 or -4 does \nnot kill the tomcat process!!!!!!", "id": 37115, "time": "2003-05-13T07:52:04Z", "bug_id": 19879, "creation_time": "2003-05-13T07:52:04Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 19879, "attachment_id": null, "text": "I was going to open a new bug, but this seems to describe my issue very well. \nAlthough not the same platform.\n\nMy issue is Tomcat consumes 100% cpu in idle state on a single processor \nmachine. This is without making a single HTTP request to Tomcat. Basically I \nstart Tomcat using startup.bat and then wait a few hours. Eventually it \n(java.exe) will start to consume 100% cpu. I have reproduced this on three \ndifferent machines and I've been struggling with it for about a month now. I \ncan reproduce this on a clean install of Tomcat with no added libraries and \nnothing but the default Contexts.\n\nMy Platform:\nTomcat 4.1.24\nJDK 1.3.1_07\nWindows 2000 SP3\n\nI will be happy to try anything to assist in isolating the error, but I will \nneed instructions on what to do.\n\n", "id": 37869, "time": "2003-05-27T20:55:24Z", "creator": "clayembry@yahoo.com", "creation_time": "2003-05-27T20:55:24Z", "is_private": false}, {"count": 4, "attachment_id": null, "creator": "remm@apache.org", "is_private": false, "id": 37876, "time": "2003-05-27T22:17:52Z", "bug_id": 19879, "creation_time": "2003-05-27T22:17:52Z", "tags": [], "text": "I will resolve that report according to my previous comments. You can easily get\na view of threads which are running by using ctrl+break (on Windows). Do not\nreopen that report unless you can provide conclusive information about a flaw in\nTomcat."}]