[{"attachment_id": null, "tags": [], "bug_id": 19873, "text": "Hi,\n\nI have been evaluating FOP for the past couple of weeks. Basically, I have\na java wrapper program which calls the FOP libraries, which reads in an\nXSLT style sheet and an XML file with data, then produces PDF for each XML\nfile read in. I have set my program to read in 1000 XML files and produce\n1000 PDFs. The sole purpose of this is to get some performance timings on\ndifferent operating systems/machines. \n\nOne of the tests I ran consisted of producing PDFs which where 4 pages\nlong, that contained a large table, somet text formatting, some SVG and\ntwo GIF images. Comparing this test on the Windows 2000 environment to the\nWindows XP environment came as a shock. The test on Windows 2000 completed\nin around 7 minutes, whereas on Windows XP it was closer to 20 minutes. \n\nThe Windows 2000 machine has a P4 1.8Ghz CPU, 256mb RAM. The Windows XP\nmachine much more powerful, a P4 3 Ghz, 1Gb RAM. This is why these results\nwere disturbing.\n\nDoes anyone know why GIFs take so long to render under Windows XP? My\nguess is, as GIF is patented, Windows 2000 seems to easily convert the GIF\ninto another format prior to rendering (maybe using a windows tool).\nHowever, in XP, this tool may no longer be present, hence the process\nmaybe follows another path which seems to be more expensive? I don't know,\nthis is just a guess. Also note that under XP, the CPU usage while running\nthis hovers around the 20% mark.\n\nI tried converting the GIFs to JPGs and the test completed in 4 minutes\nunder XP (CPU usage was close to 100%), so I am certain the problem lies\nwith GIFs alone. Could anyone please help me out here with some insight?\n\nRegards,\nOzhan", "count": 0, "id": 37097, "time": "2003-05-12T22:38:52Z", "creator": "ozhan@mds.rmit.edu.au", "creation_time": "2003-05-12T22:38:52Z", "is_private": false}, {"count": 1, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "text": "Please don't use BugZilla to ask questions. That's what the fop-user mailing \nlist is for.\n\nThis question about GIF performance should be addressed to Sun. We're just \nusing the JDK code for GIF decompression. Maybe you have two different JDK \nversions on both machines. I have also heard that M$ has a performance problem \nin a recent security patch. So maybe you have the patch on the XP machine but \nnot on the W2K machine. Try different JDK version and check Sun's bugparade. \nThere's not much we can do.", "id": 37111, "time": "2003-05-13T05:56:04Z", "bug_id": 19873, "creation_time": "2003-05-13T05:56:04Z", "is_private": false}, {"count": 2, "tags": [], "creator": "gadams@apache.org", "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156981, "time": "2012-04-01T13:55:52Z", "bug_id": 19873, "creation_time": "2012-04-01T13:55:52Z", "is_private": false, "attachment_id": null}]