[{"count": 0, "tags": [], "bug_id": 19909, "attachment_id": null, "id": 37151, "time": "2003-05-14T01:59:20Z", "creator": "patf@patf.net", "creation_time": "2003-05-14T01:59:20Z", "is_private": false, "text": "I was working on some minor logging for a project I'm developing.  The logging \nclass was called by a servlet running on Tomcat 4.0.04 final.  I found that \ncreating a java.io.FileWriter object with a File object and the boolean append \nparameter set to true, led to a Writer that wouldn't write.\n\nHere is the code I was using.\n\n    public void log(String message) {\n        try {\n            //logpath was previously read from an InitParameter\n            File outputFile = new File(logPath);\n\n            if(!outputFile.exists()) {\n                outputFile.createNewFile();\n            }\n            //***\n            BufferedWriter out = new BufferedWriter(new FileWriter(outputFile, \ntrue));\n            out.write(message + \"\\n\");\n            out.flush();\n        }catch (IOException ioe) {\n            System.out.println(\"IOException caught in Logger.log: \" + ioe);\n        }finally{\n        }\n    }\n\nThis code, when I inserted some comments, would appear to freeze during the \nline following the ***, and no output was written to the file.  Removing the \nappend parameter led to the Output object correctly writing to the log file.\n\nI can also tell you that when I switched to a different constructor, the code \nworked properly.  The new code was this, replacing the BufferedReader \nconstruction that follows the ***.\n\n  BufferedWriter out = new BufferedWriter(new FileWriter(logPath, true));\n\nThis is the constructor that uses a String to indicate the file path as opposed \nto a File object.\n\nThat as well as the removal of the append parameter as previously indicated led \nme to think that this might be a bug and not just my error.  I don't really \nhave the time to chase this down (especially since I have the workaround), but \nI thought I would submit it anyway.\n\nFeel free to email me with any questions or request for clarifications.\n\nPat Farrell\npatf@patf.net"}, {"count": 1, "attachment_id": null, "bug_id": 19909, "is_private": false, "id": 37171, "time": "2003-05-14T10:53:23Z", "creator": "funkman@joedog.org", "creation_time": "2003-05-14T10:53:23Z", "tags": [], "text": "This is a java question, not a tomcat bug. As a side note, there are logging\npackages which will perform all the logging a developer could want, such as log4j. \n"}]