[{"count": 0, "tags": [], "text": "Using FOP in conjunction with Altova (http://www.altova.com) xmlspy 5.4\n\nError reported to Altova and identified by them as being due to missing xsl:fo \ncommands leads to a modal dialogue saying:\n\n    Output of external XSL Convertor\n    [ERROR} Unknown formatting object ^html\n    [ERROR] java.lang.NullPointerException\n\nAltova say this uninformative message, which is of limited value in diagnosing \nthe user error and appropriate corrective action, is dwon to FOP.\n\nMore problem oriented and appropriate error message would be appreciated, by me \nat least.", "is_private": false, "id": 37166, "creator": "r.barrett@ftel.co.uk", "time": "2003-05-14T09:21:59Z", "bug_id": 19914, "creation_time": "2003-05-14T09:21:59Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "jeremias@apache.org", "is_private": false, "text": "Ok, let's do it this way: I'll tell you what's wrong and you tell me what the \nerror message should look like in your opinion and we'll see if we can improve \non that.\n\nYou've tried to convert HTML to PDF, PS or whatever. FOP doesn't understand \nHTML. If you want to process HTML you have to convert it to XSL-FO first, \nbecause XSL-FO (and SVG) is what FOP understands.\n\nBasically the error message says: It has encountered a tag \"html\" (in the \ndefault namespace) which is an unknown formatting object. A valid formatting \nobject would be \"root\" or \"page-sequence\".\n\nThe NullPointerException afterwards can just be a subsequent error because FOP \ncannot recover from your \"html\" tag.", "id": 37167, "time": "2003-05-14T09:33:19Z", "bug_id": 19914, "creation_time": "2003-05-14T09:33:19Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 19914, "attachment_id": null, "id": 37186, "time": "2003-05-14T13:37:53Z", "creator": "r.barrett@ftel.co.uk", "creation_time": "2003-05-14T13:37:53Z", "is_private": false, "text": "But that is exactly NOT what the error message says. Its what you say it means \nbecause you know the code and how it works.\n\nLets make an assumption; some of the people who will use this software are not \nprogramming experts on this code and either do not have the time or do not have \ninclination to be so. \n\nThe software discovers that the input data it is receiving is not what it \nexpects. After all, the software does have some input data validation in the \ncode, or does everything just blindly fall to an outer exception handler?\n\nThe error response delivered is the equivalent to a compiler saying:\n\n    Found error in source file.\n\nFactually correct but of limited utility.\n\nHow about a message that says something like:\n\n\"Input data error at line xxx of input file yyy. Expected ..., got ...\"\n\nwhere ... are bits of English that hint at the mistake the user has made in \ncreating his input with maybe even an allusion as to how to correct the mistake \nthey have made.\n\nIn the case I tripped over, something like would be a bit more meaningful:\n\nInput data error at line 5 of xyz.xsl. Expected \"fo:root or fo:page-sequence\" \ntag, got \"html\" tag\n\nThat way non-programmers might be able to avoid troubling developers with \nstupid questions. That is of course, on the assumption you want people other \nthan programmers to use this software.\n\n"}, {"attachment_id": null, "tags": [], "bug_id": 19914, "is_private": false, "count": 3, "id": 37198, "time": "2003-05-14T14:58:55Z", "creator": "j3322ptm@yahoo.de", "creation_time": "2003-05-14T14:58:55Z", "text": "Some general problems:\n- What you think of as source is not the source for the FO processor. There\n  is no way to get a source file name or line number at the point where the\n  error was detected if you supply XML+XSLT instead of a FO file.\n- At the point where the error is detected, there are no hints available which\n  cold restrict possible choices down to a range an uninitiated could possibly\n  understand. Technically, the code looks into a table with all possible names,\n  and if the name isn't found, the \"Unknonwn formatting object\" message is\n  generated. I doubt that dumping 5 pages or so of known names is of much\n  help. Restricting the message to \"expected element from namespace <foo>,\n  <bar> or <baz>\" is probably not of much help either, because the namespace\n  strings tend to be unwieldy, and people feeding wrong elements to FOP tend\n  to be agnostic about namespaces anyway.\nThese restrictions would basically force to trim down your proposal to\n  Input data error. Got \"html\" tag\nwhich is not much of an improvement.\nWe can hardcode a more sensible error response if a <html> element is found,\nbecause it appears to be common among uninformed newbies to feed a\nHTML-generating style sheet to FOP. However, this wouldn't help in cases\nwhere the problem was triggered by problems in the style sheet, misspellings\nor simply by people doing unanticipated stupid things which don't quite\nmatch the hardcoded symptoms.\n\n*** This bug has been marked as a duplicate of 5010 ***"}, {"count": 4, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "text": "Just a moment: I have a little improvement finished in a few minutes. It will \naproximately look like this:\n\n[ERROR] Unsupported element encountered: bad (Namespace: default). Source \ncontext: file:/D:/FOP/temp/bad.fo (line: 11, col: 13)\n[ERROR] Expected XSL-FO (root, page-sequence, etc.), SVG (svg, rect, etc.) or \nelements from another supported language.\n[ERROR] Unsupported element encountered: stuff (Namespace: \nhttp://www.evil.com). Source context: file:/D:/FOP/temp/bad.fo (line: 12,\n col: 53)\n\nor:\n\n[ERROR] Unsupported element encountered: stuff (Namespace: \nhttp://www.evil.com). Source context: unavailable\n\nThe verbose message will come only once. That should improve it a bit.", "id": 37203, "time": "2003-05-14T15:12:45Z", "bug_id": 19914, "creation_time": "2003-05-14T15:12:45Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 19914, "attachment_id": null, "id": 37222, "time": "2003-05-14T20:09:02Z", "creator": "r.barrett@ftel.co.uk", "creation_time": "2003-05-14T20:09:02Z", "is_private": false, "text": "Looks like a real improvement. Thankyou."}, {"count": 6, "tags": [], "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "is_private": false, "bug_id": 19914, "id": 156425, "time": "2012-04-01T13:47:51Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:47:51Z", "attachment_id": null}]