[{"count": 0, "tags": [], "bug_id": 20060, "text": "I have been working on integration of POI with Lucene, mostly to get Word file\nindexing working well enough to fit my needs. Despite the fact that I still have\nsome problems with some \"complex\" files, the result is acceptable for now.\n\nI must admit that my modifications are quite \"hacky\", and I'm not sure if they\nare fitted for an real patch. Anyway they work reasonably well for me so they\nmight be useful to other (see results below).\n\nThe modifications I've done are :\n- deactivate formatting parsing. I didn't need it so I commented out the\n\"findFormatting\" in the WordDocument class\n- small patches here and there to remove exceptions\n- modifications to fall-back to main stream document text if the parsing of the\npiece tables seemed to give nothing (it seems there are a lot of problems with\nsome files here but I'm not knowledgeable about the format enough to know what\nI'm doing). And it seems the binary file format document is not telling us\neverything that is really going on here :(\n- modifications in the writeAllText method of the WordDocument\n- added @author tags in the modified files to comply with submission guidelines.\n\nThe result I got :\n- I tested on the 384 Word files I found on my computer\n- 1 couldn't be parsed at all becuase of a signature problem (POIFS problem ?)\n- 3 were actually RTF files so they are ignored\n- 5 files seemed to have problem with piece tables. If I \"Save As...\" the files\nto transform into \"simple\" files the text extraction works fine. The piece table\nseemed to always point me to text after the value of fib.fcMax. Here I made a\npatch the reverts to the main document text stream in this case\n- 4 files had piece tables that covered some of the main document stream and\nsome parts outside, which means I only got part of the text in my extractions.\n- the rest of the files worked very well !\n\nI'm sorry to say that most of these files are not test cases I could send off\njust like this as some of the data is personal and/or not for public eyes. I\nalso seemed to have problems with the test case files that were included in POI,\nthat don't even work on the real MS Word !\n\nBasically what I can do not is I have a class that has a method that looks like\nthis :\n\n        public String HDFExtractor.getHDFContent(File f);\n\nThat gives me a String containing all the text of an HDF encoded file. I then\nindex this into Lucene to do the text indexing. It doesn't work with every Word\nfile I've encountered but it's better than nothing for me.", "id": 37474, "time": "2003-05-20T14:15:08Z", "creator": "shuber2@jahia.com", "creation_time": "2003-05-20T14:15:08Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "Created attachment 6423\nCVS diff patch to enable text extraction of HDF documents", "bug_id": 20060, "attachment_id": 6423, "id": 37475, "time": "2003-05-20T14:16:02Z", "creator": "shuber2@jahia.com", "creation_time": "2003-05-20T14:16:02Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "thierry.guerin@prima-solutions.com", "attachment_id": null, "is_private": false, "id": 38359, "time": "2003-06-04T15:06:33Z", "bug_id": 20060, "creation_time": "2003-06-04T15:06:33Z", "text": "I've been working on the exact same thing, and I came up with different fixes \nthat lead to the same result, but without having to remove \nthe \"findFormatting\" from the WordDocument class. I now have merged Serge's \npatch with mine. The differences between Serge's modifications and mine are:\nUtils.convertBytesToShort: patch to avoid an ArrayOutOfBoundsExceptions.\nWordDocument.printTable: patch to avoid a NullPointerException\nAs of now, the only word documents that refuse to parse are the ones that \nthrow the \"Invalid header signature\" error (see bug 11506 for the files). I \nmay look into this in the future, but for now have no time to do so.\nFollowing this message you will find the resulting CVS Diff.\nPlease bear in mind that my modifications, though working, are based only on \nfixes that seemed logical from a programming point of view (tests to avoid \nArrayOutOfBoundsExceptions, etc..). I have _no_ knowledge of the Word file \nformat and in the process might have done something stupid."}, {"count": 3, "tags": [], "bug_id": 20060, "text": "Created attachment 6629\nThe new CVS diff, including Serge's modifications", "id": 38360, "time": "2003-06-04T15:08:33Z", "creator": "thierry.guerin@prima-solutions.com", "creation_time": "2003-06-04T15:08:33Z", "is_private": false, "attachment_id": 6629}, {"count": 4, "tags": [], "creator": "poi-support@buni.org", "attachment_id": null, "text": "All dev moved to HWPF", "id": 41398, "time": "2003-07-24T16:37:27Z", "bug_id": 20060, "creation_time": "2003-07-24T16:37:27Z", "is_private": false}]