[{"count": 0, "tags": [], "bug_id": 20064, "attachment_id": null, "id": 37482, "time": "2003-05-20T15:35:14Z", "creator": "Christopher.D.Knight@nasa.gov", "creation_time": "2003-05-20T15:35:14Z", "is_private": false, "text": "The memory pool handed to the child_init hook is (apparently) supposed to be\nfreed up at/after the termination of the child process. In my testing, the\nmemory pool is not freed up at this time but at the shutdown of the main httpd\nprocess. As the child_exit hook no longer exists, apparently adding a hook to\nthe memory pool is the \"correct\" way to get a callback when the child process\nterminates. Personally, I'm unsure why child_exit was removed in 2.0 and would\nrather use that than to rely on the freeing of the child memory pool."}, {"count": 1, "tags": [], "bug_id": 20064, "is_private": false, "text": "Are you really using perchild MPM as specified as the component for this PR? \nYou don't mention the OS.\n\n>The memory pool handed to the child_init hook is (apparently) \n>supposed to be freed up at/after the termination of the child \n>process.\n\nyes\n\n>In my testing, the memory pool is not freed up at this time \n>but at the shutdown of the main httpd process.\n\nthe memory pool does not exist in the main httpd process\n\nwhen the main process is shutdown, all child processes will exit and cleanups\nregistered against pchild will be run then in the child processes\n\n>I'm unsure why child_exit was removed in 2.0\n\nit was removed because it isn't necessary\n\nthere are other potential hooks (e.g., post connection) that aren't implemented\neither...  the module author is expected to use a cleanup registered against the\nright pool\n\nCan you show us how to recreate the problem?  Can you trim down your module to a\ntrivial piece of code that has a child init hook that registers a cleanup\nagainst the code passed in, and does something obvious (writes a message to a\nfile??) to indicate whether or not the cleanup was run?", "id": 37490, "time": "2003-05-20T17:46:28Z", "creator": "trawick@apache.org", "creation_time": "2003-05-20T17:46:28Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 20064, "attachment_id": null, "id": 37495, "time": "2003-05-20T18:53:28Z", "creator": "Christopher.D.Knight@nasa.gov", "creation_time": "2003-05-20T18:53:28Z", "is_private": false, "text": "My apologies, it is cleaning up this memory pool...The server's just not killing\noff child processes very frequently in my test case. (Takes a long time to get\n10,000 requests in.)"}]