[{"count": 0, "tags": [], "creator": "rspier@pobox.com", "text": "ap_http_filter (in http_protocol.c) will throw an Invalid Content-length error\non proxied requests that contain more than one Content-length headers.  \n\nThis is because the APR tables code will join the values with a comma, so when\nap_http_filter parses it there will be characters left over, which it considers\nan error.\n\nI.e.:\n\nContent-Length: 331\nContent-Type: text/plain\nContent-Length: 331\n\nends up as:\n\nContent-Length: 331, 331\n\n(Obviously the behavior of the program generating the double headers is wrong -\nbut because of the header rewriting done by apache - it was difficult to track\ndown.)", "id": 37486, "time": "2003-05-20T16:46:23Z", "bug_id": 20069, "creation_time": "2003-05-20T16:46:23Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 20069, "attachment_id": null, "text": "I'm not sure what bug you're reporting here.  It is invalid to have two\nContent-Length headers, right?  So the fact that apache doesn't find the\nerror until after it folds them (according to proper header-folding rules)\ndoesn't seem to be a bug.  Can you explain further what the exact bug\nis?", "id": 37488, "time": "2003-05-20T17:30:39Z", "creator": "slive@apache.org", "creation_time": "2003-05-20T17:30:39Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 20069, "attachment_id": null, "text": "Correct, it's invalid to have multiple Content-Length headers (RFC2068, sec\n4.2), and the server that is generating them is wrong.\n\nWhat's the bug?  It could either be that Apache is folding something that should\nnto be folded in the first place.  Or that Apache is not warning on the\nerroneous headers it is folding.  Or that it provides a cryptic error message.\n\nIn some ways I expect a proxy to pass through bad requests - warts and all.  (Or\n_fix_ them.)", "id": 37489, "time": "2003-05-20T17:36:59Z", "creator": "rspier@pobox.com", "creation_time": "2003-05-20T17:36:59Z", "is_private": false}, {"count": 3, "tags": [], "creator": "chip@force-elite.com", "text": "I haven't seen this happen in recent versions, have you tried it on 2.0.54?", "id": 75906, "time": "2005-06-03T02:55:17Z", "bug_id": 20069, "creation_time": "2005-06-03T02:55:17Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 20069, "attachment_id": null, "text": "Yes.  2.0.54 appears to be doing the right thing and passing through only one of\nthe Content-Length headers if they are the same, but two if they are different.", "id": 81577, "time": "2005-10-23T08:08:15Z", "creator": "rspier@pobox.com", "creation_time": "2005-10-23T08:08:15Z", "is_private": false}]