[{"count": 0, "tags": [], "creator": "greg@netgraft.com", "attachment_id": null, "id": 37613, "time": "2003-05-22T16:40:02Z", "bug_id": 20162, "creation_time": "2003-05-22T16:40:02Z", "is_private": false, "text": "I built a new Apache with mod_ssl etc built in,and on start up it failed on the\nLoadModule lines from my old httpd.conf because the modules were already\nbuilt-in.  It then refused to start up, saying it was a syntax error.  Syntax\nerrors in the config file probably should abort startup - you never know what\nthe intent was.  But this was not a syntax error - e-mail me and I will refer\nyou to a dozen dictionaries.  It was a semantic error, and the semantic intent\nwas clear, and the fact that the intent was already achieved was also clear, so\nit was totally inappropriate for Apache to refuse to start.  Are we serious\nabout enterprise stuff or do you just run kiddie servers?"}, {"count": 1, "tags": [], "creator": "trawick@apache.org", "attachment_id": null, "id": 37623, "time": "2003-05-22T17:51:30Z", "bug_id": 20162, "creation_time": "2003-05-22T17:51:30Z", "is_private": false, "text": "We will not be adding logic to properly support the existence of loadmodule\ndirectives for modules that have been statically built into the server.\n\nYou'll need to change your config file as appropriate.\n\nThe mention of a \"syntax\" error is generic.  Certainly some errors which are\nbetter classified as semantic are mislabeled.  However, I don't think this is a\nsource of confusion for the general user community.\n"}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "Not to mention that if you build an apache without mod_so and then use \nLoadModule, that IS a syntax error.  Apache without mod_so has no knowledge\nof any directive called LoadModule, and hence seeing that string in the\nconfig file is a syntax error.\n\n[In addition, if you really want help for this kind of issue you should\n\n1. Tone down the attitude; and\n\n2. Ask first in a user support forum before you bring things to the bug\ndatabase.]", "id": 37641, "time": "2003-05-22T21:13:54Z", "bug_id": 20162, "creation_time": "2003-05-22T21:13:54Z", "is_private": false}]