[{"count": 0, "tags": [], "creator": "gunnar.grim@ninetech.se", "text": "When an inline manifest element is used, the dependency checking gets confused.\nAccording to the documentation, the jar should be rebuilt if any dependent file\nhas been changed, including the build.xml itself. That is fine, but if an\nexpanded property used within the manifest element causes the resulting manifest\nto be different from the one in the jar, the jar is rebuilt. I have an inline\nmanifest where the implementation version is constructed from properties\nincluding one that is the time of day in hours and minutes. If at least one\nminute has passed since the last rebuild, the jar is rebuilt again. This\nbehaviour makes it practically impossible to include build date and time in the\nmanifest.", "id": 37664, "time": "2003-05-23T10:49:10Z", "bug_id": 20179, "creation_time": "2003-05-23T10:49:10Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 20179, "attachment_id": null, "id": 37666, "time": "2003-05-23T11:25:39Z", "creator": "conor@apache.org", "creation_time": "2003-05-23T11:25:39Z", "is_private": false, "text": "This is not a bug.\n\nYour <jar> task is specifying a manifest with different values from that\nexisting jar and that jar must therefore be rebuilt.\n\nYou probably should save the manifest to file using the manifest task and only\nwrite the file when you want to update the time value in the manifest."}, {"count": 2, "tags": [], "creator": "gunnar.grim@ninetech.se", "attachment_id": null, "id": 37672, "time": "2003-05-23T13:54:43Z", "bug_id": 20179, "creation_time": "2003-05-23T13:54:43Z", "is_private": false, "text": "I respectfully disagree. Quoting from the Ant documentation:\n\n\"When using inline manifests, the Jar task will check whether the build file is\nmore recent that the Jar file when deciding whether to rebuild the Jar. This\nwill not take into account property file changes which may affect the resulting\nJar.\" \n\nAlthough it doesn't explicitly say what happens when property values set by the\ntstamp task are used, I think it's fair to say that the second sentence above\nhints that property values are not considered. I think that the documented\nbehaviour, as I interpret it, is preferable. Your suggested solution just moves\nthe problem to the manifest task, and I would still have to work around the\nproblem with uptodate checks.\n\nAlso, there are several examples in the Ant documentation where tstamp created\nproperties such as ${TODAY} are used with the \"Implementation-Version\"\nattributes. As the examples are written, they would cause a rebuild at leas once\na day.\n\nI hope that I'm completely wrong (or out cycling as we say in Sweden) and that\nthere is a simple way to get the current time into the manifest without uptodate\nchecks, but I really can't think of one!\n"}, {"attachment_id": null, "tags": [], "bug_id": 20179, "text": "I have updated the documentation. It was wrong.\n\nI will disagree that the previous documentation described preferable behaviour.\nYou are presenting to the <jar> task a manifest specification which contains\ndifferent values from those in manifest of the existing Jar file. You want this\nmanifest specification to be ignored. I don't think that is correct. The\nprevious behaviour was incorrect and undesirable.\n\nIf you don't want to rebuild the jar, don't present the jar task with different\ncontents (which is effectively what you are doing). i.e Store the manifest in a\nfile and update it in a separate target. You can trigger updating whenever you\nexplicitly invoke that target or delete the manifest, perhaps as part of a clean\ntarget.", "count": 3, "id": 37818, "time": "2003-05-27T04:48:19Z", "creator": "conor@apache.org", "creation_time": "2003-05-27T04:48:19Z", "is_private": false}]