[{"count": 0, "tags": [], "bug_id": 20241, "attachment_id": null, "id": 37806, "time": "2003-05-26T13:26:29Z", "creator": "bugz@macrotex.net", "creation_time": "2003-05-26T13:26:29Z", "is_private": false, "text": "There is currently no way to determine reliably the log format used to generate\na log file. If you use the same log format forever this is not a problem, but if\nyou change the log format then the old log files using the old format are\n\"orphaned\". This is a particular problem if you are trying to write a log file\nanalysis tool to generate web log statitistics that will work with different\nsites who have changed their log formats. \n\nMicrosoft IIS5 has a nice solution to this (no flames!!): everytime the log file\nformat is changed they insert a special string in the log file itself that is,\nin essence, the log format. A web log parser could then parse a log file and it\nwould not matter how often the log file format changed, the parser could handle it. \n\nWhat is nice about this solution is that it would be relatively easy to\nimplement. And to avoid breaking current web log file parsers, you could have\nthe inserting of the log file format into the log file optional, with it turned\noff by default. This feature would be hugely useful to me, and I imagine at the\nvery least helpful to other log file parsers."}, {"count": 1, "tags": [], "creator": "nd@perlig.de", "is_private": false, "text": "Ehm, this sounds like typical \"do-it-yourself\" thing. You can easily modify the\nlogformat and insert any arbitrary string you want. That should solve your\nproblem, shouldn't it?\n\nThanks for using Apache :-)", "id": 37807, "time": "2003-05-26T13:38:16Z", "bug_id": 20241, "creation_time": "2003-05-26T13:38:16Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 20241, "attachment_id": null, "is_private": false, "id": 37810, "time": "2003-05-26T14:19:33Z", "creator": "bugz@macrotex.net", "creation_time": "2003-05-26T14:19:33Z", "text": "Your suggestion would mean adding the format string to EVERY log entry. The\noverhead would be immense! Adding it only once whenever the log file rolls over\nor the web server is restarted is much more efficient. I am marking this as\nReopen in the hopes that you might consider this further. Thanks."}, {"count": 3, "tags": [], "creator": "nd@perlig.de", "is_private": false, "text": "Hmm, then I've misread your suggestion. Sorry.\n\nAnyway, there is no real way to determine, that the logformat has changed.\nYou'll need to restart the server in order to change the logformat and all\nprevious settings are gone and forgotten.\nWriting a \"logformat\" string into the log every time the server restarts may\nlead to confusion when restarting gracefully, since the currently running\nchildren will log the old format...\n(Additionally under win32 apache automatically restarts from time to time, so\nyou'd have from time to time such identifiers in your logs without doing a\nmanual restart).\n\nThe really clean solution would be to insert that string into every log entry.\n\nHowever, I don't believe that someone is willing to extend mod_log_config to\ninsert such a format identifier into every logfile after startup. But AFAICS,\nmod_log_config has proper interfaces, so it's probably possible to write an\nextension module, that provides functionality for that edge case.\n\nOne could also build a small program or script that takes the log data (piped\nlog) and inserts such a string itself after startup and does nothing else.\n\nI'll leave the report open for now, but I think, it will finally die as \"wontfix\".", "id": 37811, "time": "2003-05-26T14:53:58Z", "bug_id": 20241, "creation_time": "2003-05-26T14:53:58Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 20241, "attachment_id": null, "is_private": false, "id": 37814, "time": "2003-05-26T15:47:36Z", "creator": "bugz@macrotex.net", "creation_time": "2003-05-26T15:47:36Z", "text": "I agree that there is some ambiguity on a graceful restart. To make things\nsimple, and yet still useful, write the \"header\" (i.e., log format comment\nstring) to the log file only a \"hard\" restart. This would still be quite useful\nto those who know about it. Like I said, I think it should be optional with the\noption turned off by default. \n\nThe problem with adding the format to every line, not only does it increase the\nlog file size by upwards of 15% or so, a web log parser has to examine every\nline to see if the format has changed adding considerable computing overhead. \n\nI still think, the graceful restart notwithstanding, that adding the format on a\nrestart would prove to be beneficial. "}, {"count": 5, "tags": [], "bug_id": 20241, "attachment_id": null, "is_private": false, "id": 104261, "time": "2007-06-09T05:27:49Z", "creator": "davi@apache.org", "creation_time": "2007-06-09T05:27:49Z", "text": "Closing due to inactivity, length of time and absence of agreement. If more information\nappears later, please re-open the bug.\n\nSidenote: Apache actually writes a \"header\" on \"hard\" restart (or start/shutdown):\n\n[Sat Jun 09 13:08:30 2007] [notice] Apache/2.3.0-dev (Unix) configured -- resuming normal operations\n[Sat Jun 09 13:19:49 2007] [notice] caught SIGTERM, shutting down"}]