[{"count": 0, "attachment_id": null, "creator": "bgivner@uslynx.com", "is_private": false, "id": 37851, "time": "2003-05-27T16:06:24Z", "bug_id": 20266, "creation_time": "2003-05-27T16:06:24Z", "tags": [], "text": "When I run a memory profiler against Tomcat, I see that the number of String, \nchar[], Object[], and short[] objects is increasing about one a second.\n\nAll I did was start Tomcat.\nNo web applications are running, and no HTTP requests are begin sent to the \nserver.\nI even commented out all the <Context> entries in the server.conf file.\n\nThe number of String instances grows from around 18,000 to 20,000, then \neventually resets back to 18,000 (the garbage collector runs?)\n\nThis seems like buggy behavior  -- why are so many new Strings being created?"}, {"count": 1, "attachment_id": null, "creator": "remm@apache.org", "is_private": false, "id": 37852, "time": "2003-05-27T16:16:47Z", "bug_id": 20266, "creation_time": "2003-05-27T16:16:47Z", "tags": [], "text": "Tomcat uses background processes to do a variety of stuff (context reloader,\nmanager session expiration, host auto deployer, possibly server socket timeout,\netc), and these allocate objects (btw, one String leads to the allocation of a\nvariety of things, including, obviously, a char buffer). Most of that background\nstuff can be disabled if you need to.\n"}, {"count": 2, "tags": [], "bug_id": 20266, "attachment_id": null, "id": 37858, "time": "2003-05-27T18:01:51Z", "creator": "bgivner@uslynx.com", "creation_time": "2003-05-27T18:01:51Z", "is_private": false, "text": "How do I disable the background stuff?\nI already disabled context reloading, there is no manager app, etc.\nWhy is Tomcat continuously creating new String objects?"}, {"count": 3, "tags": [], "creator": "yatesmi@nortelnetworks.com", "attachment_id": null, "is_private": false, "id": 37962, "time": "2003-05-29T00:13:51Z", "bug_id": 20266, "creation_time": "2003-05-29T00:13:51Z", "text": "I have had similar experience with memory use of tomcat growing.\n\nThe connector code in 4.1.24 (not sure about 4.1.18) times out the listen \nsocket after 1 second. I submitted a bug fix for this and it will be in the \nnext 4.1.x release I assume.\n\nIf you are worried about the memory performance when tomcat is idle I suggest \ncommenting out the SSL connector (if you can).\n\nMy tests showed that with the SSL connector disabled and tomcat not actively \nprocessing requests around 1K of memory a second was being allocated (even with \nthe socket timing out).  "}]