[{"count": 0, "tags": [], "bug_id": 20289, "is_private": false, "text": "Bear with me as I'm short on sleep.\n\nWe've been running 1.3.23, and are upgrading to 1.3.27.\n\n1.3.27 refused to start.  strace showed a SIGSEV at the end of the execution. \nNo core file.  We have an 'Include' of virtual hosts (20 hosts) at the end of\nthe main httpd.conf.  I commented the include out and the server started just\nfine.  I finally narrowed it down to the \"ErrorLog\" directive in my included\nvirtualhost file.  I deleted each reference to an ErrorLog and the server\nstarted just fine.  I verified by visiting each site.\n\nTo be sure it wasn't a permissions problem I double checked each file referenced\nby the ErrorLog directives.  I performed a 'chmod -R web:web /weblogs' (the base\nof my weblogs directory tree).    I'm convinced its not a permissions issue or\nownership issue.\n\nHere is where it gets weird(er).  If I eliminate 19 of the 20 virtualhosts in my\ninclude file (it doesn't matter which ones I keep or throw away) and there is\nonly one virtualhost in the file, the ErrorLog directive for that single\nvirtualhost is accepted and the server starts.\n\nAdditionaly, when I start the server with SSL enabled, it won't start either\n(gratuitous logging takes place on behalf of mod_ssl).\n\nSome details about the install:\nDSO install, default modules built from configure.\nAdded mod_ssl as a shared module\nAdded php 4.3.1 as a shared module via apxs (PHP sites render just fine).\nPHP was compiled with a whole lotta stuff (incl LDAP, IMAP, MySQL, SASL; they\nall seem to work fine).\n'ldd' finds all shared libraries.\n\nAny ideas?  The URL above has text files with some of the debug output. \nConsidering the level of weirdness I woudl think someone would have come across\nthis before but I didn't find anything in bugzilla.", "id": 37907, "time": "2003-05-28T09:05:52Z", "creator": "emetsger@nextleveldesign.net", "creation_time": "2003-05-28T09:05:52Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "is_private": false, "id": 38453, "time": "2003-06-05T19:22:49Z", "bug_id": 20289, "creation_time": "2003-06-05T19:22:49Z", "text": "My guess is that you are hitting file-descriptor limits.  See:\nhttp://httpd.apache.org/docs/vhosts/fd-limits.html"}, {"count": 2, "tags": [], "creator": "emetsger@nextleveldesign.net", "attachment_id": null, "is_private": false, "id": 38667, "time": "2003-06-10T12:16:47Z", "bug_id": 20289, "creation_time": "2003-06-10T12:16:47Z", "text": "Doh.  I didn't even think about descriptors.  I'll check into that and post\nback.  Thanks!"}, {"count": 3, "tags": [], "creator": "nd@perlig.de", "attachment_id": null, "id": 41080, "creation_time": "2003-07-21T14:52:44Z", "time": "2003-07-21T14:52:44Z", "bug_id": 20289, "text": "No further response. Assuming issue resolved.\n\nPlease reopen the bug if this is not the case and you can provide additional\ninformation.\n\nThanks for using Apache.\n", "is_private": false}]