[{"count": 0, "tags": [], "bug_id": 20344, "attachment_id": null, "text": "Background:\nCurrently, Ant supports logging as XML by specifying a logger on the \ncommand line:\n\nant -logger org.apache.tools.ant.XmlLogger -verbose -logfile build_log.xml\n\nProblem:\nThere are a few limits to this. The log file and listener must be specified \non the command line instead of in property fields or a file. Also, the \nlog file is produced at the end of the build, so transforms and other \nfollowup operations have to be performed from another build script.\n\nSolution:\nThis patch modifies the record task to allow a Recorder to be specified.\nXmlRecorder, a subclass of XmlLogger, is included in this patch and can be \nused to produce the XML log output. This may then be transformed from within \nthe build.xml.\n\nDocumentation:\nThe ant Record core task's documentation is updated to reflect the change.\nListener is removed from the wishlist at the bottom of Record's html file. \nAfter looking into the code, I found it more appropriate to refer to the \nattribute as a recorder (sticking to the codebase' naming convention).\n\nExample:\nHere, a java compile task is recorded, and the resulting log.xml file \nis used to produce html output.\n\n    ...\n    <record name=\"log/log.xml\" recorder=\"org.apache.tools.ant.XmlRecorder\"\n      action=\"start\"/>\n    <javac ...\n    <record name=\"log.xml\" action=\"stop\"/>\n    \n    <style basedir=\"log/\" includes=\"log.xml\" destdir=\"doc/\" \n      extension=\".html\"style=\"log.xsl\"/>\n    ...\n\nThe tar.gz attachment includes the patch, new files. See recorder.make for\nthe list of changed and new files.\n\nTests:\n  The code has been tested with the XmlRecorder, no recorder, and for regression \nusing the command line method. \n\nToDo:\n  The XmlRecorder will not add entries when the recorder is restarted. I figured \nit would be best to get this in first and learn the process \n(my first public patch ever). If restarting is needed I'll improve the code later.", "id": 38010, "time": "2003-05-29T23:21:54Z", "creator": "kris.bravo@corridor-software.us", "creation_time": "2003-05-29T23:21:54Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 20344, "text": "Created attachment 6562\nPatch file and new files in tar.gz", "id": 38011, "attachment_id": 6562, "creator": "kris.bravo@corridor-software.us", "creation_time": "2003-05-29T23:25:27Z", "time": "2003-05-29T23:25:27Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 20344, "text": "Created attachment 14401\nChanged source files\n\nA few people have shown some interest in my change, so I've updated it for the\nANT_162 tag.\n\nSince I appear to have botched the first patch I attached, I've simply attached\nthe changes files this time.\n\nNote: This change implements the following from the wish list on the\nCoreTasks/Recorder.html page:\n\nlistener\tA classname of a build listener to use from this point on\ninstead of the default listener.", "id": 71829, "attachment_id": 14401, "creator": "kris.bravo@corridor-software.us", "creation_time": "2005-03-04T15:46:09Z", "time": "2005-03-04T15:46:09Z", "is_private": false}, {"count": 3, "tags": [], "creator": "kris.bravo@corridor-software.us", "attachment_id": null, "id": 93862, "time": "2006-09-19T20:18:21Z", "bug_id": 20344, "creation_time": "2006-09-19T20:18:21Z", "is_private": false, "text": "This patch request has now past the three year mark. I'm not sure what the\noutcome has been of other patches but to anyone looking for this type of\nfunctionality I'd recommend moving from ant to Maven 2.\n\nhttp://maven.apache.org\n\nAlso, continuum (same site) handles automated builds well.\n\nNo more updates on this patch will be done."}, {"count": 4, "tags": [], "creator": "mbenson@apache.org", "attachment_id": null, "id": 93868, "time": "2006-09-19T20:36:38Z", "bug_id": 20344, "creation_time": "2006-09-19T20:36:38Z", "is_private": false, "text": "I'm sorry your experience has been negative.  It can be hard to get patches\nnoticed if you don't nag the right people and find a committer who is interested\nenough to push them through.  I am reopening this because I didn't see any\nreason other than your disgust that this patch couldn't go in in one form or\nanother... unless you are actually rescinding the IP grant you made when you\nclosed the issue report.\n\n-Matt"}, {"count": 5, "tags": [], "bug_id": 20344, "text": "especially with ~400 outstanding enchancement requests", "id": 93869, "time": "2006-09-19T20:44:41Z", "creator": "peterreilly@apache.org", "creation_time": "2006-09-19T20:44:41Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 20344, "text": "I'm not rescinding the offer, but did want to create a pointer if someone was\nlooking for this type of behavior from a build tool. I assumed that eventually\nall patches get either merged, rejected or overcome by events. This patch is\ngetting closer to the latter given the timeframe. The comment on the ticket is\nto keep folks from hitting a dead end.\n\nAs for nagging someone to roll it in, I suppose I should have. In Maven's case,\nI became a committer on the plugins project to avoid this type of situation.", "id": 93926, "time": "2006-09-20T14:48:13Z", "creator": "kris.bravo@corridor-software.us", "creation_time": "2006-09-20T14:48:13Z", "is_private": false, "attachment_id": null}]