[{"count": 0, "tags": [], "bug_id": 20448, "text": "I installed Apache using the MSI installer located at \nhttp://httpd.apache.org/download.cgi.  Once Apache was installed, I attempted \nto view the installed documentation using Internet Explorer 6 and opening the \nindex.html file with it.  I was surprised to discover that there was no \nindex.html file, but only a language specific index.html.en file.  Of course IE \n6 refused to open the file since it did not have a .html extension.  So I then \nopened the index.html.en file with Netscape.  I was then able to view the index \npage but when I clicked on a link, it attempted to link to another HTML file \nthat did not have the .en suffix.  Since that file did not exist (the file had \na .en suffix when it should not have), the link failed with a 404 error.\n\nFrustrated, I finally gave up on viewing the installed documentation & took a \nlook at the online documentation instead.  Unfortunately this was of limited \nuse because I could not do a search thru just the installed documentation.  So \nI then attempted to do a straight text search through the installed \ndocumentation using the Windows 2000 \"Search...\" dialog...\n\nWhen I attempted to do a text search in the docs directory for PHP, I ended up \nwith a ton of hits, most of which were useless to me.  Because there are \nseveral copies of the documentation in different languages, as well as a \nboatload of XML files that it appears I don't need to view the docs, I ended up \nwith a ton of hits, most of which were on HTML documents in languages that I \ndon't know or XML files which I don't care about.  In short, the current \nshipped format of the documentation makes it impossible to do a text search for \nanything.\n\nToday a friend told me that if I viewed the documentation through the Apache \nweb server, then these problems would all mysteriously go away (less the \ninability to do a text search).  I can't tell you how frustrating it was not to \nbe able to use the documentation.  My issue with viewing the documentation over \nApache is that I want to be able to view the docs by opening the files directly \nwith a browser.  The reason for this is that I do not want to host the Apache \ndocumentation on my web server.  People that will be visiting my web site have \nno need to view the documentation, and I do not want to make it accessible to \nthem.\n\nWouldn't it be possible to either ship the documentation separately from Apache \nin language specific bundles?  Or wouldn't it be possible to put the docs for \neach language in a separate directory so that one could do a text search on \njust one copy of the docs?  Also, is it necessary to ship the XML files with a \nbinary distribution?  The Apache source isn't shipped in the binary \ninstallation, and near as I can tell, the XML files are only needed to generate \nthe documentation, and as an end-user, I really don't want to see them at all.", "id": 38259, "time": "2003-06-03T14:33:03Z", "creator": "cdearborn@secluda.com", "creation_time": "2003-06-03T14:33:03Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "nd@perlig.de", "is_private": false, "id": 38279, "creation_time": "2003-06-03T17:12:32Z", "time": "2003-06-03T17:12:32Z", "bug_id": 20448, "text": "The distributed documentation is intended to be viewed via webserver and *is*\nusable that way.\nYou may, however, download a language specific CHM file for windows, that may\nmeet  your needs better, see <http://www.apache.org/dyn/closer.cgi/httpd/docs/>.\n\nThe XML files are also distributed by intention, to make it easier for people to\nprovide patches etc.\n\nThanks for using Apache.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 20448, "text": "It is true that the documentation is useable if hosted from the Apache web \nserver, however, as I have stated below, I do not want to host the \ndocumentation on my web server.  It seems to me that this would be a pretty \ncommon thing for people to want, so I feel that I am not alone in making this \nrequest.\n\nI also don't think it's unreasonable to want to view/use the HTML documentation \n*without* having to install and configure Apache.\n\nI understand that things are this way by design.  However, I'm trying to make \nthe point that the documentation could be much more useable then it currently \nis, and that perhaps in future releases the issues that I've noted could be \ntaken into account.\n\nI really don't like the fact that my suggestions appear to be discarded as \nbeing worthless when I've taken the time to let you folks know about the \nexperience that I've had thus far, which has been extremely frustrating.\n\nAt the least, it should be documented somewhere in big, red, bold letters that \nthe HTML documentation can only be viewed when served thru the Apache web \nserver.", "id": 38281, "time": "2003-06-03T17:49:58Z", "creator": "cdearborn@secluda.com", "creation_time": "2003-06-03T17:49:58Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 20448, "attachment_id": null, "id": 38284, "time": "2003-06-03T18:18:05Z", "creator": "nd@perlig.de", "creation_time": "2003-06-03T18:18:05Z", "is_private": false, "text": "> It is true that the documentation is useable if hosted from the Apache web\n> server, however, as I have stated below, I do not want to host the\n> documentation on my web server.  It seems to me that this would be a pretty\n> common thing for people to want, so I feel that I am not alone in making this\n> request.\n\nMaybe. Currently you're the only one I know ;-)\n\n> I also don't think it's unreasonable to want to view/use the HTML\n> documentation *without* having to install and configure Apache.\n\n<http://httpd.apache.org/docs-2.0/>.\n\n> I really don't like the fact that my suggestions appear to be discarded as \n> being worthless when I've taken the time to let you folks know about the \n> experience that I've had thus far, which has been extremely frustrating.\n\nWhat the heck do you think we're doing here? You're considering your special\nsituation as a \"major bug\", which is definitely not. Your report is therefore\ninvalid.\nDid you really read my posting? Did you, for example, try a CHM file? I must\nmiss something in your reply.\n\nHowever, just FYI: the main point of your suggestions (providing download\npackages) were already discussed some time ago on the docs list - and voted down\n(mostly because of conceptual problems like incomplete translations). We provide\ncurrently only special formats like CHM and PDF (in development).\n\nWe may reconsider, however, and you are welcome to provide help within the\ndocumentation project.\n\n> At the least, it should be documented somewhere in big, red, bold letters that \n> the HTML documentation can only be viewed when served thru the Apache web \n> server.\n\nAs already said - that is not true.\n\nLast Note: If it sounds a bit harsh, don't care too much, I'm absolutely\ninterested in a serious discussion."}, {"count": 4, "tags": [], "bug_id": 20448, "is_private": false, "text": "I'm glad we can discuss this using this mechanism.  This is the first time I've \never used this system & I didn't realize that it worked in this way.\n\n>> At the least, it should be documented somewhere in big, red, bold letters \nthat \n>> the HTML documentation can only be viewed when served thru the Apache web \n>> server.\n\n> As already said - that is not true.\n\nCan you explain to me how I can view the installed HTML documentation without \nserving it thru the Apache web server?  As far as I can see there's no way to \ndo that.", "id": 38285, "time": "2003-06-03T18:31:29Z", "creator": "cdearborn@secluda.com", "creation_time": "2003-06-03T18:31:29Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 20448, "attachment_id": null, "id": 38293, "time": "2003-06-03T21:05:51Z", "creator": "erik@codefaktor.de", "creation_time": "2003-06-03T21:05:51Z", "is_private": false, "text": "> As already said - that is not true.\n\n>> Can you explain to me how I can view the installed HTML documentation without \n>> serving it thru the Apache web server?  As far as I can see there's no way to \n>> do that.\n\nAndré meant that there are valuable alternatives, e.g. the CHM files and\nhopefully in the near future also PDF files. Another alternative which is always\nup-to-date and very well-connected is http://httpd.apache.org/docs-2.0/\n\nYou mentioned that you tried the Windows search dialog; did you also try to\nsearch only for *.html.en files which contain the searched term? Isn't this\npossible with Windows?\n\nHmmm, I really don't see a point in reporting this as a major bug. Perhaps an\nenhancement but not a bug."}, {"count": 6, "tags": [], "bug_id": 20448, "text": "> André meant that there are valuable alternatives, e.g. the CHM files and\n> hopefully in the near future also PDF files. Another alternative which is \nalways\n> up-to-date and very well-connected is http://httpd.apache.org/docs-2.0/\n\nGotcha.\n\n> You mentioned that you tried the Windows search dialog; did you also try to\n> search only for *.html.en files which contain the searched term? Isn't this\n> possible with Windows?\n\nIt certainly is.  Once I realized that linking from one doc to the other \nwouldn't work though, I gave up on the installed docs.  I guess I could have \ndone the text search on my local system, then hunted down the file in the \nonline docs...\n\n> Hmmm, I really don't see a point in reporting this as a major bug. Perhaps an\n> enhancement but not a bug.\n\nFeel free to call it whatever you would like!\n\nI still think it should be documented in big glowing red letters somewhere in a \nvery obvious place that the installed HTML documentation is only viewable when \nserved thru the Apache web server.  Such a sentence would have saved me a \ntremendous amount of frustration.", "id": 38377, "time": "2003-06-04T18:06:05Z", "creator": "cdearborn@secluda.com", "creation_time": "2003-06-04T18:06:05Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 20448, "text": "Unfortunately, if we placed every hint that ever cost someone an hour of\nfrustration in big glowing red letters in the front of the docs, the front page\nwould be 1000 pages of big glowing red letters.\n\nNow, if you could suggest where exactly we should place this so\nthat it would be obvious but wouldn't confuse or distract the 99% of people\nwho don't run into this problem, that would be great.\n\n[Writing documentation is easy; writing well structured, clear documentation\nis hard.]", "id": 38387, "time": "2003-06-04T21:22:18Z", "creator": "slive@apache.org", "creation_time": "2003-06-04T21:22:18Z", "is_private": false, "attachment_id": null}]