[{"count": 0, "tags": [], "bug_id": 20440, "text": "A request relayed from Bram Cohen <bram@bitconjurer.org>:\n\nAny chance apache could start having the .torrent ->\napplication/x-bittorrent mimetype mapping out of the box?\n\nI say, sure, why not?", "id": 38236, "time": "2003-06-03T04:26:56Z", "creator": "brian@apache.org", "creation_time": "2003-06-03T04:26:56Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Only if we want to contradict what we say here:\nhttp://httpd.apache.org/docs-2.0/mod/mod_mime.html#typesconfig\n\nI don't have a problem with making exceptions to rules (especially considering\nthe filename extension is very unique); we just need to be careful we don't\ntrigger a flood of x- types.", "attachment_id": null, "id": 38288, "creator": "slive@apache.org", "time": "2003-06-03T19:17:48Z", "bug_id": 20440, "creation_time": "2003-06-03T19:17:48Z", "is_private": false}, {"count": 2, "tags": [], "creator": "brian@apache.org", "attachment_id": null, "text": "Bram writes:\n> I used an x- mimetype becaues IANA says that you should do that when your\n> protocol isn't approved by them. Of course, they want everyone to get a\n> mimetype without the x- approved by them eventually, which involves a\n> compatibility breakage. I see no need for that pain, especially since\n> collisions in the mimetype namespace never happen; One of the nice effects\n> of it being a string rather than a number.\n\nI don't know - it's not up to me, but Bram's not alone in his opinion of the\nbrokenness with regards to the x- concept with IANA. \n", "id": 38629, "time": "2003-06-09T20:49:16Z", "bug_id": 20440, "creation_time": "2003-06-09T20:49:16Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 20440, "text": "My quick reading of the material under\nhttp://www.iana.org/cgi-bin/mediatypes.pl\nseems to contradict this.\n\nThose RFCs explicitly discourage the use of x- types, except for\nexperimental or private communication.  They also say a non x- type\ncan't be used until it is registered, but registration is a simple\ntwo-week process.  It doesn't require any complicated approval\nprocess.\n\n", "id": 38638, "time": "2003-06-09T22:50:03Z", "creator": "slive@apache.org", "creation_time": "2003-06-09T22:50:03Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "bram@bitconjurer.org", "attachment_id": null, "text": "I'm not sure what the RFC means by x- mimetypes 'can't' be used. the x- mimetype\nfor BitTorrent was used on tens of thousands of machines during the period when\nthe protocol was in such flux that a protocol specification would have been\npointless because it would have become obsolete almost immediately. My decision\nto use an unregistered mimetype during that period was based on the engineering\nreality of it being impossible to design a massively scalable protocol without\ntrying it out under massive scaling. That mimetype has continued being used\nsince because there was no time in which it was necessary to break all existing\nmachine configurations which used BitTorrent, so there was no opportunity to\nchange the mimetype without inflicting unnecessary pain.\n\nFor what it's worth, the hoop-jumping involved in registering a mimetype would\nhave actually been quite a lot for me to do back when I was spending all my time\njust trying to get BitTorrent to work.\n\nAlso, and this is just anecdotal, for another project I attempted to get an\nassigned port number and got nowhere. I filled out the appropriate form and got\nmail back months later with a simple request to fill out questions I hadn't\nanswered at length. I responded with an explanation of how those questions\nappeared to be nonsensical in the context of the particular protocol, and a\nrequest for clarification. I never heard back again. In practice everyone just\nclaims port numbers and the 'official' IANA list has a lot of holes.\n\nNotably there's a plethora of x- pdf mimetypes and jigdo uses an x- mimetype, so\nothers have skipped out on formal registration as well.\n\nIn any case, There are now over a million deployed BitTorrent clients which\nexpect the x- mimetype, and switching it would incur the pain of breaking all of\nthem in exchange for dubious benefits, so the mimetype is going to remain the same.\n\n-Bram", "id": 38747, "time": "2003-06-12T03:14:52Z", "bug_id": 20440, "creation_time": "2003-06-12T03:14:52Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 20440, "text": "What concerns me the most is that I don't want to see us acting as an\narbiter of what is a proper mime type.  The IANA already has a whole\ninfrastructure for that, and I don't see any point in us duplicating it.\nA discussion on the docs@httpd.apache.org list hasn't revealed any\ninclination to change our general policy of deffering to the IANA.\n\nAs far as making an exception in this case, I have no particular problem\nwith that, but I won't do it myself without some additional support.\nTo be specific: I'll add this type if I see at least two more\n+1s (positive votes) from apache project members.", "id": 38748, "time": "2003-06-12T03:54:29Z", "creator": "slive@apache.org", "creation_time": "2003-06-12T03:54:29Z", "is_private": false, "attachment_id": null}, {"text": "Well, you could certainly have the client support the unregistered and a new\nregistered mime type.\n\nThe other alternative is to forgo registration and use the vendor space.\nSomething like: application/vnd.bittorrent-foo. ViewCVS uses this approach for\nits custom mime type.\n\nI'm not trying to defend the IANA, but I do agree with wanting to avoid becoming\nan arbiter and getting deluged with \"choose mine! choose mine!\" posts. And yes,\nI'm a happy BitTorrent user, too :-)  I just happen to fall in the camp of\ntrying to use standards whenever possible, and it appears there *are* ways to\nmove towards a standard (dual mime type support in client, and/or vendor space)", "tags": [], "creator": "gstein@gmail.com", "attachment_id": null, "count": 6, "id": 39053, "time": "2003-06-18T21:17:56Z", "bug_id": 20440, "creation_time": "2003-06-18T21:17:56Z", "is_private": false}, {"text": "It seems that this (important) discussion has somehow been left in the dustheap.\nI may not be an Apache developer, but Bram certainly gets my vote; the number of\nBitTorrent installations is probably in the tens of millions by now.", "tags": [], "creator": "guspaz@novasearch.net", "attachment_id": null, "count": 7, "id": 49506, "time": "2003-12-22T00:21:43Z", "bug_id": 20440, "creation_time": "2003-12-22T00:21:43Z", "is_private": false}, {"count": 8, "tags": [], "text": "Well. Once it's registered at IANA, it'll go into the distribution. The policiy\nis clear at this point and was not changed in the meantime. Please reopen the\nreport when it's time to wake up.", "attachment_id": null, "id": 49536, "creator": "nd@perlig.de", "time": "2003-12-22T11:43:58Z", "bug_id": 20440, "creation_time": "2003-12-22T11:43:58Z", "is_private": false}, {"count": 9, "tags": [], "creator": "guspaz@novasearch.net", "attachment_id": null, "text": "First off, my appologies for digging up an old bug if it is not welcome.\n\nAnd second, my comment: While still not registered with IANA, I think the\nexplosive growth in BitTorrent (Now accounting for over a third of overall\ninternet traffic) merits special treatment.\n\nConsidering that BitTorrent is probably only second in internet traffic to a\nsmall handful of protocols (I'd imagine HTTP would be top on the list), it would\nbe interesting to calculate what percentage of IANA-approved protocols would,\nwhen combined, still account for less total internet bandwidth than BitTorrent.\nI would imagine BitTorrent would account for more internet bandwidth than nearly\nall IANA-approved protocols combined. I propose that under those circumstances,\n IANA is much less relevant (to this discussion) than this bug's comments hold\nit to.\n\n<insert joke here about BitTorrent adding support for the HTTP mimetype rather\nthan the other way around>", "id": 69325, "time": "2005-01-07T06:01:30Z", "bug_id": 20440, "creation_time": "2005-01-07T06:01:30Z", "is_private": false}]