[{"attachment_id": null, "tags": [], "bug_id": 20475, "is_private": false, "count": 0, "id": 38346, "time": "2003-06-04T12:40:20Z", "creator": "ryan.laus@cmich.edu", "creation_time": "2003-06-04T12:40:20Z", "text": "I am using Apache 2.0.46 on AIX 4.3.3 with the latest maintenance level.  I \ntried posting to the message boards with this problem but nobody seems to know \nwhat may be causing it.\n\nAfter a change is made to any web page on our site, the page will give a \"page \nnot found error\" for approximately 3 and a half minutes.  Then, after the 3 \nminutes, the page can be viewed.  I have also made sure that the browser cache \nis clear on each client machine before viewing the page.  The access_log shows \nthat it is giving a 304 error as follows, with nothing in the actual error_log.\n\nHere is a couple entries from the access_log when the page gets \"page not \nfound\" message:\nxxx.xx.xx.xx - - [04/Jun/2003:08:12:50 -0400] \"GET /temp/parkhours.htm HTTP/1.1\n\" 304 0\nxx.xx.xx.xx - - [04/Jun/2003:08:12:50 -0400] \"GET /temp/parkhours.htm HTTP/1.1\n\" 304 0 \"-\" \"Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)\"\n\nHostname Lookups are turned off in the configuration file and most of the other \nsettings were kept at their defaults.  Any help would be greatly appreciated.  \nThank you!\n\nRyan Laus\nProgrammer/Analyst\nCentral Michigan University"}, {"attachment_id": null, "tags": [], "creator": "slive@apache.org", "text": "304 is not an error; it means \"page not modified\".  It is returned only if\nthe client uses an \"if-modified-since\" request header.  The client should then\nuse its cached version of the page.\n\nHence this must be a client problem.  Either it doesn't have the page cached,\nin which case it shouldn't be sending \"if-modified-since\" or it does, in \nwhich case it should return the cached version.\n\nI have no idea what exactly is triggering this.  If you would like to discuss\nit further, I suggest providing more details on your setup with a posting to\nthe users@httpd.apache.org mailing list.", "count": 1, "id": 38385, "time": "2003-06-04T21:14:57Z", "bug_id": 20475, "creation_time": "2003-06-04T21:14:57Z", "is_private": false}]