[{"count": 0, "tags": [], "bug_id": 20491, "text": "Referencing this copy of the HTTP 1.1 specification\n\nhttp://www.zvon.org/tmRFC/RFC2616/Output/index.html\n\nPer sections 8.1.2.1 and 14.10 any client not supporting persistent HTTP \nconnections should send a \"Connection: close\" header.\n\nPer section 4.2 header field names are case-insensitive but header field values \nare not specified.  It may therefore be assumed that the intent is to support \ncase-sensitive header field values at the discretion of the implementing \napplication.\n\nWe've found a product (formerly Cisco uOne) which implements an HTTP client \nwhich uses the slightly incorrect syntax of \"Connection: Close\" (note the upper \ncase 'C').  While this does not quite comply with the HTTP 1.1 spec which \nrefers to use of the string \"close\" only the HTTP 1.1 spec never makes mention \nof requiring that \"close\" be lower case.  Clearly the use of \"Close\" is a poor \nimplementation but it would seem that Tomcat 4.1 is unnecessarily picky here.\n\nPer section 19.3 it is recommended that applications be \"tolerant of deviations \nwhenever those deviations can be interpreted unambiguously\".  I think that \napplies in this case and thus I suggest making Tomcat 4.x tolerant of the HTTP \nheader \"Connection: Close\".\n\nBelow is a patch for jakarta-tomcat-\n4.0/catalina/src/share/org/apache/catalina/connector/http/HttpProcessor.java.  \nIt may not be the ideal way to implement the fix as perhaps adding alternative \ncase-insensitive comparison methods to the HttpHeader class would be more \nelegant.\n\nRCS file: /home/cvspublic/jakarta-tomcat-\n4.0/catalina/src/share/org/apache/catalina/connector/http/HttpProcessor.java,v\nretrieving revision 1.46\ndiff -r1.46 HttpProcessor.java\n680,681c680,681\n<                 if (header.valueEquals\n<                     (DefaultHeaders.CONNECTION_CLOSE_VALUE)) {\n---\n>                 if (value.equalsIgnoreCase(\n>                     new String(DefaultHeaders.CONNECTION_CLOSE_VALUE))) {", "id": 38404, "time": "2003-06-05T01:46:20Z", "creator": "jcourtney@inphonic.com", "creation_time": "2003-06-05T01:46:20Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 20491, "text": "AFAIK, this works correctly with the CoyoteConnector.  The HttpConnector is \ndeprecated, and won't be fixed.  \n", "count": 1, "id": 38406, "time": "2003-06-05T06:06:08Z", "creator": "william.barker@wilshire.com", "creation_time": "2003-06-05T06:06:08Z", "is_private": false}]