[{"count": 0, "tags": [], "bug_id": 20500, "attachment_id": null, "id": 38416, "time": "2003-06-05T10:00:49Z", "creator": "brody@gebit.de", "creation_time": "2003-06-05T10:00:49Z", "is_private": false, "text": "The default org.apache.log4j.PropertyConfigurator does not support filters for \nthe appenders, although filter support (using a filter chain) is integrated in \nthe base class of all Appenders (AppenderSkeleton).\nTo integrate this needed feature there, I thought about to derive a \nPropertyConfigurator from the log4j base class, which I must do also, to \nintegrate additional components and its configuration by a properties file.\n\nI discovered, that the basic log4j configuration part can be done by the \noriginal PropertyConfigurator. One part of this basic configuration is the \nconfiguration of the Appenders (except the Filters), so I though about to put \nthis additional step into my own PropertyConfigurator after determining, that \nall appenders get saved into a registry - testing this (by an overloaded \ndoConfigure() method) as follows:\n\npublic void doConfigure(Properties properties,LoggerRepository hierarchy) {\n\t\tconfigureReaderRoot(properties);\n\t\tsuper.doConfigure(properties, hierarchy);\n                configureAppenderFilter(properties);\n\t}\n\nshowed me, that the registry object, which is PROTECTED and therefor visible \nfor a derived PropertyConfigurator class, is always empty after returning from \nsuper.doConfigure().\nThat is my problem and the problem can be found in line 411ff. of the log4j \nPropertyConfigurator class:\n    // We don't want to hold references to appenders preventing their\n    // garbage collection.\n    registry.clear();\n\nI think, there are two possible solutions (which must be done inside log4j, \nthere are no workarounds I know):\n(1) delete the above mentioned lines and give an official access to the that \nprinciple useful functionallity, which can be called from outside.\n(2) split the doConfigure() method, so additional work can be done before the \nregistry gets cleared."}, {"count": 1, "tags": [], "text": "Added separate and protected clearRegistry method, called from doConfigure in \nPropertyConfigurator.  You can overwrite this method as you see fit, e.g. to do \nnothing, and then manage the registry however you want, including not clearing \nit at all.", "is_private": false, "id": 68378, "creator": "yoavs@computer.org", "time": "2004-12-13T17:29:44Z", "bug_id": 20500, "creation_time": "2004-12-13T17:29:44Z", "attachment_id": null}]