[{"count": 0, "tags": [], "creator": "tjsb@slb.com", "attachment_id": null, "is_private": false, "id": 38583, "time": "2003-06-09T00:55:12Z", "bug_id": 20596, "creation_time": "2003-06-09T00:55:12Z", "text": "The Help module tries to find the correct place to scroll to when Help is \ninvoked on a particular test element. This works OK for newly created \nelements, but does not currently work if the user changes the name of the \nelement.\n\nThe Help module uses the getStaticLabel() method to find the anchor name.\nThe method is implemented as an instance method by the GUI classes (why is it \nnot static?) which fetches the appropriate entry from the resource file.\n\nHowever, the implementation in JMeterTreeNode currently does the same as \ngetName(), which can be changed by the user.\n\nThe patch which follows seems to work OK, but is probably not the most \nefficient way to do it, especially since a new instance of the GUI class is \ncreated ... if the existing GUI class instance could be retrieved, that would \nbe much better. If not, perhaps the getStaticLabel() method could be made \nstatic?"}, {"count": 1, "tags": [], "creator": "tjsb@slb.com", "attachment_id": 6707, "is_private": false, "id": 38584, "time": "2003-06-09T00:56:05Z", "bug_id": 20596, "creation_time": "2003-06-09T00:56:05Z", "text": "Created attachment 6707\nJMeterTreeNode.patch - fix getStaticLabel()"}, {"count": 2, "tags": [], "creator": "mstover1@apache.org", "attachment_id": null, "is_private": false, "id": 38673, "time": "2003-06-10T13:32:47Z", "bug_id": 20596, "creation_time": "2003-06-10T13:32:47Z", "text": "Yeah, I fixed this by fixing the method in JMeterTreeNode - it now retrieves the\ncorrect gui class from GuiPackage and calls it's getStaticLabel, so no new\nobject has to be instantiated.  \n\nThe method is non-static primarily so that it can appear in the\nJMeterGUIComponent interface and have it's purpose explained there.  Helps new\njmeter developers know what needs to be done, I think.  "}]