[{"count": 0, "tags": [], "text": "I'm having a problem starting apache. It is reporting syntax errors in \nhttpd.conf. Everything except a comment line is reported as a syntax error:\n\nSyntax error on line 4 of /usr/internet/apache/conf/httpd.conf:\nInvalid command '\n', perhaps mis-spelled or defined by a module not included in the server configu\nration\n/etc/apache start: httpd could not be started\n\n\nLine 4 happens to be a blank line. When a remove all blank lines then I get the \nsame error on the first valid line in the config file. If I comment out that \nline I'll get it on the next config line...\n\n\nI am running this on SCO OpenServer 5.0.6. I compiled with gcc 2.95.2 using \nmake 3.79. This has been compiled successfully on other 5.0.6 systems however \nthey were regular Intel pentium 4 processors. This machine happens to be the \nXeon processor class for IBM's new server line.\n\nMySQL, PHP and other applications have compiled and executed fine. I just can't \nseem to get Apache to work. There were no errors during compile and after \ninstalling I get the \"You have successfully .....\" banner. No errors at all.\n\nLet me know if you need any additional information.\n\nThanks,\n\nDean", "attachment_id": null, "id": 38608, "creator": "dgrimes@scvl.com", "time": "2003-06-09T18:24:54Z", "bug_id": 20620, "creation_time": "2003-06-09T18:24:54Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 20620, "attachment_id": null, "is_private": false, "id": 38630, "time": "2003-06-09T20:53:11Z", "creator": "dgrimes@scvl.com", "creation_time": "2003-06-09T20:53:11Z", "text": "I just realized that I had select version 1.2.24. I'm actually using 1.3.27. \nSorry about that.\n\nDean"}, {"count": 2, "tags": [], "text": "must be local build tool problem or conf file issue\n\ntry this:\n\n$ echo \"Listen 65535\" > minimal.conf\n$ echo \"LogLevel debug\" >> minimal.conf\n$ /path/to/httpd -f `pwd`/minimal.conf\n\ndoes server start up okay, or do you still have errors?\n\nif it starts okay, maybe there are some odd chars or line endings in your conf file\n\nif it issues the same sort of complaints about the conf file, something is\nbroken about the system and/or software and there is probably nothing we can do\nabout it\n", "attachment_id": null, "id": 49410, "creator": "trawick@apache.org", "time": "2003-12-19T03:11:16Z", "bug_id": 20620, "creation_time": "2003-12-19T03:11:16Z", "is_private": false}]