[{"count": 0, "tags": [], "bug_id": 2066, "attachment_id": null, "id": 2794, "time": "2001-06-07T21:14:59Z", "creator": "ckimyt@yahoo.com", "creation_time": "2001-06-07T21:14:59Z", "is_private": false, "text": "This may not be the appropriate forum for this bug, because who knows what Sun\nhas done to the Tomcat 4.0b1 engine embedding it in their J2EE 1.3 release.\n\nAnyhow, I've run into a problem J2EE 1.2 with Tomcat 3.0 didn't have:  the login\npage for realm authentication doesn't seem to work.\n\nI package the recommended HTML or JSP form (exemplified in Java Pet Store 1.1.2)\nand set it as the login form in the security settings in deploytool.\n\nWhen it's protecting a resource, I get the login form displayed.  When I enter a\nvalid user/password for the resource (verified by a standalone client), I get an\nabsolutely blank page.  No error in the catalina log, no exception in the j2ee\n-verbose window, nothing.  (Netscape pops up the error that the document\ncontains no data).\n\nThis exact same app works properly in J2EE 1.2.1 with Tomcat 3.0...once the user\nis authenticated, the requested page appears with authorization.\n\nAny ideas?"}, {"count": 1, "tags": [], "bug_id": 2066, "attachment_id": null, "id": 3601, "time": "2001-07-10T17:24:20Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-07-10T17:24:20Z", "is_private": false, "text": "There are essentially no changes between the Tomcat 4 that you can download\nstandalone and that included in J2SDKEE 1.3 -- at least, as of the date that the\nrev was frozen.  Can you try this with J2SDKEE 1.3 beta 2?\n"}, {"id": 3814, "tags": [], "bug_id": 2066, "attachment_id": null, "count": 2, "text": "Current Tomcat 4 code (which will be integrated into the final release of\nJ2SDKEE1.3) performs form-based login exactly per the Servlet 2.3 PFD3 spec, and\npasses the relevant security-related tests.\n", "time": "2001-07-18T09:25:11Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-07-18T09:25:11Z", "is_private": false}]