[{"count": 0, "tags": [], "creator": "raman@zed-axis.com", "attachment_id": null, "is_private": false, "id": 38928, "time": "2003-06-16T15:29:09Z", "bug_id": 20816, "creation_time": "2003-06-16T15:29:09Z", "text": "The Form Based Realm Authentication is not able to recreate the original post \nrequest.\n\nTo recreate the problem:\n\n-Request a page protected with Form Based authentication.\n-Login to the application.\n-Stop at a page which has a form with method \"POST\", till session times \nout/context is reloaded.\n-After session times out, Hit the submit button, you will be asked to login \nagain.\n-org.apache.catalina.authenticator.FormAuthenicator saves the request \nparameters with the request in session, before taking you to the login page.\n-After successful login, it should take you to the orgininal URI requested \nalong with FORM parameters.\n\nBut one gets redirected to the original request URI. All the parameters with \nthe request are lost.\n\nEither the user should be forwarded to the original request URI, or the Form \nParameters with the original request should be saved as query string to be \nappended to the request URI, so that even after redirecting to the original \nURI, we have access to the parameters."}, {"text": "This can't be done because of spec limitations. See SRV.12.5.3 Form Based\nAuthentication, bullet 7 states: \"If the user is authorized, the client is\nredirected to the resource using the stored URL path.\"\n\nThere is a limitation in the HTTP Spec. A POST can not be issued for a redirect.\n(IIRC, there might be discussions about redirects VS POST somewhere in the\njakarta-commons/httpclient mailing archives)\n\n\n", "tags": [], "creator": "funkman@joedog.org", "is_private": false, "count": 1, "id": 43413, "time": "2003-08-28T01:05:58Z", "bug_id": 20816, "creation_time": "2003-08-28T01:05:58Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 20816, "attachment_id": null, "id": 50021, "time": "2004-01-04T19:31:57Z", "creator": "medthomas@ntlworld.com", "creation_time": "2004-01-04T19:31:57Z", "is_private": false, "text": "*** Bug 11603 has been marked as a duplicate of this bug. ***"}]