[{"count": 0, "tags": [], "creator": "jon5@modem.org", "attachment_id": null, "is_private": false, "id": 39021, "time": "2003-06-18T11:53:36Z", "bug_id": 20866, "creation_time": "2003-06-18T11:53:36Z", "text": "This was very weird.\n\nAbsolutely no scripts or files changed on my website in the last 4 weeks.  \nApache 2.0.45 was installed on April 23 (two months ago).  As of 1.5 weeks ago, \nmy logged in users were being delivered the page successfully, but the script \njust hangs at the end for exactly 5 minutes then it finished with this error \nwritten to the error-log file:\n\n(70007)The timeout specified has expired: ap_content_length_filter: \napr_bucket_read() failed\n\nBasically the page would be delivered normally, but the web browser would \nappear to continue loading the page even though it was already fully \ndelivered.  After 5 minutes of this, finally the webserver would say \"done\" and \nthe browser would stop.\n\nBecause my database data does change very frequently, I first thought my \ndatabase data was calling a broken image or something that would cause the \nbrowser to hang.  Nope.  Then I thought perhaps my perl cgi script was broken \neven though it hadn't changed.  But if a perl script actually pauses for \nminutes, I would expect ps to show the perl script still running, but it was \nnot - ps showed no perl scripts running while the browser was waiting.\n\nSo I focused on Apache.  I read somewhere on bugzilla that apr_bucket_read is \ncaused when a script does not finish in time for the KeepAliveTimeOut value.  \nBut I *know* my perl script never takes more than 3 seconds to run.  Something \nin Apache was timing out after 5 minutes because the access-log shows every \naccess to the script would take 303 seconds (3 for it to run, and 300 seconds \nwould be a timeout somewhere).  But why was Apache hanging on to the script for \n5 minutes??\n\nI read somewhere on a google search that one person had a problem with Apache2 \nand non-buffered output.  So I made just TWO changes to my entire perl script, \nI removed the $|++ command which turned off auto-flushed output thus enabling \nbuffered output.  I also removed a line that simply warns me of a error:\n\nwarn \"weird\";\n\nNow the problem went away!\n\nHumm, I never noticed the warn command in any of my apache error logs, but this \nperl script was being called within another perl script, i wonder of a warn \nmessage (or a simple STDERR message) from a perl script called within another \nperl script could cause this problem?\n\nI have an example of this problem here.\n\nA page that does not have the problem:\nhttp://www.hotdlz.com/apachebug1.pl\n\nA page that DOES have the problem:\nhttp://www.hotdlz.com/apachebug/\n\nBoth scripts do a require \"/path/other-script.pl\" inside.  The only difference \nbetween the two above scripts is they call a different /path/other-script.pl.  \nThe only difference between the two /path/other-script.pl's are the following:\n\n$|++; is at the top, and\nwarn \"something weird happened\"; is located within a foreach loop through the \ndata if something weird happens.\n\nThe broken script has these two lines, while the fixed script has these two \nlines taken out.\n\nI hope this information helps in identifying the bug, or at least helps point \nsomeone else in the right direction to fixing the problem on their site."}, {"count": 1, "tags": [], "creator": "jon5@modem.org", "attachment_id": null, "is_private": false, "id": 39031, "time": "2003-06-18T14:27:12Z", "bug_id": 20866, "creation_time": "2003-06-18T14:27:12Z", "text": "by the way, due to security reasons, those URL's shown in the bug report will \ncease to function in 3 days (on or after Saturday June 21)."}, {"count": 2, "tags": [], "bug_id": 20866, "attachment_id": null, "id": 39218, "creation_time": "2003-06-21T02:38:54Z", "time": "2003-06-21T02:38:54Z", "creator": "trawick@apache.org", "text": "If the perl script is not running but Apache is still hanging on a pipe read\nthat is supposedly output from the script, maybe another process inherited the\ndescriptor and has not closed it?\n\nCan you try lsof to see if another process has a descriptor to that same pipe?\n\n(Yeah, this is probably an impractical thing to test on your real site :( )\n\nA commmon problem is a script that writes a bunch to stderr and ends up hanging\non the write because Apache hasn't started reading that pipe yet.  (This may be\ndepending on scriptlog setting...  can't recall at the moment.)  Does the script\nwrite a bunch to stderr?  This contradicts your statement that ps doesn't show\nthe script still running, but this is a fairly common problem so I have to ask.\n\nIf you can figure out a small-ish script to allow us to duplicate the problem,\nwe're in business.\n", "is_private": false}, {"count": 3, "tags": [], "text": "I think this bug is related to bug 18348 and bug 20111. ", "is_private": false, "id": 39252, "creator": "info@orangexl.com", "time": "2003-06-22T20:13:06Z", "bug_id": 20866, "creation_time": "2003-06-22T20:13:06Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 20866, "attachment_id": null, "is_private": false, "id": 39253, "time": "2003-06-22T21:12:02Z", "creator": "jon5@modem.org", "creation_time": "2003-06-22T21:12:02Z", "text": "I left the above-mentioned two URL's online, but I made a few changes to them.  \nThis is interesting.\n\nWhen I adjust the mysql SQL query to get back only 5 or 10 rows, the bug goes \naway for the \"bug\" script.  But when I adjust it to get back 71 rows, then the \nbug exists.\n\nBasically, I adjusted my \"buged\" script:\nhttp://www.hotdlz.com/apachebug/\n\nagain, that is a script that does a perl \"require\" to another script that \nactually does the sql and html output.  That require'd script is now set to \ngive out 71 rows from the mysql query, and the foreach loop has a 'warn \"foo\"' \ninside each iteration of the loop, and the bugged script has $|=1 at the top \ntoo.  The other script,\n\nhttp://www.hotdlz.com/apachebug1.pl\n\nis identical in that it calls scripts that are identical except the require'd \nperl script has no $|=1 and no warn \"foo\" in the foreach.  Both do return 71 \nrows.\n\nSo the problem script would end up writing \"foo\" to STDERR over 70 times while \nthe non-problem script would write nothing.  I wonder if that has something to \ndo with the problem?\n\nNote that I disabled the output of the SQL queries, so if you go to those URL's \nyou won't see much, but you will see apache hang for 5 minutes on \nwww.hotdlz.com/apachebug/\n\nNow for some comments:\n\n> Can you try lsof to see if another process has a\n> descriptor to that same pipe?\n\nI'm not sure how to do this, but I'll try:\n\nI ran the http://www.hotdlz.com/apachebug/ let it do its pause, then I did this \ncommand as root:\nlsof | grep IPv4 | grep 'my.ip.address'\n\nand I found one line:\nhttpd     19860   nobody   37u  IPv4   59112398                   TCP \nserver.ip.address:http->my.client.ip.address:61975 (ESTABLISHED)\n\nIn fact that lsof line stays there for the entire 5 minutes.  The moment the 5 \nminute timeout occurrs, Apache writes that \nap_content_length_filter: apr_bucket_read() failed\nline to the error log, and the lsof line disappears.\n\n> A commmon problem is a script that writes a bunch\n> to stderr and ends up hanging on the write because\n> Apache hasn't started reading that pipe yet.  \n> (This may be depending on scriptlog setting...\n> can't recall at the moment.)\n\nI have no scriptlog setting in my httpd.conf\n\n> Does the script write a bunch to stderr?\n\nyes, as I mentioned above, the problem script will write a bunch of non-\nbuffered ($|=1) output to STDERR.\n\n> This contradicts your statement that ps doesn't\n> show the script still running\n\nactually I believe I was mistaken.  A ps does indeed show the perl script is \nstill running.\n\nObviously the first question would be, does the script in fact take 5 minutes \nto run, but no, if I run the script on the command line with the same \nenviornment variables as Apache, it runs and terminates normally in about 2 \nseconds.\n\n> If you can figure out a small-ish script to\n> allow us to duplicate the problem, we're in business.\n\nI tried to make a small script that shows this problem, but I had no luck.\n"}, {"count": 5, "tags": [], "creator": "jon5@modem.org", "text": "Yeah, I think the problem has to do with at least 70 or 80 lines of output to \nSTDERR.\n\nI was able to make a small script that shows the problem.\n\nhttp://www.hotdlz.com/bug/\n\nhere is the source code, there are two files index.cgi and bug.pl:\n\n----- index.cgi -----\n#!/usr/bin/perl\n\nprint \"Content-type: text/html\\n\";\nprint \"Expires: Sun, 22 Jun 2003 20:27:21 GMT\\n\";\nprint \"Last-Modified: Sun, 22 Jun 2003 20:27:21 GMT\\n\";\nprint \"Set-Cookie: user=0\\n\";\nprint \"\\n\";\n\nif (1) {\n  require \"/my/www/path/bug/bug.pl\";\n}\n\n----- bug.pl -----\n#!/usr/bin/perl\n\n$| ++;  # non-buffered, it does not matter if you comment this line, bug still \nexists\n\nprint \"<HTML><BODY>\\n\";\n\nfor ($i=1; $i <= 100; $i++) {\n  warn \"foo\";\n  print \"$i<BR>\";\n}\n\n----- END OF SCRIPTS -----\n\nIf you adjust the $i <= 100 to something smaller, like 50, there is no 5 minute \npause.\n\nWhen I run these scripts through the URL, I do see them in ps and lsof for 5 \nminutes until apache times it out with the apr_bucket_read error in its error \nlog.\n\nI hope this helps.", "id": 39254, "time": "2003-06-22T21:32:03Z", "bug_id": 20866, "creation_time": "2003-06-22T21:32:03Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 20866, "attachment_id": null, "text": "More information...  with $i <= 50 i do see exactly 50 \"foo\" messages to my \napache error log.  With $i <= 100, I noticed that there are exactly 200 \"foo\" \nmessages in my apache error log, not the expected 100.  Very weird.  No error \nmessages are written to the log during the 5 minute pause, but after 5 minutes \nis up, there are double the expected messages in my apache error log.\n\nI also noticed that once the 5 minutes are up while running this script, there \nis no \"ap_content_length_filter: apr_bucket_read() failed\" right away, but the \nmessage does appear at odd times... sometimes a minute after I kick off the \nURL, sometimes a minute after the 5 min pause is completed.\n\nWhy perl's output to STDERR is important to me is because sometimes often I \nprogram I like to have debug output available, sometimes a lot of debug output, \nespecially when I am trying to solve a problem with my code.  Having a lot of \nSTDERR messages written to apache's log is very important to me.", "id": 39255, "time": "2003-06-22T21:58:56Z", "creator": "jon5@modem.org", "creation_time": "2003-06-22T21:58:56Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 20866, "attachment_id": null, "id": 39495, "time": "2003-06-26T16:21:11Z", "creator": "rabindra_pandey@hotmail.com", "creation_time": "2003-06-26T16:21:11Z", "is_private": false, "text": "I have developed a web based tool which uses Oracle Database and PERL-DBI. Since\nlast few days, one of the pages, where I query database and print out page,\nhangs. It keeps on saying getting data but it just gets timed out. Same script\nis running fine on development server (even when I point to live Database from\ndevelopment server) Only difference on two servers is that development server is\nrunning Apache 1.2.37 and production server is running Apache 2. In the log file\non development server I am getting apr_bucket_read() failed error \n\nI am using following cgi modules -\n\nuse CGI qw(:standard);\nuse DBI;\nnew CGI;\nmy $in=new CGI;\nprint $in->header();\n\nand then print the html using print qq~ < html stuff > ~;\n\nI have gone through the post here and want to say, if something is working  fine\non lower version as per the normal convention it should work in the latest\nupgrade as well.\n"}, {"count": 8, "tags": [], "bug_id": 20866, "attachment_id": null, "text": "Can the original reporter verify that when omitting the stderr output the script\nworks fine?\n\nRabi, is this the situation with your problem as well?\n\nHangs when the script writes enough data to stderr to fill the kernel pipe\nbuffer is is a known bug that is slowly being addressed.\n", "id": 40439, "time": "2003-07-11T11:19:52Z", "creator": "trawick@apache.org", "creation_time": "2003-07-11T11:19:52Z", "is_private": false}, {"count": 9, "tags": [], "text": "i got this problem when transfer a cgi website from a unix based os(alpha \nproccessor) to a linux based oS(dual xeon proccessors).", "attachment_id": null, "id": 43215, "creation_time": "2003-08-24T17:07:25Z", "time": "2003-08-24T17:07:25Z", "creator": "aznblood@toanpham.com", "bug_id": 20866, "is_private": false}, {"count": 10, "tags": [], "text": "I had same problem going from 1.3.26 to 2.0.47.  I have a perl CGI script that \ntalks to MySQL -- queries that returned a lot of data starting hanging after \nmoving from Apache 1.x to 2.x.  I changed the begining of the script \nfrom \"perl -w\" to \"perl -X\" and all problems ceased...\n", "attachment_id": null, "id": 46483, "creation_time": "2003-10-29T23:10:41Z", "time": "2003-10-29T23:10:41Z", "creator": "epearce@amberpoint.com", "bug_id": 20866, "is_private": false}, {"count": 11, "tags": [], "text": "This bug is probably the same as bug #23528.\n\nI can confirm that the bug happens for CGI programs that do not write\nmuch to stderr and do not fork anything. The bug may be related to\nthe size of the request. The bug is only present in Apache 2.x and\nhas been there for many months.\n\n", "attachment_id": null, "id": 48991, "creation_time": "2003-12-12T17:25:29Z", "time": "2003-12-12T17:25:29Z", "creator": "coad@measurement-factory.com", "bug_id": 20866, "is_private": false}, {"count": 12, "tags": [], "creator": "jorton@redhat.com", "text": "Can those who can reproduce this bug please try 2.0.50? ", "id": 60525, "time": "2004-07-13T09:31:26Z", "bug_id": 20866, "creation_time": "2004-07-13T09:31:26Z", "is_private": false, "attachment_id": null}, {"count": 13, "tags": [], "text": "Works for me with httpd 2.0.50 on FreeBSD 4.7.\nI cannot try on Solaris, but that's big progress already!\nThank you.\n", "is_private": false, "id": 60561, "creator": "coad@measurement-factory.com", "time": "2004-07-13T19:28:12Z", "bug_id": 20866, "creation_time": "2004-07-13T19:28:12Z", "attachment_id": null}, {"count": 14, "tags": [], "bug_id": 20866, "attachment_id": null, "id": 60563, "creation_time": "2004-07-13T19:34:53Z", "time": "2004-07-13T19:34:53Z", "creator": "jorton@redhat.com", "text": "Let's presume that the issues here are all problems related to stderr handling\nin mod_cgi.  Please reopen if anyone can reproduce problems using 2.0.50.\n\n*** This bug has been marked as a duplicate of 22030 ***", "is_private": false}]