[{"count": 0, "tags": [], "creator": "srinidhi_h1@yahoo.com", "attachment_id": null, "text": "If LimitRequestBody directive is set for a apache web server with user defined\nErrorDocument configured (for 413 error) and a client sends request exceeding \nthe value set in LimitRequestBody then apache does not display the user defined \nErrorDocument. It instead displays the standard 413 error document. This \nhappens only for local redirects(/xyz.htm) while external redirects\n(http://hostname/xyz.htm) work fine. \n\nSteps to reproduce the problem,\n\n1. Configure the httpd.conf to use LimitRequestBody directive by adding,\n\nLimitRequestBody 2000\n\n2. Add a customized error response for the error from above directive.\n\nErrorDocument 413 /e413.htm\n\n3. Make a request from the client with content length greater than 2000. \n\nThis should result in a error with the customized error html e413.htm but \ninstead it displays the standard 413 error message.\n\nIt looks like the problem is because apache keeps the content-lenght of the \noriginal request even for the local redirect. So, in the process of displaying \nerror document, it again hits the request body limit and throws the standard \n413 error. I could get it to work by unsetting the \"Content-Length\" but I am \nnot sure if this is the correct fix and if there is any impact of this on any \nother apache functionality.", "id": 39311, "time": "2003-06-24T07:28:15Z", "bug_id": 21035, "creation_time": "2003-06-24T07:28:15Z", "is_private": false}, {"count": 1, "tags": [], "creator": "acapachebugs@ynx.de", "attachment_id": null, "is_private": false, "id": 69930, "time": "2005-01-21T18:58:48Z", "bug_id": 21035, "creation_time": "2005-01-21T18:58:48Z", "text": "This annoying bug is still present as of 1.3.33!  \n   \nI found a mailing on the developer mailing list that provides a    \nsimple solution by setting content length to 0 when an error occurs (dates to  \n23 Jun 2003 so i believe it caused the original reporter to file this bug):  \nhttp://www.mail-archive.com/dev%40httpd.apache.org/msg16835.html    \n  \nI don't know about the quality of the patch, but i'd appreciate if it (or a  \nsimilar fix) makes it's way into the next 1.3 release.  "}]