[{"count": 0, "tags": [], "creator": "keyesdav@yahoo.com", "text": "IN GENERAL:\n\nFor any two domains, A and B, if B is a subdomain of A (e.g., B.A), and if two \ndifferent J2EE app servers are hosting those domains, the following will be \ntrue, assuming that the two appservers create session cookies that are \nidentical except for the domain (note that a cookie consists of: name, domain, \npath, expiration):\n\n* If a user, running Internet Explorer, uses J2EE apps running on both \ndomains, causing a session to be established on both domains simultaneously, \nthe client accessing the application running in domain B will not be able to \naccess a session established in domain B.\n\nThis is due to the fact that IE orders cookies from least-specific to most-\nspecific WITH RESPECT TO DOMAIN in an HTTP request.  ANY app server that looks \nfor the FIRST cookie named JSESSIONID will be susceptible to this problem.\n\nEXAMPLE:\n\nIn our case, tomcat was serving up JSPs on \"x.com\", causing a J2EE servlet \nsession to be created when that page was loaded.  Immediately after hitting \nx.com, \"w.x.com\" was being loaded, which also caused a session to be created.  \nBoth sessions were being identified by cookies set in the client browser.  The \ncookies both had an ID of JSESSIONID, with an identical path.  The only \ndifference between the cookies was the domain (one was \"x.com\", and the other \nwas \"w.x.com\").  When interacting with the app on w.x.com, each request \nincluded an HTTP header specifying client-side cookies.  In that header, the \nJSESSIONID created by x.com was ordered BEFORE the JSESSIONID created by \nw.x.com.  The appserver on domain w.x.com was consequently attempting to find \nthe session that had been created on x.com, and since it could not, was \ncreating a new session with each request.\n\nUnfortunately, IE does NOT disobey the Cookie spec.  The spec is ambiguous \nabout what to do in this scenario, and Microsoft (big surprise) just chose to \ndo things differently than everyone else.  The spec (RFC 2109) says in section \n4.3.4:\n\n\"If multiple cookies satisfy the criteria above, they are ordered in the \nCookie header such that those with more specific Path attributes precede those \nwith less specific.  *** Ordering with respect to other attributes (e.g., \nDomain) is unspecified.*** \"\n\nI added the emphasis.  I don't see a good solution to the problem, other than \nremoving the mandate in the servlet spec that says JSESSIONID must be used to \nidentify the cookie...", "id": 39513, "attachment_id": null, "bug_id": 21124, "creation_time": "2003-06-26T19:07:36Z", "time": "2003-06-26T19:07:36Z", "is_private": false}, {"count": 1, "tags": [], "creator": "funkman@joedog.org", "text": "This has been discussed before on the user/dev lists (and other bug reports) and\nit was decided that this is a WONTFIX.", "id": 53228, "attachment_id": null, "bug_id": 21124, "creation_time": "2004-02-29T21:14:42Z", "time": "2004-02-29T21:14:42Z", "is_private": false}]