[{"count": 0, "tags": [], "bug_id": 21157, "attachment_id": null, "text": "A servlet can not set the headers and cookies after writing data to the \nservlet's output stream. Once the servlet writes data, headers are committed. \nHowever CookieExample writes some data first before doing addCookie on the \nresponse. \n\nThe reason why this code works at all even with the above bug is: The \nCookieExample is only writing a small amount of data before doing \nresponse.addCookie. That data is still held in buffer and not yet sent over \nthe wire. Hence the headers are not yet committed. So it is pure luck that \nthis example works. \n\nYou can easily expose the bug by writing say 20K characters in this example \nbefore response.addCookie is called. You will see that the cookies that are \nadding to response are not actually sent back to client. \n\nFix is simple. Move up the response.addCookie() before response.getWriter()", "id": 39565, "time": "2003-06-27T23:12:00Z", "creator": "vishy@borland.com", "creation_time": "2003-06-27T23:12:00Z", "is_private": false}, {"count": 1, "tags": [], "creator": "remm@apache.org", "text": "Well, I disagree. The buffer default size is specified in the spec (it's 2K I\nthink). Hence, if you write a small amount of data, the response will not be\ncommitted and the cookies can be set reliably. You can also set the buffer size\nmanually, BTW.\nSo this will not be addressed; please do not reopen the report.", "id": 39579, "time": "2003-06-28T17:06:00Z", "bug_id": 21157, "creation_time": "2003-06-28T17:06:00Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 21157, "is_private": false, "id": 39687, "creation_time": "2003-06-30T17:25:01Z", "time": "2003-06-30T17:25:01Z", "creator": "vishy@borland.com", "text": "Here are some facts that may lead you to reconsider.\n\n- The servlet spec itself does not mandate a default size for the buffer. The \nuser can call response.setBufferSize to set the buffer to any size. \n\n- The user can tweak the bufferSize attribute of coyote or the legacy \nconnector in server.xml. There is nothing preventing user to set it to 0 in \nwhich case the cookie example immediately breaks. \n\n- Users tend to use these examples as base for something that they like to \nachieve. So it is a good idea to provide users with an example that is more \nrobust and does not break depending on how much data they write or what \nsettings they have in server.xml. \n", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 21157, "is_private": false, "id": 39710, "creation_time": "2003-07-01T00:06:40Z", "time": "2003-07-01T00:06:40Z", "creator": "sradzom@web.de", "text": "Well, I wasn't too happy with Remy's decision to mark this bug as invalid, \neither. Having thought about this for a while, I ended up with a list of facts \nalmost identical to the one posted by Vichy. For an example refered to as a \nstarting point for servlet developers and used as a source for copy&paste best \neffort should be made to use good coding practises.\n\nTherefore, I decided to reopen this bug. I am currently working on a patch \nwhich I will soon propose for discussion.", "attachment_id": null}, {"count": 4, "attachment_id": 7033, "bug_id": 21157, "is_private": false, "id": 39713, "time": "2003-07-01T00:28:28Z", "creator": "sradzom@web.de", "creation_time": "2003-07-01T00:28:28Z", "tags": [], "text": "Created attachment 7033\nProposed patch moving call to response.addCookie() before response.getWriter()"}, {"count": 5, "attachment_id": null, "bug_id": 21157, "is_private": false, "id": 143205, "time": "2011-01-08T17:27:54Z", "creator": "markt@apache.org", "creation_time": "2011-01-08T17:27:54Z", "tags": [], "text": "Fixed in 7.0.x for 7.0.6 onwards but too trivial to consider back-porting."}]