[{"count": 0, "tags": [], "bug_id": 21228, "attachment_id": null, "is_private": false, "id": 39749, "time": "2003-07-01T14:21:34Z", "creator": "robert.vanderveer@telecom.tno.nl", "creation_time": "2003-07-01T14:21:34Z", "text": "I set my driver name & classpath in a environment variable in a batchfile. Here \nI accidentally typed an extra space after the name of the driver. Therefor the \ndriver could not be found. \n\nfile:C:/cvsLocal/klantbarometer/schema.xml:48: Class Not Found: JDBC driver \ncom.microsoft.jdbc.sqlserver.SQLServerDriver  could not be loaded\n\nIt took me an hour to find this, overlooking the extra space after the \ndrivername.\nMaybe an idea to do a trim() on the parameters of the sql-task (and maybe \nothers)."}, {"count": 1, "tags": [], "bug_id": 21228, "attachment_id": null, "text": "In many cases trimming is not desireable IMHO.  It may seems unlikely, but there\nalways is a chance that people really want/have files with names ending with a\nspace for example.\n\nLess generally speaking.  For attributes that we know will be used as class names,\ntrimming would be fine as spaces are not legal in class names.  I'm just not\nsure whether we really want to go from consistent behavior \"Ant never trims any\nattribute values\" to something far more difficult to describe - and to maintain.", "id": 39973, "time": "2003-07-04T07:11:30Z", "creator": "bodewig@apache.org", "creation_time": "2003-07-04T07:11:30Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 21228, "attachment_id": null, "id": 92952, "time": "2006-09-03T17:17:18Z", "creator": "peterreilly@apache.org", "creation_time": "2006-09-03T17:17:18Z", "is_private": false, "text": "Whitespace in names is always an hard problem to debug, especially trailing\nwhitespace in property files.\nHowever, names do allow trailing whitespace and at the core ant\nlevel it not possible to figure out which is which.\nThinking of marking as WONTFIX as it would be difficult\nto go through each and every use where a classname is used, and inconsistent\nif one did not.\nHowever, the change is not too big, so made the change.\n"}]