[{"count": 0, "tags": [], "bug_id": 21291, "attachment_id": null, "id": 39890, "time": "2003-07-02T21:03:13Z", "creator": "grenoml@yahoo.com", "creation_time": "2003-07-02T21:03:13Z", "is_private": false, "text": "When I restart Tomcat 5.0.3 and then enter a url in the browser address bar\n(e.g. http://localhost:8080) and wait for the page to display, it only displays\na blank page.  I have to hit reload to actually see the page.  I don't need to\ndo that in 4.1.24.\n\nGerry Reno"}, {"count": 1, "tags": [], "creator": "remm@apache.org", "is_private": false, "id": 39891, "creation_time": "2003-07-02T21:07:57Z", "time": "2003-07-02T21:07:57Z", "bug_id": 21291, "text": "This (obviously) works for me. Please do not reopen the report (unless at least\nsomeone else confirms it).", "attachment_id": null}, {"count": 2, "tags": [], "creator": "grenoml@yahoo.com", "is_private": false, "id": 39893, "creation_time": "2003-07-02T21:47:13Z", "time": "2003-07-02T21:47:13Z", "bug_id": 21291, "text": "Remy,\n  Why do you immediately mark this as invalid?  It's certainly valid with my\nsetup/configuration which is:\nJ2SE 1.4.2-beta\nRedHat Linux 8.0\nTomcat 5.0.3\n\n  I agree that it is certainly possible that this behavior is not valid on all\nconfigurations but that does not mean that it is not valid on others.  I think\nknowing about such behaviors on certain configurations is important and should\nnot just be dismissed out-of-hand.  I feel the bug should remain open for a\nreasonable amount of time until we see if there are any other comments or\nobservations submitted.  I'm thinking this behavior might possibly be a small\nclue into the other issue with the Jetspeed JSP Portlets not displaying.\n\nGerry Reno\n", "attachment_id": null}, {"count": 3, "tags": [], "creator": "remm@apache.org", "is_private": false, "id": 39894, "creation_time": "2003-07-02T21:52:23Z", "time": "2003-07-02T21:52:23Z", "bug_id": 21291, "text": "In case you haven't noticed, Tomcat gets tens of reports per day. Either the bug\nis reproduceable and accurate or it is not. If it is not, then it will be closed\nimmediately. Please post on tomcat-user for investigating issues.\nPlease do not reopen the report for now.", "attachment_id": null}]