[{"attachment_id": null, "tags": [], "creator": "karsten.silz@epost.de", "is_private": false, "count": 0, "id": 40569, "time": "2003-07-13T09:03:18Z", "bug_id": 21543, "creation_time": "2003-07-13T09:03:18Z", "text": "I use the <ejbjar> task to JAR EJBs.  It works well.  What I also do is <jar> up\nthe remote and home interfaces and related classes (like exception classes and\ndata transfer classes) in a separate JAR for clients of these EJBs.  They don't\nget the \"full\" EJB JAR because I don't want the clients to get the EJB\nimplementations.\n\nNow since the <ejbjar> already parses the EJBs and finds out through bcel (sp?)\nwhich classes are needed, I suggest that the <ejbjar> could optionally produce\nan EJB client JAR with all the files that are needed just by EJB clients. \nEssentially, this could be the \"full EJB JAR\" minus the bean implementation\nclasses and the classes that are only needed by the bean implementation."}, {"count": 1, "tags": [], "bug_id": 21543, "text": "Hi,  \n  \nI'm currently working on adding support for generating ejb client jars. I'm writing a \"ejbclientjar\" \ntask, which will do just what you describe. \n  \nI will post a comment here too when I submit a patch with the new task! It will be a patch  \nagainst the 1.6alpha!  \n  \nRegards, Per Olesen  \n  ", "id": 44402, "time": "2003-09-21T15:45:59Z", "creator": "polesen@operamail.com", "creation_time": "2003-09-21T15:45:59Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 21543, "attachment_id": null, "text": "As promised in the previous comment, I'm giving a small post here now, to note\nthat I've just submitted a patch which adds a <ejbclientjar> task to ant.\n\nThe patch can be found on bug 23396.\n\nCan you try it out Karsten? I would like any input on how it works for you (or\nanyone else :-)", "id": 44626, "time": "2003-09-24T22:41:43Z", "creator": "polesen@operamail.com", "creation_time": "2003-09-24T22:41:43Z", "is_private": false}, {"count": 3, "tags": [], "creator": "bodewig@apache.org", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of bug 23396 ***", "id": 129310, "time": "2009-07-31T03:39:44Z", "bug_id": 21543, "creation_time": "2009-07-31T03:39:44Z", "attachment_id": null}]