[{"count": 0, "tags": [], "bug_id": 21552, "text": "I created some virtual hosts entries in server.xml which had several context\nelements declared within them such as /admin and /manager and the \"\" context.  I\nstarted Tomcat and logged into one of the vhost admin apps and modified some\nsettings and then did a \"Commit Changes\".  The caused Tomcat to completely\nrewrite server.xml and in the process it wrote out the virtual host entries but\nthere were no contexts within them.  It also deleted every comment that I had\nplaced in the file.  What I would expect to happen is that it would just rewrite\nor add the element that I changed and not affect everything else in the file.\n\nGerry Reno", "id": 40583, "time": "2003-07-13T23:29:27Z", "creator": "grenoml@yahoo.com", "creation_time": "2003-07-13T23:29:27Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 21552, "is_private": false, "text": "Tomcat will now move context declarations from server.xml to separate context\ndeclaration files, similar to those used for the manager and admin context.\nThis bug will not be addressed, please do not reopen it.", "id": 40590, "time": "2003-07-13T23:54:14Z", "creator": "remm@apache.org", "creation_time": "2003-07-13T23:54:14Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "grenoml@yahoo.com", "text": "Remy,\n  Could you elaborate a little on this.  Are you saying that when using the\nadmin tool and changes are committed to server.xml that all contexts will be\nextracted out and placed into separate context files?  This would be ok.  When I\nobserved the current behavior though I did not find any context files produced\nfor the local manager or admin.  Is this behavior you describe in a later\nrelease?  And is there going to be a way to preserve comments?  \n  If there are certain things that cannot be done, not a problem, just would\nlike to know what to expect when using the admin tool.\n\nGerry Reno\n", "count": 2, "id": 40606, "time": "2003-07-14T04:15:16Z", "bug_id": 21552, "creation_time": "2003-07-14T04:15:16Z", "is_private": false}, {"count": 3, "tags": [], "creator": "daniel.santos@pobox.com", "attachment_id": null, "text": "Gerry, look under CATALINA_HOME/conf/{service name}/{server address} or more\ncommonly CATALINA_HOME/conf/Catalina/localhost.  They are there.  And yes, think\nof it this way:  The .xml files are the serilized form of the configuration. \nThe admin app reads them in, you manipulate them and then it spits them back out\noverwriting whatever else is there.  Unfortauntely, it doesn't support all of\nthe options that you can have in the server.xml :(\n\nDaniel", "id": 61075, "time": "2004-07-23T23:22:03Z", "bug_id": 21552, "creation_time": "2004-07-23T23:22:03Z", "is_private": false}]