[{"count": 0, "tags": [], "creator": "kdenehy@att.net", "attachment_id": null, "id": 40756, "time": "2003-07-15T18:12:12Z", "bug_id": 21617, "creation_time": "2003-07-15T18:12:12Z", "is_private": false, "text": "Please close this bug upon review - you can give it an invalid status (I would \nhave myself if it had been an option).  I just wish to document this problem so \nif anyone else runs into it they can find a solution when searching bugzilla.\n\nAfter many hours of investigation, I've finally found the apparent cause of a \nvery mysterious problem.  After installing Tomcat 4.1.24 on a server, and \nconfiguring a webapp to use form-based authentication, I kept getting the \ndreaded \"HTTP Status 400 - Invalid direct reference to form login page\" error, \nbut in this case I wasn't directly referencing the login page at all.  I was \naccessing a protected resource, getting redirected to the login page, \nsubmitting to j_security_check, at which point I got the error.\n\nThis problem only occurred in MSIE (various versions, including v6 SP1) but not \nin Mozilla.  And it only occurred on this particular server (NT 4, SP6a), not \non several other systems which were virtually identical in configuration.\n\nWhat I finally realized is that the hostname contained an underscore, which \ntechnically makes it an invalid hostname (though this is only the 2nd time in \nmy career that I've seen underscores cause problems in a hostname).  When I \nsubstituted the hostname with it's IP address in the original URL, everything \nstarted working fine.  I also tried modifying my local \"hosts\" file, adding the \nhostname (minus the underscore) and verified that it worked fine as well.\n\nHopefully nobody else will run into this issue, and end up banging their head \nagainst a wall the way I did.  Thankfully, I believe the newer Windows server \ninstall programs warn if you attempt to assign an invalid hostname, but \nunfortunately NT 4.0 did not.  Why the problem only manifests itself with IE \nand not Mozilla I don't know - must have something to do with the redirection \nhandling."}, {"count": 1, "tags": [], "creator": "kdenehy@att.net", "attachment_id": null, "id": 40757, "time": "2003-07-15T18:13:31Z", "bug_id": 21617, "creation_time": "2003-07-15T18:13:31Z", "is_private": false, "text": "Found I could change status to invalid after creation (which I wanted to do in \nthe 1st place)."}]