[{"count": 0, "tags": [], "creator": "dyoo@hkn.eecs.berkeley.edu", "attachment_id": null, "id": 41105, "time": "2003-07-21T21:29:38Z", "bug_id": 21782, "creation_time": "2003-07-21T21:29:38Z", "is_private": false, "text": "I'm running into some behavior that appears to be a bug in Tomcat 4.1.\n\n\nI've written a small WAR to demonstrate the problem:\n\n    http://tesuque.stanford.edu/~dyoo/tomcat_wrapper_bug.war\n\nThe source code to this package is:\n\n    http://tesuque.stanford.edu/~dyoo/tomcat_wrapper_bug.tar.gz\n\n\nThe situation is the following:\n\n    Given a regular HttpServletRequest object, I wrap my own\n    HttpServletRequestWrapper around it.  This wrapper includes a\n    setParameter() method that lets me define my own parameters.\n\n    Once I've reassigned a few parameters (like \"name\"), I do an\n    RequestDispatcher.include() to my presentation JSP.\n\n    Within that presentation jsp, I do another include to a small JSP\n    page.  I also do some overriding some parameters using jsp:param.\n\nThe bug is that the jsp:param tags don't appear to be taking any effect in\nmy small jsp page!\n\n\nI've determined that the HttpServletRequest that is being passed to the\nsmall jsp page is my own wrapped request object, so there's no way the\njsp:param-ed variables can be passed on.\n\n\nIn a normal situation, the code that handles jsp:include will construct\nits own wrapped request object to pass off any jsp:param'ed parameters.\nHowever, for some reason, Tomcat appears not to do this wrapping process\non an HttpServletRequest that is already wrapped with\nHttpServletRequestWrapper.  I've looked at the Tomcat source code, and I\ndo see some potential problems in the request wrapping code."}, {"count": 1, "tags": [], "bug_id": 21782, "attachment_id": null, "id": 41111, "time": "2003-07-21T22:35:18Z", "creator": "funkman@joedog.org", "creation_time": "2003-07-21T22:35:18Z", "is_private": false, "text": "Looks to be dup of an invalid bug. Use a filter for the desired behavior.\n\n*** This bug has been marked as a duplicate of 8566 ***"}]