[{"count": 0, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "Any request to j_security_check within a webapp containing a filter activated \nby the mapping /* does not cause the filter to be activated. \n\nAs j_security_check is referenced from a form based authentication login page \nas if it resided within the webapp a filter-mapping of /* should cause the \nfilter to be invoked when it is called, yet it does not.", "id": 41153, "time": "2003-07-22T12:19:55Z", "creator": "apache@alsutton.com", "creation_time": "2003-07-22T12:19:55Z", "is_private": false}, {"count": 1, "tags": [], "creator": "apache@alsutton.com", "attachment_id": null, "text": "After lack of comment and/or action from developers on this issue, and the \ndiscovery of over 680 open bugs in Tomcat 4, confidence in Tomcats stability \nand standards complaince is now very low.\n\nWith this in mind we have made the decision to replace Tomcat with an \nalternative servlet engine.", "id": 41933, "time": "2003-08-01T08:16:58Z", "bug_id": 21795, "creation_time": "2003-08-01T08:16:58Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "j_security_check is handled internaly by tomcat authenticator valves, and so never reachs your filter. ", "id": 41935, "time": "2003-08-01T09:53:58Z", "creator": "tfohrer@t-online.de", "creation_time": "2003-08-01T09:53:58Z", "is_private": false}, {"count": 3, "tags": [], "creator": "apache@alsutton.com", "attachment_id": null, "id": 41938, "time": "2003-08-01T10:43:34Z", "bug_id": 21795, "creation_time": "2003-08-01T10:43:34Z", "is_private": false, "text": "But under the Sun specifications it SHOULD reach the filter because the filter \nis defined as handling all request going to that webapp. Authentication is \nsuppose to be a transparent layer on top of the webapp, not something that \noverrides the behaviour specified in web.xml"}, {"count": 4, "tags": [], "creator": "tfohrer@t-online.de", "attachment_id": null, "id": 41939, "time": "2003-08-01T11:03:38Z", "bug_id": 21795, "creation_time": "2003-08-01T11:03:38Z", "is_private": false, "text": "\ncopied text from servlet-spec-2.4-pfd3 for container managed security with \nforms -> j_security_check\n\nSRV.12.5.3 Form Based Authentication\nThe look and feel of the  login screen  cannot be varied using the web browser \ns\nbuilt-in authentication mechanisms. This specification introduces a required \nform\nbased authentication mechanism which allows a Developer to control the look and\nfeel of the login screens.\nThe web application deployment descriptor contains entries for a login form\nand error page. The login form must contain fields for entering a username and \na\npassword. These fields must be named j_username and j_password , respectively.\nWhen a user attempts to access a protected web resource, the container checks\nthe user s authentication. If the user is authenticated and possesses \nauthority to\naccess the resource, the requested web resource is activated and a reference \nto it is\nreturned. If the user is not authenticated, all of the following steps occur:\n1. The login form associated with the security constraint is sent to the \nclient and\nthe URL path triggering the authentication is stored by the container.\n2. The user is asked to fill out the form, including the username and password\nfields.\n3. The client posts the form back to the server.\n4. The container attempts to authenticate the user using the information from \nthe form.\n5. If authentication fails, the error page is returned using either a forward \nor a re-direct,\nand the status code of the response is set to 401.\n6. If authentication succeeds, the authenticated user s principal is checked \nto see\nif it is in an authorized role for accessing the resource.\n7. If the user is authorized, the client is redirected to the resource using \nthe stored\nURL path.\n\n\n"}, {"count": 5, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "The spec implies that authentication is part of the container, not part of the\nwebapp so the j_security_check occurs outside the role of filters.\n\nSRV.12.2 Declarative Security\nDeclarative security refers to the means of expressing an application’s security\nstructure, including roles, access control, and authentication requirements in a\nform external to the application. The deployment descriptor is the primary\nvehicle for declarative security in web applications.\n \n", "id": 41940, "time": "2003-08-01T11:11:59Z", "creator": "funkman@joedog.org", "creation_time": "2003-08-01T11:11:59Z", "is_private": false}, {"text": "Please see Section SRV6.2.4 in the Sun Servlet spec 2.3, which details the \nprocedure a contain must follow when dealing with requests. \n\nIn short it says that if an incoming URI matches a filter pattern the user \nspecified filter should be invoked. It appears neither section says that the \nuse of j_security_check should stop a filter being triggered, yet the filter \nsection indicates that the filter should be.\n\nOther containers do trigger filters on j_security_check, evidence of this can \nbe found at \nhttp://publib7b.boulder.ibm.com/wasinfo1/en/info/aes/ae/tsec_servlet.html (4th \nparagraph),  http://mainframeforum.com/archive/1047/2003/4/545167 (comment \nfrom Scott Sobotka), and http://www.caucho.com/quercus/faq/question.xtp?\nquestion_id=1239 \n\n\nSnippet:\n\n- Identifies the target web resource according to the rules of SRV.11.2.\n\n- If there are filters matched by servlet name and the web resource has a \nservlet-name, the container builds the chain of filters matching in the order \ndeclared in the deployment descriptor. The last filter in this chain \ncorresponds to the last servlet-name matching filter and is the filter that \ninvokes the target web resource.\n\n- If there are filters using url-pattern matching and the url-pattern matches\nthe request URI according to the rules of SRV.11.2, the container builds the\nchain of url-pattern matched filters in the same order as declared in the \ndeployment\ndescriptor. The last filter in this chain is the last url-pattern matching\nfilter in the deployment descriptor for this request URI. The last filter in\nthis chain is the filter that invokes the first filter in the servlet-name \nmacthing\nchain, or invokes the target web resource if there are none.", "tags": [], "bug_id": 21795, "is_private": false, "count": 6, "id": 41941, "time": "2003-08-01T11:12:19Z", "creator": "apache@alsutton.com", "creation_time": "2003-08-01T11:12:19Z", "attachment_id": null}, {"text": "The bug isn't resolved. There is still a dispute over the spec.\n\nClosing a bug without checking with the bug reporter's agreement maybe a way \nto thin down the bug count, but is NOT a way to professionally handle bug \nreports.", "tags": [], "bug_id": 21795, "is_private": false, "count": 7, "id": 41942, "time": "2003-08-01T11:18:32Z", "creator": "apache@alsutton.com", "creation_time": "2003-08-01T11:18:32Z", "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "Please get a response from the spec team from Sun to confirm tomcat's behavior\nis invalid. \n\nI contend the tomcat's behavior is correct with respect to the spec. If you\nstrongly disagree, please attach a patch that fixes the behavior and if another\ncommitter agrees with your patch, it will be committed.\n\nHere's a note from Craig about filters and j_security_check:\nhttp://marc.theaimsgroup.com/?l=tomcat-user&m=101078110723448&w=2\n\nIf another container allows this behavior, that is ok. But it appears there is\nno requirement that tomcat must do this.\n\n\n\n", "id": 41945, "time": "2003-08-01T12:06:57Z", "creator": "funkman@joedog.org", "creation_time": "2003-08-01T12:06:57Z", "is_private": false}, {"id": 41950, "tags": [], "bug_id": 21795, "is_private": false, "count": 9, "text": "Thankyou for youe comments. Tomcat will now be removed from our list of \napproved software.\n", "time": "2003-08-01T13:07:38Z", "creator": "apache@alsutton.com", "creation_time": "2003-08-01T13:07:38Z", "attachment_id": null}, {"count": 10, "tags": [], "creator": "funkman@joedog.org", "attachment_id": null, "text": "You may wish to remove weblogic too:\n\nhttp://groups.google.com/groups?hl=en&lr=&ie=UTF-8&oe=UTF-8&selm=3e9b0241%40newsgroups.bea.com\n", "id": 41951, "time": "2003-08-01T13:38:42Z", "bug_id": 21795, "creation_time": "2003-08-01T13:38:42Z", "is_private": false}, {"count": 11, "tags": [], "creator": "apache@alsutton.com", "attachment_id": null, "id": 41956, "time": "2003-08-01T13:57:32Z", "bug_id": 21795, "creation_time": "2003-08-01T13:57:32Z", "is_private": false, "text": "The removal of Tomcat is as much about how this bug has been handled as it is \nabout this specific issue.\n\nThe overall problems are;\n\n1) There are a HUGE number of bugs with Tomcat 4 that either haven't been \nlooked at or been fixed after 25 minor revisions.\n\n2) The bugs that are closed may be closed because the reporter has been \nreferred to another group rather than being closed because the issue was \nresolved in a manner that satisfies both parties.\n\n3) To get any movement on the bug I had to indicate an intention to move to \nanother servlet engine.\n\nIn short, if we recommend Tomcat and someone comes accross one of the 680+ \noutstanding issues, we're pretty much on our own. As we do not claim to be \nexperts in Tomcat or it's underlying code, this isn't a responsibility we can \nafford to take on.\n\n"}, {"count": 12, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "Al, your interpretation that the Servlet Specification requires j_security_check\nto be handled through filters does *not* conform to my understanding of the\nServlet Specification, and AFAIK it does not conform to the understanding of any\nother member of the JSR-154 expert group (responsible for creating the Servlet\n2.4 specification) either.  The best way to get the issue cleared up, however,\nwould be to submit feedback to the expert group (send mail to\nservletapi-feedback@eng.sun.com) and ask for it to be clarified.\n\nComplaining about Tomcat isn't going to have any influence on what the spec\nactually says or means.  Encouraging the expert group to clarify things is the\nonly way to accomplish that.\n\nCraig McClanahan\nMember, JSR-154 Expert Group\nJ2EE Web Tier Architect\n", "id": 41966, "time": "2003-08-01T16:26:24Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2003-08-01T16:26:24Z", "is_private": false}, {"count": 13, "tags": [], "creator": "j_t_bell@yahoo.com", "attachment_id": null, "id": 42036, "time": "2003-08-04T05:33:58Z", "bug_id": 21795, "creation_time": "2003-08-04T05:33:58Z", "is_private": false, "text": "I have made the request for clarification. It seems to me that this is a \ncritical matter and is one of the remaining areas of incompatability between \ncontainers created by different vendors.  The current means of using FORM based \nsecurity is too limiting to be useful to many applications that desire to use \ncontainer managed security.  Filters offer a potiential means of removing some \nof the limitations.  Examples some of the limitations that I am refering to \ninclude:\n\n- Logins that require more than just userid and password.\n- Support for optional login or login directly from a home page form.\n- Logins supporting a \"remember me\" feature.\n- Situations that require logging and retrieval or recording of information \nupon each login.\n\nThese situations occur too frequently in the real world to be ignored. If \ncontainer managed security is to have any value it must be able to support \nthese types of situations.\n\nJohn T. Bell"}, {"count": 14, "tags": [], "bug_id": 21795, "attachment_id": null, "is_private": false, "id": 42162, "time": "2003-08-05T14:30:48Z", "creator": "remm@apache.org", "creation_time": "2003-08-05T14:30:48Z", "text": "Authentication (BASIC, DIGEST, FORM) is an internal feature of the servlet\ncontainer. As such, a request to a specific URL will not be passed through the\nfilters or any servlet, as it simply doesn't reach the application layer.\n\nPlease DO NOT reopen this bug, which will not be addressed."}, {"count": 15, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "FWIW - I also have a request to servletapi-feedback@eng.sun.com for feedback on\nthis. I also prefer to keep this bug as RESOLVED-INVALID unless the spec team\ndecides that tomcat is behaving incorrectly in which case - we'll reopen the bug.", "id": 42164, "time": "2003-08-05T14:38:23Z", "creator": "funkman@joedog.org", "creation_time": "2003-08-05T14:38:23Z", "is_private": false}, {"id": 42166, "tags": [], "bug_id": 21795, "is_private": false, "count": 16, "text": "And in which case I have no idea how to implement it, as the filter pipeline\nends with a servlet, and there's no servlet matching that URL. Besides, it would\nmake FORM behave differently than the other auth methods, which contradicts its\ndesign principles.\n\nFor extending the machanism, a container extension feature should be used, such\nas: a custom realm, a custom authenticator, a custom valve inserted in the\npipeline. Filters are located at the application level, and as such are not a\nmagic bullet for everything (although they can meet maybe 90% of the needs).", "time": "2003-08-05T14:50:06Z", "creator": "remm@apache.org", "creation_time": "2003-08-05T14:50:06Z", "attachment_id": null}, {"count": 17, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "It also opens a nasty can of worms with respect to BASIC authentication. Since\nthe container issues the 401 challenge and not the webapp.", "id": 42168, "time": "2003-08-05T14:56:55Z", "creator": "funkman@joedog.org", "creation_time": "2003-08-05T14:56:55Z", "is_private": false}, {"count": 18, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "I am willing to leave this as resolved invalid until we have a clarification \nand rationale from the servlet standards team. ", "id": 42200, "time": "2003-08-05T21:00:32Z", "creator": "j_t_bell@yahoo.com", "creation_time": "2003-08-05T21:00:32Z", "is_private": false}, {"count": 19, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "Container extension methods are not a valid way of extending the model because \nthey are not standardardized but are container specific.  What is needed is a \nmeans of extending security behaviour without being container specific. Filters \ncould provide one means to do this.  \n\nThe standard itself is not clear on the point of whether filters should work \nwith j_security_check.  In the long run the real problem is with the standard.  \nThe j_security_check mechanism is awkward and does not adequately address a \nnumber of needs.  Hopefully, someone will come up with something better soon.\n\nIn the meantime I am hoping that the servlet committee decides that filters \nshould work with j_security_check so that I can write code that will be \nportable across containers.\n\n\n", "id": 42210, "time": "2003-08-05T21:13:29Z", "creator": "j_t_bell@yahoo.com", "creation_time": "2003-08-05T21:13:29Z", "is_private": false}, {"count": 20, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "I received a clarification from Yutaka Yoshida (lead for the 2.4 spec) with this\nclarification: \n\n\"In regards to this issue, servlet EG had a consensus that Filter must not be\napplied for j_security_check. We believe the application component should not be\ninvolved in the container-managed security. Although we understand why people\nare using filter to manipulate the authentication mechanism, it doesn't solve\nall issues related to the security and must be addressed in a larger scope of\nthe portable authentication mechanism, which I expect to have in the next\nversion of the specification. \"", "id": 43349, "time": "2003-08-27T00:52:27Z", "creator": "funkman@joedog.org", "creation_time": "2003-08-27T00:52:27Z", "is_private": false}, {"count": 21, "tags": [], "creator": "funkman@joedog.org", "attachment_id": null, "id": 48478, "time": "2003-12-04T12:21:42Z", "bug_id": 21795, "creation_time": "2003-12-04T12:21:42Z", "is_private": false, "text": "*** Bug 25194 has been marked as a duplicate of this bug. ***"}, {"count": 22, "tags": [], "creator": "thomas2.maesing@bgs-ag.de", "attachment_id": null, "id": 48493, "time": "2003-12-04T14:54:11Z", "bug_id": 21795, "creation_time": "2003-12-04T14:54:11Z", "is_private": false, "text": "I have just sent the following to servletapi-feedback@eng.sun.com:\n\nNow I know the meaning of the JSR-154 Expert Group but I have still some open\nquestions:\n\n- Why is the clarification missing in the spec 2.4?\n- What does this citation mean:\n\nSRV.6.1.1 Examples of Filtering Components\n• Authentication filters\n\nShould such a Authentication filter completely reimplement the Authentication?\n\nAnother citation:\n\nStep 7: When the last filter in the chain has been invoked, the next entity\naccessed is the target servlet or resource at the end of the chain.\n\n- Is j_security_check not a resource? If not why can the browser send a post to \nit?\n\n- How should applications deal with such issues to allow a smart migration to \nthe features of Spec 2.5\n  which should address these issues? \n"}, {"count": 23, "tags": [], "bug_id": 21795, "attachment_id": null, "text": "*** Bug 11271 has been marked as a duplicate of this bug. ***", "id": 50339, "time": "2004-01-09T22:56:20Z", "creator": "medthomas@ntlworld.com", "creation_time": "2004-01-09T22:56:20Z", "is_private": false}]