[{"count": 0, "tags": [], "text": "When redirected, multiple response data's are gathered, and assertions and\npost-processors just work on the top-level response data, which may not be the\ndata they need to evaluate.", "attachment_id": null, "id": 41271, "creator": "mstover1@apache.org", "time": "2003-07-24T02:18:29Z", "bug_id": 21840, "creation_time": "2003-07-24T02:18:29Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 21840, "attachment_id": null, "text": "This is because the result contains the response from the first request (the\nredirect response), not the final resulting page.\n\nI will fix it getting each of the requests be stored as a sub-result of a \"main\"\nresult that will totalize -- containing the request from the first sub-result,\nthe response from the last, and the sum of all the sub-result time's.", "id": 48213, "time": "2003-11-26T22:52:59Z", "creator": "jsalvata@atg.com", "creation_time": "2003-11-26T22:52:59Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 21840, "attachment_id": null, "id": 48215, "time": "2003-11-26T23:07:15Z", "creator": "sonam.chauhan@ce.com.au", "creation_time": "2003-11-26T23:07:15Z", "is_private": false, "text": "> I will fix it getting each of the requests be stored as a \n> sub-result of a \"main\" result that will totalize -- containing \n> the request from the first sub-result, the response from the last, \n> and the sum of all the sub-result time's.\n\nHi Jordi - Will your planned \"totalize\" functionality allow text-match \nassertions to be made against individual sub-results? You mentioned something \nabout time, so I wasn't clear if the text output of each redirect would be made \navailable. \n\nJust FYI, I needed to assert against the last redirect. I used a brutal hack \nin .../sampler/HTTPSampler.java - I just uncommented this line:\n  res.setResponseData(redirectResult.getResponseData());\n\nI was thinking that maybe a \"proper\" solution would be to let assertions \naddress individual redirect sub-results (maybe using a drop-down list \ncontaining sub-result numbers from 1 to MAX_REDIRECTS)\n\nSonam"}, {"count": 3, "tags": [], "creator": "jsalvata@atg.com", "text": "The thing is everybody (including me) seems to have the exact need you have: to\nassert against the last redirect result. And that's exactly what my fix will\nallow for.\n\nIf anyone ever comes with the actual need to test against the intermediate\nresults and it can't be easily solved by explicitly creating samplers for each\nof the steps of the redirect, we'll analyse the need and find a solution for it.", "id": 48225, "time": "2003-11-27T00:41:28Z", "bug_id": 21840, "creation_time": "2003-11-27T00:41:28Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "jsalvata@atg.com", "text": "Fixed. Finally had the LAST result serve as the acumulator, all redirect results\nbeing sub-results of this one. (Instead of all results being sub-results of the\nFIRST one as it was before). This is consistent with browser behaviour, which\nafter a chain of redirects will show the last Location value in the address field.", "id": 48226, "time": "2003-11-27T01:09:25Z", "bug_id": 21840, "creation_time": "2003-11-27T01:09:25Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 21840, "attachment_id": null, "text": "Excellent - Thanks Jordi. \nI look forward to this replacing my nasty hack. :) \n\n", "id": 48227, "time": "2003-11-27T01:48:42Z", "creator": "sonam.chauhan@ce.com.au", "creation_time": "2003-11-27T01:48:42Z", "is_private": false}]