[{"attachment_id": null, "tags": [], "bug_id": 21943, "text": "'ant -verbose -debug' is fine when calling ant directly, but when another \nprogram (take for example maven) is executing ant tasks, the opportunity to \nactivate verbose or debug output in ant is not available. This could be \nrectified if ant would recognize system properties like so:\n\nAnt:\nant -Dant.verbose=true -Dant.debug=true blip\n\nMaven:\nmaven -Dant.verbose -Dant.debug=true blop", "count": 0, "id": 41678, "time": "2003-07-28T19:00:30Z", "creator": "analogue@yahoo.com", "creation_time": "2003-07-28T19:00:30Z", "is_private": false}, {"count": 1, "tags": [], "creator": "antoine@apache.org", "text": "1) you can use the <record/> task in ant to record logging output at a level \ndifferent from the one you started ant with.\nThis is probably your short term fix, go to the appropriate manual page\n\n2) reassign the bug report to maven, asking them to offer such a possibility.\nwhen ant is started programmatically, the calling application creates one or \nseveral loggers/listeners whose level of logging is set by the calling \napplication.", "id": 41681, "time": "2003-07-28T19:08:39Z", "bug_id": 21943, "creation_time": "2003-07-28T19:08:39Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "conor@apache.org", "text": "These properties will have no effect. Currently in Ant, the -debug and -verbose\nflags do not affect the internal operation of Ant at all. All Ant tasks generate\nthe full spectrum of log messages. These flags affect the operation of the Ant's\ndefault logger, which is part of the Ant command line setup. \n\nI don't know how Maven achieves its Ant integration but I presume there is a\nbuild listener somewhere. It is this listener you need to control. I couldn't\nfind a Maven source distribution to take a look - sorry. You should ask the\nMaven team.", "id": 41693, "time": "2003-07-29T00:03:27Z", "bug_id": 21943, "creation_time": "2003-07-29T00:03:27Z", "tags": [], "is_private": false}]