[{"count": 0, "tags": [], "creator": "klyubin@xpdevelopment.ee", "text": "Servlet instance lifecycle not implemented according to Servlet API 2.2 spec.\nThe problems I encountered are:\n* destroy method never called -- neither on shutdown of the container, nor when \npermanent UnavailableException thrown from service method.\n* Servlet instance not discarded after permanent UnavailableException is thrown \nfrom service method.\n* Incorrect usage of servlet instance pool. In case two instances of servlet \nare initialized only one of them (the one that executes service method first) \nis used to process all other requests (even those, which were waiting for \ninitialization of the other instances).\n\nA simple example: Two requests are sent to a newly started Tomcat. Init method \nsleeps for 20 for the first instance and 10 seconds for the second. When first \nrequest arrives first instance is intantiated. When the second request arrives, \nthe second one is instantiated. When the second instance completes its init \nmethod (waits only 10 seconds compared to 20 of the first), its service method \nis invoked. Everything OK so far. But when the first instance's init method \ncompletes, service method is called on the SECOND instance, not on the FIRST \none. That isn't forbidden by the spec, but why is it done this way?\n\nA more advanced example of a bug: Same example as before, but service method \nthrows permanent UnavailableException. According to the spec, the second \ninstance should be discarded. But no, it is not. The first request is \nredirected to service method of the second instance anyway. Destroy is not \ncalled either anyway.", "id": 3036, "time": "2001-06-18T06:45:44Z", "bug_id": 2212, "creation_time": "2001-06-18T06:45:44Z", "is_private": false, "attachment_id": null}, {"text": "Please atach sample code. Many lifecycle bugs have been fixed in 3.3, please \ntest with it and send the exact log, so we can reproduce it and fix it.", "tags": [], "bug_id": 2212, "attachment_id": null, "count": 1, "id": 4980, "time": "2001-08-28T22:36:58Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-08-28T22:36:58Z", "is_private": false}, {"count": 2, "tags": [], "creator": "Larry.Isaacs@sas.com", "attachment_id": null, "id": 6957, "time": "2001-10-21T18:37:14Z", "bug_id": 2212, "creation_time": "2001-10-21T18:37:14Z", "is_private": false, "text": "Reopen to change resolution"}, {"count": 3, "tags": [], "creator": "Larry.Isaacs@sas.com", "text": "Since there isn't enough specific information to try to duplicate a specific\nproblem, I'm resolving this bug as \"INVALID\".  The problem of a permanent\nUnavailableException not destroying the servlet is a known issue in Tomcat 3.2.x\nwhich is still present in Tomcat 3.3.  It will be addressed in a later release.\n\nIf you have other lifecycle bugs, please try Tomcat 3.3 and open new bugs if\nyou encounter problems.  Please include a simple web application if possible\nto assist with diagnosing the bug.", "id": 6958, "time": "2001-10-21T18:41:10Z", "bug_id": 2212, "creation_time": "2001-10-21T18:41:10Z", "is_private": false, "attachment_id": null}]