[{"attachment_id": null, "tags": [], "creator": "demeester_roel@yahoo.com", "text": "We are in a complex situation @ our company.\n\nWe have our own VM based on 1.1.8 running on a embedded device.\nA lot of classes contain a <default> class import statement eg. \nimport X;\nimport ReadOnly; \n\nWe have written a doclet that creates a proxy representation sourcefile \n(SomeClassProxy.java) from an input sourcefile (SomeClass.java).\n\nThis al works nicely when using javadoc <= 1.3\nBut as of 1.4 you can not import a class from the default package.\n\nSo performing a javadoc with our doclet will fail.\nSo what .. you think, switch to 1.3 and problems will dissapear. That's true, \nbut the problem is that we have set 1.4.2 as our VM so that we can use HotCode \nreplace in our favorite IDE (eclipse). And we call the <javadoc> task from \nwithin an ant build.script, from within this IDE, running on 1.4.2, so we are \nforced to always run this task from the commandline.\n\nSo far, the problem.. Now the question..\nIs there a way to use javadoc 1.3 command iso of the javadoc command from the \ncurrently running VM.? \nOr, since javadoc task is forked. Can I tell ANT to use an older VM?", "count": 0, "id": 42388, "time": "2003-08-08T10:25:10Z", "bug_id": 22244, "creation_time": "2003-08-08T10:25:10Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "bodewig@apache.org", "text": "Currently it is hardcoded to use the javadoc executable of the VM Ant is\nrunning in.\n\nThe easy fix would be to simply add an executable attribute to the task and\nyou'd supply the full path of the executable you want to run.\n\nUnfortunately things are not that easy as this tasks has tons of conditional\ncode that adds or not adds attributes based on the javadoc version it is going\nto run - and all these conditionals use the current VM to determine which\narguments to support.\n\nIn your case, you wouldn't be able to use -1.1 for example as Ant would say\n\"Javadoc 1.4 doesn't support the -1.1 switch anymore\" - even though you\nintend to use a 1.3 version of javadoc.\n\nI don't say it's not doable, but a bit more tricky than it seems.\n", "count": 1, "id": 42749, "time": "2003-08-14T15:39:55Z", "bug_id": 22244, "creation_time": "2003-08-14T15:39:55Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "bodewig@apache.org", "text": "*** Bug 23927 has been marked as a duplicate of this bug. ***", "count": 2, "id": 46057, "time": "2003-10-22T13:55:06Z", "bug_id": 22244, "creation_time": "2003-10-22T13:55:06Z", "is_private": false}, {"count": 3, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 72503, "time": "2005-03-16T16:55:41Z", "bug_id": 22244, "creation_time": "2005-03-16T16:55:41Z", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of 30606 ***"}, {"count": 4, "text": "Please see comments in bug #30606.", "bug_id": 22244, "is_private": false, "id": 72991, "time": "2005-03-29T16:58:23Z", "creator": "jglick@apache.org", "creation_time": "2005-03-29T16:58:23Z", "tags": [], "attachment_id": null}]