[{"count": 0, "tags": [], "bug_id": 22390, "text": "A servlet's init() (without ServletConfig as argument) method is called twice if\nit is loaded on startup. It seemed the servlet class is loaded twice. I have a\nstatic variable which is instantiated in the init(). The second time init() is\ncalled, it is still null.", "id": 42693, "time": "2003-08-13T18:03:18Z", "creator": "zmeng@icpcorp.com", "creation_time": "2003-08-13T18:03:18Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "techd2001@attbi.com", "is_private": false, "id": 44974, "time": "2003-10-02T02:58:42Z", "bug_id": 22390, "creation_time": "2003-10-02T02:58:42Z", "tags": [], "text": "I have had a similar problem which turned out to be a configuration issue.  Like\nyou, my init() method was called twice - and similar to your static variable, I\nhad static code being executed in a synchronized block that seemed to be\nallowing multiple threads in.  \n\nOn investigation, it turns out the issue was the WARP connector from Apache to\nTomcat... Apache used one alias for the server, tomcat used another which caused\nthe same code to be loaded as if from two different HOSTs... each one starting\nan instance of the servlet, and each one using a different class loader and\ninitializing the servlet code and static variables (check to see that there is\nonly one directory created under <catalina_home>/work/ ).  \n\nI'm guessing that rather than starting the same servlet twice, the symptom you\nare observing is from two completely different instances of your servlet each\nbeing started once.  There might be different ways to recreate this, but make\nsure your server names in your apache config match the <HOST> name in your\nTomcat server.xml if you are using a WARP connector.\n"}, {"count": 2, "tags": [], "bug_id": 22390, "attachment_id": null, "id": 45019, "time": "2003-10-02T15:16:07Z", "creator": "zmeng@icpcorp.com", "creation_time": "2003-10-02T15:16:07Z", "is_private": false, "text": "Dan is right. Actually I forgot there are 2 vitual hosts configured on the same\nTomcat. In my case I don't have Apache connector."}, {"count": 3, "tags": [], "creator": "al@starfishzone.com", "text": "I encountered the same issue in Tomcat 5.\n\nI was manually defining a single root Context (that I chose not to call \"ROOT\"),\nbut this Context was also being auto-loaded a second time giving me the init()\nis called twice issue.\n\nAdding autoDeploy=\"false\" to the <host> element fixed this issue.", "id": 90949, "time": "2006-07-06T15:02:49Z", "bug_id": 22390, "creation_time": "2006-07-06T15:02:49Z", "is_private": false, "attachment_id": null}]