[{"count": 0, "attachment_id": null, "bug_id": 22396, "is_private": false, "id": 42706, "time": "2003-08-13T21:19:46Z", "creator": "eseidel@apple.com", "creation_time": "2003-08-13T21:19:46Z", "tags": [], "text": "The charset \n<meta http-equiv=\"content-type\" content=\"text/html;charset=big5\">\nis missing from index.html.zh-tw.big5\n\nwithout it, the content does not display correctly in some (maybe all) browsers.\n\nThis is the default page installed by Apache.\n\nA simple one line change is to add this tag."}, {"count": 1, "tags": [], "bug_id": 22396, "attachment_id": null, "is_private": false, "id": 43245, "time": "2003-08-25T16:38:04Z", "creator": "slive@apache.org", "creation_time": "2003-08-25T16:38:04Z", "text": "This tag should not be necessary, and should in fact be ignored by browsers\nwho access the file through the server.  The content-type should come\nfrom the HTTP headers, not the HTML.\n\nIs there a specific problem you are seeing?"}, {"count": 2, "tags": [], "text": "For one, not all requests for that page go through the server... some of our users like to view the \ndocumentation offline, so that tag makes sense in that case.  (Yes, I know the links break in that \nsituation and all kinds of other nastyness... I have a bug in my queue to deal with that.)\n\nSecond, and more importantly, I'm not certain that it works even through the server... at least not \nthrough Safari.  That may be a bug in Safari...   I don't speak chinese, but I had this bug reported to \nme, and then walked down the hall to someone who does speak chineese and was able to \nreproduce it.   I'm not sure if we connected through the server or if we dropped the page into a \nbrowser directly.  The simple one line change fixed our problem... It seems to me to be \"good \nform\" for a website to carry a content meta tag even if the server also uses content type.\n\nThird, all the other index.* pages have a meta tag, why not this one?\n\nFurther thoughts?  ", "is_private": false, "bug_id": 22396, "id": 43247, "time": "2003-08-25T17:00:44Z", "creator": "eseidel@apple.com", "creation_time": "2003-08-25T17:00:44Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 22396, "is_private": false, "text": "1. I can't really see any reason at all to view this page directly\nthrough the filesystem.  It is a test page to tell if the server worked.\nViewing it few the file system tells you nothing.  In fact, things are clearer\nif it doesn't work.\n\n2. Adding that tag may simply hide some other problem.  If you can't see the\npage properly through the server, then the problem causing that should be\naddressed, not worked-around.  For example, it may be that Safari is being\ncase-sensitive, since the type-map file designates this file as\nContent-type: text/html;charset=Big5\nI'm not sure what is proper, but if there is a problem, it should be fixed.\nIt could also be that your apache install has an out-of-date or incorrect\ntype-map or config-file setting.\n\n3. These test pages are just an irrelevant annoyance anyway.  They should\nprobably all be removed, since they cause much more trouble than they\nare worth.", "id": 43264, "time": "2003-08-25T19:04:50Z", "creator": "slive@apache.org", "creation_time": "2003-08-25T19:04:50Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 22396, "attachment_id": null, "is_private": false, "id": 54445, "time": "2004-03-23T01:10:55Z", "creator": "slive@apache.org", "creation_time": "2004-03-23T01:10:55Z", "text": "I think I'll officially pass on this.  But thanks for the suggestion."}]