[{"count": 0, "tags": [], "bug_id": 22412, "text": "I'm trying to set up a server to check accounts against an LDAP server and, if \nthe authentication fails, to check the local user and group files. It appears \nthat Apache 2 uses mod_auth before mod_auth_ldap when checking the user, but \nthe other way round when checking the group.\n\nIn the following, Alice's account is set up in the user and group files, while \nBob's is held on a directory server. Both can access the server normally if \nonly one module is doing the checking.\n\nWith AuthAuthoritative on, AuthLDAPAuthoritative on: Alice can't get access \n(mod_auth_ldap complains 'User not found'), Bob can't get access (mod_auth \ncomplains 'user Bob not allowed access'). Hence, Apache used mod_auth_ldap \nfirst to check the user's password (so it found Bob but not Alice), but \nmod_auth first to check the user's group membership (so it tried to find Bob in \nthe local file rather than on the LDAP server, and failed).\n\nSimilarly...\n\nWith AuthAuthoritative on, AuthLDAPAuthoritative off: Alice can get access, Bob \ncan't get access (mod_auth complains 'user Bob not allowed access'). This is \nconsistent with mod_auth_ldap being checked first for the password, declining, \nand falling through to mod_auth; then mod_auth being checked first for the \ngroup.\n\nWith AuthAuthoritative off, AuthLDAPAuthoritative on: Alice can't get access \n(mod_auth_ldap complains 'User not found'), Bob can get access. This is \nconsistent with mod_auth_ldap being checked first for the password, then \nmod_auth being checked first for the group, declining, and falling through to \nmod_auth_ldap.\n\nWith AuthAuthoritative off, AuthLDAPAuthoritative off: Alice can get access, \nBob can get access, but a user in neither database (eg. Alice accidentally \ntypes Aalice) triggers a 'Server Error' (with no explanation in error_log).", "id": 42726, "time": "2003-08-14T09:49:55Z", "creator": "softspt@gchq.gsi.gov.uk", "creation_time": "2003-08-14T09:49:55Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "nd@perlig.de", "attachment_id": null, "text": "Yeah, that's a known problem of the 2.0 branch. It is basically solved in\n2.1-dev with a conceptual change.\n\nThe point is, the hook order is undefined (since they both hook at the same\nposition). You can change the hook order by patching the code (hooking\nmod_auth_ldap explicitly before mod_auth) and it's fine.\n\nIf you need help to do this, don't hesitate to ask.\n\nThanks for using Apache.", "id": 42868, "time": "2003-08-17T03:39:13Z", "bug_id": 22412, "creation_time": "2003-08-17T03:39:13Z", "is_private": false}]