[{"attachment_id": null, "tags": [], "bug_id": 22483, "text": "I have upgraded one site to Apache 2.0.47 a week ago. Since then, the cgi script\nexecution stopped for some reason a couple of times and the users were greeted\nwith a 503 error. Restarting httpd fixed this problem. The error log contained\nentries like this:\n\n(3)No such process: cgid daemon is gone; is Apache terminating?:\n/services/http/cgi-bin/user-errors.cgi, referer: \nfollowed by some URL.\n\nThis is a busy multi-user site with lots of cgi scripts often executing\nsimultaneously, so coming up with a way to reproduce this problem would be hard\nif not impossible. We're using Apache 2.0.47 on Solaris 8 with cgiwrap.\n\n\n-akop", "count": 0, "id": 42848, "time": "2003-08-16T12:40:39Z", "creator": "akopps@ocf.berkeley.edu", "creation_time": "2003-08-16T12:40:39Z", "is_private": false}, {"count": 1, "tags": [], "creator": "trawick@apache.org", "text": "Grab revision 1.152 of mod_cgid from \nhttp://cvs.apache.org/viewcvs.cgi/httpd-2.0/modules/generators/mod_cgid.c\n\n(go down to where it says \"Revision 1.152\", right-click on the 1.152 link, and\ndownload it.)\n\nThis will restart mod_cgid if it crashes, so it will be much more resiliant for\nyou and there shouldn't be any long-term failure such as you are encountering\nnow.  Unfortunately, we won't be able to do anything about an individual cgid\ndaemon crash without knowing what causes it, and from your report it seems that\ngetting doc (e.g., backtrace for any coredumps in case it is segfaulting, or\ntruss otherwise) will be difficult for you.\n\nFor now I'll close this as a dup of 19849, which reported (and fixed) the issue\nof mod_cgid not restarting the daemon after a crash, and if you can get doc on\nan individual crash then re-open the PR and post the doc.\n\n\n\n\n*** This bug has been marked as a duplicate of 19849 ***", "id": 43156, "time": "2003-08-22T11:47:25Z", "bug_id": 22483, "creation_time": "2003-08-22T11:47:25Z", "is_private": false, "attachment_id": null}]