[{"attachment_id": null, "tags": [], "bug_id": 22501, "is_private": false, "count": 0, "id": 42888, "time": "2003-08-18T09:08:58Z", "creator": "ozziepeeps@yahoo.co.uk", "creation_time": "2003-08-18T09:08:58Z", "text": "I'm working on a medium-scale enterprise app in BES 5.2.1. My\npresentation tier consists of JSP pages served by Tomcat, and I am\nusing the JSTL fmt tags to provide i18n support for my application.\n\nI wish to pass a parameter into the fmt tag as the key, the parameter\ncoming from posted form data. e.g.\n\n<fmt:message key=\"<%= request.getParameter(\"action\") %>\" />\n\nI experienced problems using this method however. It seems that the\nrequest.getParameter part wasn't evaluated inside the tag for some\nreason, resulting in \"???title???\" as the output on the page if the\naction parameter had the value of \"title\".\n\nI did some research on the newsgroups and discoverd that the body of\nthe format tag can also be used as the key. e.g.\n\n<fmt:message><%= request.getParamger(\"action\") %></fmt:message>\n\nHowever this still didn't work, and produced the same output as above.\n\nJust as a shot in the dark, I tried running both examples on\nstandalone Tomcat (i.e. not inside BES) which ships with JBuilder 9\n(version 4.0.x). Everything worked fine!! However, the example fails again \nunder standalone 4.1.24 which ships with JBuilder."}, {"count": 1, "tags": [], "text": "Bugzilla is not a support forum. Please ask questions like this on the tomcat-\nuser mailing list.\n\nThe behaviour you are seeing is as a result of not configuring JSTL correctly. \nTo quote from the JSTL javadocs:\n<quote>\nIf the configuration setting is empty, or the default I18N localization \ncontext does not contain any resource bundle, or the given key is undefined in \nits resource bundle, the string \"???<key>???\" is returned, where \"<key>\" is \nreplaced with the given key. \n</quote>", "attachment_id": null, "id": 57520, "creator": "markt@apache.org", "time": "2004-05-16T17:03:53Z", "bug_id": 22501, "creation_time": "2004-05-16T17:03:53Z", "is_private": false}]