[{"count": 0, "tags": [], "bug_id": 22622, "is_private": false, "text": "I wanted to create a CGI script that allowed me to do a custom directory\nlisting, but I don't have enough information to do this if I set, for example:\n\nDirectoryIndex /cgi-bin/dirlist.cgi\n\nThere is just no way to get all the information needed to accurately and\nsecurely list the directory. This is especially a problem if you use the Alias\ndirective.\n\nmod_autoindex should have a directive that it can create a template of some sort\nthat you can pass to a CGI script. The template would contain the names of all\nthe files, and their information, along with the name of the current directory,\nand anything else need to create your own custom directory listings. Example:\n\nCustomListingScript /cgi-bin/dirlist.cgi", "id": 43085, "time": "2003-08-21T09:52:53Z", "creator": "netdemonz@yahoo.com", "creation_time": "2003-08-21T09:52:53Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "thom@planetarytramp.net", "is_private": false, "id": 43090, "time": "2003-08-21T11:49:46Z", "bug_id": 22622, "creation_time": "2003-08-21T11:49:46Z", "tags": [], "text": "This is already possible via both mod_perl and mod_python. Setting as enhancement; I'd tend to \nsuggest that you'd find either of those products more suitable for this."}, {"count": 2, "tags": [], "creator": "netdemonz@yahoo.com", "attachment_id": null, "text": "I'll check out mod_perl as an alternative in the mean time, though allowing\nanother method, for instance a shared data file or extra environ variables would\nmean that it could also be used in other languages that don't yet have\nmod_support in apache, though you could still use mod_perl and invoke them from\nthat script. I'm a bit picky and most people don't care, but I didn't like the\nlack of control I had over the way the directory list appeared. Thanks for the\ninformation. I think still as a benefit for those that don't use mod_perl, etc,\nthat this would still be a good thing to have.", "id": 43111, "time": "2003-08-21T17:54:38Z", "bug_id": 22622, "creation_time": "2003-08-21T17:54:38Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 22622, "text": "I'd like to hack this in myself. How do I get started?", "id": 43123, "time": "2003-08-21T18:51:37Z", "creator": "netdemonz@yahoo.com", "creation_time": "2003-08-21T18:51:37Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "creator": "netdemonz@yahoo.com", "text": "I'd also like to allow it to be able to also allow the client to modify the way\nit looks. For instance, if you are browsing in a client, the client should be\nable to send some kind of header that allows you to send out something to the\nclient so it can recieve some genetic data and then layout itself the directory\nlisting in a fancy manner such as Internet Explorer does on FTP servers.\n\nThe CGI script should also be able to grab multiple directories, so it can do\nthings like allow expandable tree lists.", "id": 43124, "time": "2003-08-21T18:58:48Z", "bug_id": 22622, "creation_time": "2003-08-21T18:58:48Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 22622, "text": "I'd suggest that you want to write your own module, I don't see that we'd want\nto include this functionality in what is, after all, a very simple module.\nCertainly use autoindex as a base, but go from there.", "id": 43164, "time": "2003-08-22T14:01:23Z", "creator": "thom@planetarytramp.net", "creation_time": "2003-08-22T14:01:23Z", "is_private": false, "attachment_id": null}]