[{"count": 0, "tags": [], "bug_id": 22714, "attachment_id": null, "id": 43276, "time": "2003-08-25T21:07:24Z", "creator": "eseidel@apple.com", "creation_time": "2003-08-25T21:07:24Z", "is_private": false, "text": "It would be nice if ./configure would automatically sed the documentation to have the correct \ninstalled paths.\n\ni.e. pay attention to the --prefix= options, etc passed to configure, that those options be reflected \nin the documentation.\n\nThat way users who install apache in a location other than the default would get the benifit of \ncorrect paths in their documentation.\n\nThis would also allow the apache project to change it's default installed path at a later time w/o \nany documentation changes."}, {"count": 1, "tags": [], "bug_id": 22714, "text": "Hmm. Though I believe, this is a \"wontfix\" -- what part of the documentation are\nyou talking about? (example documents?)", "id": 43301, "time": "2003-08-26T01:16:50Z", "creator": "nd@perlig.de", "creation_time": "2003-08-26T01:16:50Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 22714, "attachment_id": null, "id": 43333, "time": "2003-08-26T15:32:49Z", "creator": "eseidel@apple.com", "creation_time": "2003-08-26T15:32:49Z", "is_private": false, "text": "That's fine.  Won't Fix is your call... but for example:\n\nhttp://httpd.apache.org/docs-2.0/invoking.html\n\ncites a specific path for Apache, how to invoke it, where it's conf files are, which of course is not \nvalid if you compiled it with:\n\n./configure --prefix=/usr\n\nor something else exciting.\n\nIt would be nice if some part of the build system automatically filled in the paths into the \ndocumentation, prior to installing it.  That way the installed documentation would actually have \ncommands in it which would work at the command line.\n\nThis again, could also be useful to apache.org if the default install path were ever to change."}, {"count": 3, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "It's true that would be helpful in some circumstances.  There are two issues here\n(other than the obvious technical issue of doing the search-replace):\n\n1. The docs can be read in many different contexts, including on the\napache website, in printed form, microsoft help files, in addition to the\ndocs distributed with the server.  Only for the last could we substitute\nthe paths.  Then we would wind up with a manual that said different\nthings depending on how you read it, which seems confusing.\n\n2. I would prefer to spend the time better documenting how the paths\nare selected and discovered.  I'm not sure exactly how to do that,\nbut suggestions are welcome.", "id": 43337, "time": "2003-08-26T18:32:33Z", "bug_id": 22714, "creation_time": "2003-08-26T18:32:33Z", "is_private": false}, {"count": 4, "tags": [], "creator": "n.schmitt@scaet.de", "attachment_id": null, "text": "Suggestion on \"better documenting how the paths are selected and discovered.\"\n\nCreating a customized RPM or MSI distribution either, forces the maintainer to \nmake his/her mind up with a deep conceptual understanding of the \"paths\". From \na package maintainers point of view i'd like to call this \"logical paths\".\n\nProviding a kind of \"map\" in the manual tree explaining the transition \nfrom \"logical paths\" (\"./configure\"'s point of view) to the resulting paths in \na concrete installation (the user's point of view) might help.\n\nThat \"kind of a map\" could be implemented as table or an image, an would be \nbound somewhere in the \"installation\" section of the manual. This avoids \nto \"sed\" the manual as whole - only the \"map\" would be generated/manipulated \nduring build and/or install.", "id": 43513, "time": "2003-08-31T09:17:24Z", "bug_id": 22714, "creation_time": "2003-08-31T09:17:24Z", "is_private": false}, {"count": 5, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "I don't think we will be able to do this in a good way, and I suspect that the\nmajority of people use the manual from sources other than their own install\nanyway.  But thanks for the suggestion.", "id": 74338, "time": "2005-05-02T22:11:59Z", "bug_id": 22714, "creation_time": "2005-05-02T22:11:59Z", "is_private": false}]