[{"attachment_id": null, "tags": [], "bug_id": 22734, "text": "In my web application I have index.jsp forwarding to a struts action using the\nfollowing:\n\n      <%@page contentType=\"text/html\"%>\n      <%String forwardTo = response.encodeURL(\"/home.do\");%>\n      <jsp:forward name=\"<%=forwardTo%>\"/>\n\nWhen a client first visits the site they get a 404 error stating \"resource not\nfound\" indicating that 'home.do;jsessionid=<yadda yadda>' could not be located.\n If the user hits reload, the page displays appropriately.\n\nI found a post on comp.lang.java.programmer from an Emery Z. Balint Jr., dated\n8/10/03, complaining of a similar problem.  In an email exchange he said he was\nable to fix the problem by shutting off URL rewriting - a problem if the client\nis a browser with cookies disabled.  It appears that both of our situations are\nsimilar.  Here is a synopsis of the hypothesis I developed in an our email exchange:\n\n\"I removed the call to response.encodeURL() and the problem went away.  \nInterestingly enough, I use encodeURL exclusively elsewhere in my \napplication.  I do not encounter the same problem except in this instance \nwhere encodeURL is combined with a forward.  I anticipate that this is a \nresult of the sequence of events that the servlet container goes through \nin establishing a session.  Perhaps a session is not fully registered \nuntil the completion of the first request-response cycle.  This would mean \nthat the forward is trying to access a session object whose existence \nis not yet known to the rest of the servlet container.  The forward fails, \nbut at the close of the transaction the session is fully \ncreated/registered/recognized, so the reload works.\"\n\nAnd his response:\n\"Very interesting, you could be correct as to what is happening. Same for\nme as well, no where else did the error occur, except for that first\ntime.\"\n\nMr. Balint and I are both using J2SE 1.4.1_02 and Tomcat 4.1.27.  I do not know\nwhether he is using Struts as well, though this seems immaterial.", "count": 0, "id": 43339, "time": "2003-08-26T19:26:43Z", "creator": "Duffy@Gillman.net", "creation_time": "2003-08-26T19:26:43Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 22734, "text": "The argument to <jsp:forward> (and <jsp:include>) should not be encoded.  \nencodeURL is for use with sendRedirect or for anchor tags.  ", "id": 43351, "time": "2003-08-27T01:29:00Z", "creator": "william.barker@wilshire.com", "creation_time": "2003-08-27T01:29:00Z", "is_private": false, "attachment_id": null}]