[{"count": 0, "text": "I have a template excel file with few sheets of data and macro. I run the macro \nin excel application and the macro is creating a new empty sheet to the \nworkbook, then the POI is running and is writing data to the latter empty sheet \nin the template file. \n\nAfter POI was running when trying to open the workbook in excel application \n(excel 2000 - 9.0.3821 SR-1) I got an application error - \"The instruction \nat \"0x3005c5eb\" referenced memory at \"0x0000018\". The memory could not be \nwritten\", afterwards I have to manually kill the excel process.\n\nI overcome the problem in a weard way , If , after the macro was running , I \nmanually delete the empty sheet and create it again and then run POI then every \nthing is o.k.\nIt seems that the creation of empty sheet via macro is affecting POI later on.\nAny Ideas ?", "bug_id": 22862, "attachment_id": null, "id": 43556, "time": "2003-09-01T16:45:45Z", "creator": "ranl@amdocs.com", "creation_time": "2003-09-01T16:45:45Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 22862, "is_private": false, "count": 1, "id": 43592, "time": "2003-09-02T11:51:22Z", "creator": "poi-support@buni.org", "creation_time": "2003-09-02T11:51:22Z", "text": "we need a sheet + easy-to-run program to replicate this.  Excel throws this for nearly ANY \nproblem with the xls.  (great piece of software eh ;-))"}, {"attachment_id": null, "tags": [], "creator": "wcrighton@yahoo.com", "text": "I'm in the middle of a development project using POI as an Excel report \ngenerator, so I don't have a simple example separated out from my code. \nHowever, I was able to reproduce this bug by taking a existing spreadsheet file \nwith 5 worksheets on it 15 rows x 25 col per (file size = 2M). \n\nIn my code I created an additional worksheet and wrote debug information to the \nnew sheet, row by row. For each row I would create a number of new cells, using \na 'cell counter' to identify where in the row I wanted the new cell to appear.\n\nInstead of resetting my 'cell counter' value each time I created a new row I \njust kept incrementing it, and the resulting spreadsheet would not open.\n\nWhen I modified my code to reset the 'cell counter' the spreadsheet would open \nfine. The resulting 'cell counter' value in the spreadsheets that would not \nopen was 966.\n\nSo the bug seems to be related to either a maximum allowable cell number per \nrow or a maximum number of empty cells per row.\n\nIf there is interest I can try to extract out an example.", "count": 2, "id": 45325, "time": "2003-10-09T22:13:21Z", "bug_id": 22862, "creation_time": "2003-10-09T22:13:21Z", "is_private": false}, {"count": 3, "tags": [], "text": "It seems the error occured only when I import new macro code to the template \n(so I know the reason its not so bad), then some old objects exist and the \nerror occured , again I overcome it by deleting and creating the sheet each \ntime I import new macro code to my template.", "is_private": false, "bug_id": 22862, "id": 45565, "time": "2003-10-14T07:23:21Z", "creator": "ranl@amdocs.com", "creation_time": "2003-10-14T07:23:21Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "avik@apache.org", "text": "William, yes, it will be great if you could extract an example. As Andy\nexplained,  excel throws this kind of an error for *any* sheet corruption issue\n(it could be one misplaced byte out of millions!), so without an example sheet,\nits quite impossible to figure out what is happening. ", "id": 45566, "time": "2003-10-14T07:28:40Z", "bug_id": 22862, "creation_time": "2003-10-14T07:28:40Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "josh@apache.org", "text": "4 years later, POI generally behaves a lot better.  It's likely that whatever caused this specific bug has been fixed.  \n\nThis is not to say that POI will never write a file that will crash Excel. In the event that a similar bug re-surfaces, some sample code (or the offending file at least) will be required to diagnose the issue.", "count": 5, "id": 116270, "time": "2008-05-05T15:02:20Z", "bug_id": 22862, "creation_time": "2008-05-05T15:02:20Z", "is_private": false}]