[{"count": 0, "tags": [], "creator": "reuben@lunachix.za.net", "is_private": false, "text": "When starting the httpd the one apache pid in the processes list of the task \nmanager runs on high cpu usage.\nChanging the settings in the httpd.conf file for the error reporting to debug I \nget the following results:\n\n[Tue Sep 02 14:44:30 2003] [debug] child.c(547): (OS 10038)An operation was \nattempted on something that is not a socket.  : winnt_accept: AcceptEx failed \ndue to early client disconnect. Reallocate the accept socket and try again.\n\nI think that due to the above debug error I am unable to connect via an \ninternet browser.\n\nI dont know what causes this, and am dumbfounded.\nI have disable all antivirus and firewall, and still get the same result.\n\nI was using version 2.043 and it was workin fine until last week, I upgraded to \n2.047 and i did not resolve the issue.\n\nAny assistance ??", "id": 43601, "time": "2003-09-02T13:39:34Z", "bug_id": 22886, "creation_time": "2003-09-02T13:39:34Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 22886, "attachment_id": null, "id": 43616, "time": "2003-09-02T15:57:16Z", "creator": "reuben@lunachix.za.net", "creation_time": "2003-09-02T15:57:16Z", "is_private": false, "text": "After investigating this on the internet, looking at it as not a problem  \nrelating to Apache, I discovered that there are various new applications out \nthere that change the winsock2 or the LSP of windows.\nAfter restoring my original winsock2 file, I discovered that it was not this \ncase and proceeded to investigate the LSP route.\nI downloaded a file from http://www.cexx.org/lspfix.zip that checks all the LSP \nprotocol handlers for windows.\nIt gives a list of the LSP's in the registry and I then did a file search on \nall of them to make sure which were Microsoft files and which were not, then \nselected the non Microsoft files and clicked finished.\nPresto problem solved, CPU usage down, and sockets connecting.\nIn my case it was McAfee firewall LSP causing the problem, even after \nunistalling the product it remained present.\nI sugest using Zone Alarm as a personal or server firewall.\n\nHope this helps other people.\n\nReuben"}]