[{"count": 0, "tags": [], "text": "I've tested this defect under the beta 4 and beta 5 milestone Tomcat4 builds, as \nwell as the current nightly build. I am running Tomcat4 under Windows 2000 with \nJDK1.3.\n\nThe defect that I see can be duplicated if you jsp:include any servlet in a JSP \nand then forward to another file. For testing, I used the \nHelloWorldExample.class servlet that is provided with the Tomcat4 examples \nwebapp. I also tested with a servlet that provides file upload capabilities. \nThe behavior was the same in both cases.\n\nTo duplicate this defect, set up a webapp with the following directory and file \nstructure:\n\nwebapp_root\\\n  index.html\n  testhelloworld.jsp\nwebapp_root\\WEB-INF\\\n  web.xml\nwebapp_root\\WEB-INF\\classes\\\n  (copy these from tomcat4\\webapps\\examples\\WEB-INF\\classes\\)\n  HelloWorldExample.class\n  LocalStrings.properties\n  LocalStrings_en.properties\n  LocalStrings_es.properties\n\nIn webapp_root\\testhelloworld.jsp, type the following code:\n\n  <jsp:include page=\"servlet/HelloWorldExample\" flush=\"false\"/>\n  <jsp:forward page=\"index.html\"/>\n\nIn webapp_root\\index.html, type some text to print to the screen.\n\nThe behavior that I expect is that testhelloworld.jsp includes the servlet and \nthen immediately forwards to index.html.\n\nThe behavior that I see is that testhelloworld.jsp, upon its compilation and \nloading, displays the output from the HelloWorldExample servlet, but does not \nforward to index.html. However, after testhelloworld.jsp is requested the first \ntime and the class is resident in the servlet container, you can request it \nagain and it WILL forward to index.html. Compilation does not seem to \nmatter; I can stop and restart Tomcat and it will always show the results of the \nservlet without forwarding upon the first request, but will forward upon further \nrequests.", "attachment_id": null, "bug_id": 2294, "id": 3217, "time": "2001-06-22T15:16:57Z", "creator": "garrel@more.net", "creation_time": "2001-06-22T15:16:57Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "craig.mcclanahan@sun.com", "is_private": false, "count": 1, "id": 3655, "time": "2001-07-11T14:19:24Z", "bug_id": 2294, "creation_time": "2001-07-11T14:19:24Z", "text": "Works correctly for me, with either servlets or JSP pages, on either the first\nload or subsequent loads of the JSP page.\n\nOne issue that can cause something like this is if the response gets committed\n(from the original page or from the included page) before the forward is\nprocessed.  A possible cause for this is if the original page or the included\npage threw an exception, in which case you'd have the response be committed.\n"}, {"count": 2, "tags": [], "text": "Reported as fixed for original poster in nightly build 20010717.\n", "attachment_id": null, "bug_id": 2294, "id": 3783, "time": "2001-07-17T13:39:38Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-07-17T13:39:38Z", "is_private": false}]