[{"count": 0, "tags": [], "text": "Apache 2.0.47 often failed to start properly for me in XP.  The\nApache2 service and Apache.exe processes would be running but\nApacheMonitor would say it's not running and I couldn't access the \nserver.  I'd have to stop and then start Apache through ApacheMonitor\nto get Apache running properly.  Clicking on restart wouldn't work\nlike that; I'd need to stop and start.\n\nI finally fixed the problem.  I made the Apache2 service depend on the\nuniversal plug and play services, SSDPSRV and upnphost.  I don't know\nif both are necessary and I don't feel like trying to find out.  I've\ndone about 10 reboots and Apache ran properly every time.  Before it\nwouldn't even run properly 1/10 times.\n\nTo do this fix add SSDPSRV and upnphost lines to:\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\Apache2\\DependOnService\nin the registry.  (use regedit or whatever)\n\nThe only problem now is that ApacheMonitor fails to show up in the\nsystem tray.  This also happens if I disable the Apache2 service.\nBefore it'd almost always be there.  I assume this is yet another\nstupid UPNP issue.  If the UPNP services are enabled on XP various\ntray icons sometimes dissappear (and I mean disappear, not become\nhidden).  This ApacheMonitor problem is therefore a known and unfixed\nbug in XP, not an Apache bug, but it would be nice if ApacheMonitor\nautomatically replaced it's tray icon if it found it missing (due to\nthis XP bug or an explorer crash or whatever).  Many windows apps do \nthis and I find it very helpful.\n\nBTW I strongly recommend disabling or uninstalling universal plug and\nplay unless you're really sure you need it.  It doesn't even work right\nanyways; my internet gateway gets found only half the time.\n\n-- \nBoris", "is_private": false, "id": 43837, "creation_time": "2003-09-08T14:11:59Z", "time": "2003-09-08T14:11:59Z", "creator": "enosys@netmails.net", "bug_id": 22989, "attachment_id": null}, {"count": 1, "tags": [], "creator": "chip@force-elite.com", "attachment_id": null, "is_private": false, "id": 62702, "time": "2004-08-30T04:30:31Z", "bug_id": 22989, "creation_time": "2004-08-30T04:30:31Z", "text": "Can you please test with 2.0.50?\n\nIs there anything in the Error Log?"}, {"count": 2, "tags": [], "text": "No Feedback + Old Version.", "is_private": false, "bug_id": 22989, "id": 63693, "time": "2004-09-17T04:20:57Z", "creator": "chip@force-elite.com", "creation_time": "2004-09-17T04:20:57Z", "attachment_id": null}]