[{"count": 0, "tags": [], "text": "We are using log4j (1.2.8 version) in our application for logging. During \nproduction we have observed performance problems with log4j (we are using \nRollingFileAppender) with number of users growing. These are some of the \nresults what we captured while logging with a normal java program (by creating \nparallel threads for no of users). We used the debug method for logging.\n\nNumber of users    Time in Millisecs\n====================================\n1                  0-1\n10                 4-5\n30                 13-20\n40                 20-26\n60                 47-50\n80                 65-70\n\nThis is a show-stopper problem for us. Please provide help/advice as soon as \npossible.\n\nthanks\n\nNaveen", "attachment_id": null, "id": 43844, "creator": "naveen_jaidayal@satyam.com", "time": "2003-09-08T16:21:33Z", "bug_id": 22996, "creation_time": "2003-09-08T16:21:33Z", "is_private": false}, {"count": 1, "tags": [], "text": "\nWhat are you measuring exactly? What does 'time in millisecs' represent? The \ntime of each log4j operation, the accumulated time for all log operations?\n\nWhat exactly are the perfomance problems you have observed? ", "is_private": false, "bug_id": 22996, "id": 43846, "time": "2003-09-08T17:01:43Z", "creator": "ceki@apache.org", "creation_time": "2003-09-08T17:01:43Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "We observed performance problems with the application when we turn the logging \non. So we did this small test where we are writing to the log file using log4j \nand we tried to find how much time it takes to write a message to the log using \nlog4j.\n\nWhat i pasted in the bug were the results. For a single message it takes 0-1 \nmilli seconds when there is only one user trying to log messages to the log \nfile. When the number of users increase to 10 then the time to log a single \nmessage goes to 4-5 milli seconds and so on for 80 simultaneous users it goes \nto 65-70 milli seconds.\n\nLet me know if you need more.", "is_private": false, "bug_id": 22996, "id": 43851, "time": "2003-09-08T18:11:22Z", "creator": "naveen_jaidayal@satyam.com", "creation_time": "2003-09-08T18:11:22Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "This seems contrived, at best, to me.  What did you expect, that no matter how \nmany users/messages were writing to the file, the write time would be the \nsame???  Unless I'm misunderstanding the issue, this is at most an enhancement \nrequest.", "is_private": false, "id": 43852, "creator": "yoavs@computer.org", "time": "2003-09-08T18:27:05Z", "bug_id": 22996, "creation_time": "2003-09-08T18:27:05Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 22996, "attachment_id": null, "id": 43853, "time": "2003-09-08T18:30:13Z", "creator": "ceki@apache.org", "creation_time": "2003-09-08T18:30:13Z", "is_private": false, "text": "\nWould it be possible for you to post the code you use to measure performance?\n\n(See \"Attachments: Create a new Attachment\" on this page. "}, {"count": 5, "tags": [], "bug_id": 22996, "text": "Your results actually show excellent log4j scalability: an order of magnitude \nincrease in the number of concurrent users leads to only half that increase in \nlogging time.  It is expected that performance degrades if you enable DEBUG-\nlevel logging on a heavily-loaded production system.  Logging is not a free \noperation after all, but log4j does its best to reduce its CPU and memory \nconsumption.\n\nIf you have a specific patch, please reopen this issue and post it here.  If \nyou want tips and suggestions on coding your app's logging for better \nperformance, please ask on the log4j-user list.", "id": 68404, "time": "2004-12-13T18:04:52Z", "creator": "yoavs@computer.org", "creation_time": "2004-12-13T18:04:52Z", "is_private": false, "attachment_id": null}]