[{"count": 0, "attachment_id": null, "bug_id": 23112, "is_private": false, "id": 44053, "time": "2003-09-11T16:57:51Z", "creator": "jessh@ptc.com", "creation_time": "2003-09-11T16:57:51Z", "tags": [], "text": "If the file path of the web app document base (e.g. when <Context> elements are \nused to point to a docBase outside of Tomcat, for instance) contains spaces, \nthen RMI from within this web app will not function properly.\n\nThis turns out to be a bug in Tomcat 4.1.24 (and higher, i.e. Tomcat 4.1.x does \nnot yet have a fix in HEAD), i.e. I have tracked down the offending code.\n\nTomcat uses File.toURL() to produce the responses to its \nWebappClassLoader.getURLs() method.  Since WebappClassLoader is a subclass of \nURLClassLoader, the results of getURLs() are concatenated into a space \ndelimited string used in calls to RMIClassLoader.loadClass() as the 'codebase' \nargument (at least during normal RMI operation).  If these URLs have spaces \nwithin them, then the RMIClassLoader generates MalformedURLExceptions here as \nthe 'codebase' argument cannot be properly parsed.\n\nThe Java 2 v1.4.x Javadoc states that File.toURL() cannot be relied upon to \ncreate properly escaped URLs (!) and that one should use File.toURI().toURL() \ninstead.  Unfortunately java.net.URI is specific to 1.4 and higher JVMs...\n\nI am already subclassing WebappClassLoader (to extend the intrinsic virtual \nclasspath of web apps), so I just overrode WebappClassLoader.getURL(File) such \nthat it now works properly.  Essentially I load a helper class that uses \njava.net.URI to do what the 1.4 Javadocs suggest at static init time via \nreflection and create an instance of it, i.e. when I can.  If this static field \nis non-null in getURL, then I use it, else (i.e. in Java 1.3.x) I replace all \nspaces with %20's manually.\n\nMy fix works fine, but it should really be integrated into Tomcat in \nWebappClassLoader.getURL(File) rather than my subclass.  Let me know if sources \nare desired, but the fix is quite simple.\n\n[Note that this does apply to all platforms to the best of my understanding in \nthat while no one I know is stupid enough to put spaces in directory names on \nUNIX it can be done...]"}, {"count": 1, "tags": [], "text": "This is a known issue, and at least one BZ report deals with that. Tomcat 5 has\nbeen enhanced so that it would work on JDK 1.4, but this is experimental and\nuntested. Feel free to try it and give feedback.", "attachment_id": null, "id": 44054, "creator": "remm@apache.org", "time": "2003-09-11T17:03:58Z", "bug_id": 23112, "creation_time": "2003-09-11T17:03:58Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jessh@ptc.com", "attachment_id": null, "id": 44056, "time": "2003-09-11T17:24:03Z", "bug_id": 23112, "creation_time": "2003-09-11T17:24:03Z", "is_private": false, "text": "I would happily provide my fix.  I'm currently only doing anything but\nFile.toURL() for cases where the path contains a space, so for the vast majority\nof folk there should be no impact.  I've tested the various code paths and am\nconvinced my fix is quite safe.  One could alway omit the 1.4-dependent path to\nensure easy compilation with 1.3.x (rather than having to complicate the build\nscripts)."}, {"count": 3, "tags": [], "bug_id": 23112, "text": "\n\n*** This bug has been marked as a duplicate of 13983 ***", "id": 45311, "time": "2003-10-09T18:45:03Z", "creator": "medthomas@ntlworld.com", "creation_time": "2003-10-09T18:45:03Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "medthomas@ntlworld.com", "attachment_id": null, "text": "If you have a patch ready to go, please provide it. I really don't see the \npoint in repeating work someone else has already done ;)", "id": 45316, "time": "2003-10-09T20:03:21Z", "bug_id": 23112, "creation_time": "2003-10-09T20:03:21Z", "is_private": false}, {"count": 5, "tags": [], "text": "I offered a patch at the time (in response to a 'yes, we know about the issue\nbut have chosen not to fix it yet' e-mail), but got no takers.\n\nAt this time I don't have time, though I'll try to find some.\n\nMy fix is currently in the form of a sub-class (as I needed to extend Tomcat\nanyway), which is probably a large part of why no one wanted the initial patch.\n I believe the simple description of what I actually did is thus actually more\nuseful than a patch implemented in an obtuse manner so as not to change Tomcat\nsources :-)", "attachment_id": null, "id": 45317, "creator": "jessh@ptc.com", "time": "2003-10-09T20:14:15Z", "bug_id": 23112, "creation_time": "2003-10-09T20:14:15Z", "is_private": false}]