[{"attachment_id": null, "tags": [], "creator": "eero@barchart.com", "is_private": false, "count": 0, "id": 44071, "time": "2003-09-11T20:53:08Z", "bug_id": 23117, "creation_time": "2003-09-11T20:53:08Z", "text": "As a developer, I understand that this may not be a lot to go on, and possibly \na bit vague, but I have noticed the following issues running mod_perl 1.99 and \nApache 2.0.47 (I also tried 2.0.45 and 2.0.44)\n\nAs a note, this is running on Win2K, on a dual 733 with 512MB ram. This server \nis highly *stressed* == approximately 40 requests/sec, transferring small \nchunks of data, totaling approx. 75 kb/sec.\n\nThe perl script it simple. Launch an external program to do stuff, then return \nthe STDOUT.\n\nProblems:\n1.) When Apache is run from the command line, each request spawns a new \nconsole. When it runs as a service, it doesn't. Problems with CreateProcess \nsomewhere?\n\n2.) The server doesn't close requests fast enough, and the requests take \nforever as the number of requests being processed grows. While I understand \nthat this may just be load, it should be able to handle something like /server-\nstatus. If not, the cpu usage should be 100%. But the cpu sits at 15 - 40 %, \nyet snags.\n\n3.) The Apache process keeps sucking up memory. After approximately 15 minutes, \nit goes well over 100MB\n\n4.) This is probably mod_perl: if I have let's say 100 requests, and each \nrequest launches abc.exe, then why am I seeing only 1, 2, sometimes 3 (but \nnever 50) abc.exe's in the process list?? Does mod_perl or Apache create a \nmutex or criticalsection on this type of behavior?\n\nPreviously, I was running the same system under Apache 1.3.22 as a cgi, and it \nperformed as expected. I went to mod_perl in order to kill the multiple \nperl.exe's, but the overall result is troubling.\n\nI would be more than happy to share config files, additional info. \n\nEAP."}, {"count": 1, "tags": [], "bug_id": 23117, "attachment_id": null, "id": 45351, "time": "2003-10-10T12:56:49Z", "creator": "trawick@apache.org", "creation_time": "2003-10-10T12:56:49Z", "is_private": false, "text": "Can you reproduce this behavior without mod_perl?\n"}, {"count": 2, "tags": [], "bug_id": 23117, "attachment_id": null, "text": "Plz reopen bug if you can reproduce without mod_perl.", "id": 54345, "time": "2004-03-21T19:12:52Z", "creator": "trawick@apache.org", "creation_time": "2004-03-21T19:12:52Z", "is_private": false}]