[{"count": 0, "attachment_id": null, "bug_id": 23191, "text": "Ant is an extensible build tool, but it takes too much work to find out how to deploy a project \nusing an extended ant, which would necessarily need to bootstrap itself for the custom tasks that \nare included.  I was hoping the documentation could specifically have a brief section on deploying \nprojects that have custom tasks, and instructions on the best way to include those custom tasks in \nthe projects (and in the build file).", "id": 44234, "time": "2003-09-16T12:42:22Z", "creator": "dbikel@cis.upenn.edu", "creation_time": "2003-09-16T12:42:22Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "jan@materne.de", "text": "You don´t have to rebuild ant. You can <taskdef> the addons. <taskdef> supports \nclasspath attribute.\n\nIf you want to have more docs ... please provide that. I don´t know what you \nwant.\n\nDo have had a look into the docs? Especially \n- docs\\ant_in_anger.html\n- docs/manual/tutorial-writing-tasks.html#use1", "id": 44238, "time": "2003-09-16T12:51:44Z", "bug_id": 23191, "creation_time": "2003-09-16T12:51:44Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "jan@materne.de", "text": "Sorry: first available in ... very old versions, second only in newest (CVS \nHEAD).", "id": 44239, "time": "2003-09-16T12:52:21Z", "bug_id": 23191, "creation_time": "2003-09-16T12:52:21Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 23191, "text": "In Example 2 in the section\nhttp://ant.apache.org/manual/develop.html#writingowntask\nit mentions \"Another way to add a task (more permanently), is to add the task name and \nimplementing class name to the default.properties file in the org.apache.tools.ant.taskdefs \npackage. Then you can use it as if it were a built-in task.\"  This sentence is highly confusing: why \nwould anyone want to extend ant and then modify a particular ant installation?  It would allow you \nto build locally using the new, custom task, but it makes the project totally unportable.\n\nAlso, using Example 1 (simply labeled \"Example\" in the docs) means that you must have \nprecompiled your custom task before distributing your project.  But with an extensible build tool \nthat is itself undergoing development (not to mention the JDK itself), this seems dangerous.  \nExample 2 seems to be the only good, portable method of including custom tasks in a project that \nyou want to be portable, but the docs don't exactly make this clear.  One simple thing that would \ngo a long way would be to label \"Example\" and \"Example 2\" with more explanatory titles, such as \n\"Including a pre-compiled custom task in your project\" and \"Using ant to bootstrap itself with \ncustom tasks included in your project\", or something to that effect (those are wordy, but \nperspicuous).\n\nIf this is all clear in the latest CVS docs, then I sincerely apologize for creating this feature request.", "id": 44240, "time": "2003-09-16T13:16:17Z", "creator": "dbikel@cis.upenn.edu", "creation_time": "2003-09-16T13:16:17Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "jan@materne.de", "text": "I think enhancment with custom tasks is easy enough with antlibs now.\nhttp://svn.apache.org/repos/asf/ant/core/trunk/docs/manual/CoreTypes/antlib.html", "id": 90980, "time": "2006-07-07T11:40:57Z", "bug_id": 23191, "creation_time": "2006-07-07T11:40:57Z", "is_private": false, "attachment_id": null}]