[{"count": 0, "tags": [], "creator": "pluellen@crosslogic.com", "attachment_id": null, "id": 44299, "time": "2003-09-18T14:49:16Z", "bug_id": 23251, "creation_time": "2003-09-18T14:49:16Z", "is_private": false, "text": "1.  Created and saved several modules, then reopened them into the workbench so\nthat they would be available to ModuleControllers.\n\n2.  In a new testplan I added several ModuleControllers each referencing a\ndifferent module created in step 1.\n\n3.  I executed the test plan successfully via GUI - it produced sample results.\n\n4.  When I executed the test plan via command line, I get no results (literally,\n\"<testResults>\") in my output file.  I am able to run other test plans (that do\nnot contain module controllers) with results via command line.\n\nI think this may have something to do with there being no capability of setting\na workbench when executing from the command line (since the ModuleController\nrelies on the workbench to reference an existing module).\n\nI'm happy to help out with fixing this bug but would like to discuss with\nModuleController author to discuss strategy before starting.\n\nThx.\n\nPete"}, {"count": 1, "attachment_id": null, "bug_id": 23251, "text": "To fix this would require including the WorkBench as part of the test plan,\nwhich is too big a change to just do without considering the ramifications. \nLeaving unfixed for now.", "id": 76838, "time": "2005-06-30T17:41:10Z", "creator": "mstover1@apache.org", "creation_time": "2005-06-30T17:41:10Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 23251, "attachment_id": null, "id": 77155, "time": "2005-07-10T23:45:33Z", "creator": "sebb@apache.org", "creation_time": "2005-07-10T23:45:33Z", "is_private": false, "text": "The module controller can invoke controllers stored under a different Thread Group.\n\nBy setting up a thread group which never runs (e.g. set the start time to many\nyears from mow), it's possible to get round the limitation that the workbench\nitems are not saved.\n\nThis works fine in GUI mode, but unfortunately does not work in non-GUI mode,\nbecause the code relies on the GuiPackage to find the root of the tree."}, {"count": 3, "tags": [], "bug_id": 23251, "attachment_id": null, "text": "in the current 2.1 branch, there's a new include controller which should work\nfor this purpose. that should over come the limitations and allow you to run in\nconsole mode.", "id": 79525, "time": "2005-09-07T15:25:59Z", "creator": "woolfel@yahoo.com", "creation_time": "2005-09-07T15:25:59Z", "is_private": false}]