[{"count": 0, "tags": [], "text": "Hi,\n\nIam working on a project which uses FOP to generate pdf using the XSL-FO.  \nI am fairly new to this, based on the examples I was able to completed all the \ntasks except for one. \n\nThe problem in a nut shell is I have an XML file which has the data and XSL \nfile which defines the presentation. \nPrimarily the page consists of 3 columns and the third column has two nested \ntables. All the data are displayed perfectly except for the link. When the link \nis displayed in the document and when I mouse over the document, only some part \nof the link seems to be clickable.  For those links that are outside from this \ntable is working fine. \n\nThe operating system which we are using is Windows 2000 SP3, to read pdf we are \nusing Acrobat Reader 5.1. We are using the fop-0.20.5 from apache to render the \npage.\n\nFor this problem I could'nt not find a solution. Could you please let me know \nthe cause of this problem and how this can be solved. Since we are at the stage \nwhere we need to implement this feature as early possible, I request you to \nkindly look into the issue and help us out in solving the problem. \n\nAwaiting your response.\n\nThanks in advance.\nSuresh.S", "attachment_id": null, "id": 44425, "creator": "suresh@xm-asia.com", "time": "2003-09-22T06:53:32Z", "bug_id": 23317, "creation_time": "2003-09-22T06:53:32Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 23317, "attachment_id": null, "text": "Are you certain the problem is with FOP and not Adobe Acrobat?\n\nI doubt we can fix your problem in the timeframe desired--and we don't make \nmany changes to the maintenance branch (0.20.5) anymore--however, it may be \nhelpful if you (1) attached to this bug a *minimal* XSL FO document that causes \nyour problem to occur, and (2) attached the resultant PDF document that FOP \ncreated for you with (1), so we can see the problem.  Of course, don't attach \nanything with sensitive information.\n", "id": 44464, "time": "2003-09-22T20:34:33Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-09-22T20:34:33Z", "is_private": false}, {"count": 2, "text": "Check whether the URL doesn't overflow the table cell and whether it's not\none of the known hotspot alignment bugs.", "bug_id": 23317, "attachment_id": null, "id": 44465, "time": "2003-09-22T21:00:28Z", "creator": "j3322ptm@yahoo.de", "creation_time": "2003-09-22T21:00:28Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "text": "Created attachment 8318\nThe enclosed adb.zip contains the adb.xml, adbpdf.xsl and the pdf file generated from our environment.", "attachment_id": 8318, "id": 44480, "creator": "suresh@xm-asia.com", "time": "2003-09-23T04:50:56Z", "bug_id": 23317, "creation_time": "2003-09-23T04:50:56Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 23317, "text": "The PDF document is doing the same thing on my side as yours.\n\nBut, I ran your xml & xsl through Xalan--one thing I noticed in the FO output \nare lots of nonsensical Â (A-caret?) letters--I don't see why you need them.  \nThere appears to be something wrong with your stylesheet.\n\nAlso, running the FO output through FOP gave a warning that you have specified \nyour column widths about 25% too wide.  (Sum about 500K, specified IPD 417K or \nso.)  This may be the source of your problem--your columns are too narrow, and \nyour results would therefore be undefined.  Also, there were complaints about \nmissing images, etc., so that may be an issue.\n\nFinally, in a separate, simple document I created two PDF links--one outside a \ntable and one within in a simple file in 0.20.5--works fine!--So I believe the \nproblem is with your XSL FO document.  I'm attaching a sample XSL FO document \nand resultant PDF--you can see that the links work fine.  \n\nSomehow, perhaps by correcting your XSL FO you should be able to get the links \nto work like they do in my sample document.  But right now, there are too many \nthings messy/wrong with your stylesheet for it to indicate that the problem is \nwith FOP.  At any rate, we are making very few changes to our 0.20.x branch, \nand given that the fo:basic-link mostly work, changes do not appear called for \nat this time.\n\n", "id": 44542, "time": "2003-09-23T22:18:44Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-09-23T22:18:44Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "text": "Created attachment 8323\nworking examples of fo:basic-link", "attachment_id": 8323, "id": 44543, "creator": "glenmazza@yahoo.com", "time": "2003-09-23T22:19:51Z", "bug_id": 23317, "creation_time": "2003-09-23T22:19:51Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 23317, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156970, "time": "2012-04-01T13:55:40Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:55:40Z", "is_private": false, "attachment_id": null}]