[{"count": 0, "tags": [], "creator": "beeg4@netzero.net", "attachment_id": null, "id": 44469, "time": "2003-09-22T23:00:15Z", "bug_id": 23339, "creation_time": "2003-09-22T23:00:15Z", "is_private": false, "text": "The MANIFEST.MF file has a Class-Path value that can be set to include jar \nfiles in the classpath of the above files.  The current core tasks however do \nnot give the option to not create the Manifest file (using jar it is the M \nflag).  Because of this, if the Class-Path value is longer than 71 characters a \nhard line is used and the filenames are broken up.  This makes the Class-Path \nentry invalid for any listings after the end of the first line (including a \nseparated file on the first line).  Recommend that an option be added to ANT to \nsuppress the creation of the MANIFEST.MF file to be used in conjunction with \nthe manifest option that allows for declaring the MANIFEST.MF file to be used \nwith war, ear or jar."}, {"count": 1, "tags": [], "creator": "conor@apache.org", "attachment_id": null, "id": 44475, "time": "2003-09-23T00:39:45Z", "bug_id": 23339, "creation_time": "2003-09-23T00:39:45Z", "is_private": false, "text": "If you don't want to create a manifest, use the <zip> task.\n\nYour statement \"Because of this, if the Class-Path value is longer than 71\ncharacters a hard line is used and the filenames are broken up.  This makes the\nClass-Path entry invalid for any listings after the end of the first line\n(including a separated file on the first line)\" is incorrect. Class-Path entries\ngreater than 72 chars are not valid according to the jar specification and must\nbe broken up into separate lines, using continuations (lines starting with a\nspace). Such an entry is not only not invalid, it is required. \n\nIf Class-Path entries with continuations cause some systems to have problems,\nthen unfortunately, the problems lie with those systems and should be reported\nto their developers."}, {"count": 2, "tags": [], "creator": "beeg4@netzero.net", "attachment_id": null, "id": 44515, "time": "2003-09-23T15:44:53Z", "bug_id": 23339, "creation_time": "2003-09-23T15:44:53Z", "is_private": false, "text": "Thank you for the clarification.  I will see what happens when that occurs and \ncontact the appropriate development group if the jar spec is not followed."}]