[{"count": 0, "tags": [], "text": "I've got JDK 1.4.1_01-b01 running on Linux RHAS 2.1.\n\nI set up the TRAX API to format some data using an XSLT stylesheet.\n\nI create a javax.xml.transform.stream.StreamResult passing the current JSP \npage's writer as the argument to the constructor. The XSLT sheet say 'encoding \nUTF-8', and the JSP page is a UTF-8 page.\n\nAll the the non-latin-1 characters are smashed to ?'s. If I create a \nStringWriter, point trax at that, and then write the resulting string to the \nJspWriter, all is well. This problem occurs with the Xalan that comes with the \nJDK and also with 2.5.1. If I use saxon, it does something more useful but \nstill wrong -- it represents all the interesting characters as &#nnnnnn; \nsequences. \n\nI cannot produce any form of this bug with any writer except the JspWriter.", "is_private": false, "bug_id": 23357, "id": 44526, "time": "2003-09-23T17:23:30Z", "creator": "bim2003@basistech.com", "creation_time": "2003-09-23T17:23:30Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "I think this may be that the code in Xalan that looks at the types of objects \nto decide what they are doesn't recognize the JspWriter and misfires.\n", "is_private": false, "id": 59724, "creation_time": "2004-06-22T16:37:30Z", "time": "2004-06-22T16:37:30Z", "creator": "bim2003@basistech.com", "bug_id": 23357, "attachment_id": null}, {"count": 2, "tags": [], "text": "Based on Benson Margulies's comments this looks like a 'feature' of Xalan \nrather than a problem with the JspWriter.", "is_private": false, "bug_id": 23357, "id": 62000, "time": "2004-08-15T13:47:03Z", "creator": "markt@apache.org", "creation_time": "2004-08-15T13:47:03Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "The TraX API seems to have overlooked the need for a published protocol for a \nStreamSource to advertise what characters it can deliver and what need to be \nescaped out or transcoded. It might be reasonable for jasper to go out of its \nway to work around this. Alternatively, if you happen to know where to shoot \ncomplaints related to Trax as provided in the JDK, I'll submit a report over \nthere.\n", "is_private": false, "id": 63869, "creator": "bim2003@basistech.com", "time": "2004-09-20T12:37:44Z", "bug_id": 23357, "creation_time": "2004-09-20T12:37:44Z", "attachment_id": null}]