[{"count": 0, "tags": [], "bug_id": 23397, "attachment_id": null, "text": "I use my IDE (NetBeans) for most ant work.  There are times when I need to create intermediate \ntargets for the sake of modularity and code reuse.  Unfortunately, all these extra targets show up \nas first-rate targets to be executed in my IDE.  I've tried various target naming conventions to help \nhighlight/lowlight primary/intermediate targets, but it's not great.\n\nIf there were an attribute flag to indicate intermediate/private targets, then IDEs could optionally \nhide these targets. \n\nFor example:\n\n<target name=\"foo\" private=\"true\">\n\nThis might also be useful if you ever add a \"list targets\" feature to the ant CLI.  For example:\n\nant -list [file]   (list all primary targets)\nant -list -all [file]   (list private targets too)", "id": 44625, "time": "2003-09-24T22:31:46Z", "creator": "apache@ia-inc.com", "creation_time": "2003-09-24T22:31:46Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 23397, "text": "\n\n*** This bug has been marked as a duplicate of 22020 ***", "id": 44645, "time": "2003-09-25T07:52:36Z", "creator": "jan@materne.de", "creation_time": "2003-09-25T07:52:36Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "stevel@apache.org", "text": "Actually this is a simpler defect than proper public/private attrs; the user\njust wants the IDE to differentiate entry points from internal ones. \n\nChris -the <target> element has a description attribute. Once you set the\ndescription on a target, you are saying that this is public and others are\nprivate. Ant on the command line, and in some IDEs (IntelliJ for example) use\npresence/absence of a description as a cue for visibility in listing targets. I\ndont know about netbeans -I would assume it does, but if it doesnt, well, you\ncould fix it :)\n\nAlso, we do have an 'ant list targets' feature. \nType \"ant -projecthelp\" at the command line. ", "id": 44697, "time": "2003-09-25T16:41:36Z", "bug_id": 23397, "creation_time": "2003-09-25T16:41:36Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "gus.heck@olin.edu", "attachment_id": null, "text": "Yes thogh this is an overloading of the meaning of the description tag by the\nide's. It seems wrong to put 2 meanings on one tag.\n\nNet beans does not hide any targets. \n\nThey display all top level elements, including properties, and taskdefs, and I\nsuspect with the advent of top level tasks (which I never use because of the\naccess control pattern I describe in bug 22020) this will become even more messy\nin net beans. If someone here is active in netbeans some additional special\nhandling of antfiles would be good. Heaven only knows if I will ever have the\ntime to start developing for net beans too :)\n\nWhat the IDE's are doing is guessing. It would be nice if we could tell them so\nthey don't have to guess :)", "id": 44702, "time": "2003-09-25T16:59:48Z", "bug_id": 23397, "creation_time": "2003-09-25T16:59:48Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 23397, "attachment_id": null, "text": "Thanks Steve... I see your point, but I agree with Gus: I think that making the description attribute \nperform dual duties is not the optimal design.  Private targets may still benefit from descriptions.  \nFor example, I'd hope that my IDE could turn on/off visibility of private targets for editing vs. \nrunning.  When visible (e.g. during editing) I think the private task descriptions have merit, for \nexample, it could be displayed in a status label.  (At least that's the way I'd code NetBeans ;-)\n\nRegarding the -projecthelp argument, you're 100% right... thanks.  But I may open a future \nenhancement request to deprecate that name... kinda long, and not intuitive enough (for me at \nleast) to understand it when I was quickly looking for it.", "id": 44703, "time": "2003-09-25T17:08:32Z", "creator": "apache@ia-inc.com", "creation_time": "2003-09-25T17:08:32Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 23397, "text": "dont open an new enh req till you've looked at ant1.6, due in beta next week,\nOK? you may find ant -p does what you want", "id": 44721, "time": "2003-09-25T21:02:56Z", "creator": "stevel@apache.org", "creation_time": "2003-09-25T21:02:56Z", "is_private": false, "attachment_id": null}]