[{"count": 0, "tags": [], "bug_id": 23406, "is_private": false, "text": "I have a very strange problem and it is almost unreproducable. If someone would\nlike to help me isolate the issue I'd be much abliged. I'm willing to do the\nresearch work on it, but need a few hints where to look. The following happens: \n\nWe have an index.jsp which jsp:includes a menu.jsp. The menu.jsp is a relatively\nlarge plain text file. The menu.jsp is generated every night at midnight to\nreflect the changes of the day. Some days when we come in, the menu only shows\npartially. Other days the whole menu is shown.\n\nWhen checking the generated java and class files everything seems to be in\norder. The index.jsp has a JspRuntimeLibrary.include where the jsp:include was\nand the menu.jsp, menu_jsp.java and menu_jsp.class(decompiled to check) all\nresemble the new state. The index.jsp shows itself entirely, however only a part\nof the included html is shown. If the menu.jsp is recreated manually everything\nworks again.\n\nA sidenote to this bug is that it only seems to occur with larger includes (this\nexample is 1300 lines). Other sites we've created use the same method of\nincluding and menu generation with smaller menus and they have no problem.", "id": 44651, "time": "2003-09-25T08:37:10Z", "creator": "mvdijken@madocke.nl", "creation_time": "2003-09-25T08:37:10Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "funkman@joedog.org", "text": "[PURE SPECULATION]\n\nYou are seeing a race condition. While the file (menu.jsp) is being generated to\nits destination - a request is made for it. During this sime time, a request is\nmade for the file. The file is read incompletely by the JSP compiler, and the\nwrite happens quick enough that all of this occurs in the same second so the JSP\nengine does not detect a file change. \n\nI have seen this on tomcat404. You have 3 workarounds:\n1) If its a plain text file, just call it menu.txt. This also saves some\noverhead of a JSP.\n2) Generate the file to a temporary area on the same disk. Then use a file copy\nfrom/to local disk.\n3) Tweak the jsp to force a compile error of itself if it is not complete. A\nsimple brace <% { %> at the top of the file then closing brace at the bottom\nshould work.\n\nIt would be nice for Jasper to store the file size and date to perform its\nchecks for situations such as this.", "id": 44657, "attachment_id": null, "bug_id": 23406, "creation_time": "2003-09-25T11:07:52Z", "time": "2003-09-25T11:07:52Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 23406, "text": "With no further comment on this bug I am going to assume that Tim's speculation\nwas correct. There are a number of very simple work-arounds so I am going to set\nthis as an enhancement request and change the summary accordingly.", "id": 77688, "time": "2005-07-26T23:08:42Z", "creator": "markt@apache.org", "creation_time": "2005-07-26T23:08:42Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "*** This bug has been confirmed by popular vote. ***", "id": 139650, "attachment_id": null, "bug_id": 23406, "creation_time": "2010-09-03T04:47:02Z", "time": "2010-09-03T04:47:02Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 23406, "attachment_id": null, "id": 144482, "time": "2011-02-22T15:41:04Z", "creator": "markt@apache.org", "creation_time": "2011-02-22T15:41:04Z", "is_private": false, "text": "I've been reviewing this one again. The bit that confuses me is that the menu_jsp.class file contains the latest version but clearly the version loaded by the class loader is an older version. The timestamp checks that take place are in milliseconds and a quick text shows that there is reasonably fine granularity with these.\n\nIt does look like a race condition but one that I can't figure out given the current code. There have been changes to Jasper post 4.1.x (increased synchronisation, switch to the Eclipse compiler, improved dependency checking) and I don't recall any similar issues in 5.5.x onwards.\n\nGiven the above, it isn't very satisfactory but I am going to resolve this as WONTFIX an the assumption that this was a 4.1.x bug that was fixed in 5.5.x onwards by the various changes."}]