[{"count": 0, "tags": [], "bug_id": 23421, "attachment_id": null, "id": 44716, "time": "2003-09-25T20:16:23Z", "creator": "duerst@w3.org", "creation_time": "2003-09-25T20:16:23Z", "is_private": false, "text": "Apache 2.0 currently ships with \"AddDefaultCharset iso-8859-1\" in httpd.conf.\nThis should be fixed (by commenting out or removing it, or replacing it with\nAddDefaultCharset Off) and the comment in httpd.conf should be corrected,\nfor the following reasons:\n\n1) Charset information is important, but no charset information is much\n   preferable to wrong charset information (contrary to what the comment\n   in httpd.conf says).\n\n2) Many document formats have their own internal way to specify character\n   encoding. It is often sufficient to rely on these. It is often easier,\n   for document authors and administrators, to make sure these are correct,\n   than to make sure that the served headers are correct.\n\n3) In most parts of the world, including Europe and the Americas (because of\n   windows-1252), there is rarely any server that contains only iso-8859-1\n   documents, and there is rarely any server administrator who knows the\n   encodings of all the served documents (if s/he is even aware of character\n   encoding issues).\n\n4) Upgraders from Apache 1.3 to Apache 2.0 often overlook this setting,\n   resulting in large numbers of files served wrongly with charset=iso-8859-1,\n   and an increasing number of complaints to ISPs and Web hosters. Fixing\n   this bug would make upgrading easier and more predictible, and would\n   reduce complaints to hosters that they have difficulties to address\n   because they are not familiar with character encoding issues.\n\n5) In order to override the setting (and assuming users know how to do\n   this), users have to have FileInfo permissions for their .htaccess files.\n   httpd.conf as shipped contains an example of settings for UserDir\n   directories and similar cases where the users are allowed some\n   amount of configuration, but this is commented out. So the chance\n   is high users don't have a chance to fix the problem, even if they\n   know the correct encoding of their document and the correct way to\n   set the HTTP header.\n\n6) The oft-cited default of iso-8859-1 for HTTP is something that exists\n   on only paper, but not at all in practice. If it were observed in\n   practice, \"AddCharsetDefault iso-8859-1\" would be unnecessary.\n   Because the default is not observed, this setting is harmful.\n\n7) The comment in httpd.conf claims that this setting is a good start for\n   internationalization. This ignores the fact that many hosts already\n   contain a lot of internationalized documents.\n\nIn connection with this, the documentation for AddDefaultCharset should be\nupdated to clearly point out the potential dangers of using it (i.e.\nonly use this if you know the character encoding of the majority of\nthe documents on your server, and you know what the exceptions are and\nmake sure they are set correctly)."}, {"count": 1, "tags": [], "text": "see also bug 14513\nhttp://nagoya.apache.org/bugzilla/show_bug.cgi?id=14513", "attachment_id": null, "bug_id": 23421, "id": 44717, "time": "2003-09-25T20:19:48Z", "creator": "duerst@w3.org", "creation_time": "2003-09-25T20:19:48Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 23421, "attachment_id": null, "id": 44727, "time": "2003-09-25T23:34:06Z", "creator": "tex@i18nguy.com", "creation_time": "2003-09-25T23:34:06Z", "is_private": false, "text": "The new default value causes corruption for people upgrading to the new \nversion. The mislabeling of Windows-1252 as iso8859-1 can cause the euro symbol \nto be incorrect and result in erroneous financial transactions.\nThe misleading Apache documentation and the change to apply the default charset \ncauses subtle differences which have significant impact. It can also cause non-\nsubtle differences. The fact that web standard calls for http charset to \noverride the charset in the page, means that change will override even pages \nwith self-documenting charset (ie pages that use the meta tag). The old \nbehavior should be restored right away."}, {"count": 3, "tags": [], "text": "I'm not enough of an expert in this area to make a decision about it,\nbut the problem with simply removing this directive is that it\ncreates problems with cross-site scripting.  See:\nhttp://httpd.apache.org/info/css-security/\nand links from that page.\n\nIn fact, AddDefaultCharset was originally added to deal with these\nproblems, so simply removing it without addressing the CSS issue\nwould not be smart.\n\n(See also bug 13986 that states\nthat apache shouldn't set a default content-type by default.\nThis issue should probably be addressed along side that one.)", "attachment_id": null, "id": 44733, "creator": "slive@apache.org", "time": "2003-09-26T03:17:26Z", "bug_id": 23421, "creation_time": "2003-09-26T03:17:26Z", "is_private": false}, {"count": 4, "tags": [], "text": "OK, I think we need a clarification. We are not requesting the command AddDefaultCharset be eliminated. \nWe are requesting that its use in the default configuration to set the charset to iso 8859-1 be eliminated.\n\nAs for the security risk, the significant piece of the referenced document seems to be:\n\"In addition, web pages should explicitly set a character set to an appropriate value in all dynamically generated pages. \"\n\nWe can all agree with this. The problem is iso 8859-1 is not an appropriate value for the majority of configurations.\nThe article references that this used to be the default for some of the web standards and is no longer the case. \nIt is because it is not the best choice in the majority of cases, even in English speaking markets these days, that it is no longer the default.\nPerhaps a better compromise solution is to at least ask the administrator what the value should be during the installation and \nprovide a list of the most common encodings for them to choose from.\nOr default to UTF-8 and let people know clearly that is what you use.\n", "attachment_id": null, "id": 44734, "creator": "tex@i18nguy.com", "time": "2003-09-26T03:40:31Z", "bug_id": 23421, "creation_time": "2003-09-26T03:40:31Z", "is_private": false}, {"count": 5, "tags": [], "text": "SuSE 9.0 shipped Apache 2.0 with AddDefaultCharset utf8\n\nAs a result any other encoding mentioned in the hmtl/xhtml/xml-source sent to\nthe server was ignored.\n\nThat does not fit the behaviour of Apache talked about on the\ncross-site-scripting page; there it is told that option AddDefaultCharset is\nonly activated if any page-specific encoding is missing. \n\nA mistake in logic, of the behaviour of option AddDefaultCharset ?", "is_private": false, "id": 56865, "creator": "dietmar_temme@web.de", "time": "2004-05-05T13:51:41Z", "bug_id": 23421, "creation_time": "2004-05-05T13:51:41Z", "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 23421, "is_private": false, "id": 56880, "time": "2004-05-05T17:48:31Z", "creator": "slive@apache.org", "creation_time": "2004-05-05T17:48:31Z", "tags": [], "text": "Apache has absolutely no interest in <meta> tags inside the html.  That comment\nis talking about AddCharset and similar methods of setting the HTTP headers."}, {"count": 7, "tags": [], "text": "To Joshua Slive: Then the faulty behaviour is on the browser's side, insomuch a\nrequest is sent without an complete or appropriate header, i.e. including the\nencoding information. That was my first guess, at Mozilla.\n\nOf course it's presumed that option AddDefaultCharset only is activated if no\nencoding information is available.Or, to extend the view, if no valid/accepted\nencoding is sent in the request, given a list of encodings accepted by the server.\n\nWould that still help the CSS-problem? ", "attachment_id": null, "id": 57964, "creator": "dietmar_temme@web.de", "time": "2004-05-24T13:55:51Z", "bug_id": 23421, "creation_time": "2004-05-24T13:55:51Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 23421, "attachment_id": null, "is_private": false, "id": 57976, "time": "2004-05-24T17:58:10Z", "creator": "slive@apache.org", "creation_time": "2004-05-24T17:58:10Z", "text": "Dietmar, I can't decipher what you are trying to say.  But this is not the best\nplace to discuss it.  Please try the users@httpd or dev@httpd mailing list."}, {"count": 9, "tags": [], "bug_id": 23421, "attachment_id": null, "id": 61424, "time": "2004-08-01T08:21:45Z", "creator": "adah@sh163.net", "creation_time": "2004-08-01T08:21:45Z", "is_private": false, "text": "Is this issue still not resolved?  I am Chinese and I am strongly on the side of\nthe reporter.\n\nThe problem, I suppose, arises from a problematic standard.  AFAIK, the header\nsent from the server overrides that contained in a meta tag.  Browsers I use all\nconform to this behaviour, and sorrows of non-Western Web developers grow.  For\nChinese, we routinely use\n\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=gb2312\">\n\nto mark a page as Chinese.  And this method allows us to place an ISO-8859-1\npage on the same server/directory without worrying about server configurations.\n I even do not know now how to achieve this effect if \"AddDefaultCharset\" is\never used.\n\nSecurity is important, but I do not think setting the default charset by the\nSERVER is the right way to go.  Indeed, I think the suggestion to use a default\ncharset has caused more problems than solved (see stories below).  It is the\nserver-side SCRIPT that should take care of this.  And I do not think the\ncomment in the conf file is correct: it really does harm, because setting it\nwill PREVENT Web developer from specifying the charset in their pages, who\nshould really be responsible for such issues.\n\nBy the way, some stories.  Several times I have been called by colleagues\nbecause they cannot make Apache display Chinese characters correctly on a newly\ninstalled box.  I once translated the mission page for webstandards.org, and\nafter a site migration it no longer displayed Chinese.  After several emails the\nnon-Western pages are moved to a special server or directory and it was OK.  Now\nthe page is archived at \n\nhttp://archive.webstandards.org/mission_gb2312.html\n\nAnd it is wrong AGAIN, along with other translations like Japanese!\n\nWhat is the use of security, if it makes things inaccessible?\n\n(Not to mention that it is a wrong response for a security issue.  Even the page\nhttp://www.cert.org/tech_tips/malicious_code_mitigation.html#3\nmentions only the use of a meta tag like the gb2312 example above.)\n\nTo Dietmar:\n\nYour opinions about Accept-Charset are correct only if\n\n1) A Chinese user can set his browser to accept only GB2312;\n2) A Chinese user never need to view ISO-8859-1 pages, or the browser supports\nper-page configuration of Accept-Charset; and\n3) If \"Accept-Charset: gb2312\" is sent to the server, the server will not send\nthe default \"charset=ISO-8859-1\".\n\nI do not see any of them holds."}, {"count": 10, "attachment_id": null, "bug_id": 23421, "is_private": false, "id": 61427, "time": "2004-08-01T10:42:47Z", "creator": "nick@webthing.com", "creation_time": "2004-08-01T10:42:47Z", "tags": [], "text": "I agree that shipping with an AddDefaultCharset preset is unsatisfactory,\nand screws up users of servers with unresponsive admins.\n\nCan we simply remove it from the default config to deal with the case of authors\nhaving more clue than their sysops?  I'd be happy with that, but I'm going to\nask for review in other fora where folks have relevant expertise.\n\nActually the solution is already available to users.  There's a bunch of\nAddCharset directives in the default httpd.conf that serve precisely this\npurpose:\nAddCharset ISO-8859-1  .iso8859-1  .latin1\nAddCharset ISO-8859-2  .iso8859-2  .latin2 .cen\nAddCharset ISO-8859-3  .iso8859-3  .latin3\netc.\n\nSo a fix would be to correct errors and omissions in that list, and leave it\nto authors to control their charset using a suffix on the document name.\nOf course that's ugly, but at least it works.\n\nAlso worth noting: mod_proxy_html 2.x will parse META elements in\nHTML and XHTML documents and convert them to real HTTP headers.\nSee http://apache.webthing.com/mod_proxy_html/\n"}, {"count": 11, "tags": [], "bug_id": 23421, "is_private": false, "text": "I just wrote:\n\n> So a fix would be to correct errors and omissions in that list, and leave it\n> to authors to control their charset using a suffix on the document name.\n> Of course that's ugly, but at least it works.\n\nHmmm, I neglected to add that the ugliness goes away if that's used with \nmod_negotiation: perhaps we shold ship with multivies on by default?\nThe other crucial issue is of course to document it!", "id": 61428, "time": "2004-08-01T10:50:30Z", "creator": "nick@webthing.com", "creation_time": "2004-08-01T10:50:30Z", "attachment_id": null}, {"count": 12, "tags": [], "bug_id": 23421, "attachment_id": null, "id": 62534, "time": "2004-08-26T12:30:29Z", "creator": "nick@webthing.com", "creation_time": "2004-08-26T12:30:29Z", "is_private": false, "text": "*** Bug 30860 has been marked as a duplicate of this bug. ***"}, {"attachment_id": null, "tags": [], "bug_id": 23421, "is_private": false, "count": 13, "id": 68185, "time": "2004-12-09T15:16:39Z", "creator": "sebastiaan@kantoor.nederhost.nl", "creation_time": "2004-12-09T15:16:39Z", "text": "In addition to the principal reasons given earlier there is also a pragmatic\nreason not to use AddDefaultCharset in the default httpd.conf. Sending the\ncharset declaration triggers an obscure bug in MSIE with multipart forms, as\ndocumented at\nhttp://www.interactivetools.com/forum/gforum.cgi?post=34345;sb=post_latest_reply;so=ASC;forum_view=forum_view_collapsed\n(at the bottom).\n\nI know that Microsoft should fix their browser but I spend a lot of time today\ndebugging an old script that didn't work after upgrading to Apache 2 because of\nthis. I think the right thing is not to trigger bugs in a product that is still\nused by so many users by shipping a httpd.conf that contains this as a default."}, {"count": 14, "tags": [], "bug_id": 23421, "attachment_id": null, "id": 68224, "time": "2004-12-10T05:53:41Z", "creator": "duerst@w3.org", "creation_time": "2004-12-10T05:53:41Z", "is_private": false, "text": "I'm surprised that this bug is still around. The only justification for that\nthat I was able to find in the record is the pointer to the Client Side\nScripting (CSS) issue. However, this is based on a shallow understanding\nof CSS. In order to avoid CSS, just setting whatever character encoding\nis not good enough. A solution requires that the client side gets the\nright character encoding. Of course, declaring iso-8859-1 as a default\ndoesn't work for a huge amount of Web pages. So this default should be\nremoved as quickly as possible, and the documentation for CSS should be\nupdated to make more clear that it's not \"declare an encoding\" but\n\"declare the right encoding\" that is important (also for other reasons\nthan just security).\n\nI can easily provide more information (e.g. a page that shows how use\nof the wrong encoding, such as declaring a page as iso-8859-1 that\nisn't iso-8859-1 can lead to attacks) if contacted directly."}, {"count": 15, "tags": [], "bug_id": 23421, "attachment_id": null, "id": 68233, "time": "2004-12-10T11:23:29Z", "creator": "fielding@apache.org", "creation_time": "2004-12-10T11:23:29Z", "is_private": false, "text": "This was supposed to be fixed a long time ago.  It was for 1.3.\nI am verifying with the group and will remove it from the default\nconfig if there are no objections."}, {"count": 16, "attachment_id": null, "bug_id": 23421, "is_private": false, "id": 68304, "time": "2004-12-11T07:20:16Z", "creator": "fielding@apache.org", "creation_time": "2004-12-11T07:20:16Z", "tags": [], "text": "Fixed in HEAD (2.1.x), may be backported later to 2.0.x.\n\nsvn rev 111582"}, {"count": 17, "tags": [], "bug_id": 23421, "attachment_id": null, "id": 69486, "time": "2005-01-10T16:42:18Z", "creator": "jorton@redhat.com", "creation_time": "2005-01-10T16:42:18Z", "is_private": false, "text": "*** Bug 33028 has been marked as a duplicate of this bug. ***"}]