[{"count": 0, "tags": [], "text": "Here are the steps to duplicate the problem.\n\n1. Install Tomcat 3.2.1 as an in-proc servlet runner on Windows 2000 server \n(IIS 5.0). Add ISAPI filter, isapi_redirect.dll, to Default Web Site using IIS \nconsole.\n\n2. Set Authentication method as Basic Authentication in IIS console for Default \nWeb Site, so that a user name and password are required when user accesses any \nweb page in the Default Web Site.\n\n3. Install a servlet into tomcat webapps directory, just like examples.\n\n4. Start tomcat.\n\n5. Type \"http://hostname/examples/servlet/HelloWorldExample\" without quotation \nmark in IE on a Windows NT4 workstation. \n\nUser is not asked for entering user name and password. In another word, IIS \nBasic authentication is bypassed. \n\nThis behavior is not expected by administrator because administrator thinks web \nserver's authentication is on and user should be asked to enter user name and \npassword.\n\nThe problem is that Tomcat ISAPI filter, jk_isapi_plugin.c, registers \nSF_NOTIFY_PREPROC_HEADERS with IIS. According to Microsoft document, this \nnotification is sent to ISAPI filter before IIS does client authentication. It \nis NICE that Tomcat lets IIS handle the client authentication before taking \nover the control if the URL is in Tomcat's name space. IIS 5.0 supports \nSF_NOTIFY_AUTH_COMPLETE. If jk_isapi_plugin.c registers SF_NOTIFY_AUTH_COMPLETE \ninstead of SF_NOTIFY_PREPROC_HEADERS, IIS will take care of client \nauthentication and Tomcat behaves the same as usual after client is \nauthenticated by IIS. I tried this modification on my test IIS server. It works \nas I expected. \n\nI recommend this fix so that Tomcat works with IIS and IIS client \nauthentication method can be leveraged.", "attachment_id": null, "bug_id": 2342, "id": 3283, "time": "2001-06-26T16:03:36Z", "creator": "sharonx@wrq.com", "creation_time": "2001-06-26T16:03:36Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 2342, "attachment_id": 269, "text": "Created attachment 269\nThis patch fixed the bug for IIS 5.0.", "id": 3324, "time": "2001-06-28T08:13:44Z", "creator": "sharonx@wrq.com", "creation_time": "2001-06-28T08:13:44Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 2342, "attachment_id": null, "id": 6132, "time": "2001-09-27T12:55:11Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-09-27T12:55:11Z", "is_private": false, "text": "I'm don't think this is right - the servlet spec is clear about how and when should a page require authentication: this is supposed to be defined in web.xml. \n\nI agree we need to integrate the authentication mechanism, to allow tomcat to use IIS services for authentication - but under the control of web.xml. "}, {"count": 3, "tags": [], "bug_id": 2342, "attachment_id": null, "is_private": false, "id": 6680, "time": "2001-10-13T18:47:02Z", "creator": "mike@ds808.net", "creation_time": "2001-10-13T18:47:02Z", "text": "1. Does apache server authenticate before routing request to tomcat?\n\n2. SF_NOTIFY_AUTH_COMPLETE was introduced in iis5.  Fixing this would probably \nbreak iis4?  Has anyone tested this?\n\nSF_NOTIFY_AUTH_COMPLETE: This was a new notification to IIS 5.0 that offers \nfunctionality similar to SF_NOTIFY_PREPROC_HEADERS. Specifically, this \nnotification allows you to view or modify the method, URL, version, or headers \nsent from the client. The key difference between this notification and preproc \nheaders is that this notification fires after the client’s identity has been \nnegotiated with the client. Because of the timing of this notification, the \nAUTH_USER server variable can be used to reliably obtain the identity of the \nuser. Also, functionality is provided to retrieve a copy of the token that IIS \nwill impersonate when processing the request. \n"}, {"count": 4, "tags": [], "creator": "nacho@apache.org", "attachment_id": null, "id": 13167, "time": "2002-04-10T11:32:34Z", "bug_id": 2342, "creation_time": "2002-04-10T11:32:34Z", "is_private": false, "text": "Opened to change resolution and add some more comments.."}, {"count": 5, "tags": [], "text": "Fixed in jakarta-tomcat-connectors/jk/native ( mod_jk1 ), you will need to put \ntomcatAuthentication=\"false\" in the ajp13 connector line, and activate IIS \nsecurity, you will need too to have defined the same user name, in the web.xml \nand in IIS security..", "is_private": false, "bug_id": 2342, "id": 13168, "time": "2002-04-10T11:35:15Z", "creator": "nacho@apache.org", "creation_time": "2002-04-10T11:35:15Z", "attachment_id": null}]