[{"count": 0, "tags": [], "creator": "dmh@tibco.com", "text": "The infamous tab bug mentioned in the introduction has been fixed for years in\nmodern makes, and in any case, it's inessential.\n\nMake's inherent evils include\n\tIt's almost impossible to tell what rule is going to apply\n\tIt encourages adding obscure pseudo-dependencies that exist for technical reasons\nonly\n\tMacro expansion rules are hairy as hell and vary from flavor to flavor.  In\nparticular, it's almost impossible to tell what's going to be expanded when\n\tUnderlying much of this is a poor distinction between declarative and imperative\nprogramming.  Specifying dependencies is meant to be delarative, but the actions\nto be taken are inherently imperative.\n\tThere are the usual problems with evolving yet another ad-hoc turing complete\nlanguage over years -- see also the shells, awk, visual basic . . .\n\tActions are inherently platform dependent, while dependencies are less so,\nleading to mammoth sets of rules in cross-platform environments.  The problem\nhere is that people tend to try to solve all cross-platform problems with make,\ninstead of abstracting build mechanisms and leaving dependencies to make.  Which\nbrings us to the most fundamental flaw . . .\n\tMake doesn't even handle it's core task of tracking dependencies that well.  Or\nat all.  You have to tell it explicitly that module A depends on module B, then\nkeep that information in sync with the code.  Some modern makes fix this, at\nleast on an ad hoc basis, but the sad, evil fact is that for years and years\nmake did nothing of the sort.  The best you could do was run some other tool to\ngenerate a makefile, and hope make knew enough to take the changed makefile into\naccount (which it usually didn't).  This in turn led programmers to believe that\ntracking dependencies was a hard problem, and perversely that since it was a\nhard problem, you needed a \"powerful tool\" like make to help you.\n\nIf you condense any of the above, or your own opinions about make, into a couple\nof polite but scathing paragraphs, I think the introduction will be the better\nfor it.", "id": 3299, "time": "2001-06-27T08:46:47Z", "bug_id": 2356, "creation_time": "2001-06-27T08:46:47Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "holtdl@yahoo.com", "text": "The reasons in the intro are adequate, no real need to get overly into it.", "id": 12584, "time": "2002-03-31T21:32:35Z", "bug_id": 2356, "creation_time": "2002-03-31T21:32:35Z", "is_private": false, "attachment_id": null}]