[{"count": 0, "tags": [], "bug_id": 23613, "is_private": false, "text": "We are developing Documment management application (lot of money is on table).\nAnd when we connecto to our server using IE 6.0.26 everything works fine.\nBut on machines using IE 6.0.28, IE kills all our session variables.\nWe are using iframes in project. I even try to write a simple application \nwithout iframes which just set session variable and then try to read them with \nother servlet, and when I do that it does the same thing (HTTP status 500 \nbecause our session variable is Null in second (receaving) servlet).\nI would send you application but it is based on ORACLE database where I can't\ngrant you any access, sorry.\nIf I don't find a soluttion for that problem until 8th october I'll have to \nchange web server technology.", "id": 45116, "time": "2003-10-06T06:24:51Z", "creator": "kbicanic@ekonerg.hr", "creation_time": "2003-10-06T06:24:51Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "I don't know what led you to believe that Jakarta were a consulting organization\nwith a 48 hours response time. BZ is made to report demonstrable bugs (ie, you\nneed to explain clearly where the problem is if it's simple, or produce a small\ntest case). Here, your problem may have a number of causes (IE bug, bug in your\ncode, bug in Tomcat). You should post on tomcat-user to get insight from other\nusers. Maybe they would have clues about your particular version of IE (you need\nto give the last numbers in the version string, the first are useful also, but\nare common between a lot of minor versions).\n\nBTW, this kind of argument is really lame and better suited to \"pressure\"\nproprietary software developers: \"If I don't find a soluttion for that problem\nuntil 8th october I'll have to change web server technology\". I think I don't\ncare. It's not like you're writing me a check, otherwise, right ? ;-)", "is_private": false, "id": 45117, "creator": "remm@apache.org", "time": "2003-10-06T06:38:02Z", "bug_id": 23613, "creation_time": "2003-10-06T06:38:02Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "william.barker@wilshire.com", "attachment_id": null, "is_private": false, "id": 45118, "time": "2003-10-06T07:02:13Z", "bug_id": 23613, "creation_time": "2003-10-06T07:02:13Z", "text": "I'm very sorry that you have choosen to leave Tomcat for another web-app \ntechnology.\n\nBefore you go, I'd like to add some remarks.  It seems that your problems are \nrelated to MSIE's Cookie policies.  It is relativly easy to write a Servlet \nthat will confirm to MSIE that your site conforms to what they want you to \nsay.  Alterntivly, look into 'jakarta-struts' (or alternatives) to allow your \nwebapp to continue to function without Cookies."}, {"attachment_id": null, "tags": [], "creator": "william.barker@wilshire.com", "is_private": false, "count": 3, "id": 45198, "time": "2003-10-07T06:51:08Z", "bug_id": 23613, "creation_time": "2003-10-07T06:51:08Z", "text": "*** Bug 23643 has been marked as a duplicate of this bug. ***"}]