[{"count": 0, "attachment_id": null, "bug_id": 23649, "text": "Dear All,\n\nI am using Ant along with Junit for running test cases. I use a parser that\nwould get the results from the xml format into a html format.So I opt for the\nXMLJunitFormater for reporting.\n\nI am facing a queer problem here. The results in the xml , stores values of all\nthe properties. This entry includes, the classpath for the particular anttask.\nSince each test case of Junit is run as individual, this reproduces the\nclasspath for all the number of test cases. Such entries, make the column size\nto be of several thousands of columns affecting the readabilty.And more over\nthese values are going on repeated.\n\nSuch a property display would be felt necessary in very rare cases I believe.I\ncould easily resolve the problem, by doing a work around. Currently by\ncommenting the line where the properties are written to the xml, in the\nXMLJUnitFormatter file, I could prevent the entries.\n\nThe problem is that such a commenting becomes necessary ,whenever there is a new\nversion.(maintenance) I wish there be a method that helps the user to point out\nif the properties are to be reported or not.\n\nThere can be a boolean like setPropertyDisplay(true/false).\n\nI would like you to provide such a method or any other solution if that would\nnot be feasible.Please do get back for clarifications and kindly respond.\n\nIf the letter reflects misunderstanding of the concept or methodology, kindlydo\nrectify.\n\nThank you,\nRegards,\nSuresh C Nair", "id": 45207, "time": "2003-10-07T11:50:12Z", "creator": "sureshcnair@yahoo.com", "creation_time": "2003-10-07T11:50:12Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 23649, "is_private": false, "count": 1, "id": 45257, "time": "2003-10-08T18:48:39Z", "creator": "gus.heck@olin.edu", "creation_time": "2003-10-08T18:48:39Z", "text": "Perhaps you should just style sheet the xml directly rather than convert to\nhtml? You could use display:none to hide anything that way. (no, I havn't done\nthis, with the XMLJunitFormatter output, but it should be possible at least in\nprinciple).\n\nThen there is the possiblity that your conversion to HTML could be tweaked or\npre-processed with another conversion to omit the undesireables along the way.\nWhile this could be solved in ant, it also could be solved on the outside. Just\ncause we give you the data doesn't mean you have to use it..."}, {"attachment_id": null, "tags": [], "bug_id": 23649, "is_private": false, "count": 2, "id": 45258, "time": "2003-10-08T18:56:01Z", "creator": "ddevienne@lgc.com", "creation_time": "2003-10-08T18:56:01Z", "text": "Franckly, I've also wondered about the properties being repeated for every \nsingle test in the XML output. It's quite heavyweight, and an attribute to not \ngenerate this in the XML at all seems entirely reasonnable to me, and would \nspeed up both the generation of the XML, and the transformation to HTML later \non. Having these properties once in the XML would be fine, but for every single \ntest, that's just a waste IMHO. --DD"}]