[{"count": 0, "tags": [], "bug_id": 2366, "text": "I'd like to be able to fork javac tasks into a new process. I've had some\ntrouble with ant's xml libraries conflicting with older versions that my\nprojects use. People using newer (or just plain different) versions of the .jar\nfiles ant depends on may have trouble compiling. The easiest way to solve the\nproblem is to fork off a new javac process. The best way to do that consistently\nis with a fork attribute on javac.\n\nThanks,\n\nDave", "id": 3303, "time": "2001-06-27T11:58:52Z", "creator": "dfw1@cornell.edu", "creation_time": "2001-06-27T11:58:52Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 2366, "is_private": false, "text": "I think includeAntRuntime=\"false\" would do what you are asking for without forking.\n\nAnyway I would like an option like this as well; I would not suggest a 'fork'\nattribute but rather a ${build.compiler} that could state that an external Javac\nwas desired (and the path to it). You may wish to use a different version of\nJavac than your regular JDK has. Or you may just wish to run it externally.\nAnt's wrapper for Javac does not clean up static storage in the Javac code and\nit is possible for weird file lock problems to happen if you delete a JAR that\nwas used in its classpath (not surely precisely how to reproduce this, but it is\nreported to happen sometimes inside NetBeans--after repeated runs of the build\nscript in the same VM). Anyway, it is safer to run it externally so it would be\nnice to have this option at least. Or you can use Jikes of course if you have\nit, which does not exhibit the problem.", "id": 3312, "time": "2001-06-28T04:36:55Z", "creator": "jesse.glick@netbeans.com", "creation_time": "2001-06-28T04:36:55Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 2366, "text": "\n\n*** This bug has been marked as a duplicate of 383 ***", "id": 3388, "time": "2001-07-04T03:11:05Z", "creator": "bodewig@apache.org", "creation_time": "2001-07-04T03:11:05Z", "is_private": false, "attachment_id": null}]