[{"count": 0, "attachment_id": null, "bug_id": 23687, "text": "[the patch described below can be downloaded from the URL\ngiven in the above URL field. Te patch is agains apache 2.0.47]\n\nWe use apache2 + mod_mem_cache as a reverse proxy for tomcat.\n(I work for a ISP that hosts +/- 30 MMbase sites (www.mmbase.org == an\nopen source CMS based on a j2ee environment.) We use tomcat as our\nservlet container)\n\nTomcat uses java session ID's (Set-Cookie: JSESSIONID=xxxx)\nas session tracking mechanism. Unfortunately the same cookies\nare used as basis for authentication (i.e. the first page you\nvisit sets a cookie. Much later one might login. This does not\nset a new cookie, but rather attaches extra rights to the already\nexisting cookie)\nWhere our customers (after much explaining) may finally understand\nthat they should set \"Cache-Control: private\" headers on private\npages to avoid them from being cached, they don't understand that\nthe \"Set-Cookie\" on the initial (public!) front page of a tomcat site\ncauses garbled sessions later on where several people may share the\nsame -cached- cookie and user X sees user Y's private pages.\n\nTo fix this I added a CacheStripCookie switch that (when set to On)\nremoves the Set-Cookie headers from cachable pages. The idea being\nthat a login page would typically have a \"Cache-Control: private\"\nheader, and only the cookie set by this page should be used.\n\nI know CacheStripCookie violates the RFC, but so does CacheIgnoreCacheControl ...\nAlso (I dare not say it) squid in reverse proxy mode does the equivalent of\n\"CacheStripCookie On\" by default. This is (I think)exactly why all our\ndevelopers are whining that we should use squid. Howver, we prefer apache for\na host of good reasons (performance, virtual hosts, memory caching without disk\ncaching to name a few), so we would be much helped if this option were added to\napache.\n\n(please please pretty please with sugar on top?)", "id": 45260, "time": "2003-10-08T21:19:02Z", "creator": "Dick.Snippe@tech.omroep.nl", "creation_time": "2003-10-08T21:19:02Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "Dick.Snippe@tech.omroep.nl", "text": "Created attachment 8500\npatch for optionally stripping Set-Cookie headers in mod_cache", "id": 45261, "attachment_id": 8500, "bug_id": 23687, "creation_time": "2003-10-08T21:20:55Z", "time": "2003-10-08T21:20:55Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 23687, "is_private": false, "id": 47821, "time": "2003-11-21T17:37:05Z", "creator": "trawick@apache.org", "creation_time": "2003-11-21T17:37:05Z", "tags": [], "text": "I'm going through the bug db to make sure patches are findable.  Please see \nhttp://httpd.apache.org/dev/patches.html\n"}, {"count": 3, "tags": [], "creator": "jerenkrantz@apache.org", "text": "Please see Bug #30399.  CacheIgnoreHeaders Set-Cookie is the preferred solution.\n\nThanks!", "id": 66892, "attachment_id": null, "bug_id": 23687, "creation_time": "2004-11-15T01:13:38Z", "time": "2004-11-15T01:13:38Z", "is_private": false}]