[{"count": 0, "tags": [], "creator": "adam.hardy@cyberspaceroad.com", "attachment_id": null, "id": 45984, "time": "2003-10-21T14:40:17Z", "bug_id": 23970, "creation_time": "2003-10-21T14:40:17Z", "is_private": false, "text": "In TC5 I believe it was decided to remove the ability to specify SSL constraints\non the FORM-based login & error pages themselves. \n\nDeveloping my app in TC4, I used this technique to encrypt the login page, and\nswitch back to HTTP immediately after. I have 3 levels of security in my web-app: \n\n1st level pages, which are public and require no security\n\n2nd level pages, where users must log in, using an encrypted login form\n\n3rd level pages, which need SSL. \n\nTo deter session-hijackers when moving from level 2 to level 3, I invalidate the\nsession and cause a new login request and only after that does the session stay\nin SSL. \n\nThis is the current paradigm for web security in e-commerce - witness eBay or\nAmazon.\n\nI believe from what I have picked up so far in the TC mailing lists, that the\nchange was done to refine the TC5 implementation of the Servlet 2.4 spec. \n\nIt creates a new security paradigm. Now only logins to pages protected by\nconstraints specifying a transport guarantee of 'confidential' will have login\nforms encrypted. A login deemed to require encryption is deemed to require\nencryption on all of its protected pages. This is a measure against\nsession-hijacking.\n\nThe adoption of this paradigm in TC5 has resulted in 2 issues for me:\n\n(1) it has broken my application security in a such a way that a redesign of the\nsecurity is necessary \n\n(2) it seems to be forcing me either to use this new paradigm (i.e. all SSL\nsessions after login), or to drop CMS entirely.\n\nI cannot find a way to protect my app with non-encrypted CMS and encrypted\nform-based authentication. \n\nCommitting additional resources to run SSL sessions is a risk I do not wish to\ntake in terms of my business strategy. I only started out on this current\nproject with so much time & money, and now the hill I have to climb seems to be\ngetting steeper.\n\nWhat I would like, and I expect you will see others ask for it too, is an option\nto set encryption on the login form  whatever the transport guarantee for the\nprotected page, or of course the re-instatement of the use of constraints on the\nlogin pages."}, {"count": 1, "tags": [], "bug_id": 23970, "text": "Another alternative solution would be to allow the form-based authentication\nlogin page to submit to https://mydomain:8443/mycontext/j_security_check", "id": 45985, "time": "2003-10-21T14:48:18Z", "creator": "adam.hardy@cyberspaceroad.com", "creation_time": "2003-10-21T14:48:18Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 23970, "text": "If you read the spec, you'll see the word \"forward\" being metioned in\nconjunction with the login page. Hence, it doesn't have to go through the\nconstraints checks.\nThis will not be implemented, as most people considered using a sendRedirect for\nFORM handling was evil.\n\nThere are two areas which have different behavior in TC 5:\n- welcome files redirection\n- FORM redirection\nSince those are important changes, they weren't ported to Tomcat 4.1.x.", "id": 46153, "attachment_id": null, "creator": "remm@apache.org", "creation_time": "2003-10-23T17:32:50Z", "time": "2003-10-23T17:32:50Z", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 23970, "is_private": false, "id": 46275, "time": "2003-10-25T16:25:47Z", "creator": "adam.hardy@cyberspaceroad.com", "creation_time": "2003-10-25T16:25:47Z", "tags": [], "text": "All I want to do is encrypt a login form but not the pages the\nsecurity-constraint protects.\n\nIt's all well and good that the spec says such-and-such, but what you are\nignoring is that fact that this change in TC5 is effectively taking away a\nlarge, significant piece functionality from a large, significant percentage of\nthe people out there using TC. \n\nThere are probably hundreds if not thousands of TC4 users out there doing what I\nwant to do in TC5 but can't.\n\nIt also implies that you (or rather the people who wrote the spec) expect that\nother application server providers, i.e. IBM and BEA etc, will be willing to do\nthis to their users too, which is obviously a false assumption. \n\n"}]