[{"count": 0, "attachment_id": null, "bug_id": 23982, "is_private": false, "id": 46004, "time": "2003-10-21T19:55:12Z", "creator": "jbilek@email.cz", "creation_time": "2003-10-21T19:55:12Z", "tags": [], "text": "There is a bug (or incompatibility) in function apr_socket_sendfile defined in \nsendrecv.c which is part of APR project.\nAfter you call function TransmitFile than you try to wait for the completion \nusing WaitForSingleObject, where the socket handle is used as a wait_object. \nThis is wrong. There can be installed Winsock LSP (Layered Service Provider) on \nthe system, which intercepts communication between application (Apache) and \nwinsock driver. Socket handles returned from the LSP are not compatible \nwith \"normal\" system handles. To be fully compatible with Winsock 2.0 you have \nto create new wait_handle and use it with WaitForSingleObject. You have already \ndid this job - define WAIT_FOR_EVENT somewhere in the sendrecv.c.\nBut there is another incompatibility in the apr_socket_sendfile. When the \nWaitForSingleObject released then you try to read operation status using \nfunction GetOverlappedResult. But Winsock 2.0 compatible application must use \nWinSock 2.0 library function WSAGetOverlappedResult. Note that first argument \nmust be the socket not the wait_handle (as it is in current source code \nversion).\nThis problem was discovered when i tested program called NetLimiter \n(www.netlimiter.com), which uses Winsock 2.0 LSP. TransmitFile is available \nonly on Win2k and newer Windows system so this problem apears only on these \nsystems.\nThe result of this incompatibility causes that Apache does not work properly - \nwww pages showed are without pictures etc.. After i recompiled the APR project \nwith the changes i've mentioned, the problems disapeared."}, {"count": 1, "tags": [], "bug_id": 23982, "attachment_id": null, "id": 47274, "time": "2003-11-12T21:57:25Z", "creator": "nd@perlig.de", "creation_time": "2003-11-12T21:57:25Z", "is_private": false, "text": "Change product"}, {"count": 2, "tags": [], "bug_id": 23982, "attachment_id": null, "id": 59625, "time": "2004-06-20T18:07:20Z", "creator": "trawick@apache.org", "creation_time": "2004-06-20T18:07:20Z", "is_private": false, "text": "Do you have a patch for these changes which you can post?"}, {"count": 3, "tags": [], "text": "Im able to make a patch (in couple of days), but i don't know how to add it to \nthe Apache project? I never did such things. Can you give any advise? WWW Link \nto page with such info would be enough. Thanks.", "is_private": false, "bug_id": 23982, "id": 59834, "time": "2004-06-24T11:36:20Z", "creator": "jbilek@email.cz", "creation_time": "2004-06-24T11:36:20Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 23982, "attachment_id": null, "id": 59836, "time": "2004-06-24T12:06:46Z", "creator": "trawick@apache.org", "creation_time": "2004-06-24T12:06:46Z", "is_private": false, "text": "There is information at\n\nhttp://httpd.apache.org/dev/patches.html\n\non how to create the patch file.  Just attach it to this PR.  Thanks!\n\n(removing me as cc: since I see PR updates automatically)\n"}, {"attachment_id": null, "tags": [], "bug_id": 23982, "is_private": false, "count": 5, "id": 60936, "time": "2004-07-21T21:39:38Z", "creator": "stoddard@apache.org", "creation_time": "2004-07-21T21:39:38Z", "text": "Fixed in APR 0.9.5 and APR 1.1"}]