[{"count": 0, "tags": [], "bug_id": 2400, "attachment_id": null, "text": "We have three virtual machines running tomcat: one production running many \nvirtual host, one dedicated to a particular host, and another dedicated to \nwww.cuautolease.com, which has many virtual host, but all referring to the \nsame root.\n\nAt some point in time, back when I was running 3.1, the virtual machine \nstarted locking-up; at least it stopped responding to java server page \nrequest.  I upgraded to 3.2.2, but the problem remained.  I then began \nsplitting out the virtual host, to try to isolate the problem to a particular \nhost.\n\nThe problem followed www.cuautolease.com and its virtual host.  For example, \nredfcu.cuautolease.com, edco.cuautolease.com are virtual host running in the \nvirtual machine, but all point back to the same root directory and serve up \nthe same information (P.S., It would be nice if the host= parameter allowed \nfor more than one).\n\nI have to stop tomcat for this configuration then restart it.  It will run for \nsome period of time then hang up.  I can't seem to determine how long it takes \nto hang, but typically not more than a couple of hours.  I did get hit by a \nspider the other day on these sites and it blew tomcat out of the water; major \nlock-up.", "id": 3344, "time": "2001-06-29T10:28:53Z", "creator": "catkins@spcmg.com", "creation_time": "2001-06-29T10:28:53Z", "is_private": false}, {"count": 1, "tags": [], "creator": "cmanolache@yahoo.com", "attachment_id": null, "id": 4501, "time": "2001-08-11T19:25:58Z", "bug_id": 2400, "creation_time": "2001-08-11T19:25:58Z", "is_private": false, "text": "This is pretty serious. About the host config, you can now use wildcard ( in\n3.3). Please try again with tomcat3.3(Beta1 or later ). If the problem is \nstill there, we need your help to reproduce it. Try \"ab\" ( apache benchmark )\nand send few hundred requests, see if you can lock it. Try to find a pattern. \nAre you using Apache + Tomcat ? What happens if you telnet to 8080 ( or whatever \nport you are running tomcat ) ? \n\nHanging is not normal, I personally doubt it has anything to do with virtual\nhosting ( there is nothing special in that, we just do a lookup by the host name\nto find the right mapping ). So I would bet it's related with some of the pages,\nor it may be something similar. \n\nYou could also try to get a dump ( sending a SIGINT if I remember corectly ), or \nstart java with debugging enabled and then attach from a remote debugger ( not\neasy to set up, but it's worth knowing how to do that - it'll help you a lot in\nfuture ). If you can do that, please send a dump so we can figure out where it\nhungs."}, {"count": 2, "tags": [], "bug_id": 2400, "attachment_id": null, "text": "Reopen to change resolution", "id": 6959, "time": "2001-10-21T18:42:12Z", "creator": "Larry.Isaacs@sas.com", "creation_time": "2001-10-21T18:42:12Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 2400, "text": "Since there isn't enough information to make a diagnosis, I'm resolving the\nbug as \"INVALID\".  Please try Tomcat 3.3 and open a new bug if the problem\nstill exists.  More detailed information will be necessary, though, if we are\nto track down the cause of a problem like this.", "id": 6960, "time": "2001-10-21T18:45:56Z", "creator": "Larry.Isaacs@sas.com", "creation_time": "2001-10-21T18:45:56Z", "is_private": false, "attachment_id": null}]