[{"count": 0, "tags": [], "bug_id": 24071, "attachment_id": null, "id": 46151, "creation_time": "2003-10-23T17:05:29Z", "time": "2003-10-23T17:05:29Z", "creator": "mjmoore@strong.com", "text": "I am using the HSSFSheet class as well as the HSSFPrintSetup class to set some \npage setup properties for printing.  The properties I am trying to set are in \nthe scaling section of the page setup form.  The second radio button of the \nscaling section is the \"Fit to\" radio button.  According to the java doc, I \nshould be able to select that radio button and set the width of pages to fit to \nand height of pages to fit to using the HSSFPrintSetup class's methods of \nsetFitWidth and setFitHeight.  \n\nFor example:\n\n        this.sheet.getPrintSetup().setFitWidth((short) 1);\n        this.sheet.getPrintSetup().setFitHeight((short) 26);\n\nsets the values in the Width and Height properties of the scaling section, but \nit does not select the \"Fit To\" radio button, which is required to use these \nvalues.  \n\nUpon further investigation, I found that he setScale method of the \nHSSFPrintSetup class selects the \"Fit To\" radio button when used alone, but \nwhen used in conjuction with the setHeight and setWidth methods, selects \nthe \"Adjust To\" radio button in the scaling section.\n\nFor Example:\n this.sheet.getPrintSetup().setScale((short) 1);\n -Sets the \"Fit To\" radio button and sets the width and height values to 1.\n  this.sheet.getPrintSetup().setScale((short) 1);\n  this.sheet.getPrintSetup().setFitWidth((short) 1);\n  this.sheet.getPrintSetup().setFitHeight((short) 26);\n -Selects the \"Adjust To\" option button and sets the value to 1, but sets the \nwidth and height values of the \"Fit to\" radio to the correct values of 1 and \n26.  \n\nHow can I set the values of the \"Fit to\" radio button as well as set the values \nto what I need?", "is_private": false}, {"count": 1, "tags": [], "creator": "slaubach@apache.org", "attachment_id": null, "id": 46152, "time": "2003-10-23T17:17:06Z", "bug_id": 24071, "creation_time": "2003-10-23T17:17:06Z", "is_private": false, "text": "If you look at the documentation at http://jakarta.apache.org/poi/hssf/quick-\nguide.html#PrintArea you must also call sheet.setAutobreaks(true);\n\nBTW, I'm renaming the header to Fit To"}]