[{"count": 0, "tags": [], "bug_id": 24110, "text": "After using ANT to execute a build script with over 30 Starteam targets \n(stcheckout, stlabel) Starteam becomes very slow.  I believe this may be a case \nof not calling a actual server disconnect through the Starteam API.  See email \ndiscussion below for more details.\n\nRoss Gibb\nNakina Systems\nross (^at*) nakinasystems d0t com\n\n\nOK, thanks, Ross.  Please file a bugzilla report on this issue and I\npromise I'll handle it.  Please append this email thread as an\nattachment to the bug report.\n\nI will put connection closing logic into each ant call.  Without looking\nclosely into it, I can see no reason not to as it's just basic\nconnection \"hygiene\".  I won't be able to test whether it solves your\nproblem, but you can be the arbiter of that.\n\nFair enough?\n\nSteve Cohen\nSr. Software Engineer\nSportvision, Inc. \nscohenATSportvisionDOTcom\n\n-----Original Message-----\nFrom: Ross Gibb [mailto:ross@nakinasystems.com] \nSent: Friday, October 24, 2003 9:43 AM\nTo: Ant Developers List\nSubject: RE: Starteam connect/disconnect\n\n\nHi,\n\nThe Starteam server exists on a Windows 2000 box using  Microsoft Access\nas the database, 1 Gig of memory, 2GHz processor.  Before you role your\neyes and tell me to start using a real database understand that at the\ntime it was all I could afford.  Furthermore, I have asked Borland\nspecifically whether my server configuration and the number of users I\nsupport would put load on the server slowing it down, they responded\nthat everything should work with good performance.  Also, when I have\nbeen experiencing slow performance I have gone to my server to see if\nthe processor is maxed out or it is short of memory, each time the\nserver has been fine.  As far as running the ANT scripts, I have been\nusing both Windows and Solaris with various graphical front ends\n(Antelope, and through Eclipse).  When I started having these problems I\nhave switched to ANT command line in hopes it was a problem with one of\nthe GUI tools.  Even ANT command line produces this problem.\n\nThe exact actions that cause this problem are as follows.  Assume I have\njust rebooted the server and there are no connections to it.  I start my\nbuild script from Solaris using ANT command line.  The build script uses\napprox 30 Starteam ANT task calls (stcheckout stlabel only).  As the\nbuild script executes, all the Starteam tasks are fast, the 30th call is\nas fast as the first.  The build script finishes.  After the build\nfinishes if I try and use the Starteam GUI to check out code it is\nextremely slow.  If I were to run another build script all the Starteam\nANT tasks (stcheckout, stlabel) are extremely slow.  I wait some amount\nof time (I do not know the exact time but it is around 15 minutes) and\neveryhing is back to normal, Starteam GUI is fast again, if I run\nanother build it will be fast again.  When I first started my build\nscript it was small, around 5 calls to Starteam ANT tasks, I never had\nthese problems when there was a small amount of Starteam targets in the\nscript.  If I run a script that has 5 Starteam targets the server does\nNOT slow down after.  I have run netstat on the Starteam server when the\nbuild is running and there seems to be a new connection to the build\nclient for every Starteam target called.  These connections are visible\nthrough netstat until the build ends, when the build is over the\nconnections are no longer visible using netstat.  Finally, if I restart\nthe Starteam server when it is in a slow state when it comes back up\neverything is fine.\n\nThanks for the help.\n\nRoss\n\n-----Original Message-----\nFrom: Steve Cohen [mailto:SCohen@sportvision.com]\nSent: Friday, October 24, 2003 9:54 AM\nTo: Ant Developers List\nSubject: RE: Starteam connect/disconnect\n\n\nHmm, I have never noticed this.  While what you say certainly sounds\nlogical (clean up after yourself, basically, as you must do with\ndatabase connections, etc.) I have never experienced it myself.  I can\ncertainly take a look at putting connection-closing logic into these\ntasks, especially as the connection is not reused between task\ninvocations.\n\nWhat client and server environments are you doing this in?\n\nSteve Cohen\nSr. Software Engineer\nSportvision, Inc. \nscohenATSportvisionDOTcom\n\n-----Original Message-----\nFrom: Ross Gibb [mailto:ross@nakinasystems.com] \nSent: Friday, October 24, 2003 7:54 AM\nTo: dev@ant.apache.org\nSubject: Starteam connect/disconnect\n\n\nHi,\n\nI am using ANT with Starteam and having some troubles.  Right now my\nbuild script makes around 30 separate calls to Starteam targets\n(stcheckout, stlabel exclusively).  When the build is finished Starteam\nseems to get into a weird state where everything is extremely slow (i.e.\nusing the Starteam gui to checkin or checkout code is really slow).  The\nslowness eventually goes away, some sort of timeout I am guessing.  I\ntried to help myself and started poking around the ANT source code to\nsee how the Starteam API is used.  I think I found the call to the\nStarteam API that connects to the server, it is:\n\nIn class org.apache.tools.ant.taskdefs.optional.starteam.StarTeamTask\n\nThe function is:\n\n /**\n     * All subclasses will call on this method to open the view needed\nfor\n     * processing.  This method also saves a reference to the\n     * <code>Server</code> that may be accessed for information at\nvarious\n     * points in the process.\n     *\n     * @return the <code>View</code> that will be used for processing.\n     * @see #createSnapshotView(View)\n     * @see #getServer()\n     */\n    protected View openView() throws BuildException {\n\n        logStarteamVersion();\n        View view = null;\n        try {\n            view = StarTeamFinder.openView(getViewURL());\n        } catch (Exception e) {\n            throw new BuildException(\n                \"Failed to connect to \" + getURL(), e);\n        }\n\n        if (null == view) {\n            throw new BuildException(\"Cannot find view\" + getURL() +\n                    \" in repository()\");\n        }\n\n        View snapshot = createSnapshotView(view);\n        this.server = snapshot.getServer();\n        return snapshot;\n    }\n\n\nYou can see from the comments that this code returns a Starteam view\n(and keeps a connection to the server) to the caller.  My question is,\ndoes this connection have to be closed after you are finished using\nit????  I have found no code in the ANT source that actually disconnects\n( if there is some please point me to it).  I have been in contact with\nthe Borland support who claim there is disconnect method that can be\ncalled to disconnect from the server (I am not sure it applies in this\ncase).  I have requested the Starteam API docs from Borland but they\nseem to be ignoring me.  Hoping someone here would know.\n\nRoss", "id": 46258, "time": "2003-10-24T17:59:41Z", "creator": "ross@nakinasystems.com", "creation_time": "2003-10-24T17:59:41Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "Created attachment 8735\npatch closes connections to StarTeam server after completion of all StarTeam tasks.", "bug_id": 24110, "is_private": false, "id": 46272, "time": "2003-10-25T14:48:32Z", "creator": "scohen@apache.org", "creation_time": "2003-10-25T14:48:32Z", "tags": [], "attachment_id": 8735}, {"count": 2, "tags": [], "bug_id": 24110, "text": "Patch submitted to resolve this problem.  While I am completely confident that\nthis patch is safe, could Mr. Ross Gibb please verify that it actually helps\nsolve his problem?  Thanks, Mr. Gibb.", "id": 46273, "time": "2003-10-25T14:51:35Z", "creator": "scohen@apache.org", "creation_time": "2003-10-25T14:51:35Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 24110, "text": "One more thing - if you run ant under verbose or debug mode (ant -v or ant -d)\nyou should now see log messages at the points where the connection is made and\nbroken.\nYou will have to actually build this version of ant until this patch makes it\ninto a released version.  I have targeted it for 1.6.", "id": 46274, "time": "2003-10-25T14:56:45Z", "creator": "scohen@apache.org", "creation_time": "2003-10-25T14:56:45Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "antoine@apache.org", "text": "Patches submitted in both the 1.6 and the HEAD branches.", "count": 4, "id": 46363, "time": "2003-10-28T10:02:41Z", "bug_id": 24110, "creation_time": "2003-10-28T10:02:41Z", "is_private": false}, {"count": 5, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "text": "Thanks Ross and Steve (for reporting the problem and proposing a solution).\n\nCheers,\n\nAntoine", "id": 46365, "time": "2003-10-28T10:38:10Z", "bug_id": 24110, "creation_time": "2003-10-28T10:38:10Z", "is_private": false}]