[{"count": 0, "tags": [], "bug_id": 24238, "attachment_id": null, "text": "JVM: 1.4.2_01.  Tomcat running standalone (no web server).\n\nI have tomcat installed as a Windows service.  The problem is that it takes over\n1 minute to stop the Tomcat service.  Here is an extract from stdout.log taken\nwhen a service restart was requested:\n\n30/10/2003 16:15:30 org.apache.catalina.logger.LoggerBase stop\nINFO: unregistering logger Catalina:type=Logger\n30/10/2003 16:16:36 org.apache.coyote.http11.Http11Protocol init\nINFO: Initializing Coyote HTTP/1.1 on port 8080\n\n\nThe entry at 16:15:30 is the final one from the tomcat shutdown sequence, and\nthe one at 16:16:36 is the first of the startup sequence.  The question is, why\nis there a gap of over a minute between these two events (there is no obvious\nactivity reported by taskmgr in either java.exe or tomcat.exe).  It is clear\nthat this time is in the shutdown sequence form what is displayed by WIndows as\nit stops the service then starts it again.  I also noticed smoething similar\nwhen runing Tomcat 5 as an application from the Dos prompt.  After shutdown the\nDOS window in which Tomcat was running didn't disappear. \n\nCheers, Paul (paul@tourplan.com).", "id": 46488, "time": "2003-10-30T03:31:28Z", "creator": "paul@tourplan.com", "creation_time": "2003-10-30T03:31:28Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 24238, "attachment_id": null, "is_private": false, "id": 46500, "time": "2003-10-30T11:12:22Z", "creator": "remm@apache.org", "creation_time": "2003-10-30T11:12:22Z", "text": "I'd need to be able to reproduce that. Maybe you have a large amount of actuve\nsessions (these are persisted when you stop Tomcat) ?"}, {"count": 2, "tags": [], "bug_id": 24238, "attachment_id": null, "is_private": false, "id": 46649, "time": "2003-11-03T01:29:03Z", "creator": "paul@tourplan.com", "creation_time": "2003-11-03T01:29:03Z", "text": "This happens when I start Tomcat then immediately stop it, so it's hard to see\nthat it would be spending a lot of time persisting sessions.  Also, the fact\nthat Tomcat doesn't seem to be doing anything in this period (based on taskmgr\ninfo) and the fact that there is nothing in the logs, would tend to indicate\nthat it isn't persisting session info.  It's almost as if it sits there until a\n60 second timeout finishes (this timeout could be in Tomcat, or could be in the\nWindows services manager).  Should I be looking to turn up the logging level to\nsee whether that helps?  If so, what's the best way to do this?\n\nCheers, Paul."}]