[{"count": 0, "tags": [], "bug_id": 24358, "attachment_id": null, "text": "Typically, we do not have the ability to create dynamic file names for output \nin the log4j.properties file. Quality of service dictates that the z/OS \nenvironment will create and destroy servant regions in order to balance load.  \nSince each of these servant regions will read a single log4j.properties file, \nthey each will be logging to the same output file, as specified in the \nlog4j.properties file.  Having multiple servant regions log to the same file \nwill result in lost log statements (only on z/OS), and file contention \n(creating reduced performance for a particular servant region).  Hence, this \nappender will generate a unique file name to log to per servant region.  This \nappender also supports the PropertyConfigurator.configureAndWatch() method \nsince the dynamic file name is created the same way each time.  Therefore, any \nupdates made to the log4j.properties file will be realized, and the dynamic \nfile name will not be changed.\n\nSee attached for source code contained within cvs diff output.", "id": 46681, "time": "2003-11-03T16:58:15Z", "creator": "mike_nitso@hotmail.com", "creation_time": "2003-11-03T16:58:15Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 24358, "attachment_id": 8889, "text": "Created attachment 8889\nThe cvs diff output (as provided by WSAD 5.0)", "id": 46682, "time": "2003-11-03T16:59:21Z", "creator": "mike_nitso@hotmail.com", "creation_time": "2003-11-03T16:59:21Z", "is_private": false}, {"count": 2, "tags": [], "creator": "yoavs@computer.org", "text": "The contribution is fine, and thank you for sending it, but it doesn't make \nsense to add it now: log4j 1.3 is in alpha testing and its approach to rolling \nfile appenders is completely different.  See the RollingPolicy and related \nclasses if you're interested.  If you want to submit a new patch for log4j 1.3 \nfor Z/OS, I'd be glad to look at it and commit it.", "id": 68506, "time": "2004-12-14T20:56:40Z", "bug_id": 24358, "creation_time": "2004-12-14T20:56:40Z", "is_private": false, "attachment_id": null}]