[{"count": 0, "tags": [], "bug_id": 2439, "attachment_id": null, "text": "The ability to check on the status of threads in tomcat would be very useful,\nthe ability to drill down on individual threads even more so. I dont want\na performance trace/heap dump/etc, when you can buy JProbe - I'd like the\nkind of stats that mod_status provides in Apache. (first byte response time,\nbytes sent, url being processed, that kind of thing - from tomcats point of \nview)\n\nSee for example Bug#1798. We found this bug for ourselves by monitoring\nserver-status on the apache side; with extended status it showed us what\nURLs were coming in and we were able to prove to ourselves that there\nwere processes hanging and that the URLs they were hanging on were not\nthe cause; hence we had an issue with the connector.\n\nHowever, it proved difficult (and still proves difficult) to show that what\nhas happened is (eg) a servlet diving into an infinite loop, as opposed to\nmod_jk failing to talk to tomcat - both show up as processes in a W state on\napache.\n\nThis may be in already in catalina, but its something that is an issue\nusing 3.2.x in a production environment.", "id": 3376, "time": "2001-07-03T11:40:27Z", "creator": "Brian.Ewins@btinternet.com", "creation_time": "2001-07-03T11:40:27Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 2439, "attachment_id": null, "text": "You're wellcome to contribute such thing, it would be usefull. A ( small ) start\nis in admin/contextAdmin/threadList.jsp, I'm also interested in monitoring - but\nso far no time.", "id": 4754, "time": "2001-08-22T21:57:29Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-08-22T21:57:29Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 2439, "text": "Changed the summary. Not difficult to implement, but neither a high priority.", "id": 23768, "time": "2002-10-02T18:44:19Z", "creator": "cmanolache@yahoo.com", "creation_time": "2002-10-02T18:44:19Z", "is_private": false, "attachment_id": null}]