[{"count": 0, "tags": [], "bug_id": 244, "attachment_id": null, "is_private": false, "id": 222, "time": "2000-11-16T03:36:19Z", "creator": "dev@tomcat.apache.org", "creation_time": "2000-11-16T03:36:19Z", "text": "Dear Sirs,\r\nas part of a process of evaluating various JSP containers/app servers for a major project, we have written a small tag library that employs server-side include as part of a small framework for an application.\r\nWe have tried two flavors of include (three, actually, but the <jsp:include> tagged version works OK):\r\n\tprogrammatic using the include method contained in the RequestDispatcher class, and \r\n\tditto in the PageContext class.\r\nBoth these seem to work OK, with one, grave exception: The output coming from the included files precede any output\r\nfrom the surrounding page(!) This causes things to be presented to the end user in a somewhat undesireable way.\r\nWe have tried the code on other platforms, and the sequencing seems OK there.\r\nTomcat doesn't seem to flush the outstream from the surrounding page before output from the included files is sent to the outstream.\r\nOur question: Is this a (unintentional) feature, i.e. should we expect Tomcat and other platforms to behave like this, or is this a bug in our build of tomcat? \r\n\r\nsincerely\r\nemh@finn.no"}, {"count": 1, "tags": [], "creator": "Larry.Isaacs@sas.com", "attachment_id": null, "id": 745, "time": "2001-02-17T08:25:17Z", "bug_id": 244, "creation_time": "2001-02-17T08:25:17Z", "is_private": false, "text": "Having the output out of sequence is correct behavior for\nRequestDispatcher.include() (you must call out.flush() yourself), but is\nincorrect behavior for PageContext.include().  The javadoc for\nPageContext.include() states that:\n\n\"The current JspWriter \"out\" for this JSP is flushed as a side-effect of this\ncall, prior to processing the include.\"\n\nTomcat 3.1 does not implement this correctly.  An out.flush() is added to the\nJSP servlet instead of being incorporated inside of PageContext.include() as\nrequired by the spec.  This was corrected in Tomcat 3.2 and later.\n\nResolving this bug as \"wontfix\" for Tomcat 3.1.\nFor query purposes, mark as fixed in Tomcat 3.2 and later.\nFixed in Tomcat 3.2\nFixed in Tomcat 3.2.1\nFixed in Tomcat 3.2.2\nFixed in Tomcat 3.3\n\n"}]