[{"count": 0, "attachment_id": null, "bug_id": 24412, "text": "For various reasons, I am generating a URL for a context relative resource using\n<c:url> and storing the result in a variable.  Then I'm using that value in a\n<c:import> in an attempt to include the content of the resource in the page. \nExample:\n\n<!-- Stores \"/myContext/text.html\" in the variable textURL -->\n<c:url value=\"/text.html\" var=\"textURL\" />\n\n<!-- attempts to insert the contents of text.html in the page, but nothing\nhappens -->\n<c:import url=\"${textURL}\" />\n\nI'm pretty sure the problem is that <c:url> generates a url with a leading slash\nfollowed by the context name, when <c:import> expects URLs that start with a\nslash to be relative to the current context.  The spec says:\n\n\"In such a situation, <c:url> may be used to build a URL with query string\nparameters. <c:import> will remove any session id information if necessary (see\nSection 7.5).\"  -From section 7.4 \n\nThat seems to imply that values generated by <c:url> should be useable by <c:import>", "id": 46827, "time": "2003-11-04T22:48:10Z", "creator": "kcbaltz@yahoo.com", "creation_time": "2003-11-04T22:48:10Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 24412, "text": "As you've noticed, the output of <c:url> cannot be used \nwith <c:import> when the value specified for <c:url> is a\nrelative URL that starts with a '/'. That is because the context \npath is then prepended to the URL.\n\nAnd I agree with you that the following paragraph in the spec \nis misleading:\n  Section 7.4:\n  ...\n  It is therefore impossible for nested <c:param> actions to modify\n  the URL of the resource to be accessed, thus their illegality with\n  syntax 2. In such a situation, <c:url> may be used to build a URL\n  with query string parameters. <c:import> will remove any session id\n  information if necessary (see Section 7.5).\n\nIt should be clearly stated that using the output of <c:url> for\n<c:import> won't work for context relative URLs (that start with a '/').\n\nI've taken note and this will be fixed in the next release\nof the spec.", "id": 49018, "time": "2003-12-12T22:05:20Z", "creator": "pierre.delisle@sun.com", "creation_time": "2003-12-12T22:05:20Z", "is_private": false, "attachment_id": null}]