[{"count": 0, "tags": [], "bug_id": 24506, "is_private": false, "text": "JSP pages are a templating system which is using a meta language (the JSP\ndirectives, declarations, scriplets and expressions) and literals from the\noutput language (HTML, XML or other text based fragments).\n\nThe JSP specification does not deal the new lines (or white space in general)\nintroduced by the meta language. These new lines are used for readability\nreasons. In most cases the output language being HTML or XML extra empty lines\n(or white space in general) does not have any semantical impact, so probably\nthis is the main reason why this issue was neglected.\n\nIn HTML/XML empty lines can be a problem in the following cases:\n- JSP pages in general have may directives at the top of the page, this leads to\nmay empty lines at the top of the generated page, problems with this:\n  - Internet Explorer may not properly detect the page type for XHTML pages\nsince it is doing a limited look ahead\n(http://msdn.microsoft.com/library/default.asp?url=/workshop/networking/moniker/overview/appendix_a.asp)\n  - viewing the source of these pages shows a blank screen first (trivial, but\nhow many developers over the years are dealing with this annoying fact?)\n- the content of <pre> or <textarea> blocks in HTML\n- the content of CDATA blocks in XML\n\nIn the case of other formats than HTML/XML (like plain text) the extra empty\nlines can be a real problem.\n\nOther templating languages are dealing with this very same issue:\nhttp://freemarker.sourceforge.net/docs/dgui_misc_whitespace.html#dgui_misc_whitespace_stripping\n\nWhile the proper solution would be in the specification, changing that is a\nlengthy process (not to mention that it is almos impossible for an individual).\nSince the spec is not saying anything about this issue and there is an obvious\nproblem I think that it would be proper to provide a limited fix in Tomcat.\n\nThe limited fix I am suggesting is as follows:\n- for directives and declarations for which the end tag is followed only by\nwhite space consider that white space and the new line as part of the directive\nand don't output it\n- for scriplets and expressions don't apply this\n\nA switch or setting could be provided to enable this behaviour.\n\nCheers,\nMarius", "id": 47006, "time": "2003-11-07T17:46:06Z", "creator": "marius.scurtescu@gmail.com", "creation_time": "2003-11-07T17:46:06Z", "attachment_id": null}, {"count": 1, "text": "An option \"trimSpaces\" in Tomcat 5 is now implemented that essentially provides\nthe requested functionality.  Since this is not spec conformant, its default\nvalue is false.\n\nUnfortunately, the same fix cannot be easily applied to 4.1.x, due to the amount\nof differences in the source.", "bug_id": 24506, "is_private": false, "id": 47142, "time": "2003-11-10T22:34:26Z", "creator": "kin-man.chung@sun.com", "creation_time": "2003-11-10T22:34:26Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "text": "the current trimSpaces implementation is too eager to remove spaces.\n\nfrequently, whitespace in html IS significant - for instance:\n\"<img .../> some text here\"\nand\n\"<img .../>some text here\"\nwill display differently.\n\nthe current trimSpaces implementation takes this:\n\"${bullet} some text here\"\nand turns it into\n\"${bullet}some text here\"\nwhich is not the right thing (tm)\n\nfreemarker seems to use much more sophisticated rules for white space\nelimination, sure would be nice if tomcat could copy it for jsp.", "attachment_id": null, "id": 63185, "creator": "vincent@shopping.com", "time": "2004-09-07T22:46:04Z", "bug_id": 24506, "creation_time": "2004-09-07T22:46:04Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 24506, "attachment_id": null, "is_private": false, "id": 63225, "time": "2004-09-08T18:12:09Z", "creator": "kin-man.chung@sun.com", "creation_time": "2004-09-08T18:12:09Z", "text": "trimSpaces removes any template text between two standard or custom actions only\nif the template text is all white spaces, and should not cause the space to be\nremoved in your cases.  Supply a test case if you still have problems."}, {"count": 4, "tags": [], "text": "(In reply to comment #3)\n> trimSpaces removes any template text between two standard or custom actions only\n> if the template text is all white spaces, and should not cause the space to be\n> removed in your cases.  Supply a test case if you still have problems.\n\nTrue, but trimSpaces is still far too eager for the following universal case:\n\n${firstName} ${lastName} -> \"bobsmith\"\n\n...which really is not what you want, and means the directive is effectively\nuseless. TrimSpaces should only remove NEWLINE characters NOT SPACES between two\ndirectives (and hence should probably be renamed). It wouldnt be so bad for HTML\nif it just normalized it down to one space: s/\\s+\\ /\n\nThis is also discussed here:\nhttp://raibledesigns.com/comments/rd/sunsets/trim_spaces_in_your_jsp\n\n", "is_private": false, "bug_id": 24506, "id": 77470, "time": "2005-07-20T20:01:32Z", "creator": "tmp@kappia.com", "creation_time": "2005-07-20T20:01:32Z", "attachment_id": null}]