[{"count": 0, "tags": [], "bug_id": 2455, "attachment_id": null, "id": 3419, "time": "2001-07-05T04:44:00Z", "creator": "ramon.casha@megabyte.net", "creation_time": "2001-07-05T04:44:00Z", "is_private": false, "text": "When I set up an error-page in web.xml which Tomcat did not like, it sent to \nthe browser the entire JSP source of the page which generated the 404 error.\n\nI have Tomcat 3.2.2 with Apache 1.3.19. I set up Apache's error documents \nusing .shtml files. These worked fine with Apache, so I tried to set up TomCat \nto use the same docs since I have some JSP pages and servlets which can \ngenerate such a status code. I added the following code to my virtual host's \nweb.xml:\n<error-page>\n   <error-code>404</error-code>\n   <location>/errors/404.shtml</location>\n</error-page>\n...and this sent the actual content of the JSP page (in which I had used the \nresponse.sendError) to the browser!"}, {"count": 1, "tags": [], "creator": "nacho@apache.org", "attachment_id": null, "text": "Costin take a look at this", "id": 4825, "time": "2001-08-24T18:37:26Z", "bug_id": 2455, "creation_time": "2001-08-24T18:37:26Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 2455, "text": "I'm not sure how .shtml could be interpreted as a JSP page ?? Tomcat has no \nknowledge of shtml, and the error handling is done at the servlet container\nlevel, the web server is not involved. ", "id": 4983, "time": "2001-08-28T22:42:13Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-08-28T22:42:13Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "ramon.casha@megabyte.net", "attachment_id": null, "text": "I don't know what the error is and why it's occurring, but the end result is \nthat Tomcat is returning the ENTIRE SOURCE CODE of the JSP page which \ncontained response.sendError(404,...) to the browser. This behaviour is \nunacceptable. At worst, it should return the \"plain vanilla\" error-page if it \ncannot find the one given.\n\nIncidentally I can see no reason why the <location> tag should not point to a \n.shtml page (which would be interpreted by Apache, not Tomcat).\n", "id": 4996, "time": "2001-08-29T03:14:15Z", "bug_id": 2455, "creation_time": "2001-08-29T03:14:15Z", "is_private": false}, {"count": 4, "tags": [], "creator": "Larry.Isaacs@sas.com", "attachment_id": null, "text": "My interpretation of your bug report suggests that you are putting JSP code\nin your \".shtml\" error pages.  This doesn't make sense to me, so I assume\nI am not interpreting it correctly.  Unfortunately, there isn't enough detail\nto make an unambiguous interpretation.  Please supply a simple war file and\nApache config files to document all of what you are doing.  I'm afraid we just \ndon't have time to guess.\n\nSince, Tomcat 3.3 is approaching release, and we need to \"resolve\" all bugs, it\nis necessary change them to a \"resolved\" state while waiting for additional\ninformation to arrive.  Thus, I'm marking this bug as \"invalid\" for the time\nbeing.  Reopen it when you can attach the above information.  Thanks.", "id": 5003, "time": "2001-08-29T05:57:56Z", "bug_id": 2455, "creation_time": "2001-08-29T05:57:56Z", "is_private": false}]