[{"count": 0, "tags": [], "creator": "apacheBugzilla@AMammenT.cotse.net", "text": "When I attempt to start batik-squiggle on my computer, I find that the startup \nprocess fails, with the report that there are insufficient file permissions.  \n\nI have deployed the batik binary distributions to:\n  D:\\Program Files\\JTools\\batik-1.5\n\nWhen running, after changing the the above directory and invoking:\n  java -jar batik-squiggle.jar\nthe error message states that insufficient file permissions prevent the \nopening of \\D:\\Program Files\\JTolls\\batik-1.5\\batik-squiggle.jar.  This seemed \nquite strange to me, so after some followup, it became clear that the problem \nwas the extended windows file name (probably the space in \"Program Files\").  \nMoving the directory to D:\\batik-1.5 solved the problem temporarily, with the \ncost of constraining deployment to only paths with single word path elements.", "id": 47143, "time": "2003-11-10T22:48:20Z", "bug_id": 24587, "creation_time": "2003-11-10T22:48:20Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 24587, "attachment_id": null, "is_private": false, "id": 47172, "time": "2003-11-11T11:19:17Z", "creator": "deweese@apache.org", "creation_time": "2003-11-11T11:19:17Z", "text": "Hi,\n\n   This works just fine for me on my system in the following tree:\n\n     D:\\Name With A Space\\batik-1.5\n\n   Perhaps the problem was with the program you unpacked the distribution\nwith (the install page suggests using jar instead of zip to unpack\nbecause zip gets the permissions wrong in some cases).\n\n   Anyway why is this filed with Batik?  What could we do to fix this\nproblem?"}, {"count": 2, "attachment_id": null, "bug_id": 24587, "is_private": false, "id": 47460, "time": "2003-11-17T02:06:30Z", "creator": "apacheBugzilla@AMammenT.cotse.net", "creation_time": "2003-11-17T02:06:30Z", "tags": [], "text": "I'll check it again with the same directory structure that you used.  \nI'll also use jar to unpack the distribution.\n\nThis was filed with batik because squiggle is part of the batik distribution, \nand it doesn't appear to start properly.  Given that squiggle is a part of the \ndistribution, and it didn't appear to start properly, I assumed one would \nconsider it a bug.  (I didn't see any documentation which suggested that batik \nis not meant to run properly on Windows.)  \n\nAs a user, not a developer, it's a little difficult for me to describe exactly \nwhat you could do to fix the problem.  At least when I've been faced with bugs \nfor projects on which I'm a developer, the following approach has worked \ndecently:\n\n1) Attempt to reproduce the problem - you've done this.\n2) Examine the code to see if the problem is due to something in my code base, \nor in a library on which my code base depends.  \n3a) Prioritize and fix the problem if it can be resolved in my code base.\n3b) Submit a bug with the owners of the library, and investigate workarounds \nif the problem is due to something in a library.  \n4) Record the findings of my investigation, and the approach to resolution \nselected as part of the original bug report.  \n\nDoes this answer your question?  On re-reading, my response seems flippant, \nbut I'm not quite sure how else to answer....  I'd appreciate any \nclarification you could provide if this response was not what you were looking \nfor....\n\nOf course, in this case, the first step was sufficient.  I'll try to provide a \nprompt update - perhaps it's the JVM that's the problem - still something \nworth noting in the usage docs.  I was using Sun JDK 1.4.1_02 - were you using \nthis as well?\n\n"}, {"count": 3, "tags": [], "creator": "deweese@apache.org", "is_private": false, "text": "Did you try my suggestion of using 'jar' instead of zip to\nupack the distribution?\n\nCan you move the directory after you have a working extraction?\n", "id": 47502, "time": "2003-11-17T17:12:25Z", "bug_id": 24587, "creation_time": "2003-11-17T17:12:25Z", "attachment_id": null}]