[{"count": 0, "tags": [], "bug_id": 24698, "attachment_id": null, "is_private": false, "id": 47332, "time": "2003-11-14T04:07:37Z", "creator": "tymberwlf@yahoo.ca", "creation_time": "2003-11-14T04:07:37Z", "text": "Apache 2.0.48 causes CPU to max at 100% on Windows 2000\n\nWindows 2000 on a clean install with no other Service packs/patches, firewalls \netc installed. \nInstall default of 2.0.48 with no changes to config. Start Apache manually or \nvia the service, cpu climbs and stays at 100%.\n\nInstall 2.0.47 on the same pc with NO changes. Start Apache with same default \nsettings, and either by manual or service start, the cpu stays at a normal \nlevel.\n\nThis issue with 2.0.48 was also recreated on a Windows 2000 pc with all MS \nupdate patches and SP4 installed. 2.0.47 worked fine."}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "text": "\n  Are you running Apache with privilages as a service, or as a console app?\n\n  Do you need to process a request to cause this behavior, or will it climb\n  before any requests are recieved?\n\n  You don't mention, were any third party modules were installed?\n\n  Thanks for your report, please provide some additional details to help us\n  narrow down which part of the server is suspect.\n", "id": 47354, "time": "2003-11-14T17:17:11Z", "bug_id": 24698, "creation_time": "2003-11-14T17:17:11Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 24698, "attachment_id": null, "id": 47381, "time": "2003-11-15T00:18:48Z", "creator": "tymberwlf@yahoo.ca", "creation_time": "2003-11-15T00:18:48Z", "is_private": false, "text": "This issue occurs with Apache running as a service or through the console. I \nused the default httpd.conf with no changes except for the hostname and  \nServerAdmin email address. This same httpd.conf works fine for 2.0.47.\n\nUpon startup, the cpu climbs and stays at 100% right away and it will not hand \nany requests.\n\nNo other 3rd party modules/software installed. This was intially tested on \ncleanly formatted win2000 pro test pc with ALL default install parameters. The \nsecond test was on  production win2000 pro pc with all the latest MS security \npatches and Win2000 Service Pack 4. There also no other software installed. It \nis interesting to note that 2.0.47 runs perfectly fine on both pc's.\nNo useful into (to me anyway) in the log files, even at the debug level.\n\nTo rule out any operating system issues. I installed 1.3.29 on both pc's and \nagain there is no issues at all.\n\nAt this point, because the original pc is a test and demo pc, I am willing to \nreformat and reinstall again if requested. I would like to have 2.0.48 running \non it if at all possible."}, {"count": 3, "tags": [], "text": "Apache 2.0.48 is displaying an application error when it is closed (you can only\nend task it. No changes to the apache config or the pc operating system.\n\nThe instruction at \"0x77f8aa57\" referenced memory at \"0x00000014\" the memory\ncould not be read.\n\"Click on OK to terminate the program.\"", "is_private": false, "bug_id": 24698, "id": 47385, "time": "2003-11-15T03:06:56Z", "creator": "tymberwlf@yahoo.ca", "creation_time": "2003-11-15T03:06:56Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 24698, "attachment_id": null, "text": "Found out what the issue is. The cpu climbing to 100% is caused by having \nMcafee anti-virus running. Once Mcafee was disabled, Apache 2.0.48 runs fine. \nThis is not an idea situation and I do not wish to close this bug report as \nprevious 2.0.x and 1.3.x versions of Apache co-exist fine alongside of Mcafee...", "id": 47422, "time": "2003-11-16T04:55:24Z", "creator": "tymberwlf@yahoo.ca", "creation_time": "2003-11-16T04:55:24Z", "is_private": false}]