[{"count": 0, "tags": [], "bug_id": 24800, "is_private": false, "text": "The following holds true for Apache 2.0.47 on Windows.  It may well hold true \non other platforms, but I have not done sufficient testing to say for certain.\n\nThe out-of-the-box configuration of Apache 2.0.47 crashes upon LDAP \nauthentication of the 376th distinct user.  This is with my LDAP URL, search \nfilter, etc, so the exact number where the failure will occur will vary.  It \nshould be noted, however, that my URLs, user names, etc, are all relatively \nshort, so this is not just a pathological case.\n\nI did enough debugging to be all but certain that the cause of this is no \nchecks for null results when allocating memory from the LDAP shared memory \nblock -- combined with too low of a default value of LDAPSharedCacheSize.\n\nAt a minimum the LDAPSharedCacheSize default value should be large enough for \nthe default LDAPCacheEntries and LDAPOpCacheEntries and \"typical\" data in \neach.  Unfortunately nothing is really \"typical\" and the only real fix is to \nadd appropriate result checking and handling of null results.\n\nFor those looking to work around this issue, I have found that for *my* data \neach LDAPCacheEntries entry takes around 270 bytes.  [I don't use \nLDAPOpCacheEntries, but I've also discovered that if LDAPCacheEntries is non-\nzero LDAPOpCacheEntries must be non-zero or crashes will occur in this case as \nwell -- I thus use a value of 1 for LDAPOpCacheEntries.]  I combine this with a \nfactor of safety to compute LDAPSharedCacheSize based on my LDAPCacheEntries \nsetting.\n\nAfter all of these efforts I still get crashes when the number of distinct \nusers exceeds LDAPCacheEntries , but I'll file a separate bug on that.", "id": 47581, "time": "2003-11-18T22:28:38Z", "creator": "jessh@ptc.com", "creation_time": "2003-11-18T22:28:38Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 24800, "attachment_id": null, "text": "There have been a number of fixes to ldap support in v2.1.0-dev - can you try\nthis version and report if you're still getting problems.\n\nThere have also been some fixes that are already available in v2.0.49 - can you\ncheck whether that version fixes your problem.\n", "id": 57814, "time": "2004-05-21T15:29:02Z", "creator": "minfrin@sharp.fm", "creation_time": "2004-05-21T15:29:02Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 24800, "text": "I believe this particular issue has been resolved in 2.0.49.", "id": 57832, "time": "2004-05-21T16:15:20Z", "creator": "jessh@ptc.com", "creation_time": "2004-05-21T16:15:20Z", "tags": [], "is_private": false}]