[{"count": 0, "tags": [], "text": "Not sure if this has already been discussed and rejected, but anyway here is an\nattempt at a patch to let you send console input to <java> - mainly so that you\ncan use an Ant script to build and then interactively test a console-based Java app.\n\nThe patch adds an attribute 'standardinput' to <java>. If true, Ant's stdin will\nbe passed to the subprocess.\n\nIt seems that this *already* happens when fork=\"false\" - not sure if that is\nintentional, or if it should be explicitly disabled. Anyway, at least for\nfork=\"true\" this patch appears to be necessary to let the subprocess read from\nstdin. Otherwise it gets an immediate EOF.\n\nAlso adding a few more options to various classes to permit stdin to be read,\nand to make the stream pumper autoflush input - if you don't do that, then in\nforked mode the data will just build up somewhere and not get sent to the\nsubprocess.\n\nTested only on Linux, YMMV on other platforms. Not sure how to go about creating\na unit test for something so inherently platform-specific and difficult to\nscript (without using Expect or pty's!), but attaching a build file you can test\nwith manually. Try to run each of the targets individually, and also try running\ntwo or more in sequence to verify that you can Ctrl-D (Unix) to end input to one\ntask and still go and send some input to the next one.\n\nThis patch does not attempt to add the same feature for general <exec>; I am not\nsure if it would even be useful to anyone.\n\nRelated bug reports I can see:\n\nbug #2738  - Passing of Streams...\nbug #3452  - ... add \"input\" attribute for task \"exec\"...\nbug #24592 - support @input for the exec task", "is_private": false, "bug_id": 24918, "id": 47924, "time": "2003-11-22T16:05:04Z", "creator": "jglick@apache.org", "creation_time": "2003-11-22T16:05:04Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 24918, "attachment_id": 9240, "is_private": false, "id": 47925, "time": "2003-11-22T16:06:34Z", "creator": "jglick@apache.org", "creation_time": "2003-11-22T16:06:34Z", "text": "Created attachment 9240\nPossible patch to add <java standardinput=\"true\">"}, {"count": 2, "tags": [], "text": "Created attachment 9241\nAnt script to help manually test patch functionality", "attachment_id": 9241, "bug_id": 24918, "id": 47926, "time": "2003-11-22T16:08:45Z", "creator": "jglick@apache.org", "creation_time": "2003-11-22T16:08:45Z", "is_private": false}, {"text": "I have a quick question since I have not tried the code - won't putting a pump\non standard input potentially pump more input into the task than it takes. A\nsecond task taking input might not get it. This might only be an issue when\nredirecting input to Ant itself - not sure.\n\nAlso, I wonder if there is a potential for deadlock if the read is blocked.\n\nIf this does work, it would be useful for exec and sicne it uses the same\nmechanism, it should be easy.\n\nBTW, working in non-forked mode is intentional and should be controllable by the\n-noinput flag if you don't want interactivity.\n\n", "tags": [], "bug_id": 24918, "attachment_id": null, "count": 3, "id": 47948, "time": "2003-11-23T14:28:14Z", "creator": "conor@apache.org", "creation_time": "2003-11-23T14:28:14Z", "is_private": false}, {"count": 4, "tags": [], "text": "Re. pumping more input into the task than it takes - not sure, but it worked for\nme at least on Linux to run the process twice from the same Ant target. Feed the\nfirst process some input, it echoes it as it goes, press Ctrl-D, the first\nprocess ends and the second process begins, feed it some input, it gets echoed,\npress Ctrl-D, the second process ends and the build completes.\n\nHowever this test program was designed to accept stdin until it gets EOF, and\nreact quickly to input relative to interactive typing speed. If there is a\nprocess which takes stdin for a while and then stops (e.g. upon receiving a line\nlike \"exit\") and closed stdin and then does some lengthy calculation while you\ncontinue typing, then I suppose some of the input could be sent to the process\nwhere it will not be accepted, which would throw an IOException in StreamPumper.\nNot sure how to fix that except by checking the process after every byte is\nwritten to see if the OutputStream is closed. Anyway if the process does not\nclose stdin but simply stops checking it then there is no way for the\nStreamPumper to know whether it is going to want more input or not, so it must\nassume that it will and send it.\n\nRealistically, I can't imagine many use cases for interactive process input that\nwould involve more than one process per Ant run, or non-stdin-driven programs,\nso I imagine this is a corner case.\n\nRe. potential for deadlock while read is blocked - not sure what you mean.\n\nRe. <java fork=\"false\"> accepting input (unless -noinput is given) while <java\nfork=\"true\"> does not and this being intentional - OK I suppose, though this\nstill sounds weird. Why (from a user perspective) should forking or not forking\naffect whether the <java> task accepts input?\n\n----\n\nNow for the experiment: change the Java code in the test build script to read:\n\n...\npublic static void main(String[] x) throws Exception {\n...\nSystem.err.println(\"got: \" + line);\nThread.sleep(3000);\n...\n\nso that the process waits to get further input. Then run\n\nant -f /tmp/foo.xml nofork-nostdin nofork-nostdin\n\n(using an unpatched Ant here)\n\nand when the 1st process is ready, enter \"a\" RET, \"b\" RET, \"c\" RET, Ctrl-D, \"1\"\nRET, \"2\" RET, \"3\" RET, Ctrl-D in quick sequence. I get\n\nnofork-nostdin:\n     [echo] nofork=true stdin=false\na\n     [java] got: a\nb\nc\n1\n2\n3\n     [java] got: b\n     [java] got: c\n     [java] got: 1\n     [java] got: 2\n     [java] got: 3\n\ncompile:\n     [echo] Ant: Apache Ant version 1.7alpha compiled on November 22 2003\n    [javac] Compiling 1 source file to /tmp\n\nnofork-nostdin:\n     [echo] nofork=true stdin=false\n\ni.e. all the input was sent to the first process. Then it is waiting again for\nthe second, which you can still use and finish normally. So basically if you\ntype ahead, it will go to the process current running, even if you put in a Ctrl-D.\n\nBy comparison, using bash if you run\n\n$ echo Running 1; java -cp /tmp TestIn; echo Running 2; java -cp /tmp TestIn\n\nand type the same things, it works almost exactly the same:\n\nRunning 1\na\ngot: a\nb\nc\n\n1\n2\n3\ngot: b\ngot: c\ngot: \ngot: 1\ngot: 2\ngot: 3\nRunning 2\n\nSo if this is a bug, it is a bug which is shared even by the Unix shell -\nprobably not something to worry about.", "attachment_id": null, "bug_id": 24918, "id": 48035, "time": "2003-11-24T18:15:08Z", "creator": "jglick@apache.org", "creation_time": "2003-11-24T18:15:08Z", "is_private": false}, {"text": "Anyone looking at this? If there are specific objections, I can try to address them.\n\nPotentially important for NetBeans 4.0 (assuming that bundles Ant 1.6.2) as\nwithout some fix you would not be able to use the IDE to try programs which take\nconsole input. (Unless you run unforked, but this is dangerous in general.)", "tags": [], "bug_id": 24918, "attachment_id": null, "count": 5, "id": 57061, "time": "2004-05-09T21:10:53Z", "creator": "jglick@apache.org", "creation_time": "2004-05-09T21:10:53Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 24918, "attachment_id": null, "text": "Are committers interested in this patch? If so I am quite willing to redo it to\napply against the current trunk (does not merge cleanly any more, I think). Not\nsure if it would be accepted for 1.6.3 (not a bug fix) or only for 1.7.", "id": 61193, "time": "2004-07-27T19:13:14Z", "creator": "jglick@apache.org", "creation_time": "2004-07-27T19:13:14Z", "is_private": false}, {"count": 7, "tags": [], "text": "A solution to this needs to be integrated as soon as possible. This issue is\nblocking progress in value-added products for the support of console apps and\nGUI apps that use an optional debug, monitor, or recovery console. In some\nenvironments, GUI independent consoles are considered a mandatory component of\nproduct monitoring and reliability.", "attachment_id": null, "id": 62618, "creator": "LlelanD@TheSnakePitDev.com", "time": "2004-08-28T00:49:24Z", "bug_id": 24918, "creation_time": "2004-08-28T00:49:24Z", "is_private": false}, {"count": 8, "tags": [], "text": "Please note that this issue was identified as serious defect in functionality of\nupcoming NetBeans 4.0. For more information, take a look here:\nhttp://qa.netbeans.org/issues/show_bug.cgi?id=47708\n\nThis issue has already got 12 votes. How much is necessary to convince you to\nintegrate Jesse's patch ?\n\nThank you,\nJiri Kovalsky\nNetCAT 4.0 Program Coordinator\nhttp://qa.netbeans.org/processes/cat/40/index.html", "is_private": false, "id": 62885, "creator": "jiri.kovalsky@sun.com", "time": "2004-09-01T09:16:18Z", "bug_id": 24918, "creation_time": "2004-09-01T09:16:18Z", "attachment_id": null}, {"count": 9, "tags": [], "text": "What is the anticipated release date for NetBeans 4.0?", "is_private": false, "bug_id": 24918, "id": 62905, "time": "2004-09-01T14:42:25Z", "creator": "mbenson@apache.org", "creation_time": "2004-09-01T14:42:25Z", "attachment_id": null}, {"count": 10, "tags": [], "text": "Current plan for NB 4.0:\n# September 22 - 4.0 Beta-2 released based on Beta-1 feedback\n# End of September - High Resistance mode\n# Mid of November - RC build testing\n# End of November - CA survey launched\n# Mid of December - FCS release\n\nWould be very good to have it asap. Beta 2 preferably, definitelly before the RC\nbuilds are started to be produced.\n", "attachment_id": null, "bug_id": 24918, "id": 62921, "time": "2004-09-01T19:15:32Z", "creator": "strupl@solutions.cz", "creation_time": "2004-09-01T19:15:32Z", "is_private": false}, {"count": 11, "tags": [], "text": "Guys, maybe you should go ahead and try using standard input without an \nattribute with Ant 1.6.1-2 .  It works for me; I am using a slightly modified \nversion of the relevant code but I don't think there is anything that \nsignificantly different in my version.\n\nThanks,\nMatt", "is_private": false, "bug_id": 24918, "id": 62964, "time": "2004-09-02T16:42:42Z", "creator": "mbenson@apache.org", "creation_time": "2004-09-02T16:42:42Z", "attachment_id": null}, {"text": "As quoted in the original bug description above, the whole point of this bug is\nthat, though stdin works for fork=\"false\" (default), stdin does NOT work for\nfork=\"true\". We can't just \"go ahead and try using standard input without an \nattribute\" when that attribute is what is required.\n\nAll of my GUI server apps have optional consoles to allow for run-time\ndebugging, monitoring, and recovery. It is a required feature in a reliability\narchitecture. Since the execution of these consoles is impossible using Ant with\nfork=\"true\" in any environment, I've upgraded the priority of this to \"high\". I\nabsolutely must have this feature if I am to use Ant for run-time management.\n\nThis bug has been open since 1.6.0, is 1 of only 16 bugs with this many votes,\nand already has a proposed implementation. Can we get some positive action here?", "tags": [], "bug_id": 24918, "is_private": false, "count": 12, "id": 62991, "time": "2004-09-02T22:05:05Z", "creator": "NOSPAM@TheSnakePitDev.com", "creation_time": "2004-09-02T22:05:05Z", "attachment_id": null}, {"text": "1.  My apologies for having let it slip my mind that fork=\"true\" was at the \nheart of the issue.\n\n2.  Calm down, there's no need to get all worked up.  When's the last time that \ngot you what you wanted?\n\n3.  Ant is not designed for run-time management in the first place ALTHOUGH \nthis does not mean we don't want to arrive at a solution that will make \neveryone happy.  I just want to make sure that whatever solution is chosen is \nthe (or at least \"a\") right one for Ant's current architecture.", "tags": [], "bug_id": 24918, "is_private": false, "count": 13, "id": 62992, "time": "2004-09-02T22:15:06Z", "creator": "mbenson@apache.org", "creation_time": "2004-09-02T22:15:06Z", "attachment_id": null}, {"count": 14, "tags": [], "text": "I introduced the run-time management concept to show yet another reason why this\nbug is of a high priority. It does not detract from the fact that stdin works\nfor fork=\"false\" and not for fork=\"true\" (which, in my mind, makes this a bug\nand not an enhancement, but I was being nice).\n\nA polite, concise, and clear statement of facts does not indicate a \"worked up\"\nstate. Please keep such personal comments off-line.\n\nThis bug has been open for almost 10 months now, and it hasn't been assigned,\nprogressed, or even discussed by the Ant team in this bug log until now. This\nreason, and the vote count, would seem more than appropriate for a call to\naction. Mr. Glick's patch is obviously proposed and would need appropriate\nreview, but, given that it allows fork=\"true\" to operate in a consistent manner\nwith fork=\"false\", it would seem an excellent basis from which to start and\nwould encourage quick and effective progress.", "attachment_id": null, "id": 62996, "creator": "NOSPAM@TheSnakePitDev.com", "time": "2004-09-03T00:02:58Z", "bug_id": 24918, "creation_time": "2004-09-03T00:02:58Z", "is_private": false}, {"count": 15, "tags": [], "creator": "mruflin@netbeans.org", "attachment_id": null, "is_private": false, "id": 69613, "time": "2005-01-12T20:49:34Z", "bug_id": 24918, "creation_time": "2005-01-12T20:49:34Z", "text": "Any updates regarding this issue?"}, {"count": 16, "tags": [], "text": "Created attachment 14108\nBetter Ant script to manually test functionality", "is_private": false, "bug_id": 24918, "id": 70131, "time": "2005-01-27T01:28:32Z", "creator": "jglick@apache.org", "creation_time": "2005-01-27T01:28:32Z", "attachment_id": 14108}, {"count": 17, "tags": [], "text": "Created attachment 14109\nRevised patch (against HEAD)\n\nTested on Linux so far and works as expected.", "is_private": false, "id": 70132, "creator": "jglick@apache.org", "time": "2005-01-27T01:34:39Z", "bug_id": 24918, "creation_time": "2005-01-27T01:34:39Z", "attachment_id": 14109}, {"count": 18, "tags": [], "text": "I know this and the Redirector stuff were two competing initiatives--thanks for\nreworking your patch.  I can (sometime) test this on Windows if you are looking\nfor validation, but you've got commit rights now so if you're confident I have\nno problem with this going in and I can't see why anyone else would.  I'm\nassuming the existing testcases pass which would verify that reading from\nSystem.in has no effect as no other input-expecting program would have worked\nbefore and thus would not be a part of an existing build, and programs not\nlooking for input should be indifferent.", "attachment_id": null, "id": 70177, "creator": "mbenson@apache.org", "time": "2005-01-27T16:03:37Z", "bug_id": 24918, "creation_time": "2005-01-27T16:03:37Z", "is_private": false}, {"count": 19, "tags": [], "creator": "mbenson@apache.org", "attachment_id": null, "id": 70178, "time": "2005-01-27T16:05:16Z", "bug_id": 24918, "creation_time": "2005-01-27T16:05:16Z", "is_private": false, "text": "Well, part of that was wrong, I recall... I don't remember what circumstances\nallow input now but I'm pretty sure there are some after all.  Anyway, the rest\nof what I said still stands.  ;)"}, {"count": 20, "tags": [], "text": "I just tested on Win XP and it works fine there too. All tests continue to pass\nfor me (on JDK 1.4.2 on Linux). Compilation succeeds on JDK 1.2. Functionality\nalso seems to work as expected embedded inside the NetBeans IDE.\n\nI am committing this to the Ant trunk (for 1.7) under the \"lazy approval\"\ntheory. I think it would be a good candidate for a fix in 1.6.3, since this\nintroduces no internal API or build script format changes and to my mind fixes a\nbug, but I will leave it to other committers to comment on that. Note that I am\non vacation for the whole month of February, but if someone else would like to\nmerge this to ANT_16_BRANCH that would be great.\n\nSo a quick summary of what the problem was and what is now fixed:\n\n--------\nIn Ant 1.6.2 (for example), if you had a program which tried to read from\nstandard input, and ran it with <java fork=\"false\">, it would work fine. However\nif you ran it with <java fork=\"true\">, it would not - it would get an immediate\nEOF. As far as I can tell, this is just because no one bothered to make it work,\nnot that there is any particular benefit to disabling input for forked apps. In\nany case, as Conor mentions, passing the -noinput flag would cause even unforked\napps to get an immediate EOF.\n\nWith the patch, you can send console input to programs run with <java>, whether\nforked or not. (Not to spawned programs however.) -noinput still works in either\ncase to suppress input.\n--------\n\nYou can use the \"better Ant script...\" to try it out. You can also confirm that\nit is possible to run more than one app taking stdin in the same Ant session;\nsending EOF (Ctrl-D on Unix, Ctrl-Z ENTER on Windows) stops input to the running\napp but does not prevent a subsequent app from accepting input normally.\n\nUnlike the original patch, the revised patch does *not* introduce a special\nattribute to the <java> task. I don't think one is required; it should be\nexpected that forked and unforked apps work the same way unless there is a\nreason for them to differ, and that an app requesting input will get it unless\nyou have a reason to suppress input.\n\nThe current patch makes no API changes, since all code changes are in the same\npackage and it is not necessary, but there are several places where an API\naddition would be natural; in those cases I have commented out \"public\" or\n\"protected\" but left it in the code so you can see what the API would be. Will\nleave it to other committers to comment on whether some or all of these API\nadditions are desirable.\n\nChecking in WHATSNEW;\n/home/cvs/ant/WHATSNEW,v  <--  WHATSNEW\nnew revision: 1.731; previous revision: 1.730\ndone\nMore commits to come...\nChecking in docs/manual/CoreTasks/java.html;\n/home/cvs/ant/docs/manual/CoreTasks/java.html,v  <--  java.html\nnew revision: 1.36; previous revision: 1.35\ndone\nMore commits to come...\nChecking in src/main/org/apache/tools/ant/taskdefs/Java.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/Java.java,v  <--  Java.java\nnew revision: 1.97; previous revision: 1.96\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/PumpStreamHandler.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/PumpStreamHandler.java,v \n<--  PumpStreamHandler.java\nnew revision: 1.21; previous revision: 1.20\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/Redirector.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/Redirector.java,v  <-- \nRedirector.java\nnew revision: 1.24; previous revision: 1.23\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/StreamPumper.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/StreamPumper.java,v  <-- \nStreamPumper.java\nnew revision: 1.21; previous revision: 1.20\ndone\n", "is_private": false, "id": 70190, "creator": "jglick@apache.org", "time": "2005-01-27T17:36:45Z", "bug_id": 24918, "creation_time": "2005-01-27T17:36:45Z", "attachment_id": null}, {"count": 21, "tags": [], "text": "So, merging to the Ant 1.6.3 line:\n\nChecking in WHATSNEW;\n/home/cvs/ant/WHATSNEW,v  <--  WHATSNEW\nnew revision: 1.503.2.200; previous revision: 1.503.2.199\ndone\nMore commits to come...\nChecking in docs/manual/CoreTasks/java.html;\n/home/cvs/ant/docs/manual/CoreTasks/java.html,v  <--  java.html\nnew revision: 1.24.2.12; previous revision: 1.24.2.11\ndone\nMore commits to come...\nChecking in src/main/org/apache/tools/ant/taskdefs/Java.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/Java.java,v  <--  Java.java\nnew revision: 1.77.2.12; previous revision: 1.77.2.11\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/PumpStreamHandler.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/PumpStreamHandler.java,v \n<--  PumpStreamHandler.java\nnew revision: 1.14.2.6; previous revision: 1.14.2.5\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/Redirector.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/Redirector.java,v  <-- \nRedirector.java\nnew revision: 1.11.2.12; previous revision: 1.11.2.11\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/StreamPumper.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/StreamPumper.java,v  <-- \nStreamPumper.java\nnew revision: 1.16.2.5; previous revision: 1.16.2.4\ndone\n", "is_private": false, "id": 72516, "creator": "jglick@apache.org", "time": "2005-03-16T17:52:47Z", "bug_id": 24918, "creation_time": "2005-03-16T17:52:47Z", "attachment_id": null}, {"count": 22, "tags": [], "text": "Also backdating \"since\" text in the trunk:\n\nChecking in WHATSNEW;\n/home/cvs/ant/WHATSNEW,v  <--  WHATSNEW\nnew revision: 1.781; previous revision: 1.780\ndone\nMore commits to come...\nChecking in docs/manual/CoreTasks/java.html;\n/home/cvs/ant/docs/manual/CoreTasks/java.html,v  <--  java.html\nnew revision: 1.40; previous revision: 1.39\ndone\nMore commits to come...\nChecking in src/main/org/apache/tools/ant/taskdefs/PumpStreamHandler.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/PumpStreamHandler.java,v \n<--  PumpStreamHandler.java\nnew revision: 1.23; previous revision: 1.22\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/Redirector.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/Redirector.java,v  <-- \nRedirector.java\nnew revision: 1.27; previous revision: 1.26\ndone\nChecking in src/main/org/apache/tools/ant/taskdefs/StreamPumper.java;\n/home/cvs/ant/src/main/org/apache/tools/ant/taskdefs/StreamPumper.java,v  <-- \nStreamPumper.java\nnew revision: 1.23; previous revision: 1.22\ndone\n", "attachment_id": null, "id": 72518, "creator": "jglick@apache.org", "time": "2005-03-16T17:56:47Z", "bug_id": 24918, "creation_time": "2005-03-16T17:56:47Z", "is_private": false}]