[{"count": 0, "tags": [], "text": "The ServletWrapper class provides getRequest and setRequest methods - as \nspecificied in Java™ Servlet Specification Version 2.4 Final Draft.\n\nThese methods are used in core of Tomcat to directly access the wrapped \nrequest and hence to bipass the wrapper.  The whole point of the wrapper is to \ndo just that - to wrap the request,  so all access to the wrapped object \nshould go through the wrapper implementation - this allows it to control and \nto modify access to the request as it sees fit.  \n\nIt would seem best to me to remove the getRequest and setRequest methods \naltogether in order to force access through the Wrapper (of course this would \nmean altering the 2.4 spec. doc also).\n\nThis is not just a theoretical design problem it has manifested as a bug in my \ncode.", "is_private": false, "id": 47999, "creator": "Paul.Harvey@fdisolutions.com", "time": "2003-11-24T12:47:57Z", "bug_id": 24940, "creation_time": "2003-11-24T12:47:57Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "This actually is the most poorly defined part of the spec and I have met\ndiffering implementations. Some parts even contradict each other.\nhttp://www.coredevelopers.net/library/j2ee/servlet24/ar01s05.jsp#d0e711 is an\ninteresting read on that.\n\nI figure that until the spec gets clarified about this, the Tomcat implementors\ncannot do much about that. I propose you address servletapi-feedback@eng.sun.com.\n", "is_private": false, "id": 48000, "creator": "ernst.matthias@gmail.com", "time": "2003-11-24T12:56:54Z", "bug_id": 24940, "creation_time": "2003-11-24T12:56:54Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "remm@apache.org", "is_private": false, "text": "getRequest is IMO necessary.\n\nAs for the rest, I had pointed out months ago the contradiction between wrapping\nand request dispatcher. My current understanding is that implementing the RD\nrequirements is more important, so that wrapping will actually always occur.", "id": 48001, "time": "2003-11-24T13:18:23Z", "bug_id": 24940, "creation_time": "2003-11-24T13:18:23Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "Paul.Harvey@fdisolutions.com", "text": "I have submitted the question to servletapi-feedback@eng.sun.com as suggested.\n\nNot sure that I agree that getRequest is necessary.", "id": 48004, "time": "2003-11-24T13:28:47Z", "bug_id": 24940, "creation_time": "2003-11-24T13:28:47Z", "is_private": false, "attachment_id": null}]