[{"count": 0, "tags": [], "creator": "claire-spam@noise.net.nz", "is_private": false, "text": "I want to restrict access to my webserver to four users within the office. The \nfirst snippet of help would suggest I use Order deny,allow and the second \nsnippet would suggest Order allow,deny.\n\n===============================================================================\n\nhttp://localhost/manual/howto/auth.html\n\nUsing Order will let you be sure that you are actually restricting things to \nthe group that you want to let in, by combining a Deny and an Allow directive:\n\nOrder deny,allow\nDeny from all\nAllow from dev.example.com \n\nListing just the Allow directive would not do what you want, because it will \nlet folks from that host in, in addition to letting everyone in. What you want \nis to let only those folks in.\n\n==============================================================================\n\nhttp://localhost/manual/mod/mod_access.html#order\n\nDeny,Allow \nThe Deny directives are evaluated before the Allow directives. Access is \nallowed by default. Any client which does not match a Deny directive or does \nmatch an Allow directive will be allowed access to the server. \nAllow,Deny \nThe Allow directives are evaluated before the Deny directives. Access is denied \nby default. Any client which does not match an Allow directive or does match a \nDeny directive will be denied access to the server.", "id": 48133, "time": "2003-11-26T03:59:59Z", "bug_id": 25000, "creation_time": "2003-11-26T03:59:59Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 25000, "attachment_id": null, "is_private": false, "id": 48135, "time": "2003-11-26T06:53:03Z", "creator": "jwoolley@apache.org", "creation_time": "2003-11-26T06:53:03Z", "text": "Believe it or not, these two descriptions are not conflicting.  :)  Given that, \nthis is really a question for the user support list, but I'll go ahead and \nanswer it here in case somebody else does a search for this sometime in the \nfuture:\n\nLet me try to rephrase the snippets you quoted.. maybe that will help.\n\nThe second snippet says that the Order directive determines whether Denys or \nAllows are processed first.  But more importantly, it also says that whichever \none is processed last is the default.  This means, for example, that if you \nspecify \"Order deny,allow\", then any client that is *neither* explicitly denied \nnor explicitly allowed is allowed by default.  If you use \"Order allow,deny\", \nthen any client that is neither explicitly denied nor explicitly allowed is \ndenied by default.\n\nThe first snippet is saying that if you use \"Order deny,allow\" AND you leave \nout the \"Deny\" line altogether, then everybody will be allowed (both those \nexplicitly Allowed and everybody else because allow would then be the \ndefault).  However, if you have \"Order deny,allow\" and you \"Deny from all\", \nthen the behavior for all clients is explicitly specified, and thus \nthe \"default to allow\" behavior has no impact at all.  And in that case, you \nneed to use \"Order deny,allow\", so that your \"Deny from all\" can be overridden \nby explicit \"Allow\"'s.\n\nOR, you could use \"Order allow,deny\", as long as you do NOT \"Deny from all\". \nThis would mean you explicitly allowed some clients, and everybody else is \ndenied explicitly or by default.  The reason you can't use \"Deny from all\" \nwith \"Order allow,deny\" is that EVERYBODY would be denied, since the denies get \nprocessed last and override the allows.\n\nDoes that help?  Or just muddy it up further?  :)\n\nIf you have further questions, please refer them to the user support mailing \nlist.  See http://httpd.apache.org/userslist.html"}, {"count": 2, "tags": [], "creator": "claire-spam@noise.net.nz", "text": "Thanks for that explanation - I think I understand now. :) I would have thought:\n\nOrder allow,deny\nAllow from dev.example.com \n\nto be a more clear example for the first snippet.", "id": 48192, "time": "2003-11-26T20:32:29Z", "bug_id": 25000, "creation_time": "2003-11-26T20:32:29Z", "is_private": false, "attachment_id": null}]