[{"count": 0, "tags": [], "bug_id": 25066, "text": "How about adding an on/off flag for the context. Provided there's one it would\nbe possible to prevent starting a context during startup, but would allow\nstarting this context later. This is especially a case for bundled applications\nadmin, manager and balancer. \n\nThe corresponding <Context> element might look like this:\n\n<Context path=\"/admin\" docBase=\"../server/webapps/admin\"\n        debug=\"0\" privileged=\"true\"\n        startup=\"false\" >\n</Context>", "id": 48280, "time": "2003-11-28T11:24:33Z", "creator": "drzewo@post.pl", "creation_time": "2003-11-28T11:24:33Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "remm@apache.org", "is_private": false, "count": 1, "id": 48295, "time": "2003-11-29T08:31:56Z", "bug_id": 25066, "creation_time": "2003-11-29T08:31:56Z", "text": "On access startup can't be implemented with the current architecture."}, {"count": 2, "tags": [], "bug_id": 25066, "attachment_id": null, "is_private": false, "id": 52555, "time": "2004-02-19T12:38:36Z", "creator": "drzewo@post.pl", "creation_time": "2004-02-19T12:38:36Z", "text": "My suggestion seems to have been misunderstood. I did not want to add \"on access\nstartup\" for contexts. AFAIK, adding a feature as described for this\nenhancenment proposal IS possible with current tomcat architecture.\n\nIt would be nice to have particular installed applications disabled at tomcat\nstartup, and being able to turn them on (start) later, whenever required (as\nopposed to deploying them).\n\nIf I'm wrong, sorry for reopening this bug."}, {"count": 3, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "id": 52558, "time": "2004-02-19T13:01:48Z", "bug_id": 25066, "creation_time": "2004-02-19T13:01:48Z", "is_private": false, "text": "Well, it doesn't make sense. You should simply deploy them later."}, {"count": 4, "tags": [], "creator": "drzewo@post.pl", "attachment_id": null, "is_private": false, "id": 52562, "time": "2004-02-19T13:38:54Z", "bug_id": 25066, "creation_time": "2004-02-19T13:38:54Z", "text": "Well, it *DOES* make sense to me. This way you can disable occasionally used\napplications (consider admin) without physically removing any files. This way\nyou are saving precious cpu at startup (Did you know that bare tomcat only with\n/ and /manager starts up in about 4 secs? on p4-m 1.8G. Awesome!), while\npreserving the simplicity of starting application when needed in almost no time. \n\nYou agree that there is much more effort put into deploying application (copying\n.war files or context.xml files) as opposed to simply starting it, do you?\nBesides, you have to keep .war or context.xml files somewere outside tomcat to\nbe able to deploy them. The simple enhancement suggested by me allows for\nkeeping the deployed apps inside tomcat (admin app, again ;)\n\nAnyway, I do not need this feature this much, therefore leaving this request as\nWONT FIX up to developers consideration. Remy, don't get mad at me, pls ;)"}]