[{"count": 0, "tags": [], "creator": "hoju@visi.com", "is_private": false, "text": "The Tomcat docs description of how the a deploy works when providing a context\nconfiguration file seem to be wrong (at least with the catalina ant manager tasks).\n\nhttp://jakarta.apache.org/tomcat/tomcat-5.0-doc/manager-howto.html#Deploy%20A%20New%20Application%20from%20a%20Local%20Path\n\nUnder \"Install using a Context configuration \".xml\" file\"...\n\n\"When the optional war parameter is set to the URL for a web application \".war\"\nfile or directory it overrides any docBase configured in the context\nconfiguration \".xml\" file.\"\n\n\nIn my context configuration file, my docBase attribute is just set to\n\"myfile.war\".  That is for use when I send the .war file to the server. \nHowever, during development, I use a local directory for deployment.  As such, I\nprovide the \"war\" attribute to [attempt to] override the \"docBase\" attribute in\nthe config file...\n\n<deploy ...\n    config=\"${app.war.ccf.url}\"\n    war=\"${app.war.url.dir}\" />\n\nWhen I run this, I get...\n\n[catalina-deploy] FAIL - Encountered exception java.util.zip.ZipException: error\nin opening zip file\n\nWhen I remove the \"config\" attribute, it deploys without error, which leads me\nto believe that the \"docBase\" in the config file isn't being ignored when the\n\"war\" attribute is provided as specified in the docs.  Either the docs or the\nant task should be updated to make things consistent.  I'd prefer if the ant\ntask was modified to be consistent with what the docs currently say as this\nwould provide exactly the functionality I need.  Otherwise, I need to have two\ncopies of the config file; one for remote PUT and one for local directory\ndeployment.\n\nBTW, what's the difference between \"war\" and \"localWar\".  Both are defined by\nthe deploy task.  Is \"localWar\" redundant?\n\n\nJake", "id": 48351, "time": "2003-12-01T19:27:00Z", "bug_id": 25120, "creation_time": "2003-12-01T19:27:00Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Sorry for the quick update, but I just realized what might be happening.  \"war\"\ncannot point to a directory, but \"localWar\" can.  It seems to me that the \"war\"\nattribute probably will override the \"docBase\" attribute in the config file, but\nthe \"localWar\" attribute won't.  That is what this bug is.  \"localWar\" should\noverride the config file's \"docBase\" attribute just like the \"war\" attribute\ndoes currently.\n\nSo, this needs to be able to work...\n\n    <catalina-deploy ...\n        config=\"${app.war.ccf.url}\"\n        localWar=\"${app.war.url.dir}\" />\n\nWhere \"docBase\" in ${app.war.ccf.url} is something like \"myapp.war\".\n\n\nJake", "is_private": false, "id": 48352, "creator": "hoju@visi.com", "time": "2003-12-01T19:41:16Z", "bug_id": 25120, "creation_time": "2003-12-01T19:41:16Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "remm@apache.org", "text": "Yes, the war attribute is for uploading the WAR, with the context config file in\n/META-INF/context.xml.\nThe two others are for deploying local resources. So your docBase in your config\nshould be absolute and point out to your war, not as if it was copied to the\nappBase folder.\nSo, use war without config if you don't need it (and put your config in\n/META-INF/context.xml, without a docBase).\n\nI would be very grateful if we could avoid hair splitting bugs, or millions of\nthese could be filed.", "id": 48353, "time": "2003-12-01T19:48:05Z", "bug_id": 25120, "creation_time": "2003-12-01T19:48:05Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 25120, "is_private": false, "id": 48362, "attachment_id": null, "creator": "hoju@visi.com", "creation_time": "2003-12-01T22:17:27Z", "time": "2003-12-01T22:17:27Z", "text": "I understand how to work around it.  I just don't see why it is necessary to\nhave to work around it?  You can call this \"splitting hairs\", but many\nbugs/enhancement requests are, by definition, \"splitting hairs\".  The\nfunctionality doesn't quite meet expectations, therefore a bug/enhancement\nrequest.  Anyway...\n\nThere is already the ability to override the \"docBase\" attribute in the config\nfile by providing a \"war\" attribute.  If I provide the \"localWar\" attribute, I\nprovide it for the same reason as I did with the \"war\" attribute.  So, why not\nthe same behavior of ignoring the \"docBase\" in the config file?  The thing is, I\nhave stuff where I do require the config file (loggers, connection pools,\noverriding environment variables, etc...).  I also currently have a single\nconfig file with the docBase set to a default of \"myapp.war\" which is only used\nwhen actually uploading a file to a server.  I now have to create a separate\nconfig file whith the only difference being the lack of a \"docBase\" attribute. \nAgain, this seems inconsistent and unnecessary.\n\nI won't reopen this if you really think it is invalid, but it is most certainly\ninconsistent behavior and at least that is noted here.\n\nJake"}]