[{"count": 0, "tags": [], "creator": "kevinj@develop.com", "attachment_id": null, "id": 48375, "time": "2003-12-02T11:20:29Z", "bug_id": 25133, "creation_time": "2003-12-02T11:20:29Z", "is_private": false, "text": "I have a very simple filter that calls response.addHeader both before and after\ncalling chain.doFilter. Before chaining the header is added, after chaining the\nheader is not added. Also I cannot set the value of the header after chaining,\nor set a cookie.\n\nTo see this failure\n\nTry this, browse to http://localhost:8080/index.jsp. For the page itself I see a\n200 response and all my headers being set. For the gifs I get a 200 but only the\nheaders I set *before* calling chain.doFilter are set. If I then refresh I get a\n304 Not Modified response (for the gifs) from tomcat and all the headers are set!"}, {"count": 1, "tags": [], "bug_id": 25133, "is_private": false, "id": 48378, "creation_time": "2003-12-02T11:47:53Z", "time": "2003-12-02T11:47:53Z", "creator": "funkman@joedog.org", "text": "After the chain has been executed, the response was committed. Once the response\nis committed, no headers (which is what a cookie is) may be added. \n\nTo get around this - you need to wrap the ServletOutputStream and buffer it to\nprevent it from being committed. There are many articles on the net about\nfilters and wrappers.", "attachment_id": null}, {"count": 2, "tags": [], "text": "Thanks Tim\n\n> To get around this - you need to wrap the ServletOutputStream and buffer it to\n> prevent it from being committed. There are many articles on the net about\n> filters and wrappers.\n\nd'oh! and I've written a few of them so I should have realised this :)\n\nHowever, the response will have been committed after a 304  yet the headers are\nthen set, so I would still regard this as a bug. I would think thet after\nreturning from a doFilter, logically speaking, either the response is committed\nor it isn't. What was confusing to me is that I see the headers in one case but\nnot in the other. I realise that a 304 contains no data, but logically it is a\ncommitted response", "attachment_id": null, "bug_id": 25133, "id": 48379, "time": "2003-12-02T12:11:25Z", "creator": "kevinj@develop.com", "creation_time": "2003-12-02T12:11:25Z", "is_private": false}, {"count": 3, "tags": [], "text": "No content is sent back on a 304. Only a header is sent to the client. With\nthose situations, to response is not committed by the time doFilter() returns.\nTypically the response gets committed when the output buffer is full, but in the\ncase of a 304 (and maybe very small files) it does not. \n\nThe spec doesn't dictate exactly when (in time of request) the response is\ncommitted. If it did - then no one would be allowed to write XSL filters (or\nsimilar) to transform the response data after the previous link in the chain was\nexecuted.", "attachment_id": null, "bug_id": 25133, "id": 48380, "time": "2003-12-02T12:40:32Z", "creator": "funkman@joedog.org", "creation_time": "2003-12-02T12:40:32Z", "is_private": false}]