[{"count": 0, "tags": [], "text": "If you're using an HTTP Proxy Server, the \"Restart\" button is enabled only when\nthe proxy is running and you change a field that requires a restart to take\neffect (that's mostly all fields except the target).\n\nBut if you select another component from the tree and then come back to the HTTP\nProxy Server, the button will always be enabled -- even if no such change was one.\n\nThis is because populating the GUI from the values in the ProxyControl object\n(\"configure\" method) triggers all the action events. Should not be too difficult\nto fix, but still requires an amount of code shuffling and so it's too long for\nme to do it now.", "is_private": false, "id": 48392, "creator": "jsalvata@atg.com", "time": "2003-12-02T17:11:15Z", "bug_id": 25143, "creation_time": "2003-12-02T17:11:15Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 25143, "is_private": false, "id": 50707, "attachment_id": null, "creator": "jsalvata@atg.com", "creation_time": "2004-01-19T02:06:25Z", "time": "2004-01-19T02:06:25Z", "text": "Sorry, I didn't intend to assign THIS one to myself [yet]."}, {"count": 2, "tags": [], "creator": "lalit_sahoo_1999@yahoo.com", "is_private": false, "text": "I am using http proxy server for recording.I have changed the proxy port to \n9090.I have also changed the proxy setting in Internet Explorer browser.Then i \npressed the start button in proxy server gui and entered a test url in the \nbrowser.As soon as the recording finished the \"Restart\" button is enabled in \nthe proxy server gui.I think it should be enabled only when we change anything \nin gui fields.It seems to be a bug.\n\nCan anybody pls confirm it?", "id": 56064, "time": "2004-04-20T06:50:27Z", "bug_id": 25143, "creation_time": "2004-04-20T06:50:27Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 25143, "is_private": false, "id": 56289, "attachment_id": 11316, "creator": "performance@applabs.net", "creation_time": "2004-04-23T06:50:53Z", "time": "2004-04-23T06:50:53Z", "text": "Created attachment 11316\nTo fix the problem with Restart button in Http Proxy Server"}, {"count": 4, "tags": [], "text": "I fixed this issue in my machine by changing ProxyControlGui.java and now the \nabove mentioned problem with Http Proxy Server is not appearing.\n\nI attached a document containing the code changes made in ProxyControlGui.java", "is_private": false, "id": 56290, "creator": "performance@applabs.net", "time": "2004-04-23T06:51:59Z", "bug_id": 25143, "creation_time": "2004-04-23T06:51:59Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "sebb@apache.org", "text": "Fixed in CVS HEAD.\n\nSeems it is only the groupingMode Combo box that receives action events when the\nProxy GUI is selected, so only needed to provide the itemListener for that.\n\nAlso fixed missing restart for changes of target.\nThe target combo box does not seem to receive action events when the window is\nselected - this is probably because the listener is temporarily disabled.", "id": 76325, "time": "2005-06-12T14:26:58Z", "bug_id": 25143, "creation_time": "2005-06-12T14:26:58Z", "is_private": false, "attachment_id": null}]