[{"count": 0, "tags": [], "creator": "kpandeyktm@yahoo.com", "is_private": false, "text": "I'm trying to extract hidden from value using .* in http request setup form.\n\nif the html response  is like so -\n <input type=\"hidden\" name=\"iespid\" value=\"PanelId_257\"> \n\nthen PanelId_257 is correctly extracted and sent out in next request as value \nfor iespid.\n\nHowever if its like so\n <input type=\"hidden\" name='iespid' value='PanelId_42'>\n\nthen it fails as passes .* as value for iespid in next request.\n\nThe W3C HTML 4.0 validator doesn't raise any issue with single quotes so I'm \nassuming that it is a valid syntax in HTML.\n\nI'm able to reproduce this bug with Jmeter 8.1 as well.", "id": 48436, "time": "2003-12-03T19:08:51Z", "bug_id": 25177, "creation_time": "2003-12-03T19:08:51Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Yes, you're right: single quotes are allowed too to delimit HTML attributes.\n\nBut the problem you describe must certainly be related to the regular expression\nyou're using -- not to the extractor itself. Can you please post the regular\nexpression that is failing to correctly parse your inputs?", "attachment_id": null, "id": 48439, "creator": "jsalvata@atg.com", "time": "2003-12-03T20:08:44Z", "bug_id": 25177, "creation_time": "2003-12-03T20:08:44Z", "is_private": false}, {"count": 2, "tags": [], "text": "I used the UI to record the clicks using the proxy server.\nAfter that edited the HTML request form and used the value .* for param iespid \nin the \"Send Parametes with Request\" section of the Form.\n\nHope that helps. \n\n ", "is_private": false, "id": 48445, "creator": "kpandeyktm@yahoo.com", "time": "2003-12-04T00:00:07Z", "bug_id": 25177, "creation_time": "2003-12-04T00:00:07Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "OK. So you're not talking about the Regular Expression Extractor, but about the\nHTML Link Parser, are you? [Changing summary -- will change back is answer is NO]\n\nI've tested with 1.9.1 and with the current CVS, and they both work with single\nquotes, double quotes, or no quotes at all in either the name or the value.\n\nPlease double-check your test case. In particular, check the only difference\nbetween the working and the non-working case is in the quotes. If there's indeed\na bug, I would appreciate a full procedure to reproduce (test plan, page with\nthe form, instructions).\n", "is_private": false, "id": 48447, "creator": "jsalvata@atg.com", "time": "2003-12-04T01:03:46Z", "bug_id": 25177, "creation_time": "2003-12-04T01:03:46Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 25177, "attachment_id": null, "id": 48583, "time": "2003-12-05T18:35:11Z", "creator": "kpandeyktm@yahoo.com", "creation_time": "2003-12-05T18:35:11Z", "is_private": false, "text": "Sorry for the confusion, I meant the HTML Link parser.\nI'm trying to create test case with static html content in jsp pages and guess \nwhat it works. I copy pasted the html where it errored out into a jsp page \nand dingle quote gets correctly extracted. Only the dynamically generated \ncontent from jsp is failing. I'm at a loss right now. Let me look into some more \nto see if I can find any differences.\n\n"}, {"count": 5, "attachment_id": null, "bug_id": 25177, "text": "Closing as not a bug. Please reopen if there is actually a bug -- or file a new\none if it's not the quotes (single/double) that matter, but something else.", "id": 49409, "time": "2003-12-19T03:05:35Z", "creator": "jsalvata@atg.com", "creation_time": "2003-12-19T03:05:35Z", "tags": [], "is_private": false}]