[{"count": 0, "tags": [], "bug_id": 25236, "text": "I already reported in #25208 upon superfluous horizontal scrollbars\nin several listener windows. In the present case, there are two\nvertical scrollbars to the right hand side of the assertion results view.\n\nI have ~1000 assertion results.  The outer scrollbar for the whole\nassertion results frame defines a region so huge that only ~1/5 of\nthe scrollbable region is non-empty, the rest is grey.  When in the\nupper part (the non grey one), the inner scrollbar and some assertion\nresults become visible, and the inner scrollbar allows to scroll the\nassertion results. It's hard to tell, but the inner scrollbar knob is\nmaybe 1/10 the size of the scrollable view.\n\nIn Motif speak, it looks like JMeter doesn't get some frame\nconstraints right. The bottom of the assertion results frame should be\nlinked to the enclosing frame/window's lower border (plus some other\nconstraints), so that it resizes according to the application's window\nsize. The currently displayed outer scrollbar should never be necessary.\n\nThe view table results gets this mostly right. There, a second (outer)\nscrollbar appears only if I make the application's window somewhat\nsmall. Yet IMHO it should appear only when I make it even much smaller\nthan currently: it still requires a large screen to avoid double scrollbars.\n\nFor instance, a vertical scrollbar only appears in the graph results\nview if I make it *really* small. Table results should behave similarly.\nSame for assertion results.", "id": 48559, "time": "2003-12-05T10:30:57Z", "creator": "Joerg-Cyril.Hoehle@t-systems.com", "creation_time": "2003-12-05T10:30:57Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Annoying, but minor.", "is_private": false, "bug_id": 25236, "id": 51035, "time": "2004-01-23T02:11:12Z", "creator": "jsalvata@atg.com", "creation_time": "2004-01-23T02:11:12Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Fixed in 2.1 branch - finally!", "is_private": false, "bug_id": 25236, "id": 88654, "time": "2006-04-29T14:38:38Z", "creator": "sebb@apache.org", "creation_time": "2006-04-29T14:38:38Z", "attachment_id": null}]