[{"count": 0, "attachment_id": null, "bug_id": 2526, "text": "We have been using tomcat for the past one year and so far we found that all \nour web based applications working well with that.Now we found some bugs which \nwe are unaable to resolve it.We are in the process of doing an airline \nticketing project.We use JSP/java beans/servlets with tomcat as web server.In \nthis project our server sends request to another server to get response.And \nbefore the response could come the tomcat in our server shuts down \nautomatically.And we can see in the screen the following :\n\nInternal Server Error:\nThe server encountered an internal error or unable to complete your \nrequest.Please contact the server administrator and inform them of the time the \nerror occured and anthing you might have done that might have caused the error.\n\nWe are unable to trace out why this happens.Every time we send request after a \nminute or so we get response time out error and immediately after that we found \nthat tomcat shut down.Please explain us what are the possibilities  that such \nerrors could happen.And we would be glad if we could get a positive reponse \nfrom you as early as possible.\nThank You", "id": 3524, "time": "2001-07-09T19:13:54Z", "creator": "vemanap@yahoo.com", "creation_time": "2001-07-09T19:13:54Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 2526, "attachment_id": null, "is_private": false, "id": 3622, "time": "2001-07-11T05:47:21Z", "creator": "Larry.Isaacs@sas.com", "creation_time": "2001-07-11T05:47:21Z", "text": "I don't recall any known problems in Tomcat 3.2 that resulted in spurious\nshutdowns.  I do recall a couple of instances where a bean used by a JSP was\ncalling System.exit() in response to an error, which will have this effect.\n\nI would highly recommend trying Tomcat 3.2.2, if you haven't already, to see if\nthe problem still persists there.  It is at 3.2.3 where any bug fix would have\nto occur anyway.  Please update this bug report with your results."}, {"count": 2, "tags": [], "bug_id": 2526, "attachment_id": null, "is_private": false, "id": 4519, "time": "2001-08-12T20:15:44Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-08-12T20:15:44Z", "text": "Not enough data, we can't reproduce it. Please reopen the bug with more\ninformations if you believe it's a tomcat problem. "}]