[{"count": 0, "tags": [], "bug_id": 25327, "attachment_id": null, "is_private": false, "id": 48677, "time": "2003-12-08T15:52:40Z", "creator": "ajack@trysybase.com", "creation_time": "2003-12-08T15:52:40Z", "text": "If a user (e.g. Gump, or whatever) selects a Java VM (perhaps a certain \ninstance), or sets system properties (e.g. java.awt.headless, or \nbootclasspath ), forked VMs don't match this. As such, scripts can fail based \nupon the default environment (which gives the new forked Ant VM).\n\nI can see this in three parts:\n\n1) JVM instance (this might just have to be left to the OS path)\n2) Classpaths (ought bootclasspath be expressed here, or ought we use endorsded)\n3) System properties (default behaviour ought be to clone all).\n\nI believe that this is a JVM problem (it ought allow a 'fork'), and I wonder if \nothers have solved it & ant could borrow that."}, {"count": 1, "tags": [], "bug_id": 25327, "attachment_id": null, "is_private": false, "id": 48965, "time": "2003-12-12T09:48:11Z", "creator": "bodewig@apache.org", "creation_time": "2003-12-12T09:48:11Z", "text": "OK, let's see\n\n(1) is Ant's default behavior.  We shouldn't fiddle with it at all.  If a build\nfile specifies a different VM (by using <java>'s or <junit>'s vm attribute), it\nis going to break in Gump anyway as you have to know the absolute path to the VM.\n\n(2) there is an undocumented sun.boot.class.path system property, I've abused it.\n\n(3) has been rather simple.\n\nNote that cloning the VM in that way can not become Ant's default behavior for\nbackwards compatibility reasons.\n\nFor starters I've added cloneVm attributes to <java> and <junit> that enable\ncopying of system properties and the bootclasspath.  The later only if the user\nhasn't explicitly set a bootclasspath in the task (or build.sysclasspath is\n\"only\" as Ant's going to ignore the user specified path in that case).\n\nI've also added a system property build.clonevm that sets the default for said\nattributes to true instead of false (if build.clonevm == \"true\").\n\nIt has to be a system property to work right now - I'm not happy with this\nand that's why I don't close the report ATM, but we should first give it a try\nto see whether this improves the Axis situation."}, {"count": 2, "tags": [], "text": "It looks as if the feature has worked quite well for Gump.  I've added some\ndocumentation for it so that I can now close this report.  I don't see any way\nto make build.clonevm an Ant property without major surgery.\n", "is_private": false, "id": 55399, "creator": "bodewig@apache.org", "time": "2004-04-06T14:10:03Z", "bug_id": 25327, "creation_time": "2004-04-06T14:10:03Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 25327, "attachment_id": null, "text": "I agree it is working (well).", "id": 55402, "time": "2004-04-06T14:34:01Z", "creator": "ajack@trysybase.com", "creation_time": "2004-04-06T14:34:01Z", "is_private": false}]