[{"count": 0, "tags": [], "bug_id": 25338, "is_private": false, "text": "A URI is improperly distpatched when the ;jsession=xxx is added to the URI.\n  The catalina lookup uses everything from the URI:hostname:port to the ? \ndelimiter to define a \"resource\".  When ;jsession=xxx is added upon the uri for \nreturn the resource is not found.  The published FIX is to enable the apache-\nweb-server's mod_rewrite and have the webserver fix this for tomcat... this is \nan inappropriate fix.  Since tomcat is bundled in Jboss as a stand-alone \nwebservice (and when tested in stand-alone, without apache), it can not use the \napache-mod_rewrite hack.  The catalina module needs to correctly handle the \nresource information, if the ;jsession=xxx is not within spec, then for \ncompliance to spec this habit will have to change.\n\n  Another bug discovered while debugging this issue... \n\n  The filter-mapping /* does not filter calls to the traditional servlet-\nmapping=\"*.do\" for struts.  This breaks the filter-mapping concept.  Luckily \nfor me the ;jsession=xxx bug is not caught by the servlet *.do mapping and my \nfilter can catch this to reroute it to the appropriate resource.\n\nI suggest looking into the Catilina dispatcher and uri parsing semantics\nI do not have time to fully debug this :(", "id": 48691, "time": "2003-12-08T20:47:09Z", "creator": "paulkossler@yahoo.com", "creation_time": "2003-12-08T20:47:09Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 25338, "attachment_id": null, "text": "This report is too generic. There is insufficient information to reproduce the\nissue.\n\nOn this basis, I am closing this is invalid. If this is re-opened, please\nprovide step-by-step instructions to reproduce or better still a simple test WAR\nthat demonstrates the problem.\n\nI suspect that the filter bug may be a configuration issue rather than a bug.\nEither way bugzilla items should be limited to a single issue so if you are\nunable to resolve the fiter issue via posting on the tomcat-user mailing list\nplease open a new bugzilla item.\n\n", "id": 71584, "time": "2005-02-27T20:18:08Z", "creator": "markt@apache.org", "creation_time": "2005-02-27T20:18:08Z", "is_private": false}]