[{"count": 0, "tags": [], "creator": "Joerg-Cyril.Hoehle@t-systems.com", "attachment_id": null, "is_private": false, "id": 48754, "time": "2003-12-09T18:09:07Z", "bug_id": 25366, "creation_time": "2003-12-09T18:09:07Z", "text": "Hi,\n\nplease select the workbench icon and from there, either the pop-up open menu or \nthe normal window border file->open menu. Loaded elements will be added randomly \nto either workbench or testplan.\n\nThis happens here using various .jmx files (also several times the same one).\n\nThis makes JMeter somewhat unusable, since it's easy to corrupt one's test \nplans.\n\nThis is what happens on MS-Windows. On Linux using Suse-Linux 9, I have yet to \nmanage to have JMeter open something in the workbench instead of the test plan \n:-(\n\nI'm using the german localized 1.9.1. [-- but would rather not like to (see \nother bug reports from someone else) and don't know how to switch that off. The \nmenu to select a language is too late, since many boxes have already been \ncreated and the damage is done.]\n\nUsing JDK-1.4.2 on both machines, _02 on MS-Windows, -b28 on Linux.\n\nThe jmeter.log file contains no mention of error, just about loading files.\n\nI really hope the various GUI issues that have been reported to the \nbugtracker will get cleaned up by somebody knowledgeable.\n\nRegards"}, {"text": "This behaviour sounds like the JMX files might not be complete test-plans. But \nI could be wrong.\n\nBy the way, the Open menu command currently merges in the new file; it does not \nclear the existing contents first.\n\nPlease can you post a simple example JMX file (as an attachment to this bug) so \nwe can try and investigate further?\n\nS", "tags": [], "bug_id": 25366, "is_private": false, "count": 1, "id": 49236, "time": "2003-12-17T11:02:35Z", "creator": "sebb@apache.org", "creation_time": "2003-12-17T11:02:35Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "Joerg-Cyril.Hoehle@t-systems.com", "is_private": false, "id": 50411, "time": "2004-01-12T14:52:07Z", "bug_id": 25366, "creation_time": "2004-01-12T14:52:07Z", "tags": [], "text": "I'm sorry, I cannot reproduce it any more. I don't know whether it may have \ndepended on a particular test plan file. I tried some of the many testplan \nvariations I'm currently using and could not make the bug reappear.\n\nSo I'll change the status to \"Works For Me\".\nBTW, it would still be nice to be able to open something under the workbench. \nCurrently, copying elements from one testplan to another is a nightmare, because \nall top-levels are merged, so I don't know which element came from where"}]