[{"count": 0, "tags": [], "text": "mod_log_config with buffered logging turned on shows corrupted log lines when\nserving at very high volumes using the worker mpm.  This is very consistent\nbehaviour with all recent versions of 2.0.\n\nThe problem appears to be that the per-child buffer management is not thread\nsafe.  There is nothing to prevent the memcpy operations in\nap_buffered_log_writer by different threads from overlapping.\n\nSince this is a problem that happens at high volume, adding a mutex around this\nisn't necessarily the most attractive option.  Also, it is unclear whether or\nnot a thread mutex is good enough.  mod_rewrite uses a global mutex for its logging.", "is_private": false, "bug_id": 25520, "id": 49112, "time": "2003-12-15T01:10:26Z", "creator": "adam.sussman@ticketmaster.com", "creation_time": "2003-12-15T01:10:26Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "A thread mutex should be good enough for handling the buffer and possibly\nflushing.  Each process would be atomically appending a set of complete trace\nrecords to the file, and that doesn't have to be handled explicitly by\nmod_log_config.  With buffered logs there will be a much higher incidence of out\nof order records, but that can happen already.\n\nI wonder if the big picture is that for a threaded MPM config you're better off\nshoving everything to a piped logger to handle in its simple way rather than\nadding serious mutex contention to the web server.  Still, the code to make it\nfunctionally correct is relatively simple so it should be implemented and the\nuser should get to decide which is more appropriate.\n", "is_private": false, "bug_id": 25520, "id": 49324, "time": "2003-12-18T12:43:44Z", "creator": "trawick@apache.org", "creation_time": "2003-12-18T12:43:44Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "trawick@apache.org", "text": "fix just committed to Apache 2.1-dev...  I'll propose it for backport once folks\nhave had a chance to look at it\n\nThanks for your report, and thanks for using Apache!\n", "id": 50672, "time": "2004-01-17T00:17:54Z", "bug_id": 25520, "creation_time": "2004-01-17T00:17:54Z", "is_private": false, "attachment_id": null}]