[{"count": 0, "tags": [], "creator": "rpr@senergisul.com.br", "attachment_id": null, "id": 49270, "time": "2003-12-17T20:03:38Z", "bug_id": 25600, "creation_time": "2003-12-17T20:03:38Z", "is_private": false, "text": "I have an application running on Tomcat 4.1.27, who uses an HttpSessionListener \nto intercept session invalidations. It runs OK, according with the 2.3 servlet \nspec, which says that the sessionDestroyed method must be called AFTER the \nsession is already invalidated. (I had a lot of pain to build a logic that \ncould overcome this behavior). Well, today, I moved the same application to \nTomcat 5.0.16 and - for my surprise - the sessionDestroyed is now called BEFORE \nthe session is invalidated... I KNOW that this is the correct behavior \naccording to 2.4 servlet spec, and I fixed my listener to work with it. \n\nThe problem now, is that the sessionDestroyed method is being called TWICE: one \nBEFORE the session is invalidated and another AFTER the session is already \ninvalidated, in THE SAME INVALIDATION PROCESS !  And more: it only happens when \nthe session expires - after timeout is reached. It does NOT happen when I \nexplicity invalidate the session, with \"session.invalidate()\". My listener is \nfull of logs and that's the only reason I could figure this out....\n\nI just want to know if this is the correct behavior for the 2.4 servlet spec, \nor if it's a bug... I can overcome this too, but I think that if there's \nsomething wrong, it must fixed...\n\nThanks,\nRoberto (Ironman)"}, {"count": 1, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "id": 49284, "time": "2003-12-17T21:56:34Z", "bug_id": 25600, "creation_time": "2003-12-17T21:56:34Z", "is_private": false, "text": "Please don't whine, we didn't introduce this bug on purpose just to annoy you,\nand the issue has been fixed already. The patch can be applied easily if you\nneed it.\n\n\n  Index: StandardManager.java\n  ===================================================================\n  RCS file:\n/home/cvs/jakarta-tomcat-catalina/catalina/src/share/org/apache/catalina/session/StandardManager.java,v\n  retrieving revision 1.15\n  retrieving revision 1.16\n  diff -u -r1.15 -r1.16\n  --- StandardManager.java\t29 Nov 2003 18:06:35 -0000\t1.15\n  +++ StandardManager.java\t5 Dec 2003 09:28:55 -0000\t1.16\n  @@ -813,13 +813,7 @@\n           for (int i = 0; i < sessions.length; i++) {\n               StandardSession session = (StandardSession) sessions[i];\n               if (!session.isValid()) {\n  -                try {\n  -                    expiredSessions++;\n  -                    session.expire();\n  -                } catch (Throwable t) {\n  -                    log.error(sm.getString\n  -                              (\"standardManager.expireException\"), t);\n  -                }\n  +                expiredSessions++;\n               }\n           }\n           long timeEnd = System.currentTimeMillis();\n\n\n*** This bug has been marked as a duplicate of 25234 ***"}, {"count": 2, "text": "I didn't mean to sound rude or anything else, guys... It happens that English \nis not my \"mother language\" - I use it only for business and technically... So, \nI don't use to worry about diplomacy while I'm writing - I just go straight to \nthe point. I'm old enough to know that we must treat people the way we want to \nbe treated, but this is something that I do in my natural language only...\n\nWell, as I said before, I can overcome that \"triggering twice\" problem of \nTomcat, but I wanted to know WHAT was happening... Now I do...:D\n\nAnd since I don't have the needed patience to apply patches, I'll wait until \nthe next release (or sub-release) of Tomcat... Could you PLEASE tell me when \nthe \"5.0.17\" sub-release will be available - with this tiny problem fixed ?\n\nThanks for the attention,\nRoberto", "bug_id": 25600, "is_private": false, "id": 49314, "time": "2003-12-18T11:13:16Z", "creator": "rpr@senergisul.com.br", "creation_time": "2003-12-18T11:13:16Z", "tags": [], "attachment_id": null}]