[{"count": 0, "tags": [], "bug_id": 25711, "is_private": false, "id": 49569, "attachment_id": null, "creator": "eric@timebytes.com", "creation_time": "2003-12-22T20:22:33Z", "time": "2003-12-22T20:22:33Z", "text": "When 'p4submit' finishes, it sets the property p4.needsresolve to 1 if the \nsubmit failed because some files need to be resolved before submission.  That's \nok.  However, the docs state that p4submit sets the property to 0 if it \nsucceeded.\n\nThat's incorrect behavior - firstly, because the target call flags 'if' \nand 'unless' check only if the property is set, not if it's set to 1.  This \nmeans it's harder to check if your perforce submit succeeded.  \n\nThe second problem is that ant properties are immutable - once they're set, \nthey can't be changed.\n\nThat means I can't have my ant script do more than one submit at a time, \nbecause I won't be able to detect the results of the second submit.  That's not \nhelpful.\n\nI recognize there might be some backward-compatiblity issues - perhaps we \nshould leave the existing property intact, and add a new property - \np4.resolveneeded."}, {"count": 1, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "id": 49608, "time": "2003-12-23T15:01:34Z", "bug_id": 25711, "creation_time": "2003-12-23T15:01:34Z", "is_private": false, "text": "Eric, you are right, there is a problem here. I wrote this task :-( and I\nfollowed the bad example of other Perforce tasks which call Project.setProperty().\n\nThe real solution - conform to the ant philosophy about properties - would be to\nadd an attribute p4needsresolveproperty where the user would give a name to a\nproperty which would be set if the submit needs resolve.\n\nWill try to add this new attribute for ant 1.6.1.\n\nCheers,\nAntoine"}, {"count": 2, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "id": 50617, "time": "2004-01-15T20:51:23Z", "bug_id": 25711, "creation_time": "2004-01-15T20:51:23Z", "is_private": false, "text": "I have left the changing of p4.change and the setting of p4.needsresolve as is.\nIntroduced 2 new optional attributes for the p4submit task :\nneedsresolveproperty and changeproperty.\nSee the docs in CVS for explanations."}]