[{"count": 0, "tags": [], "creator": "campbellcs@ldschurch.org", "attachment_id": null, "id": 49632, "time": "2003-12-23T19:49:51Z", "bug_id": 25734, "creation_time": "2003-12-23T19:49:51Z", "is_private": false, "text": "XmlLogger loses track of what it is supposed to log when a build file contains \na parallel task that calls into multiple sub builds (via the ant task)."}, {"count": 1, "tags": [], "text": "Sorry for latency in looking at this.\nI have tried a simple build, and it seems to work ok.\nWhat is the problem you notice?\n", "attachment_id": null, "bug_id": 25734, "id": 95016, "time": "2006-10-20T10:44:04Z", "creator": "peterreilly@apache.org", "creation_time": "2006-10-20T10:44:04Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 25734, "is_private": false, "text": "We are hitting a similar issue in our nightly build, running Ant 1.6.5 on \nLinux. This build runs a lot of parallel tasks, and occasionally the XML log \nloses task and target elements that should appear as children of the main build \nelement. The XML log is well formed, but incomplete -- there are targets that \ncomplete with no corresponding log output. The build itself finishes \nsuccessfully, and the unlogged targets appear to run successfully (expected \nbuild products are created and separate logs from forked parallel builds are \ncomplete). We aren't able to reproduce this reliably in testing on the same \ninput that failed the night before, and it does not happen every run of the \nnightly build. It may be related to timing issues with clearcase server access, \ncopying across network file systems, etc.", "id": 109313, "time": "2007-10-12T14:30:04Z", "creator": "Craig.Sandvik@sybase.com", "creation_time": "2007-10-12T14:30:04Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "Looking at code for XMLLogger, should there be serialization of the DOM element \nmodifications? In particular, when targets and tasks complete in different \nthreads, and append their output to a common parent DOM element, what \nserializes these appends to the parent's node list? There is no serialization \nin XMLLogger. Are log calls serialized in the main Ant code before calling the \nbuild listener/logger methods?", "attachment_id": null, "bug_id": 25734, "id": 109314, "time": "2007-10-12T14:33:07Z", "creator": "Craig.Sandvik@sybase.com", "creation_time": "2007-10-12T14:33:07Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 25734, "is_private": false, "text": "Every time this topic comes up, I have to remind people that logging in parallel\nexecution environments is extremely complex & not for the faint of heart.\n\nAt IBM we use a custom Antlib to build the WebSphere family of products. One of\nthe tasks in that antlib handles parallel build dispatch for our many components\nbased on registered dependencies (of which we have defined our own metadata format).\n\nStrangely enough the most complicated part of getting the parallel dispatch to\nwork was not the actual dispatch, but rather getting the logs to make any sense.\nWe found that the standard Ant loggers just aren't up to the task for massively\nparallel builds. This is no reflection on Ant: it wasn't designed to handle this\nkind of environment.\n\nWe ended up writing our own custom logger that uses stacks & thread locals to\npresent the logging information in a format that is understandable by a human.\nyou may need to do something similar if you are highly parallel.", "id": 109320, "time": "2007-10-12T19:35:58Z", "creator": "carej@us.ibm.com", "creation_time": "2007-10-12T19:35:58Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 25734, "attachment_id": null, "id": 109350, "time": "2007-10-15T07:23:21Z", "creator": "stevel@apache.org", "creation_time": "2007-10-15T07:23:21Z", "is_private": false, "text": "Jeffrey, I can assure you distributed logging is worse, where you can't reliably\nserialize an exception as the thing at the far end may not have all the needed\nclasses. \n\nLet's assume there's a race condition here, with two options\n\n- out of order execution => bad XML. If two threads A, B entered some tasks in\nthat order, and exited in the order B, A...the closing braces would be written\nout of order. \n\n- lossy manipulation of the results. Non-atomic updates to the graph could lose\nbits added by other threads.\n\nIt sounds like the second of these is at work. \n\n"}, {"count": 6, "tags": [], "bug_id": 25734, "is_private": false, "text": "Created attachment 20992\nFiles to repro and candidate fix for XMLLogger", "id": 109412, "time": "2007-10-16T21:38:50Z", "creator": "Craig.Sandvik@sybase.com", "creation_time": "2007-10-16T21:38:50Z", "attachment_id": 20992}, {"count": 7, "tags": [], "creator": "Craig.Sandvik@sybase.com", "attachment_id": 20993, "id": 109413, "time": "2007-10-16T21:46:07Z", "bug_id": 25734, "creation_time": "2007-10-16T21:46:07Z", "is_private": false, "text": "Created attachment 20993\nPatch diffs for candidate fix to 1.7.0 XMLLogger\n\nThis is the diff file for the candidate patch created against 1.7.0 source\ndownload. Source and diff files are also included with repro in previous\nattachment '20992: Files to repro and candidate fix for XMLLogger'."}, {"count": 8, "tags": [], "bug_id": 25734, "is_private": false, "text": "Reassigning with repro and candidate patch submitted.", "id": 109414, "time": "2007-10-16T21:47:29Z", "creator": "Craig.Sandvik@sybase.com", "creation_time": "2007-10-16T21:47:29Z", "attachment_id": null}, {"count": 9, "tags": [], "creator": "formyspam@mail.ru", "attachment_id": null, "text": "Is the current version patched? Or I would have to rebuild ant with this patch?\n", "id": 109934, "time": "2007-10-29T23:08:22Z", "bug_id": 25734, "creation_time": "2007-10-29T23:08:22Z", "is_private": false}, {"count": 10, "tags": [], "bug_id": 25734, "is_private": false, "text": "(In reply to comment #9)\n> Is the current version patched? Or I would have to rebuild ant with this \npatch?\n\nThe patch is against 1.7.0 source. You need to download that source, apply\nthe patch, and rebuild. The changes also work in 1.6.5, but you'll need to \nmanually merge the diffs (or replace XMLLogger.java in 1.6.5 source with \npatched XMLLogger.java from 1.7.0 source). ", "id": 109952, "time": "2007-10-30T07:41:05Z", "creator": "Craig.Sandvik@sybase.com", "creation_time": "2007-10-30T07:41:05Z", "attachment_id": null}, {"count": 11, "tags": [], "text": "it is probably more of a JDK or machine than an OS issue (I can verify missing log messages on Windows while I don't seem them on Linux).\n\nYou are certainly right, invoking appendchild unsynchronized is causing the problems.  I just hope the added synchronization doesn't eat too much time in the serial execution case.\n\nIt may be an option to have a separate synchronized logger for people using parallel.\n\ncommitted as revision 675993, we'll see where the discussion on the dev list is heading.", "attachment_id": null, "bug_id": 25734, "id": 118570, "time": "2008-07-11T08:47:07Z", "creator": "bodewig@apache.org", "creation_time": "2008-07-11T08:47:07Z", "is_private": false}]