[{"count": 0, "tags": [], "creator": "hauser@acm.org", "attachment_id": null, "id": 49671, "time": "2003-12-24T15:09:19Z", "bug_id": 25747, "creation_time": "2003-12-24T15:09:19Z", "is_private": false, "text": "yes, I know, there is the FAQ and this is a minor thing...\nbut anyway, it would be great that when hitting\n<<log4j:WARN No appenders could be found for logger (com.mydomain.test.app.myTest).\nlog4j:WARN Please initialize the log4j system properly.>>\n\nTo save people a lot of time to figure out to solve this, I suggest:\n1) to quote the above URL in that error message\n2) to tell the user where you really were looking - absolute path (yes, I know\nthat class-loading thing is the fault of the Java Guys or those who decided that\ndifferent platform have different path names...)\n3) in the FAQ, point to configuration section of\nhttp://logging.apache.org/log4j/docs/manual.html or even cite some code snippets\nlike\n\nPropertyConfigurator.configure(args[0]);\n  or \nPropertyConfigurator.configure(\"log4j.properties\"); //relative to \n                                                    //\"classpath-root\""}, {"count": 1, "tags": [], "creator": "thorbjoern@gmail.com", "attachment_id": null, "text": "I agree, the message should be improved.\n\nHowever, the most frequent annoyment with log4j I have met is the NEED to have log4j.properties/.xml files and those that linger around when they should have been deleted.\n\nI suggest that the default behaviour in THIS situation is to log a more descriptive message and call BasicConfigurator.configure() to get a plain console appender running.\n", "id": 119301, "time": "2008-08-02T15:31:21Z", "bug_id": 25747, "creation_time": "2008-08-02T15:31:21Z", "is_private": false}, {"count": 2, "text": "Disabling logging when no configuration could be found was a explicit design issue since certain environments (such as Webapps) logging to the console is undesirable.\n\nJDK 1.4 logging has a fallback configuration file that is provided with the JDK, so it never runs into the lack of configuration problem.  log4j 2.0 could possibly delegate to JDK 1.4 logging if no other configuration was found.  Added issue LOG4J2-23 for that.\n\nAdded a message pointing to the FAQ, but there is not much that we can easily do to display the class loader's strategy for locating resources.\n\nCommitted rev 685228.", "creator": "carnold@apache.org", "is_private": false, "id": 119732, "time": "2008-08-12T10:03:44Z", "bug_id": 25747, "creation_time": "2008-08-12T10:03:44Z", "tags": [], "attachment_id": null}]