[{"count": 0, "tags": [], "bug_id": 25828, "attachment_id": null, "text": "SDK 1.4.x comes with xerces and xalan built in. There are a few\nmethods to run one's own xerces and xalan. The java property\njava.endorsed.dirs is a good method. This patch starts java with\njava.endorsed.dirs defined pointing to ${FOP_HOME}/lib/endorsed.\n\nTo make this work, xerces.jar, xalan.jar and xml-apis.jar should be\nmoved to the new directory lib/endorsed in the distribution.  With the\npatch fop.sh and fop.bat remain functional while these jar files are\nin lib, but then it does not add functionality. I have tested fop.sh\non Linux.", "id": 49861, "time": "2003-12-30T18:21:24Z", "creator": "spepping@apache.org", "creation_time": "2003-12-30T18:21:24Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 25828, "attachment_id": 9753, "text": "Created attachment 9753\nThe patch as described", "id": 49862, "time": "2003-12-30T18:22:05Z", "creator": "spepping@apache.org", "creation_time": "2003-12-30T18:22:05Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 25828, "attachment_id": null, "is_private": false, "id": 49871, "time": "2003-12-30T22:51:01Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-12-30T22:51:01Z", "text": "Hello Simon,\n\nI have some questions:\n\n1.) Does the fact that FOP (I believe...) also must run on SDK 1.3 change \nanything of what you're proposing?  I.e., as a result of these changes, will \n1.3 users be unable to use FOP?\n\n2.) Your statement \"There are a few methods to run one's own xerces and xalan. \nThe java property java.endorsed.dirs is a good method.\"\n\nI'm missing the context here:  What does this have to do with FOP?  What is the \ncurrent problem with FOP that your changes will fix?\n\n3.) (Very similar question) Your statement, \"To make this work, xerces.jar, \nxalan.jar and xml-apis.jar should be moved to the new directory lib/endorsed in \nthe distribution.\"\n\nSorry, I don't understand.  What is \"this\"--what are we trying to move \"from\" \nto \"to\", and what are the benefits of us doing so?\n\nThanks,\nGlen\n"}, {"count": 3, "tags": [], "bug_id": 25828, "attachment_id": null, "text": "Simon,\n\nDon't let the 1.2/1.3 requirement *necessarily* stop you from what you're \nsuggesting--just let us know if its a factor though.\n\nGlen", "id": 49883, "time": "2003-12-31T04:02:01Z", "creator": "glenmazza@yahoo.com", "creation_time": "2003-12-31T04:02:01Z", "is_private": false}, {"text": "1.) The jar files I propose to put in directory lib/endorsed are also\n  added to the classpath. Therefore earlier SDKs will find them as\n  usual.\n\n2.) FOP comes with its own jar files for Xerces and Xalan, to ensure\n  that a version is used that is adequate for FOP. In SDK 1.4 these\n  jar files are not used, because the SDK uses its built-in xerces and\n  xalan. My proposed patch makes SDK 1.4 use the Xerces and Xalan jar\n  files that come with FOP. As long as it is useful that FOP comes\n  with its own xerces and xalan jar files, this patch is useful.\n\n3.) \"this\" is the patch to fop.sh/bat. \"from\" is the current\n  situation. \"to\" is a situation in which fop.sh/bat uses the Xerces\n  and Xalan jar files that come with FOP when using SDK 1.4.\n\n  The feature I am addressing is that SDK 1.4 on the one hand comes\n  with non-core, so-called endorsed standards and implementations, and\n  on the other hand allows one to override those by specifying\n  \"endorsed dirs\". All jars in those dirs are prepended to the boot\n  class path, and thus prevail over built-in versions of the same\n  classes. See guide/standards/index.html in the SDK documentation.\n\n  Xerces and Xalan are probably the best known of these endorsed\n  standards, and have caused most problems for users. SDK 1.4.0 came\n  with a pretty early version of Xerces 2. It was often necessary to\n  override it with versions delivered by applications, using the\n  method applied in this patch. The problem may have gone with later\n  SDKs.", "tags": [], "creator": "spepping@apache.org", "attachment_id": null, "count": 4, "id": 49891, "time": "2003-12-31T11:42:41Z", "bug_id": 25828, "creation_time": "2003-12-31T11:42:41Z", "is_private": false}, {"text": "Simon,\n\nThanks for your explanation again.  The problem you're bringing up may actually \nbe good news for us though: J2SDK 1.4 users who run FOP from the command line \n*aren't* using the Xalan, Xerces, xml-apis.jar files in our lib directory, but \nrather the internal ones of the J2SDK.  (I tested and confirmed this.)\n\nIndeed, wouldn't you say, the fact that FOP CL has been running fine (very few \ncomplaints, if any) w/1.4's jars for so long would help in reducing the FUD \nabout removing the XML jars from our distributions once we discontinue 1.2 and \n1.3 support?  (I.e., if we redirect the 1.4 SDK to the FOP jars, we'll lose \ncertainty about how reliable the internal SDK jars are--or, learning what the \nactual bugs are.)\n\nAlso, for buggy internal XML jars of a current or future SDK--this patch would \nhelp command-line, but not embedded usage (they would still use internal, or \nwhatever is placed in SDK default endorsed directory).  So in these cases where \nthe internal jars are bad, wouldn't it be better if we had instructions on our \nwebsite, or a link somewhere, telling users how to update the XML jars in the \ndefault Java endorsed directory?  That would cover both CL and embedded.\n\nSorry for the long post--I'm not certain on this either way.  Comments?  (Also, \nteam members, what do you think?)\n\nThanks again!\nGlen\n", "tags": [], "creator": "glenmazza@yahoo.com", "attachment_id": null, "count": 5, "id": 49939, "time": "2004-01-01T21:36:40Z", "bug_id": 25828, "creation_time": "2004-01-01T21:36:40Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 25828, "text": "I disagree with Glen's comment that there are very few compliants wrt to \nrunning 1.4 from C/L In fact users are often having problems caused by the \nolder version of Xalan and Xerces that are shipped with 1.4. This sort of \nthing comes up on the user list every couple of weeks. See the link for a \nrecent example thread on this.\n\nhttp://marc.theaimsgroup.com/?l=fop-user&m=107279633016684&w=2\n\nAs for embedded usage-I would argue that if users are capable of writing Java \nto call our API then they should be up to the task of managing class path \nissues.", "id": 49949, "time": "2004-01-02T15:46:37Z", "creator": "bowditch_chris@hotmail.com", "creation_time": "2004-01-02T15:46:37Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 25828, "attachment_id": null, "is_private": false, "id": 49962, "time": "2004-01-02T20:07:44Z", "creator": "spepping@apache.org", "creation_time": "2004-01-02T20:07:44Z", "text": "Glen,\n\nYou do have a point. But so has Chris. In fact I submitted this bug when I read\nthe recent thread on fop-user on parsing problems. I myself always use the\nendorsed dirs method to use newer versions of the Xerces and Xalan jar files\nthan come with the SDK.\n\nYour suggestion to describe how users can download Xerces and Xalan themselves\nand use them effectively, is fine for development, but no so fine for stable\ndistributions for users.\n\nI found today that the JUnit tests run well with the jar files from the SDK, but\nI have problems when I substitute newer jar files for them. This makes me\nhesitate about my patch.\n\nI think more votes are required for this change to be made.\n\nSimon"}, {"text": "[Thanks Chris for your comments and the link.]\n\n<Q>\n\"Your suggestion to describe how users can download Xerces and Xalan themselves\nand use them effectively, is fine for development, but not so fine for stable\ndistributions for users.\"\n</Q>\n\nI think I tend to agree with you here--I just noticed (coincidentally) that \nCocoon appears to do the same with its internal (testing) Jetty servlet \ncontainer.  I guess it is good to have a defined version of XML JARs that we \ntest against and sign off on for a release.  \n\n<Q>\nI found today that the JUnit tests run well with the jar files from the SDK, but\nI have problems when I substitute newer jar files for them. This makes me\nhesitate about my patch.\n</Q>\n\nI'm assuming you mean newer JARs but *not* the ones we distribute?  If newer \nversions than ours create errors not found in our supplied versions, rather \nthan hesitate this might actually strengthen the argument for applying your \npatch!  \n\nWe'll hold off a few more days to see if we get more comments.\n\nThanks,\nGlen", "tags": [], "creator": "glenmazza@yahoo.com", "attachment_id": null, "count": 8, "id": 49973, "time": "2004-01-02T22:59:54Z", "bug_id": 25828, "creation_time": "2004-01-02T22:59:54Z", "is_private": false}, {"count": 9, "tags": [], "text": "I'd like to support Simon's proposed patch. I think it may help to avoid \ncertain problems. There are quite a few other projects that do the same: \nMaven, Forrest, Tomcat etc.", "attachment_id": null, "id": 50012, "creator": "jeremias@apache.org", "time": "2004-01-04T16:27:29Z", "bug_id": 25828, "creation_time": "2004-01-04T16:27:29Z", "is_private": false}, {"count": 10, "tags": [], "text": "There have not been complaints from users. Apparently FOP works fine with the\ndefault XML parser and XSLT processor in java 1.4.", "is_private": false, "id": 61775, "creator": "spepping@apache.org", "time": "2004-08-10T19:34:17Z", "bug_id": 25828, "creation_time": "2004-08-10T19:34:17Z", "attachment_id": null}, {"count": 11, "tags": [], "creator": "gadams@apache.org", "is_private": false, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156968, "time": "2012-04-01T13:55:37Z", "bug_id": 25828, "creation_time": "2012-04-01T13:55:37Z", "attachment_id": null}]