[{"count": 0, "tags": [], "bug_id": 25844, "is_private": false, "id": 49911, "attachment_id": null, "creator": "mtownsen@alumni.calpoly.edu", "creation_time": "2003-12-31T18:21:49Z", "time": "2003-12-31T18:21:49Z", "text": "Using the Administration tool for Tomcat, after adding a JDNI datasource, the \ndatasource is not available to other webapps.\n\nI put the JDBC driver into the $TOMCAT_HOME/common/lib directory.  I added the \ndatasource under DataSources.  Deploying my webapp and trying to get to the \ndatasource gives me an error that it can't find the database driver.  If I \nchange the $TOMCAT_HOME/conf/Catalina/localhost/<context>.xml file <Resource> \ntag to <ResourceLink>, I no longer get the above error, but am unable to get a \nconnection object from jndi with no errors.\n\nI deployed the same webapp with no changes to JRun4 and did not have any \nproblems, so I know the problem isn't with my webapp."}, {"count": 1, "tags": [], "bug_id": 25844, "attachment_id": null, "id": 49912, "time": "2003-12-31T18:30:25Z", "creator": "remm@apache.org", "creation_time": "2003-12-31T18:30:25Z", "is_private": false, "text": "Bugzilla is not for user support. Please use tomcat-user for that kind of questions.\nBTW, you can't add JARs to common/lib dynamically (you have to restart Tomcat\nfor that), so that's why your JDBC driver doesn't work."}, {"count": 2, "tags": [], "bug_id": 25844, "attachment_id": null, "id": 49914, "time": "2003-12-31T19:32:21Z", "creator": "mtownsen@alumni.calpoly.edu", "creation_time": "2003-12-31T19:32:21Z", "is_private": false, "text": "I did do that.  It doesn't work.  This is not a user problem, but a bug with \nthe administration web app.  If I use the DriverManager and not the JNDI \nDatasource, everything works okay.\n\n"}, {"count": 3, "tags": [], "bug_id": 25844, "attachment_id": null, "id": 49920, "time": "2003-12-31T22:03:45Z", "creator": "remm@apache.org", "creation_time": "2003-12-31T22:03:45Z", "is_private": false, "text": "Please reread the documentation. The admin webapp will create a global resource,\nand you then need to use a ResourceLink to your context. If somehow it doesn't\nwork with the admin webapp, then do it manually. Your \"bug\" report is way too\nvague, and is currently useless. Please don't reopen the bug report without a\ndetailed sequence of actions that should work but doesn't (what you gave is\ninvalid)."}]