[{"count": 0, "tags": [], "creator": "David.Holscher@nav-international.com", "attachment_id": null, "is_private": false, "id": 50090, "time": "2004-01-05T17:27:56Z", "bug_id": 25908, "creation_time": "2004-01-05T17:27:56Z", "text": "JCA support would be very useful to users that want to use JDO with Tomcat. \nMany JDO implementations come with a resource adaptor. Currently developers \nhave to go to a full J2EE implementation like JBoss or worse WebSphere to be \nable to use the adaptor.\n\nThe Tomcat community already recognizes that relational database connection \npooling is very useful by providing JDBC connection pooling. More and more \napplications will be developed using JDO that don't need a full blown J2EE \nstack (part of the reason we are using JDO is to avoid CMP with all of the \nbaggage we don't need), just a bit of JCA support. Container managed \ntransactions wouldn't need to be implemented, developers just need a way to get \nahold of a correctly configured PersistenceManager.\n\nSince there are already resource adaptors to provided connectivity to JDBC \ndatasources, adding JCA support could also create a unified way to get a \nconnetion to any datasource in Tomcat."}, {"count": 1, "attachment_id": null, "bug_id": 25908, "is_private": false, "id": 50106, "time": "2004-01-05T21:31:16Z", "creator": "remm@apache.org", "creation_time": "2004-01-05T21:31:16Z", "tags": [], "text": "Sorry, for the time being, Tomcat will only add support for web tier related JSRs.\nYou can maybe integrate the provider you need using JNDI."}, {"count": 2, "attachment_id": null, "bug_id": 25908, "text": "This would seem like a good pluggable Tomcat module project...", "id": 50115, "time": "2004-01-05T22:36:39Z", "creator": "jessh@ptc.com", "creation_time": "2004-01-05T22:36:39Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "jessh@ptc.com", "attachment_id": null, "id": 50116, "time": "2004-01-05T22:37:31Z", "bug_id": 25908, "creation_time": "2004-01-05T22:37:31Z", "is_private": false, "text": "To clarify my previous comment, this seems like a good open-source project to be\ndeveloped on top of, but separate from, the rest of Tomcat."}]