[{"count": 0, "attachment_id": null, "bug_id": 26022, "is_private": false, "id": 50320, "time": "2004-01-09T15:22:40Z", "creator": "sven.koehler@gmail.com", "creation_time": "2004-01-09T15:22:40Z", "tags": [], "text": "hi,\n\nimagine i've got my jasper configured to use thee background compile thread that\nruns every 300 secons, and imagine that there is a JSP page with an error inside\nthat makes it uncompilable. Than the jasper will compile the every 300 seconds\nand will also create a log-entry every 300 seconds. jasper should somehow\nremember that he tried that JSP already, for example by using a dummy class file\nlike \n\n  class XYZ {\n    static {\n      throw new RuntimeException(\"this page had compilation errors\");\n    }\n  }\n\nIf this hasn't been fixed in Tomcat 5 yet, than of course this also applies for\nTomcat 5 too. You may also say that this is more a RFE than a Bug, but the\ncurrent behaviour is really stupid."}, {"count": 1, "tags": [], "bug_id": 26022, "is_private": false, "text": "Way too much complexity IMO. Precompilation (now that it really does work) is\nclearly the way to go in production.", "id": 51057, "time": "2004-01-23T16:04:45Z", "creator": "remm@apache.org", "creation_time": "2004-01-23T16:04:45Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 26022, "is_private": false, "text": "Depending on the ClasLoader you don't need to compile such a dummy-class for\neach JSP-page that fails. It can be done by copying a class-file that already\nexists.\n\nyou want me to precompile the JSP-pages?\nDid you ever thought of the case, that people might use Dreamweaver or whatever\nto  edit the JSP-pages? You cannot teach those people how to use ant and Tomcat\nto precompile JSP-pages.\n", "id": 51058, "time": "2004-01-23T16:08:23Z", "creator": "sven.koehler@gmail.com", "creation_time": "2004-01-23T16:08:23Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "kin-man.chung@sun.com", "attachment_id": null, "id": 51074, "time": "2004-01-23T18:17:57Z", "bug_id": 26022, "creation_time": "2004-01-23T18:17:57Z", "is_private": false, "text": "You are right in that this is a RFE instead of bug.  Whether jasper skips\nrecompiling erroneous JSP pages or not is just an optimization, and it is the\npage author's responsibility to deploy JSP pages that are error free.  Imagine\nanyone accessing the page and getting a compilation error.  Don't you think\nthat's stupid also?\n\nThis won't be fixed because it adds complixity without any real benefit."}, {"count": 4, "tags": [], "creator": "sven.koehler@gmail.com", "attachment_id": null, "is_private": false, "id": 51081, "time": "2004-01-23T20:59:10Z", "bug_id": 26022, "creation_time": "2004-01-23T20:59:10Z", "text": "again i have to disagree:\n\nIn the case where i noticed it, it was the case that it was an unused JSP-page\nthat contained an error. You may say that one should only upload correct\nJSP-pages, but it a really arrogant position."}]