[{"count": 0, "tags": [], "creator": "Joerg-Cyril.Hoehle@t-systems.com", "attachment_id": null, "id": 50406, "time": "2004-01-12T14:35:07Z", "bug_id": 26058, "creation_time": "2004-01-12T14:35:07Z", "is_private": false, "text": "The doc says \"a single instance of the file is opened and used for all threads\".\n\nWhat JMeter does is return values from a single CSV file, even when the filename \nargument differs. I.e. it does not obey the filename argument, but continues to \nread from whatever file was first accessed in the test script.\n${__CSVRead(${myfilename},0)\n${__CSVRead(${otherfilename},0) -> values from file $myfilename, $otherfilename \nis completely ignored\n\nGiven the reference to StringFromFile, which says that the same file may be \nopened multiple times by JMeter, I understood that the above phrase would refer \nto some resource pool and that the file descriptor would be shared by all \nthreads. This is quite different. I did not interpret it as meaning that CSVRead \nwould only allow a single file to be read from, across a whole complex test \ncase. I believe this to be a bug, since it causes unreliable and \nunforeseen behaviour"}, {"count": 1, "tags": [], "creator": "Joerg-Cyril.Hoehle@t-systems.com", "text": "I don't know where the file attachment can be seen online, but I attached one. \nBy enabling/disabling the first thread group, you can see in the result view how \nthe file argument either goes as\nline1-A\nline2-A\nline3-A -- expected line1-B etc.\nline4-A\nline5-A (both groups enabled), or\nline1-B\nline2-B\nline3-B (only second group enabled)\nI.e. no second CSV file is ever opened.", "id": 50407, "time": "2004-01-12T14:40:59Z", "bug_id": 26058, "creation_time": "2004-01-12T14:40:59Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 26058, "is_private": false, "text": "The way I see it, CSVRead is working as designed.\n\nHowever, I agree that the documentation should be clarified, and it might be \nuseful if CSVRead logged a message to say that it was ignoring the different \nfile name.\n\nI've changed the priority/severity accordingly.\n\n==\n\nChanges to the behaviour of CSVRead are best raised as an enhancement request.\n\nFor example, it might be useful if CSVRead maintained a separate internal array \nfor the contents of each different file. To allow for existing scripts which \ntook advantage of the fact that only one filename was ever used, blank \nfilenames could be treated as being the first and only file name. Scripts using \nnon-blank dummy file names would be somewhat trickier to handle ...\n\n", "id": 50413, "time": "2004-01-12T16:02:00Z", "creator": "sebb@apache.org", "creation_time": "2004-01-12T16:02:00Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 26058, "attachment_id": null, "is_private": false, "id": 51037, "time": "2004-01-23T02:25:08Z", "creator": "sebb@apache.org", "creation_time": "2004-01-23T02:25:08Z", "text": "\n\n*** This bug has been marked as a duplicate of 26063 ***"}]