[{"count": 0, "tags": [], "bug_id": 26088, "attachment_id": null, "text": "Regular expression support is completely broken under HP-UX 11.0, whether in\ncore or in modules such as mod_rewrite.  Compiled with gcc 3.3 (32-bit) and with\nmost eveverything as DSOs (shared libraries).  Also compiled with OpenSSL 0.9.7c\n which are dynamic libraries themselves.\n\nThis appears to be a link-time conflict between the embedded PCRE library in\nApache and the libc system library in HP-UX.  HP's /usr/lib/libc.sl library\ndefines the code symbols regcomp, regexec, regerror, and regfree; all of which\nare incompatible with pcre's posix api's (or at least pcre's headers).\n\nI was able to determine that during the Apache compile, the embedded PCRE header\nfiles were being used (which defined all the REG* enum identifiers, such as\nREG_NOMATH=17).  But at runtime the call to regexec inside the APR wrappers (in\nutil.c) would routinely get back result codes of 20.  Under HP-UX, REG_NOMATCH\nis defined to be 20.  Interesting no core was ever produced, but no regex's\nwould match either.\n\nI was also able to determine that during the libtool linking of .libs/httpd that\nthe pcreposix.o object file would never be inserted into the executable (despite\nthe pcre library being presented to libtool's link command).\n\nBy carefully reordering the low-level link command executed by libtool, I was\nable to force the pcreposix.o object file into httpd.  I basically moved the\npcre library immediately after libmain instead of after all the OpenSSL dynamic\nlibrary link flags.  This allowed the core regex's to work (such as in\nDirectoryMatch), but those in modules such as mod_rewrite would still fail.\n\nI eventually got everything to work by simply renaming the four functions in the\nApache codebase so they no longer conflicted with HP's:\n\n   regcomp()  ->  posix_regcomp()\n   regexec()  ->  posix_regexec()\n   regerror() ->  posix_regerror()\n   regfree()  ->  posix_regfree()\n\nThose appear in these source files:\n\n  server/util.c\n  srclib/apr/test/internal/testregex.c\n  srclib/pcre/pcreposix.c, .h\n  srclib/pcre/pcretest.c\n  include/pcreposix.h\n\nWith no changes other than renaming those four function identifiers, regular\nexpressions are now fully working both in core and in modules.", "id": 50457, "time": "2004-01-13T11:51:14Z", "creator": "dmeranda@iac.net", "creation_time": "2004-01-13T11:51:14Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 26088, "attachment_id": null, "text": "Dup'ing against a newer report which has attached patches; thanks for the report\nand analysis.\n\n*** This bug has been marked as a duplicate of 10734 ***", "id": 53775, "time": "2004-03-09T23:55:40Z", "creator": "jorton@redhat.com", "creation_time": "2004-03-09T23:55:40Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 26088, "text": "I must stop screwing that up...", "id": 53777, "attachment_id": null, "creator": "jorton@redhat.com", "creation_time": "2004-03-09T23:56:24Z", "time": "2004-03-09T23:56:24Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 26088, "is_private": false, "id": 53778, "attachment_id": null, "creator": "jorton@redhat.com", "creation_time": "2004-03-09T23:57:29Z", "time": "2004-03-09T23:57:29Z", "text": "Reduping against a bug number not an attachment number....\n\n*** This bug has been marked as a duplicate of 27550 ***"}]