[{"count": 0, "tags": [], "bug_id": 2616, "attachment_id": null, "id": 3711, "time": "2001-07-13T07:26:02Z", "creator": "rwnelso@hotmail.com", "creation_time": "2001-07-13T07:26:02Z", "is_private": false, "text": "I have a web page that displays two different date/time values.  I tried\nusing the datetime format tag to take the long values and convert them\nto a string format.  It works fine the first time in the page, but the\nsecond occurrence in the page shows the same date/time value as the first,\noccurrence, even though the long \"parameters\" are different.  It looks like\nthe format tag is caching this date value after the first request, and is not\nreading the long \"parameter\" in the second request."}, {"count": 1, "tags": [], "bug_id": 2616, "attachment_id": null, "id": 3712, "time": "2001-07-13T08:04:13Z", "creator": "glenn@apache.org", "creation_time": "2001-07-13T08:04:13Z", "is_private": false, "text": "What servlet container is being used?\nDo you have a simple example that exhibits this bug?\nHave you tested this with the latest nightly build of the datetime taglib?"}, {"count": 2, "tags": [], "bug_id": 2616, "attachment_id": null, "text": "Sorry I didn't give all the details before...  Anyway, here they are:\n\nServlet Container: WebLogic Application Server 6.0 with Service Pack 2\nDate of Build: I am using the nightly build pull from 07/03/01, but I can\n               bring in the latest build if you think there has been a fix\n               for this.\nSimple Example: \n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\">\n<%@ taglib uri=\"http://jakarta.apache.org/taglibs/datetime-1.0\" prefix=\"dt\" %>\n<HTML>\n  <HEAD>\n    <TITLE> DateTime Format Tag Test </TITLE>\n  </HEAD>\n  <BODY>\n    <P>\n      <dt:format pattern=\"MM/dd/yyyy hh:mm:ss\">\n        888888888888\n      </dt:format>\n    </P>\n    <P>\n      <dt:format pattern=\"MM/dd/yyyy hh:mm:ss\">\n        999999999999\n      </dt:format>\n    </P>\n  </BODY>\n</HTML>\n\nThe previous example displays the following output for me:\n03/02/1998 08:34:48\n03/02/1998 08:34:48\n\nThe correct output would be:\n03/02/1998 08:34:48\n09/08/2001 09:46:39\n\nDo you see anything I am doing wrong?  Does this example work for\nyou (in your servlet container)?  Thanks for your help!  Rob", "id": 3717, "time": "2001-07-13T09:18:48Z", "creator": "rwnelso@hotmail.com", "creation_time": "2001-07-13T09:18:48Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 2616, "attachment_id": null, "text": "The example you provided works fine for me in Tomcat.\n\nThis appears to be a bug in WebLogic where it is reusing the body content\nfor the dt:format tag.\n\nTry formatting them this way and see if it helps:\n\n<dt:format pattern=\"MM/dd/yyyy hh:mm:ss\">888888888888</dt:format>\n\nAlso try downloading the latest nigthly build.  I have made some\nchanges in the last week to the taglib.\n\n", "id": 3718, "time": "2001-07-13T09:36:51Z", "creator": "glenn@apache.org", "creation_time": "2001-07-13T09:36:51Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 2616, "attachment_id": null, "text": "I brought in the latest nightly build (7/13/01) and reformatted the\nentry the way you suggested (no newlines).  Still doesn't work.  I'll\ngo ahead and send this in to WebLogic support to let them know they have\nan apparent bug in their TagHandler.  Thanks for your help!  Rob", "id": 3720, "time": "2001-07-13T10:21:35Z", "creator": "rwnelso@hotmail.com", "creation_time": "2001-07-13T10:21:35Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 2616, "attachment_id": null, "is_private": false, "id": 3739, "time": "2001-07-16T08:19:34Z", "creator": "rwnelson847@cs.com", "creation_time": "2001-07-16T08:19:34Z", "text": "I pulled in the source so that I could put in some print statements and see \nexactly where the failure was occurring (i.e. print out the BodyContent value \nto see if the WebLogic Server was caching it).  As it turns out, the problem is \nthat after the first invocation of the format tag, the date attribute is being \nset (by creating a new date object with the long value of the BodyContent \nfield).  The next time the tag is called in the JSP page, the value of date is \nalready set, so the tag does not recreate a new Date object with the long value \ncontained in BodyContent, but rather just reuses the date object already \ncreated.\n\nI looked in the spec (JSP.5.4.2), and it states that once \"properly set, these \nproperties are expected to be persistent, so that if the JSP container \nascertains that a property has already been set on a given tag handler \ninstance, it need not set it again.\"  It is a little vague about exactly which \nproperties it is talking about (properties in the Tag interface as well as \nother properties), but even further down it discusses that once release is \ncalled, all properties are assumed to be reset to an unspecified value.  The \nexecution trace in the life-cycle section (JSP.5.4.7) also seems to indicate \nreuse of these values between tag invocations (at least on the same JSP page).\n\nFor whatever reason, it appears that the Tomcat server is resetting this date \nvalue to null between invocations, but the WebLogic Server is retaining the \nvalue for the date attribute between tag invocations (on the same page).  The \nexample in the spec seems to lean toward the WebLogic implementation, but I \ndon't know if the spec is really clear enough to say for sure how this needs to \nbe implemented.  In either case, I believe that it will work fine for either \nimplementation if the date field were to be specifically reset to null after \nthe date information was printed out to the JSP page (in the doEndtag() \nsection).\n\nDoes this sound reasonable to you?  Thanks!  Rob"}, {"count": 6, "tags": [], "bug_id": 2616, "is_private": false, "text": "Thanks to Rob, the bug was found and fixed and is available\nin the Version 1.0 Beta 1 release.", "id": 3906, "time": "2001-07-22T10:02:14Z", "creator": "glenn@apache.org", "creation_time": "2001-07-22T10:02:14Z", "attachment_id": null}]