[{"text": "I have two OS on this system one primary and one backup, both are win XP pro \nbuild 2600 sp1. Primary OS is on partion c:,Backup OS is on partion d:, c: and \nd: NTFS format disc 1, Partion e: is a ghost image of c: and d: and is a DOS \nFAT32X partion, parition f: empty DOS FAT32X, e: and f: are on disc 2. \nApache2.0.48 is installed on both c: and d: along with active state perl5.8.2, \nimagemagick5.5.8, python2.3.2 Apache will suddenly stop randomly and will not \nstart again even if reinstalled, gives an error code 1 from a services start, \nwindows says to contact the vernder of this error. The HDD needs to be \nformated and the system reloaded from a ghost image for Apache to start again, \nuninstalling Apache and reinstalling it will have no positive effect.", "tags": [], "creator": "Don.Dion@cox.net", "attachment_id": null, "count": 0, "id": 50626, "time": "2004-01-16T00:54:57Z", "bug_id": 26180, "creation_time": "2004-01-16T00:54:57Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 26180, "attachment_id": null, "id": 50634, "time": "2004-01-16T05:13:38Z", "creator": "wrowe@apache.org", "creation_time": "2004-01-16T05:13:38Z", "is_private": false, "text": "\n  In order to begin processing this error, we need to know what the problem\n  was (you don't say).  Would suggest that you review the server's error log\n  file (in path-to-apache/logs/error.log), as well as the Windows Application\n  Error Log (Start -> Settings -> Admin Tools -> Event Viewer, then switch to\n  the Application log view.)\n\n  When the popup occurs ('send report to ms?'), you can usually get a more \n  detailed log of the crash, including some backtrace information.  Please\n  attach that to the bugreport and reopen with the relevant suggested details.\n"}, {"count": 2, "tags": [], "bug_id": 26180, "attachment_id": null, "id": 50762, "time": "2004-01-19T19:09:49Z", "creator": "erik@codefaktor.de", "creation_time": "2004-01-19T19:09:49Z", "is_private": false, "text": "No further response, closing. Feel free to reopen if you can provide the additional information \nrequested."}]