[{"count": 0, "tags": [], "bug_id": 26242, "attachment_id": null, "is_private": false, "id": 50734, "time": "2004-01-19T13:31:50Z", "creator": "stevel@apache.org", "creation_time": "2004-01-19T13:31:50Z", "text": "Hi,\n\nWe are getting reports coming in that the latest releases of jasper are breaking\nAnt's <jspc> task, because that sets the verbosity option for output control,\nand changes in the args are breaking things. See bugrep #25345 for details.\n\nI think the immediate fix for ant1.6.1 would be to not pass on verbosity info,\nbut   we are bound to keep getting many reports about the same break with 1.6.0\nand 1.5; so please can you bring back the old -v0 style of option, and make\nchanges to the command mechanism in a more backwards compatible way in future\n-where possible.\n\nTa,"}, {"count": 1, "tags": [], "bug_id": 26242, "attachment_id": null, "text": "I don't see the point of Ant documenting this, or having the pre declared task.\nAny reason for this ? Forward compatibility is one thing, but given other\nchanges in jspc behavior, I doubt it would still work.\n\nTomcat now properly documents the task and how to use it.", "id": 50738, "time": "2004-01-19T15:11:55Z", "creator": "remm@apache.org", "creation_time": "2004-01-19T15:11:55Z", "is_private": false}, {"count": 2, "tags": [], "creator": "stevel@apache.org", "is_private": false, "text": "Remy,\n\nIt is not so much that we document the Jasper task, but that we ship with our\nown task which \nis meant to support different back ends:\nhttp://ant.apache.org/manual/OptionalTasks/jspc.html\n\nIn theory that is, in practise we have left WebLogic alone until someone was\nprepared to write the adapter, so instead it supports various Tomcat 4.x\nreleases, handling name mapping appropriately.\n\nGiven it is therefore purely Jasper-centric (as far as we know), there is a lot\nto be said for killing the task and saying 'use the Tomcat supplied one'; I'd be\nhappy with that as it eliminates all version issues and makes bug hunting\neasier. This is something we can discuss for the 1.7 release. \n\nBut in the meantime, there are people out there using the Ant project's jasper\nadapter, and that one builds a java command with the -vN option, where N is a\nverbosity metric. If that is all that has changed, can we please, please, please\nhave it back :)\n\nBTW, what other changes have there been that would break stuff? Just so we know\nwhat to expect in bugreps?", "id": 50742, "time": "2004-01-19T16:03:43Z", "bug_id": 26242, "creation_time": "2004-01-19T16:03:43Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "I've added back the setter.", "is_private": false, "id": 50885, "creator": "remm@apache.org", "time": "2004-01-21T15:45:55Z", "bug_id": 26242, "creation_time": "2004-01-21T15:45:55Z", "attachment_id": null}]