[{"count": 0, "tags": [], "text": "I am not sure if you would consider this is a bug but here it is ....\n\nThis is probably a \"bug\" with the code that generates the java code from the jsp\npage. This may not be a bug because it is really a name space collision. \nHowever, it is a kind of a bug because the name space that is colliding with is\nnot neccessarily researved.\n\nThe ramification of this \"bug\" or behavior is that you cannot create a jsp\nvariable called \"org\" and use the <jsp:include .... > directive on the same jsp\npage with tomcat because of namespace collisions.  I am not certain if this\nbehavior occurs in other webapps such as websphere or jboss.\n\nIn a jsp if you create a \"global\" String variable called org and then use the \n<jsp:include page=\"/jsp/auditlistdetail.jsp\" flush=\"true\" /> directive the code\nwill not compile because of a namespace collision on the org variable.\n\nWhen the java compiler gets to \"org.apache....\" it tries to treat \"org.\" as a\nString  object. \n\nOriginal JSP code\n=====================\n....\nString org;\n....\n<jsp:include page=\"/jsp/someother.jsp\" flush=\"true\" />\n....\n\n\nJava generated code looks something like this.\n===========================================\n.....\nString org = \"\";\n......\norg.apache.jasper.runtime.JspRuntimeLibrary.include(request, response,\n          \"/jsp/someother.jsp\", out, true);\n.....\n\nJava compiler error message is \"cannot resolve symbol variable apache\".  It is\ntrying to look for a method or variable in the \"org\" string object.\n\nI would suggest using an import \"org.apache.jasper.runtime.*\" so this one\nparticular collision does not occur.  I would guess that there are alot of\napplications out there with jsp variables called \"org\".   I am renaming my\nvariables to \"organization\" to prevent any further problems.", "attachment_id": null, "bug_id": 26290, "id": 50831, "time": "2004-01-20T20:21:41Z", "creator": "peter.stevlingson@aurora.org", "creation_time": "2004-01-20T20:21:41Z", "is_private": false}, {"count": 1, "tags": [], "text": "This is a limitation of the java programming package naming convention. You also\nmay also want to stay away from the following variable names: com, java, javax,\nedu, net as well as any other top level domain.", "is_private": false, "id": 50832, "creator": "funkman@joedog.org", "time": "2004-01-20T20:29:27Z", "bug_id": 26290, "creation_time": "2004-01-20T20:29:27Z", "attachment_id": null}]