[{"count": 0, "tags": [], "bug_id": 26318, "attachment_id": null, "id": 50903, "time": "2004-01-21T18:55:01Z", "creator": "s_kelem@pacbell.net", "creation_time": "2004-01-21T18:55:01Z", "is_private": false, "text": "apache-ant-1.6.0/src/main/org/apache/tools/ant/UnknownElement.java:            +\n\" - You have misspelt '\" + elementName + \"'.\" + lSep\n\nPlease change \"misspelt\" to \"misspelled\"."}, {"count": 1, "tags": [], "bug_id": 26318, "attachment_id": null, "text": "Although I am Canadian and prefer the North American 'spelled', I believe\n'spelt' is also correct (and presumably used by Brtis and Aussies). Take a look:\n\n(described under the 3rd meaning of the word spell).\nhttp://dictionary.reference.com/search?q=spelt\n", "id": 50904, "time": "2004-01-21T18:59:52Z", "creator": "colinml1@exis.com", "creation_time": "2004-01-21T18:59:52Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 26318, "attachment_id": null, "id": 50937, "time": "2004-01-22T06:06:08Z", "creator": "jan@materne.de", "creation_time": "2004-01-22T06:06:08Z", "is_private": false, "text": "My Online-Translator accepts both and I´m not a native speaker ... so I would \ndo nothing besides waiting for other committers :-)"}, {"count": 3, "tags": [], "bug_id": 26318, "attachment_id": null, "id": 50954, "time": "2004-01-22T09:43:34Z", "creator": "stevel@apache.org", "creation_time": "2004-01-22T09:43:34Z", "is_private": false, "text": "yes, misspelt is correct in many locales, especially en-uk. Unless we\nstandardise on en-us across the entire docs, I'd say leave as is. At the very\nleast, it introduces readers to alternate spellings of words.\n\n\nSummary: misspelt is not misspelt :) "}, {"count": 4, "tags": [], "bug_id": 26318, "is_private": false, "id": 50979, "creation_time": "2004-01-22T16:43:28Z", "time": "2004-01-22T16:43:28Z", "creator": "gus.heck@olin.edu", "text": "Technically misspelt may be correct, but most elementary school teachers in US\n(and thus most people in the US) will put a big red X on misspelt. Do other\nlocals mark misspelled as wrong? I think the question is which spelling variant\nwill cause the the most readers to think that we passed 3rd grade :) ?", "attachment_id": null}, {"count": 5, "text": "I believe the point is \"why should the US be given special treatment regarding \ndocumentation to a package developed and used by people around the world?\"  \nWe're lucky enough that the documentation is written in English at all, much \nless the English Miss Grundy taught to Archie, Jughead et al...", "bug_id": 26318, "attachment_id": null, "id": 50980, "time": "2004-01-22T16:52:27Z", "creator": "mbenson@apache.org", "creation_time": "2004-01-22T16:52:27Z", "tags": [], "is_private": false}, {"count": 6, "tags": [], "bug_id": 26318, "attachment_id": null, "id": 50985, "time": "2004-01-22T17:38:30Z", "creator": "gus.heck@olin.edu", "creation_time": "2004-01-22T17:38:30Z", "is_private": false, "text": "Oh for goodness sake re-read my comment. If misspelt is marked correct and\nmisspelled marked wrong in many other locations I am perfectly fine with\nmisspelt. If misspelled is right everywhere, and mispelt wrong in some places I\nthink it should be changed. \n\nThis isn't about your feelings of injustice that the US is big right now and\nhappens to drive standards in directions that annoy you, it's about making Ant\nappeal to the broadest audience possible. \n\nIf the community as a whole wants to damage Ant to strike out at the US, it is\nperfectly fine I suppose, they have a right to do that, but personally I think\nwe should put Ant first. If misspelled is offensive or stupid looking in some\nareas then go with misspelt by all means, if not it should read \"misspelled.\""}, {"count": 7, "tags": [], "creator": "mbenson@apache.org", "attachment_id": null, "is_private": false, "id": 50986, "time": "2004-01-22T17:55:58Z", "bug_id": 26318, "creation_time": "2004-01-22T17:55:58Z", "text": "Calm down, there...  Firstly, I entertain neither political agendas \nnor \"feelings of injustice\" about much of anything.  I fully appreciate the \nposition of the US in innovation, and I consider it my good fortune that the \nlanguage around which the constructs of most leading programming languages are \nbuilt is my own native tongue.  I also happen to take somewhat irrational \noffense to the various misspellings I encounter, and have done so from \nchildhood.  I do, however, always try to be gracious on a personal level (at \nleast considering the preferences of others), and I have tendency to play \ndevil's advocate as well.  I can appreciate your point of \"if 'misspelt' is \ncorrect 90% of the time, but 'misspelled' is correct 95% of the time, \nchoose 'misspelled'.\"  Not having these numbers at hand, however, this quasi-\nmisspelling registers very low on the priority scale, from my perspective."}, {"count": 8, "tags": [], "creator": "gus.heck@olin.edu", "attachment_id": null, "is_private": false, "id": 51055, "time": "2004-01-23T15:49:35Z", "bug_id": 26318, "creation_time": "2004-01-23T15:49:35Z", "text": "I'm saying that I would be extremly supprised if it isn't wrong in most of the\nUS. I suspect the US is a lot more than 10% of our user base. The only question\n(still unanswered) is whether or not en-uk or some other large user base\nconsiders misspelled wrong. If so, dead issue, leave it as is as we can't really\nwin either way, if not we should fix it IMHO."}, {"count": 9, "tags": [], "bug_id": 26318, "is_private": false, "id": 51056, "creation_time": "2004-01-23T15:59:44Z", "time": "2004-01-23T15:59:44Z", "creator": "scohen@apache.org", "text": "This thread has provided me with a fair bit of amusement for the past week.  Calm down, guys.  \nIt's FUNNY! \n \nPersonally, I think the different spellings and other language managing are one of the charming \naspects of working on an international project.  Haven't we all seen spellings of words that end \nin -ise instead of -ize?  Does anyone remember the \"Demoroniser\"? \n \nThis would, IMHO not even be an issue except for the context.  Misspellings would not even \nbe noticed anywhere, but this is different and humorous precisely because of the meaning of \nthis word. \n \nAnybody who would reconsider their decision to use Ant on this basis needs to be \n\"demoronised\", IMHO.  \n \nLighten up. ", "attachment_id": null}, {"count": 10, "text": "There is no i18n policy in Ant; it is left up to whoever writes the code and\ndocs to choose which particular subset of english to use. If you want to add\ncode which uses 'color' and 'visualize' as words, go for it :)\n\nAt the same time, we dont want to offend people by gratingly irritating\nspellings which may be correct in some locale, but not others. \n\nSo, if people really want to replace misspelt (which looks fine to me) with\nmisspelled (which to my eyes looks like sheeps, mouses, runned or thinked), then\n the correct solution is not to try and convert to another locale, but come up\nwith a phrasing that is locale neutral. \n\ni.e \"you cannot spell \"+elementName\n\nOf course, that introduces other cultural issues to with computers criticising\ntheir users... ", "bug_id": 26318, "is_private": false, "id": 51061, "time": "2004-01-23T17:13:52Z", "creator": "stevel@apache.org", "creation_time": "2004-01-23T17:13:52Z", "tags": [], "attachment_id": null}, {"count": 11, "text": "I think the firestorm has died down...\nMy reason for contributing to a project is to improve it.\nSome contributions are functional.  My spelling suggestion was more cosmetic\nthan functional.  I wasn't aware that different regions of the world have\ndifferent spellings for \"spelled\" or \"misspelled\".  I'm sure there are grammar\ndifferences around the world too.  I can make spelling and grammar contributions\nfor only the region for which I am an expert, namely U.S. English.  Given that\nAnt is not produced by/for that region, I will have to refrain from commenting\non aspects that look wrong to me.", "bug_id": 26318, "attachment_id": null, "id": 56706, "time": "2004-04-30T18:30:41Z", "creator": "s_kelem@pacbell.net", "creation_time": "2004-04-30T18:30:41Z", "tags": [], "is_private": false}, {"count": 12, "tags": [], "creator": "jkf@apache.org", "attachment_id": null, "is_private": false, "id": 61980, "time": "2004-08-14T08:52:53Z", "bug_id": 26318, "creation_time": "2004-08-14T08:52:53Z", "text": "*** Bug 30663 has been marked as a duplicate of this bug. ***"}]