[{"count": 0, "tags": [], "creator": "stuff-1-apache@carlini.com", "is_private": false, "text": "LDAPTrustedCA inside of VirtualHost doesn't work. While it processed, as\ndemonstrated by the debug log:\n\n    [Fri Jan 23 16:43:12 2004] [debug] util_ldap.c(1038): LDAP: SSL trusted\ncertificate authority file - /usr/share/ssl/CA/certs/ca-bundle.cert.pem\n    [Fri Jan 23 16:43:12 2004] [debug] util_ldap.c(1054): LDAP: SSL trusted\ncertificate authority file type - BASE64_FILE\n    ....\n    [Fri Jan 23 16:46:12 2004] [debug] mod_auth_ldap.c(829): LDAP: auth_ldap\nusing SSL connections\n\nIt isn't used by the code in util_ldap_post_config()\n\n    [Fri Jan 23 16:46:12 2004] [notice] LDAP: Built with OpenLDAP LDAP SDK\n    [Fri Jan 23 16:46:12 2004] [notice] LDAP: SSL support unavailable\n\nHowever, if the LDAPTrustedCA is moved outside of the VirtualHost to the global\ncontext, then it works.\n\nMy guess is that st->cert_auth_file is being copied from the global context\nrather than from the virtual host context.", "id": 51089, "time": "2004-01-24T00:50:54Z", "bug_id": 26390, "creation_time": "2004-01-24T00:50:54Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 26390, "text": "At the moment, the LDAPTrustedCA directive is only valid in the global context.\n\nOpenLDAP supports setting the CA certs per connection, but I am not sure whether\nthe Netware, Microsoft or Netscape SDKs do. This won't be practical until more\ninfo can be found on the other SDKs.\n", "id": 57766, "time": "2004-05-21T01:39:00Z", "creator": "minfrin@sharp.fm", "creation_time": "2004-05-21T01:39:00Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 26390, "attachment_id": null, "is_private": false, "id": 57864, "time": "2004-05-21T20:07:52Z", "creator": "minfrin@sharp.fm", "creation_time": "2004-05-21T20:07:52Z", "text": "Comment from dev@httpd.apache.org:\n\nBrad Nicholes wrote:\n>    This is something that I have been wanting to do for sometime but\n> haven't given it much thought until now.  I talked to some of our Novell\n> LDAP engineers to get a better perspective on this.  According to them,\n> per-session certificates will not work in Novell LDAP and they also\n> believe that it doesn't work for Netscape or Microsoft either.  They\n> also had some concerns about OpenLDAP as well and although per-session\n> certificates appear to be supported, they weren't sure how well it\n> actually worked.  \n>   Just looking at the code in the util_ldap_post_config() routine and\n> how each of them set up the certificates, I wouldn't expect Netscape,\n> Novell or Microsoft SDK's to support per-session certificates.  The\n> Netscape SDK and the Novell SDK use the same function to initialize the\n> SSL libraries, but even though the current util_ldap code for Novell\n> isn't written this way, the Novell SDK allows the user to configure a\n> list of certificates rather than a single certificate by calling\n> ldapssl_add_trusted_cert().  The Netscape SDK probably allows for the\n> same thing through their CERT7 database file which is required.  The\n> Microsoft SDK appears to pull its certificate from the registry so I\n> have no idea if it even allows for multiple certificates.  All of these\n> methods appear to be global rather than per-session.  \n>   My feeling is that about the best we could do is to allow the\n> LDAPTrustedCA and LDAPTrustedCAType directives to be callable from\n> within a virtualhost configurtion and keep a list of certificates that\n> can then be passed to the LDAP libraries during the post_config.  But\n> this would really only make sense for OpenLDAP and Novell.  Since\n> Netscape requires a CERT7 database file, it wouldn't know how to handle\n> multiple files and these directives are NOOPs for Microsoft.  Then it\n> might lead the administrator to believe that certain virtual hosts are\n> using certain certificates when in fact that wouldn't be the case.  All\n> virtual hosts would use all specified certificates.\n"}, {"count": 3, "tags": [], "bug_id": 26390, "attachment_id": null, "id": 57888, "time": "2004-05-22T01:16:28Z", "creator": "minfrin@sharp.fm", "creation_time": "2004-05-22T01:16:28Z", "is_private": false, "text": "Resolved to keep these directives global in scope for now, commit a fix to\nv2.1.0-dev to throw an error if an attempt is made to place these directives\ninside virtualhosts.\n"}, {"count": 4, "tags": [], "creator": "minfrin@sharp.fm", "attachment_id": null, "text": "Due to limitations in the LDAP libraries, CA cert settings are server wide.\nv2.1.0-dev and v2.0.50 will throw an error if an attempt is made to define these\ndirectives inside a virtualhost.\n", "id": 58063, "time": "2004-05-25T16:53:47Z", "bug_id": 26390, "creation_time": "2004-05-25T16:53:47Z", "is_private": false}]