[{"count": 0, "tags": [], "creator": "sussman@red-bean.com", "is_private": false, "text": "A graceful restart SIGTERMs the 'rotatelogs' child, but a long-lived httpd\nprocess may still be serving a connection via KeepAlive.  The httpd child\ncontinues to write logdata into the pipe, but there's no process reading from\nthe pipe anymore.  Eventually the pipe fills up, and the httpd child just hangs.\n\nThis bug was discovered when doing a large Subversion commit with apache\nconfigured to use piped logging to 'rotatelogs'.  It's a pretty common setup,\nand it's likely to burn future Apache (and Subversion) users.\n\nJoe Orton says, \"To fix this properly, I suppose piped loggers should not get\nSIGTERMedduring a graceful restart, they should read till EOF then exit(0): then\nwhen the last child attached to the piped logger for a particular generation\nquits, the pipe is closed and the piped logger terminates gracefully too,\nwithout losing log messages.\"\n\nHere's the complete mail thread:\n\n   http://www.mail-archive.com/dev%40httpd.apache.org/msg19247.html", "id": 51256, "time": "2004-01-27T17:02:26Z", "bug_id": 26467, "creation_time": "2004-01-27T17:02:26Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 26467, "attachment_id": null, "id": 67442, "time": "2004-11-25T05:16:26Z", "creator": "bugzilla@simguy.net", "creation_time": "2004-11-25T05:16:26Z", "is_private": false, "text": "I've been pouring over Google search results trying to figure out the cause of\nan extremely similar bug which seems to affect the 1.3.x branch of the Apache\nHTTP server also.  Has there been any movement on this issue.  Is it likely\n1.3.x would also have this problem?"}, {"count": 2, "tags": [], "creator": "jorton@redhat.com", "is_private": false, "text": "Yes, this bug also affects 1.3.", "id": 67450, "time": "2004-11-25T10:54:45Z", "bug_id": 26467, "creation_time": "2004-11-25T10:54:45Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 26467, "text": "Created attachment 15021\nKill hung child httpd procs\n\nThis little script (requires Proc::ProcessTable) is a hack to find child\nprocesses other than the root one that have been around since before the last\nrotatelogs process. Just in case it's useful to anyone else... can run from\ncron.", "id": 74854, "time": "2005-05-13T17:34:40Z", "creator": "apache.org@veggiechinese.net", "creation_time": "2005-05-13T17:34:40Z", "is_private": false, "attachment_id": 15021}, {"count": 4, "attachment_id": null, "bug_id": 26467, "text": "> processes other than the root one that have been around since before the last\n> rotatelogs process.\n\nSorry... s/last/first/", "id": 74855, "time": "2005-05-13T17:39:56Z", "creator": "apache.org@veggiechinese.net", "creation_time": "2005-05-13T17:39:56Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "creator": "trawick@apache.org", "is_private": false, "text": "FWIW, I'm playing with a patch to prevent the hang.  Hopefully I can commit to\n2.1 this weekend.\n\nChanging rotatelogs to snarf up all entries from these gracefully dying children\nwould be nice, but first order of business is to prevent the hang occurring,\nsince it can occur with any piped logger, and it shouldn't depend on how\nreliable the piped logger is.  I can't reproduce the hang when I take care to\nclose the read side of the logger pipe in the MPM children (i.e., the processes\nwhich serve requests and which would write to the logger pipe).\n", "id": 74858, "time": "2005-05-13T18:46:03Z", "bug_id": 26467, "creation_time": "2005-05-13T18:46:03Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 26467, "attachment_id": null, "id": 74891, "time": "2005-05-15T15:24:10Z", "creator": "trawick@apache.org", "creation_time": "2005-05-15T15:24:10Z", "is_private": false, "text": "I just posted a patch and further comments to dev@httpd.\n\n[PATCH] PR 26467 child process can hang when piped logger goes away"}, {"count": 7, "tags": [], "bug_id": 26467, "text": "A fix to avoid the hang has been committed to 2.1-dev and hopefully will be in\n2.0.next.\n\nI stuck a patch for 1.3.x at http://people.apache.org/~trawick/pr26467_13.txt\n\nThis 1.3 patch appears to Do The Right Thing, but YYMV.  I haven't tested it in\ndetail.\n", "id": 74912, "time": "2005-05-16T02:48:45Z", "creator": "trawick@apache.org", "creation_time": "2005-05-16T02:48:45Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "bugzilla@simguy.net", "text": "I have patched the version of Apache 1.3 I am running on two web servers that\nuse piped loggers and I can already see that the symptoms of this problem are\ngone.  There are no hanging PIDs being leftover at all anymore.  I had a script\nthat went through and killed the ones that were clearly hanging previously, and\nI've modified it to only tell me if any would be killed for hanging.  None have\ncome up yet, which would certainly never happen in the past even for the short\ntime I've been running with the patch.\n\nThis is certainly not proof that the 1.3 patch is perfect or that it doesn't\ncause any other problems, but it definitely does the right thing as best I can tell.\n\nWhat's the chances something like this could land in 1.3.34?", "count": 8, "id": 75042, "time": "2005-05-19T05:56:27Z", "bug_id": 26467, "creation_time": "2005-05-19T05:56:27Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 26467, "attachment_id": null, "id": 75056, "time": "2005-05-19T12:10:18Z", "creator": "trawick@apache.org", "creation_time": "2005-05-19T12:10:18Z", "is_private": false, "text": "Regarding the 1.3 patch:\nThanks for the feedback.  I need to make sure it does the right thing on\nnon-Unix, then I'll add it to 1.3 STATUS file, asking for approval to commit for\n1.3.next.\nOn Unix, just looking at the processes with lsof it is easy to see that it is\ndoing the right thing and there should be no worries.\n"}, {"count": 10, "tags": [], "text": "The 2.x fix has now been merged into the stable 2.0.x branch for the upcoming\n2.0.55 release.\n", "attachment_id": null, "bug_id": 26467, "id": 76754, "time": "2005-06-28T14:00:47Z", "creator": "trawick@apache.org", "creation_time": "2005-06-28T14:00:47Z", "is_private": false}, {"count": 11, "tags": [], "bug_id": 26467, "attachment_id": null, "id": 80030, "time": "2005-09-16T09:36:45Z", "creator": "jorton@redhat.com", "creation_time": "2005-09-16T09:36:45Z", "is_private": false, "text": "The hang is now fixed for 2.0.55, so marking this fixed.  Avoiding the problem\ncompletely (i.e. not forcibly killing piped loggers at restart) is a slightly\ndifferent issue."}, {"count": 12, "tags": [], "text": "Can someone clarify this bug for me?  We'd been having a hang about every 2-14 \ndays that started once we turned on the DisableWin32AcceptEx option.  We \nnoticed that the hang occurred after the child process restarted for whatever \nreason.  Usually this was not triggered by a graceful restart, but \noccasionally it was.  Meaning it would show up in the logs, but a person \ndidn't usually choose to do a restart, something else caused it.\n\nWe figured the build up of rotatelogs had something to do with the problem, as \nthere were a ton of rotatelogs.exe sitting in there.  I noticed this bug \nmentioned in the 2.0.55 release and tried the upgrade.  We've been pretty \nstable since.  It hung once during a graceful restart after 29 days, and has \nbeen up for 26 days since.\n\nI'm confident this bug was causing the hang, but still notice a tremendous \nnumber of rotatelogs.exe.  After a fresh reboot, there are about 6 \nrotatelogs.exe is the process list.  After 26 days on Parent Server Generation \n14, we have 40+ rotatelogs.exe sitting in the process list.\n\nWhen we hang, there's no way to recover without rebooting Windows.  At least \nnot that I'm aware of.  Apache seems to hang, tying up the socket(s), and \nstopping and starting apache fails.\n\nMy concern is the number of accumulating rotatelogs, and the fact that we \nstill hung after a month under similar circumstances during a graceful \nrestart.  Of course once a month is better than every couple of days.  I just \nwanted to share what we have been experiencing with this bug, and it's \napparent patch, and see if anyone could clarify what we are experiencing, if \nit is/was related to this bug, and why we still see so many rotatelogs.", "attachment_id": null, "bug_id": 26467, "id": 84464, "time": "2006-01-11T16:03:54Z", "creator": "msulliva@odu.edu", "creation_time": "2006-01-11T16:03:54Z", "is_private": false}, {"count": 13, "attachment_id": null, "bug_id": 26467, "text": "*** Bug 40041 has been marked as a duplicate of this bug. ***", "id": 91306, "time": "2006-07-14T08:35:13Z", "creator": "jorton@redhat.com", "creation_time": "2006-07-14T08:35:13Z", "tags": [], "is_private": false}]