[{"count": 0, "tags": [], "bug_id": 26619, "attachment_id": null, "id": 51629, "time": "2004-02-02T22:06:22Z", "creator": "mweston@demandtec.com", "creation_time": "2004-02-02T22:06:22Z", "is_private": false, "text": "HSSF's only mechanism to write Excel files is to build the entire workbook in\nmemory and then write that out when it's all done. There is no way to write it\nout a row at a time or even a sheet at a time.\n\nI suspect this is hard, but I was surprised to not see any mention of any future\nplans to address it, or even any other bugs filed on this subject. Unless I\nmissed something."}, {"count": 1, "tags": [], "creator": "dmui@apache.org", "attachment_id": null, "id": 51635, "time": "2004-02-03T00:19:55Z", "bug_id": 26619, "creation_time": "2004-02-03T00:19:55Z", "is_private": false, "text": "This is something that's asked about...a lot.  The main issue here is that excel\nplaces pointers to stuff further along, making it very difficult to stream.\n\nThe HEAD branch contains a memory-use refactor to help create larger\nspreadsheets in the memory that you do allot."}, {"count": 2, "tags": [], "bug_id": 26619, "text": "I am also working on the HSSF, I am facing the same memory problem with HSSF. \nIs there any other alternative to HSSF which uses less memory.", "id": 99685, "time": "2007-02-22T07:46:57Z", "creator": "gopi.simhadri@tcs.com", "creation_time": "2007-02-22T07:46:57Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 26619, "text": "This is a limitation of POI. It seems to me that rather than re-opening a long\nago closed issue aksing for an alternative way out of scope a better way would\nbe to post a message on one of the lists.\n\nProbably someone should address this by making an appropriate update to the\nwebsite FAQ with perhaps a rule of thumb about heap usage, and suggestions about\nhow to either make use of CSV / tab-delimited techniques.\n\nI also suspect that a majority of the contributers to POI have been oriented\nmore towards the scanning of files, than the creation and/or maintenance of\nExcel Databases.\n\n(I suspect that someone will come along and close this.)", "id": 99688, "time": "2007-02-22T08:02:23Z", "creator": "dfisher@jmlafferty.com", "creation_time": "2007-02-22T08:02:23Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "yegor@dinom.ru", "text": "Memory consumption has significantly improved in the latest versions of POI. There was a lot of refactoring in core classes, in particular, in handling BIFF records and formula tokens.  \n\nTry the latest POI-3.5-beta4 or download daily builds from  http://encore.torchbox.com/poi-svn-build/\n\nYegor", "id": 123590, "time": "2008-12-29T09:36:36Z", "bug_id": 26619, "creation_time": "2008-12-29T09:36:36Z", "is_private": false, "attachment_id": null}]