[{"count": 0, "tags": [], "creator": "craig.mcclanahan@sun.com", "attachment_id": null, "id": 51639, "time": "2004-02-03T04:10:12Z", "bug_id": 26622, "creation_time": "2004-02-03T04:10:12Z", "is_private": false, "text": "The servlet specification recommends (Section 9.7.2) that containers be\n\"implemented so that classes and resources packaged within the WAR are loaded in\npreference to classes and resources residing in container-wide library JARs.\" \nCatalina implements this such that, when the \"delegate\" property is set to false\n(which is the default), WebappClassLoader will look locally first for the\nloadClass() and getResource() methods.  However, WebappClassLoader does *not*\noverride the getResources() method inherited from the URLClassLoader base class\n-- so getResources() behaves as if the \"delegate\" property is always \"true\".\n\nThis causes problems for applications that have a resource defined in both the\nparent and webapp class loaders.  From the descriptions of getResource() and\ngetResources() in the ClassLoader javadocs, and from the servlet spec statement\nabove, it is natural to expect that the first URL returned by getResources(),\nfor a given resource name, will be the one retrieved if you call getResource()\nwith that same resource name.  This assumption is satisfied if the \"delegate\"\nproperty is set to \"true\", but is *not* satisfied when the \"delegate\" property\nis set to \"false\".  This behavior is more problematic than it might otherwise\nbe, because \"false\" is the default setting.\n\nThe recommended solution is to override the getResources() method in\nWebappClassLoader.  If \"delegate\" is set to \"true\", return the concatentation of\ncalling \"getParent().getResources()\" followed by the list of matching resources\nin the webapp class loader.  If \"delegate\" is false, however, concatenation\norder should be reversed.\n\nNote that this problem exists in Tomcat 4.1 as well.  However, because that\nversion is primarily in maintenance mode now, I did not bother to submit a\nseparate bug report for it."}, {"count": 1, "attachment_id": null, "bug_id": 26622, "text": "WCL implements public Enumeration findResources(String) from URLCL (this method\nis protected in ClassLoader).\nAs for getResources(String) from ClassLoader, well, its declaration is:\npublic final Enumeration getResources(String name)\nIt indeed looks in the parent first, but there's nothing I can do about it. So\nyou have to use findResources in addition to getResources if you're using a URLCL.", "id": 51644, "time": "2004-02-03T08:19:22Z", "creator": "remm@apache.org", "creation_time": "2004-02-03T08:19:22Z", "tags": [], "is_private": false}]