[{"count": 0, "attachment_id": null, "creator": "fpahl@web.de", "text": "If you a apply an empty filter (i.e. one with no filter primitives)\nto a rectangle fill, the element is drawn unfiltered and unclipped.\nThe spec doesn't explicitly state what to do about empty filters.\nAdobe SVG Viewer doesn't show the element at all, but it seems a\nmore natural extension of the general behaviour to this special\ncase to pass the source graphics through unfiltered. (I've submitted\na request for clarification of the spec.) The spec is also not very\nclear on the meaning of the filter effects region in this case, but\nit seems the more natural interpretation of Section 3.7 and the\nfirst sentence of Section 15.5 that applying a filter clips the\nresults to the filter effects region, even if the filter is empty.\n\nTo summarize, neither behaviour is explicitly mandated by the spec,\nbut it seems to me that Batik is right about using the unfiltered\nsource graphics but wrong about not clipping.", "id": 52031, "time": "2004-02-10T06:08:20Z", "bug_id": 26815, "creation_time": "2004-02-10T06:08:20Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "deweese@apache.org", "text": "Please update the bug if you get an answer from the WG.", "id": 62776, "attachment_id": null, "bug_id": 26815, "creation_time": "2004-08-30T11:59:44Z", "time": "2004-08-30T11:59:44Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 26815, "is_private": false, "text": "Reassigning all open bugs to the development list.\nSorry for the mass mailing.", "id": 40406, "time": "2005-03-22T12:16:31Z", "creator": "deweese@apache.org", "creation_time": "2005-03-22T12:16:31Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "cam@apache.org", "text": "This was responded to by the WG here:\n\n  http://lists.w3.org/Archives/Public/www-svg/2004Feb/0051.html\n\nIt seems that elements that are filtered by an empty <filter> element should\nnot have any output (since the initial transparent black buffer is the output\nof the filter).  This behaviour is now fixed in SVN.\n", "id": 108504, "attachment_id": null, "bug_id": 26815, "creation_time": "2007-09-22T19:52:15Z", "time": "2007-09-22T19:52:15Z", "is_private": false}]