[{"count": 0, "tags": [], "creator": "chelberg@spss.com", "attachment_id": null, "text": "I'm using an automated process (an XSLT transformation) to generate a file list \nthat is used in a later task to create a fileset. The problem comes when there \nare no files to be added to the fileset. In that case, the includesfile is \nempty. Intuitively, I expected that the following fileset definition would \ninclude no files when tutorial-1-graphics.txt is empty (0 bytes).\n\n<fileset includesfile=\"c:\\work\\xml\\test\\ant\\tutorial-1-graphics.txt\" \ndir=\"/pubs/clementine/Images\"/>\n\nInstead, what happens is that the fileset contains *all* the files \nin /pubs/clementine/images instead of no files.\n\nI can work around it by always writing at least one bogus file to the \nincludesfile (zzz.zzz or something like that), but it seems to me that a \nfileset that uses an empty file to construct its include list ought to end up \nwith no files in it.\n\nIf I've missed something here, and this behavior is designed or intentional, \nperhaps someone would be good enough to point out the logic behind it. (I'm \npretty new to Ant, so it's entirely possible that I just don't understand quite \nas well as I think I do.) Thanks.", "id": 52029, "time": "2004-02-10T04:00:17Z", "bug_id": 26814, "creation_time": "2004-02-10T04:00:17Z", "is_private": false}, {"count": 1, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "text": "This is the standard behavior of ant. If you have a fileset containing no\ninclude elements, then everything *except* the default excludes (like *~,\n**/CVS/*, ...) is included under the base dir of your fileset.\nAs you say, including one dummy file in your fileset stops this behavior.\nSo I am closing your bug report as Invalid.", "id": 52034, "time": "2004-02-10T07:26:50Z", "bug_id": 26814, "creation_time": "2004-02-10T07:26:50Z", "is_private": false}, {"count": 2, "tags": [], "creator": "sg3235@att.com", "is_private": false, "text": "This doesn't seem invalid to me. I wanted to copy files from one directory tree that had a specific svn property file.  I first ran a command in svn that put the paths to all files with the property into a file.  Then I used the copy task with the fileset to copy the files I found.  When I don't find any, it shouldn't copy anything.  The logic of specifying an empty file to mean everything seems backwards and not at all intuitive. I don't think an option to override this behavior is unreasonable, but at the very least it should be documented in Fileset if this behavior is retained.", "id": 154375, "time": "2012-02-29T16:25:10Z", "bug_id": 26814, "creation_time": "2012-02-29T16:25:10Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 26814, "attachment_id": null, "id": 154381, "time": "2012-02-29T19:41:31Z", "creator": "jglick@apache.org", "creation_time": "2012-02-29T19:41:31Z", "is_private": false, "text": "While a <fileset> with no <include> or 'includes' attr does include everything not specifically excluded, it does seem weird that an explicit 'includesfile' which happens to be empty would include anything.\n\nThe documentation for include in patternset mentions the special behavior of no includes, but the documentation for includesfile does not say this. Since there is a risk of backward incompatibility by changing this behavior, I would recommend documenting it, and issuing a warning with an explanation if an empty includesfile (attribute or nested element) is encountered."}, {"count": 4, "attachment_id": null, "bug_id": 26814, "text": "I would indeed say that this behaviour is not intuitive at all. If a user is specifying an includesfile which lists \"patterns to include\", it would seem logical that if the includesfile is empty, no patterns are included..\n\nIn my opinion if this is intended, then at least it deserves a mention in the documentation.", "id": 181471, "time": "2015-03-03T16:08:11Z", "creator": "guille.rodriguez@gmail.com", "creation_time": "2015-03-03T16:08:11Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 26814, "attachment_id": null, "id": 181562, "time": "2015-03-07T11:34:31Z", "creator": "bodewig@apache.org", "creation_time": "2015-03-07T11:34:31Z", "is_private": false, "text": "updated the documentation with git commit 06bdb45"}]