[{"count": 0, "tags": [], "bug_id": 26860, "attachment_id": null, "id": 52123, "time": "2004-02-11T14:43:07Z", "creator": "fpahl@web.de", "creation_time": "2004-02-11T14:43:07Z", "is_private": false, "text": "The premultiplied results of the arithmetic FeComposite filter\nprimitive are being clamped by increasing alpha to the highest\ncolor component. The spec, in Section 15.7.1, merely states:\n\"The RGBA result from each filter primitive will be clamped into\nthe allowable ranges for colors and opacity values. Thus, for\nexample, the result from a given filter primitive will have any\nnegative color values or opacity values adjusted up to color/opacity\nof zero.\" It doesn't specify whether to clamp the alpha value up\nor the color values down. The Adobe Viewer seems to do the latter,\nand the results seem more natural to me; this may be related to the\nfact that this is what would happen if the clamping were performed\non the non-premultiplied values. Batik's method has the advantage that\nit doesn't change the hue, but this could also be achieved by clamping\nthe color values proportionally such that the highest is equal to the\nalpha value. Anyway, the appearance of non-zero alpha values where one\nexpected complete transparency is troublesome.\n\nI've submitted a request for clarification of the spec to www-svg@w3.org"}, {"count": 1, "tags": [], "text": "Created attachment 10315\npink stroke is due to unexpected non-zero alpha values from arithmetic feComposite filter primitive", "attachment_id": 10315, "id": 52125, "creator": "fpahl@web.de", "time": "2004-02-11T14:51:23Z", "bug_id": 26860, "creation_time": "2004-02-11T14:51:23Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 26860, "is_private": false, "count": 2, "id": 52685, "time": "2004-02-20T20:51:01Z", "creator": "fpahl@web.de", "creation_time": "2004-02-20T20:51:01Z", "text": "I just read in the SVG 1.2 draft that alpha compositing using\nblending operations will be required to be clamped as follows:\n\"The opacity value should be clamped between zero and one inclusive,\nand the pre-multiplied color value should be clamped between zero and\nthe opacity value inclusive.\"\nThough this doesn't refer to filtering, it would make sense to use\nthe same clamping rule in both cases; see also my original remarks\non why I prefer this rule.\n"}, {"count": 3, "tags": [], "bug_id": 26860, "attachment_id": null, "id": 52687, "time": "2004-02-20T20:53:35Z", "creator": "fpahl@web.de", "creation_time": "2004-02-20T20:53:35Z", "is_private": false, "text": "Sorry, I meant to add a link to the section I was quoting from:\nhttp://www.w3.org/TR/SVG12/#alpha-compositing\n"}, {"count": 4, "tags": [], "bug_id": 26860, "attachment_id": null, "is_private": false, "id": 40398, "time": "2005-03-22T12:16:17Z", "creator": "deweese@apache.org", "creation_time": "2005-03-22T12:16:17Z", "text": "Reassigning all open bugs to the development list.\nSorry for the mass mailing."}]