[{"count": 0, "tags": [], "creator": "richard.beton@roke.co.uk", "attachment_id": null, "id": 52181, "time": "2004-02-12T13:04:22Z", "bug_id": 26887, "creation_time": "2004-02-12T13:04:22Z", "is_private": false, "text": "The FTP task is an imperfect tool for uploading a website.  It is good because\nit only need upload changed files and because file filters can flexibly select\nthe files to be uploaded.\n\nThe FTP task is unable to delete from the server files that have been deleted\nlocally.  Adding this as an option would mean that it could be used effectively\nto synchronise the local machine with the remote webserver.  It would imply that\nthe remote server only ever contains a proper subset of the files on the local\nmachine."}, {"count": 1, "tags": [], "creator": "stevel@apache.org", "attachment_id": null, "id": 52201, "time": "2004-02-12T17:03:50Z", "bug_id": 26887, "creation_time": "2004-02-12T17:03:50Z", "is_private": false, "text": "First, ftp is imperfect for deploying to any public site as your password is\nsent plaintext; you should be using SCP.\n\nSecondly, how is FTP to know what files to delete? Should it say 'every file\nfound in the remote dir that is not in the local dir should be deleted'? And\nevery directory not found locally should be recursively deleted. We'd get a lot\nmore mail.\n\nI believe you could come up with a solution involve a persistent record of the\nprevious upload and the assumption that any file in that record that is not\nfound locally implies deletion, and should be propagated. But I wouldnt patch it\ndirectly on to FTP for security reasons; SCP is better. Better yet, use the VFS\nstuff in jakarta-commons (I think) and let it sync with any of the supported\nfile systems, ftp, webdav and scp inclusive. That would be cool. \n\nLeaving defect as an enhancement, though it is very much in the 'wontfix without\na new task' category."}, {"count": 2, "attachment_id": null, "creator": "scohen@apache.org", "is_private": false, "id": 75583, "time": "2005-05-30T04:37:57Z", "bug_id": 26887, "creation_time": "2005-05-30T04:37:57Z", "tags": [], "text": "As Steve Loughran has said, there are other ways to solve your use case outside\nof the FTP task."}]