[{"count": 0, "tags": [], "creator": "ppv@milestone.dk", "text": "I have earlier tried to post this to the users list but got no replies so I \nassume it is a bug - otherwise receive my sincere apologies for wasting your \ntime!\nWhat seem to happen is that when a client application stops consuming from its \nNIC's TCP buffer this will eventually stop the server from serving other \nclients than this one. When the client responds with a window size of 0 the \nserver starts sending it 1 byte packets frequently (to check if the window \nsize has been enlarged again) and in this period it will not serve other \nclients. As soon as the client starts consuming again the server works \nnormally again.\nI have tested it with 'clean' installs on Windows NT (workstation), Windows \n2000 (workstation) and 2 Windows XP and the problem occured. I have also tried \nit on 2 Windows 2003 and a Windows 2000 Server and the problem did not occur. \nI can however not see how this should correspond to the OS as the machine \nresponds on all other kinds of network communication (ping, drive-sharing, \netc).\nThere is nothing in the log related to this - not even with debug enabled. \nThe installation is the precompiled win32 binary found on the web site.\nBelow is my original messages posted to the user list - might give some more \ninformation though I have tried to summarize the important parts here.\nRegards, Peter Vestergaard\n\n---------------original messages-------------------------\n\nHi again\nWe have done some more testing and have found out the following:\nIt seems like the problem occurs when the client's window gets full. As \nRealOne is not removing any packets from the window it is slowly filled and \neventually the TCP ACK messages returned from the client tells that its window-\nsize is 0. This causes Apache to start sending HTTP-packets of size 1, which \nthe client TCP ACK's with window-size set to 0, etc. This is a reasonable \nbehaviour, but why does Apache stop handling other clients while this is \nongoing? \nWe have tried installing Apache on a couple of Windows 2003 server machines \nand here there is no problem - it only occurs on the XP's.\nAfter the 'Timeout' (set in httpd.conf) period expires the server (of course) \nagain start working probably as the client is dropped.\nWe are only using two different client machines at a time (but have tried \nseveral), so it should not be anything regarding some connection limitation on \nWin XP (I think).\nIs it a bug or am I doing something wrong?\nBest regards\nPeter Vestergaard\n-----Original Message-----\nFrom: Peter Posselt Vestergaard [mailto:PPV@MILESTONE.DK] \nSent: 10. februar 2004 15:14\nTo: users@httpd.apache.org\nSubject: [users@httpd] apache http-server hangs on .smil,.rm,.swf request\n\n\nHi list \nI am experiencing a weird problem that I have been unable to find any \ninformation about, so now I turn to you. \nI have a freshly installed Apache HTTP-server v2.0.48 (win32-binary downloaded \nfrom http://httpd.apache.org/download.cgi) running on a Windows XP (single-\nprocessor). I have made no other configuration than what is done during the \ninstall (Typical).\n\nI have copied three files to the htdocs directory: one .smil, one .rm and \none .swf file. The .smil file references the two other file - I have put the \ncontent of it in the bottom of this message.\n\nOn the client machines I am using RealOne Player v2.0 to access the .smil file \nand it works fine. Untill I tried it on a machine with no sound card. This \nmade the Real Player pop up a dialog telling me a general error had occured. \nThis error was due to the missing sound card and sound in the .rm file, but \nthat is probably irrelevant.\n\nThe problem is that while the RealOne dialog is showing I cannot access any \npages on the Apache server from any machine! Not even the main test page \n(telling that apache is installed), but as soon as I press OK in the dialog \nthe pages are served.\n\nI have tried installing Apache on two different WinXP machines - the one with \nalmost nothing else installed - with the same result.\n\nAnyone have a clue of what I do/ what is wrong? It is pretty scary to me that \none client can hang up the server like this...\n\nThanks in advance! \nBest regards \nPeter Vestergaard \n\n<smil xmlns=\"http://www.w3.org/2001/SMIL20/Language\" \n    xmlns:rn=\"http://features.real.com/2001/SMIL20/Extensions\"> \n    <head> \n        <meta name=\"title\"       content=\"Testing\" />   \n        <layout> \n            <root-layout backgroundColor=\"#E8EDF1\" width=\"781\" height=\"450\" \nrn:resizeBehavior=\"percentOnly\"  /> \n            <region id=\"video\" width=\"539\" height=\"409\" left=\"123\" top=\"2\" \nfit=\"fill\" z-index='31' /> \n            <region id=\"logo\" width=\"90\" height=\"78\" left=\"10\" top=\"1\" z-\nindex='70' /> \n        </layout> \n    </head> \n    <body> \n          <par> \n                <animation src=\"mylogo.swf\" region=\"logo\" regPoint=\"center\" \nregAlign=\"center\" begin=\"00:00.0\" fill=\"freeze\" />\n\n                <video src=\"intro.rm\" region=\"video\" regPoint=\"middle\" \nbegin=\"00:00.0\"></video> \n          </par> \n    </body> \n</smil>", "id": 52325, "time": "2004-02-16T08:49:50Z", "bug_id": 26965, "creation_time": "2004-02-16T08:49:50Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 26965, "is_private": false, "count": 1, "id": 62709, "time": "2004-08-30T05:01:04Z", "creator": "chip@force-elite.com", "creation_time": "2004-08-30T05:01:04Z", "text": "I am not sure how Apache would fix this. It sounds like it is really a windows configuration problem."}, {"attachment_id": null, "tags": [], "bug_id": 26965, "text": "I'll concur with Paul.", "count": 2, "id": 75004, "time": "2005-05-18T14:20:27Z", "creator": "jorton@redhat.com", "creation_time": "2005-05-18T14:20:27Z", "is_private": false}]