[{"count": 0, "tags": [], "bug_id": 2714, "text": "We are running apache version 1.3.14 and jakarta-tomcat version 3.2.1-3 RPM\ninstalled on linux. We have found that over time the response time of the web\nserver degrades to a point in which our website takes about a minute to load our\nhome page. Over a 24 hour period we notice the response time going from 35\nmillisecond to 300 milliseconds. Once we restart tomcat the response time\nreturns to 35 millisends. We have tested the response time running just apache\nservering a static html page and the response time is a consant 20 milliseconds.\nOur testing of running tomcat has been with our servlets and without (just\nrunning a sinple jsp page) and both degrade at the same levels.", "id": 3879, "time": "2001-07-20T11:06:04Z", "creator": "jcomeau@caldera.com", "creation_time": "2001-07-20T11:06:04Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "Larry.Isaacs@sas.com", "text": "I'm marking this bug as WONTFIX because there will be no further development\non Tomcat 3.2.1.  The current 3.2.x release is Tomcat 3.2.3. Please try this\nrelease and see if this problem is still present.  There was a lot of bug\nfixes, so maybe one of them impacted this problem.  Open a new bug if the\nproblem is still present in Tomcat 3.2.3, or perhaps Tomcat 3.3 if you want\nto give it a try.\n\nNote: There are some serious security vulerabilities in Tomcat 3.2.1, so\nupgrading is highly recommended.\n", "id": 3882, "time": "2001-07-20T11:19:11Z", "bug_id": 2714, "creation_time": "2001-07-20T11:19:11Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "jcomeau@caldera.com", "text": "We have re-tested with Tomcat 3.2.3 and have the same issue. The response time\nin a 24 hour period goes from about 35 milliseconds to 300 milliseconds for a\nsimple jsp page.  ", "id": 4184, "time": "2001-07-31T10:34:16Z", "bug_id": 2714, "creation_time": "2001-07-31T10:34:16Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 2714, "text": "Most likely related with the use of sessions. If you use \"ab\" to test, and the\nJSP page uses session ( default is true - you must specify a directive to\ndisable), then the performance will slowly go down as more sessions are active.\n However, if you let it \"rest\" for some time the sessions should expire and be\ngarbage collected and the performance should go back to normal.\n\nI tried to run for few hours and doesn't seem to be a problem. If you can, try\nto add 2 more jsp pages to your test: one showing the memory use, and the other\ndoing a System.gc() and see if the performance go back to normal. \n\nPlease try in 3.3, as a lot of GC-collection code has been fixed. If the problem\nis still there, please let us know - this should be fixed before the final\nrelease.", "id": 4479, "time": "2001-08-11T09:08:47Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-08-11T09:08:47Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "Larry.Isaacs@sas.com", "attachment_id": null, "id": 6961, "time": "2001-10-21T18:53:30Z", "bug_id": 2714, "creation_time": "2001-10-21T18:53:30Z", "is_private": false, "text": "Reopen to change resolution"}, {"count": 5, "tags": [], "text": "Since there isn't enough information here to make a diagnosis, and since\nCostin wasn't able to duplicate it, I'm going to resolve this as \"INVALID\".\nIt likely wouldn't be fixed in Tomcat 3.2.x anyway.\n\nPlease try Tomcat 3.3 and see if this behavior is still present.  If so, open\na new bug.  Note that simply saying that the response time slows down over\ntime doesn't give us much to go on as far as diagnosing the problem.", "attachment_id": null, "id": 6962, "creator": "Larry.Isaacs@sas.com", "time": "2001-10-21T18:55:07Z", "bug_id": 2714, "creation_time": "2001-10-21T18:55:07Z", "is_private": false}]