[{"count": 0, "tags": [], "text": "When trying to get the content of the URL bellow, OutOfMemoryError is thrown. \n\nhttp://www.pondokwan-klub.si/Aktualno\\pdk-zagorje%202003-rezultati.xls\n\nThis is my code, that uses POI:\n\nHSSFWorkbook wb = new HSSFWorkbook(in);\n\n, where in is InputStream reading content of the above URL", "attachment_id": null, "bug_id": 27286, "id": 53097, "time": "2004-02-27T07:57:18Z", "creator": "samo.login@noviforum.si", "creation_time": "2004-02-27T07:57:18Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 27286, "text": "This is happening because the excel file that is being referenced is too large.\nThe way POI is working is that if anything needs to be done with an excel file, \nthe entire file has to be read into memory first. This is where the problem is.\nIf the excel file is very large...  i.e. the workbook contains lots of sheets \nof data with lots of rows and columns, the ENTIRE data would first be read into \nmemory. Then we can do any modifications with the Workbook object. Then we have \nto write the entire data back from memory to the excel file in one shot. You \ncannot write to a file in parts.\n\nUnfortunately, this is the way POI works. :o(\n\nI guess no one envisioned POI being used to such a large extent where excel \nfiles are toooo large that there is a shortage of memory. \n\nOne short term solution for this problem is to increase your app server memory. \nBut this is a short term solution cause as soon as the excel file becomes \nlarger, the OutOfMemory Error would again be thrown. :o(\n\nA way needs to be developed by POI guys to only read a certain amount of data \ninto memory, work with it and then write it back and then take the next chunk \nof data. \n\nMaybe data being processed should be broken on the basis of Sheets within a \nworkbook. This way the data to be read into memory is limited to a sheet.\n\nBest Regards,\nBonson", "id": 77248, "time": "2005-07-13T10:02:27Z", "creator": "boney_mampilli@yahoo.com", "creation_time": "2005-07-13T10:02:27Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 27286, "attachment_id": null, "text": "Samo, \n\nIs the file linked in your description still available?  ", "id": 77254, "time": "2005-07-13T13:19:03Z", "creator": "avik@apache.org", "creation_time": "2005-07-13T13:19:03Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jheight@apache.org", "text": "The sample file is long since gone to assess any performance problems.\n\nI am going to close this bug as invalid, but Bonson's comments are right. This\nis how POI works at the moment.\n\nJason", "id": 77816, "time": "2005-07-29T04:57:06Z", "bug_id": 27286, "creation_time": "2005-07-29T04:57:06Z", "is_private": false, "attachment_id": null}]