[{"count": 0, "tags": [], "creator": "deymious@yahoo.com", "is_private": false, "text": "In order to specify jar libraries to load at startup I authored a setenv.bat\nfile and put it in /bin, however Tomcat consistently failed to use jar files\nthat were specified in the setenv.bat. I then carefully traced the setting of\nthe CLASSPATH through the multiple initialization scripts and found the\nfollowing line in setclasspath.bat:\n\nset CLASSPATH=%JAVA_HOME%\\lib\\tools.jar\n\nThis line will wipe out the previous CLASSPATH that has been built up to this\npoint. I replcaed this line with:\n\nset CLASSPATH=%CLASSPATH%;%JAVA_HOME%\\lib\\tools.jar\n\nThis can easily be tested. If you remove the soap.jar file from the /common/lib\ndirectory, place it outside of the CATALINA_HOME directory, specify its location\nin the CLASSPATH, and then try to hit localhost:8080/soap/servlet/rpcrouter,\nTomcat will complain. If you then fix the line mentioned above in\nsetclasspath.bat, and rerun Tomcat, it will run quite gracefully.", "id": 53177, "time": "2004-02-28T08:19:33Z", "bug_id": 27310, "creation_time": "2004-02-28T08:19:33Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 27310, "attachment_id": null, "id": 53180, "time": "2004-02-28T08:34:23Z", "creator": "sriramx_2000@yahoo.com", "creation_time": "2004-02-28T08:34:23Z", "is_private": false, "text": "This behaviour is not a bug, it's a feature.\n\nTomcat replaces the CLASSPATH by design. This is intended behaviour.\n\nIf you wish to share the soap.jar file between your web apps, place the jar in \nthe common/lib folder.\n\n"}, {"count": 2, "tags": [], "creator": "deymious@yahoo.com", "is_private": false, "text": "  Providing the user/administrator a way to specify envirnoment variables is a\nfeature, erasing them afterwards is an engineering fault.\n\n  If it IS a feature, it is woefully underengineered. The reinitialization of\nthe CLASSPATH happens very late in the startup process, after the CLASSPATH has\nbeen amended by other scripts that are run earlier in the startup sequence.\nNamely, it will rewrite the CLASSPATH after the setenv.bat file (if you specify\none) has been run. This means that if you change the CLASSPATH, an environment\nvariable, in the setenv.bat script, then your changes will be lost. It is quite\nclear then that this can not be the desired function, namely; creating a special\nhook in the startup sequence to allow you to change environment variables, and\nthen afterwards overwriting changes that were made. Obviously either the line in\nsetclasspath.bat needs to be altered as suggested, or the call to setenv.bat\nmoved farther along in the startup sequence after the offending line of code, or\nthe call to setenv.bat removed entirely.", "id": 53194, "time": "2004-02-28T20:39:37Z", "bug_id": 27310, "creation_time": "2004-02-28T20:39:37Z", "attachment_id": null}]