[{"count": 0, "tags": [], "bug_id": 27480, "text": "I would like to use the CSVRead function to dynamically specify the Protocol, \nServer Address and port but am unable to.\n\nI currently have many environments so I need to edit these parameters for each \nof my test cases.  It great to have the HTTP Request Defaults, rather than \nediting each sampler, but it would be even better to allow these values to be \ndynamic.", "id": 53527, "time": "2004-03-05T18:37:15Z", "creator": "martin123456789@hotmail.com", "creation_time": "2004-03-05T18:37:15Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 27480, "is_private": false, "count": 1, "id": 53571, "time": "2004-03-07T01:26:04Z", "creator": "sebb@apache.org", "creation_time": "2004-03-07T01:26:04Z", "text": "Works for me using a recent build. What errors are you seeing in the log file? \nCan you post a short test-case to reproduce the problem?\n\nUnless you want to use multiple values during a run, you might find the __P() \nproperty function works just as well."}, {"count": 2, "tags": [], "creator": "martin123456789@hotmail.com", "is_private": false, "text": "Created attachment 10710\nTest plan which duplicates issue - CSVRead now working in default HTTP Controller", "id": 53677, "time": "2004-03-08T20:52:59Z", "bug_id": 27480, "creation_time": "2004-03-08T20:52:59Z", "attachment_id": 10710}, {"count": 3, "tags": [], "creator": "martin123456789@hotmail.com", "is_private": false, "text": "Created attachment 10711\nThe CSV File for the test case", "id": 53678, "time": "2004-03-08T20:53:47Z", "bug_id": 27480, "creation_time": "2004-03-08T20:53:47Z", "attachment_id": 10711}, {"attachment_id": null, "tags": [], "bug_id": 27480, "is_private": false, "count": 4, "id": 53679, "time": "2004-03-08T21:10:50Z", "creator": "martin123456789@hotmail.com", "creation_time": "2004-03-08T21:10:50Z", "text": "Sebb,\n\nI have narrowed down the problem and have attached a test case that should \nduplicate it.  I'm using the 02/24 nightly build but I've seen this issue with \n1.9.1 and 02/07 builds as well.\n\nEach of the HTTP Request Default's (Protocol, Server Name and Port) look like \nthis:\n\n${__CSVRead(${ThreadConfig},0)}${__CSVRead(${ThreadConfig},next)}\n\nIt's the 'next' that the problem; and if I remove it and place the protocol, IP \nand port on the same row it works.  If you run as is, you'll notice  the \nmalformed URLs in the request tab of the tree listener.\n\nAs you can see from my CSV file, the goal was to place the settings for a \nsingle environment in a column and use a variable for the index; that way one \nchange would allow me to switch environments.\n\nI'll look into ${__p()} as you can suggest; I don't yet know what it does yet \nbut I can read about it.\nthanks."}, {"count": 5, "tags": [], "creator": "sebb@apache.org", "text": "Thanks for the test case - the problem proved to be quite interesting!\n\nTurns out that the fields on the HTTP Request Defaults Screen are not \nprocessed in the order one might expect.\nAs it happens, the Server Name is processed before the Port.\n\nYou can see this by adding different ${__logn(SomeText)} calls to the end of \nthe lines. \n\nThe __logn() function logs the text, and returns the empty string. \n[The similar __log() function logs the text but returns its first parameter, \nso can be used as follows: ${__log(${__somefunc()})}]\n\nIn my test, using logn() shows the following sequence:\n\nPath, Server, Protocol, Port, Protocol, Port, Server, Path, Server, Protocol, \nPort, Protocol, Port, Server.\n\nNo wonder next does not seem to work!\n\nThere is no guarantee as to the order in which Sampler fields will be \nevaluated and the order may change from release to release or even between \nreleases.\n\nThe standard way to use CSVRead (and StringFromFile etc) is to use them to set \nup variables in a User Parameters Pre-Processor element, and then reference \nthe variables from then on.\n\nFunctions which always return the same value (e.g. __machineName()) can of \ncourse be used safely in Samplers.\n\nChanging the status to Fixed - hope that's OK; if not, please reopen.", "id": 53755, "time": "2004-03-09T21:01:43Z", "bug_id": 27480, "creation_time": "2004-03-09T21:01:43Z", "is_private": false, "attachment_id": null}]