[{"count": 0, "tags": [], "bug_id": 27704, "is_private": false, "id": 54058, "attachment_id": null, "creator": "ronald@finalist.com", "creation_time": "2004-03-16T12:52:50Z", "time": "2004-03-16T12:52:50Z", "text": "A JSP that maps to a url-pattern in a jsp-property-group does not return the\ncorrect result on calling request.getServletPath(). Instead, this call will\nalways return the property group url pattern minus the trailing '/*'.\n\nExample:\n<url-pattern>/level1/*</url-pattern>\n\nA JSP in the directory '/level1/level2/test.jsp' calls request.getServletPath().\nThe result is '/level1' i.o. '/level1/level2/test.jsp'. This may be related to\nbug 27664.\n\nI will attach a test.war file that demonstrates the described behavior."}, {"count": 1, "tags": [], "bug_id": 27704, "is_private": false, "id": 54059, "attachment_id": 10803, "creator": "ronald@finalist.com", "creation_time": "2004-03-16T12:53:51Z", "time": "2004-03-16T12:53:51Z", "text": "Created attachment 10803\nTest case for the described behavior."}, {"count": 2, "tags": [], "bug_id": 27704, "is_private": false, "text": "Well, again, this is normal: the JSP servlet is mapped to the\njsp-property-group. Again, very little chance of being fixed for now ;)", "id": 54061, "time": "2004-03-16T12:58:11Z", "creator": "remm@apache.org", "creation_time": "2004-03-16T12:58:11Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 27704, "is_private": false, "text": "Ok, this may be perfectly normal from a code perspective, but it is unexpected\nbehavior that has by now caused me to replace my Servlet2.4/JSP2.0 application\nfor a Servlet2.3/JSP1.2 application.\n\nOf course everything will also work using the older specs but I'm looking\nforward to these issues being fixed in a (hopefully not to remote) future version.\n\nAnd thanks for not closing my bug this time so I'd have to reopen it again ;)", "id": 54063, "time": "2004-03-16T13:10:22Z", "creator": "ronald@finalist.com", "creation_time": "2004-03-16T13:10:22Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 27704, "is_private": false, "text": "I completely disagree with your two bug reports. Either they are invalid or the\nspecification is broken. The main problem is this sentence: \"If at least one\n<jsp-propertygroup> contains the most specific matching URL pattern, the\nresource is considered to be a JSP file\". This is clearly extremely bad behavior\nwhen using wildcard patterns.\nI am going to veto any attempt to fix these last two \"bugs\" (with bug 27664)\nuntil I am explained why the specification is not broken.", "id": 54065, "time": "2004-03-16T13:32:16Z", "creator": "remm@apache.org", "creation_time": "2004-03-16T13:32:16Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "ronald@finalist.com", "attachment_id": null, "text": "I do not understand the badness of this behavior. If a resource is matched by a\njsp-property-group, it should be considered a JSP file. If a resource has the\nextension .jsp it should be considered a JSP file. What's the difference between\nthese two?\n\nIf you include directories with the resources that match a url-pattern, this\nexplains bug 27664: a directory is then served as a JSP file, which can not be\nfound, resulting in a 404.\n\nHowever, JSP3.3 states: \"A JSP property group is a collection of properties that\napply to a set of files that represent JSP pages.\" Directories are apparently\nnot included in this definition.\n\nSRV9.10 states: \"The purpose of this mechanism is to allow the deployer to\nspecify an ordered list of partial URIs for the container to use for appending\nto URIs when there is a request for a URI that corresponds to a directory entry\nin the WAR not mapped to a Web component.\" Requests for a directory should\nresult in an attempt to append welcome files to this directory.", "id": 54067, "time": "2004-03-16T14:40:41Z", "bug_id": 27704, "creation_time": "2004-03-16T14:40:41Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 27704, "attachment_id": null, "text": "The problem is that this jsp-property-group feature is that it conflicts with\nservlet mapping rules, and forces the JSP implementation to be a mini servlet\ncontainer in itslef.", "id": 54068, "time": "2004-03-16T14:48:15Z", "creator": "remm@apache.org", "creation_time": "2004-03-16T14:48:15Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 27704, "text": "Ok, I agree with the fact that this will probably make a mini servlet container\nof the JSP implementation and that this is undesired. But not fixing this also\nmeans that Tomcat is not fully compliant with the spec. This may become a\nproblem when products that Tomcat is integrated into attempt to become J2EE 1.4\ncompatible.\n\nYou'll probably be happy to know this is the last thing I will say about this issue.", "id": 54071, "time": "2004-03-16T15:14:59Z", "creator": "ronald@finalist.com", "creation_time": "2004-03-16T15:14:59Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 27704, "is_private": false, "text": "As I said, I contend that this was not what was intended by the spec authors.\nDue to the \"servlet mapping\"-like effect of jsp-property-group, and yet the need\nto have web server like features and a JSP container (I'm sure in 5 minutes\nyou'll be complaining that directory listings do not work), you need special JSP\nspecific processing in your servlet container (and this processing is relatively\ncomplex).\nTo implement jsp-property-group properly, you probably would have to do some\nmapping hacks, and assign some requests to the JSP servlet (after regular\nmapping), which is relatively complex (jsp-property-group/url-mapping is not\ntrivial, and you have to do it during request dispatching as well), has a\nperformance cost (similar to filter mapping), and introduces obvious\ndependencies with JSP.\nThat violates the original design idea of the independence of the servlet and\nJSP specs.", "id": 54074, "time": "2004-03-16T15:25:24Z", "creator": "remm@apache.org", "creation_time": "2004-03-16T15:25:24Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 27704, "text": "Reopening so that I can close it as FIXED.\n", "id": 54232, "time": "2004-03-18T17:25:59Z", "creator": "jan.luehe@sun.com", "creation_time": "2004-03-18T17:25:59Z", "is_private": false, "attachment_id": null}]