[{"count": 0, "tags": [], "bug_id": 27895, "attachment_id": null, "id": 54545, "time": "2004-03-24T09:03:23Z", "creator": "Joerg-Cyril.Hoehle@t-systems.com", "creation_time": "2004-03-24T09:03:23Z", "is_private": false, "text": "Hi,\n\nthe current \"view result tree\" output for JDBC requests is a regression against \n1.7b3.\nBack in 1.7.b3, large output got a horizontal scrollbar and there was one \ndisplay line per SQL column.\nNow in 1.9.1, long lines are folded, like with tty terminals, so large column \noutput becomes unreadable because unrelated columns appear above each other.\n\nFor the history record, 1.7.3 and 1.8 were severely broken in this respect, they \njust showed org.apache...JDBCSampler@ac3ef70 in text area.\n\nI suggest as enhancement to re-establish an improved version of 1.7b3.\n\nThe improvement is necessary because sometimes, column output is not in vertical \ncolumns (probably some TAB expansion issue?). Here is an example:\nAbkId\tAbkz\tBedeutung\tHinweis\n1\tRAID\tRedundant Array\tnull\n2\tPO\tPurchase Order\tnull\n3\tES\tE??-Security\tnull\nwhich appears nicely in columns in this bug-report form, but not in JMeter's \ndisplay... More precisely, the first \"null\" appears shifted to the right, \nprobably because \"Redundant Array\" just ends before the left side of column \n\"Hinweis\".\n\nAnother improvement could be to use GUI objects for column output instead of a \ntext widget, so that the width of the columns could be resized. Actually, I was \npretty sure I had seen this in the old JMeter, but now that I used 1.7b3 again \nfor reporting this issue, it seems like my memory was wrong.\n\nMaybe using GUI widgets would kill performance for large query results?\n\nRegards"}, {"count": 1, "tags": [], "bug_id": 27895, "attachment_id": null, "id": 54547, "time": "2004-03-24T09:09:26Z", "creator": "Joerg-Cyril.Hoehle@t-systems.com", "creation_time": "2004-03-24T09:09:26Z", "is_private": false, "text": "Bug #15999 - marked as fixed - mentions that JDBC output looks like HTTP output. \nIndeed, 1.9.1 still displays \"render html\" buttons, which IMHO doesn't make \nsense for column-oriented JDBC output. What's been fixed with #15999?"}, {"count": 2, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "text": "Very old bugzilla.\nNot crucial nor clear now (more than 11 years after it) and we have lot of work.\nClosing as WONTFIX.", "id": 187234, "time": "2015-12-29T21:00:33Z", "bug_id": 27895, "creation_time": "2015-12-29T21:00:33Z", "is_private": false}]