[{"count": 0, "tags": [], "creator": "kthakore@taxautomation.com", "text": "I had Tomcat 5 installed and as soon as I tried to start the NT service: Apache \nTomcat, it gave me the following error: \"Error 1053: The service did not \nrespond to the start or control request in a timely fashion\". After some online \nsearching it turns out that by simply installing my jdk under Program Files and \nhaving my JAVA_HOME point to that jdk it works. I had my jdk installed under \nc:\\jdk1.3.1_11 and it apparantely did not like it. The strange part though is \nthat i could start the service through the startup.bat with my JAVA_HOME \npointing to c:\\jdk1.3.1_11.", "id": 54741, "time": "2004-03-26T14:34:46Z", "bug_id": 27984, "creation_time": "2004-03-26T14:34:46Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "This works for me. The most likely is that you have a bad installation (either\nthe registry is wrong or something).", "attachment_id": null, "bug_id": 27984, "id": 54747, "time": "2004-03-26T15:57:49Z", "creator": "remm@apache.org", "creation_time": "2004-03-26T15:57:49Z", "is_private": false}, {"count": 2, "tags": [], "creator": "kthakore@taxautomation.com", "text": "Aparently I am not the only one having this issue:\n<http://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg117957.html> and\n<http://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg117963.html>.\nEven though these people are referring to one release older version of Tomcat 5 \nI feel it does not have to do with a bad installation. It might be attributable \nto the OS version but I don't think it was a bad installation. You probably had \na jdk installation under your Program Files somewhere or you just are not on \nthe same OS.", "id": 54748, "time": "2004-03-26T16:23:41Z", "bug_id": 27984, "creation_time": "2004-03-26T16:23:41Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "william.barker@wilshire.com", "text": "Yes, the service wrapper's logic for detecting the JVM could be improved.  \nIt's a little too fragile at the moment.\n\nHowever, the service wrapper is a commons-daemon component, not a Tomcat \ncomponent so this is the wrong place to report problems with it.", "id": 54754, "time": "2004-03-26T19:12:50Z", "bug_id": 27984, "creation_time": "2004-03-26T19:12:50Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 27984, "text": "That's true, but the main reason remains that users like to play with Java \ninstallations, registry settings, etc.\nIf the JDK or JRE is properly installed then the correct (default) JVM will be \nfound.\nWe can speak on detecting other JVM's like JRockit, IBM and others, but trying \nto solve the user messed installation would lead to nowhere.\n\nProcrun depend right now on registry settings for JVM that is set during JVM \ninstallation, and it will use the default JVM. To change the default JVM, add \nanother, etc, one can use Java Web Start preferences.", "id": 54755, "time": "2004-03-26T19:36:30Z", "creator": "mturk@apache.org", "creation_time": "2004-03-26T19:36:30Z", "tags": [], "is_private": false}]