[{"count": 0, "tags": [], "text": ">     I am running JMeter 1.9.1 with JRE 1.4.2 (Windows XP). There are \n>> some problem to run mozilla browser 1.6 with the http proxy server. I \n>> can browse www.cisco.com, www.ebay.com but the browser will display a \n>> blank page when I browse www.yahoo.com or www.google.com. I switched to \n>> use IE 6.0 in the sam environment and it works fine. Someone mentioned \n>> that the http proxy has problem to handle gzip encoding type. Is there \n>> any fix or any way to get around this problem ?\n\n\n\nHello,\nI confirm that there is a problem even with CVS version. As far as I can\nsee it's a problem with gzipped content - the jmeter proxy decodes the\ndata but the http header content-encoding is not changed. I think the\nexplorer is more \"clever\" and just ignores this header. \nIt should be very simple to fix, you can do it yourself (and submit a\npatch of course  :)  or I can try (maybe) do it by tomorrow (maybe) :))\nYou could also find if there is appropriate entry in bugzilla and add it\nif it is not.\n\nbest regards,\nMichal Kostrzewa", "attachment_id": null, "id": 54987, "creator": "ljou1@comcast.net", "time": "2004-03-31T18:33:41Z", "bug_id": 28103, "creation_time": "2004-03-31T18:33:41Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 28103, "is_private": false, "text": "It's not so easy to fix, unfortunately, as the simple place to fix the headers -\nin HTTPSampler - is also an inappropriate place to do it since then real test\nresults would lose information.\n\nFixing it in the proxy is a pain and ugly (but which I did anyway).  It seems to\nbe working nicely in Mozilla on linux.  Someone should check it out in IE and\nWindows.\n\nA better fix in the future would be to subclass HTTPSampler with a\nProxyHttpSampler that does proxy-needed things like this in a more\nstraightforward fashion.  But that's more work than I wanted to do right now.", "id": 55229, "time": "2004-04-03T20:31:06Z", "creator": "mstover1@apache.org", "creation_time": "2004-04-03T20:31:06Z", "attachment_id": null}]