[{"count": 0, "tags": [], "creator": "mraible@apache.org", "attachment_id": null, "text": "According to this Bugzilla instance, Tomcat is the \"Official Reference implementation\" for JSPs and \nServlet.  However, I've seen Craig McClanahan state the following:\n\n<qoute>\nThere is a (mis)conception, for example, that Tomcat is the RI for the servlet and JSP APIs. That is not \nthe case -- the official RI is the \"J2EE SDK\" available at http://java.sun.com/j2ee/1.4/download-\ndr.html. It happens to *include* code from Tomcat, but this is the real RI.\n</quote>\n\nShould Bugzilla's description be changed?", "id": 54993, "time": "2004-03-31T20:32:36Z", "bug_id": 28106, "creation_time": "2004-03-31T20:32:36Z", "is_private": false}, {"count": 1, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "No hair splitting please.", "id": 54995, "time": "2004-03-31T20:45:29Z", "bug_id": 28106, "creation_time": "2004-03-31T20:45:29Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 28106, "attachment_id": null, "id": 54996, "time": "2004-03-31T20:48:45Z", "creator": "jessh@ptc.com", "creation_time": "2004-03-31T20:48:45Z", "is_private": false, "text": "Not only is it silly to split hairs, but they quote about the only official\nreference implementation being the full J2EE SDK helps propagate the silly myth\nthat one cannot do standards-based server-side Java development without a full\nblown J2EE app server.\n\nI personally believe it is important that Tomcat *standalone* be quite\nofficially the JSP/Servlet spec reference implementation -- i.e. to prove\noutright that these standards do not require the presence of an app server in\npractice."}, {"count": 3, "tags": [], "bug_id": 28106, "text": "Jess, the only problem with what you are saying is that it is factually\nincorrect (or, in normal lay person speak), a lie.\n\nWhat the Tomcat community should want is to say that they have passed the\ncompatibility tests for the servlet and JSP APIs.  Thanks to work by Apache with\nthe Java Community Process, it is possible for nonprofit organizations like\nApache to accomplish this goal.  The Tomcat development team hasn't yet chosen\nto formally test its implementation (although, since there are Sun committers\nworking on Tomcat, it's been informally tested).\n\nTomcat never has been, is not, and most likely never will be the \"official\" RI\nfor the servlet and JSP APIs ... that's totally up to the spec lead for the\ncorresponding JSRs (most recently, JSR-152 for JSP 2.0 and JSR-154 for Servlet\n2.4).  More information on how this all works can be found at the JCP web site\n(http://jcp.org).\n\nIn the mean time, I'm going to go ahead and tweak the Bugzilla descriptions, so\ndon't bother to reopen the bug report.\n", "id": 54999, "time": "2004-03-31T21:55:13Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2004-03-31T21:55:13Z", "is_private": false, "attachment_id": null}]