[{"count": 0, "tags": [], "creator": "dkap+Apache@haven.org", "attachment_id": null, "id": 55014, "time": "2004-04-01T06:29:18Z", "bug_id": 28116, "creation_time": "2004-04-01T06:29:18Z", "is_private": false, "text": "I have wished to set up local execution of files that end in .cgi and yet, I\nkeep getting the:\n\nServer error!\n\nThe server encountered an internal error and was unable to complete your request.\n\n    Error message:\nPremature end of script headers: test.cgi\n\nIf you think this is a server error, please contact the webmaster\nError 500\n\n    www.carolingia.org\n    Thu Apr 1 01:16:50 2004\n    Apache/2.0.40 (Red Hat Linux)\n\nerror message.  I've set up the same directory to be accessed in two different\nways, so I know it's somewhere in the UserDir diretor, for, if you look at the\ntwo URLs:\n\nhttp://www.carolingia.org/~margaret/cgi_bin/test.cgi\nhttp://www.carolingia.org/margaret/cgi_bin/test.cgi\n\nyou will see that they point to the same place, with the only difference between\nthem is the UserDir and the Alias, hence:\n\nUserDir public_html_carolingia\n\nAlias /margaret/ /users0/margaret/public_html_carolingia/\nAlias /margaret /users0/margaret/public_html_carolingia/\n\nIf I add in a rewrite rule:\nRewriteRule ^/~margaret(.*)$ margaret$1 [R]\n\nIt does the proper redirect, and Test is read,\n\nBTW the \"test.cgi\" file is simply:\n\n#!/bin/sh\n\necho \"Content-type: text/html\"\necho\necho \"<HTML><HEAD><TITLE>Test</TITLE></HEAD><BODY>\"\necho \"<H1>Test</H1></BODY></HTML>\"\n\nso there shouldn't be any delays or anything else that chokes it.  Basically a\nhello world program.\n\nIt works under one, and not the other.  The only error in the error log is the\nsame as the error on the page served:\n\n[Thu Apr 01 01:16:53 2004] [error] [client 64.46.153.35] Premature end of script\nheaders: test.cgi\n\nI've gone through all the changelog, and all the bug reports, and nothing even\nvaguely mentions this.  On many sites from Google, there are a number of folks\nrunning into this problem, moving their scripts away from a public_html\ndirectory, finding that they work, and giving up.\n\nThis is not exactly what I want to do, nor to add a redirect rule for everyone.\n\nTheoretically this should just work.\n\nSince they are accessing the same directories, the <Directory></Directory>\nsection is obviously working, but the script is only working in one reference.\n\nHelp?"}, {"count": 1, "tags": [], "creator": "nd@perlig.de", "attachment_id": null, "id": 55015, "time": "2004-04-01T06:43:32Z", "bug_id": 28116, "creation_time": "2004-04-01T06:43:32Z", "is_private": false, "text": "It's likely not bug, but a suexec problem. Please have a look into suexec's log."}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 55064, "time": "2004-04-01T15:38:27Z", "bug_id": 28116, "creation_time": "2004-04-01T15:38:27Z", "is_private": false, "text": "Right.  When a cgi fails in the user directory but suceeds elswhere, it\nis almost always an suexec issue.  (Empirically, I have seen this problem\nreported numerous times, and turning off suexec always solves it.)\n\nGiven the prevelance of the problem, it might be tempting to include it\nin the FAQ.  But on the other hand, the problem only appears because silly\nthird-party distributors enable suexec by default without sufficiently\ninforming their users.  People who download apache from httpd.apache.org\ndo not run into this problem.  (Judging from the ancient version you are using,\nI'd guess you are using a Redhat package.)\n\nThe problem is also helped by the new \"suexec policy error\" message\nthat is written in the logs.  But I don't think that has ever been\nbackported from 2.1 into 2.0.\n\nIf you need more help, please try a user support forum like \nhttp://httpd.apache.org/lists.html#http-users"}, {"count": 3, "tags": [], "creator": "dkap+Apache@haven.org", "attachment_id": null, "id": 55203, "time": "2004-04-02T23:02:42Z", "bug_id": 28116, "creation_time": "2004-04-02T23:02:42Z", "is_private": false, "text": "Indeed, it was a suexec problem.\n\nAnd I had no way of finding out what the particular flags suexec was compiled\nwith, and being that, by policy, any heavy-use package HAS to be RPM installed\n(and there is no heavier used package on that machine) I simply followed the\nstated Apache way of doing things, and brute-force turned it off by removing\n/usr/sbin/suexec and left a note in the machine logs, that when the RPM is\nupgraded, this needs to be tweeked, along with the /etc/httpd/conf/httpd.conf file.\n\nHaving this as a faq would be a good thing.  Being able to discover, somehow,\nthe suexec flags would also be a good thing, but probably would be a security\nhole, so the same people who turned on suexec, would disable said information\npathway ... *sigh*\n\nThank you for your time and effort."}, {"count": 4, "tags": [], "creator": "nd@perlig.de", "attachment_id": null, "id": 55208, "time": "2004-04-03T00:04:20Z", "bug_id": 28116, "creation_time": "2004-04-03T00:04:20Z", "is_private": false, "text": "Uh... it could be so simple.\n\nHave you ever looked at\nhttp://httpd.apache.org/docs-2.0/programs/suexec.html aka `man suexec`? ;-)"}, {"count": 5, "tags": [], "creator": "dkap+Apache@haven.org", "attachment_id": null, "id": 55269, "time": "2004-04-04T22:11:11Z", "bug_id": 28116, "creation_time": "2004-04-04T22:11:11Z", "is_private": false, "text": "I should have left well-enough alone.  But no, I had to go and re-install, so I\ncould see what suexec's flags were.  This is what Redhat is/was shipping as the\ndefault compile flags:\n\n./suexec -V\n -D AP_DOC_ROOT=\"/var/www\"\n -D AP_GID_MIN=500\n -D AP_HTTPD_USER=\"apache\"\n -D AP_LOG_EXEC=\"/var/log/httpd/suexec.log\"\n -D AP_SAFE_PATH=\"/usr/local/bin:/usr/bin:/bin\"\n -D AP_UID_MIN=500\n -D AP_USERDIR_SUFFIX=\"public_html\"\n\nWhich, according to your documentation at:\nhttp://httpd.apache.org/docs-2.0/suexec.html\n\nespecially the part that says:\n If you have virtual hosts with a different UserDir for each, you will need to\ndefine them to all reside in one parent directory; then name that parent\ndirectory here.\n\nand take that and make that part of the faq.  Also, point out (somewhere?) that\nthe remapping (aliasing it out of the ~name expansion) means that suexec doesn't\ntake any consideration as to the running of the scripts, as far as I can tell. \nThis, in and of itself, might be a bug, but I leave that for some of you\nsecurity heads."}, {"count": 6, "text": "I'm sorry, but that is not at all clear.\n\nExactly what bug are you reporting here?  Exactly what is apache doing\nthat it isn't supposed to be doing?", "bug_id": 28116, "is_private": false, "id": 55270, "time": "2004-04-05T00:23:12Z", "creator": "slive@apache.org", "creation_time": "2004-04-05T00:23:12Z", "tags": [], "attachment_id": null}, {"count": 7, "text": "The bug is that it works differently under different circumstances, and that\nthings that might be expected to be covered by suexec, might not be, and if\nsuexec can take multiple directions/directories correctly.\n\nThe second bug (and possibly more important bug) is that this is documented\nNOWHERE cohesively, and I was suggesting that, for sanity's sake, you add it to\nyour faq, simply because, wherever I go on the net I can find the questions, but\nno answers.  Google finds over 400 pages that are all qestions of this type, and\nnot a single one of them has resolution, nor is the resolution easlily found on\nyour pages, hence it is a UI or usability bug.  I've tried to add all the\ndocumentation I could find to help the writing of the FAQ or page as easy as\npossible, but I am not an author, so it probably needs to be checked and shortened.", "bug_id": 28116, "is_private": false, "id": 55271, "time": "2004-04-05T00:40:00Z", "creator": "dkap+Apache@haven.org", "creation_time": "2004-04-05T00:40:00Z", "tags": [], "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 28116, "is_private": false, "text": "I think that if you read back through what you have written, you'll see that\nthere are a couple serious grammatical problems that make it very difficult\nto tell what exactly you are suggesting.\n\nBut if I do my best to guess your intention, it seems like you are saying\nthat some of the restrictions on suexec are not documented in obvious enough\nplaces.\n\nI'm going to mark this WONTFIX, because we don't want anybody to be using\nsuexec without reading completely and carefully the docs at \nhttp://httpd.apache.org/docs-2.0/suexec.html\nNote particularly the \"Before You Begin\" section.\nTherefore putting suexec instructions in the FAQ could do more harm\nthen good.\n\nIf you find any errors in suexec.html, I'd be happy to fix them.\n\nThe only real bug I see is that some third-party distributors enable\nsuexec by default.  That is obviously something you'll need to take\nup with the people who gave you Apache.\n\nThanks for your suggestions and thanks for using Apache!", "id": 55275, "time": "2004-04-05T02:56:27Z", "creator": "slive@apache.org", "creation_time": "2004-04-05T02:56:27Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 28116, "attachment_id": null, "text": "1) having worked in the software business (as in, the side that makes money) I\nknow that UI (meaning user interface) bugs are real bugs, and it is a user\ninterface problem I am documenting here.\n\nBy saying that you just won't fix it, you are simply pissing people off.  Not\njust me, simply do a Google search on the problem and see how many people are\nfrustrated with it.\n\nBy ignoring the suggested (and easy) fix, which is creating a FAQ entry, simply\ndue to possibly some torturous grammer (though I did hand the bug entry to\nseveral of my friends, some of whom are techies, some of whom are writers, and\none who is an english teacher) and none of them had trouble following what I was\nsaying, or finding where my research lead, and how much of my time I put into\nfixing your bug, by documenting what was done by me.\n\nYou don't easily document \n  a) how to \"turn off suexec\" \n  b) how to diagnose that it is suexec, as opposed to a Unix permissions\n     problem, <Directory></Directory> permission problem, or any other problem,\n     all of which it might actually be \n  c) according to the logs, you never even bothered to check the examples I set\n     up for you, just made assumptions\n  d) when I did try the user support forums, they have many documented issues\n     with various variations of the problem I'm having, but none with any actual\n     solutions, nor any FAQs generated, the most I got was a \"wo, ruff, man,\n     bugzilla-it.\"\n  e) actually read what I wrote about putting the information into a faq, which\n     did involve\n     I)  how to not use suexec, if it was shipped to you\n     II) why your error might all of a sudden show up because of suexec, after\n         an upgrade or the like\n     III) how to find out what your suexec actually is looking for, though, as I \n          mentioned, that might be a security hole, due to now knowing where to\n          put your compromising scripts.\n\nI did not ask for a FAQ on how to use the most precious suexec to actually\nprotect files that all your warnings are about, or why one should only download\nand compile by hand every single binary that is used on the system, straight\nfrom the site that produced it, regardless of the amount of testing that would\ntake, and the amount of hoops one has to jump through every single time, to\ncompile it with all the flags, and recompile it with all the relevant latest\nmodules, and cross-compiles, on each of the 370 or so machines that I support,\nrunning the piece of software, or, instead, depend on those saintly third-party\ndistributors, who maintain a working compiled state of your software, combined\nwith a working state of all the other little software bits necessary to produce\nother products.  All I asked for was for you, who's product I have had the\npleasure of using, up until this little problem, and, now that I've settled my\nissue, and was just hoping to help the other folks out there who didn't have the\npersistance, or, perhaps resources to follow it up to the extent that I did, or\nperhaps the advanced grasp of grammer that I manage to maintain, all I get is\ndistain from you,Joshua Slive, whereas the consice and direct comments by  André\nMalo, who didn't seem to have any problems divining my meanings, were actually\nhelpful. \n\n2) there might very well be a bug there, in suexec, for, with it running, I\nmanaged to get the (possibly potentially harmful) script running without being\nunder it's perview, for if you bothered to actually read the bug reports I\nfiled, expecially the first part, documenting the error that I was getting, you\nwould see that none of the flags that suexec was compiled with were in operation\nin the Alias pointer, and therefore the script still should have failed under\nthat circumstance ACCORDING TO YOUR OWN DOCUMETATION on suexec. THIS MIGHT BE A\nBUG.  Give it to whatever QA folks you have to find out, for I have systems to\nrun, and can't be your QA team, I have to keep \"documented stable\"\nconfigurations up and running.  \n\nThe above, was, of course, one of the reasons I ended up tracking suexec down\nlast, through cryptic hints in various .h and make files, to find out if that\nwas the failure, for, unlike your documentation, when it starts up, it doesn't\nsay anything in the log files, and since, my log files (due to them being\nVirtualHosts (oh, and by the way, if you have something that is true within a\ncontext, and you make your docs searchable, you should maintain a consistancy\nwith your tagging, and say VirtualHost every time, not an occasional one with a\nspace between them)) are in a different location, the global suexec log file was\nnot obviously in place (I did a grep across all the log files for the word\n\"suexec\" and it came up nowhere, had I not done a find on the / directory,\nlooking for the binary, I never would have found the log file in the first place).", "id": 55280, "time": "2004-04-05T05:15:00Z", "creator": "dkap+Apache@haven.org", "creation_time": "2004-04-05T05:15:00Z", "is_private": false}, {"count": 10, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 55325, "time": "2004-04-05T15:28:47Z", "bug_id": 28116, "creation_time": "2004-04-05T15:28:47Z", "is_private": false, "text": "If you read \"disdain\" in my comments, then I apologize.  It was certainly not\nintended.  What I meant to express was confusion.  Several of your comments\nstill have me confused.\n\nThe suggestion of documenting how to turn off suexec in the FAQ is not a bad\none.  We should consider that.\n\nAs far as your number 2), if you look at\nhttp://httpd.apache.org/docs-2.0/suexec.html#usage\nyou'll see that suexec is only called if mod_userdir is involved in the\nrequest (or for certain virtual hosts).  If you use an Alias to map \"~\", then \nyou circumvent mod_userdir and hence suexec plays no part at all.  \nAlthough this may indeed have security implications in some circumstances, \nit would not make sense to deny the request, because there are valid reasons \nfor using an Alias in this way.  This is one of many reasons why suexec should\nonly be used very carefully.\n\nAs far as your other littany of problems, I again suggest that you discuss\nthem on users@httpd.apache.org or, if you wish to help improve the documentation,\ndocs@httpd.apache.org.\n\nFinally, to repeat what I have already said, the real bug here, and the\nreason you had to spend so much time on this, is that Redhat is distributing\npoorly configured software.  They should not be enabling suexec by default.\nThere is nothing we can do about that.  I encourage\nyou to file a bug report with Redhat."}, {"count": 11, "text": "Isn't it possible to avoid this particular failure mode by having mod_userdir\nnot set the mod_userdir_user note if the userdir used doesn't match the chosen\nAP_USERDIR_SUFFIX, since that is doomed to fail the suexec tests?\n\nYes, we know, shipping /usr/sbin/suexec causes problems for some X% of users. \nNot shipping it would cause problems for some Y% of users, and indications so\nfar are that X < Y.", "bug_id": 28116, "is_private": false, "id": 55349, "time": "2004-04-05T20:20:36Z", "creator": "jorton@redhat.com", "creation_time": "2004-04-05T20:20:36Z", "tags": [], "attachment_id": null}, {"count": 12, "tags": [], "creator": "slive@apache.org", "is_private": false, "id": 55351, "attachment_id": null, "bug_id": 28116, "creation_time": "2004-04-05T20:48:28Z", "time": "2004-04-05T20:48:28Z", "text": "I personally don't think it is worth it, because there are at least a half-dozen\nother ways that the suexec security checks could fail.  And some of them\nare probably fairly common.\n\nMy suggestion to Redhat would be to install suexec as \"suexec.notactive\"\n(or even better, install it without suid permissions; but I'm not sure if that\nwould cause problems in 2.0) and then have a comment in httpd.conf\nexplaining how to activate it, how to use \"suexec -V\" to get the configuration,\nand where to find the docs.\n\nBut I guess the discussion of that is not really appropriate for this bug\ndatabase (and if Redhat where to fix this, I'd have one less thing\nto complain about, and *that* would really annoy me).\n\n"}, {"count": 13, "tags": [], "bug_id": 28116, "is_private": false, "text": "I have now added a FAQ entry that points to the CGI tutorial,\nand I have expanded the docs in the tutorial on dealing with\nsuexec.", "id": 55538, "time": "2004-04-08T18:27:09Z", "creator": "slive@apache.org", "creation_time": "2004-04-08T18:27:09Z", "attachment_id": null}]