[{"count": 0, "tags": [], "text": "The directive 'ServerAdmin' today allows you to specify an email address whereto\nproblems with the server should/could be emailed. This address is displayed in\nvarious places, e.g. on server generated pages, such as error documents.\n\nConsidering the widely mis-use of email addresses, collected by harvesting the\ninternet in various ways, for e.g. mass-mailing, spamming, etc, I would like to\nhave the possibility to optionally specify an URL instead of an email address\nthat should be displayed instead. E.g. 'https://somedomain.name/contact',\ninstead of 'contact@somedomain.name', which for example could present a mail\nform that the user could fill in. Thus there would be no need to expose an email\naddress for this purpose. Of course, such an URL should ideally point to another\nserver, because this server might present the errror response page (showing that\n \"serveradmin\" url due to not being able to process such a form. But that\ndecision should of course be left to the administrator to decide on.\n\nI can, almost, achive this already with todays implementation (Apache 2.0.49) by\nspecifying an URL to the 'ServerAdmin' directive, but such an URL will\nautomatically get the 'mailto://' protocol prefix prepended, e.g. in customized\nerror responses.\n\nTherefore I'd like to suggest the following implementation, and thereby\nretaining backward compatibility; whenever a URL is given as the argument to the\n'ServerAdmin' directive the argument should be presented to the user as\nspecified (or at least constitute the 'href' of a link presented to the user, i\nthink it's someting like webmaster, or so today). If the argument is NOT an URL\nthen it should be assumed it's an email address - just as today. In this way one\nis allowed to explicitly specify 'mailto://admin@domain.name', as an alternative\nto the implicit 'admin@domain.name' too (if one would prefere).\n\nThis feature could help to reduce the amount of unsolicited emails sent to the\notherwise exposed email address, and thereby hopefully allow the\nadministrator(?) to focus on the important issues/emails instead of wading\nthrough all the junk. This kind of \"redirection\", instead of using email\naddrsses, is becoming more an more popular for use in SSL server certificates too.\n\nBest Regards,\nRolf Sponsel", "is_private": false, "bug_id": 28174, "id": 55213, "time": "2004-04-03T01:46:10Z", "creator": "Rolf.Sponsel@kstr.lth.se", "creation_time": "2004-04-03T01:46:10Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "slive@apache.org", "is_private": false, "count": 1, "id": 55214, "time": "2004-04-03T04:27:36Z", "bug_id": 28174, "creation_time": "2004-04-03T04:27:36Z", "text": "Hmmm... Why don't you just use ErrorDocument to customize the error\nresponses.  That way you can have whatever you want.\n\nThe ServerAdmin should really be used only as a fallback when all\nelse has failed.  And in that case, giving a URL (especially if it\nis on the same server) could be a big mistake.\n\nBut the real argument here is why add complexity when there is\nalready a way to accomplish what you want?"}, {"attachment_id": null, "tags": [], "creator": "Rolf.Sponsel@kstr.lth.se", "is_private": false, "count": 2, "id": 55221, "time": "2004-04-03T11:49:59Z", "bug_id": 28174, "creation_time": "2004-04-03T11:49:59Z", "text": "That is all fine - as long as - the only place where ServerAdmin is used/shown\non a page is on the customized error pages AND does not use it for anything\nelse, neither now nor in the future.\n\nIf this is NOT the case, IMHO this would be a minor, but useful, modification.\nIt only requires that the argument to 'ServerAdmin' is checked for whether it's\nan URL, i.e. contains a string sequence '://'; otherwise the argument is\nprepended with that same 'mailto://' prefix as today. Not much of complexity it\nseems to me - is there?\n"}, {"count": 3, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "Well, as I mentioned, one point of the ServerAdmin is to have a contact\nif all else fails.  Using a webpage for that sounds like a bad idea.\nie: 500 server error, please see this other page, which also generates\na 500 server error.", "id": 55222, "time": "2004-04-03T17:12:46Z", "bug_id": 28174, "creation_time": "2004-04-03T17:12:46Z", "is_private": false}, {"count": 4, "tags": [], "creator": "Rolf.Sponsel@kstr.lth.se", "text": "What can I say?\n\nI think you need to re-read my initial posting one more time. No offence please!\n\nAs I wrote in my initial posting:\n\n\"... Thus there would be no need to expose an email address for this purpose. Of\ncourse, such an URL should ideally point to another server, because this server\nmight present the errror response page (showing that \"serveradmin\" url due to\nnot being able to process such a form. But that decision should of course be\nleft to the administrator to decide on.\"\n\nI think your \"last post\" doesn't present anything new in addition to what\nalready has been pointed out before - right?\n\nI accepting new ideas and suggestions from others, then fine. Then I don't have\nto waste my time. There are a lot of other software projects that welcome my\ncontributions and ideas.\n\nI have suggested this new feature due to having identified it's usefulness, and\nbecuse it would be useful to me, it might(!?) be useful to others to.\n\n\n\n", "id": 55223, "attachment_id": null, "bug_id": 28174, "creation_time": "2004-04-03T17:31:27Z", "time": "2004-04-03T17:31:27Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 28174, "text": "Calm down a little Rolf.  I thought we were discussing the merits of the\nidea.  If I thought it was a hopeless idea, I would have closed the bug\nreport.\n\nPersonally, I don't see a big benefit from this, and I do think it\nwould be too tempting for people to put a URL on the same server.  But\nsome of the developers may disagree.\n\nOf course, ideas are much likely to be acted upon if they come with\npatches.", "id": 55244, "time": "2004-04-03T22:41:26Z", "creator": "slive@apache.org", "creation_time": "2004-04-03T22:41:26Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "nd@perlig.de", "is_private": false, "count": 6, "id": 55630, "time": "2004-04-10T21:52:43Z", "bug_id": 28174, "creation_time": "2004-04-10T21:52:43Z", "text": "To come to an end: I've the changed the two lines of code ;-)"}, {"attachment_id": null, "tags": [], "creator": "Rolf.Sponsel@kstr.lth.se", "is_private": false, "count": 7, "id": 55632, "time": "2004-04-10T22:32:32Z", "bug_id": 28174, "creation_time": "2004-04-10T22:32:32Z", "text": "I'm happy to see that it didn't require any major changes to accomplish.\nI hope this will be useful to others too.\n\nThank You!\n\nBest Regards,\nRolf Sponsel\n"}]