[{"count": 0, "tags": [], "creator": "purlgurl@purlgurl.net", "attachment_id": null, "id": 55273, "time": "2004-04-05T01:02:59Z", "bug_id": 28193, "creation_time": "2004-04-05T01:02:59Z", "is_private": false, "text": "Webdav exploit comes in as SEARCH request method with an \"URI\" in\nexcess of thirty-thousand bytes. This method is not recognized by\nApache 1.3.x series, thus cannot be \"captured\" for any usage. This\nseries of Apache only recognizes a 414 error; URI too long.\n\nI have discovered through testing and newsgroup discussions, the\nWebdav Exploit cannot be captured by httpd directives, htaccess,\nmod_rewrite, mod_security nor custom access log directives such\nas setting an environment variable to limit log entry length.\n\nOtherwords, Apache 1.3.x series is completely vulnerable to\na Denial Of Service attack employing the Webdav Exploit. My\nlogs show this exploit hitting six times in one second and\ndoes cause Apache to slow down during those hits. A person\ncould change the timing on the C program Webdav Exploit to\nsend hits at such a rate to easily effect a DOS attack on\nApache servers running the 1.3.x series.\n\nThere are no facilities included in Apache 1.3.x to deal\nwith this exploit; Apache processes and responds with a\n414 error before any directives or modules can be employed.\nWith mild modification to the Webdav program, any Apache\nserver running the 1.3.x series could be easily taken down\nwith a Denial Of Service attack using the Webdav exploit.\n\nKira"}, {"count": 1, "tags": [], "text": "I need to add IP Address blocking via directives\ncannot be used to defeat Webdav exploits. There\nis simply no mechanism in Apache 1.3.x to prevent\nthese Webdav exploits. Apache is wide open for\nabuse by Webdav exploits should someone realize\nthere is no known defense mechanism for DOS\nattacks employing this exploit; any byte length\ncan be sent at any timing intervals, and Apache\naccepts it consuming CPU resources and memory\nat an alarming rate. Just a matter of time\nbefore a \"script kiddie\" figures this out.\n\nThanks for taking time to read my bug report,\n\nKira", "attachment_id": null, "id": 55274, "creation_time": "2004-04-05T02:27:37Z", "time": "2004-04-05T02:27:37Z", "creator": "purlgurl@purlgurl.net", "bug_id": 28193, "is_private": false}, {"count": 2, "tags": [], "creator": "slive@apache.org", "text": "I'm not a security expert, but there are two issues I should point out:\n\n1. If there is a security vulnerability here, it should be reported to\nsecurity@apache.org, not the bug database.\n\n2. I don't immediately see any vulnerability.  As this page mentions:\nhttp://httpd.apache.org/security_report.html\nApache cannot do anything about denial of service attacks where attackers\nsimply use a big pipe to blow over the server with content.  You can do\nthis simply by sending thousands of GET requests.  No need for any special\nwebdav exploit.  This would only be a real vulnerability if apache is using\nresources that are not in proportion with the size of the inputs.\n\n(The only potential issue I see here is that an attacker can fill up the logs.\nThis is annoying, but hardly very dangerous.  It could be dealt with using\na piped-logging program that filters out these requests.)\n\nIf, after reading that, you still believe you have found a security hole,\nplease contact the appropriate security report address.\n\nThanks for using Apache!", "id": 55276, "time": "2004-04-05T03:11:38Z", "bug_id": 28193, "creation_time": "2004-04-05T03:11:38Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 28193, "text": "Resolved, invalid?\n\nThis is a bug. This is an inability to hook\ninto selected error conditions. With the\nadvent of Webdav exploits, is critically\nimportant for administrators to capture\nand deal with an error 414 conditon.\n\nApache 1.3.x affords no ability to deal\nwith this exploit. This is a bug. No\nadministrator can deal with this exploit\nunder current software conditions.\n\nYou have dismissed this as \"resolved invalid\"\nin lieu of any discussion, in lieu of any\ncomments coming in from others. It is clear\nby time stamps you spent little, if any time,\nconsidering the ramifications of this bug.\n\nStrikes me your decision is both premature\nand done so without research. You should at\nleast allow a bit of time for other comments\nto come in, to fully assess the impact of\nthis clear bug in Apache 1.3.x series.\n\nPremature dismissal of a bug report, in lieu\nof discussion and comments, defeats the whole\npurpose of bugzilla reporting. I am clearly\ndismayed you dismiss bug reports so lightly.\nDoing so discourages others from reporting\nproblems for which resolution may prove\nhighly beneficial.\n\nIn this case, it is exceedingly clear an ability\nto hook into an error 414 condition is very\ncritical, very needed.\n\nCertainly I will think twice before investing\ntime and effort into reporting an item I believe\nmay benefit our Apache community.\n\nKira", "count": 3, "id": 55278, "time": "2004-04-05T04:40:02Z", "creator": "purlgurl@purlgurl.net", "creation_time": "2004-04-05T04:40:02Z", "is_private": false}, {"count": 4, "tags": [], "text": "The bug report was closed if for no other reason than the bug database is NOT \nthe appropriate place to discuss matters with security implications.  I'm \nclosing it again; we'll discuss this further via the appropriate channels (I \nsee you've already submitted a report to security@apache.org -- that's \ngood.  :-) \n \nThanks, \nCliff ", "attachment_id": null, "id": 55279, "creation_time": "2004-04-05T05:00:09Z", "time": "2004-04-05T05:00:09Z", "creator": "jwoolley@apache.org", "bug_id": 28193, "is_private": false}]