[{"attachment_id": null, "tags": [], "bug_id": 2823, "is_private": false, "count": 0, "id": 4037, "time": "2001-07-26T04:38:31Z", "creator": "vicentesalvador@netscape.net", "creation_time": "2001-07-26T04:38:31Z", "text": "We will like to implement a single session across all Contexts. We've tested we\ncan do this with a Manager but every new Context we must change the server.xml\nfile to add this context with the Manager.\n\nAllowing a Manager configuration inside the DefaultContext will allow us to\nimplement this feature accross all Context wherever they are.\n\nSorry for the spam I've included this text on another bug..."}, {"count": 1, "tags": [], "bug_id": 2823, "attachment_id": null, "text": "You should note that sharing a single session across web applications violates\nthe servlet specification.  It is also going to cause you grief if you are\nloading session attribute classes from within one of the webapps and trying to\naccess it from another -- the underlying classes will not be visible because\neach web app has their own class loader.\n\nIf you care only about having a user sign on once to a set of applications,\ncheck out the \"Single Sign On\" facility.  The user will still have a session per\nweb app, but they will only be challenged for logging on one time, rather than\nonce per app.  See the configuration information on the <Host> element for\ndetails.\n", "id": 4058, "time": "2001-07-26T11:30:42Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-07-26T11:30:42Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 2823, "is_private": false, "count": 2, "id": 19726, "time": "2002-07-17T21:52:08Z", "creator": "vanza@rededc.com.br", "creation_time": "2002-07-17T21:52:08Z", "text": "Anybody looking into this bug? As far as I've tested, it's not resolved...\n\nAllowing a Manager inside a DefaultContext makes it easy, for example, to\ndisable session persistence for a whole set of web applications.\n\nIn a case like we have here (three tomcat servers, lots and lots of applications\nrunning for development), having a Manager inside a DefaultContext would make it\nreally easy to disable session persistence."}, {"count": 3, "tags": [], "bug_id": 2823, "attachment_id": null, "id": 35200, "time": "2003-04-15T15:29:57Z", "creator": "remm@apache.org", "creation_time": "2003-04-15T15:29:57Z", "is_private": false, "text": "This has been implemented."}]