[{"count": 0, "tags": [], "bug_id": 28309, "attachment_id": null, "text": "According to RFC2616, header fields are capitalized first-letter of each word.\n\nA grammar is given for e.g. Content-Length here:\n\n  http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.13\n\nThe RFC states that things are case insensitive unless stated otherwise. \nHowever, not all webservers are equal, and I'm trying to run tests against one \nthat does exact-case matches.\n\nJMeter uses a random mix of capitalization. Sometimes it does as in the RFC, \nsometimes it doesn't.\n\nSpecifically, on POST requests, it uses \"Content-length\" instead of \"Content-\nLength\". This means it's requests are being rejected by the server I'm trying \nto test. All web-browsers appear to use the exact capitalization as listed in \nthe RFC - Mozilla, MSIE, netscape, and even funky ones like Fresco are \nregularly accessing the server without problems.\n\nThe webserver behaviour is not surprising (nor, I think, unique to that \nserver) simply because BNF would normally be case-sensitive, so the \nimplication on reading the RFC is case-sensitivity (and the note on case \nINsensitivity by default is subtly placed in a completely different part of \nthe doc). Infrequent readers of RFCs probably don't notice it.\n\nPS the build I can download today is v2.0.0, but this form only goes up to \n1.9.x. I used whatever latest real release (not nightly build) was available \nyesterday.\n\nPPS all mail sent to this address will automatically be deleted. If anyone \nwants access to this account the password is \"password\". It would be an \nunderstatement to say that I resent being forced to get a password for a \ncompletely pointless protection on a bugzilla account for each of the hundred \nor so open-source/BZ projects I find bugs for. What am I afraid of, that some \nmalicious person will login with my ID and post rude words? Get real.", "id": 55559, "time": "2004-04-09T12:13:29Z", "creator": "adam@tmachine.net", "creation_time": "2004-04-09T12:13:29Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "sebb@apache.org", "is_private": false, "count": 1, "id": 55711, "time": "2004-04-13T17:36:06Z", "bug_id": 28309, "creation_time": "2004-04-13T17:36:06Z", "text": "Changed Content-length and Content-type to -Length and -Type in CVS for HTTP \nrequests.\n\nThese changes should be available in the next release.\n\n[Fixing the broken web-server is another matter...!]\n"}]