[{"count": 0, "tags": [], "text": "The cookie flag with mod_rewrite does not allow you to expire a cookie when the\nbrowser closes if you also need to specify a path.  For example:\n\nRewriteRule (.*)   -   [CO=MyCookie:value::/somepath]\n\nActually results in /somepath being copied into the variable expires in\nmod_rewrite.c:addcookie() and path being set to NULL.  This results in expires\nbeing set to 0, a cookie being generated for the current time/date, and the path\nbeing set to NULL, which seems like a bug.\n\nlikewise, the following line will result in a cookie being set that expires\nimmediately:\n\nRewriteRule (.*)   -   [CO=MyCookie:value:0:/somepath]\n\nI've written a patch that allows 0 or \"::\" to indicate that the cookie is valid\nfor the current session.  The only time I can imagine that a user would want to\nset a cookie to \"now+0\" is if he is trying to expire an existing cookie, and in\nthat case \"now+(-1)\" will work much better, and I believe this is supported by\nspecifying -1 in the CO flag field for the expire time.\n\nBasically, I needed to set a cookie that is for a particular path and is good\nonly while the browser is open.  So my patch checks for the improper\ntokenization of the path into the expires field and moves the path into the\nproper variable and reassigns expires to NULL.  If determines this by testing to\nsee if expires != NULL, atol(expires)==0, path==NULL and !apr_isdigit(*expires).\n The only case this logic could fail is if the path is specified as a number as\nthe first digit, but a cookie path must begin with a / to be well formed.\n\nSee the patch which I will attach. This is against 2.0.49.  I hope that this can\nbe included in a future revision, or the concept of the patch can be accomplished.\n\nThanks,\nByron Guernsey\nGE Consumer & Industrial Products", "attachment_id": null, "id": 55784, "creation_time": "2004-04-14T20:02:35Z", "time": "2004-04-14T20:02:35Z", "creator": "byron.guernsey@ge.com", "bug_id": 28391, "is_private": false}, {"count": 1, "attachment_id": 11239, "bug_id": 28391, "is_private": false, "id": 55785, "time": "2004-04-14T20:03:53Z", "creator": "byron.guernsey@ge.com", "creation_time": "2004-04-14T20:03:53Z", "tags": [], "text": "Created attachment 11239\npatch file generated with diff -u mod_rewrite.c.orig mod_rewrite.c"}, {"count": 2, "tags": [], "text": "Created attachment 12570\nA new simpler patch I've been using", "is_private": false, "id": 62792, "creator": "byron.guernsey@appl.ge.com", "time": "2004-08-30T17:57:23Z", "bug_id": 28391, "creation_time": "2004-08-30T17:57:23Z", "attachment_id": 12570}, {"count": 3, "tags": [], "text": "Sorry this did not get any attention.\n\nIn a separate bug it was noticed that this feature made it into the 2.2 docs. The feature was subsequently added for 2.2.29 and is of course present in later releases already.\n\nPR56014", "attachment_id": null, "bug_id": 28391, "id": 180326, "time": "2015-01-16T20:29:06Z", "creator": "covener@gmail.com", "creation_time": "2015-01-16T20:29:06Z", "is_private": false}]