[{"count": 0, "tags": [], "creator": "wms@igoweb.org", "is_private": false, "id": 55800, "attachment_id": null, "bug_id": 28398, "creation_time": "2004-04-14T22:55:35Z", "time": "2004-04-14T22:55:35Z", "text": "The <propertyfile ...> task lets you manipulate a property file from within an\nant script. Very useful! But all entries you want to add or modify must be in\nthe ant task itself. I have a property file, and based on which type of build, I\nwant to change several of them, but having the changes in smaller property files\nis more convienient than putting them all right in the ant task. For example, I\nmight have \"config.properties\", with a lot of entries, and\n\"config-unitTest.properties\", which has about a dozen entries that must be\nchanged from the main file when doing unit testing.\n\nTo let this happen, I added code to the \"entry\" task, letting you specify a file\nname. If you do, all properties from the file given are pulled into the file\nbeing modified, so for my example above the build file would have:\n\n<propertyfile file=\"config.properties\">\n  <entry file=\"config-unitTest.properties\"/>\n</propertyfile>\n\nI find this very useful, and since I think other people might also, I put\ntogether a diff to make this work.\n\nI tried to keep the coding style as close to the original in my diff, and\nchanged the documentation at the top to describe my changes. I couldn't tell for\nsure if the standard ant docs are built from the javadoc or not, if I need to\nmake changes somewhere else to get these changes put into the docs, please just\nsay so.\n\nMeanwhile, I'll attach the diff file right after submitting this bug. The\nchanges aren't very big."}, {"count": 1, "tags": [], "creator": "wms@igoweb.org", "attachment_id": 11245, "is_private": false, "id": 55801, "time": "2004-04-14T22:56:40Z", "bug_id": 28398, "creation_time": "2004-04-14T22:56:40Z", "text": "Created attachment 11245\npatch file to enhance task as describe in text"}, {"count": 2, "tags": [], "creator": "peterreilly@apache.org", "text": "Sorry for the delay.\nI see that it may be usefull to add this to the propertyfile\ntask, but it may be confusing as the normal ant idiom is to\ndo:\n\n<property file=\"config-unitTest.properties\"/\n<property file=\"config.properties\"/>\n\nso does this enhancment add anything else?", "id": 66640, "attachment_id": null, "bug_id": 28398, "creation_time": "2004-11-09T19:31:29Z", "time": "2004-11-09T19:31:29Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 28398, "text": "*** Bug 29999 has been marked as a duplicate of this bug. ***", "id": 129324, "time": "2009-07-31T05:34:13Z", "creator": "bodewig@apache.org", "creation_time": "2009-07-31T05:34:13Z", "is_private": false, "attachment_id": null}]