[{"count": 0, "attachment_id": null, "bug_id": 28413, "is_private": false, "id": 55837, "time": "2004-04-15T15:58:39Z", "creator": "scottc@somix.com", "creation_time": "2004-04-15T15:58:39Z", "tags": [], "text": "Our company uses Apache web server in our production line of software for our \ncustomers.  We are wanting to rely on the LDAP authentication against Active \nDirectory for authentication to Apache.  However, there are some nasty caching \nbugs in the mod_auth_ldap module, which require frequent restarts of the \nApache server when using the mod_auth_ldap module against Active Directory.  \nThis has been confirmed, even with the latest builds of Apache (2.0.49).  As \nwe would really like to include LDAP authentication in our software release, I \nhave been given the green light to offer apache financial resources to fix the \nmod_auth_ldap module.  Is there someone there I can correspond with to see if \nit is possible to offer Apache money to expedite the repair of the \nmod_auth_ldap module?\n\nThis has been a known issue for some time, as the bug list can attest too.  It \nseems like a simple fix and recompile of the .so binary files.  Can someone \nrespond to this???  Our competitors will have it successfully integrated with \ntheir product, but we won't be able to because of Apache :("}, {"count": 1, "attachment_id": null, "bug_id": 28413, "is_private": false, "id": 56228, "time": "2004-04-22T06:37:58Z", "creator": "apachebug@kepp.net", "creation_time": "2004-04-22T06:37:58Z", "tags": [], "text": "Send over the money, and I'll send you an email back to look at bug 27134 ;)\n\nIt seems like the problem has been fixed in CVS a while ago and that a patch for\n2.0.49 is also available. I haven't tested it myself, but will do so over the\nweekend."}, {"count": 2, "tags": [], "bug_id": 28413, "attachment_id": null, "text": "Thanks.  I'll be interested to see if it's fixed.  I grabbed the \nmod_auth_ldap.so and util_ldap.so files from the 2.0.49 windows build and put \nthem on my box (2.0.45), but still had no luck.  Do you think that would be a \nproblem?  Are there possibly other files I'm missing (to avoid a whole new \ninstall/upgrade)?\n\nScott", "id": 56317, "time": "2004-04-23T19:10:58Z", "creator": "scottc@somix.com", "creation_time": "2004-04-23T19:10:58Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 28413, "is_private": false, "text": "There have been a number of fixes to the v2.1.0-dev code which are awaiting\nbackport to v2.0. You can drop the v2.1.0 ldap module files (mod_ldap and\nmod_auth_ldap) from v2.1.0-dev to v2.0.49, compile the code, and it should work\n(or, to be more accurate, it works for me).\n\nIn the mean time I am going to close this bug as it does not refer to any\nspecific caching bug, just caching problems in general. There are a number of\nother bugs open with regards to caching, please check if they don't refer to any\nof your issues.\n", "id": 57812, "time": "2004-05-21T15:25:00Z", "creator": "minfrin@sharp.fm", "creation_time": "2004-05-21T15:25:00Z", "attachment_id": null}]