[{"count": 0, "text": "Hi there,\nI am using Apache for some time now and it appears to be a very solid base to \nexpose my website!\nBut, in the access-log-file (very valuable!) I see many 'SEARCH' commands with \na lot of 'x90's. These commands are rejected with a 414-error to my relief, but \nthe log-file becomes larger and larger...\nThe first few times I saw the entries, I excluded the IP-addresses in my \nfirewall, but it seemes that a lot of different addresses try to perform the \nSEARCH-command more often, and the IP-addresses are mostly undedicated \naddresses.\n\nMy question is, if this 'problem' is known by you and - of course - what I can \ndo to prevent the log getting too large.\n\nI tried the next entry in httpd.conf:\n<Directory />\n    Options FollowSymLinks MultiViews\n    AllowOverride None\n    <Limit GET POST OPTIONS PROPFIND>\n        Order allow,deny\n        Allow from all\n    </Limit>\n    <LimitExcept GET POST OPTIONS PROPFIND>\n        Order deny,allow\n        Deny from all\n    </LimitExcept>\n</Directory>\n\n, but that does not exclude the SEARCH-command from being used.\n\nLooking forward to your answer,\n\nCees.", "creator": "ceesbo@hotmail.com", "attachment_id": null, "id": 56046, "time": "2004-04-19T21:29:30Z", "bug_id": 28478, "creation_time": "2004-04-19T21:29:30Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "This is a support request, not a bug report, and as such should be directed to a\nuser support forum such as\nhttp://httpd.apache.org/userslist.html\n\nBut to give you a little preview:\n- No, there is no way internally to apache to exclude SEARCH requests from the logs.\n- Doing so isn't, in general, a good idea anyway, since complete logs are a\nwebmasters best friend.  How else are you supposed to tell what is happening to\nyour server?\n- You can limit the size of the log entries using the LimitRequestLine\ndirective, but be sure to keep this long enough to handle the longest\nnormal request you expect to receive.\n- You should be managing the size of your logs by rotating them on a regular\nbasis and you can take out anything you don't want in them at the same time you\nrotate them.\n- The <Limit ...> Deny... directives do indeed exclude SEARCHes, but they\nonly exclude them from accessing the server, not from being logged.\n\nThere is a bug in the manner in which these requests are being logged, but since\nthe bug may have minor security implications, it is being discussed on a private\nmailing list, not in the bug database.", "id": 56052, "time": "2004-04-19T23:35:47Z", "bug_id": 28478, "creation_time": "2004-04-19T23:35:47Z", "is_private": false}]