[{"count": 0, "tags": [], "creator": "thads_id@yahoo.com", "text": "We have the ability for our http requests to retrieve embedded resources such \nas images, javascript files, css's and applets. The problem is that JMeter will \ndownload each resource in a page from the server and doesn't have the ability \nto check if a previous request downloaded the same resource. \n\nWhat I'm proposing is a new config element called HTTP Resource Cache that will \nstore embedded resources the same that a browsers cache will. Each time a \nrequest retrieves an embeddded resource it will check the cache to see if it \nalready has a copy of the resource. If it does it will simply copy or point to \nthe resource in the cache. If it doesn't it will download the resource and \nstore it in the cache.\n\nThis will the user to more accurately simulate a real browser's impact on the \nnetwork and load against an http server.", "id": 56109, "time": "2004-04-20T14:50:51Z", "bug_id": 28502, "creation_time": "2004-04-20T14:50:51Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 28502, "attachment_id": null, "id": 71151, "time": "2005-02-18T04:18:27Z", "creator": "sebb@apache.org", "creation_time": "2005-02-18T04:18:27Z", "is_private": false, "text": "*** Bug 29624 has been marked as a duplicate of this bug. ***"}, {"count": 2, "tags": [], "bug_id": 28502, "attachment_id": null, "text": "This is actually something I thought about a couple of months ago, without\nseeing this bug. Then I saw this bug, and since other people also seems to want\nthis functionality, I might look into making such functionality.\n\nFor my part, this functionality would be useful in two aspects. Mainly, it would\nmean that the sampling when ticking on \"download images\" would be more accurate.\nBut it would also be useful to check that the \"caching headers\" sent by the web\nservers are correct, i.e. to check that clients actually uses the cached version.\n\nMy main concern is how complex and fancy this functionality should be made.\nFirst there is the logic to store the caching headers and information received\nfor each request, so it can be used in subsequent caches. I've written some code\nfor that.\nThen the http samplers need to use the caching information, to send HTTP HEAD\nrequests and so on, to check with the server if the cache is still valid and so\non. I haven't looked into this now.\nFinally, if the test plan contains \"assertions\" that work on the response, it\nmeans that the sample must get the sample response data that was cached.\n\nFor the GUI part, I' thinking about options like \"Max memory size for cache\" and\n\"Max disk size for cache\", to emulate both memory and disk browser cache.\n\nI write this comment now, because I noticed on the mailing list, that the\npriority was changed from P3 to P2, so I see there is some interest at the moment.\nIt would be nice if other people could tell what functionality they need at a\nminimum, and what functionality could be fancy / nice to have.\n\nI think this bug is one of the few remaining \"big items\" for new functionality\nthat is missing in JMeter, with regards to web page testing.", "id": 102036, "time": "2007-04-22T09:38:10Z", "creator": "alf@i100.no", "creation_time": "2007-04-22T09:38:10Z", "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "text": "Browsers may still make requests for cached items, however the requests are \nconditional, i.e. they use If-Modified-Since and If-None-Match qualifiers (see \nhttp://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html).\n\nThe sample result for cached items would in general have a different size and \ndownload time; this would be correct for calculating network and server \nthroughput, but maybe not for other purposes.", "id": 111472, "time": "2007-12-05T17:05:55Z", "bug_id": 28502, "creation_time": "2007-12-05T17:05:55Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 28502, "attachment_id": null, "id": 117156, "time": "2008-05-29T14:29:03Z", "creator": "sebb@apache.org", "creation_time": "2008-05-29T14:29:03Z", "is_private": false, "text": "Added an initial implementation.\n\nURL: http://svn.apache.org/viewvc?rev=661482&view=rev\nLog:\nBug 28502 - HTTP Resource Cache - initial implementation\n\nNeeds work ..."}]