[{"count": 0, "tags": [], "bug_id": 28677, "attachment_id": null, "text": "When using HTML Link Parser, it fails to read form data from a previous https\nprovided web page. I added some more debug to HtmlParsingUtils.java and found\nthat the HTML Link Parser assumed http protocol and thus the match failed\nbecause the config and new protocols were different (config=http and new=https).\nConviently, my test deployment also runs plain http (although we dont do this in\na client situation) and everything works fine for just http.", "id": 56598, "time": "2004-04-29T01:20:13Z", "creator": "craigp@peace.com", "creation_time": "2004-04-29T01:20:13Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 28677, "attachment_id": null, "is_private": false, "id": 56612, "time": "2004-04-29T08:00:33Z", "creator": "jsalvata@atg.com", "creation_time": "2004-04-29T08:00:33Z", "text": "As a workaround, try enabling one of the alternate HTTP parsers -- see the\ncomments in jmeter.properties to find how to."}, {"count": 2, "tags": [], "bug_id": 28677, "attachment_id": null, "text": "I tried to enable JTidyHTMLParser but couldnt seem to influence its behaviour!\nAnyway - I'm not worried about a workaround as much as diagnosing the problem (I\nhave time before I need this fixed).\n\nSo far I have followed the logic through to getProperty in HTTPSamplerBase.java.\nSometimes it is returning the value of variable protocol. Othertimes it is\nreturning DEFAULT_PROTOCOL which is hardcoded to \"http\". Looking that the value\nof propMap - I see a lot of:\n\n\"HTTPSampler.protocol=,\"\n\nI.e. it is not set to anything. There are cases where this is set to https.\nHowever, this is not surprising sice the logic assumes default if the property\nis not found or not set.\n\nI have noticed is that sometimes the protocol is set as:\n\"HTTPSampler.protocol=http,\"\n\nHowever for my last test I am not actually seeing any failures based on protocol\nanymore - they are all getName() based failures - JMeter is adding a session id\nout of scope then failing based on a name match. My HTTP URL Re-writing modifier\nshould not be affecting this branch of the tree as I only need it for the login\nuntil a cookie with the session id is established (isolated branch).\n\nSo unless you have some pointers, I think I need to get back to where there\nwhere protocol mismatch failures and track the setting of HTTPSampler.protocol.\nNone of this code is familiar to me so it is slow going.", "id": 56733, "time": "2004-05-03T05:41:55Z", "creator": "craigp@peace.com", "creation_time": "2004-05-03T05:41:55Z", "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 88665, "time": "2006-04-29T23:45:43Z", "bug_id": 28677, "creation_time": "2006-04-29T23:45:43Z", "is_private": false, "text": "As far as I can see, this is behaving as designed - the new sample has to match\nthe old sample - including the protocol."}]