[{"attachment_id": null, "tags": [], "bug_id": 28731, "is_private": false, "count": 0, "id": 56721, "time": "2004-05-02T18:03:02Z", "creator": "stefan.proels@gmx.de", "creation_time": "2004-05-02T18:03:02Z", "text": "After running under heavy load for awhile our web application crashes because of\nOutOfMemoryErrors. Some research revealed that there is a memory leak in Tomcat\ncaused by clients closing connections prematurely. I.e., when browsers issue\nrequests to Apache/Tomcat and do not read the response completely before closing\ntheir sockets, the Tomcat process grows indefinitely. Because the problem is\ntriggered by the same situation the bug might be related to bug #27534. However,\nwhile 27534 seems to be a JK2 only bug this bug also occurs with JK1. But since\nI cannot reproduce this problem using Tomcat's HTTP Connector (i.e., running\nwithout Apache) it still seems to be related to the JK connector.\n\nHere is how to reproduce the problem. Install the attached JSP in some web\napplication. Modify the attached TestClient to connect to that application, i.e.\nadapt the HOST, PORT and DOCUMENT constant to your setup. Run the TestClient and\nmonitor Tomcat's size (or wait until it crashed with OutOfMemoryErrors).\n\nThe TestClient requests the JSP and extracts the request's URL including the\nsession ID from the first response. Then it requests the JSP again and again\nusing this session ID. I.e, all requests by TestClient belong to a single\nsession to avoid allocating more and more memory for new sessions.\n\nWhen TestClient is modified to read Tomcat's responses completely (see comments)\neverything is fine and the Tomcat process soon reaches a more or less constant\nsize. However, when TestClient closes the connections prematurely without fully\nreading the responses, the Tomcat process will grow indefinitely until it is\nrelieved by OutOfMemoryErrors."}, {"count": 1, "tags": [], "creator": "stefan.proels@gmx.de", "text": "Created attachment 11402\nClient simulating a browser breaking connections", "id": 56722, "time": "2004-05-02T18:04:26Z", "bug_id": 28731, "creation_time": "2004-05-02T18:04:26Z", "is_private": false, "attachment_id": 11402}, {"count": 2, "tags": [], "creator": "stefan.proels@gmx.de", "text": "Created attachment 11403\nJSP requested by TestClient", "id": 56723, "time": "2004-05-02T18:04:48Z", "bug_id": 28731, "creation_time": "2004-05-02T18:04:48Z", "is_private": false, "attachment_id": 11403}, {"count": 3, "tags": [], "creator": "william.barker@wilshire.com", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of 28321 ***", "id": 56726, "time": "2004-05-02T19:57:50Z", "bug_id": 28731, "creation_time": "2004-05-02T19:57:50Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 28731, "is_private": false, "count": 4, "id": 57243, "time": "2004-05-12T00:14:15Z", "creator": "drees76@gmail.com", "creation_time": "2004-05-12T00:14:15Z", "text": "I can confirm that Tomcat used to OOM very quickly under 5.0.19 with the\nprovided test scripts and does not when using 5.0.24."}]