[{"count": 0, "tags": [], "bug_id": 28966, "text": "I have searched the web thoroughly for days now, as well as the bug database,\nand I am convinced this problem isn't posted anywhere.\n\nI have a website that talks to an Oracle database.  The Oracle database stores\nmost strings in UTF-8 format.  Everything works fine when Tomcat is run on\nWin2k, XP, Mac OSX, and Solaris 8, but when I try to run the application on\nLinux, the UTF-8 characters display as if ISO-8859-1 is being used.\n\nI have tried the following fixes:\nadded the charset filter that everyone speaks of to web.xml\nset environment variables such as JAVA_OPTS=-Dfile.encoding=\"UTF-8\", LANG=UTF-8\nand LANG=us_US.UTF-8\n\nEven with these changes, I still get the ISO representation.\n\nAdding <%@ page contentType= \"text/html;charset=UTF-8\" pageEncoding= \"UTF-8\" %>\nto the JSPs forced the encoding in the HTTP headers to UTF-8 (they were by\ndefault ISO_8859-1), but the result was identical.  On all the other platforms,\nthe encoding is already UTF-8 before any of these changes.\n\nNow here is the part that really blows my mind.  If I save the JSP from another\nserver (with correct UTF-8 encoding), and put it on my server as an .html file,\nTomcat serves it up perfectly.  Headers are right, text displays, all is well. \nIf I rename this to a .jsp, once again, the problem returns.\n\nFor this reason I am sure it isnt the DB.  Is there something in Jasper maybe\nthat could be imposing an incorrect charset onto files in Linux?  Once again,\nthis problem only seems to exist on Linux, in both AS 2.4, as well as the newest\nFedora.\n\nThanks!\n\nJohn", "id": 57386, "attachment_id": null, "creator": "johnconstable@aol.com", "creation_time": "2004-05-14T02:29:09Z", "time": "2004-05-14T02:29:09Z", "is_private": false}, {"count": 1, "tags": [], "creator": "yoavs@computer.org", "attachment_id": null, "id": 58346, "time": "2004-05-28T18:12:27Z", "bug_id": 28966, "creation_time": "2004-05-28T18:12:27Z", "is_private": false, "text": "I'm not familiar enough with the relevant code to offer a solution, but I do \nhave a suggestion: send your query to the tomcat-user list and see if others \ncan provide feedback.  If they do, maybe we can narrow this down to a specific \nlocation in the code, and then amend this bug report to include that specific \ninformation."}, {"count": 2, "tags": [], "creator": "yoavs@computer.org", "text": "Have you tried experimenting with the javaEncoding attribute of the JSPServlet \n(or the JspC compiler if you use that)?", "id": 59304, "time": "2004-06-16T14:42:00Z", "bug_id": 28966, "creation_time": "2004-06-16T14:42:00Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "Unless you can provide me with an test case that clearly demonstrates the\nproblem, there's nothing I can do about it.", "attachment_id": null, "id": 59525, "creator": "kin-man.chung@sun.com", "time": "2004-06-18T20:39:45Z", "bug_id": 28966, "creation_time": "2004-06-18T20:39:45Z", "is_private": false}]