[{"count": 0, "tags": [], "creator": "apache@kri.st", "attachment_id": null, "is_private": false, "id": 57632, "time": "2004-05-19T09:11:00Z", "bug_id": 29078, "creation_time": "2004-05-19T09:11:00Z", "text": "I wanted to build mod_jk2 on AIX. The normal build process uses the libtool\ndistributed with apache. This libtool does not work on our system. The reason\nseems to be a bug in libtool, which is triggerd by the fact that we keep apache\nsources, binaries and docroots on different filesystem. \n\nUnder certain circumstances libtool tries to create a lockfile by creating a\nhard link to from itself to the working directory:\n\n    if test \"$need_locks\" = yes; then\n      until $run ln \"$0\" \"$lockfile\" 2>/dev/null; do\n        $show \"Waiting for  $lockfile to be removed\"\n        sleep 2\n      done\n\nln as it is called in libtool does not work across filesystems though. The\nproblem is worsened by the fact that libtool is often called with the --silent\noption, and that ln's output is sent to /dev/null. So the user never gets to\nfind out what is going on...\n\nI replaced the \"ln\" with \"$LN_S\" in libtool, and this allowed me to compile the\nmodule without any problem."}, {"count": 1, "tags": [], "bug_id": 29078, "text": "Another hack is to set need_locks variable to warn.\n\nPlease open a problem report with libtool folks to have that resolved, then \nre-open this PR to let us know when a libtool update is available.  I don't\nthink we want the Apache build to hack up the generated libtool script.\n\nThanks!\n\nBTW, if you set LTFLAGS=' ' the --silent goes away.\n", "id": 57633, "time": "2004-05-19T09:41:47Z", "creator": "trawick@apache.org", "creation_time": "2004-05-19T09:41:47Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 29078, "text": "(info based on private correspondence follows; please don't e-mail me directly)\n\n> If I look at the libtool that comes with the apache source I get the \n> impression this is outdated:\n> \n> $ ./libtool --version\n> ltmain.sh (GNU libtool) 1.4.3 (1.922.2.110 2002/10/23 01:39:54)\n> \n> According to the gnu libtool page the current release is 1.5.6\n\nUse libtool 1.5.6 for your build and see if you have happiness (put that in PATH\nand run ./buildconf prior to ./configure).  If libtool 1.5.6 no longer has the\nproblem, report back on this PR and we can decide what to do next.\n\nIf libtool 1.5.6 still has the lockfile problem, report it to libtool folks.\n\nIf Apache fails to build with libtool 1.5.6, open a problem report to show the\nbuild failures.\n\nTwo top priorities regarding Apache use of libtool:\n\n1) compatibility with as many user-provided libtool versions as practical\n(so if you can't build with libtool 1.5.6 we'll try hard to make it work,\nregardless of which libtool version comes in the tarball)\n\n2) inclusion in release tarball of a version which, overall, causes least user\nproblems\n(occasionally some platform needs a fix in a level of libtool which is known to\nbe broken on other platforms; in such a case, users on the platform needing a\nfix will need to install desired libtool themselves and run buildconf prior to\nconfigure)\n", "id": 57636, "attachment_id": null, "creator": "trawick@apache.org", "creation_time": "2004-05-19T11:31:32Z", "time": "2004-05-19T11:31:32Z", "is_private": false}]