[{"count": 0, "tags": [], "creator": "michael.gesmann@softwareag.com", "is_private": false, "text": "Problem:\nI have an excel input file, generated on a German PC, i.e. the file was written \nwith an ISO-8859-1 encoding. The file properties as well as the content (sheet \nname and cell content) contain German umlaute.\n\nThen I'm reading this file with a java engine with -Dfile.encoding=ISO646-US. \nI'm doing this in a debugger (CodeGuide). When reading the document's \nSummaryInformation with HPFS the returned strings (Java Unicode) contain \"?\" \ninstead of the umlaute. \nWhen reading the sheet name and cell content I see umlaute as expected.\n\nNo examplary output:\nUnfortunately, I can see this only in the debugger. I do not know, how to show \nthis with a short example. If I use the property -Dfile.encoding=ISO-8859-1 \nthen I get the correct result with umlaute. If I use another encoding (in my \ncase ISO646-US), then a System.out.print() converts all Umlaute into \"?\".\n\nSystem environment:\nI have downloaded poi-bin-2.5-final-20040302.zip from http://ftp.uni-\nerlangen.de/pub/mirrors/apache/jakarta/poi/release/bin. \nSo I expect this to be version 2.5 (not in the list above).\nI'm compiling and running everything with jdk 1.4.2_02.\n\nRelevance:\nProblem not only occurs with explict setting of file.encoding property but also \nif file will be read on a maschine with a different default encoding. We are \nonly interested in the Java Unicode String, not in any other output device.\n\nFurther info:\nThe current HPFS sources in CVS contain a class \"VariantSupport.java\" which \nseems to implement codepage support in the SummaryInformation. This source is \nnot contained in the downloaded 2.5 version.\nI can provide an example if needed, I have no idea how to attach it here.\n\nBest regards,\n\n   Michael Gesmann", "id": 57647, "time": "2004-05-19T13:02:50Z", "bug_id": 29086, "creation_time": "2004-05-19T13:02:50Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 29086, "text": "Codepage support is implemented in the CVS HEAD but not in the 2.5 release.", "id": 58570, "time": "2004-06-02T18:09:23Z", "creator": "klute@apache.org", "creation_time": "2004-06-02T18:09:23Z", "is_private": false, "attachment_id": null}]