[{"count": 0, "tags": [], "text": "${empty someSet} will return false if someSet is an instance of java.util.Set, \neven if it is, in fact, empty.  This is because EmptyOperator.java checks for \nan empty Map and an empty List but not an empty Collection.  All that needs to \nbe done is to replace List with Collection, as a List is, of course, a \nCollection.", "attachment_id": null, "id": 57682, "creation_time": "2004-05-20T02:09:01Z", "time": "2004-05-20T02:09:01Z", "creator": "wboyce@panix.com", "bug_id": 29109, "is_private": false}, {"count": 1, "tags": [], "creator": "justyna.horwat@sun.com", "is_private": false, "id": 57724, "attachment_id": null, "bug_id": 29109, "creation_time": "2004-05-20T17:36:17Z", "time": "2004-05-20T17:36:17Z", "text": "Submitted by Michael Santos:\n\n----\nRegarding this bug:\n\nThat's the expected behaviour in JSTL 1.0, according to the spec.\n\nI don't have a bugzilla user and I am not a committer, so, I am unable to\nhelp this user more.\n\nReference:\nhttp://weblogs.java.net/pub/wlg/730\n\nRegards,\nMichael Nascimento Santos\n----\n\nIn your bug report, you didn't specify which version of JSTL you are using.\n\nIf you are using JSTL 1.0 then this is the expected behavior. If you look at section A.3.8 of the JSTL 1.0 \nspecification you will find the empty operator defined as follows:\n\nempty A is evaluated as follows: \n\n■  If A is null, return true, \n■ Otherwise, if A is the empty string, then return true. \n■ Otherwise, if  A isan empty array, then return true. \n■ Otherwise, if A is an empty Map, return true \n■ Otherwise, if A is an empty List, return true, \n■ Otherwise return false.\n\nWith JSTL 1.1 the EL was moved to the JSP 2.0 specification domain. With JSTL 1.1 it is now up to the \ndomain of the JSP container to support the JSP 2.0 EL implementation.\n\nIn JSP 2.0 the empty operator behavior has changed slightly. In JSP 2.0 section JSP.2.3.7, the empty \noperator behaves as follows:\n\n• If A is null, return true, \n• Otherwise, if A is the empty string, then return true. \n• Otherwise, if A is an empty array, then return true. \n• Otherwise, if A is an empty Map, return true, \n• Otherwise, if A is an empty Collection, return true, \n• Otherwise return false.\n\nMoving to JSTL 1.1 and a JSP 2.0 container will address your problem."}]