[{"count": 0, "tags": [], "bug_id": 29193, "attachment_id": null, "id": 58006, "time": "2004-05-25T02:53:57Z", "creator": "fyam@hotmail.com", "creation_time": "2004-05-25T02:53:57Z", "is_private": false, "text": "This promlem occur both JarTask, ZipTask.\nThe time stump of the file stored in the archive will progress for about 2 \nseconds.\nThis problem is generated by strange processing currently embedded at \norg.apache.tools.ant.taskdefs.Zip.\n\nWhat is change of Revision1.90.\n(http://cvs.apache.org/viewcvs.cgi/ant/src/main/org/apache/tools/ant/taskdefs/Zi\np.java?r1=1.89&r2=1.90&diff_format=h)\nBecause of this change, all the time stumps of the file recorded will progress \nfor 2 seconds.\nYou should save the time stump of a file, without changing the original value.\n\nEven if it removes this processing, completely, a time stump may not be saved \nbut may return for 1 second.\nHowever, since it is the problem of JDK, it should not absorb the error by ANT.\n\nReference: last modification date stored in zip files should round up\nhttp://bugs.sun.com/bugdatabase/view_bug.do?bug_id=4046915"}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "text": "The timestamp format of any zip archive has a granularity of two seconds, so you\ncan't store the exact timestamp anyway - this has nothing to do with either Ant\nor Java.\n\nIn Ant we had to decide whether we want to round up (the \"strange processing\") or\ndown.  For most common use-cases, rounding up is the correct choice since Ant would\notherwise consider an archive out-of-date everytime - the contents of the archive\nwould be up to two seconds older than the files that have been used to create\nthe archive.  This choice is documented in the task's manual.\n\nWith Ant 1.6.2 there will be a roundup attribute that lets you explicitly request\nrounding down.\n\n\n*** This bug has been marked as a duplicate of 17934 ***", "id": 58033, "time": "2004-05-25T11:43:49Z", "bug_id": 29193, "creation_time": "2004-05-25T11:43:49Z", "is_private": false}]