[{"count": 0, "tags": [], "creator": "mmarkog@csd.uoc.gr", "attachment_id": null, "id": 58021, "time": "2004-05-25T08:42:42Z", "bug_id": 29198, "creation_time": "2004-05-25T08:42:42Z", "is_private": false, "text": "I’m facing the following problem after installing tomcat5 and after some \nsearching i'm convinced that that's a bug (a small e.g)\n\n<%@ page contentType=\"text/html;charset=windows-1253\"%>\n\n<jsp:include page = \"file.jsp\" />\nHERE I've to define the contentType inside the file.jsp cause the inclusion \noccurs at request time (which is corect)\n\n<%@ include file = \"file2.jsp\" %>\nBUT HERE THE INCLUSION OCCURS AT TRANSLATION TIME SO (NORMALLY) I DON'T HAVE \nTO DEFINE THE contentType INSIDE FILE2.JSP (WRONG????)\n\nSO HERE LAYS THE PROBLEM I HAVE TO DEFINE contentType ALSO IN THE SECOND CASE \nIF I WANT TO HAVE THE TEXT DISPLAYED PROPERLY, SOMETHING THAT I DON'T FIND \nRIGHT AND IT'S NOT TECHNICAL RIGHT(I THINK IS A MATTER OF HOW TOMCAT \nTRANSALTES AND COMPILES JSPs INTO SERVLETS). WHEN I WAS USING TOMCAT 4.x I \nDIDN'T HAVE THIS PROBLEM!\n\nSo i checked the generated srvlets at \"work\" directory! so for the same \ncharacters i get:\n...\n      out.write(\"Γ΅Γ΅Γ΅Γ΅Γ΅Γ΅Γ΅Γ΅Γ΅Γ΅Γ΅\"); \n// LINE FROM:  <%@ include file = \"file2.jsp\" %> (not properly displayed but \n// included at translation time(???)\n      out.write(\"Ξ±Ξ±Ξ±Ξ±Ξ±Ξ±Ξ±Ξ±Ξ±Ξ±Ξ±\");\n// text inside the index file...properly displayed\n...\n\nIT'S WRONG TO DEFINE THE CONTETNTYPE INSIDE ALL THE JSP FILES THAT ARE \nINCLUDED USING INCLUDING AT TRANSALATION TIME (<%@...)\n\nps. all the other definitions, declarations, variables e.t.c are passed \nnormally into files that are included at page translation time!"}, {"count": 1, "tags": [], "text": "According to JSP 2.0 spec:\n\nJSP.4.1 Page Character Encoding\n\nThe page character encoding is the character encoding in which the JSP page or\ntag file itself is encoded. The character encoding is determined for each file\nseparately, even if one file includes another using the include directive\n(Section JSP.1.10.3).\n\nNote that this is not backward comapitble with JSP 1.2, which allows the\nbehavior you expect; but there are lots of problems with that in the past, and\nthe expert group felt that this needed to be clarified.", "is_private": false, "id": 58062, "creator": "kin-man.chung@sun.com", "time": "2004-05-25T16:46:31Z", "bug_id": 29198, "creation_time": "2004-05-25T16:46:31Z", "attachment_id": null}]