[{"count": 0, "tags": [], "bug_id": 29248, "is_private": false, "text": "We have a large source code base (hundreds of components) that are assembled in\n20 or so deployments (J2EE). The whole application builds in several hours on\nthe current machine, but we just got a 4-way machine for the build (we use it to\nbuild lots of C code as well).\n\nAnt does not take advantage of the multiple CPUs like make does.\n\nI have a big ant file that looks like this:\n\n   <target name=\"build.foo\" depends=\"build.bar,build.baz\">\n      <ant dir=\"foo\" target=\"build\"/>\n   </target>\n\nI know ant can execute tasks in parallel, by explicitely marking sections of the\nscript as executable in parallel. But I don't want to go and manually compute\nthe dependencies between 200 components... every time somebody changes\ndependencies. Ant already computes the dependencies, and I would like it to\nexecute multiple independent targets in parallel.\n\nI am willing to help with coding and testing, I just need to know if somebody\nelse has attempted this, or if there is a deep problem in the code that would\nrequire significant refactoring before this is possible. Any pointers would be\nappreciated.\n\nThank you,\nflorin", "id": 58210, "time": "2004-05-27T15:04:55Z", "creator": "florin@iucha.net", "creation_time": "2004-05-27T15:04:55Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "alexeys@inventigo.com", "text": "I am thinking about it too. There is an issue with dependencies that\nneeded to be fixed first - there are two kind of dependencies -\nA depends on B and C, and A wants execute B and then C \n(for example a clean build). Without the second option it would \nbe very difficult to write build scripts that can run in parallel.", "id": 58212, "time": "2004-05-27T15:14:45Z", "bug_id": 29248, "creation_time": "2004-05-27T15:14:45Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 29248, "text": "Why would A specify the order of execution of its dependencies? If B needs to be\nexecuted before C, it needs to depend on C.\n\nOr do you suggest that A wants B then C and D wants C then B? Do you have a real\nworld example?", "id": 58213, "time": "2004-05-27T15:20:28Z", "creator": "florin@iucha.net", "creation_time": "2004-05-27T15:20:28Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 29248, "text": "This is an example:\n\nclean-build: clean,build\n\nYou do not want for build to depend on clean and you do not want for the targets to run in parallel.\n", "id": 58215, "time": "2004-05-27T15:25:21Z", "creator": "alexeys@inventigo.com", "creation_time": "2004-05-27T15:25:21Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "florin@iucha.net", "text": "<target name=\"clean-build\">\n   <sequential>\n      <antcall target=\"clean\"/>\n      <antcall target=\"build\"/>\n   </sequential>\n</target>", "id": 58218, "time": "2004-05-27T15:50:56Z", "bug_id": 29248, "creation_time": "2004-05-27T15:50:56Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 29248, "is_private": false, "text": "... and <antcall> would reexecute all dependencies, even more it would \nreexecute them in parallel. <ant> and <antcall> are evil and completely \nunusable in paralelel builds - they break target dependencies.", "id": 58219, "time": "2004-05-27T15:57:27Z", "creator": "alexeys@inventigo.com", "creation_time": "2004-05-27T15:57:27Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 29248, "attachment_id": null, "is_private": false, "id": 61640, "time": "2004-08-06T17:55:23Z", "creator": "mbenson@apache.org", "creation_time": "2004-08-06T17:55:23Z", "text": "It might be interesting to explore making this another Ant option.  Default \nbehavior would be as always.  Bug 21421 also relates to making Ant execute \ntargets in a manner other than the default; maybe we should turn this into a \nproperty such as ant.runstyle=default|parallel|singlecheck.  I suppose it \ndepends upon whether singlecheck and parallel are compatible modes of \nbehavior.  I can't think that they are incompatible but I have this nagging \nfeeling they could be.  Any opinions on this?"}, {"count": 7, "tags": [], "creator": "alexeys@inventigo.com", "text": "It is actually closer to bug 21144 \"keep-going\". In both situation ANT will have to decide what other targets it can execute.", "id": 61644, "attachment_id": null, "bug_id": 29248, "creation_time": "2004-08-06T20:13:16Z", "time": "2004-08-06T20:13:16Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 29248, "is_private": false, "text": "Hmmm... then maybe keepgoing should stay for BC but become another Target \nexecution mode... that is four different modes already including default.  The \nlist could go on.  Maybe the property should be a classname so that these can \nbecome pluggable.  That would end the discussion.  I'll try to code this up as \nan attachment for public perusal...", "id": 61649, "time": "2004-08-06T20:28:17Z", "creator": "mbenson@apache.org", "creation_time": "2004-08-06T20:28:17Z", "attachment_id": null}, {"count": 9, "tags": [], "creator": "mikehale@gmail.com", "text": "Make uses the -j option for parallel tasks.  From make --help:\n-j [N], --jobs[=N]          Allow N jobs at once; infinite jobs with no arg.\n\nI strongly agree with the first post that ant should be able to decide when\nthings could be run in parallel.  I like the idea of being able to turn\nparallelization on and off at the command line because sometimes I care about\naccurate log output more than I care about speed and sometimes I just want to\nbuild something ASAP.", "id": 68243, "attachment_id": null, "bug_id": 29248, "creation_time": "2004-12-10T16:47:58Z", "time": "2004-12-10T16:47:58Z", "is_private": false}, {"count": 10, "tags": [], "bug_id": 29248, "attachment_id": null, "is_private": false, "id": 68250, "time": "2004-12-10T17:24:17Z", "creator": "mbenson@apache.org", "creation_time": "2004-12-10T17:24:17Z", "text": "How to compute the dependencies for this is an interesting problem that has not\nyet become clear to me.  All that has to be written is a single class; if anyone\nwants to beat me to the punch, feel free."}, {"count": 11, "tags": [], "bug_id": 29248, "text": "It is not the problem of computing the dependencies - that is a solved problem\n:topological sort of the targets, based on target dependencies and dependencies\norder within a \"depends\".\n\nThere are two optimizations that can (and should be implemented):\n   - add a \"depends-without-regard-to-order\" attribute that means the\ndependencies need not be executed in the stated order\n   - add a properties file that records some metric of cost for each target, so\nthe optimizer can achieve better results by solving a static scheduling\noptimization problem (*)\n\n\n------\n\n(*) Example: let's say we have the following targets\n   - A and B take 5 minutes\n   - C and D take 1 minute\n   - no dependencies between them\nIf you know the duration (and by the third build you do) and you comunicate that\nto the scheduler, it might schedule (A || B) then (C || D) and be done in 6\nminutes on a 2-CPU machine, while a naive random scheduler might schedule A on\nCPU0 for 5 min, then C, D and B on CPU1 for 7 total minutes.", "id": 68302, "time": "2004-12-11T03:51:42Z", "creator": "florin@iucha.net", "creation_time": "2004-12-11T03:51:42Z", "is_private": false, "attachment_id": null}, {"count": 12, "tags": [], "creator": "jan@materne.de", "is_private": false, "id": 183443, "attachment_id": null, "bug_id": 29248, "creation_time": "2015-06-10T20:23:28Z", "time": "2015-06-10T20:23:28Z", "text": "I suggest trying the parallel executor from the Ant sandbox.\nhttp://svn.apache.org/viewvc/ant/sandbox/parallelexecutor/"}]