[{"count": 0, "tags": [], "text": "I would like to use JMeter to load test our application with many number of \njava applets. How to use JMeter to load test java applets. How do we pass \nvalues to the fields in the java applet through JMeter during load test.", "is_private": false, "id": 58503, "creator": "sonybals2002@yahoo.com", "time": "2004-06-01T20:55:29Z", "bug_id": 29331, "creation_time": "2004-06-01T20:55:29Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "rodolphe_huguet@yahoo.fr", "is_private": false, "text": "Jmeter 1.9 to 2.01\nI would like to specify that the proxy server (HTTP recording) does not work\nwith an applet : the applet is not launch. It seems that the proxy blocks the\nloading of the applet on the browser.", "id": 60699, "time": "2004-07-16T13:21:39Z", "bug_id": 29331, "creation_time": "2004-07-16T13:21:39Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 29331, "attachment_id": null, "id": 102897, "time": "2007-05-07T05:38:10Z", "creator": "alf@i100.no", "creation_time": "2007-05-07T05:38:10Z", "is_private": false, "text": "(In reply to comment #1)\n> Jmeter 1.9 to 2.01\n> I would like to specify that the proxy server (HTTP recording) does not work\n> with an applet : the applet is not launch. It seems that the proxy blocks the\n> loading of the applet on the browser.\n\nI tested the latest nightly build, and used the HTTP Proxy Server to record the\ntest plan. I ticket the setting \"HTTP Sampler settings - Retrieve All Embedded\nResources from HTML files\" on for the HTTP Proxy Server, so that samples put\ninto the test plan has this setting on.\n I pointed my browser to\nhttp://java.sun.com/applets/jdk/1.4/demo/applets/BarChart/example1.html and the\napplet appeared in the browser.\nIn the test plan, a sample for the example1.html appeared. A sample for the jar\nfile of the applet is not put into the test plan, because I think it's really\njava that is handling the download of that jar file, and not the browser.\nBut since the setting \"Retrieve All Embedded Resources from HTML files\" is on\nfor the \"example1.html\" sample, it means that the jar file for the applet will\nbe download when the test plan is executed.\n\nSo I do not think the HTTP Proxy Server has any problems with applets.\n\nI guess this enhancement request is really to have a \"Java applet sampler\",\nwhere you could specify the content of the \"applet\" tag, and then when the test\nplan is executed, the sampler would instantiate and run the applet. If the\napplet is communcating with a server, then this would make some sense.\n\nIf the applet is just doing processing on the client, then you should rather use\nthe HTTP Sampler, to simulate downloads of the jar files for the applet."}, {"count": 3, "tags": [], "bug_id": 29331, "attachment_id": null, "is_private": false, "id": 151436, "time": "2011-11-12T15:32:07Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-11-12T15:32:07Z", "text": "For local running applet, Load testing is meaning less, Functional test would be provided by Java Sampler \nFor just Applet download , Http Sampler is the solution\nFor Network Communication then it depends on protocol, could be:\n- WS\n- RMI \n- Simple HTTP GET\n\n\nI close issue as meaningless.\nMaybe RMI sampler is the only missing part."}]