[{"count": 0, "tags": [], "text": "This relates to\n   http://issues.apache.org/bugzilla/show_bug.cgi?id=27078\nwhich discusses the classpath inclusion of those libs that\nused to be in optional.jar.\n\nThe error message for 1.6.1 when you try to run, say, junit,\nis not sufficiently informative to make one aware that the bug\nabove applies. I would request that you alter the passage:\n - The task is an Ant optional task and optional.jar is absent\n   Fix: look for optional.jar in ANT_HOME/lib, download if needed\nto describe the current situation\n\nHere is the complete text of my interaction that shows the problem\n(I believe this demonstrates that the problem is with the 1.6.1\nerror message, not with my build.xml). I agree that this is not an\nAnt bug, but it is a documentation bug.\n\n[home]29: ant test\nBuildfile: build.xml\n\ntest:\n\nBUILD FAILED\n/home/rgf/setenv/EDEN-IW/cvs/EDEN-IW/build.xml:141: Could not create task or\ntype of type: junit.\n\nAnt could not find the task or a class this task relies upon.\n\nThis is common and has a number of causes; the usual \nsolutions are to read the manual pages then download and\ninstall needed JAR files, or fix the build file: \n - You have misspelt 'junit'.\n   Fix: check your spelling.\n - The task needs an external JAR file to execute\n   and this is not found at the right place in the classpath.\n   Fix: check the documentation for dependencies.\n   Fix: declare the task.\n - The task is an Ant optional task and optional.jar is absent\n   Fix: look for optional.jar in ANT_HOME/lib, download if needed\n - The task was not built into optional.jar as dependent\n   libraries were not found at build time.\n   Fix: look in the JAR to verify, then rebuild with the needed\n   libraries, or download a release version from apache.org\n - The build file was written for a later version of Ant\n   Fix: upgrade to at least the latest release version of Ant\n - The task is not an Ant core or optional task \n   and needs to be declared using <taskdef>.\n\nRemember that for JAR files to be visible to Ant tasks implemented\nin ANT_HOME/lib, the files must be in the same directory or on the\nclasspath\n\nPlease neither file bug reports on this problem, nor email the\nAnt mailing lists, until all of these causes have been explored,\nas this is not an Ant bug.", "attachment_id": null, "bug_id": 29412, "id": 58819, "time": "2004-06-06T15:35:43Z", "creator": "gfowler@acm.org", "creation_time": "2004-06-06T15:35:43Z", "is_private": false}, {"count": 1, "tags": [], "text": "The error reporting for these cases has been vastly improved in CVS HEAD. \nTask/type classnames are analyzed to determine likeliest culpability; exceptions\nare translated to likeliest error cause.", "attachment_id": null, "id": 75443, "creator": "mbenson@apache.org", "time": "2005-05-26T20:53:51Z", "bug_id": 29412, "creation_time": "2005-05-26T20:53:51Z", "is_private": false}]