[{"count": 0, "text": "Apart from the HTTP Request Defaults not being picked up - neither are the \nauthorizations given in the manager. This makes Jmeter useless for testing my \napplication. \n\nAlso the webservices (SOAP etc) control will not use default authorizations (or \nindeed allow a user/password to be entered in order to retrieve wsdl).", "creator": "simon.beaumont@biowisdom.com", "is_private": false, "id": 58861, "time": "2004-06-08T09:57:59Z", "bug_id": 29436, "creation_time": "2004-06-08T09:57:59Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "text": "I honestly haven't come across a WSDL that required authentication. I will take \na look and see if I can add that in the next few weeks. Changing status to \nenhancement, since the behavior is as designed and isn't a bug. By default most \nwebservices toolkits do not require authentication to read the WSDL.", "attachment_id": null, "id": 58862, "creator": "woolfel@yahoo.com", "time": "2004-06-08T12:37:00Z", "bug_id": 29436, "creation_time": "2004-06-08T12:37:00Z", "is_private": false}, {"count": 2, "tags": [], "text": "I have downloaded the wsdl and made this available as a file URL - \nunfortunately this (prefectly valid since we have been generating axis and .net \nstubs for months) doesn't work... nothing in the logs as to what is going on... \nBTW why are you not using axis for SOAP?\n\n", "attachment_id": null, "id": 58873, "creator": "simon.beaumont@biowisdom.com", "time": "2004-06-08T15:43:11Z", "bug_id": 29436, "creation_time": "2004-06-08T15:43:11Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 29436, "attachment_id": null, "is_private": false, "id": 58881, "time": "2004-06-08T16:19:53Z", "creator": "woolfel@yahoo.com", "creation_time": "2004-06-08T16:19:53Z", "text": "the only reason is when I wrote the sampler originally Axis had not been \nreleased yet. It's on my life of things to do when I get the motivation, since \nAxis is better. the only reason it hasn't changed is purely laziness. The wsdl \nfunctionality is very primitive and isn't a full blown WSDL driver either. that \nis why it can't handle authentication. Again, this is due to my own experience, \nsince most of the webservices stuff I've worked on was either public or \ninternal. which means authentication isn't an issue. thanks for posting the \nbug, I will take a look and see if there's an easy fix temporarily. I may not \nhave time to change it to use Axis, since the API is quite different."}, {"count": 4, "tags": [], "bug_id": 29436, "attachment_id": null, "is_private": false, "id": 58942, "time": "2004-06-09T16:27:30Z", "creator": "woolfel@yahoo.com", "creation_time": "2004-06-09T16:27:30Z", "text": "I pass the AuthManager from the GUI to the WSDLHelper class now. Hopefully it \nwill work. I tested it against IIS and Axis generated WSDL without \nauthentication and the existing functionality is still working. If you're still \nhaving problems, please re-open the bug and attach the exception you're getting."}]