[{"count": 0, "tags": [], "creator": "john.gunnarsson.x@sonyericsson.com", "text": "Ant parses the classpath before running. \nANT cannot handle a space in the classpath. It then throws an exception.\nPersonally I would like to put Ant in \"Program Files\" in order not to clog the \nc: with a lot of folders.\n\nThis took like 2h in order to look in your docs, the java docs, checking all \nother strange installations I recently made in order to run JDTS (a not too \ngood tool from SUN).\nIt would be helpful if this information was added to the documentation if you \nare not going to fix this.\n\nHave a nice day and happy coding!\nJohn Gunnarsson, Sweden", "id": 58923, "time": "2004-06-09T12:18:05Z", "bug_id": 29463, "creation_time": "2004-06-09T12:18:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "stevel@apache.org", "text": "Ant happily works with spaces in classpaths. We have put many years of effort\ninto tuning the startup scripts to deal with spaces in java_home, ant_home, etc,\netc,.\n\n1. did you have a quote in your classpath or something like that? What is your\nCLASSPATH, ANT_HOME, JAVA_HOME, PATH\n\n2. platform? Not windows+cygwin, by any chance?", "id": 58956, "time": "2004-06-09T19:30:54Z", "bug_id": 29463, "creation_time": "2004-06-09T19:30:54Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 29463, "attachment_id": null, "text": "Hi there!\nI managed to get all the things to work yesterday and now I cannot recreate \nthe problem. The text feedback suggested that it was the classpath that was \nthe source of the problem. It gave a part of the classpath in the error text, \nstarting with \" Files\\SomeDir\" for two different entries. Today there is no \nsuch output...\n\nI tried to move Ant back to Program Files and that works fine. This is \nstrange! I must have made some other change too that affected the classpath.\nPerhaps I changed all the / for \\. I know I did that for some of my settings...\nI introduced 5 new environment settings yesterday due to the not so good JDTS.\nThe stupid JTWI package does not accept spaces in its environment variables, \nbut ANT cannot be blamed for that. ****ing SUN programs... Grrr\n\nWell, sorry for the inconveniance. I'll collect more data at the time when I \nhave the problem for you next time.\n\nOh, I did not use cygwin if that still is of any interest.\n\nSincerily\nJohn G", "id": 58995, "time": "2004-06-10T07:33:04Z", "creator": "john.gunnarsson.x@sonyericsson.com", "creation_time": "2004-06-10T07:33:04Z", "is_private": false}, {"count": 3, "tags": [], "creator": "peter.reilly@corvil.com", "text": "As per the update", "id": 58997, "time": "2004-06-10T07:50:13Z", "bug_id": 29463, "creation_time": "2004-06-10T07:50:13Z", "is_private": false, "attachment_id": null}]