[{"count": 0, "tags": [], "bug_id": 29461, "is_private": false, "id": 58921, "creation_time": "2004-06-09T11:06:03Z", "time": "2004-06-09T11:06:03Z", "creator": "lukrez@gmx.at", "text": "I experienced difficulties trying to install the globus toolkit whose build\nsystem heavily relies on shell and perl scripts as well as on make and ant. I\ntried to perform the build under the cygwin environment.\n\nant is several times called with the buildfile option, where the path contains\nan absolute path to the build file, for example\n\n  ant -f $SOME_PATH/build.xml\n\nwhere $SOME_PATH could expand to '/cygdrive/c/some/path' or, if local windows\ndrives are mounted '/c/some/path'. As I inspected the ant wrapper script, the\nhome directories of Ant, Java and the user as well as the local classpath are\nconverted. For the most applications, this will suffice. However, there are more\npossibilities to crash the build with an absolute cygwin-style path:\n\n  * as mentioned the path to the buildfile (-f, -file, -buildfile)\n  * -lib\n  * -logfile, -l\n  * -propertyfile\n  * file paths in properties, for example -Dapp.home=/cygdrive/c/some/path\n\nSimply extending the wrapper script would work, but is this the rihgt approach?", "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "stevel@apache.org", "text": "Cygwin has a special place in our hearts, or at least our bugreps, and the\ninstallation docs: http://ant.apache.org/manual/platform.html\n\nOr, to put it differently: we get a lot more grief from ant on cygwin than you'd\nexpect. Either it is widly popular or wildly troublesome. \n\nIf the fixes can go into java code rather than script, we would probably be\nhappier. If you want to change the script, those changes need testing on many\nplatforms, in environments with spaces in directories, etc, etc,. and it is more\npainful than you'd believe.\n\nTo return to your original problem, building the globus toolkit on windows. Does\nthe GT version you are using build and run on windows? I thought GT2.x was Unix\nonly. GT3.x is deprecated, and GT4.0alpha is fresh and new.\n\nI'd expect GT4 to be more pure ant, at least all the java bits. Are you trying\nto build this one?\n\n-Steve\n\n(posting from the Grid Forum 11 workshop) ", "id": 58961, "time": "2004-06-09T20:22:01Z", "bug_id": 29461, "creation_time": "2004-06-09T20:22:01Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 29461, "attachment_id": null, "id": 59089, "time": "2004-06-11T08:35:55Z", "creator": "lukrez@gmx.at", "creation_time": "2004-06-11T08:35:55Z", "is_private": false, "text": "Well, I am currently working with GT3.2, the deprecated one. I finally managed\nto change the ant wrapper script to convert absolute file paths and made the ant\nbuild scripts work. However, I ran into another build problem when compiling\nsome C/C++ code. I searched the web for a hint or solution and discovered what\nis causing the problem: GT3.2 relies on IPv6 which Cygwin doesn't handle. This\nproblem is slightly harder to fix on the fly, that's why I finally gave up to\nbuild GT3.2 on Cygwin. Anyway, at least, I learned some shell scripting and I'm\nlooking forward to do some experiments with GT4.\n\nI had time to reconsider my position and would like to undo this bug report (or\neven feature request) due to the mentioned problems. The Cygwin support as\nimplemented in the wrapper scripts so far should satisfy all programmers who\nprefer the cygwin shell to the windows cmd.exe.\n\nThe other side is: programmers who intermingle different approaches for building\nan application and make a platform-independent tool platform-dependent should\nprobably rethink the organisation of their applications build process.\n"}, {"count": 3, "tags": [], "bug_id": 29461, "attachment_id": null, "is_private": false, "id": 59108, "time": "2004-06-11T14:38:50Z", "creator": "mbenson@apache.org", "creation_time": "2004-06-11T14:38:50Z", "text": "It would, most likely, quickly become a maintenance nightmare if new cygpath \ncalls had to be added every time a command-line option with a file or path was \nadded.  I think the rule here is that it is the user's responsibility to \nspecify arguments to the \"ant\" script in the convention of the local platform.  \nThe only things the startup scripts should have to deal with are things \ndiscovered from the environment, e.g. CLASSPATH, ANT_HOME (if not preset).\n\nClosing as requested..."}, {"count": 4, "tags": [], "creator": "stevel@apache.org", "text": "Agreed, the people to take this up with are globus. Ideally the pure java GT4\nstuff will work on windows, and if not, well, we will let them know. I may have\nto add them to apache gump, whether they want to or not. \n\nThe problem with the 3.2 toolkit is it has two pieces: the Java side and the\nnative side. I believe the Java code will all build and work cross platform, it\nis the native stuff that wont work. ", "id": 59167, "time": "2004-06-14T00:06:22Z", "bug_id": 29461, "creation_time": "2004-06-14T00:06:22Z", "is_private": false, "attachment_id": null}]