[{"count": 0, "tags": [], "bug_id": 29487, "text": "Looks like the new version broke today.\n(June 9)\nAs soon as I got the new version, the initial display of \na receiver took minutes.\nI am using a simple socket receiver.\nThe second time my app runs, it shows a connection being\nmade, but no logging info ever appears.\n\nnot very useful like this!\n\n-steve", "id": 58978, "time": "2004-06-09T23:48:08Z", "creator": "skearns23@yahoo.com", "creation_time": "2004-06-09T23:48:08Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "Works for me.  I've just used the latest Web start build, tried the Tutorial and \nalso connected to a local app using the SocketHubReceiver by creating it inside \nthe GUI.\n\nCan you provide us with any more information?  Is there anything in the Web \nstart logs area that you might be able to pastet into this bug?\n\ncheers,\n\nPaul Smith", "bug_id": 29487, "is_private": false, "id": 58983, "time": "2004-06-10T00:04:06Z", "creator": "paul.smith@lawlex.com.au", "creation_time": "2004-06-10T00:04:06Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "text": "Had you previously downloaded Chainsaw via CVS and haven't used it in a while?\n\nWe changed the units used in the throttling mechanism, and if you haven't used\nit since we changed (a couple of months ago, and prior to web start version),\nthat would cause this problem.\n\nTry deleting all files in the .chainsaw directory (in your userprofile directory\nor home dir), and let us know if that fixes it.  We save panel and app-wide\npreferences in there.  If you don't want to lose your log panel settings, just\ndelete the chainsaw.settings.properties file.  (on my box it's\nC:\\WINDOWS\\Profiles\\scott\\.chainsaw)\n\nScott", "attachment_id": null, "bug_id": 29487, "id": 58985, "time": "2004-06-10T02:19:32Z", "creator": "sdeboy@iname.com", "creation_time": "2004-06-10T02:19:32Z", "is_private": false}, {"count": 3, "tags": [], "text": "More info:  \n\nThanks for the suggestions, but I tried deleting the .chainsaw directory,\nplus removed from webstart and reinstalled, but the behavior remains\nsimilarly unuseable.\n\nI have been using chainsaw for weeks with the same program;  the problems\nonly began after the new version downloaded.  The program IS compute\nintensive, and my machine is not the fastest available although it is\ndecent (an IBM Thinkpad T21)\n\nFurther, the built in Swing logging viewer and the file appender work\njust as before.\n\nso it really seems as if there is something about this new version that\nmakes it starved for compute or network cycles.\n\n", "is_private": false, "id": 59014, "creator": "skearns23@yahoo.com", "time": "2004-06-10T14:07:58Z", "bug_id": 29487, "creation_time": "2004-06-10T14:07:58Z", "attachment_id": null}, {"count": 4, "text": "The 'responsiveness' slider logic did change for the 'fastest' setting and now performs a yield in between event processing.  \n\nIf you are familiar with CVS, I'd suggest retrieving the logging-log4j module from apache's CVS repository and retrieving based on date (maybe 1 week or 2 weeks ago) and see if you have the same problem.\n\nIf it's resolved in the old version, at least we can verify it's a code change that caused the problem.\n\nFeel free to provide patches if you find the problem.\n\nThanks,\nScott", "bug_id": 29487, "is_private": false, "id": 59029, "time": "2004-06-10T15:27:39Z", "creator": "sdeboy@iname.com", "creation_time": "2004-06-10T15:27:39Z", "tags": [], "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 29487, "attachment_id": null, "id": 68580, "time": "2004-12-15T16:48:42Z", "creator": "yoavs@computer.org", "creation_time": "2004-12-15T16:48:42Z", "is_private": false, "text": "I'm taking the lack of comments since Scott's last message as lack of interest, \nthereby closing this item.  To the OP: if the problem persists, please reopen \nthis issue.  Thanks."}]