[{"count": 0, "tags": [], "bug_id": 29496, "is_private": false, "text": "Overview Description: \nI have found that the server does not always pick up an updated keyfile / \ncertificate when a graceful restart is used. This seems to only occur when one \nor more of the keyfiles used by virtual hosts are password protected. \n\nSteps to Reproduce: \n\nThe scenario I have tested is as follows: \n- an Apache 2.0.40 server on RedHat Linux 9 with several virtual hosts \nconfigured \n- each host has a password protected keyfile using the same password\n- the SSLPassPhraseDialog may be set to builtin or pointing to a script - \neither case results in the same behaviour\n- update the key and certificate for one of the servers - preferably the \ndefault virtual host or the first listed virtual host \n- restart the server using 'apachectl graceful' \n\nActual Results: \nThe server restarts but does not read the new keyfile and does not prompt for \nany keyfile passwords.\n\nIn order to pick up the new keyfile a stop and start must be used\n\nExpected Results: \nThe server should pick up an updated, password protected, keyfile / certificate \non graceful restart as well as for stop and start.\n\nAdditional Notes:\nNote that I have found that this behaviour is not 100% consistent. It seems \nthat multiple virtual hosts are required with at least one of the hosts having \na password protected keyfile. It seems to happen with the greatest frequency \nfor the first vitual host listed in the conf file.\n\nThis does not seem to be a problem if none of the keyfiles are password \nprotected.", "id": 59015, "time": "2004-06-10T14:11:08Z", "creator": "kleclair@magma.ca", "creation_time": "2004-06-10T14:11:08Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 29496, "attachment_id": null, "is_private": false, "id": 59022, "time": "2004-06-10T15:09:00Z", "creator": "jorton@redhat.com", "creation_time": "2004-06-10T15:09:00Z", "text": "Probably bug 21160.  If you have the final httpd update issued for RHL9\n(2.0.40-21.11), you should have the fix for this.\n\n*** This bug has been marked as a duplicate of 21160 ***"}, {"count": 2, "tags": [], "creator": "jwoolley@apache.org", "attachment_id": null, "text": "I don't think this is actually a dupe of that bug.  I'm reopening it, however, \nonly so I can mark it as RESOLVED/WONTFIX.  The reason you cannot pick up a \nchanged encrypted private key by doing a graceful restart is that the process \nof entering the password requires Apache to still be attached to the terminal, \nwhich it is not over the course of a graceful restart.  If you want to change \nprivate keys, do a full stop/start. ", "id": 59048, "time": "2004-06-10T18:37:53Z", "bug_id": 29496, "creation_time": "2004-06-10T18:37:53Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jwoolley@apache.org", "text": "See email thread that follows.  I still say this isn't \"expected\" to work at \nall, but this at least sounds like mildly curious behavior. ", "id": 59057, "time": "2004-06-10T20:55:54Z", "bug_id": 29496, "creation_time": "2004-06-10T20:55:54Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 29496, "attachment_id": null, "id": 59058, "creation_time": "2004-06-10T20:56:17Z", "time": "2004-06-10T20:56:17Z", "creator": "jwoolley@apache.org", "text": "> I'm a little confused about the expected behaviour of a graceful restart. \n> The fact is that a graceful restart often does correctly pick up the new \n> encrypted keyfile and either correctly query for the password or get the \n> password from a script. Why does this work under some circumstances and \nnot \n> others? \n \nI thought you said it always worked if the keyfile was not encrypted but \ndid not work if the keyfile was encrypted.  Is that not the case? \n \nIf it works at all, then it's news to me... back in the mod_ssl for Apache \n1.3 days, it was guaranteed not to work.  :-) \n ", "is_private": false}, {"count": 5, "tags": [], "creator": "jwoolley@apache.org", "text": "From: Kristianne Leclair <kleclair@magma.ca> \nTo: 'Cliff Woolley' <jwoolley@apache.org> \nSubject: RE: [Bug 29496]  -     New keyfile isn't always picked up when \n    graceful restart is used \n \nHi Cliff, \n \nThanks, I'm sorry, if my description was not clear. The behaviour you \ndescribe below is exactly the behaviour I had observed in 1.3 - in fact for \n1.3 I found that you had to stop and start the server to pick up an updated \nkeyfile regardless of whether it was encrypted or not. \n \nWhat I've found for 2.0 is as follows: \n- if all keyfiles on the server are unencrypted a new keyfile is always \npicked up on graceful restart \n- if the server only has a single virtual host - a new encrypted keyfile \nseems to be picked up correctly on graceful restart \n- if the server has multiple virtual hosts with at least one of the servers \nusing an encrypted keyfile, an update to any other keyfile may or may not be \npicked up correctly on graceful restart \n \nIt is this last case that I'd tried to describe in my submission. The thing \nis that this behaviour seems to be slightly unpredictable. For example if \nyou have 3 virtual hosts all with encrypted keyfiles, updating the keyflile \nfor the second host and restarting with graceful may be fine. It seems to \nfail most commonly when the updated keyfile is for the first listed virtual \nhost. I've also found that if you try restarting gracefully multiple times \nit may eventually recognize the change and ask you for the password. \n \nAny insights? \n \nThanks, \n-Kris \n ", "id": 59059, "time": "2004-06-10T20:56:41Z", "bug_id": 29496, "creation_time": "2004-06-10T20:56:41Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 29496, "attachment_id": null, "id": 59067, "creation_time": "2004-06-10T21:50:49Z", "time": "2004-06-10T21:50:49Z", "creator": "jorton@redhat.com", "text": "The behaviour hasn't changed since 1.3: mod_ssl cannot decrypt new or changed\nencrypted private keys on a graceful restart, since it neither caches any\npasswords over restart, nor can prompt for it at restart.  mod_ssl will continue\nusing an unchanged encrypted over a restart, and can load new or changed\nunencrypted private keys too.  That is a WONTFIX bug as Cliff says.\n\nYou describe being prompted for a password during a graceful restart: if that\nhappens, what's really happening is something like:\n\n1) first \"apachectl graceful\" fails due to new private keys and *stops the server*\n2) second \"apachectl graceful\" notices the server is stopped and starts a new\none, prompting for the private keys\n\nSo maybe you want to retest given that fact.  If you do have a server which is\nafflicted with bug 21160, Random Stuff may happen with >1 encrypted private key,\nall bets are off.", "is_private": false}, {"count": 7, "tags": [], "creator": "jorton@redhat.com", "attachment_id": null, "is_private": false, "id": 64037, "time": "2004-09-22T11:39:31Z", "bug_id": 29496, "creation_time": "2004-09-22T11:39:31Z", "text": "Closing presuming the problem was as I outlined above: otherwise, we need a\nreproduction case for a genuine failure."}]