[{"count": 0, "tags": [], "creator": "dev@tomcat.apache.org", "is_private": false, "id": 272, "creation_time": "2000-12-06T14:41:13Z", "time": "2000-12-06T14:41:13Z", "bug_id": 295, "text": "I am running Tomcat on a UNIX-like (LINUX) server and have a practice of having one user ID (softowner) that is the owner of the Tomcat configuration files, class files, and application libraries.  In general any file that doesn't need to be modified by the running application.  I use another ID (dataowner) as the effective user of the running server.  This owns the data files and work files.\r\n\r\nAs Tomcat 3.2 works I can give dataowner write access to webapps/work, I give softowner write access to webapps, webapps/classes, webapps/lib, webapps/htdocs , etc.\r\n\r\nMy problem is that I both softowner and dataowner need write access into the config directory because the program creates config files as the server starts.  but softowner needs write access to work with othe config files.\r\n\r\nI would like to have a way to suppress generation of config files or explicit invokation of the capability.  I also want better seperation between what the running program needs write access to and what it only needs read access to.", "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 295, "is_private": false, "id": 1170, "time": "2001-03-11T12:22:40Z", "creator": "marc.saegesser@apropos.com", "creation_time": "2001-03-11T12:22:40Z", "tags": [], "text": "Sounds like a good idea.  It won't make it into 3.2.2, but we should look at \nthis for 3.3 and later."}, {"count": 2, "tags": [], "creator": "Larry.Isaacs@sas.com", "is_private": false, "id": 1177, "creation_time": "2001-03-11T13:56:59Z", "time": "2001-03-11T13:56:59Z", "bug_id": 295, "text": "In Tomcat 3.3, the generation of the \"config\" files is done by interceptors,\nspecifially ApacheConfig, IISConfig, and NSConfig.  Including or removing these\nfrom server.xml controls whether the corresponding \"config\" file is generated.\nAs of Tomcat 3.3 Milestone 2, none of these are present in server.xml by\ndefault.  Also, none of these write directly into the \"conf\" directory, but to\nthe \"jk\" or \"jserv\" subdirectories of the \"conf\" directory.\n\nFor query purposes, mark as fixed in Tomcat 3.3:\nFixed in Tomcat 3.3", "attachment_id": null}, {"count": 3, "tags": [], "text": "Fixed in 3.3.\n\nIn version 3.3., the generation of config files is enabled/disabled by\nthe presence/absence of the appropriate config interceptor tag element in\nthe server.xml file (i.e <ApacheConfig>, <IISConfig> etc.).  In addition,\nthe ApacheConfig tag now allows you to explicitely specify with attributes\nwhere the config files are generated to.\n", "attachment_id": null, "id": 1250, "creator": "melaquias@yahoo.com", "time": "2001-03-13T08:49:58Z", "bug_id": 295, "creation_time": "2001-03-13T08:49:58Z", "is_private": false}, {"count": 4, "tags": [], "creator": "cmanolache@yahoo.com", "is_private": false, "text": "Fixed in 3.3.", "id": 6292, "time": "2001-10-02T15:51:37Z", "bug_id": 295, "creation_time": "2001-10-02T15:51:37Z", "attachment_id": null}]