[{"count": 0, "tags": [], "creator": "tkl@telenet.ch", "attachment_id": null, "is_private": false, "id": 59195, "time": "2004-06-14T15:11:43Z", "bug_id": 29558, "creation_time": "2004-06-14T15:11:43Z", "text": "I have an internal server running IIS+JK2+Tomcat.\n\nThis server is hosts my cvs repository and viewcvs.\n\nNow if I try to access http://server/viewcvs/viewcvs.cgi/project/WEB-INF/, I get \na \"403 - access forbidden\"."}, {"count": 1, "tags": [], "bug_id": 29558, "text": "I found out that JK2 protects access to all \"WEB-INF\" directories. It is nice \nthat I don't have to remember to protect my WEB-INF directories, but in this \nspecial case I *WANT* access to it and I can't find a way to unprotect it.", "id": 59196, "time": "2004-06-14T15:14:38Z", "creator": "tkl@telenet.ch", "creation_time": "2004-06-14T15:14:38Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 29558, "text": "This is not a bug. This is required by the servlet spec, section 9.5:\n\nA special directory exists within the application hierarchy named \"WEB-INF\".\nThis directory contains all things related to the application that aren't in the\ndocument root of the application. The WEB-INF node is not part of the public\ndocument tree of the application. No file contained in the WEB-INF directory may\nbe served directly to a client by the container. However, the contents of the WEB-\nINF directory are visible to servlet code using the getResource and getResource-\nAsStream method calls on the ServletContext, and may be exposed using the\nRequestDispatcher calls. Hence, if the Application Developer needs access, from\nservlet code, to application specific configuration information that he does not\nwish to be exposed directly to the Web client, he may place it under this directory.\nSince requests are matched to resource mappings in a case-sensitive manner,\nclient requests for `/WEB-INF/foo', `/WEb-iNf/foo', for example, should not result\nin contents of the Web application located under /WEB-INF being returned, .....\n\n\nThanks\n\n-- Jeanfrancois", "id": 59198, "time": "2004-06-14T15:53:26Z", "creator": "jfarcand@apache.org", "creation_time": "2004-06-14T15:53:26Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "tkl@telenet.ch", "is_private": false, "text": "This is correct for WEB-INF directories contained within a web application. It \ndoesn't tell anything about directories outside of web applications!\n\nIn my case I have a CGI-application (running within IIS) for giving access to my \nCVS repository. In this repository is a WEB-INF directory (because I'm \ndeveloping a web application :-). Nothing JK2 SHOULD be concerned about... but \nit does block the access.\n\nNow I understand that it's very convinient not to have to remember to block the \naccess to WEB-INF directories within your web applications, especially if you \nserve static content from IIS directly.\n\nHowever JK2 should have an option to exclude some directories from this check - \nexactly for this case where I as the administrator know what I'm doing.", "id": 59210, "time": "2004-06-15T08:58:56Z", "bug_id": 29558, "creation_time": "2004-06-15T08:58:56Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "funkman@joedog.org", "is_private": false, "text": "As of November 15, 2004, JK2 is no longer supported. All bugs related to JK2 \nwill be marked as WONTFIX. In its place, some of its features have been \nbackported to jk1. Most of those features will be seen in 1.2.7, which is \nslated for release on November 30th, 2004.\n\nAnother alternative is the ajp addition to mod_proxy which will be part of \napache 2.\n\nFor more information on the Tomat connectors docs at\nhttp://jakarta.apache.org/tomcat/connectors-doc/\n\n", "id": 68448, "time": "2004-12-14T01:37:45Z", "bug_id": 29558, "creation_time": "2004-12-14T01:37:45Z", "attachment_id": null}]