[{"count": 0, "tags": [], "bug_id": 2958, "attachment_id": null, "is_private": false, "id": 4225, "time": "2001-08-01T20:13:36Z", "creator": "bradandsteph@home.com", "creation_time": "2001-08-01T20:13:36Z", "text": "Ant is great but to replace make for most \"standard\" build environments, it needs a way to specify any compiler and targets, not just javac/jikes and *.java->class files.  Several of our projects have C modules as well.  A <compile> tag with an attribute for specifying javac or jikes or gcc or bcc would be useful.  Then running ant would build whole systems containing java and C files for quicker deployment without the makefile hassles."}, {"count": 1, "tags": [], "bug_id": 2958, "attachment_id": null, "is_private": false, "id": 4227, "time": "2001-08-01T23:28:45Z", "creator": "steve_l@iseran.com", "creation_time": "2001-08-01T23:28:45Z", "text": "um, ant does more than .java to .class already, such as RMI idl to java and \nother java preprocessors and even {C#,.il asm} to .NET il, . It just happens to \ndo java compilation really well, because that is what most people use it for.\n\nGoing to a generic compile task wouldn't work as each language has their own \noptions : java has its classpath, C++ has its list of directories for includes, \nand they all have different ways of working out dependencies. So you couldn't \nreally do a clean compile facade independent of the underlying language.\n\nWhat you seem to need is a cc, cpp or gcc task, which isn't a 'generalised \nbuild tool' request so much as an 'add C/C++ support' request. If that is the \ncase, the title of this request is incorrect, either it should be renamed or \nmarked as invalid. \n\nAnd if it really is what you want, search the ant-dev archives back in june for \nmessages with 'C/C++' titles in them -there have been a couple of submissions \nof tasks which do exactly that, submissions which C/C++ users such as yourself \ncould help test and flesh out. "}, {"count": 2, "tags": [], "creator": "holtdl@yahoo.com", "attachment_id": null, "text": "There is a <cc> task in development for the ant-contrib Sourceforge project. \nSee: http://sourceforge.net/projects/ant-contrib/", "id": 12587, "time": "2002-03-31T22:41:49Z", "bug_id": 2958, "creation_time": "2002-03-31T22:41:49Z", "is_private": false}]