[{"count": 0, "tags": [], "bug_id": 29583, "text": "Error pages, for example a 403 page to display rejected logins, declared in the \nweb.xml are not submitted to the filters chain. Tomcat seems to create a new \nrequest and invokes the declared resource (servlet or struts action) directly.\n\nIn my case, a filter wraps the request that takes decision depending on the \nrequested URI. When the error-page is invoked, the request URI is not the one \nthe UA is expecting, and any path calculated from it leads the client to fail.\n\nSo, two questions :\n\n1) Is it a normal behaviour not to invoke the filter chain in this case ?\n2) Is it a normal behaviour to ignore the previous request, that already has \npassed by the all needed filters and has been wrapped, and replace it with a \nnew one ?\n\nIf not, is there any fix in a more recent version ?\nThanks for responses.", "id": 59250, "time": "2004-06-15T18:43:13Z", "creator": "ephemeris.lappis@tiscali.fr", "creation_time": "2004-06-15T18:43:13Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "funkman@joedog.org", "attachment_id": null, "text": "Filters are invoked on the incoming request only.\n\nThe 2.4 servlet spec does address nested filters. Tomcat5 implements the 2.4\nservlet spec.", "id": 59251, "time": "2004-06-15T18:58:03Z", "bug_id": 29583, "creation_time": "2004-06-15T18:58:03Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 29583, "is_private": false, "text": "OK for the 2.4 specification and Tomcat 5, for the filters configuration that \n2.3 specification doesn't address.\nBut, why change the initial request and replace it when firing an error page. \nIt's not an explicit call to the request-dispatcher the application does, but, \ni think, from the application point of view, just the continuation of the \ninitial request processing. Changing the initial request removes any chance for \nthe application to interpret what fails in the first invocation : the URI isn't \nthe one the UA invokes, and, as no filter can intercept the event, is seems \nuseless to install specific pages in these cases.\n\nThanks for you first answer, and again for precision...", "id": 59253, "time": "2004-06-15T19:09:12Z", "creator": "ephemeris.lappis@tiscali.fr", "creation_time": "2004-06-15T19:09:12Z", "attachment_id": null}]