[{"count": 0, "tags": [], "text": "Somtimes it is useful to set the selected values for a SELECT tag from values\nother than the request parameters.  Such a selection can be generated and passed\nto the input:select tag through the default attribute, but can be trumped if the\nwrong combo of request parameters are present.\n\nThe following patch adds a boolean ignoreRequest attribute to input:select to\nforce it to use the default value(s).", "is_private": false, "id": 59440, "creator": "rhett@detailedbalance.net", "time": "2004-06-17T21:26:30Z", "bug_id": 29652, "creation_time": "2004-06-17T21:26:30Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "rhett@detailedbalance.net", "text": "Created attachment 11876\nImplement ignoreRequest for input:select", "id": 59441, "time": "2004-06-17T21:28:13Z", "bug_id": 29652, "creation_time": "2004-06-17T21:28:13Z", "is_private": false, "attachment_id": 11876}, {"count": 2, "tags": [], "bug_id": 29652, "text": "This is something that could be useful for all of the tags in the input \nlibrary probably. Is ignoreRequest the best way to achieve it or could we have \nsomething like a \"value\" attribute which behaves like default but cancels the \nbehaviour of looking in a request and in the bean (if provided). What are your \nthoughts?", "id": 59638, "attachment_id": null, "creator": "karl@xk72.com", "creation_time": "2004-06-20T22:29:55Z", "time": "2004-06-20T22:29:55Z", "is_private": false}, {"count": 3, "tags": [], "creator": "rhett@detailedbalance.net", "attachment_id": null, "id": 59890, "time": "2004-06-25T18:44:34Z", "bug_id": 29652, "creation_time": "2004-06-25T18:44:34Z", "is_private": false, "text": "I think it could be useful for any tag that provides behavior besides the\nautomatic fill-in of the value from the request.  Otherwise, you could just use\nthe HTML.  \n\nFor example:  the reason why I use input:select it that it lets me specify the\noptions as a Map and specify which one of them is selected.  input:text, on the\nother hand, doesn't seem to have anything going for it over pure HTML, except\nfor the fact that it will take a value out of the request and use it as its\nvalue.  If you added an ignoreRequest attribute, you might as well have just\ndone <input type=\"text\" ... />.\n\nAlso: It seems to me that if you don't want to use the bean attribute, you could\njust omit it.  However, I haven't used the input taglib that much so I could be\nmissing something."}, {"count": 4, "tags": [], "bug_id": 29652, "is_private": false, "id": 60124, "attachment_id": null, "creator": "karl@xk72.com", "creation_time": "2004-07-04T00:45:32Z", "time": "2004-07-04T00:45:32Z", "text": "It is a useful feature. The text box is still useful even if you don't use the \nrequest as it will perform all of the necessary character escaping etc for \nyour values.\n\nNow all I'm considering is whether to call the attribute ignoreRequest or \nuseRequest - with a default of true. I'm going to have a look at other taglibs \nto see if there's a defacto standard"}, {"count": 5, "tags": [], "bug_id": 29652, "is_private": false, "text": "I have just committed a solution to this. I have added value/selectedValue(s)/checkedValue(s) to all of the \ninput tags. This can be used instead of default(s) to specify an actual value to use rather than a default \nthat can be overridden. I chose \"value\" rather than \"ignoreRequest\" as it is closer to the actual \"value\" \nattribute in the HTML input tag.", "id": 102006, "time": "2007-04-22T01:01:23Z", "creator": "karl@xk72.com", "creation_time": "2007-04-22T01:01:23Z", "attachment_id": null}]