[{"count": 0, "tags": [], "creator": "robert@profundis.se", "attachment_id": null, "text": "The document \"Terms Used to Describe Directives\" gives a generic description of\nwhat a \"regex\" is, but not what syntax is expected. It should say that the PCRE\nlibrary is used, and a link to documentation of it. Eg.\nhttp://www.pcre.org/pcre.txt or to Perl documentation (which might be better).\n\nAdditionally, it might not hurt to have a See Also link to something like\n\"Regular Expressions in Apache\" for applicable directives, because I fear that\nfew people would think of looking in the \"right\" place.", "id": 59709, "time": "2004-06-22T11:49:17Z", "bug_id": 29732, "creation_time": "2004-06-22T11:49:17Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 29732, "attachment_id": null, "id": 59766, "time": "2004-06-23T12:56:42Z", "creator": "ccox@cincom.com", "creation_time": "2004-06-23T12:56:42Z", "is_private": false, "text": "I like the \"See Also\" reference. \n\nAlternatively, we could revise the description for *Match directives in the Core\nFeatures document. For example, we could modify the <LocationMatch> as follows:\n--\nDescription: Applies the enclosed directives only to perl-compatible regular\nexpression matching URL's\n--\n\nI also have a suggestion for the \"Configuration Sections\" document:\n(under \"Wildcards and Regular Expression\")\n--\nIf even more flexible matching is required, each container has a perl-compatible\nregular-expression (regex) counterpart\n--\n\nThis brings the perl-compatible statement to the first occurance of the words\n\"regular expression\", which will make it stand out more. \n\nA link here to the PCRE library would be more obvious than a link to the glossary. "}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "I've fixed the directive-dict to say \"Perl-compatible\" and to reference the\nglossary.  Changing every directive that uses a regular expression would be a\nmajor undertaking.  If you'd like to work on that, please feel free to come over\nto the docs project and help out:\nhttp://httpd.apache.org/docs-project/", "id": 60514, "time": "2004-07-12T18:43:11Z", "bug_id": 29732, "creation_time": "2004-07-12T18:43:11Z", "is_private": false}]