[{"count": 0, "attachment_id": null, "creator": "petr.pisl@sun.com", "text": "Hi,\n\nthere are three places where the encoding for a jsp document can be set. In the\nxml prolog according to XML 1.0 specification, deployment descriptor in the\n<jsp-property-group> and as value of pageEncoding attribute of\n<jsp:directive.page />. When there are defined at least two of them, then they\nhave to be the same.\n\n\nIf there are a jsp document without xml prolog -  for example:\n\n<jsp:root version=\"1.2\" xmlns:f=\"http://java.sun.com/jsf/core\"\nxmlns:h=\"http://java.sun.com/jsf/html\" xmlns:jsp=\"http://java.sun.com/JSP/Page\">\n    <jsp:directive.page contentType=\"text/html\"/> <!-- Shift_JIS -->\n    <jsp:directive.page pageEncoding=\"EUC-JP\"/>\n    .....\n</jsp:root>\n\nthe tomcat says that the encoding is UTF-8, not EUC-JP. Even when there is set\nthe encoding EUC-JP in the deployment descriptor.  If tomcat thinks that the\nencoding is UTF-8 it should report an error according to the JSP specification,\nbecause there is different encoding defined in value of pageEncoding.\n\nRegards Petr", "id": 59785, "time": "2004-06-23T17:16:42Z", "bug_id": 29763, "creation_time": "2004-06-23T17:16:42Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "petr.pisl@sun.com", "attachment_id": null, "id": 59835, "time": "2004-06-24T11:48:53Z", "bug_id": 29763, "creation_time": "2004-06-24T11:48:53Z", "is_private": false, "text": "This issue blocks a issue for jsp editor in the Netbeans IDE.\nhttp://www.netbeans.org/issues/show_bug.cgi?id=43269"}, {"count": 2, "tags": [], "bug_id": 29763, "attachment_id": null, "text": "Fixed so that an error is reported if the page encoding specified in the page\ndirective is different from that specified in, or autodetected from, the XML\nprolog of a JSP document.\n\nFrom your message:\n\n> there are three places where the encoding for a jsp document can be set\n\nNotice that the page encoding of a JSP document is *always* derived from the XML\nprolog, as mandated by the XML specification. It may also be *described* in the\npage directive or page-encoding config element, as long as the values specified\nthere match the value derived from the XML prolog. ", "id": 59851, "time": "2004-06-24T19:04:00Z", "creator": "jan.luehe@sun.com", "creation_time": "2004-06-24T19:04:00Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jan.luehe@sun.com", "attachment_id": null, "id": 59857, "time": "2004-06-25T01:52:54Z", "bug_id": 29763, "creation_time": "2004-06-25T01:52:54Z", "is_private": false, "text": "Hi Petr,\n\nI think I am going to have to revert my patch, and close this issue as \"not a\nbug\" instead.\n\nThe reason you didn't see any error is because your JSP document did not contain\nany XML prolog with an explicit encoding declaration. This is to ensure\nbackwards compatibility with JSP 1.2. Otherwise, JSP documents that used to be\nvalid in JSP 1.2 will no longer work in JSP 2.0, which the expert group decided\nwas unacceptable.\n\nThis is why the JSP 2.0 spec says:\n\n  It is a translation-time error to name different encodings in two\n  or more of the following: the XML prolog /text declaration of a \n  JSP document [...].\n\nIn your example, there was no explicit encoding declaration in the prolog, and\ntherefore you should not expect to see any error.\n\nLet me know what you think.\n\nJan\n\n\n\n\n"}, {"count": 4, "tags": [], "text": "Reverted patch.\n\nWe're supposed to throw an error only if there is an encoding declaration in the\nXML prolog that does not match the page encoding from the page directive or\njsp-config. We must not throw any error if there is no XML prolog or encoding\ndeclaration in the prolog.\n\nThe motivation for this is to make sure that JSP 1.2 pages with a page directive\nspecifying a page encoding other than the default will continue to work in JSP\n2.0 in most cases.\n\nThe code is currently going through lots of pains to determine whether the\nencoding was specified in the XML prolog, or autodetected, to decide whether an\nerror should be thrown. \n", "is_private": false, "id": 59895, "creator": "jan.luehe@sun.com", "time": "2004-06-25T19:08:18Z", "bug_id": 29763, "creation_time": "2004-06-25T19:08:18Z", "attachment_id": null}, {"count": 5, "attachment_id": null, "creator": "petr.pisl@sun.com", "text": "Jan, now I agree with you and thanks for the explanation.", "id": 59979, "time": "2004-06-28T09:42:49Z", "bug_id": 29763, "creation_time": "2004-06-28T09:42:49Z", "tags": [], "is_private": false}]