[{"count": 0, "tags": [], "bug_id": 29769, "attachment_id": null, "id": 59804, "time": "2004-06-23T21:55:15Z", "creator": "draxus@dragonsrealm.com", "creation_time": "2004-06-23T21:55:15Z", "is_private": false, "text": "Using the default configure settings for a compiled from source version of \nApache httpd 2.0.49 on Redhat Linux 6.2, & 9 Platforms\n\nWhen accessing the URL to a user directory that doesn't have a public html \ndirectory or any other directory or file that the user doesn't have permissions \nto get to Apache returns a standard \"403 Forbidden\" Page that also includes the \nerror \"Additionally, a 403 Forbidden error was encountered while trying to use \nan ErrorDocument to handle the request.\"\n\nThis happens with the default 403 Forbidden Page.\n\nWith a custom ErrorDocument 403 is specified in the httpd.conf -\n\nThis Works:\nErrorDocument 403 \"No Access\"\n\nThese Don't Work:\nErrorDocument 403 /error403page.html\nErrorDocument 403 http://www.someothersite.com/error403.html"}, {"count": 1, "tags": [], "bug_id": 29769, "attachment_id": null, "is_private": false, "id": 77918, "time": "2005-08-01T22:24:49Z", "creator": "beecher@columbia.edu", "creation_time": "2005-08-01T22:24:49Z", "text": "We saw this bug when some file servers were offline for maintenance.  When accessing a symlink that \npoints to a not-mounted filesystem Apache 2.0.53 gives the 403 Forbidden error instead of 404 File Not \nFound.  The error log contains \"Symbolic link not allowed\".  The error reporting script could not be \ninvoked because \"a 403 Forbidden error was encountered while trying to use...\"  This is a serious problem \nfor us because we use the error reporting script to inform users that system maintenance is underway.\n\nBug 1: Apache 2 gives 403 Forbidden instead of 404 File Not Found when symlink points to not-mounted \nfilesystem\nBug 2: error logs says \"Symbolic link not allowed\" instead of \"no such file\"\nBug 3: error reporting script can't be invoked due to 403 Forbidden error\n"}, {"count": 2, "tags": [], "bug_id": 29769, "attachment_id": null, "is_private": false, "id": 83114, "time": "2005-12-02T02:54:21Z", "creator": "draxus@dragonsrealm.com", "creation_time": "2005-12-02T02:54:21Z", "text": "This bug seems to have been resolved in the 2.20 version release of Apache httpd."}]