[{"count": 0, "tags": [], "bug_id": 29847, "attachment_id": null, "is_private": false, "id": 60010, "time": "2004-06-28T16:23:21Z", "creator": "martin123456789@hotmail.com", "creation_time": "2004-06-28T16:23:21Z", "text": "Build 2004-05-12... but I checked the most recent code and I think it's still a \nproblem.\n\nI can't seem to use a variable (created using a user Parameter) in the Thread \nGroup's Number of Threads field.  Maybe this was done by design but it was not \nmentioned in the User's manual (I check chapter 3 (or 4; whereever Thread Group \nis described) as well as the reference chapter).\n\nWhen I use a variable the logs state that 0 threads are being started and \nJMeter hangs.\n\nSee the attached test case for an example...  You can replace the variable with \na number and watch the test run fine."}, {"count": 1, "tags": [], "text": "Created attachment 11984\nHere's the test case that duplicates this issue", "attachment_id": 11984, "bug_id": 29847, "id": 60011, "time": "2004-06-28T16:25:38Z", "creator": "martin123456789@hotmail.com", "creation_time": "2004-06-28T16:25:38Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 29847, "attachment_id": null, "id": 60027, "time": "2004-06-28T22:55:50Z", "creator": "sebb@apache.org", "creation_time": "2004-06-28T22:55:50Z", "is_private": false, "text": "User Parameters is a pre-processor, so is only invoked just before a sampler, \nby which time it is too late to affect the Thread Group.\n\nTry putting the variables in the Test Plan instead, or pass them in using a \nproperty - see the JMeter FAQ for some examples.\n\nThe User Parameters variables *are* picked up by the sampler.\n\nIt is a separate (minor) bug that JMeter misbehaves when the loop count is \nzero."}, {"count": 3, "tags": [], "text": "I don't quite understand this behaviour; I use a user-parameter to control the \nLoop Count which is in the thread group node so why can't a user-parameters \ncontrol the thread count which is in the same node?\n\nAlso, note, you mentioned below: \"It is a separate (minor) bug that JMeter \nmisbehaves when the loop count is zero.\"  It's actually the Thread Number, not \nthe Loop Count that went to zero when the parameter was passed in; I just don't \nwant someone looking in the wrong place.", "is_private": false, "bug_id": 29847, "id": 60155, "time": "2004-07-05T13:23:53Z", "creator": "martin123456789@hotmail.com", "creation_time": "2004-07-05T13:23:53Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "I've just tried again, and I agree that the Number of Threads field does not\npick up the value of the variable. The Ramp up field behaves similarly.\n\nBoth of these fields are used _before_ the test threads have been started,\nwhereas the loop count is handled by each thread individually, and this occurs\n_after_ the variables have been set up.\n\nI think it's behaving as designed, even if at first it appears counter-intuitive.\n\nHowever it is a bug that JMeter does not behave well when the _thread_ count is\nset to zero, and, as already mentioned, when the _loop_ count is zero.\n\nOK?", "is_private": false, "bug_id": 29847, "id": 60166, "time": "2004-07-06T01:18:44Z", "creator": "sebb@apache.org", "creation_time": "2004-07-06T01:18:44Z", "attachment_id": null}]