[{"count": 0, "tags": [], "bug_id": 29870, "attachment_id": null, "id": 60066, "time": "2004-06-30T13:44:38Z", "creator": "hanafey@dna.es.dupont.com", "creation_time": "2004-06-30T13:44:38Z", "is_private": false, "text": "<javadoc><link> to sites behind a firewall either require the offline attribute\nand the inconvient local copy of the packagelist, or, if javadoc is invoked\nwith \"-J-DproxyHost=proxy.com -J-DproxyPort=3128\", javadoc will fetch the\npackage list behind the firewall. In some cases it might also be necessary to\nset a noProxyOn list, but I am not clear on the exact syntax.\n\nIt would be nice if the javadoc task would provide a way to configure proxy\nsettings.\n\nAs a workaround, I just renamed the javadoc program, and added a script that\ncalls the renamed javadoc with the added arguments."}, {"count": 1, "tags": [], "text": "You should be able to send in the following to the javadoc task:\n \n           additionalparam=\"-J-DproxyHost=myproxyhost.com -J-DproxyPort=8080\"\n \nSeems to be working for me...\n", "is_private": false, "bug_id": 29870, "id": 60847, "time": "2004-07-20T03:42:14Z", "creator": "ray.roberts@lmco.com", "creation_time": "2004-07-20T03:42:14Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Adding the 'additionalparam' attribute to the javadoc task works, but this means\nthe build file must be modified. The upgrade would be a scheme where the\nsetting was made external to the build file, given that the setting depends on\na particular environment.", "is_private": false, "id": 61772, "creator": "hanafey@dna.es.dupont.com", "time": "2004-08-10T19:16:24Z", "bug_id": 29870, "creation_time": "2004-08-10T19:16:24Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "1. if javadoc runs in then ant process the <setproxy> task will do the work for \nyou. \n\n2. somehow, the build file is going to need to be modified. ", "is_private": false, "bug_id": 29870, "id": 61800, "time": "2004-08-11T09:07:42Z", "creator": "stevel@apache.org", "creation_time": "2004-08-11T09:07:42Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 29870, "text": "I have a similar situation.\n\nI would like to specify the socksProxyHost and socksProxyPort for the javadoc\ncommand, and I can do so with the nested\n<arg value=\"-J-DsocksProxyHost=myhost.com\" /> \nand \n<arg value=\"-J-DsocksProxyHost=8080\" />\n\nbut this requires me putting my proxy information in my build file. This means\nmy build will not work on machines that do not require a proxy configuration.\n\nThe best I can do right now is to do something like suggested in comment #1:\nadditionalparam=\"-J-DproxyHost=myproxyhost.com -J-DproxyPort=8080\"\nand specifying the additional parameters as a property:\nadditionalparam=\"${additionalparam}\"\nbut that doesn't really seem like the best solution. I would think ant should\ntake the arguments to the ant jvm and pass them through javadoc, prefixed by -J?", "id": 80710, "time": "2005-10-03T19:29:42Z", "creator": "ssauci1@umbc.edu", "creation_time": "2005-10-03T19:29:42Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "text": "(In reply to comment #4)\n> ... I would think ant should\n> take the arguments to the ant jvm and pass them through javadoc, prefixed \nby -J?\n\n:| why would you think that?  Ant should do anything within reason, but I \ndon't find the above desirable.", "is_private": false, "bug_id": 29870, "id": 80718, "time": "2005-10-03T21:52:01Z", "creator": "mbenson@apache.org", "creation_time": "2005-10-03T21:52:01Z", "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 29870, "is_private": false, "id": 80943, "time": "2005-10-10T11:27:18Z", "creator": "stevel@apache.org", "creation_time": "2005-10-10T11:27:18Z", "tags": [], "text": "If you use java1.5, set javadoc the JVM arg \njava.net.useSystemProxies=true\n\nand have the JVM work it out for itself..."}, {"count": 7, "attachment_id": 19828, "bug_id": 29870, "is_private": false, "id": 101098, "time": "2007-03-28T06:12:32Z", "creator": "thomas.kappen@tecon-group.com", "creation_time": "2007-03-28T06:12:32Z", "tags": [], "text": "Created attachment 19828\npass proxy settings to javadoc tool\n\nHi there,\n\nthe attached patch passes proxy settings to the javadoc commandline tool, which\nwill be called from the <javadoc> ant task.\n\nProxy settings are necessary if external javadoc resources should be linked\nwith the generated javadoc, and the host resides behind a firewall.\n\nThe proxy settings from the system properties must be explicitly passed to the\njavadoc commandline tool, since the tool cannot be run inside the same jvm as\nant, and therefore a new jvm will be created for javadoc (refer to:\nhttp://ant.apache.org/manual/index.html)\n\nHi hope this patch will be merged into the Ant source tree.\n\nWhat do you think?\n\nCheers,\nThomas"}, {"count": 8, "tags": [], "bug_id": 29870, "is_private": false, "id": 101103, "attachment_id": null, "creator": "ddevienne@gmail.com", "creation_time": "2007-03-28T06:32:37Z", "time": "2007-03-28T06:32:37Z", "text": "I think your build would be faster if you used linkoffline instead of link, and\nyou wouldn't need proxy settings because then it doesn't need to \"dial out\". --DD"}, {"count": 9, "tags": [], "bug_id": 29870, "attachment_id": null, "id": 101104, "time": "2007-03-28T06:54:14Z", "creator": "thomas.kappen@tecon-group.com", "creation_time": "2007-03-28T06:54:14Z", "is_private": false, "text": "In deed, the build would be faster, but speed is not my intention.\n\nThis issue raised to me as I tried to build an open source project, which uses\nlink options to link against some external javadoc sites, like J2SE and JUnit.\nThe build failed, because I am behind the firewall, and I have to use a proxy.\n\nSince I wont build the software not very often, and I don't like to modify the\nbuild script, and I don't like to download each external javadoc site to my\nlocation, I think it makes sense to enable proxy settings for the javadoc task.\n\nThe patch is not a big thing, and gives in general more flexibility to\ndevelopers. Therefore, I would say proxy is a useful feature for the javadoc task."}, {"count": 10, "tags": [], "text": "Sure. I don't disagree with you. But in practice, you work around the issue\nusing linkoffline. And if you want to avoid downloading the packageList\nyourself, you can use <get> beforehand, which could then cache the packageList\nlocally and only download it if missing or changed. But you could also create\nthe packageList yourself, because you know which packages from 3rd parties you\nare using. The packageList doesn't need to be exhaustive, as long as it contains\nwhat you use.\n\nThese are all practical work-arounds to your issue ;-) --DD", "attachment_id": null, "bug_id": 29870, "id": 101108, "time": "2007-03-28T07:43:09Z", "creator": "ddevienne@gmail.com", "creation_time": "2007-03-28T07:43:09Z", "is_private": false}, {"count": 11, "tags": [], "text": "For all these workarounds I have to modify the scripts of the mentioned open\nsource software. But I would like to build the software 'out of the box',\nwithout modifying any scripts, or to patch Ant myself. I think this is a\nstraight forward approach.\nFurther, for an occasional build, implementing a workaround means more effort\nfor inexperienced developers, than waiting for the downloads of javadoc.\nAdditionally, if a developer takes Ant as a black box, and he has set the proxy\nwith Java system properties or the <setptoxy> task, he expects that each task\nwill use the proxy settings, isn't he?\n\nAre there any arguments against a patch? Is it too much effort for you or the\nAnt team? Do you see risks or side effects?\n\nWe are talking about an additional feature. Nobody HAS to use it. Everybody has\nthe choice to improve the script for performance or usability.\n", "attachment_id": null, "id": 101144, "creator": "thomas.kappen@tecon-group.com", "time": "2007-03-29T00:45:31Z", "bug_id": 29870, "creation_time": "2007-03-29T00:45:31Z", "is_private": false}, {"count": 12, "tags": [], "bug_id": 29870, "is_private": false, "id": 101145, "attachment_id": null, "creator": "stevel@apache.org", "creation_time": "2007-03-29T02:22:47Z", "time": "2007-03-29T02:22:47Z", "text": "I am in favour of a patch, and will put one in, though subtly different\n\n-there's a lot of duplication in the getProperty(\"http.Something\"), check for\nnull and set in the other system. I think we could do the same with a\npropertySet passing http.* https.* and socks.* down. \n\n-I'd like the code to be general to all exe/java code, or maybe placed in some\nProxyHelper class that helps with proxy setup. The problem is broader than just\njavadoc."}]