[{"count": 0, "tags": [], "bug_id": 29922, "attachment_id": null, "text": "I used a project like the one in this -\nhttp://www.mycgiserver.com/~gpiancastelli/blog/archives/000068.html - blog entry\nto create a DTD for Ant 1.6.\n\nThe generated DTD does not include the junit task or the file attribute for the\nmanifest task. The Ant documentation says anstructure does not build a complete\nDTD, but that documentation discusses tasks defined with other Ant tasks, I'm\nnot sure the junit task falls into this category.\n\nThe documentation for antstructure isn't clear about whether elements are\ndefined for optional tasks. I assume that tasks on the classpath are included in\nthe DTD - and this seems to be the case as other optional tasks appear in my DTD.\n\nAll of the above, and discussions with colleagues, leads me to think that\nantstructure is incorrectly failing to include the junit task in the DTD it\ngenerates.", "id": 60164, "time": "2004-07-05T22:52:22Z", "creator": "walter.rumsby@orion.co.nz", "creation_time": "2004-07-05T22:52:22Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 29922, "attachment_id": null, "id": 60179, "time": "2004-07-06T08:10:38Z", "creator": "peter.reilly@corvil.com", "creation_time": "2004-07-06T08:10:38Z", "is_private": false, "text": "To generate the junit element - or any other optional task, you need to have\nthe necessary jars installed for the task - i.e. you need to be able to use\njunit in your build script.\n\nAs regards the manifest task not having the correct attributes. This is due\nto the fact that the manifest element is used in the \"war\" task as a nested\nelement. The code does the war task first (due to the order being defined by\na hash code and not alphanumeric), this contains a manifest element. When the\nmanifest task needs to be output, the antstructure task sees that a manifest\nelement has already been defined and it cannot output the definition of the\nmanifest task. This is (I think) due to the inability of the DTD language to\nspecify different definitions for the same element name. One would need to\nuse XML-SCHEMA or RELAX for this."}, {"count": 2, "tags": [], "creator": "walter.rumsby@orion.co.nz", "attachment_id": null, "text": "From what I can tell I do have junit on my classpath. I'm running Ant from\nwithin Eclipse 3.0 and in the Ant Runtime/Classpath options listed under Ant\nHome I can see eclipse/plugins/org.apache_ant1.6.1/lib/ant-junit.jar.", "id": 60212, "time": "2004-07-06T20:54:01Z", "bug_id": 29922, "creation_time": "2004-07-06T20:54:01Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 29922, "attachment_id": null, "id": 60220, "time": "2004-07-07T07:58:26Z", "creator": "peterreilly@apache.org", "creation_time": "2004-07-07T07:58:26Z", "is_private": false, "text": "ant-junit.jar is not enough. This contains the\njunit task but not junit.jar. The junit jar needs to\nbe loaded by the same classloader that loaded ant -\nsee: http://ant.apache.org/faq.html#delegating-classloader\n\na quick google on junit ant eclipse dug up this page:\nhttp://raibledesigns.com/wiki/Wiki.jsp?page=AppFuseEclipse\nI do not know if this will work for eclipse 3.0 and ant 1.6.\n\nThe issue about the manifest task is documented in:\nhttp://ant.apache.org/faq.html#dtd\n\nso I will close his bug as WONTFIX as it is impossible\nto express ant tasks correctly in DTD\n\n"}]