[{"count": 0, "tags": [], "text": "When a path is passed to JavaC (or Jikes) which contains a space (valid in \nWindows) Java just quits (stops the command line entry at the space). This is a \nproblem when a third party application that is using ant to build class files is \ninstalled in the default Windows programs directory (Program Files). \n\nWe are passing only relative paths (relative to the installation directory)to \nall the ant batch files to avoid this problem as much as possible, but ant is \ngoing back to the root of the drive and creating a path that includes c:\\Program \nFiles\\ etc.... \n\nYou either need to put this directory passed to Java into quotes or stop \nappending the directory path back to the root.\n\nRight now we have to make people who use our installer not use the default \nlocation for windows program files or everything messes up. \n\nYou may let us know where in the code this is happening and we will be happy to \nfix it and test it.\n\nThanks.", "is_private": false, "id": 4282, "creator": "ecooper@ergotech.com", "time": "2001-08-05T10:17:34Z", "bug_id": 2993, "creation_time": "2001-08-05T10:17:34Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 2993, "attachment_id": null, "is_private": false, "id": 5005, "time": "2001-08-29T06:18:48Z", "creator": "conor@apache.org", "creation_time": "2001-08-29T06:18:48Z", "text": "Works for me. I did a build (with latest code) from a directory with spaces \ninto a directory with spaces. Here is the -verbose trace\n\ntest:\n    [mkdir] Created dir: F:\\antdev\\bugs\\bug2993\\dest dir\n    [javac] Test.java added as F:\\antdev\\bugs\\bug2993\\dest dir\\Test.class \ndoesn't exist.\n    [javac] Compiling 1 source file to F:\\antdev\\bugs\\bug2993\\dest dir\n    [javac] Using modern compiler\n    [javac] Compilation args: -d \"F:\\antdev\\bugs\\bug2993\\dest dir\" -\nclasspath \"F:\\antdev\\bugs\\bug2993\\dest dir;F:\\jdk1.3\n\\lib\\tools.jar;F:\\Software\\Ant\\lib\\optional.jar;F:\\Software\\Ant\\lib\\jaxp.jar;F:\\\nSoftware\\Ant\\lib\\crimson.jar;F:\\Software\\Ant\\lib\\ant.jar\" -\nsourcepath \"F:\\antdev\\bugs\\bug2993\\src dir\" -g:none\n    [javac] File to be compiled:\n    F:\\antdev\\bugs\\bug2993\\src dir\\Test.java\n\nBUILD SUCCESSFUL\n\nCan you show me a verbose trace where it fails? May be an issue which has \nalready been fixed?"}]