[{"count": 0, "tags": [], "bug_id": 29975, "text": "when I configure a web application with the user data constraint set to \nconfidential, so that tomcat enforces HTTPS access and then try to download a \nPDF document using InternetExplorer, the document cannot be displayed due to a \nbug within IE. The above URL describes the bug but tells that it is \"by design\" \n(as all Microsoft bugs are ;) ).\n\nThe problem occurs because tomcat adds the following two HTTP headers, if and \nonly if a webapp has a user-data constraint of confidential:\n\nPragma: no-cache\nCache-control: no-cache,max-age=0,must-revalidate\n\nI need to secure my web application and I need to workaround this IE bug on the \nserver side. Tomcat 4.x does not cause the problem, but tomcat5.x does.\n\nIt is not a safe solution to remove the respective http headers within a filter \nbecause the filter would have to do this after the filterchain invocation and \nthe outputstream could already have been committed at that time.\n\nAnother way would be to add a filter which tests whether a request is HTTP and \nthen manually redirects to HTTPS and then dropping the user-data-constraint \nfrom the web-descriptor.\n\nSince nearly all IE browsers have this bug, this means that unless tomcat \nprovides a workaround solution for this, developers will not be able to \nfacilitate the standard way specifying security constraints.\n\nAny ideas for a short-time workaround that I could apply would be very welcome \nsince I need to get this fixed quickly...\n\nThanks", "id": 60300, "time": "2004-07-08T13:21:08Z", "creator": "wtff@freenet.de", "creation_time": "2004-07-08T13:21:08Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 29975, "text": "\n\n*** This bug has been marked as a duplicate of 27122 ***", "id": 60319, "time": "2004-07-08T19:42:42Z", "creator": "william.barker@wilshire.com", "creation_time": "2004-07-08T19:42:42Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 29975, "text": "Well, correct me if I'm wrong, but don't the Tomcat developers behave exactly \nas Microsoft in this case? Both parties insist on being right and expect the \nother side to change their code. Not very helpful for the rest of us. Why isn't \nit possible to make the described caching behaviour a configurable option in \nTomcat?", "id": 64049, "time": "2004-09-22T14:30:46Z", "creator": "juergen.ebert@web.de", "creation_time": "2004-09-22T14:30:46Z", "is_private": false, "attachment_id": null}]