[{"count": 0, "tags": [], "bug_id": 30012, "attachment_id": null, "is_private": false, "id": 60384, "time": "2004-07-09T20:04:00Z", "creator": "orders@nodivisions.com", "creation_time": "2004-07-09T20:04:00Z", "text": "http://jeannie.dyndns.org:2155/photos/test/thumbs/\n\nThat page is a directory listing, and the last (bottom) file in the directory is\nDSC00475.JPG.  But the output just stops, and it doesn't get anywhere close to\nthat last file (one of ~200 in that directory).  When it's done it should also\ndisplay the apache server signature at the bottom, because I have that enabled,\nand it shows up on other pages.\n\nIn case it's intermittent, here are two more URLs where it's happening\nconsistently now, along with the last filename that should be displayed:\n\nhttp://jeannie.dyndns.org:2155/photos/2002-09-15-Tashas-Bridal-Shower/thumbs/\nDvc00135.jpg\nhttp://jeannie.dyndns.org:2155/photos/2002-10-25-Wedding-Rehearsal-Dinner/thumbs/\nDVC00217.JPG\n\nThis was happening with 2.0.47, so I upgraded to 2.0.50, and it still happens. \nAnd it's not limited to directory listings; it's happened with actual static\nHTML files too."}, {"count": 1, "tags": [], "bug_id": 30012, "attachment_id": null, "id": 60386, "time": "2004-07-09T20:24:53Z", "creator": "chip@force-elite.com", "creation_time": "2004-07-09T20:24:53Z", "is_private": false, "text": "This is a known issue, Please add these to your configuration file:\nEnableSendfile Off\nEnableMMAP Off\nWin32DisableAcceptex\n\n"}, {"count": 2, "tags": [], "creator": "orders@nodivisions.com", "attachment_id": null, "is_private": false, "id": 60387, "time": "2004-07-09T20:40:38Z", "bug_id": 30012, "creation_time": "2004-07-09T20:40:38Z", "text": "OK, tried that, didn't work.  I added them to the bottom of httpd.conf and\nrestarted apache, but it didn't help.  I then tried putting them at the top of\nhttpd.conf in the Global Environment section, and restarted apache, but that\ndidn't fix it either.\n"}, {"count": 3, "tags": [], "text": "Check for those directives being overridden elsewhere in your config.\n\nThese problems seem to arise when something on windows (typically a security \nproduct - eg zonealarm) screws up the networking (what's the betting windows \nupdate causes it to happen for all windows boxes sometime)?  Shouldn't we ship with \nEnableSendfile at least off by default to stop it catching users?\n", "attachment_id": null, "bug_id": 30012, "id": 60403, "time": "2004-07-10T08:25:31Z", "creator": "nick@webthing.com", "creation_time": "2004-07-10T08:25:31Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 30012, "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of 28530 ***", "id": 60413, "time": "2004-07-10T23:13:11Z", "creator": "chip@force-elite.com", "creation_time": "2004-07-10T23:13:11Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 30012, "attachment_id": null, "is_private": false, "id": 60520, "time": "2004-07-12T22:35:53Z", "creator": "orders@nodivisions.com", "creation_time": "2004-07-12T22:35:53Z", "text": "None of those directives appear elsewhere in my config.\n\nAnd I don't necessarily think this is a duplicate of bug 28530, since that bug\nmentions errorlog messages which I don't have, and since that bug says that\nimages/pages sometimes never load, but I always get at least partial/corrupt output.\n\nI am now getting corrupted images too, since I added those 3 directives which\nwere supposed to fix the truncated output.  So my bug is probably at least\nrelated to that other one.  But it's not exactly the same."}, {"count": 6, "tags": [], "creator": "mail@christian-bieser.net", "attachment_id": null, "is_private": false, "id": 60555, "time": "2004-07-13T16:47:09Z", "bug_id": 30012, "creation_time": "2004-07-13T16:47:09Z", "text": "*** Bug 30078 has been marked as a duplicate of this bug. ***"}, {"count": 7, "attachment_id": null, "creator": "SpamUs@shaw.ca", "is_private": false, "id": 60607, "time": "2004-07-14T17:34:45Z", "bug_id": 30012, "creation_time": "2004-07-14T17:34:45Z", "tags": [], "text": "I'm getting the same problem with my static photo gallery as well, running\nApache2 2.0.48 under Mandrake 10.0.  Sendfile and MMAP are both disabled.  \n\nMozilla/Firebird browsers are extremely problematic, I've yet to see this occur\nusing IE6.  During testing I've found I can force the problem by quickly\nscrolling through the slide html pages before the images fully load which will\ncause many of them to be corrupt on the next run through.  Hammering on a\nnavigation link will cause html source to be displayed rather than rendered.  I\ncannot duplicate this on other websites.\n\nI don't believe its windows specific as I get these results on both my Win2000 &\nLinux systems, using Mozilla 1.7(Linux), Mozilla 1.4(W32), Firefox\n0.8(W32/Linux) and Firefox 0.9(W32).\n\nIt also seems that it's become less problematic after I disabled the magic file.\nAlso, there's nothing in the logs to indicate any type of error."}, {"count": 8, "tags": [], "creator": "geert@debeerst.be", "attachment_id": null, "id": 61443, "time": "2004-08-02T10:35:48Z", "bug_id": 30012, "creation_time": "2004-08-02T10:35:48Z", "is_private": false, "text": "I've had the same problem. Setting EnableSendfile Off, EnableMMAP Off, \nWin32DisableAcceptex didn't help. Finally, I found that my firewall (Norton \nInternet Security) was truncating the output. Large images were considered as \npublicity and therefore removed from the output. Making the images smaller \n(decreasing width or height) helped in some cases. Setting the firewall to \nallow publicity solved the problem.\n"}]