[{"count": 0, "tags": [], "bug_id": 30055, "is_private": false, "text": "I'm creating a management system that includes using MBeans to manage the \nlogger module. \n\nthe logger is configured in an xml file and includes some appenders and some \nloggers that use these appenders.  loggers may use the same appenders. the \nappenders' name is used to compose it's ObjectName when registering it as an \nAppenderDynamicMBean. therefore, if 2 loggers use the same appender, they will \nboth try to register them in the MBeanServer. as soon as the first request is \nmade, all others will fail -due to the duplication of the ObjectName assigned \nfor the MBean. and the problem occurs in the following code in \nLoggerDynamicMBean.java:\n\n  void registerAppenderMBean(Appender appender) {\n    String name = appender.getName();\n    cat.debug(\"Adding AppenderMBean for appender named \"+name);\n    ObjectName objectName = null;\n    try {\n      AppenderDynamicMBean appenderMBean = new AppenderDynamicMBean(appender);\n      objectName = new ObjectName(\"log4j\", \"appender\", name);\n      server.registerMBean(appenderMBean, objectName);\n\n      dAttributes.add(new MBeanAttributeInfo(\"appender=\"+name,\n\t\t\t\t\t     \"javax.management.ObjectName\",\n\t\t\t\t\t     \"The \"+name+\" appender.\",\n\t\t\t\t\t     true,\n\t\t\t\t\t     true,\n\t\t\t\t\t     false));\n\n    } catch(Exception e) {\n      cat.error(\"Could not add appenderMBean for [\"+name+\"].\", e);\n    }\n  }\n\nThe part when the second logger tries to register the appender, \nan \"InstanceAlreadyExistsException\" is thrown (which is ok) however the \nfollowing line is not executed (which is not ok!). and the appender is never \nregistered as the MBean's attribute!\n\nI would suggest catch the \"InstanceAlreadyExistsException\" separately and when \nit is being caught - to still add the appender as the attribute of the \nLoggerDynamicMBean - that fact that it already exists on the MBeanServer does \nnot mean it should not be registered as an attribute of the LoggerDynamicMBean.", "id": 60484, "time": "2004-07-12T15:51:23Z", "creator": "noga@imperva.com", "creation_time": "2004-07-12T15:51:23Z", "attachment_id": null}]