[{"count": 0, "tags": [], "bug_id": 30222, "attachment_id": null, "is_private": false, "id": 60890, "time": "2004-07-20T20:07:32Z", "creator": "websoft@sbcglobal.net", "creation_time": "2004-07-20T20:07:32Z", "text": "At various points while Apache is running I get the error message stated in \nthe summary. It seems to occur randomly while the server is being accessed.\nThe server continues to run after this occurs as well. And at times the \nmessage will appear multiple times while the server is being used, so I know \nthat the program itself is not being closed.\n\nAnother error that appeared certain times after apache gave me the 1st error \nmentioned above was:\n\nThe instruction at \"0x6eec7973\" referenced memory at \"0x000000000\". The memory \ncould not be \"read\".\n\nWhen I came to my computer, Apache had displayed the 1st error message 3 \ntimes, and the second was shown 3 times as well.\n\nI am using an Apache 2.0.50 binary distribution, with the mod_ssl module also \nimplemented, I am not sure whether this has anything to do with the errors. \nAnd as far as when the errors occur, it seems to be a random pattern. While I \nam accessing my site from the computer running Apache, I will see the error \nmessage pop up, as well as when others visit the site it will sometimes \nappear. I tried to recreate the error by visiting all sections of my site, but \nI could not get the error message to appear.\n\nOnce, while visiting the site from another computer (I believe that visit \ncaused the 3 error messages to appear), none of the pictures on parts of the \nsite would appear. I am not sure if this is related to the error messages, but \nI figured I should report it just in case.\n\nMy guess is that those error messages represented child processes as the \nserver seemed to continue to function, but I am not really sure of anything \ngiven the random nature of this problem."}, {"count": 1, "tags": [], "text": "Is this still reproducible in 2.0.53?  Can you get a backtrace out of the crashes?", "is_private": false, "id": 72133, "creator": "jorton@redhat.com", "time": "2005-03-10T14:46:18Z", "bug_id": 30222, "creation_time": "2005-03-10T14:46:18Z", "attachment_id": null}]