[{"count": 0, "tags": [], "creator": "minfrin@apache.org", "attachment_id": null, "text": "When proxy_http (and I assume the other proxy modules) make a connection to the\nbackend, a DNS lookup is potentially performed for each request.\n\nA simple DNS cache, flushed on server graceful restart, should improve\nperformance here.\n\nTo make this configurable, a timeout should be set as to the age of the entires\nin the cache, 0 meaning \"don't cache\". A typical value might be 1 minute or so -\nshort enough so that admins who change the IP in DNS and then don't see the\nchange in their httpd installation won't be sent on a wild goose chase, but long\nenough to make a significant difference to performance.", "id": 60963, "time": "2004-07-22T13:44:13Z", "bug_id": 30259, "creation_time": "2004-07-22T13:44:13Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 30259, "attachment_id": null, "id": 60966, "time": "2004-07-22T13:55:21Z", "creator": "jorton@redhat.com", "creation_time": "2004-07-22T13:55:21Z", "is_private": false, "text": "Why implement in httpd?  Why not use existing solutions e.g. nscd works well."}, {"count": 2, "tags": [], "text": "It would have to be investigated whether something like nscd would give enough\nof a performance enhancement, or in environments where this is not possible\n(win32?) whether a cache would improve things.\n\nThis is why this bug is marked as \"enhancement\" :)\n", "attachment_id": null, "bug_id": 30259, "id": 60967, "time": "2004-07-22T13:59:03Z", "creator": "minfrin@apache.org", "creation_time": "2004-07-22T13:59:03Z", "is_private": false}, {"count": 3, "tags": [], "text": "Windows Server has its own DNS implementation, and recursive DNS servers such as Unbound are available cross-platform, so the Windows case is covered.\n\nOf course there's no httpd code to benchmark against, but external cacheing resolvers offer good performance without adding complexity.", "attachment_id": null, "id": 154798, "creator": "isoma@c8h10n4o2.org.uk", "time": "2012-03-11T13:00:46Z", "bug_id": 30259, "creation_time": "2012-03-11T13:00:46Z", "is_private": false}]