[{"count": 0, "tags": [], "bug_id": 30349, "attachment_id": null, "text": "Jasper cannot compile JSP pages if the web app doc base has spaces in its path\n-- at least not for the case of an expanded web app loaded via a <Context> element.\n\nThe issues seems to be one of finding the jars in WEB-INF/lib.\n\nIn my case I only have a few jars in WEB-INF/lib and my pages fail to compile\ndue to errors like:\n\nGenerated servlet error:\nD:\\Tomcats\\Tomcat5027\\work\\Catalina\\localhost\\wus\\org\\apache\\jsp\\index_jsp.java:13:\npackage wus does not exist\nimport wus.WusUtilities;\n           ^\n\nThe package 'wus' (and the public class wus.WusUtilities) is in a jar in\nWEB-INF/lib in this case -- and the web app works perfectly in the same Tomcat\nonce I move the doc base to file path which does not include spaces.\n\nThis issue is easy for individuals to work around, but hard to educate others on\n-- most particularly on Windows where people are space happy with file and\ndirectory names.  Thus this should be fixed to prevent unnecessary user\nconfusion -- and to prevent needless reports of \"Tomcat is completely broken\"\nfrom such users.", "id": 61182, "time": "2004-07-27T16:49:31Z", "creator": "jessh@ptc.com", "creation_time": "2004-07-27T16:49:31Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 30349, "attachment_id": null, "text": "Whoops!  I may be mistaken here.  I am going to do a bit more testing, though\nbefore hastily closing this after hastily opening it...", "id": 61186, "time": "2004-07-27T17:05:05Z", "creator": "jessh@ptc.com", "creation_time": "2004-07-27T17:05:05Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 30349, "is_private": false, "text": "I am closing this as invalid as this issue turns out to be a side effect of my\nattempt to fix bug 13983.  Those who distrusted this fix were thus justified, as\nit broke page compilation for paths including space where the prior situation\nwas that only RMI was broken (and only due to issues with Sun's silly RMI\nimplementation involving a space-delimited URL list).\n\n[I tried several other tacks to the fix, but the issues appears to be that\nTomcat 5's JSP compiler requires that spaces be *unescaped* and RMI requires\nthat they be *escaped* -- and they're both apparently using the same API,\ngetURLs().]", "id": 61191, "time": "2004-07-27T17:32:15Z", "creator": "jessh@ptc.com", "creation_time": "2004-07-27T17:32:15Z", "attachment_id": null}]