[{"count": 0, "tags": [], "text": "Xerces accepts NS declarations of the form of:\n\n<test xmlns:x='' />\n\nHowever, the empty string is not a valid namespace name. It's only allowed in \nnamespace \"undeclarations\" where the (unqualified) default namespace is reset.\n\nQuote from <http://www.w3.org/TR/1999/REC-xml-names-19990114/#ns-decl>:\n\n[Definition:] If the attribute name matches PrefixedAttName, then the NCName \ngives the namespace prefix, used to associate element and attribute names with \nthe namespace name in the attribute value in the scope of the element to which \nthe declaration is attached. In such declarations, the namespace name may not \nbe empty.\n\n[Definition:] If the attribute name matches DefaultAttName, then the namespace \nname in the attribute value is that of the default namespace in the scope of \nthe element to which the declaration is attached. In such a default \ndeclaration, the attribute value may be empty. Default namespaces and \noverriding of declarations are discussed in \"5. Applying Namespaces to Elements \nand Attributes\".", "is_private": false, "id": 4358, "creator": "julian.reschke@greenbytes.de", "time": "2001-08-08T05:04:09Z", "bug_id": 3040, "creation_time": "2001-08-08T05:04:09Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "pavani.mukthipudi@sun.com", "text": "If a namespace name is empty (except for default namespace name), Xerces 1.4.3\ncomplains, saying that the prefix was not declared, only when the prefix is\nused. That is, the Namespace Constraint is checked only when the prefix is used.\nIf the prefix is not used, it doesn't point out the error. ", "id": 5047, "time": "2001-09-03T00:06:17Z", "bug_id": 3040, "creation_time": "2001-09-03T00:06:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "Fixed thanks to a patch from Pavani Mukthipudi.", "is_private": false, "id": 7659, "creator": "neilg@ca.ibm.com", "time": "2001-11-07T12:28:24Z", "bug_id": 3040, "creation_time": "2001-11-07T12:28:24Z", "attachment_id": null}]