[{"count": 0, "tags": [], "bug_id": 30404, "attachment_id": null, "is_private": false, "id": 61361, "time": "2004-07-30T08:02:58Z", "creator": "ms@docware.de", "creation_time": "2004-07-30T08:02:58Z", "text": "Hello,\n\nIn our web-app that runs with Tomcat 4.1.29 we set the content-type \nto \"text/xml\" in a servlet that serves an XML file. The XML encoding normally \nis UTF-8. We observed that special characters show up wrong in the browser. \nPacket sniffing showed that Tomcat changed the content-type \nto \"text/xml;charset=ISO-8859-1\" which was not the case with \nearlier Tomcat versions.\n\nI looked up the bug database and the mailing list for this behaviour and read \nthat Tomcat does this for alle \"text/*\" content types where the charset is \nmising.\n\nTo fix this I can change the mime-type-definition in web.xml to \n\"text/xml;charset=UTF-8\" or add this in my servlet. But If my servlet has to \nserve ISO-8859-1 XML files that would be also wrong. Should I parse the \nresource prior to serving it in order to determine the encoding?\n\nI cannot find the strong requirement to add the default charset in the HTTP \nspec. I read a discussion in the list that the JSP spec requires it - but also \nfor a servlet? \nI think the charset is added by the Coyote connector so from the connector's \npoint of view servlets and JSP-servlets are the same.\n\nDoesn't it make sense to omit the default charset for XML files because XML \nfiles normally should carry their encoding in the header? Then the browser \ncould get the encoding from there as it was done with earlier Tomcat versions.\n\nMichael"}, {"count": 1, "tags": [], "bug_id": 30404, "attachment_id": null, "is_private": false, "id": 61406, "time": "2004-07-30T19:36:32Z", "creator": "markt@apache.org", "creation_time": "2004-07-30T19:36:32Z", "text": "This is a known bug with 4.1.29 that has been fixed (I think in 4.1.30 and \ncertainly in current CVS HEAD). See bug 28170 for a report of this working in \n4.1.30\n\nSee laso bug 24970 for more background information."}, {"count": 2, "tags": [], "text": "Yes, I tested it in 4.1.30 and found it working. Sorry, I promise to use the \nlatest version next time before posting a bug.\nI read the related bug reports before posting mine and today I read them again. \nI still find them not fully related to my problem, that's why I wrote a new \nreport.\nAnyway, thanks a lot!\n\nMichael", "is_private": false, "bug_id": 30404, "id": 61716, "time": "2004-08-09T14:57:56Z", "creator": "ms@docware.de", "creation_time": "2004-08-09T14:57:56Z", "attachment_id": null}]