[{"count": 0, "tags": [], "creator": "b.eicki@gmx.net", "text": "I use Xindice 1.1b4 and I'm experiencing problems with the SymbolTables stored \nunder SysSymbols. \nI cannot exactly say when it happens because it does not always occur, but \nsometimes after I delete collections from my database and insert the same \ncollections again and fill them with some resources, the SymbolTables for these \ncollections are empty (i.e. they only contain an empty symbols-tag). \nThe problem is then that with having lost the SymbolsTable I cannot access the \nresources any more. i.e. they are listed correctly but if I want to view/or \nexport these resources I either get a NullPointer or an xml-file with an \nempty \"null\"-tag only. \nIf I restore the SymbolsTable manually everything is \"fine\" again.\n\nAny idea?", "id": 61707, "time": "2004-08-09T11:32:12Z", "bug_id": 30538, "creation_time": "2004-08-09T11:32:12Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 30538, "is_private": false, "id": 62079, "time": "2004-08-17T16:34:44Z", "creator": "b.eicki@gmx.net", "creation_time": "2004-08-17T16:34:44Z", "tags": [], "text": "After hours of investigation I found a reason. The following happened:\nAt first my system tries to delete some collection 'name' (which is not empty \nand may have subcollections) within a collection 'path' by \n\ncol = org.xmldb.api.DatabaseManager.getCollection(m_dbURL + path);\nCollectionManagementService service = (CollectionManagementService) \ncol.getService(\"CollectionManagementService\", \"1.0\");\nservice.removeCollection(name);\n\nAfter that I want to import the same collection, resources again, but before I \ndo this I check if these files exist by checking if\n\norg.xmldb.api.DatabaseManager.getCollection(m_dbURL + path).getResource(id) != \nnull\n\nThis returns true for the resources within my collection I thought I had \ndeleted, resulting in the situation that the collection is created again \n(containing the old documents, which somehow have not been deleted completely), \nbut the SymbolTable is empty, which then leads to NullPointerExceptions if \naccessing these documents.\n\nTo make this even more confusing this seems only to happen if I reload my \nwebapplication (XIndice is running embeded under Tomcat 5) before I start \ndeleting the collection. If I restart the whole Tomcat server this does not \nhappen. \n\nA workaround I found out is now to recursively delete all subcollections and \nresources within the collection first and then removing the empty collection.\n\nBjoern Eickvonder\n"}, {"count": 2, "tags": [], "creator": "vgritsenko@apache.org", "attachment_id": null, "id": 76293, "time": "2005-06-11T04:57:23Z", "bug_id": 30538, "creation_time": "2005-06-11T04:57:23Z", "is_private": false, "text": "I tried to reproduce your issue but failed to do so (using current xindice CVS).\nMy steps were:\n\n  * Open database, embedded, from within web application (jsp file)\n  * Create two collections, one nested into another\n  * Add document\n  * Shutdown database\n  * Restart web application\n  * Delete collection\n\nDelete went fine, leaving no files behind.\n\nMost probably in your web application you forgot to shutdown xindice embed\ndatabase, which was causing data corruption. Xindice 1.1b4 is also had a bug in\nflushing db configuration to the disk which could be related.\n\nVadim\n"}]