[{"count": 0, "tags": [], "creator": "micke@screemer.nu", "attachment_id": null, "id": 62229, "time": "2004-08-20T09:22:01Z", "bug_id": 30769, "creation_time": "2004-08-20T09:22:01Z", "is_private": false, "text": "Hi there, I've had Apache 2.xx installed on Windows XP Professional for a long\ntime and it has been running really great.\n\nJust recently I installed the net install of SP2 for XP.\nAfter that upgrade I've noticed that for some reason the Apache server don't\nseem to serve sites fast any more.\n\nWhen someone tries to access a site I am hosting what seem to happend is it\ninitiates a transfer and then just stops.\n\nI have tried \"Win32DisableAcceptEx\" and I've also tried to \"EnableSendfile off\"\n\nI have disabled all the security stuff in SP2 like the firewall and security\ncenter, also the DEP. I used to have a firewall called Tiny firewall installed\nbut that's uninstalled now.\n\nI can see no reason to this problem and I have searched thru bugreports and been\ngoogeling allot but I can find no information about this.\n\nI have 4 sites on the server and all are the same."}, {"count": 1, "tags": [], "creator": "chip@force-elite.com", "text": "Can we have some more details?\n\nHow slow is slower?  1 Page per second max?  What did you serve before?\n\nAlso, I believe some of this is expected with SP2. They did lots of things to\nmake it 'safer', without worrying about performance too much.  Its possible we\ncan make Apache faster in SP2, but we really need some details on what happens!", "id": 62239, "time": "2004-08-20T14:53:30Z", "bug_id": 30769, "creation_time": "2004-08-20T14:53:30Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 30769, "attachment_id": null, "text": "Sure you can have details..\n\nAfter installing SP2 i could serve about 1 page a minute and most of the time\nabout 1 page / 10 minutes.\n\nI used to get allot of these untill I added \"Win32DisableAcceptEx\"\n\" The semaphore timeout period has expired.  : winnt_accept: Asynchronous\nAcceptEx failed. \"\n\nNow I get this in the general error log when I start the server.\n[Fri Aug 20 15:48:34 2004] [notice] Child 4396: Exit event signaled. Child\nprocess is ending.\n[Fri Aug 20 15:48:35 2004] [notice] Child 4396: Released the start mutex\n[Fri Aug 20 15:48:36 2004] [notice] Child 4396: Waiting for 64 worker threads to\nexit.\n[Fri Aug 20 15:49:04 2004] [notice] Parent: Forcing termination of child process\n332 \n\nAlso I've learned that the tcpip.sys in SP2 is stripped to 10 simultanious\nopenings per port. There is a patch that fixes that and resets it to 16000000+\nand I've even tried to apply that.\n\nCPU usage is really low and mem usage the same..\n\nI hope this can be of some help..\n\nI had to change to another web server today since my hosts can't stay down.\nBut I'll be glad to give more info if I can.", "id": 62249, "time": "2004-08-20T18:32:34Z", "creator": "micke@screemer.nu", "creation_time": "2004-08-20T18:32:34Z", "is_private": false}, {"count": 3, "tags": [], "text": "I have this problem also, but only when I use the DNS name to access the site, \nif I use the ip to go directly to it, things seem to run much smoother \n(although I still notice a little craziness).  Do you get the same performance \nif you access the site directly?", "attachment_id": null, "bug_id": 30769, "id": 71266, "time": "2005-02-20T01:57:36Z", "creator": "twynne@premierdata.com", "creation_time": "2005-02-20T01:57:36Z", "is_private": false}, {"count": 4, "tags": [], "creator": "jorton@redhat.com", "attachment_id": null, "id": 72125, "time": "2005-03-10T14:27:13Z", "bug_id": 30769, "creation_time": "2005-03-10T14:27:13Z", "is_private": false, "text": "If nobody can identity some specific httpd issue which can be fixed there's not\nmuch point in filing the bug.  Please try a user support forum, I presume there\nare people out there using 2.0 on Windows successfully:\nhttp://httpd.apache.org/lists.html#http-users"}]