[{"count": 0, "tags": [], "bug_id": 30795, "attachment_id": null, "id": 62326, "time": "2004-08-23T05:21:02Z", "creator": "thomasw@powermapjdo.com", "creation_time": "2004-08-23T05:21:02Z", "is_private": false, "text": "Hi --\n\nDelete Task needs a 'safety' so its correct targetting can be verified, before\nthe actual deletion is run. This is a loaded gun, folks, and I've seen it once\nalready go off in a (substantially) unexpected location with (further)\nunexpected results.\n\nI wouldn't do a bulk delete manually without double-checking what I was about to\ndelete, and filesets etc make this much less visible in the Ant tool. So people\nneed a way to see & confirm before the delete executes.\n\nI was concerned about the lack of an obvious 'confirm', 'verify', 'displayonly'\nor 'safety' feature on the delete task. I spent 40 minutes looking for a way to\nconfirm this -- or to print the actual targets of a fileset -- none of which\nbasic troubleshooting/ reliability features seemed to be available. Finally I\ndecided that Ant must be moderately reliable and just to run the sucker.\n\nThis stinks. Because when it ran, the delete targetted the top folder of my\nmajor development project. Spuriously -- I'd quadruple checked the targetting\nbefore, checked after, and still have no idea why the bomb went off there.\nLuckily there was no recursion into src folders. Also luckily, but unreliably as\nfar as the tool goes, some files were erased but not others.\n\nSummary: I'm really disappointed at the lack of basic safety, ability to print\nwhat a fileset targets, and the bizarre and not particularly explainable way\nthings went wrong. \n\nMy conclusion: never to use the Delete task under any circumstances; but to use\nthe Move task to some 'trashcan' deleted folder instead.\n\nSuggested enhancements:\n1) 'verify' or 'displayonly' attributes for Delete task\n2) task to print actual resolved targets of filesets etc\n\nThis would allow the buildfile to be tested safely, before turning the 'safety'\nattribute for production usage.\n\nHopefully these would be helpful to developers working on their makefiles. I\nabsolutely shudder to think of a mis-targetted 'delete bomb' going off in\npeople's root or major work directory. This could make the term 'major fuckup'\nseem a polite understatement :-)\n\nIt scared the f**k out of me!\n\nLuckily it should be easy and clean and nice to fix.\n\n\nCheers,\nThomas"}]