[{"count": 0, "tags": [], "bug_id": 30863, "attachment_id": null, "id": 62532, "creation_time": "2004-08-26T12:23:06Z", "time": "2004-08-26T12:23:06Z", "creator": "kranga@k2d2.org", "text": "The If: headers of webDAV (section 9.4) don't seem to be implemented. Only the \nIf-* headers of http 1.1 seem to be implemented and even those checks are done \nonly on the GET and PUT methods.", "is_private": false}, {"count": 1, "tags": [], "bug_id": 30863, "attachment_id": null, "is_private": false, "id": 62578, "time": "2004-08-27T12:26:29Z", "creator": "luetzkendorf@apache.org", "creation_time": "2004-08-27T12:26:29Z", "text": "Have a look at AbstractWebdavMethod.extractLockTokens where the If header is\nparsed.  The lock tokens found are stored in a SlideToken object and\ncorresponding checks are proveded by the LockImpl.\n\nAlso have a look at the testcase functional/lock/code/lockput200.xml\nThere is a sample of using the If header. \n\nI'm not sure that etags in the If header are handled correctly. I'll try to \nwrite testcases. Or do you have some one?\n\nBTW Without support of the If header writing on a resource you have locked\ncould not work, so basic support for the If header must exist.\n\nRegards, Stefan"}, {"count": 2, "tags": [], "bug_id": 30863, "attachment_id": null, "is_private": false, "id": 62579, "time": "2004-08-27T12:48:57Z", "creator": "kranga@k2d2.org", "creation_time": "2004-08-27T12:48:57Z", "text": "There is support for the lock tokens. However, the getIf() method that holds \nthe parsed data for If: hearder (different from lock-token) is not called \nanywhere at all...\n\nAlso, only the lock token seems to be parsed out from the If: header. No \nassociated resource URLs are extracted. Or am I reading this section wrong?\n\nhttp://www.webdav.org/specs/rfc2518.htm#HEADER_If"}, {"count": 3, "tags": [], "creator": "luetzkendorf@apache.org", "attachment_id": null, "id": 62586, "time": "2004-08-27T14:14:06Z", "bug_id": 30863, "creation_time": "2004-08-27T14:14:06Z", "is_private": false, "text": "Yes getIf is not called. But in extractLockTokens lock tokens are stored\nin a SlideToken, as I already mention. Well, that is something like an ugly \nside effect but it's the way it is.\n\nBut I think you are right if you say not all forms of the If header are \nsupported. It seems that there is currently no client that uses the other \nforms ... at least nobody ever reported corresponding problems.\n\nThe If header currently supported is at least:\nIf: (<first-lock-token> <second-lock-token> ....)\n\nDo you know any client software that requires the other forms? That would \nof course increase the priority of this issue.\n"}, {"count": 4, "tags": [], "text": "Fortunately I do not know of any clients that support the more sophisticated \nIf: headers and frankly I think the protocol committee was brain-dead on \ncoming up with such a complicated scheme!\n\nI asked because I'm developing a custom-slide implementation - an overhaul \nthat is very streamlined and I was going through the spec and I didn't think I \nhad seen any code that handled the If: header in more complex cases. \n\nI think you can close this bug...", "is_private": false, "bug_id": 30863, "id": 62614, "time": "2004-08-27T21:39:25Z", "creator": "kranga@k2d2.org", "creation_time": "2004-08-27T21:39:25Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 30863, "is_private": false, "text": "I change this to \"later\" because there seems currently no needs for the more\nsofisticated If headers.", "id": 63041, "time": "2004-09-03T14:54:50Z", "creator": "luetzkendorf@apache.org", "creation_time": "2004-09-03T14:54:50Z", "attachment_id": null}]