[{"count": 0, "attachment_id": null, "creator": "roxspring@imapmail.org", "text": "If two files with the same name are opened (from different directories) then the\nevents of the second are added to the first instead of using a new tab.  It gets\nparticularly grim if the panel has been 'hidden' between loading the first and\nsecond file because the second one appears not to load at all.  This is totally\nunintuitive IMHO and certainly leads to confusion in my team.", "id": 62573, "time": "2004-08-27T11:51:17Z", "bug_id": 30888, "creation_time": "2004-08-27T11:51:17Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "psmith@apache.org", "text": "The tab events go to is totally dependant on the value of the application-wide \nproperty \"Tab Identifier\".\n\nWhat is yours set to?  Try using:\n\nPROP.hostname - PROP.application\n\nas the tab identifier and see if that helps.  This should create a new tab for \neach file.  I'm curious to know what your property value is set to.\n", "id": 62669, "time": "2004-08-29T21:44:23Z", "bug_id": 30888, "creation_time": "2004-08-29T21:44:23Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "roxspring@imapmail.org", "attachment_id": null, "text": "The tab is set to the default \"PROP.hostname - PROP.application\" but I don't see\nwhat this has to do with anything - where would hostname and application come\nfrom  in the files anyway?\n\nIt looks like it's using file.getName() to name the tabs, which then get mixed\nbecause files in different directories can have the same name.", "id": 62908, "time": "2004-09-01T15:09:47Z", "bug_id": 30888, "creation_time": "2004-09-01T15:09:47Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 30888, "attachment_id": null, "text": "When loading files into Chainsaw, the paths weren't included in the tab identifier because it had the potential of creating tabs with really long names (this is also because I didn't consider the fact that folks would be loading a file with the same name but from different locations).\n\nI agree this should be changed, probably providing the complete file path, in case folks want to load have logs from separate machines with the same file name and the same path.\n\nAs Paul mentioned, events are routed to tabs based on attributes of the event.  As files are loaded, 'hostname' and 'application' properties are added to the event to facilitate this routing to a unique tab.  Examine the detail pane for a selected event. the 'Properties' line includes 'hostname' and 'application' entries, and that's how events are routed.", "id": 62911, "time": "2004-09-01T15:26:39Z", "creator": "sdeboy@iname.com", "creation_time": "2004-09-01T15:26:39Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 30888, "text": "There's more to this.  If the XML log file contains events that aleady have \nproperty values for the 'application' and 'hostname' keys, then they are NOT \noverriden with the name of the file.  \n\nNot sure what we should do here, because it's probably bad practice to 'clobber' \noriginal property values, but I can see the use-case where you want each file \nloaded into it's own tab.", "id": 62938, "time": "2004-09-02T00:39:51Z", "creator": "psmith@apache.org", "creation_time": "2004-09-02T00:39:51Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 30888, "attachment_id": null, "text": "Is it correct that the tab label is the one determining where event should go, even when loaded from different files?  \n\nWhat would be the appropriate way to deal with this issue now that some time has passed and other parts of the code has developed too?", "id": 118164, "time": "2008-07-01T15:25:15Z", "creator": "thorbjoern@gmail.com", "creation_time": "2008-07-01T15:25:15Z", "is_private": false}, {"count": 6, "attachment_id": null, "bug_id": 30888, "text": "Fields on the event (along with the tab identifier specified in the application-wide settings screen) determine which tab events are routed to.  \n\nIf a file is loaded (via file/load or through the LogFilePatternReceiver), two properties are added to each of the file's events.  If the default tab identifier is in use, these additional properties will cause the file's events to route to its own tab.\n\nThere is also a mechanism by which events can be routed to multiple tabs: via the 'create custom expression logpanel' menu (essentially creates a 'view' of events on other tabs in a new tab).\n\nNot sure if this is what you were asking, but I thought I'd try to explain how the routing works.", "id": 118173, "time": "2008-07-01T16:42:28Z", "creator": "sdeboy@iname.com", "creation_time": "2008-07-01T16:42:28Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "bug_id": 30888, "text": "Is this still an issue?", "id": 135718, "attachment_id": null, "creator": "sdeboy@iname.com", "creation_time": "2010-03-28T04:27:46Z", "time": "2010-03-28T04:27:46Z", "is_private": false}]