[{"count": 0, "tags": [], "text": "I have a target in my build.xml file that uses the <style> element to process an \nan XSLT file and puts the output in a temporary destination directory.  Before \nthe <style> element is called, there is a <delete> element that actually deletes \neverything in the temporary directory BEFORE it does the processing.  This is \nthe same for a number of targets.  The problem is... after one target is \nprocessed, and another begins... it fails at the <deletion> stage because the \nold target still has an open resource handle to the output file in the temporary \ndirectory... and Windows won't allow you to delete any directory or file if \nthere is still an open handle on it.  \n\nI looked through the ANT code... and noticed in the TraxLiaison.java class that \na FileOutputStream is created and passed on the same line to the javax \ntransformer.  I changed the code to create the outputstream before the \ntransformer, pass it on the transformer, then close the outputstream after the \ntransformation.  And that worked.", "attachment_id": null, "id": 4456, "creator": "mike@slac.com", "time": "2001-08-10T10:49:29Z", "bug_id": 3088, "creation_time": "2001-08-10T10:49:29Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 3088, "is_private": false, "id": 4457, "creation_time": "2001-08-10T11:12:49Z", "time": "2001-08-10T11:12:49Z", "creator": "katkere@praja.com", "text": "Isn't this a duplicate of already resolved bug #1848 \n(http://nagoya.apache.org/bugzilla/show_bug.cgi?id=1848)?\n\n", "attachment_id": null}, {"count": 2, "tags": [], "creator": "sbailliez@apache.org", "text": "It was probably set as a duplicate but I had it in mind when recoding for \nsolving #3087. It should be fixed in CVS and should even be OK in beta1.\n\nIf you can reproduce this easily, it would be very nice if you could check for \nthis bug with the CVS version in ANT_14_BRANCH.", "id": 4497, "time": "2001-08-11T15:23:48Z", "bug_id": 3088, "creation_time": "2001-08-11T15:23:48Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 3088, "attachment_id": null, "id": 4526, "time": "2001-08-13T09:53:45Z", "creator": "mike@slac.com", "creation_time": "2001-08-13T09:53:45Z", "is_private": false, "text": "You're correct this bug is a duplicate... just something I saw after I put in\nbug #3087, and didn't look hard enough in the database to see if it had been\nfound.\n\nAnd yes... I brought down 1.4 Beta and the fix was there and it worked. \nThanks."}]