[{"count": 0, "tags": [], "creator": "acroyear@io.com", "attachment_id": null, "id": 4459, "time": "2001-08-10T12:05:45Z", "bug_id": 3090, "creation_time": "2001-08-10T12:05:45Z", "is_private": false, "text": "Because the package-list is sent to javadoc \"as-is\", there's a discrepency\nbetween the options for the packages to be javadoc'ed and the options for the\n\"group\" tag.  I tried to use comma-separated lists in \"group\" and it failed to\nwork right, putting those into \"Other Packages\" instead of where I specified. \nRegular Expressions didn't work either the way the work in other parts of the\nant system.  I finally found out why by reading the documentation for the\njavadoc tool in jdk1.3.1, where I discovered that javadoc uses ':' or ';' for a\nseparator in the -group option based on the platform, even though it uses comma\nseparated for the package list itself.  Ant does no processing on these\narguments the way it does for its fileset and javac tags.\n\nThis also means there may be a system-dependency error in using group in the\njavadoc task that I don't think is handled by ant correctly (though I can't\nconfirm it now, not having a windows box to test on).  group should either 1)\nuse commas to be consistent with the other package list or 2) accept both \":\"\nand \";\" and correctly convert them across platforms the way the classpath system\nof ant does."}, {"count": 1, "tags": [], "bug_id": 3090, "attachment_id": null, "text": "Yes there is a system-dependency in \"group\".  On Linux, things worked well when\nI used the colon as a separator.  Using semicolon the way javadoc for windows\nspecifies and it breaks -- the packages get put under \"Other Packages\" as if the\ntag wasn't there.", "id": 4460, "time": "2001-08-10T12:11:14Z", "creator": "acroyear@io.com", "creation_time": "2001-08-10T12:11:14Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 3090, "attachment_id": null, "text": "Well, I have to say the documentation is ambiguous\nhttp://java.sun.com/j2se/1.3/docs/tooldocs/win32/javadoc.html#group\n\nThis suggests colons are used on both Windows and Unix. While there is a \nstatement \"Multiple patterns can be included in a group by separating them with \nsemicolons (;).\", the heading and example both use a colon. Since Ant is not \ncurrently parsing based on either colon or semi-colon and just passing such \nstrings to Javadoc, the experiences reported here suggest that the colon should \nbe used on both platforms. \n\nThe Ant code does process group packages attribute as a comma separated list \nbut there was a bug in that code. I have fixed this for 1.4Beta2. It will \nconvert such package lists into a colon (:) separated list on all platforms. \n\nI have tested semi-colons on Windows and they do not work but colons do. I have \nsubmitted a bug report to Sun - I'll see what they have to say.\n\nCan you please test 1.4 Beta2 when it is available (a few hours)", "id": 4622, "time": "2001-08-19T00:02:00Z", "creator": "conor@apache.org", "creation_time": "2001-08-19T00:02:00Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 3090, "attachment_id": null, "text": "Sun have accepted this as a bug (documentation - I guess). Bug Id is 4493925, \nalthough it will take a few days to appear on the bug database.", "id": 4665, "time": "2001-08-20T16:46:32Z", "creator": "conor@apache.org", "creation_time": "2001-08-20T16:46:32Z", "is_private": false}]