[{"count": 0, "tags": [], "creator": "forevernd@yahoo.com", "attachment_id": null, "text": "I have an excel workbook A with 3 worksheets. I need to create 3 additional  \nworkbooks each contains a worksheet from workbook A. Because currently HSSF \nmodel doesn't allow copy sheets, I thought I could workaround by openning the \nworkbook A, remove 2 worksheets, write it back out as workbook A1, (and keep \ndoing the samething until all workbooks have been produced). Here is my code:\n\npublic void testRemoveSheets() {\n  String savePath = \"C:/temp/Doc/\";\n  String sheetNames[] = {\"Sheet1\", \"Sheet2\", \"Sheet3\"};\n  try {\n     for (int i = 0; i < sheetNames.length; i++) {\n       String sn  = sheetNames[i];\n       POIFSFileSystem fs = new POIFSFileSystem(new FileInputStream(savePath \n+ \"TestRemove2.xls\"));\n       HSSFWorkbook wb = new HSSFWorkbook(fs);\n       FileOutputStream fos = new FileOutputStream(savePath + \"TestRemove2-\" + \nsn + \".xls\");\n\t\t    \t\n       for (int j = 0; j < sheetNames.length; j++) {\n         String s = sheetNames[j];\n         if (!s.equals(sn)) wb.removeSheetAt(wb.getSheetIndex(s));\n       }\n\t\t\t\t\n       wb.write(fos);\n       fos.close();\n    }\n  }\n  catch (Exception e) {System.out.println(e.toString());}\n}\n\nEverything seamed to be OK because I received no error. However, when I tried \nto open the newly generated workbooks, MS Excel (ver 2002) gave me an error. \nHere is the error log\n**************\nMicrosoft Excel File Repair Log\n\nErrors were detected in file 'C:\\temp\\Doc\\TestRemove2-Sheet1.xls'\nThe following is a list of repairs:\n\nRemoved one or more invalid names.\n**************\n\nData seems to be OK but the error is annoying/scary to users. And the file \nsize is always bigger than it would be if generated individually.\n\nThis bug is similar to bug # 29619 - Excel file becomes corrupt after sheet \ndeletion.", "id": 62873, "time": "2004-09-01T01:00:09Z", "bug_id": 30978, "creation_time": "2004-09-01T01:00:09Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 12586\nZip with original workbook - corrupt workbooks - error screenshot", "is_private": false, "bug_id": 30978, "id": 62874, "time": "2004-09-01T01:07:20Z", "creator": "forevernd@yahoo.com", "creation_time": "2004-09-01T01:07:20Z", "attachment_id": 12586}, {"count": 2, "tags": [], "creator": "dconlon@gmail.com", "attachment_id": null, "id": 74228, "time": "2005-04-28T15:46:53Z", "bug_id": 30978, "creation_time": "2005-04-28T15:46:53Z", "is_private": false, "text": "(In reply to comment #0)\n...\n> Data seems to be OK but the error is annoying/scary to users. And the file \n> size is always bigger than it would be if generated individually.\n...\n\nI have just worked around this issue in a project I'm working on. I haven't been\nsuccessful in creating a test case, but still thought I'd describe what I know -\nhopefully it may help isolate what's causing Excel to display this error.\n\n* We have Excel 2000 and Excel 2003 in the office. The \"Removed one or more\ninvalid names.\" error only appears in Excel 2003. However, it appears in 2003\neven if the input XLS file was created and saved in 2000.\n\n* I deleted all charts and macros from the workbook and re-saved, but the error\nstill occurs.\n\n* I worked around the error by making sure never to write to any sheets before\nremoving a sheet that precedes them. So e.g. don't write to Sheet3 and then\ndelete Sheet2; instead, delete Sheet2 and *then* write to any sheets that come\nafter it. However, this factor by itself does not cause this error to be\ndisplayed. I'm not sure what else also needs to happen.\n"}, {"count": 3, "tags": [], "text": "note: if someone attaches an affected workbook, I imagine running BiffViewer\nwill show that there are still objects referring to the sheet (look for \"Sheet1\"\nor the name of the deleted sheet).  If that doesn't pan out run POIFSViewer and\nthere must be embedded objects related to the sheet.  If we can figure out what\nthose typically are, we should be able to fix this.", "attachment_id": null, "bug_id": 30978, "id": 74231, "time": "2005-04-28T16:11:12Z", "creator": "poi-support@buni.org", "creation_time": "2005-04-28T16:11:12Z", "is_private": false}, {"count": 4, "tags": [], "creator": "dconlon@gmail.com", "attachment_id": 14934, "is_private": false, "id": 74455, "time": "2005-05-04T21:46:27Z", "bug_id": 30978, "creation_time": "2005-05-04T21:46:27Z", "text": "Created attachment 14934\nAffected worksheet (almost blank) + BiffViewer output\n\nZip file contains a workbook with most of its content removed, but which still\ngives the \"Removed one or more invalid names\" error upon opening in Excel 2003.\n\n\nAlso contains BiffViewer dump obtained by calling BiffViewer.run() on the\naffected workbook."}, {"count": 5, "tags": [], "creator": "suresh.h@tcs.com", "attachment_id": null, "id": 83912, "time": "2005-12-22T07:51:24Z", "bug_id": 30978, "creation_time": "2005-12-22T07:51:24Z", "is_private": false, "text": "guys \n\nplease update how to fix this bug"}, {"count": 6, "tags": [], "bug_id": 30978, "attachment_id": 17395, "text": "Created attachment 17395\nExel 2003 get this error while viewing. Used  removeSheetAt() method", "id": 84512, "time": "2006-01-12T08:00:05Z", "creator": "Subhashish.Bhattacharjee@honeywell.com", "creation_time": "2006-01-12T08:00:05Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 30978, "attachment_id": null, "is_private": false, "id": 102941, "time": "2007-05-08T09:47:42Z", "creator": "matt@swelltek.com", "creation_time": "2007-05-08T09:47:42Z", "text": "Any update on how to fix or work around this bug?\n\nIf more info is still needed, let me know.  It's very easy to recreate."}, {"count": 8, "tags": [], "text": "The developers are concentrating on any issues affecting the 3.0 release.\n\nThe release candidate 4 of POI 3.0 is now available at:\n\nhttp://people.apache.org/~nick/POI-3.0-RC4/\n\nWould you please test if this bug is still an issue.\n\n", "is_private": false, "bug_id": 30978, "id": 102942, "time": "2007-05-08T10:25:09Z", "creator": "dfisher@jmlafferty.com", "creation_time": "2007-05-08T10:25:09Z", "attachment_id": null}, {"count": 9, "tags": [], "creator": "matt@swelltek.com", "attachment_id": null, "id": 102943, "time": "2007-05-08T10:58:02Z", "bug_id": 30978, "creation_time": "2007-05-08T10:58:02Z", "is_private": false, "text": "Thanks for the quick response.\n\nI downloaded release candidate 4 of POI 3.0, and I still get the error."}, {"count": 10, "tags": [], "creator": "dfisher@jmlafferty.com", "attachment_id": null, "text": "Are you using one of the files attached to this issue, or some other file?\n\nIf some other file then you should attach the file.\n\nAlso, are you sure of the provenance of the file - do you know where it came\nfrom? What version(s) of Excel, and on operating system(s)\n\nAll this will help my developer decide if they can do anything quickly, or if\nthere is a way to determine what Excel objects are missed after the\nremoveSheetAt call.\n\nI think that there needs to be an exception thrown if there are any dependencies\nin the rest of the Workbook to the Worksheet that is being removed. If POI\nthrows a meaningful exception then that will allow you to inform your user, etc.\n\nI'm at the project management level. I'll see what Yegor thinks, but I can't say\nwhen we will have more information.\n\nRegards,\nDave\n", "id": 102945, "time": "2007-05-08T11:40:14Z", "bug_id": 30978, "creation_time": "2007-05-08T11:40:14Z", "is_private": false}, {"count": 11, "tags": [], "creator": "matt@swelltek.com", "text": "Thanks, Dave.\n\nI attached a zip containing test code and a test Excel file.  I also included\nthe resulting Excel file with the error.\n\nI created the attached test Excel file using Excel 2002 SP3 on Windows XP.\n\nLet me know what you find.\ncheers!\nmatt\n", "id": 102960, "time": "2007-05-08T14:54:28Z", "bug_id": 30978, "creation_time": "2007-05-08T14:54:28Z", "is_private": false, "attachment_id": null}, {"count": 12, "tags": [], "bug_id": 30978, "attachment_id": 20149, "text": "Created attachment 20149\nZip with test code and Excel files", "id": 102961, "time": "2007-05-08T14:54:32Z", "creator": "matt@swelltek.com", "creation_time": "2007-05-08T14:54:32Z", "is_private": false}, {"count": 13, "tags": [], "bug_id": 30978, "attachment_id": null, "text": "I can tell that this bug is still present in POI 3.0.1 final with Excel Versions\n2003 SP3 (Viewer) and Excel 2007.\nregards \n robert\n\n", "id": 109346, "time": "2007-10-15T04:56:03Z", "creator": "tddsrobert@yahoo.com", "creation_time": "2007-10-15T04:56:03Z", "is_private": false}, {"count": 14, "tags": [], "creator": "tddsrobert@yahoo.com", "attachment_id": null, "is_private": false, "id": 110842, "time": "2007-11-20T04:57:16Z", "bug_id": 30978, "creation_time": "2007-11-20T04:57:16Z", "text": "I wonder why this bug has still \"needinfo\" status. It has been opened three\nyears ago and seems to be well documented.\nIf this issue cannot be reproduced by the developers, please let us know what\ninformation is needed.\n\n"}, {"count": 15, "tags": [], "bug_id": 30978, "attachment_id": null, "is_private": false, "id": 113282, "time": "2008-01-30T03:00:27Z", "creator": "Sreedhar.Seelam@lehman.com", "creation_time": "2008-01-30T03:00:27Z", "text": "Any update on fix for this bug?\n\n"}, {"count": 16, "tags": [], "text": "Unfortunately, to fix this bug, we're going to have to find a needle in a\nhaystack (the record with the reference to the deleted sheet - since poi will\nopen the spreadsheet with the removed sheet, it isn't a simple corruption issue)\n\nIn order to find our needle, we'll initially need three files:\n* the original file with all the sheets in it\n* the file after removing the sheet in poi\n* the file after removing the sheet in excel\n\nCompare the latter two files, see the differences, and in theory you've found\nthe record(s) we need to update. Alas it isn't quite that simple...\n\nNext, we have some fun with the fact that saving a file in excel and saving it\nin poi will give slightly different files. So, we need to open files 1 and 3 in\npoi, and save those again without changes. Now, find the difference between 1\nand 1-from-poi, and 3 and 3-from-poi. Knowing those, you can see what\ndifferences there are from just the saving.\n\nFinally, find the differences between files 2 and 3, and ignore those\ndifferences that can be tracked back to excel save vs poi save. Hopefully that\nwill leave you with only one or two differences, which are your needles. Once we\nknow what those records are, we can work to fix.\n\nAnyone affected by this issue fancy spending an hour or two hunting down the needle?", "attachment_id": null, "bug_id": 30978, "id": 113746, "time": "2008-02-14T07:03:39Z", "creator": "apache@gagravarr.org", "creation_time": "2008-02-14T07:03:39Z", "is_private": false}, {"count": 17, "tags": [], "creator": "phamlen@mail.com", "attachment_id": null, "is_private": false, "id": 117590, "time": "2008-06-11T17:54:39Z", "bug_id": 30978, "creation_time": "2008-06-11T17:54:39Z", "text": "I have some additional information that may help some people with a workaround.\n\nI'm still working on generating a neat and tidy testcase but, in the meantime, here's what I know:\n\n1)  I have a spreadsheet generated with Excel 2003 on a Windows XP machine.  It contains a total of 19 sheets.  \n\n2)  I read in the 19 sheets and try to delete 12 of them.\n\n3)  I experience the \"corrupted workbook\" error whenever I delete the 9th sheet - REGARDLESS of which sheet it is.  In other words, I can delete any 8 sheets but if I delete the 9th, it breaks.\n\n4)  By adding an additional sheet to my workbook, my code then failed after deleting 10 worksheets.\n\n5)  I was able to delete all 12 of the worksheets I needed by simply adding extra blank worksheets at the end.\n\nTherefore, for people trying to solve this via a workaround, you might try adding additional blank worksheets (I also hide them using EXCEL so they don't display.)"}, {"count": 18, "tags": [], "creator": "zalewski@optonline.net", "attachment_id": null, "id": 117672, "time": "2008-06-13T12:21:15Z", "bug_id": 30978, "creation_time": "2008-06-13T12:21:15Z", "is_private": false, "text": "I was looking at the BIFF dumps of some of these files that don't open after sheet deletion.\n\nI noticed what may be the problem.\n\nIf you have defined a print area when a sheet is printed, Excel remembers the dimensions of the print area in a NAME record. The NAME record has a 0 based index to the sheet where the area is located. Of course, if you delete a sheet, these indexes must be adjusted for any NAME record referring to a sheet after (with a higher index than) the sheet which was deleted. Apparently, POI does not make this adjustment.\n\nSo for example, the second attachment to this report shows the BIFF dump for a corrupted file. The file has 5 sheets, so the valid sheet indexes are 0 .. 4\n\nThere are 4 NAME records, with sheet indexes 1, 2, 4 and 6. The last one is the culprit (I believe)\n\nIn the case of the fourth attachment, the file result.xls shows 2 sheets named 'Page 1' and 'Page 3'. So the valid sheet indexes would be 0 or 1\n\nThere is 1 NAME record with a sheet index of 3."}, {"count": 19, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "text": "(In reply to comment #18)\n> So for example, the second attachment to this report shows the BIFF dump for a\n> corrupted file. The file has 5 sheets, so the valid sheet indexes are 0 .. 4\n\nNamedRanges are slightly special though - they reference ExternalSheetIndex not the normal Sheet index/order. These ExternalSheetIndexes are allowed to point to sheets that no longer exist\n\nIf you create a named range pointing at a sheet, then delete that sheet, excel is quite happy to keep that named range. It will have \"#REF\" for the sheet part, but otherwise be all there\n\nTake a look at src/testcases/org/apache/poi/hssf/data/30978-deleted.xls - this has a named range pointing to a deleted sheet, created by excel\n\nSo, I think this isn't necesserily the problem", "id": 117719, "time": "2008-06-16T06:26:21Z", "bug_id": 30978, "creation_time": "2008-06-16T06:26:21Z", "is_private": false}, {"count": 20, "tags": [], "text": "(In reply to comment #19)\nThat's not what I see\n\nThe *formula* for the named range might refer to deleted sheets. But the *sheet index* field of the BIFF (a short integer at offset 8-9), I believe, must refer to an existing sheet.\n\nWhen I look at 30978-deleted.xls, I find three NAME records, for user defined ranges \"OnOne\", \"On2\" and \"OnThree\". Apparently \"On2\" refers to the deleted Sheet2 somehow. I think the 'formula' part of the NAME record still refers to the deleted sheet. But the Sheet Index field of the record has been adjusted.\n\nAll three NAME records in 30978-deleted.xls have a Sheet Index of 0. Since there are two sheets in the workbook, the allowed range for the sheet index value should be 0..1, and these NAME records meet that criterion.\n\nI believe, to fix this bug, the 'sheet index' field of all NAME records must be appropriately adjusted, and NAME records which belong to a sheet which is deleted must also be removed.\n\nSide Note: Even if you do this, deleting a sheet with a macro will still not work, because there is yet another structure that exposes sheet names as property names to the macro object 'ThisWorkbook'. Macros are not involved in this bug, but the presence of macros will cause deleteSheet() to corrupt the workbook.(In reply to comment #19)\n", "is_private": false, "bug_id": 30978, "id": 117735, "time": "2008-06-16T12:03:08Z", "creator": "zalewski@optonline.net", "creation_time": "2008-06-16T12:03:08Z", "attachment_id": null}, {"count": 21, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "id": 117786, "time": "2008-06-18T04:39:56Z", "bug_id": 30978, "creation_time": "2008-06-18T04:39:56Z", "is_private": false, "text": "Ah, done some more digging and I see what you mean about the sheet index. It can be zero (my test file only had zero), but if it's non-zero then it's a 1-based index to the sheet\n\nI've committed a patch to POI to fix up the 1-based sheet indexes as needed when deleting the sheet. However, excel still gives an error about names when opening\n\nI think the issue is down to us changing the Ptg when we write the name out. There's a disabled test in svn (usermodel/TestBugs.java#BROKENtest30978)\n\nJosh - any ideas why the Ptg is being changed?"}, {"count": 22, "tags": [], "bug_id": 30978, "attachment_id": null, "text": "Fixed in svn r669809\n\nPtg class hierarchy needed adjustment for DeletedRef3DPtg and DeletedArea3DPtg.  These are not true sub-classes of Ref3DPtg and Area3DPtg.  Similar to the fix for bug 45091.", "id": 117848, "time": "2008-06-20T00:26:40Z", "creator": "josh@apache.org", "creation_time": "2008-06-20T00:26:40Z", "is_private": false}, {"count": 23, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "id": 117854, "time": "2008-06-20T02:34:08Z", "bug_id": 30978, "creation_time": "2008-06-20T02:34:08Z", "is_private": false, "text": "To confirm - I have re-run the test from Matt Hill (attachment 20149) now that Josh's fix is in. Excel 2003 has no issues when opening the output result.xls, so it looks like we've finally got this one fixed :)"}]