[{"count": 0, "tags": [], "creator": "narliss@gmail.com", "is_private": false, "text": "This is a duplicate of 31266 because I didn't know how to log a bug against\nTomcat 3 and 5.5.\n\nAccording to RFC 2109, when sending cookies to the origin server, $Path and\n$Domain are optional attributes for the cookie header. The\nRequestUtil.parseCookieHeader method does not account for these optional\nparameters and could lead to an Illegal Argument Exception being thrown from\njavax.servlet.http.Cookie.\n\nThe parseCookieHeader method currently tokenizes the cookie header using the ';'\nas a delimeter. All name=value pairs are used to create new\njavax.servlet.http.Cookie objects. According to javax.servlet.http.Cookie: \n\n\"The name must conform to RFC 2109. That means it can contain only ASCII\nalphanumeric characters and cannot contain commas, semicolons, or white space or\nbegin with a $ character\"\n\nParseCookieHeader should look for the pat and domain keywords for each token and\nif found, their values should be added to the last cookie object created using\nthe setDomain and setPath cookie methods.", "id": 63674, "time": "2004-09-16T17:57:52Z", "bug_id": 31267, "creation_time": "2004-09-16T17:57:52Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Changing component.  This is for the attention of the Servlet Specification \nExpert Group first.  If I were you, I wouldn't hold my breath for a fix.", "is_private": false, "id": 63737, "creator": "yoavs@computer.org", "time": "2004-09-17T15:38:18Z", "bug_id": 31267, "creation_time": "2004-09-17T15:38:18Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 31267, "attachment_id": null, "is_private": false, "id": 63743, "time": "2004-09-17T16:07:32Z", "creator": "jfarcand@apache.org", "creation_time": "2004-09-17T16:07:32Z", "text": "I did forward the email to the spec lead. Will update the bug as soon as I get\nfeedback.\n\nThanks\n\n-- Jeanfrancois"}, {"attachment_id": null, "tags": [], "bug_id": 31267, "is_private": false, "count": 3, "id": 65912, "time": "2004-10-28T16:04:36Z", "creator": "yoavs@computer.org", "creation_time": "2004-10-28T16:04:36Z", "text": "More than a month has passed: any updates?"}, {"count": 4, "tags": [], "creator": "yoavs@computer.org", "is_private": false, "text": "Please note that (as of Tomcat 5.0.29 and 5.5.4), even though the \nparseCookieHeader method may be deficient as you describe, it's not used \nanywhere except the WARP connector which has long been deprecated and \nunsupported.\n\nThe relevant code is now in org.apache.tomcat.util.http.Cookies, part of the \njakarta-tomcat-connectors CVS module.  Upon cursory inspection, it seems to \nhandle the $ as a special character approrpiately, and be generally compliant \nwith RFC2109.  So I'm closing this issue.\n\nIf you'd like to evaluate the util.http.Cookies class, please go ahead -- \nthat'd be great.  If you then find a place where it doesn't handle RFC2109 \nwell, feel free to reopen this issue with specific information.  Thank you.", "id": 67363, "time": "2004-11-22T22:42:26Z", "bug_id": 31267, "creation_time": "2004-11-22T22:42:26Z", "attachment_id": null}]