[{"count": 0, "tags": [], "bug_id": 3134, "is_private": false, "id": 4579, "attachment_id": null, "creator": "tkamiya@iona.com", "creation_time": "2001-08-15T11:57:18Z", "time": "2001-08-15T11:57:18Z", "text": "Hi,\n\nWhen TraverseSchema class tries to resolve the location of the imported\nschema give a relative URI, it first calls user-supplied resolver with\nthe relative URI. Instead, it should first expand it relative to the\nlocation of the importing schema (if that piece of information is available).\nOtherwise, user's resolver would be puzzled what to do with the relative\nURI.\n\nThe following is the suggested change in TraverseSchema.java.\n\n    private Element openImportedSchema(String location) throws Exception {\n        // expand it before passing it to the parser\n        InputSource source = null;\n        location = expandSystemId(location, fCurrentSchemaURL); // tkamiya 2001-\n08-15\n        if (fEntityResolver != null) {\n            source = fEntityResolver.resolveEntity(\"\", location);\n        }\n        if (source == null) {\n//            location = expandSystemId(location, fCurrentSchemaURL);\n            source = new InputSource(location);\n        }\n        ....\n\n-Takuki Kamiya"}, {"count": 1, "tags": [], "text": "The issue appears to apply to the cases of \"include\" and \"redefine\".\n", "is_private": false, "id": 4582, "creator": "tkamiya@iona.com", "time": "2001-08-15T12:34:07Z", "bug_id": 3134, "creation_time": "2001-08-15T12:34:07Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "neilg@ca.ibm.com", "text": "Hi Takuki,\n\nThere's no doubt that Xerces1's entity resolution is not optimal.  But I don't \nthink the change you propose here would be a generally good idea.  \n\nThe main reason for this is this:  If Xerces hands your application a relative \nURI, your application can make it absolute if it so chooses.  But if Xerces \nmakes a mistake while building an absolute URI, there's no way for you \napplication to figure out where things went wrong.  \n\nIf you look at the code in TraverseSchema that you propose to call, it expands \nthe URI relative to the Java property user.dir.  There's no reason why this \nshould in general correspond to the directory relative to which the path was \nintended to be; nor is there anything precluding your EntityResolver from doing \nthe same thing.  \n\nMy suggestion is that, if you want this behaviour, simply copy the relevant \nXerces methods into your own EntityResolver and absolutize the URI that Xerces \npasses you accordingly.  \n\nCheers,\nNeil", "id": 4699, "time": "2001-08-21T12:09:39Z", "bug_id": 3134, "creation_time": "2001-08-21T12:09:39Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 3134, "attachment_id": null, "is_private": false, "id": 4965, "time": "2001-08-28T10:30:37Z", "creator": "tkamiya@iona.com", "creation_time": "2001-08-28T10:30:37Z", "text": "Hi Neil,\n\nThe issue in my use case is the fact that there's only single EntityResolver\nyou can supply to the whole process of parsing/validating.\n\nI have a class which wraps around the parser and the class provides\nits own EntityResolver for resolving schemas to the parser. The user\nof the class registers its EntityResolver to the class thus the EntityResolver\nof the class essentially works as an intermediary between the parser and the\nuser's EntityResolver. The intermediary gets somewhat puzzled if it gets\nrelative paths because it wonders if it should try to resolve them or let\nthe user's EntityResolver do it especially. If the presented systemId is\nabsolute rather than relative, it would help. However, the first attempt to\nmake it absolute should not fallback to the current working directory; it\nshould be the very last resort.\n\n-takuki\n"}, {"count": 4, "attachment_id": null, "bug_id": 3134, "text": "Doesn't this line (from the javadocs of org.xml.sax.EntityResolver) imply that \nURL:s should be absolute?\n\n  \"If the system identifier is a URL, the SAX parser must resolve it fully \nbefore reporting it to the application.\"\n\nMay be me misunderstanding the word \"resolve\", though.\n\n", "id": 7103, "time": "2001-10-24T08:28:47Z", "creator": "mkm@update.uu.se", "creation_time": "2001-10-24T08:28:47Z", "tags": [], "is_private": false}]