[{"count": 0, "tags": [], "bug_id": 31372, "text": "Line 813  Session session = getSession(request, false);\nSecond parameter should be set to true so that we create a session if it \ndoesn't already exist.  I have to authenticate twice in order because the \nfirst page hit doesn't create a session before this method is called with \nCertificate based authentication for some reason.  The second page hit returns \nthe session normally.", "id": 64066, "time": "2004-09-22T20:25:22Z", "creator": "mbucknam@netzero.com", "creation_time": "2004-09-22T20:25:22Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 65804, "time": "2004-10-27T08:14:49Z", "bug_id": 31372, "creation_time": "2004-10-27T08:14:49Z", "text": "I don't quite see how you can \"authenticate twice\" with client cert. Your cert\nwill be processed automatically for each SSL connection you make to the server.\nPlease clarify what the problem is.\n\nThe proposed fix is not acceptable, BTW."}, {"count": 2, "tags": [], "creator": "mbucknam@netzero.com", "attachment_id": null, "is_private": false, "id": 65814, "time": "2004-10-27T10:49:49Z", "bug_id": 31372, "creation_time": "2004-10-27T10:49:49Z", "text": "Try to log user access to the site with Cert-based authentication.  Since \nthere is no \"login\" gateway through which all entry is routed, the next \nlogical thing to do is put a token in session upon first hitting the site, log \nentry, and check for the token on future requests so you know the user's entry \nhas already been logged.  I am trying this approach using a servlet filter.  \nUsing that model, you get two entry logs for each user because it logs once on \nthe first page hit where a session has not yet been created by the container \nand is NOT created in the line of code I pointed out and again on the second \npage hit after the container has created a session and it is returned in the \nline of code I pointed out.  All subsequent page hits work as well since the \nsession has already been created.  Other calls to getSession() in the same \nclass use the method that creates a session so I am not clear on why that \nwould be a problem.\n\nIf the proposed fix is not acceptable then some other fix is necessary because \nobviously there is a problem if it takes two initial \"container hits\" to get a \nsession in AuthenticatorBase.register method using certificate-based \nauthentication.  Maybe the container needs to create the user's session \nearlier in the flow?  I don't know."}, {"count": 3, "tags": [], "bug_id": 31372, "is_private": false, "text": "I still do not understand what the problem is, sorry. Please do not reopen the\nbug report.", "id": 65815, "time": "2004-10-27T11:06:31Z", "creator": "remm@apache.org", "creation_time": "2004-10-27T11:06:31Z", "attachment_id": null}]