[{"count": 0, "tags": [], "bug_id": 31386, "attachment_id": null, "id": 64108, "time": "2004-09-23T14:02:08Z", "creator": "bazu@email.it", "creation_time": "2004-09-23T14:02:08Z", "is_private": false, "text": "Hi, I'm interested in DataGrid project because I (daily) use similar approach\nfor data browsing in my projects. Before DataGrid I used the pager taglib:\nhttp://jsptags.com/tags/navigation/pager/pager-taglib-2.0.html but I'm looking\nfor a more powerful and quick tool. \nI use the data windows concept. If a query returns a lot of (for example more\nthan 10000 )  database rows (objects) I'm used to executing 2 queries: the first\none is the real query with the count statement (SELECT count(*) an num FROM foo\nWHERE bla=xxx) with this one I get the total number of affected rows. Whith the\nsecond one i get only a subset of records for example the third page (using the\nLIMIT statement with the same FROM and WHERE statements).\nSo after an Action (for example) I have a int number (the set's cardinality) and\na Collection (only the objects that need to be displayed). Actually i use the\nint nuber to initialize the pager and the Collection to display data.\nI'm wondering if is it possible to integrate this concept in datagrid tag, for\nexaple by adding an additional attribute \"count\" in which set the \"global\"\ncardinality used by the tag to render the pager... if it's setted the tag should\n not consider the size of the collection in \"items\" attribute and display all\nobject in the collection.\n\nSorry for my English an sorry if I post this request in a wrong place (in this\ncase plz tell me where).\n\nBye"}, {"count": 1, "tags": [], "bug_id": 31386, "attachment_id": null, "id": 64126, "time": "2004-09-23T20:06:08Z", "creator": "nestor.boscan@tcs.com.ve", "creation_time": "2004-09-23T20:06:08Z", "is_private": false, "text": "Hi\n\nThe DataGrid tag supports the data windows concept. To do this you must send \nthe data subset to the datagrid \"items\" attribute and set the \"custom\" \nattribute to \"true\" in the paging element:\n\n<paging size=\"20\" custom=\"true\" nextUrlVar=\"next\" previousUrlVar=\"previous\"/>\n\nThe size defines the window size. The datagrid knows when the window has ended \nwhen the size of the subset data is below the window size. This is a better \nway to do it than using a count query because between the count and the subset \nquery someone may have inserted a new row. "}, {"count": 2, "attachment_id": null, "creator": "nagoya@felipeal.net", "is_private": false, "id": 64127, "time": "2004-09-23T20:09:01Z", "bug_id": 31386, "creation_time": "2004-09-23T20:09:01Z", "tags": [], "text": "Nestor,\n\nIf this bug didn't require any change in the code, please mark it as invalid.\n\n-- Felipe"}, {"count": 3, "attachment_id": null, "bug_id": 31386, "text": "Bug invalid", "id": 64128, "time": "2004-09-23T20:17:34Z", "creator": "nestor.boscan@tcs.com.ve", "creation_time": "2004-09-23T20:17:34Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 31386, "text": "Invalid bug. No code change required.", "id": 64130, "time": "2004-09-23T20:27:15Z", "creator": "nestor.boscan@tcs.com.ve", "creation_time": "2004-09-23T20:27:15Z", "is_private": false, "attachment_id": null}]