[{"count": 0, "tags": [], "creator": "andrew.r.bredhauer@transport.qld.gov.au", "attachment_id": null, "text": "I've created a Test plan that uses a regex post processor to extract the \nsession id from the response headers of the first request so it can be sent in \nsubsequent posts. The regex post processor gives the option to search the \nresponse body or headers but doesn't appear to save this setting as on every \nload of the test plan I have to reselect the headers option. \nThis behaviour is annoying to say the least and I'm wondering how it will \nbehave under remote testing. We're using JDK1.4.1_02\n\nAndrew", "id": 64386, "time": "2004-09-30T06:16:23Z", "bug_id": 31479, "creation_time": "2004-09-30T06:16:23Z", "is_private": false}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "is_private": false, "id": 64400, "time": "2004-09-30T11:04:01Z", "bug_id": 31479, "creation_time": "2004-09-30T11:04:01Z", "text": "1) the post-processor should be a child of the sampler to which it applies,\notherwise it will be applied to all the samplers at the same level\n\n2) regexes only return what you tell them to - make sure you enclose some or all\nof the regex in parentheses. e.g. \n\n.*\n\nwill match everything, but return nothing\n\n(.*)\n\nwill match and return everything.\n\nPlease try this and if it still does not work, add a sample test plan to this\nissue as an attachment"}, {"count": 2, "tags": [], "creator": "andrew.r.bredhauer@transport.qld.gov.au", "attachment_id": 12916, "text": "Created attachment 12916\nSimple Test plan to demonstrate problem", "id": 64464, "time": "2004-09-30T22:42:38Z", "bug_id": 31479, "creation_time": "2004-09-30T22:42:38Z", "is_private": false}, {"count": 3, "tags": [], "text": "Sebb,\n\nThe problem is not in the pattern matching but in the gui behaviour of the \npost processor. On screen I'm given the option to select eith body of header \nfor the post processor to search. I need to select header but when I move off \nthe post processor and move back to it my selection is lost and it defaults to \nsearch body. Even if I select header and save the test plan next time I re \nopen it body will be selected.\nI've attached a very simple test plan that you can hopefully use to see the \nproblem. The test plan probably doesn't even run but this isn't required to \nshow the error.\n\nAndrew\n", "is_private": false, "bug_id": 31479, "id": 64465, "time": "2004-09-30T22:43:09Z", "creator": "andrew.r.bredhauer@transport.qld.gov.au", "creation_time": "2004-09-30T22:43:09Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 31479, "attachment_id": null, "id": 64466, "time": "2004-09-30T22:58:51Z", "creator": "sebb@apache.org", "creation_time": "2004-09-30T22:58:51Z", "is_private": false, "text": "Sorry, my previous reply was not relevant - I posted the reply in the wrong\nplace ...\n\n==\n\nThe loss of the header/body setting is a known bug, fixed in CVS after 2.0.1 was\nreleased.\n\nIf you don't want to wait for the next release, you could perhaps try one of the\nnightly builds (linked from JMeter home page).\n\nBTW, remote testing is not very performant compared with non-GUI mode. There\nhave been several discussions of this on the User list.\n\n*** This bug has been marked as a duplicate of 29853 ***"}]