[{"count": 0, "tags": [], "creator": "wburrows@e2open.com", "attachment_id": null, "is_private": false, "id": 64441, "time": "2004-09-30T15:40:41Z", "bug_id": 31492, "creation_time": "2004-09-30T15:40:41Z", "text": "Slide doesn't accept an empty value for the definition of the checkin-fork and \ncheckout-fork elements to indicate they are enabled. These features are \nsupported though and do work when they are turned on. The versioningHelper has \na bug processing the empty string value for these elements which causes an \nexception. Finally, the DB2RDBMSAdapter's revison number comparator generates \na \"number format\" exception when trying to translate revision numbers with more \nthan two places eg. 1.2.1. I've attached patch files to fix these problems."}, {"count": 1, "tags": [], "creator": "wburrows@e2open.com", "is_private": false, "text": "Created attachment 12907\nPatch file containing individual patches for 3 files", "id": 64442, "time": "2004-09-30T15:43:53Z", "bug_id": 31492, "creation_time": "2004-09-30T15:43:53Z", "attachment_id": 12907}, {"count": 2, "tags": [], "creator": "luetzkendorf@apache.org", "attachment_id": null, "is_private": false, "id": 64470, "time": "2004-10-01T08:11:41Z", "bug_id": 31492, "creation_time": "2004-10-01T08:11:41Z", "text": "Hi Warwick,\ncould you describe a scenario to reproduce the wrong behavior.\nSo we could write a testcase and verify the fix. \nThanks, Stefan"}, {"count": 3, "tags": [], "creator": "wburrows@e2open.com", "attachment_id": null, "text": "Test scenarios to reproduce the problems:\n\nA. To check that the empty string correctly enables the checkout-fork and \ncheckin-fork features you should attempt to set the <checkin-fork> and \n<checkout-fork> values in the Domain.xml file to an empty value which is a \nvalid value for these parameters and enables you to fork a revision when you \ncheckout/in. eg. set the values to be <checkin-fork/> and <checkout-fork/>. In \nthe case of this bug the result is that they will be set to \"forbidden\" since \nthe empty value isn't recognized. You will find that you can't checkout a \nrevision other than the latest on the main branch. To verify this put a file \nunder version control (v1.0) and checkin a second revision for the file (v1.1). \nUse the UPDATE method to \"choose\" the earlier revision (eg. 1.0) as the active \nrevision on the main branch. When you click on the link for the file now it \nshould resolve to the content in the first revision of the file you checked in. \nNow try to check the file out with CHECKOUT and do not pass any flags to \nattempt to override the \"checkout-fork\" setting since you don't need them if \ncheckout-fork is set to the empty string. If checkout-fork is incorrectly set \nto \"forbidden\" or \"discouraged\" then the checkout will fail and the XML result \nwill include an error element that signifies which error, forbidden or \ndiscouraged, it was. But if the empty string was correctly parsed and checkout-\nfork is set to the empty value (to signify that forking is permitted on \ncheckout) then the checkout will succeed and a new branch will be created for \nthe file based on the currently selected version. eg. 1.0.1. Then checkin the \nfile with CHECKIN. If checkin-fork is set to the empty string it will allow you \nto check the file in otherwise it will return with a similar error element to \nthat returned by the CHECKOUT when it fails.\n\nB. To check that the DB2RDBMSAdapter class does not generate an exception for \nrevision numbers of the format x.y.z you simply need to attempt to create \nanother revision for the file created in A above. The bug is that the code only \ndeals with revision numbers in the format x.y and relies on the fact that there \nis nothing after y. It will generate a number format exception for anything in \nthe revision string after the \".y\" in the event that this bug is not fixed. So \nfor the above file with revision 1.0.1 then it will generate a number format \nexception. But if its fixed then creating another revision will succeed and the \nrevision number should then be 1.0.2.\n", "id": 64481, "time": "2004-10-01T15:55:23Z", "bug_id": 31492, "creation_time": "2004-10-01T15:55:23Z", "is_private": false}, {"count": 4, "tags": [], "text": "BTW, scenario A assumes the DB2 JDBC configuration. I wasn't confident that the \nfix I made for DB2 was automatically applicable to the other DB configurations \nalthough the statements they use look similar.\n", "is_private": false, "bug_id": 31492, "id": 64482, "time": "2004-10-01T15:57:32Z", "creator": "wburrows@e2open.com", "creation_time": "2004-10-01T15:57:32Z", "attachment_id": null}, {"count": 5, "attachment_id": null, "creator": "wburrows@e2open.com", "is_private": false, "id": 64483, "time": "2004-10-01T15:58:48Z", "bug_id": 31492, "creation_time": "2004-10-01T15:58:48Z", "tags": [], "text": "sorry. that should be \"scenario B assumes\" in the last comment..."}, {"count": 6, "tags": [], "creator": "luetzkendorf@apache.org", "attachment_id": null, "text": "patches applied", "id": 64840, "time": "2004-10-08T16:39:26Z", "bug_id": 31492, "creation_time": "2004-10-08T16:39:26Z", "is_private": false}]