[{"count": 0, "tags": [], "creator": "gab@ector.elte.hu", "attachment_id": null, "is_private": false, "id": 64431, "time": "2004-09-30T14:59:26Z", "bug_id": 31490, "creation_time": "2004-09-30T14:59:26Z", "text": "using a reverse proxy to an ftp server the rendering of received directory\nlistings are useless for files with spaces (' ') in their names. the entry\nfor a file named \"long filename.txt\" becomes\nlong &lt;a href=\"filename.txt\"&gt;filename.txt&lt;/a&gt;\nin the output.\ni think it's because vars searchidx and firstfile in ap_proxy_send_dir_filter()\nget initialized at every cycle of the loop which they shouldn't. i made them\nboth static and it fixes but haven't checked if doing so leads to some memory\nleaking or else.\n\nGabor"}, {"count": 1, "tags": [], "creator": "rahul.g.nair@gmail.com", "attachment_id": 20727, "text": "Created attachment 20727\nRework the parsing logic of LIST command\n\nThe original logic using firstfile and searchidx does not work, I have\nreworked the logic to start the parsing of each line from beginning rather\nthan the end as done now. The parsing is done such that if we do not detect\nthat it is NT listing, we fall back to Unix ls -l listing format. But this\nneed not be the case (though it will be so for a vast majority of cases.)\n\nThe solution for that would be to send a SYST command at the starting of\nconnection or let user specify the back end server type in the case of a\nreverse proxy setup, and use that to figure out the LIST format.\nThis will be easier once the mod_proxy_ftp.c is re factored(41676).", "id": 107395, "time": "2007-08-29T07:52:49Z", "bug_id": 31490, "creation_time": "2007-08-29T07:52:49Z", "is_private": false}, {"count": 2, "text": "Please do NOT change the assignment of bugs. This cuts off the\nbugs@httpd.apache.org mailing list from change notifications.", "creator": "rpluem@apache.org", "is_private": false, "id": 107417, "time": "2007-08-29T12:09:11Z", "bug_id": 31490, "creation_time": "2007-08-29T12:09:11Z", "tags": [], "attachment_id": null}]