[{"count": 0, "tags": [], "text": "Macrodef can contain only \"tasks\" (as described in \"sequential\" doc) \nIt would be useful to be able to use macrodef to include whole \"target\" in macro\ndefinition. \n\nSteps to reproduce:\n1. Create build.xml with defined macrodef containing \"target\" element\n\n2. Use the defined macrodef somewhere (outside of any other \"target\" element)\n\n3. Run the build and observe the following message returned by Ant:\n\nCould not create task or type of type: target. Ant could not find the task or a\nclass this task relies upon. \nThis is common and has a number of causes; the usual solutions are to read the\nmanual pages then download and install needed JAR files, or fix the build file: \n- You have misspelt 'target'. Fix: check your spelling. \n- The task needs an external JAR file to execute and this is not found at the\nright place in the classpath. Fix: check the documentation for dependencies.\nFix: declare the task. \n- The task is an Ant optional task and the JAR file and/or libraries\nimplementing the functionality were not found at the time you yourself built\nyour installation of Ant from the Ant sources. Fix: Look in the ANT_HOME/lib for\nthe 'ant-' JAR corresponding to the task and make sure it contains more than\nmerely a META-INF/MANIFEST.MF. If all it contains is the manifest, then rebuild\nAnt with the needed libraries present in ${ant.home}/lib/optional/ , or\nalternatively, download a pre-built release version from apache.org \n- The build file was written for a later version of Ant Fix: upgrade to at least\nthe latest release version of Ant \n- The task is not an Ant core or optional task and needs to be declared using\n<taskdef>. \n- You are attempting to use a task defined using <presetdef> or <macrodef> but\nhave spelt wrong or not defined it at the point of use Remember that for JAR\nfiles to be visible to Ant tasks implemented in ANT_HOME/lib, the files must be\nin the same directory or on the classpath Please neither file bug reports on\nthis problem, nor email the Ant mailing lists, until all of these causes have\nbeen explored, as this is not an Ant bug.", "attachment_id": null, "bug_id": 31611, "id": 64864, "time": "2004-10-09T11:53:31Z", "creator": "thealx@poczta.onet.pl", "creation_time": "2004-10-09T11:53:31Z", "is_private": false}, {"count": 1, "tags": [], "text": "How would it be useful?\nI do not think that this is possible.", "attachment_id": null, "bug_id": 31611, "id": 64914, "time": "2004-10-11T08:47:19Z", "creator": "peterreilly@apache.org", "creation_time": "2004-10-11T08:47:19Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 31611, "attachment_id": null, "id": 64923, "time": "2004-10-11T10:39:54Z", "creator": "j_a_fernandez@yahoo.com", "creation_time": "2004-10-11T10:39:54Z", "is_private": false, "text": "I think we need a tutorial to teach people how to use what we have.\nWe still get people confusing the very two different concepts of targets and \ntasks. \n\nIf what the user wants is to be able to template targets, then a tutorial we \nshould direct him towards the facilities of imports and target overriding.\n"}, {"count": 3, "tags": [], "bug_id": 31611, "attachment_id": null, "id": 67250, "time": "2004-11-19T18:54:11Z", "creator": "mbenson@apache.org", "creation_time": "2004-11-19T18:54:11Z", "is_private": false, "text": "Agreed; the request doesn't really make sense in the context of a working \nknowledge of how to use Ant."}]