[{"count": 0, "tags": [], "creator": "phex100@aon.at", "text": "I created the following sequence of collections on\nxmldb:xindice://localhost:8080/db using apache tomcat 5.5:\ngridminer\ngridminer/001projectname\ngridminer/001projectname/001workflowname\ngridminer/001projectname/001workflowname/dt\n\nthen i added a document to the collection\ngridminer/001projectname/001workflowname/dt and it worked fine. the document was\nin the collection and i could query it. the rootcollections of dt like\ngridminer, 001projectname and 001workflowname had no documents in it. then i\nshut down the tomcat server and restarted it. after querying xindice i realized\nthat now only the gridminer collection was there. all other subcollections like\n\"001projectname\" I could not query because they were not found! then i created\nthe above collections again and added in each collection a document, shut down\nthe server, restarted tomcat and all collections could be found. \n\nit seems that I need to add a document in each collection to make it´s\nsubcollections persistent eles i loose the documents of the subcollection if one\nroot collection has no documents in it. and this only if the server is shut down\nand restarted! if the server is never shut down or never crachs, there is no\nproblem with that. but it can be a nasty thing if it happens. :(", "id": 64888, "time": "2004-10-10T21:04:38Z", "bug_id": 31622, "creation_time": "2004-10-10T21:04:38Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 31622, "is_private": false, "text": "What xindice version do you use?\nHave you tried the same with current CVS head?", "id": 66134, "time": "2004-10-29T18:50:51Z", "creator": "vgritsenko@apache.org", "creation_time": "2004-10-29T18:50:51Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 31622, "is_private": false, "text": "> We are using the version 1.1b4 of xindice for the tomcat (5.017 and 5.5) \n> server.\n\nThis issue has been fixed in the CVS.\n\n*** This bug has been marked as a duplicate of 28783 ***", "id": 66163, "time": "2004-10-30T13:28:14Z", "creator": "vgritsenko@apache.org", "creation_time": "2004-10-30T13:28:14Z", "attachment_id": null}]