[{"count": 0, "tags": [], "bug_id": 31654, "is_private": false, "id": 64947, "creation_time": "2004-10-11T19:36:16Z", "time": "2004-10-11T19:36:16Z", "creator": "tmotley@gmail.com", "text": "The Perforce version control system lets users interface with its repository\nusing a client specification, or \"client spec\".  Each client spec is\nconfigurable for a project, and is useful in separating out change lists, file\ncheckout locations, etc for different projects a user may be working on.\n\nAnt ships with a P4 Task that allows users to build ant projects that can\ninteract with their Perforce server.  Each P4 task has the following properties:\n\n1) port - P4PORT The p4d server and port to connect to\n2) client - P4CLIENT The p4 client spec to use\n3) user - P4USER The p4 username\n4) view - The client, branch or label view to operate upon. \n\n\nItem 2 (the Client property) appears to be ingored by the Task.  In all my\nprojects, this value always defaults to the default Client for my Perforce\ninstance.  I have debugged this and seen that I am passing the correct Client\nname in to the Task's Client attribute, but it is always ignored in favor of the\n default Client.  To get my P4 Tasks to work I have to change the default Client\nin Perforce to be the one I want to operate on.", "attachment_id": null}, {"count": 1, "tags": [], "text": "the documentation says that if you do this :\n<property name=\"p4.client\" value=\"nightlybuild\"/>\nthen you are going to use the nightlybuild Perforce client instead of your\ndefault one.\nDoes this not work for you ?", "attachment_id": null, "bug_id": 31654, "id": 64966, "time": "2004-10-12T06:02:16Z", "creator": "antoine@apache.org", "creation_time": "2004-10-12T06:02:16Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 31654, "is_private": false, "id": 72227, "time": "2005-03-11T19:35:13Z", "creator": "antoine@apache.org", "creation_time": "2005-03-11T19:35:13Z", "tags": [], "text": "Since the reporter did not show up, I guess the issue is solved."}]