[{"count": 0, "attachment_id": null, "bug_id": 31691, "text": "The bug noted is as follows:\nTesting done using 2 test plans. Both test plans are essentially same with \ndifference in the Headers Stored in the Header Manager. Test plan 1 has name-\nvalue pairs as (A11,B11), (A12,B12). Test plan 2 has name-value pairs as \n(A11,B21), (A12,B12). Hence the difference is only for the value corresponding \nto name - \"A11\". First test plan 1 is loaded. Test plan 1 shows A11,B11 when \nloaded. Now test plan 2 is loaded. Test plan 2 still shows A11,B11 when loaded, \ninstead of A11,B12. \nHowever if JMeter is closed after loading test plan 1 and then re-started and \nthen test plan 2 is loaded the correct name-value pairs are reflected as \navaiable in the test plan.\nNote : Make sure that the value for A11 is quite long such that you need to \nclick the cell to view the end of string.\nAlso observed, in test plan 1 after checking value for A11 if the value for A12 \nis clicked and then test plan 2 is loaded then the correct values for A11 is \nloaded. This essentially means when the focus is on the cell, the cell value is \nnot being refreshed.", "id": 65041, "time": "2004-10-13T09:09:36Z", "creator": "sudip.subs@gmail.com", "creation_time": "2004-10-13T09:09:36Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 65106, "time": "2004-10-14T00:56:03Z", "bug_id": 31691, "creation_time": "2004-10-14T00:56:03Z", "is_private": false, "text": "Since there is a work-round (restart JMeter) reducing severity to Normal.\n\nDiscovered another bug: when another Header Manager is added, under some\ncircumstances the Delete button is disabled, even though there are entries in\nthe table."}, {"count": 2, "attachment_id": null, "bug_id": 31691, "text": "1.9.1 is quite an old version of JMeter.\n\nI can't reproduce the problem with version 2.0.1 - nor indeed with 1.9.1.\n\nIf the problem still exists for you with 2.0.1, please can you post sample test\nplans?\n\n[The Delete button problem has now been fixed in CVS.]", "id": 66570, "time": "2004-11-07T01:10:54Z", "creator": "sebb@apache.org", "creation_time": "2004-11-07T01:10:54Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "text": "Assuming this has been solved. If not please re-open with test case.", "id": 68702, "time": "2004-12-19T03:35:38Z", "bug_id": 31691, "creation_time": "2004-12-19T03:35:38Z", "is_private": false, "attachment_id": null}]