[{"count": 0, "tags": [], "bug_id": 31780, "attachment_id": null, "id": 65322, "time": "2004-10-19T15:24:00Z", "creator": "vspa@mail.ru", "creation_time": "2004-10-19T15:24:00Z", "is_private": false, "text": "Hi, guys, \n\nThere is a problem popped up, which is kinda serious for our project.\n\nWe decided to move all our jsps into jsp documents (.jspx). Everything works \nfine, but output of such a page is not pretty printed html (as we would expect), \nbut one long line (no line breaks at all).\n\nAs result: it's absolutely not possible to debug pages (that's why I set \nseverity to major).\n\nWe've done some research, options like \"mappedfile\" and \"trimSpaces\" do not \nhelp, because former prints only static template text on the next line, but \nsurprisingly, we don't have a single static text in our pages (use Struts <bean:\nmessage>, so everything is dynamic).\n\nHow to reproduce the problem: in tomcat distribution go to jsp 2.0 examples \n(http://localhost:8080/jsp-examples/jsp2/jspx/basic.jspx), when you execute it \nand look at the source, you'll see that it wraps only by static text.\n\nIf you consider this as a bug to fix (which I hope will happen ;) I think, maybe \na new config option can be added to jasper section of web.xml of tomcat, where \nyou can specify whether you want to get pretty printed html as result of .jspx \nor just default behaviour with one line."}, {"count": 1, "tags": [], "bug_id": 31780, "is_private": false, "id": 65472, "creation_time": "2004-10-21T21:26:32Z", "time": "2004-10-21T21:26:32Z", "creator": "kin-man.chung@sun.com", "text": "The spec says in XML syntax, white spaces between tags must be ignored.  So this\nis at best an enchancement.  It may be possible to add an option to pretty print\nthe output, but that's a low priority task.\n\nYou can also insert a listener to do the pretty-printing.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 31780, "attachment_id": null, "id": 65490, "time": "2004-10-22T10:02:04Z", "creator": "vspa@mail.ru", "creation_time": "2004-10-22T10:02:04Z", "is_private": false, "text": "With your permission I changed it to an enchancement. Hope entire community \nwould benefit from it if it's implemented."}, {"count": 3, "tags": [], "bug_id": 31780, "is_private": false, "id": 67642, "attachment_id": null, "creator": "yoavs@computer.org", "creation_time": "2004-11-30T18:29:18Z", "time": "2004-11-30T18:29:18Z", "text": "Kin-Man: how would you insert a listener?  I'm just personally curious...\n\nOP: I don't think anyone feels like working on this at the moment, so the \nquickest way to get anything done is to post a patch yourself ;)"}, {"count": 4, "tags": [], "bug_id": 31780, "attachment_id": null, "is_private": false, "id": 69870, "time": "2005-01-20T15:56:41Z", "creator": "yoavs@computer.org", "creation_time": "2005-01-20T15:56:41Z", "text": "Not happening, I see."}, {"attachment_id": null, "tags": [], "bug_id": 31780, "is_private": false, "count": 5, "id": 70506, "time": "2005-02-04T18:32:47Z", "creator": "apache.bugzilla@klaus-rogall.de", "creation_time": "2005-02-04T18:32:47Z", "text": "I recently developed a servlet filter which does some beautifying of XML output\nproduced by a servler (e.g. the JSP servlet).\n\nThis filter may help reading xhtml code sent to the browser. As far as I see\nthis filter works fine, but it was not tested under production enviroments (yet!).\n\n\n"}]