[{"count": 0, "tags": [], "bug_id": 31870, "attachment_id": null, "text": "I'm reporting this bug for the string taglib, but I have a feeling the issue may be rampant through \ntaglibs other than standard, which seems to have done a better job.\n\nThere seem to be a number of problems with the source and release control for this project.\n\n (1) There are no source distributions available other than nightly builds. So the only way to recreate a \nparticular release, or even find the software it's based on, is to checkout from cvs. YOU SHOULD \nCREATE A SOURCE DISTRO TO GO WITH YOUR BINARY DISTROS, AND POST IT. Standard does this \nappropriately.\n\n (2) Even within cvs, you don't seem to have properly tagged the release. For instance, I see a tag \nstring-1-1_POSTRELEASE, but no string-1-1. I have no idea whether this is a tag for the 1.1 release, or \nsomething that came afterwards (\"post\") the release. YOU SHOULD CLEARLY TAG EACH SOURCE \nRELEASE WITHIN CVS.\n\n (3) But when I jump off the cliff and grab that unknown release tagged string-1-1_POSTRELEASE, it is \nnot buildable. It relies on several files at the root above it (common.xml, etc) which were not tagged \nwith the release. So while I can grab something off head that may work, I don't know what should have \nbeen used to build the release. ALL FILES NEEDED TO BUILD THE RELEASE SHOULD BE TAGGED/\nRELEASED WITH THE RELEASE.\n\nSorry for the shouting. I'm frustrated in trying to build your code. Please cleanup your release process.\n\n-jdb", "id": 65621, "time": "2004-10-24T23:22:45Z", "creator": "jberry@apache.org", "creation_time": "2004-10-24T23:22:45Z", "is_private": false}, {"count": 1, "tags": [], "text": "I want to clarify what has been fixed here, which relates to the summary of \nyour report <quote>Please cleanup your release process.</quote>; IMO, we have \ndone that.\n\nIt is extremely unfortunate that some (many) releases are missing the \ncorresponding source distros and I believe I can safely speak for the entire \nJakarta Taglibs team in saying we sincerely apologize for this significant \noversight.\n\nThe last release we've had was the RDC 1.0.0, for which you will find all of \nthe items you indicate in your report, a source distro which contains all \nbuild related artifacts (including the ones external to the taglib source per \nse), as well as a SVN tag rdc-100. I have also changed the build scripts so \nthe act of cutting a release produces a source distro in addition to the \nbinary one, so this should be less of an issue in the future. We will be very \ncareful regardless.\n", "attachment_id": null, "bug_id": 31870, "id": 80424, "time": "2005-09-24T18:52:31Z", "creator": "rahul@apache.org", "creation_time": "2005-09-24T18:52:31Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 31870, "is_private": false, "text": "Thanks...!", "id": 80426, "time": "2005-09-24T19:18:03Z", "creator": "jberry@apache.org", "creation_time": "2005-09-24T19:18:03Z", "attachment_id": null}]