[{"count": 0, "tags": [], "bug_id": 31969, "attachment_id": null, "text": "When the Mail task is used with the encoding set to \"auto\", it attempts to\ndetermine if MIME is available by calling Class.forName() on the\norg.apache.tools.ant.taskdefs.email.MimeMailer class.  If this succeeds, it\nassumes MIME mail is available and tries to use it.  However, the success of\nthis operation will depend on the presence of the Java verifier.  This code has\na \"catch (Throwable e)\".  When the verifier checks the MimeMailer class, it will\nalso check for the dependancy classes javax.mail.MessagingException and\njavax.activation.DataSource classes.  These will only be found if the mail.jar\nand activation.jar are on the classpath.  If they are not, a VerifyError is\nthrown and the catch clause will fire.  It will then default to the UU encoding,\nand the build will succeed, which is the correct behavior for the auto encoding.\n\nHowever, if the verifier is not being used in the VM, then the Class.forName()\nwill check for the existance of the MimeMail class, but not the\nMessagingException and DataSource classes.  If the mail.jar or activation.jar is\nmissing from the classpath, no error is thrown, the catch clause will not fire,\nand it will continue on its way assuming that it should use MIME.  Later, it\nwill fail with a NoClassDefFoundError on the MessagingException and DataSource\nclasses and the Ant build will fail.\n\nTo reproduce: \n\n1) Set your ANT_OPTS environment variable to \"-Xverify:none\"\n2) Try to run an Ant buildfile using the mail task with encoding set to \"auto\"\n3) You will see a NoClassDefFoundError and the build fails\n\nThis is a problem for IDE's, which may not be running with the verifier.  If\nthey try to run Ant in the same VM as the IDE, the mail task will fail.", "id": 66109, "time": "2004-10-29T17:40:47Z", "creator": "Matthew.Hawkins@oracle.com", "creation_time": "2004-10-29T17:40:47Z", "is_private": false}, {"count": 1, "tags": [], "creator": "kevin.jackson@it.fts-vn.com", "text": "Created attachment 14140\nChecks for presence of javax.activation, javax.mime classes to help determine if Mime encoding is available\n\nChecks for presence of javax.activation, javax.mime classes to help determine\nif Mime encoding is available", "id": 70271, "time": "2005-01-31T12:17:58Z", "bug_id": 31969, "creation_time": "2005-01-31T12:17:58Z", "is_private": false, "attachment_id": 14140}, {"count": 2, "tags": [], "bug_id": 31969, "is_private": false, "id": 91238, "attachment_id": null, "creator": "stevel@apache.org", "creation_time": "2006-07-12T22:13:55Z", "time": "2006-07-12T22:13:55Z", "text": "Kev, I believe you have the capability to add this fix now..."}, {"count": 3, "attachment_id": null, "bug_id": 31969, "is_private": false, "id": 118740, "time": "2008-07-17T00:11:48Z", "creator": "bodewig@apache.org", "creation_time": "2008-07-17T00:11:48Z", "tags": [], "text": "svn revision 677516"}]