[{"count": 0, "tags": [], "text": "Here's the target I'm trying to run to trap for any cvs errors\n\n<target name=\"checkout\">\n  <cvs command=\"checkout\"\n     package=\"module\"\n     quiet=\"true\"\n     failonerror=\"true\"/>\n</target>\n\nIt gets to the end of the checkout and I get:\n\nBUILD FAILED\nfile:testbuild.xml:97 cvs exited with error code 1\nCommand line was 'q' 'checkout' 'module'\n\nI can do the cvs command from command line w/out a problem.\n\nI need to trap for errors and this is reporting an error when there\nreally wasn't one.\n\nThanks (cvs 1.11.12)", "attachment_id": null, "bug_id": 31965, "id": 66098, "time": "2004-10-29T16:46:02Z", "creator": "mpuckett@granite.com", "creation_time": "2004-10-29T16:46:02Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 31965, "text": "*** Bug 31967 has been marked as a duplicate of this bug. ***", "id": 66105, "time": "2004-10-29T17:19:01Z", "creator": "mpuckett@granite.com", "creation_time": "2004-10-29T17:19:01Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "sbailliez@apache.org", "is_private": false, "id": 66743, "creation_time": "2004-11-11T18:00:46Z", "time": "2004-11-11T18:00:46Z", "bug_id": 31965, "text": "If cvs returns an error code of 1 instead of 0, that means that something is \nwrong somewhere during the cvs process or that this is a cvs bug for that \nparticular version. We have no choice than to tell you that it is not correct.\n\nI cannot reproduce with 1.11.17 that returns 0.\nTry to upgrade your cvs client and see if it fixes the problem.", "attachment_id": null}, {"count": 3, "text": "11/11/04  I don't have this problem with checking out a small module, it only\nhappens when I'm checking out a module that is approx 1 gig in size.  I'm\nthinking it might be a timing issue??  Is there anyway I can get more info back\nfrom cvs task other than reporting a -1 error?  I'd like to find out what error\nthe cvs task thinks it's receiving.", "bug_id": 31965, "is_private": false, "id": 66748, "time": "2004-11-11T19:00:35Z", "creator": "mpuckett@granite.com", "creation_time": "2004-11-11T19:00:35Z", "tags": [], "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 31965, "is_private": false, "id": 66775, "time": "2004-11-12T03:47:29Z", "creator": "kevin.jackson@it.fts-vn.com", "creation_time": "2004-11-12T03:47:29Z", "tags": [], "text": "I'm not sure it's possible to get any more information out of this.  You've got\nthe return code and the actual command run against the repository.\n\nYou suspect it may be a timing issue - do you mean that the task times-out in\nAnt, but not when run from the command line?\n\nAbout the only extra instrumentation would be the time it takes to complete each\nCVS command.  But that would only confirm your suspicion.  Is it a reproducable\nbug - each time you check out a certain repository it fails, or does it occur\ninfrequently?  If it's infrequent then it may just be a network latency issue\nwith the amount of data you're trying to recieve.\n\nI can't see very much that can be done inside the Ant code to help address this.\n One workaround would be to seperate the repository into small sub-projects and\ncheck them out individually - this would again confirm if it's simply a time\nissue for a command to complete.\n\nKev"}, {"count": 5, "text": "I would suggest upgrading your cvs server and client and see if it helps.\nAdn you might want to do the cvs checkout using a script to check return code \nas well and see if it makes a difference compared to the java wrapper.\n\nI know historically that the cvs server code was known to run out of memory in \ncase of huge update or checkout and not reporting correctly the error back to \nthe client as it failed to handle correctly that situation.\n\nThis can be made worse in case of huge binaries files as it RCS file can be \nmuuuuch bigger than the file itself (look at the ,v files on your server) and \nto complicate things further the cvs server tries to load the whole module in \nmemory when you checkout. A good way to put the machine on its knees.\n\nFor more information on that matter, I suggest looking at that problem with \nthe cvs people: https://www.cvshome.org/cyclic/cvs/dev-req.html\n\n", "bug_id": 31965, "is_private": false, "id": 66789, "time": "2004-11-12T11:33:26Z", "creator": "sbailliez@apache.org", "creation_time": "2004-11-12T11:33:26Z", "tags": [], "attachment_id": null}, {"count": 6, "tags": [], "text": "11/12/04  I believe the problem is with the ant (cvs) task.  I ended up writing\na shell script which does the checkout successfully from ant build script. \nSeems like the ant cvs task is the problem here.  I upgraded the server and\nclient and tried using ant cvs, and it still failed although the checkout was\nsuccessful.  That's when I decided to try bypassing using ant (cvs) and calling\ncvs from a shell script.  I can then put the <failonerror> on that target now.\n\n", "is_private": false, "id": 66814, "creator": "mpuckett@granite.com", "time": "2004-11-12T19:23:56Z", "bug_id": 31965, "creation_time": "2004-11-12T19:23:56Z", "attachment_id": null}, {"count": 7, "tags": [], "creator": "stevel@apache.org", "attachment_id": null, "text": "Maybe its a timeout thing. I dont see any timeout stuff in the task though. We\njust <exec> cvs q checkout module.\n\nYou could run <exec> yourself and see what happens, as you have more control\nover timeouts and watchdogs. \n\nBut what if cvs really does just return 1 on a very big download? ", "id": 66821, "time": "2004-11-12T20:46:55Z", "bug_id": 31965, "creation_time": "2004-11-12T20:46:55Z", "is_private": false}, {"count": 8, "tags": [], "text": "11/12/04  Your last comment, But what if cvs really does just return 1 on a very\nbig download? \n>> My answer to that is I can't use cvs with failonerror=\"true\" and get a true\nerror.  I only want the cvs checkout command to fail if there's a problem with\ndoing the checkout, (i.e. network access, failed attempt to logon, etc) and have\nfailonerror actually fail because of a \"true\" error and not because the module\nis large.  There's no true error, that's a problem.  So, I have to go around it\nand call cvs from the command line vs. straight from ant.", "attachment_id": null, "id": 66822, "creator": "mpuckett@granite.com", "time": "2004-11-12T21:25:03Z", "bug_id": 31965, "creation_time": "2004-11-12T21:25:03Z", "is_private": false}]