[{"count": 0, "tags": [], "creator": "cav@uniscope.jp", "is_private": false, "id": 66196, "attachment_id": null, "bug_id": 31993, "creation_time": "2004-10-31T09:58:36Z", "time": "2004-10-31T09:58:36Z", "text": "Slide webdav server does not handle URL decoding properly when interacting with\njapanese clients specifically MS Webfolders from a Japanese Windows client.\nSetting the urlEncoding to Shift_JIS/MS932 or UTF-8 does not work, also tried in\nconjuction with the URIEncoding attribute of the Tomcat connector configuration\nwith no success. Trying to create a folder or file with japanese characters in\nthe name produces a garbled string. In addition, trying to access this file with\nthe garbled name gives a file not found error in the server. Testing\nconfiguration was slide server 2.1b2 with tomcat 5.0.28."}, {"count": 1, "tags": [], "creator": "cav@uniscope.jp", "text": "Created attachment 13286\nURL decoding fixes to support japanese and other CJK languages", "id": 66198, "attachment_id": 13286, "bug_id": 31993, "creation_time": "2004-10-31T10:19:03Z", "time": "2004-10-31T10:19:03Z", "is_private": false}, {"count": 2, "tags": [], "text": "Attached a proposed patch that fixes the problems. I had many irrelevant white\nspace changes in my tree, please apply with --ignore-whitespace flag in the\npatch command.\n\nThere are several issues supporting japanese MS WebFolders. The first one, of\ncourse, is that it's buggy. Some versions of MS WebFolders send URLs unencoded,\nin plain Shift_JIS without even escaping non-ASCII characters. Newer versions\nseem to have fixed that but the charset encoding is Shift_JIS or UTF-8 without\napparently giving any hints. The reason may be that Slide always sends the XML\nreponse body in UTF-8, maybe MS shitches to UTF-8 when notices that the server\ntalks UTF-8 but had already interacted in Shift_JIS in the first place. Another\nproblem is that the href element of the Slide XML reponse is URL encoded using\nthe urlEncoding setting, this is not correct if it differs from UTF-8. Since the\nXML reponse is in UTF-8, clients including NetDrive and WebFolders assume that\nthe URL encoding is UTF-8 which is logical. Thus href elements inside the XML\nreponse should be URL encoded in the same encoding as the whole XML reponse\ndocument, which in Slide is always fixed to UTF-8.\nThe patch was tested on Windows XP japanese SP2, slide 2.1b2, tomcat 5.0.28,\nNetDrive 4.1, WINDAIPP.DLL 8.103.5219.0 (MS Office not installed) with the tx\nfile store and urlEncoding=MS932, not further changes to default slide\nconfiguration nor Tomcat settings.", "is_private": false, "id": 66199, "creation_time": "2004-10-31T10:37:34Z", "time": "2004-10-31T10:37:34Z", "creator": "cav@uniscope.jp", "bug_id": 31993, "attachment_id": null}, {"count": 3, "tags": [], "creator": "cav@uniscope.jp", "text": "Created attachment 13287\nreplacement for URL decoding patch, previous was wrong", "id": 66200, "attachment_id": 13287, "bug_id": 31993, "creation_time": "2004-10-31T11:25:00Z", "time": "2004-10-31T11:25:00Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 31993, "is_private": false, "text": "Resubmitted patch, previous one had some changes irrelevant to this issue.\nUse this patch instead, id=13287", "id": 66201, "time": "2004-10-31T11:26:58Z", "creator": "cav@uniscope.jp", "creation_time": "2004-10-31T11:26:58Z", "attachment_id": null}]