[{"count": 0, "tags": [], "creator": "Chris_Emmerich@partner.nps.gov", "text": "Each time I restart a Tomcat web application (using the Manager tool) more \nmemory is tied up by the Tomcat service.  Eventually, the next restart will \nfail with an out of memory error and I have to restart the service.  Things\nI've tried to resolve/diagnose this:\n\n1.  Checked for memory leaks in the application I was restarting.  I didn't \nfind anything suspicious, so then I undeployed that (and all other \napplications that I'd deployed).  This left only the standard set of apps. \nthat are installed with Tomcat (/, /admin, /manager).  Then I restarted \n/admin repeatedly and replicated the problem (eventually I ran out of\nmemory). \n\n2.  Removed every jar file in {tomcat home}/common/lib that were not put \nthere by the initial Tomcat installation.  (I had read some postings \nthat said that classes that are loaded from here are not garbage-collected \nwhen an app.is restarted.)  This did not correct the problem, either.\n\nPlease let me know if there is anything I can do to eliminate this behavior.\nI'm also curoius as to whether setting reloadable to true in my production \nenvironment would degrade performance significantly (this would of course\neliminate most of my need to restart production applications).", "id": 66248, "attachment_id": null, "bug_id": 32005, "creation_time": "2004-11-01T17:22:59Z", "time": "2004-11-01T17:22:59Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 32005, "attachment_id": null, "id": 66249, "time": "2004-11-01T17:28:58Z", "creator": "funkman@joedog.org", "creation_time": "2004-11-01T17:28:58Z", "is_private": false, "text": "Please use tomcat-user for help.\n\nOtherwise - a memory profiler is the only way to debug this."}, {"count": 2, "tags": [], "bug_id": 32005, "text": "First, please try a more recent release like 5.0.28.\n\nSecond, you might be interested in recent discussions on the tomcat-user \nmailing list (archives are publicly available, e.g. at AIMS) as to why neither \nreloadable nor reloading via the manager webapp is that practical in the real \nworld.\n\nThird, if you're curious about the performance impact of setting \nreloadable=\"true\", I suggest testing it out.  It's usually negligible, but of \ncourse you need to test your own app on your own hardware.\n\nFinally, I suggest you use the mailing list to discuss this problem.  Bugzilla \nis not intended to be a discussion forum, and is not good as such.  If after \ndiscussing your issue on the mailing list you can come up with a WAR we can use \nto reproduce what you're seeing, then please reopen this issue and attach said \nWAR.  Thank you.", "id": 66251, "time": "2004-11-01T17:30:37Z", "creator": "yoavs@computer.org", "creation_time": "2004-11-01T17:30:37Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "Chris_Emmerich@partner.nps.gov", "text": "Regarding your second comment below, I haven't be able to find the thread \nyou're talking about.  Can you suggest a search string that will get me \nto the right place?", "id": 66258, "attachment_id": null, "bug_id": 32005, "creation_time": "2004-11-01T19:47:48Z", "time": "2004-11-01T19:47:48Z", "is_private": false}]