[{"count": 0, "tags": [], "bug_id": 32101, "attachment_id": null, "is_private": false, "id": 66577, "time": "2004-11-07T10:05:51Z", "creator": "jozz@whizzideas.com", "creation_time": "2004-11-07T10:05:51Z", "text": "When integerating Apache with other container or script, such as Tomcat, or\nPERL, the apache will sometime fail to output the content compeletely. That is\nto say large amount of HTML content which is generated by the Tomcat/PERL, will\nbe incomplete after passing the Apache as part of the content is lost!\n\nI met with such problem on my PC server: x86, AMD 1Ghz CPU, Windows XP, Apache\n2.0.52, with Tomcat 5.0.28 and ActivePerl 5.8.\n\nFor brief, Apache 2.0.52/50/49 failed in some circumstances but Apache 1.3.33/31\nsucceeded.\n\nI will just try to describe what happened on my Server. It will see boring.\n\nFor PERL-script, It happened like this:\nAfter installing the AWStats, I opened the\nhttp://www.whizzideas.com/awstats/awstats.pl\nwith IE6, the IE kept refreshing the right frame (The main content frame that is\ngenerated by AWStats[PERL-script]. It took 3-5 seconds for my computer to\ngeneratet the about 80K page) for some seconds (It seemed that the content was\nnot completely loaded and IE tried to loaded it again and again or such things,\nI guess) and finally shown me a \"404 page not found\" message.\n\nWhen I opened the same link with Mozilla 1.7.3, things went better. The mozilla\nloaded the whole page without refreshing. But when I visited the same link\nremotely using Mozilla 1.6, I only part of the page. I viewed the page source\nand found that the page source was incomplete.\n\nAnd later I changed to Apache 2.0.50 and Apache 2.0.49. IE6 (on my local\nmachine)  still could not load the AWStats summary page completely (Actually\nsometimes after IE6 refreshing for some seconds it did get a complete page. But\nit happened scarely.).\n\nAnd finally I change to Apache 1.3.31 and Apache 1.3.33, no such problem\nhappened again.\n\nI reported this problem as a bug of AWStats in :\nhttps://sourceforge.net/tracker/?func=detail&atid=113764&aid=1061060&group_id=13764\nBut finally I realized this was a bug of Apache 2.0.*\n\nFor Tomcat, similar problems existed. Example: I visited\nhttp://www.whizzideas.com/whizznotes/xhtml/441.html\nUsing Mozilla 1.6 remotely, I can see imcomplete HTML codes!\nThis page was about 27K. When visiting some some small-size page (4K-8K), the\npage could be loaded completely. Ridiculous.\n\nBut for the most important things, if I visited the page of Tomcat directly, e.g:\nhttp://www.whizzideas.com:8080/whizznotes/xhtml/441.html\nNo matter locally or remotely and no matter Mozilla or IE, complete pages were\nalways loaded.\n\n(I used Mod_JK2.so in connecting the Tomcat and Apache 2.0.52, but when finally\nI used Apache 1.3.33, I used Mod_jk_1.2.6_1.3.31.dll instead. But in AWStats, no\nconnector was used, and Apache 2.0.52/50/49 all failed to pass complete page,\nand Apache 1.3.33 succeed to pass complete page. So I guess the factor of\nconnector can be ignored.)\n\nIt seemed that 30K+ was a little large for the Apache to flush the whole content\nfrom Tomcat to client in one time, so Apache read twice or three times or more\ntimes from Tomcat and flushed to client application each time. But as some\nproblems(or bugs) hidden here, the content was incorrectly dealt by Apache when\npassing and client application discard the latter incorrect part of the content\n(IE tried to refresh to get a new page but failed again and again and finally IE\ngave up and displayed 404).\n\nThe keys of repeat such bug on Apache 2.0.52:\n1. The pages should be generated by other container such as Tomcat or other scripts;\n2. The server is somewhat slow: the Tomcat / PERL-script can not generated the\npage quickly;\n3. Visiting the pages remotely using IE (Maybe IE is slower than Mozilla in\nloading pages);\n\nFor my experience:\nUsing Resin 3.0.6 with Apache 5.0.28 in generating HTML contents(less than 30K),\nI always get imcomplete page using Mozilla 1.6 remotely (But things goes right\nusing IE locally)\nUsing Tomcat 5.0.28 with Apache 5.0.28 with less than 30K HTML pages, I always\nget complete page using Mozilla 1.6 remotely (But sometimes mozilla did give me\nimcomplete page. This was scare, and after refreshing it gave em complete page)\n.But with page greater than 70K, mozilla will fail to load complete page remotely.\nUsing proxy in Browser will make the bug obvious even on those small-size pages.\n\nSugguestion for repeatting the bug: Using Resin 3.0.6 and integerate it with\nApache 2.0.52, and write a servlet to generated HTML (greater than 100K)  with\nother *.js or *.css or images included page. And using Mozillia 1.6 to visit\nsuch page through rough connection (such as 512K bandwith connection or using\nlow bandwidth proxy);\n\n(Attention: the related links given above are already under Apache 1.3.33, so no\nsuch bug as described exist)\n\nI hope I am stating things clearily and making comments not enough boring. Thanks."}, {"count": 1, "tags": [], "text": "Try Adding these to your configuration file:\nEnableSendfile Off\nEnableMMAP Off\nWin32DisableAcceptex\n\nPlease see the note about this here:\nhttp://www.apache.org/dist/httpd/binaries/win32/#problems\n\nThanks for using Apache.\n\n", "attachment_id": null, "id": 66578, "creator": "chip@force-elite.com", "time": "2004-11-07T10:10:31Z", "bug_id": 32101, "creation_time": "2004-11-07T10:10:31Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jozz@whizzideas.com", "text": "Problem still exist on Apache 2.0.52 after adding:\nEnableSendfile Off\nEnableMMAP Off\nWin32DisableAcceptEx\nIt seems it the directives is used to control static files. \n\nAnd for \"software firewalls, virus checkers\", I have no virus chekers, and the\nfirewalls won't have effect on my local machine.", "id": 66579, "time": "2004-11-07T10:57:32Z", "bug_id": 32101, "creation_time": "2004-11-07T10:57:32Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 32101, "attachment_id": null, "is_private": false, "id": 66580, "time": "2004-11-07T13:52:31Z", "creator": "jozz@whizzideas.com", "creation_time": "2004-11-07T13:52:31Z", "text": "For temporary test: I install an Apache 2.0.52 with Tomcat and AWTStats on\ndifferent port (these pages may disappear in some days):\nhttp://www.whizzideas.com:8324/awstats/awstats.pl\nhttp://www.whizzideas.com:8324/whizznotes/xhtml/441.html\nAnyone who likes to have funs could visit tomcat page directly\nhttp://www.whizzideas.com:8080/whizznotes/xhtml/441.html\nI test the above link on my local machine with IE6, and the pages are incomplete\nwhen through Apache 2.0.52"}, {"count": 4, "tags": [], "bug_id": 32101, "attachment_id": null, "is_private": false, "id": 81901, "time": "2005-10-28T17:41:37Z", "creator": "jorton@redhat.com", "creation_time": "2005-10-28T17:41:37Z", "text": "Closing stale \"it doesn't work\" report, this needs to be narrowed down to a\nspecific issue with a specific component.  Try \nhttp://httpd.apache.org/lists.html#http-users  for help."}]