[{"count": 0, "tags": [], "bug_id": 32277, "is_private": false, "id": 67040, "attachment_id": null, "creator": "marshall@cs.umass.edu", "creation_time": "2004-11-17T16:35:25Z", "time": "2004-11-17T16:35:25Z", "text": "This is a problem using tomcat 5.0.27 and Apache 2.0.52 and the mod_jk2 \nconnector on Windows XP.  \nI've set up Apache so that it allows requests for the servlet on port 80 \n(using module mod_jk2.dll written 9/15/03)  The behavior I see is that when \nrequests are made to Apache that are interleaved servlet requests and regular \nhttp requests (for things like jpgs) that something seems to lock up Apache \nand make it take a very long time to serve out a small jpg.\n\nThe servlet in question is the server side of a Java client/server app.\n\nTHe excerpt from my Apache access.log (below) shows the problem.   I've added \nthe %T option to the logging which shows the time (in seconds) it takes to \nservice the request.  This number is the last number on the line.  \n\nThe problematic lines are the last three. Notice it is taking 72 seconds to \nserve out a jpg that is 129KB.  This is not because of heavy volume or a \nserver bogged down in other processing.  \n\nThe way it plays out on the client side does not corroborate what the log \nsays.  On the client, it fetches and displays the image \nparkfield_people_25.jpg very quickly (less than a second).  When we click a \nbutton for the next image we wait a very long time (over a minute) to see the \nnext image Old_well.jpg.\n\nHeres more background on what these requests are doing (and deciphering the \nlog entries):\nRashiServlet is the servlet.\nOn calls with action=getResource the servlet is given a resourceName which is \na partial path.  The servlet uses this resourceName to calculate a URL to a \nfile that should exist on the server machine.  The servlet makes sure it \nexists by loading the URL (its rather inefficient at the moment and loads the \nwhole file rather than do a HEAD request).  It then returns the URL to the \nclient.  The client then loads the image specified by the URL using \"new \nImageIcon(url)\".  This is why you see two requests for each jpg.  \n\nSo you see two instances of this type of request happening below.  The first \nrequest comes in for parkfield_people_25.jpg and the second request comes in \nfor Old_well.jpg.   \nYou need to look at the time of the log entries rather than their order to \ndetermine when they arrived at the server.   So what the log says about it \ntaking 77 seconds to return parkfield_people is wrong.  We get that quickly.  \nBut we speculate that the second servlet call is somehow confounding Apache so \nthat it thinks that parkfield_people hasn't been served and goes into wait \nstate when the request for Old_well comes in.  Eventually some resource is \nreleased and then Old_well goes out and the log shows it taking a very long \ntime to get both images.  I've witnessed this behavior on other versions of \nWindows (NT, Server 2000) and with other versions of Tomcat (4.X) and Apache \n(2.0.X).  I've always used the jk2 connector\n\n\n128.119.243.6 - - [12/Nov/2004:13:43:19 -\n0500] \"GET /rashij/servlet/RashiServlet?\naction=getResourceURL&resourceName=RashiMedia/geology/Earthquake/parkfield_peop\nle_25.jpg&sessionId=488 HTTP/1.1\" 200 177 0\n\n128.119.243.6 - - [12/Nov/2004:13:43:19 -\n0500] \"GET /RashiResources/slow/RashiMedia/geology/Earthquake/parkfield_people_\n25.jpg HTTP/1.1\" 200 34528 0\n\n128.119.243.6 - - [12/Nov/2004:13:43:24 -\n0500] \"GET /rashij/servlet/RashiServlet?\naction=getResourceURL&resourceName=RashiMedia/geology/Earthquake/Old_well.JPG&s\nessionId=488 HTTP/1.1\" 200 166 0\n\n128.119.243.6 - - [12/Nov/2004:13:43:19 -\n0500] \"GET /RashiResources/slow/RashiMedia/geology/Earthquake/parkfield_people_\n25.jpg HTTP/1.1\" 200 34528 77\n\n128.119.243.6 - - [12/Nov/2004:13:43:24 -\n0500] \"GET /RashiResources/slow/RashiMedia/geology/Earthquake/Old_well.JPG \nHTTP/1.1\" 200 129353 72\n\n128.119.243.6 - - [12/Nov/2004:13:43:24 -\n0500] \"GET /RashiResources/slow/RashiMedia/geology/Earthquake/Old_well.JPG \nHTTP/1.1\" 200 129353 72"}, {"count": 1, "attachment_id": null, "bug_id": 32277, "is_private": false, "id": 67137, "time": "2004-11-18T15:43:18Z", "creator": "yoavs@computer.org", "creation_time": "2004-11-18T15:43:18Z", "tags": [], "text": "JK2 is going away, don't use it.  And when you can submit a complete test \npackage we can use to reproduce your issue using mod_jk, please feel free to \nreopen this issue and we'll be glad to take a look at it.  Until then, I \nsuggest using the tomcat-user list for discussion: there are other factors that \ncould be causing what you're seeing, and Bugzilla is not a discussion forum."}]