[{"count": 0, "tags": [], "bug_id": 32284, "attachment_id": null, "is_private": false, "id": 67075, "time": "2004-11-17T21:30:19Z", "creator": "jemiller@uchicago.edu", "creation_time": "2004-11-17T21:30:19Z", "text": "I found that Tomcat 5.5.4 doesn't auto-redeploy .war files correctly if they \nhave a META-INF/context.xml file. The .war file is auto-deployed the first \ntime, but, it isn't redeployed when it is updated. I have created test files \nthat can be used to reproduce the problem. The files are located at the \nfollowing URLs.\n\nhttp://parakeet.uchicago.edu/test-with-context.war\nhttp://parakeet.uchicago.edu/test-without-context.war\n\nNote, I tested this on the 11/16/04 nightly build and the problem occurs there \ntoo. Also, I tested it on Windows XP and Solaris and the behavior is the same \non both platforms.\n\nTo reproduce the problem, perform the following steps on Linux or UNIX.\n\n1. Start Tomcat 5.5.4 with the default configuration.\n2. Open a second terminal window and run \"tail -f \n$CATALINA_HOME/logs/catalina.out\" this way you can see the log messages as the \noccur when the application is deployed. If you have log messages going \nelsewhere you may need to use a different file.\n3. Copy both of the above files to the $CATALINA_HOME/webapps directory. \nYou'll see that they both deploy in the logs.\n4. Run the following command to make the application WITHOUT the context.xml \nredeploy. \"touch $CATALINA_HOME/webapps/test-without-context.xml\" You will see \na log message stating that the application has been deployed.\n5. Run the following command to make the application WITH the context.xml \nredeploy. \"touch $CATALINA_HOME/webapps/test-with-context.xml\" You will not \nsee a log message."}, {"count": 1, "tags": [], "bug_id": 32284, "attachment_id": null, "is_private": false, "id": 67076, "time": "2004-11-17T21:34:39Z", "creator": "yoavs@computer.org", "creation_time": "2004-11-17T21:34:39Z", "text": "This is by design: users may have customized the previously deployed and \nexpanded WAR or its context.xml file, so we don't overwrite it.  You need to \nremove the context.xml from conf/[engine]/[host] (and the expanded directory if \nany) before deploying the new one.  It's not a Tomcat bug.  This has also been \nexplained on the tomcat-user mailing list: please go there for futher \ndiscussion if you wish, and also use that forum to ask a question first before \nopening a Bugzilla issue.  Thanks."}, {"count": 2, "tags": [], "creator": "jemiller@uchicago.edu", "text": "That isn't the way it works in 5.0. In 5.0 I was able to simply update \nthe .war file and it was reloaded automatically. It did so regardless of \nwhether I had a context.xml.\n\n1. Why would the behavior be different in 5.5 than it is in 5.0?\n2. Why should the behavior be different if there is a context.xml compared to \nif there isn't one? If what you say is true, that the way it works is by \ndesign, then, it seems to be broken in the case where there isn't a \ncontext.xml.\n\nFurthermore, Remy was looking into this problem and he never mentioned to me \nthat the behavior was by design.\n", "id": 67078, "time": "2004-11-17T21:53:52Z", "bug_id": 32284, "creation_time": "2004-11-17T21:53:52Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "There are significant deployer differences between 5.0 and 5.5, including \nspecifically the handling of context.xml files.  It's OK for the context.xml \ncase to be different from the non-context.xml case, because we make the \nassumption that if no context.xml is included the user either already has one \nmanually placed in conf/[engine]/[host], or doesn't need one and just wanted \nthe Tomcat default settings for the context.\n\nRemy wrote this code, so if he says he's looking into it, I'll leave the rest \nto him.  I'm sure he'll reopen this issue if he sees fit.", "attachment_id": null, "id": 67079, "creator": "yoavs@computer.org", "time": "2004-11-17T21:57:16Z", "bug_id": 32284, "creation_time": "2004-11-17T21:57:16Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 32284, "text": "Actually, this is a bug. Watched resources were not properly set in this case,\nso you have to reload manually. I suggest using the manager webapp to reload.\n(didn't I tell you not to file a bug, BTW ?)\nThis has already been fixed in CVS.", "id": 67084, "time": "2004-11-17T22:03:13Z", "creator": "remm@apache.org", "creation_time": "2004-11-17T22:03:13Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "jemiller@uchicago.edu", "attachment_id": null, "id": 67086, "time": "2004-11-17T22:22:38Z", "bug_id": 32284, "creation_time": "2004-11-17T22:22:38Z", "is_private": false, "text": "The main reason I submitted this as a bug is that I wanted to better document \nthe steps to reproduce the bug. On 11/14 you said that the bug was fixed and \nthat if I downloaded the nightly build that it should work. I downloaded the \nlatest nightly build today but I'm still having the problem.\n"}, {"attachment_id": null, "tags": [], "bug_id": 32284, "text": "This is wrong.\nIf you do \"touch $CATALINA_HOME/webapps/test-without-context.xml\", you'll create\na file -> redeployment -> message.\nIf you do \"touch $CATALINA_HOME/webapps/test-with-context.xml\" -> reload (no\nredeployment) -> no message (DEBUG level message, actually).\nAs I said, it works now. I will not spend any more time on this.", "count": 6, "id": 67099, "time": "2004-11-17T23:15:39Z", "creator": "remm@apache.org", "creation_time": "2004-11-17T23:15:39Z", "is_private": false}, {"count": 7, "text": "OK, yeah, I see what you're saying now. You are correct. I tested it and it \nworks. I assumed that because it wasn't writing an INFO level log message that \nit wasn't working since I was using such a simple test case. I didn't realize \nthat there was a difference between redeploy and reload. What was confusing me \nwas the fact that there is no INFO level log message printed upon reload like \nthere is for deploy. I just did a comparison of the log entries in Tomcat 5.0 \nversus 5.5. In 5.0 it has an \"install\" message that is written regardless if \nit's a new deployment or a reload.\n\nNov 16, 2004 4:43:43 PM org.apache.catalina.core.StandardHostDeployer install\nINFO: Processing Context configuration file URL file:/opt/jakarta-tomcat-\n5.0.25-test/conf/Catalina/localhost/coursesiterequest.xml\n\nNov 17, 2004 3:44:41 PM org.apache.catalina.startup.HostConfig deployWAR\nINFO: Deploying web application archive test-with-context.war\n\nAny chance you might consider, writing the reload message at the INFO level \nrather than that DEBUG level?\n\nPersonally, I really liked having that notification before and I'd hate to \nhave that go away.\n\nThanks and sorry for the hassle.\n", "bug_id": 32284, "is_private": false, "id": 67100, "time": "2004-11-17T23:44:04Z", "creator": "jemiller@uchicago.edu", "creation_time": "2004-11-17T23:44:04Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 32284, "is_private": false, "count": 8, "id": 67168, "time": "2004-11-18T20:39:05Z", "creator": "jemiller@uchicago.edu", "creation_time": "2004-11-18T20:39:05Z", "text": "I'm guessing that this is by design and isn't a bug, but, when you update an \napplication using a .war file that has a META-INF/context.xml, why doesn't it \nupdate the corresponding $CATALINA_HOME/conf/[enginename]/[hostname]/\n[appname].xml file?\n\nMy current thinking is that this file should be updated and that a full \nredeploy should be performed. i.e. it should treat context.xml the same way it \ntreats all the other files in the exploded webapp directory (when the .war \nfile is updated they are deleted and recreated).\n\nThe other thing that I'm wondering is why if you have unpackWARs=\"false\", it \nstill unpacks context.xml?\n\nTo me having a bunch of special cases makes it a lot more confusing and \ndifficult to use. I only have limited experience with JBoss, but, if I \nremember correctly, when you install an application to JBoss by copying an \napplication into the deploy directory it always does an undeploy first and \nthen a deploy. It seemed very simple and consistent.\n\nMy personal opinion is that the behavior should be the same whether the \napplication has a context.xml or not. Chances are that someone will point out \nthat there is a good reason why this isn't the case, but, it would be nice if \nit were that simple.\n"}, {"attachment_id": null, "tags": [], "bug_id": 32284, "text": "For the first question, yes, I designed it that way. I think if you want to\nupdate it, you should undeploy the webapp first (delete the war).\n\nFor the second problem, it's because the rest of the infrastructure must use a\nfile, because this is a lot simpler, and because we can write to a file.\n\nAs for the comparison with JBoss, the problems start when you want to be able to\nsave the configuration. Basically, Tomcat does about the same right now. If you\nlook at the code, there are not too many special cases now, and it's all done in\none place. It's just a different behavior for each deployment type (xml,\nexpanded folder, compressed war), which is unavoidable.", "count": 9, "id": 67169, "time": "2004-11-18T20:52:04Z", "creator": "remm@apache.org", "creation_time": "2004-11-18T20:52:04Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 32284, "is_private": false, "count": 10, "id": 121398, "time": "2008-10-10T04:47:06Z", "creator": "markt@apache.org", "creation_time": "2008-10-10T04:47:06Z", "text": "*** Bug 45979 has been marked as a duplicate of this bug. ***"}]