[{"count": 0, "tags": [], "bug_id": 32332, "attachment_id": null, "is_private": false, "id": 67288, "time": "2004-11-20T23:39:22Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-11-20T23:39:22Z", "text": "Tomcat 5.5.4 places an icon in the system tray even though I chose to install it\nas a service. The icon shows up even after a reboot and I can confirm Tomcat is\nrunning as a service.\n\nThis is contrary to the online documentation that specifically states that if\nTomcat is run as a service it won't show up as an icon in the system tray."}, {"count": 1, "tags": [], "bug_id": 32332, "attachment_id": null, "id": 67289, "time": "2004-11-20T23:44:11Z", "creator": "remm@apache.org", "creation_time": "2004-11-20T23:44:11Z", "is_private": false, "text": "This has nothing to do with the service: it's a state monitor. You can remove it\nif you want to. Please do not reopen the report."}, {"count": 2, "tags": [], "text": "Remy,\n\nPlease refer to http://jakarta.apache.org/tomcat/tomcat-5.5-doc/setup.html\n\n\"Tray icon: When Tomcat is run as a service, there will not be any tray icon\npresent when Tomcat is running. Note that when choosing to run Tomcat at the end\nof installation, the tray icon will be used even if Tomcat was installed as a\nservice.\"\n\nNow, I don't care whether this tray icon is a state monitor or anything else.\nFact of the matter is, your documentation says that when Tomcat is run as a\nservice there will not be a tray-icon associated with it -- and there is.\n\nFurthermore, it isn't easy to uninstall it. I had to use regedit to manually\nremove it. It isn't as if you guys add it into the startup folder, which you\nshould. You need to make it easier to uninstall and document how to uninstall it\n as well.\n\nThere are all areas in need of improvement, so if you want me to reopen this\nissue as a RFE so be it, but I'd like to see some changes please.", "attachment_id": null, "bug_id": 32332, "id": 67290, "time": "2004-11-20T23:53:47Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-11-20T23:53:47Z", "is_private": false}]