[{"count": 0, "attachment_id": null, "creator": "bsouther@fwdco.com", "text": "Per discussion on the dev list (posted below) I'm attaching a WARed up version\nof the example app in the \"First App\" tutorial and an index page with a link to it.\nThe index page should go under:\njakarta-tomcat-catalina/webapps/docs/appdev/sample\n\nFrom the dev list.....................\n\nThe \"Example App\" link at the end of the \"First App\" tutorial\nhttp://jakarta.apache.org/tomcat/tomcat-5.5-doc/appdev/sample is a bit\nmisleading when viewed off the Apache site from the web.\n\nWhen you click on it, it displays an Apache directory listing.\nFrom there, you can drill into the src directory to get\nthe servlet code but when you try to drill into the web directory\nthe index.html page gets shown and leads the viewer into thinking that\nthis is a working app.  It's not.  When you click on the \"To a servlet\"\nlink you see a 404 error and when you click on the \"To a JSP page\" link\nyou see the JSP code (which looks like the output from a JSP page\ndisplayed as text because there are no JSP scriptlet tags in it).\n\nI understand that the intent is for the viewer install TC, follow the\nentire tutorial and actually deploy the examples to his/her own machine,\nand then run it from there, but a casual surfer (or worse a struggling\nnewbie) will just see this as a non-working app with broken links.\n\nHas anyone considered building the app, WARing it up, and putting an\nindex.html page at\nhttp://jakarta.apache.org/tomcat/tomcat-5.5-doc/appdev/sample/\nwith a link to the war file and some basic instructions for either\nrunning or unpacking the file to get to the src that goes with the\ntutorial?\n\nIf this is a good idea, I'd be willing to build the war files and HTML\npages.\n\n- Ben\n\n\n\nHi,\nGo ahead, build the WAR, index page, and put it in a Bugzilla\nenhancement item please.  I'd done part of this, including the WAR for\nthe example webapp, in the past.  I put it on my apache.org/~yoavs site,\nand it was downloaded a number of times, but I accidentally deleted the\nrelevant directory tree a few months ago ;(\n\nHappy thanksgiving to all,\n\nYoav Shapira http://www.yoavshapira.com", "id": 67418, "time": "2004-11-24T16:59:42Z", "bug_id": 32382, "creation_time": "2004-11-24T16:59:42Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": 13534, "creator": "bsouther@fwdco.com", "text": "Created attachment 13534\nThe example app as a war file.", "id": 67419, "time": "2004-11-24T17:00:31Z", "bug_id": 32382, "creation_time": "2004-11-24T17:00:31Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "bsouther@fwdco.com", "attachment_id": 13535, "id": 67420, "creation_time": "2004-11-24T17:01:39Z", "time": "2004-11-24T17:01:39Z", "bug_id": 32382, "text": "Created attachment 13535\nxml sheet for generating an index.html page with a link to the myapps.war file.", "is_private": false}, {"count": 3, "tags": [], "bug_id": 32382, "attachment_id": null, "id": 67435, "time": "2004-11-24T22:15:22Z", "creator": "bsouther@fwdco.com", "creation_time": "2004-11-24T22:15:22Z", "is_private": false, "text": "A closer look at the tutorial makes it clear that a war file is not the most\nappropriate way to deliver this. I think that, in order to match the tutorial's\ndirectory structure exactly, it would make more sense to pack all the project\nfiles into a zip file and link to that.  \n\nA working war file could be placed in the zip file, or next to it with a\nseparate link for the impatient who want to see it work before taking on the\ntutorial.  This war file would contain none of the source code and would be\nbuilt with the Ant script included in the project.  This means that the war file\nthey download would be exactly the same as the one they would build if they went\nthrough the whole tutorial.\n\nI'll put this together over the long weekend and submit it for review.\n\n-Ben"}, {"count": 4, "tags": [], "bug_id": 32382, "text": "Hmm... Because the tutorial is located under specific versions of Tomcat, to do\nthis the way I would like would involve building the zip file as part ot\nTomcat's build process.  If there is a committer interested in the idea, I am\nhappy to do the grunt work.  \n\nIn the mean time, I think it would still be an improvement to have the\nindex.html page and the war file committed.\n\nThank you\n-Ben", "id": 67571, "time": "2004-11-29T20:48:45Z", "creator": "bsouther@fwdco.com", "creation_time": "2004-11-29T20:48:45Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "yoavs@computer.org", "is_private": false, "text": "Index.html and WAR file, yes, extra zip as part of the build, not worth the \neffort.\n\nDone on CVS HEAD.", "id": 68055, "time": "2004-12-07T17:48:34Z", "bug_id": 32382, "creation_time": "2004-12-07T17:48:34Z", "attachment_id": null}, {"count": 6, "tags": [], "creator": "bsouther@fwdco.com", "attachment_id": null, "is_private": false, "id": 68065, "time": "2004-12-07T19:38:35Z", "bug_id": 32382, "creation_time": "2004-12-07T19:38:35Z", "text": ">Index.html and WAR file, yes, \nThank you.\n\n> extra zip as part of the build, not worth the effort.\nAgreed"}, {"count": 7, "tags": [], "creator": "bsouther@fwdco.com", "attachment_id": null, "is_private": false, "id": 70122, "time": "2005-01-26T21:18:22Z", "bug_id": 32382, "creation_time": "2005-01-26T21:18:22Z", "text": "Looks like the war file has recently been corrupted.  Can someone re-commit it\nto CVS?"}, {"count": 8, "tags": [], "creator": "yoavs@computer.org", "is_private": false, "text": "Updated WAR integrity verified and commited to CVS.  Thanks!", "id": 72792, "time": "2005-03-24T15:59:05Z", "bug_id": 32382, "creation_time": "2005-03-24T15:59:05Z", "attachment_id": null}]