[{"count": 0, "tags": [], "bug_id": 32383, "attachment_id": null, "id": 67421, "time": "2004-11-24T17:56:52Z", "creator": "codrinb2001@yahoo.com", "creation_time": "2004-11-24T17:56:52Z", "is_private": false, "text": "Currently seems to be impossible to parametrize the uploaded file name in the\nHTTP Request sampler.\n\nI'm trying to have the following value in the Filename field of the HTTP Request\nsampler:\n\nC:\\Test\\File${file_number_counter}.xml, where ${file_number_counter} comes from\na Counter pre processor. Of course this assumes that File1.xml, File1000.xml\nexist under the specified path. But that is a reasonable assumption.\n\nI found it very important to be able for example to upload a different file for\neach user. Otherwise the upload test has a serious limitation. For example, I'm\nsimulating a situation where 50 users try to upload files to a server\nconcurrently using HTTP requests. Because of this limitation, each user will\nupload the same file which will lead to concurrency errors and even deadlocks on\nthe specific application I'm testing.\n\nI was debating whether to log this issue as an enhacement or a bug, but I found\nit as more of a limitation and a documentation bug since it is unclear where\nUser Parameters can be utilized.\n\nThe only problem I see with fixing this issue is the situation/confusion it will\ncreate for the \"Browse...\" button next to Filename field. But if you put in the\nbalance, I find it far more  important to be able to parametrize the uploaded\nfile name."}, {"id": 68698, "tags": [], "bug_id": 32383, "is_private": false, "count": 1, "text": "I don't have an easy way to test file upload, so I ran a test that showed the\nsampler failed to find the generated file name, indicating that the variable had\nbeen recognised. Seems to me that shows variables work OK in the file field.\n\nPerhaps you could add a JavaTest sampler to your test plan to show the value of\nthe variable? One way to do this is to change the Label to include the variable,\nfor example:\n\nLabel                File=C:\\Test\\File${file_number_counter}.xml\n\nNote that the error message appeared in the response data pane, and not jmeter.log\n\nThis was tested using 2.0.1 and the current 2.0 branch.\n\nI'll attach my test plan.", "time": "2004-12-19T02:49:00Z", "creator": "sebb@apache.org", "creation_time": "2004-12-19T02:49:00Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 32383, "attachment_id": 13780, "id": 68699, "time": "2004-12-19T02:50:47Z", "creator": "sebb@apache.org", "creation_time": "2004-12-19T02:50:47Z", "is_private": false, "text": "Created attachment 13780\nTest Plan with HTTP Sampler using variable file name"}]