[{"count": 0, "tags": [], "text": "This is a further refinement of an earlier workaround I made as part of defect \n31492 to fix an exception from the DB2 jdbc driver. The upshot of this problem \nis that a child collection of a root jdbc store that is a mount point for \nanother store does not have a uri in the URI table of the parent JDBC store \nbecause the metadata for the second store is kept in the nodestore of the \nsecond store and not the jdbc nodestore of the root store. eg. If \"/\" (root) is \na jdbc store and \"tx2\" is a second store definition with scope \"/files_2\" and \nan XML descriptor nodestore and tx filesystem content store then the \nuri \"/files_2\" is not stored in the URI table of the jdbc nodestore of the root \nstore even though the binding \"/->/files_2\" is kept in the BINDINGS table of \nthe jdbc nodestore. This caused an exception when trying to insert a new \nbinding into the DB2 BINDINGS table because it couldn't find a valid uri ID for \nthe uri \"/files_2\" in the URI table.\n\nWhat I've done to fix this problem now is to detect when this error occurs (ie. \nwhen the child uri is not found in the URI table during an insert into the \nBINDING table) and have added code in the DB2 adapter to create a uri in the \nURI table for these children. This allows the binding to be inserted into the \nBINDING table with a valid child id so that the list of children is correctly \ngenerated and any searches on the table based on child id will match the value \nin the URI table. \n\nI will attach the patch. It will not affect other jdbc store implementations \nand will fix the problem as noted in this defect's summary for DB2 stores as \nwell as the exception I was seeing prior to that.", "is_private": false, "id": 67665, "creator": "wburrows@e2open.com", "time": "2004-12-01T01:03:28Z", "bug_id": 32460, "creation_time": "2004-12-01T01:03:28Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "wburrows@e2open.com", "text": "Created attachment 13602\nPatch for DB2RDBMSAdapter.java", "id": 67667, "time": "2004-12-01T01:06:26Z", "bug_id": 32460, "creation_time": "2004-12-01T01:06:26Z", "is_private": false, "attachment_id": 13602}]