[{"count": 0, "tags": [], "creator": "marko.asplund@kronodoc.com", "text": "there should be a way of inserting a new column in the middle of existing columns with HSSF \nusermodel API in a similar fashion as rows can be inserted using HSSFSheet.shiftRows(). currently, you \ncan't just create a new cell in the end of each row and then shift the values of existing cells to the left \nbecause the shifted cells might contain formulas and HSSFCell.setCellType() not supported for formulas \naccording to documentation. also, what about other weird cell types? does HSSF support all types of \ncells that can be created by MS Excel?", "id": 68043, "time": "2004-12-07T13:38:43Z", "bug_id": 32562, "creation_time": "2004-12-07T13:38:43Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "avik@apache.org", "text": "Unlikely to happen, not a priority.  POI will not let you create a functional\nequivalent to Excel. ", "id": 75587, "time": "2005-05-30T12:02:06Z", "bug_id": 32562, "creation_time": "2005-05-30T12:02:06Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 32562, "is_private": false, "count": 2, "id": 75649, "time": "2005-05-31T16:10:14Z", "creator": "amolweb@yahoo.com", "creation_time": "2005-05-31T16:10:14Z", "text": "I've been thinking about this myself and although I agree \nwith the idea that POI is basically a file format translator,\nthis is also one of the desirable features, especially when \ncreating new workbooks. (For instance when you want a \nsummary table at the top that has dynamic num of rows - \nhence it is unpredictable how many rows it will occupy - \nand consists of formulas based on cells below, which in turn\nhave formulas...)\n\nIMHO, POI should allow ways for external classes to hook\ninto the FormulaParser and add such features. Currently,\nsince FormulaParser can be only contructed with a Workbook\ninstance, it isnot possible for HSSF client classes to\nparse formulas.\n\nWith a clean way to hook into the FormulaParser api, I \nimagine it should not be too much of an effort to emulate \nexcel's shift row/columns functionality (AFAIK, All \nCellReferences are shifted by an X,Y offset by excel\nwhen insert col/row is performed). Ofcourse, I'm not\nsuggesting that such a functionality be a part of \nPOI main, but seems like it would be a good addition\nto 'contrib' or 'examples'."}, {"count": 3, "tags": [], "bug_id": 32562, "is_private": false, "id": 126418, "creation_time": "2009-04-21T20:18:57Z", "time": "2009-04-21T20:18:57Z", "creator": "James.Robinson@rcn.net", "text": "I am working with a \"template\" file that is kept up to date.  A live query is running against a DB that extracts a new data attribute based on matching fields for each row of data in the sheet.  Essentially I am creating a new column if its header is not already present in the template, and populating my new data attribute in each row for that column.  \n\nWithout such an API method, I will have to iterate over every populated row in the sheet, and copy every cell from the desired column target index one cell to the right (right to left of course).", "attachment_id": null}]