[{"count": 0, "tags": [], "bug_id": 32627, "text": "First of all, please excuse me that I have to report the problem here, since it \nis not a bug. It is simply things that recently became very important but have \nstill no solution.\nPlease take your time and read this till the end. It is very hart for me to \nexplain it and I’m sure that it would also not be easy  to understand.\nApache shows wrong upload transfer volumes.\nWhy? \nImmediately after starting a download for example, the size of the downloaded \nfile with all other information are saved in as a line  in the log file.\nSince there is no way to verify if the user didn’t disconnect or stopped the \ndownload, it is by all server developers assumed that this way of logging the \ntraffic is the best and the only way.\nIt is also assumed that the error tolerance would be low because it would not \noften be the case.\n\nRecently, the internet connections became fast enough to stream films or music.\nFrom the server point of view, the streamed files are logged as downloads \nregistering the full size of the file.\nThe streaming companies are interested to be able to close a streaming thread \nafter a definite time. \nNo server offers this possibility including Apache. \nThere are many possibilities to stop or close the client browser with java or \njavascript.\nApache could offer this option by:\n1) Recognizing files as streamed files and not logging the full size of the \ndownload. (doesn’t exist)\n2) A function to close a thread (either through different port number for \nexample )\n3)When closed, logging the transferred bit size.\n\nI have a site streaming movies with Apache and I can tell you that beside those \nproblems it is the best server in the world.\nI have log files showing me a transfer rate of 200 GB a day but in reality was \nactually 2 GB.\n\nSam", "id": 68225, "time": "2004-12-10T06:49:08Z", "creator": "sambukkaa@hotmail.com", "creation_time": "2004-12-10T06:49:08Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "chip@force-elite.com", "text": "Have you seen mod_logio? \nhttp://httpd.apache.org/docs-2.0/mod/mod_logio.html\n\nIt seems to do exactly what you are asking for.", "id": 68226, "time": "2004-12-10T07:17:58Z", "bug_id": 32627, "creation_time": "2004-12-10T07:17:58Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "chip@force-elite.com", "attachment_id": null, "is_private": false, "id": 68231, "time": "2004-12-10T09:31:59Z", "bug_id": 32627, "creation_time": "2004-12-10T09:31:59Z", "text": "Marking as resolved, I am pretty sure he wants mod_logio.\n"}]