[{"count": 0, "tags": [], "bug_id": 32675, "attachment_id": null, "text": "I have configured form based login for a resource collection in my web app\nand it works fine.  I do not directly reference the login form page.  Tomcat\nhandles the redirection for me as it should.  But I am encountering a\nproblem.  When this sequence of events occurs:\n\n- Request a protected resource\n- User is presented with the login form, but doesn't log in yet\n- Context is reloaded (or container is restarted)\n- User logs in user the same form that was presented (without refreshing)\n\nThe request fails with \n\"HTTP Status 400 - Invalid direct reference to form login page\"\n\nIf I make sure to refresh the login page after the context is reloaded,\neverything works as expected. The code and config are the same in both\ncases.", "id": 68435, "time": "2004-12-13T23:25:52Z", "creator": "caleb.phillips@vflic.com", "creation_time": "2004-12-13T23:25:52Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 32675, "attachment_id": 13748, "text": "Created attachment 13748\nMinimal war demonstrating problem\n\nThis war file contains a webapp with a protected index.html that displays the\nproblem described above", "id": 68436, "time": "2004-12-13T23:32:36Z", "creator": "caleb.phillips@vflic.com", "creation_time": "2004-12-13T23:32:36Z", "is_private": false}, {"count": 2, "tags": [], "text": "I'm not exactly sure how we could cover that case, since everything (Web.xml \nprotected resource, etc) is redone when the context is restarted.  So I think \nyou're SOL in that case (and in the general case where your server is restarted \nwhile a user request is in progress).", "is_private": false, "bug_id": 32675, "id": 68569, "time": "2004-12-15T16:26:44Z", "creator": "yoavs@computer.org", "creation_time": "2004-12-15T16:26:44Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "caleb.phillips@vflic.com", "attachment_id": null, "id": 68588, "time": "2004-12-15T20:02:38Z", "bug_id": 32675, "creation_time": "2004-12-15T20:02:38Z", "is_private": false, "text": "(In reply to comment #2)\nI may have been unclear on the post.  I am assuming there is some kind of state \nsent to the client when they are redirected to the login form (to send them to \nthe correct place after login), since the log in works if I refresh the form \nfirst.  What I was thinking is that there might be some way to detect that \nthe \"log in\" state is stale and just send them back to the login form.\nIn any case isn't the error message (\"Invalid direct reference to login form\") \nincorrect?  I had another situation where the user might request the log in \nform and let it sit past the session timeout and if they tried to log in it \ngave a 408 Request Timeout, which seemed appropriate.\n\nThanks\n\n\n\n"}]