[{"count": 0, "tags": [], "text": "The attach patch modifies tests/build.xml to add \"coverageReport\" target which\nwill use Clover (http://www.cenqua.com/clover) to generate a coverage report of\nthe log4j code exercised while running all tests.  To run this target,\nclover.jar must be on the classpath.  ASF committers can check out a ASF\nlicensed Clover from the committers/donated-licenses/clover CVS module.\n\nThere were a few gotcha, the ASF licensed clover is restricted to a fixed set of\npackage hierarchies (org.apache, com.example, java) which does not cover the\npackage names used in the examples.  To work around this, the parentBuild target\nwas modified to call all dependencies of log4j's build target except build.examples.\n\nPatternParserTest.test14 appears to be tempermental.  It will pass on a clean\nbuild, but will fail at other times.  To work around this, I added a property\n\"test-haltonerror\" which controls whether JUnit tests halt on error.  When doing\na coverage analysis, they do not fail on error.\n\nA sample coverage report is currently available at\nhttp://home.houston.rr.com/curta/coverage.tar.gz.  Untar and view\ncoverage/index.html to see coverage report.", "is_private": false, "id": 68586, "creator": "carnold@houston.rr.com", "time": "2004-12-15T19:50:44Z", "bug_id": 32722, "creation_time": "2004-12-15T19:50:44Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "carnold@houston.rr.com", "text": "Created attachment 13762\nPatch for tests/build.xml to support coverage analysis with Clover\n\nI would recommend having a backup copy of your CVS checkout before running\nClover.", "id": 68587, "time": "2004-12-15T19:54:43Z", "bug_id": 32722, "creation_time": "2004-12-15T19:54:43Z", "is_private": false, "attachment_id": 13762}, {"count": 2, "attachment_id": null, "bug_id": 32722, "text": "Curt,\n\nOnce we can generate these clover reports, what then? If someone will\nact on these reports, then fine, otherwise it's another widget adding to\nthe ambient noise. I am sorry if it comes through as overly nagative\nbut on several occasions depencies were added, never to be used again.\n\nIf you think adding Clover makes sense, then I'll trust your\njudgment.\n  ", "id": 68727, "time": "2004-12-20T12:58:46Z", "creator": "ceki@apache.org", "creation_time": "2004-12-20T12:58:46Z", "tags": [], "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 32722, "text": "I definitely find it valuable to have coverage reports when writing new unit tests and to find out what \ncode is not effectively tested.  Unless someone attempts to run \"ant coverageReport\" (providing I didn't \nmess the tests/build.xml file up), they should not be aware of it.\n\nI refined the haltonerror tweaking to only cover PatternLayoutTest.  clover.jar should be placed in the \ntest/lib directory in addition to being placed on the classpath since that will allow the SocketServer \ntests to pass.  I've hopefully explained this in the message that will appear if you attempt to build \n\"coverageReport\" without clover.jar on your classpath.", "id": 68743, "time": "2004-12-21T03:53:01Z", "creator": "carnold@apache.org", "creation_time": "2004-12-21T03:53:01Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "carnold@apache.org", "text": "Patch has been back ported to v1_2-branch.\n\nAlso extended -Dhaltonfailure to apply to all junit tests, no just the ones that\nwould fail under clover.  When run under JDK 1.1 or 1.2, many tests fail and it\nis helpful to select to run all tests and not just stop at the first failing one.", "id": 78677, "time": "2005-08-19T00:29:25Z", "bug_id": 32722, "creation_time": "2005-08-19T00:29:25Z", "is_private": false, "attachment_id": null}]