[{"count": 0, "tags": [], "bug_id": 32734, "attachment_id": null, "text": "Hey,\n\nThe scenario:\n\nA page with a form, and the fields are disabled and blank.\nThere is a list under the form where by clicking on the list will fill in the \nblank fields (field reminds disabled). It uses Javascript to fill in the \nfields. \n\nWhen running the proxy server on this page, it comes back with an error (the \npage displays an error, not JMeter). When not running the proxy, it is fun.\n\n\nThe form itself has javascript embedded in it. When submitting it, it calls up \na javascript function and passes on the values that way. \n\nI can't edit the page, Im just responsible for making a test case.", "id": 68618, "time": "2004-12-16T16:55:17Z", "creator": "azn_fuman@yahoo.ca", "creation_time": "2004-12-16T16:55:17Z", "is_private": false}, {"count": 1, "tags": [], "creator": "azn_fuman@yahoo.ca", "attachment_id": null, "is_private": false, "id": 68620, "time": "2004-12-16T17:11:02Z", "bug_id": 32734, "creation_time": "2004-12-16T17:11:02Z", "text": "If I disable a the proxy server on both IE and JMeter. Run the page once, go \nback, re-enable the proxy server. It will record properly."}, {"count": 2, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "text": "Need some more information to be able to debug this.\n\nYou say the page displays an error - does this give any clues as to what went\nwrong? Might need to ask the page developer under what conditions the error\nmessage is generated.\n\nHave you included a Cookie Manager in the JMeter testplan?\n\nCan you create a test plan that works without using the Proxy server? If so, how\ndoes it differ from the one created when using the proxy?", "id": 68691, "time": "2004-12-18T20:15:55Z", "bug_id": 32734, "creation_time": "2004-12-18T20:15:55Z", "is_private": false}, {"count": 3, "text": "Can't fix without further details", "bug_id": 32734, "attachment_id": null, "id": 72269, "time": "2005-03-12T03:15:34Z", "creator": "sebb@apache.org", "creation_time": "2005-03-12T03:15:34Z", "tags": [], "is_private": false}]