[{"count": 0, "tags": [], "bug_id": 32806, "text": "Hi,\n\nI know you guys kept Tomcat case-sensitive (for paths, URLs) under win32 because\nof migration issues but I personally think the entire concept of\ncase-sensitivity is crap (hey, it's my opinion) and so I'd like to disable it on\nmy deployment. I suspect a lot of other win32, macOSX, OS/2 users would love to\ndo the same. Can you please add an option for making paths/URLs case sensitive\nso I can enable it under win32?\n\nThank you,\nGili", "id": 68812, "time": "2004-12-22T18:46:40Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-22T18:46:40Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "No.", "attachment_id": null, "id": 68813, "creator": "remm@apache.org", "time": "2004-12-22T18:48:11Z", "bug_id": 32806, "creation_time": "2004-12-22T18:48:11Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 32806, "text": "Uuuuuuuuuuuh. This is an open-source project right? What the heck is \"no\"? I\ndon't think you get to maintain a monopoly on the idea train :) How about you\nkeep this issue open and if it gets eonugh votes you actually go ahead and\nimplement it? Closing it as INVALID states that regardless of how many votes it\ngets you don't give a damn. Well, as an open-source project I don't think you\nreally get to do that. The community should have a say.", "id": 68818, "attachment_id": null, "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-22T19:37:56Z", "time": "2004-12-22T19:37:56Z", "is_private": false}, {"count": 3, "tags": [], "text": "Take a look at SRV.9.5 and SRV.11.*\n\nThe specs are very clear about case-sensitivity and Tomcat development is driven\nby the Servlet/JSP Specs.\n\nTo those of us who have written our apps to the specs, the sudden apperance of\ncase-insensitive containers would cause major headaches.", "is_private": false, "id": 68819, "creator": "bsouther@fwdco.com", "time": "2004-12-22T19:56:09Z", "bug_id": 32806, "creation_time": "2004-12-22T19:56:09Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Ben,\n\nThank you for your polite reply. Remy, had you given me this kind of reply I\nwould have taken it completely different than I did.\n\nNow, on the topic of the specification. You are absolutely right that it calls\nfor case-sensitive string comparisons between request and resource paths. Thank\nyou for pointing this out. I will take this up with authors of the\nspecification. What I am really pushing for is for the use of\nFile.getCanonicalPath() on both the request and resource path before string\ncomparison. Ok, leaving this issue as closed.\n\nThank you,\nGili", "attachment_id": null, "bug_id": 32806, "id": 68821, "time": "2004-12-22T20:14:21Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-22T20:14:21Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 32806, "text": "Case insensitivity is available in 4.1.(for win32) The case insensitive flag is\nalso there in FileDireContext in 5.5. So I think it would still work?\n\nhttp://jakarta.apache.org/tomcat/faq/windows.html#case", "id": 68822, "time": "2004-12-22T20:19:13Z", "creator": "funkman@joedog.org", "creation_time": "2004-12-22T20:19:13Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "text": "Very cool, found it here:\nhttp://jakarta.apache.org/tomcat/tomcat-5.5-doc/config/context.html\n\nBen, back to your original point: what can I expect to happen if I disable\ncase-sensitivity? I don't see how apps that have been written for\ncase-sensitivity would break under case-insensitive containers (unless they\nexplicitly expect a path resolution to fail but it now succeeds -- but this\nsounds more like a testcase than a real-life application).", "attachment_id": null, "bug_id": 32806, "id": 68824, "time": "2004-12-22T20:50:36Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-22T20:50:36Z", "is_private": false}, {"count": 7, "tags": [], "text": "Oof, sorry. I just read the documentation says disabling case-sensitivity will\nresult in \"allowing JSP source code disclosure, among other security problems.\"\n\nI know this somewhat requires you guys to go out on a limb, but can we not fix\nthese problems? I don't mind categorizing such fixes as lower-priority, but it\nwould be nice to have it fixed so I can disable case-sensitivity. Meanwhile, I\nhave written a formal request to the Servlet Specification maintainer, asking\nthem to allow implementations to make use of File.getCanonicalPath() if they so\nchoose.", "attachment_id": null, "id": 68825, "creator": "cowwoc@bbs.darktech.org", "time": "2004-12-22T20:53:28Z", "bug_id": 32806, "creation_time": "2004-12-22T20:53:28Z", "is_private": false}, {"count": 8, "tags": [], "text": "Bugzilla is not really the place for this so I'll make it brief.\n\nA case insensitive app server wouldn't be able to differentiate between \nhttp://localhost:8080/myPage \nand \nhttp://localhost:8080/mypage\n\nAlso, if an app is written with the assumption of case insensitivity and then\ndeployed on a server with case sensitivity a file with an extension of \".JSP\"\ncould end up being treated as a text file (the source would be returned).\n\nIf you want to continue the conversation, just post a question to the tomcat\nuser's list. \n\n-Ben\n\n", "attachment_id": null, "id": 68826, "creator": "bsouther@fwdco.com", "time": "2004-12-22T21:00:47Z", "bug_id": 32806, "creation_time": "2004-12-22T21:00:47Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 32806, "attachment_id": null, "id": 68827, "time": "2004-12-22T21:08:09Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-22T21:08:09Z", "is_private": false, "text": "Continuing on tomcat-dev mailing list under the heading: \"Case insensitive URLs:\nIssue #32806\""}, {"count": 10, "tags": [], "bug_id": 32806, "text": "\n\tHere is some feedback I got from the specification lead\nmaintainer for the Servlet API. He points out that there is nothing\npreventing an implementation from mapping URLs to paths in a\ncase-insensitive manner.\n\n==================BEGIN FORWARDED MESSAGE==================\nHi Gili\nOn Dec 22, 2004, at 12:32 PM, Gili wrote:\n\n> Greg,\n>\n> \tYou talk as if File.getCanonicalPath() did not exist :) So my\n> answer is twofold:\n>\n> 1) Password strings differ from file paths. Yes, the latter can be\n> represented in the form of a String, but we really know it represents a\n> file path. And while we're on the topic, I suspect the implementation\n> stores such entities as \"File\" objects internally, not Strings.\n>\n\nYes passwords are a different animal from file paths.  An\nimplementation\nof the servlet API will be whether file paths are canonical or not. \nQuoting\nthe servlet spec SRV2.4  Glossary page 328\n\n\"In HTTP-based URLs, the º/ºcharacter is reserved to separate a \nhierarchical\npath structure in the URL-path portion of the URL. The server is \nresponsible\nfor determining the meaning of the hierarchical structure. There is no\n  correspondence between a URL-path and a given file system path.\"\n\nThe only two APIs that are provided for accessing a resource directly \nfrom the\nservlet spec's perspective are:\n\nClassLoader.getResourceAsStream(String/URL) and\nServletContext.getResourceAsStream(String)\n\nThis is as close to file paths that the servlet API really get. It is \ngenerally not a\ngood practice to access the file system directly from a web \napplication. With\nthe J2EE Reference implementation you need to change the security \nsettings\nof the web container to allow this.\n===================END FORWARDED MESSAGE===================", "id": 68952, "time": "2004-12-24T02:56:32Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-24T02:56:32Z", "is_private": false, "attachment_id": null}, {"count": 11, "tags": [], "bug_id": 32806, "attachment_id": null, "is_private": false, "id": 68964, "time": "2004-12-24T16:29:18Z", "creator": "remm@apache.org", "creation_time": "2004-12-24T16:29:18Z", "text": "What you propose is not a good idea, so I'll veto it. You may indeed build a\ncase insensitive Servlet container, but you have to be really careful about\nsecurity when doing it, and it will reduce portability of applications (a war\nwhich runs on Windows might fail on Unix).\n\nBTW, OSS means you can take the code, modify it to make whatever you want, and\nmake available your changes. It doesn't mean it's possible to force developers\nto implement/add features they don't want to implement/add."}, {"count": 12, "tags": [], "bug_id": 32806, "attachment_id": null, "id": 68965, "time": "2004-12-24T16:42:51Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-24T16:42:51Z", "is_private": false, "text": "Remy, always giving me problems :)\n\nLook, I will give you \"portability issues\" (although how often do you migrate a\nweb server to a totally different OS?!) but there is no way I'm going to give\nyou \"security issues\". I have yet to see a single major security issue that had\nanything to do with case sensitivity. I'm not trying to force anyone's hand\nhere, but case-sensitivity is a subjective matter and as such I should be able\nto *choose* the behavior I want -- after all, who's to say your approach is any\nbetter than mine?"}, {"count": 13, "tags": [], "bug_id": 32806, "attachment_id": null, "is_private": false, "id": 69005, "time": "2004-12-26T23:06:34Z", "creator": "julian.reschke@gmx.de", "creation_time": "2004-12-26T23:06:34Z", "text": "Remy is right; Case folding is a well-known source for security problems (where\nsecurity information is checked against a single specific variant of a URL, but\nthe underlying store maps many other URLs to the same underlying resource --\nthese problems also include trailing blanks and dots and other \"normalizations\"\na security layer may not be aware of)."}, {"count": 14, "tags": [], "bug_id": 32806, "is_private": false, "text": "Julian,\n\nI am aware of that, but these are fairly trivial bugs (solved by using\nFile.getCanonicalPath()). I'd like to try this out on my end and I'll report the\nissues, one by one, so we can fix them. I'm willing to make the effort if you are.", "id": 69006, "time": "2004-12-27T01:32:19Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2004-12-27T01:32:19Z", "attachment_id": null}, {"count": 15, "tags": [], "bug_id": 32806, "is_private": false, "text": "As I said, I'll vote -1 to your proposed changes, so I recommend you do not\nwaste your time, and contribute more useful code (if you really intend to\ncontribute something).", "id": 69007, "time": "2004-12-27T09:59:35Z", "creator": "remm@apache.org", "creation_time": "2004-12-27T09:59:35Z", "attachment_id": null}, {"count": 16, "tags": [], "text": "Be careful with getCanonicalPath(), in JDK 1.4 Sun has introduced an in-memory\ncache which has/had several bugs (such as buggy invalidation among others).\n", "attachment_id": null, "id": 69011, "creator": "julian.reschke@gmx.de", "time": "2004-12-27T13:31:59Z", "bug_id": 32806, "creation_time": "2004-12-27T13:31:59Z", "is_private": false}]