[{"count": 0, "tags": [], "text": "When tomcat undeploys a webapp it leaves the /webapps/<whatever>/WEB-INF/lib \ndirectory. This means that tomcat cannot deploy a webapp in that directory \nspace until tomcat is restarted. This only happens when jar files are includes \nas part of the webapp in the /WEB-INF/lib directory. If the webapp does not \nhave any jar files under /WEB-INF/lib then the problem does not occur.\n\nTo recreate the problem:\n\ndeploy a new webapp as a war file (copy a war file to the webapps directory) \nthis should not cause a problem until you 'touch' or overwrite the war file. \nTomcat will notice that the war file has been touched or updated and try to \nundeploy the app - at this point it leaves the WEB-INF/lib directory if there \nwere jar files in there. Then tomcat tries to re-deploy the app and spits out \nan error saying that it cannot find the web.xml file so it is unable to deploy \nthe same app that initially was deployed.\n\nSurely this must be a bug.", "is_private": false, "bug_id": 32828, "id": 68921, "time": "2004-12-23T11:55:04Z", "creator": "ian.hutchison@gs.com", "creation_time": "2004-12-23T11:55:04Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 32828, "attachment_id": null, "id": 69180, "time": "2005-01-03T19:26:38Z", "creator": "yoavs@computer.org", "creation_time": "2005-01-03T19:26:38Z", "is_private": false, "text": "You have something which locks a JAR (or more than one) in the WEB-INF/lib \ndirectory.  If you're not sure how to debug this, ask on the mailing list.  It \nworks for me on both 5.0.28 and 5.5.6."}, {"count": 2, "tags": [], "text": "I have experienced the same problem, and sometimes it's possibel to undeploy and\nsometimes a restart is required. Seems to me that there is a race condition\noccuring where the servlet isn't completely stopped and therefore the file locks\naren't released when the undeployment occurs.\n\nTime to re-open this bug?", "attachment_id": null, "id": 70237, "creator": "u36674300@bedug.com", "time": "2005-01-29T08:30:03Z", "bug_id": 32828, "creation_time": "2005-01-29T08:30:03Z", "is_private": false}]