[{"count": 0, "tags": [], "bug_id": 32836, "text": "Tested with Sun jdk 1.4.2_05 (with the right jars in the endorsed dirs) and 1.5.0.\n\nI updated the VerifySignature sample class with the signature file\ndata/ie/baltimore/merlin-examples/merlin-xmldsig-fifteen/signature-enveloping-rsa.xml\n   to add a loop (2000 iterations) before the line with the XML parsing (and\nremoved the try catch to stop at the first exception).\n\nAn OutOfMemoryError is systematically thrown (after 816 iterations here at home\n in eclipse, java heap size : 128 Mb).\n\nAfter some investigations, the ThreadLocal in CachedXPathAPIHolder seems to be\nresponsible for the memory retention.\n\nI updated this class to get :\n\npublic CachedXPathAPI getCachedXPathAPI() {\n        return new CachedXPathAPI();\n}\n\nand the problem was solved (a quick but not really smart fix, I admit ;) ).\n\nWith the loop AFTER the xml parsing in VerifySignature, there was no problem.\nThat is to say the memory retention occurs when verifying signatures of\ndifferent org.w3c.dom.Document objects (maybe something similar to bug 29595 in\nclass CachedXPathAPI, did not take time to look for further explanations...).\n\nSylvain.", "id": 68947, "time": "2004-12-23T23:55:40Z", "creator": "sylvain@dusart.org", "creation_time": "2004-12-23T23:55:40Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "raul-info@r-bg.com", "text": "Thanks for detecting the problem,\n\n  As I'll try to avoid the XPath calls the lest this error has pass undetected.\nThe problem is caused by the CachedXPathAPI storing all the node infos of all \ndocuments it read, and never reset it(it must be telled explicetly). As we are\ncaching this object for speed reasons, it grows and grows. \nYour proposed solution, fix the problem but put a penalty hit and makes the\ncache irrelevant.\nI have fixed it detecting when the cache is asked for other document and then\nreseting the cache, I have tested it and the memory remains stable. You can\nobtain the solution in CVS.\n\nThanks a lot.", "id": 68959, "time": "2004-12-24T13:31:58Z", "bug_id": 32836, "creation_time": "2004-12-24T13:31:58Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 32836, "attachment_id": null, "text": "Closing old bugs.", "id": 91968, "time": "2006-08-06T17:43:54Z", "creator": "raul-info@r-bg.com", "creation_time": "2006-08-06T17:43:54Z", "is_private": false}]