[{"count": 0, "tags": [], "text": "From James Strachan web log (which I completely agree with)\n\nFrom time to time on some project or via some tool or framework I use log4j\ndirectly or indirectly through some other library. I started using log4j way\nback when it was at IBM. For the most part its a reasonable piece of software\nthat does what it says on the tin.\n\nHowever I've lost count of the times I've swore loudly at log4j for, you guessed\nit, giving this lovely output...\n\nlog4j:WARN No appenders could be found for logger (foo).\nlog4j:WARN Please initialize the log4j system properly.\n\nAnd then refusing to let you see any output whatsoever of the tool / project\nyou've just run. How useful!\n\nThen you spend an hour or two messing around with whatever tool / build /\nproject / framework to munge some log4j.properties on the classpath / in a\nsystem property just to see some damned logging output.\n\nWhy oh why couldn't log4j just do the useful thing of logging a warning that its\nnot found a configuration, but then go right ahead and use a sensible default,\nlogging INFO & WARN level output to the console. If nothing else it'd reduce the\namount of swearing :)", "attachment_id": null, "id": 69075, "creator": "jerome@coffeebreaks.org", "time": "2004-12-30T10:40:32Z", "bug_id": 32885, "creation_time": "2004-12-30T10:40:32Z", "is_private": false}, {"count": 1, "tags": [], "creator": "eross@m-qube.com", "text": "Ceki Gulcu wrote\n> 1) On certain systems there is no such thing as a default output device, e.g. a \n> console. 2) More importantly, if the user has not configured log4j, chances are \n> that no one is actually interested in the log output. If the user is interested \n> in the log output, is it an unreasonable requirement to ask her to configure\n> log4j?\n\n0) The user is lazy.  java.util.logging ships with a JVM default.\nhttp://java.sun.com/j2se/1.4.2/docs/guide/util/logging/overview.html [1.9]\n1) Even if there is no console, STDOUT usually goes someplace useful.\n2) You already output a few lines to the console saying configure it properly. \nThis sort of contradicts your philosophy about log4j working with non-console\nmaachines.  It also serves to piss people off.\n\nIf I'm some person using *somebody else's software* that relies on log4j (which\nisn't configured correctly) I might have no idea how to get things working.  I\nmight have no idea when I see that message what to do.", "id": 69092, "time": "2004-12-30T18:36:48Z", "bug_id": 32885, "creation_time": "2004-12-30T18:36:48Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "\n> 2) You already output a few lines to the console saying configure it properly. \n> This sort of contradicts your philosophy about log4j working with non-console\n> maachines.  It also serves to piss people off.\n\nGood point. \n", "attachment_id": null, "bug_id": 32885, "id": 69093, "time": "2004-12-30T18:50:15Z", "creator": "ceki@apache.org", "creation_time": "2004-12-30T18:50:15Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 32885, "text": "\nAs of version 1.3, log4j is self-reliant for its own logging. In\nparticular, within the configuration phase, log4j may generate log\nmessages. These are replayed after log4j is fully configured. The fact\nthat log4j does not rely on a default configuration makes such\nreentrant behavior tractable. Note that as of version 1.3, log4j no\nlonger emits the dreaded messages.\n\n log4j:WARN No appenders could be found for logger (foo).\n log4j:WARN Please initialize the log4j system properly.\n\nMoreover, components using ULoggers (UGLI interface) may swap\nugli-simple.jar instead of log4j.jar. This will engage a default\nbehavior very similar to what you describe. \n\nFor more details on UGLI please see\n\n  http://logging.apache.org/log4j/ugli.html\n\n", "id": 69149, "time": "2005-01-03T14:44:04Z", "creator": "ceki@apache.org", "creation_time": "2005-01-03T14:44:04Z", "is_private": false, "attachment_id": null}]