[{"count": 0, "tags": [], "bug_id": 32903, "text": "I created a quite simple but large EXCEL-File with EXCEL2000 with a size of \nabout 35MB.  This file uses 4 XBAT-Blocks.\nWhen building the BAT-array from these XBAT-blocks I encountered a problem ( \nwhich arose the moment more then 1 XBAT-Blocks was needed ).\nIt seems as if not all 128 integers in the block were holding indices of BAT-\nblocks but only the first 127 of them.  The last integer ( at offset +1FC ) \npointed to the next XBAT-Block.   The same was true for the other XBAT-blocks \nas well.\nThus the last integers of all XBAT-blocks formed a chain just like the one \nfound in the BAT-Array with the last XBAT-Block having -2 as end-indicator \nwhile the other integers of all these blocks formed the extension of the BAT-\nArray.\n\nCan anyone confirm the behavior mentionend above or is this an error on my \nside?\n\nIf the previous were true, then the XBAT-Blocks would not necessarily have to \nbe located in sequence as described in the documentation here\n\nhttp://jakarta.apache.org/poi/poifs/fileformat.html\n\nand the BAT-Array is only extended by 127 of the 128 integers of each XBAT-\nblock.\n\n\nIf needed I can submit a zipped version of the file indicated ( still 5MB \nsize ) but I guess any file large enough created by EXCEL will do.\n\nlive long and prosper\nStefan Schmöcker", "id": 69117, "time": "2004-12-31T15:04:28Z", "creator": "postmaster@schmoecker.de", "creation_time": "2004-12-31T15:04:28Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "apache@gagravarr.org", "text": "I suspect you figured out the answer about 6 years ago, but in case anyone stumbles across this...\n\nThe XBAT holds 128 offsets. The first 127 are the offsets to BAT blocks, while the 128th is the offset to the next XBAT in the chain. I've fixed the documentation, and added a link to [MS-CFB].pdf which is the now-public Microsoft documentation on all this.", "id": 144567, "time": "2011-02-25T17:14:09Z", "bug_id": 32903, "creation_time": "2011-02-25T17:14:09Z", "tags": [], "is_private": false}]