[{"count": 0, "attachment_id": null, "bug_id": 32922, "text": "1) Create a test plan\n2) Add a Web Service/SOAP (beta code) request configured with :\n   - field WSDL URL empty\n   - field URL filled (it is mandatory...)\n3) add any listener for displaying results\n3) run the test plan\n\nIn test results, the request appears but field \"URL\" is blank. I would expect\nthe field to display the web service URL. When displaying the results, maybe\nthere is a confusion between the web service URL and the WSDL URL.", "id": 69165, "time": "2005-01-03T17:28:15Z", "creator": "theshaman@laposte.net", "creation_time": "2005-01-03T17:28:15Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 32922, "text": "if the webservice is a ASP or ASMX webservice on .NET, you need to populate the\nsoapAction. If the soapAction is emtpy, it will not get valid response. In fact,\nthe .NET webservice will reject the request.\n\nif the webservice is java, please attach a test plan so I can debug it. thanks.\n\npeter", "id": 69166, "attachment_id": null, "creator": "woolfel@yahoo.com", "creation_time": "2005-01-03T17:37:45Z", "time": "2005-01-03T17:37:45Z", "is_private": false}, {"count": 2, "tags": [], "creator": "theshaman@laposte.net", "text": "Hi Peter,\nSorry but for security reasons I don't want to attach ma test plan, and I have\nno songle web application to create another one...\nTo answer your questions, it is a java web service, I filled the SOAP Action and\nthe test plan works fine, the server sends the expected response.\nI replayed the test with the field WSDL URL not empty, and again the test\nresults shows a blank URL, so forget my idea about the confusion between WSDL\nURL and real web service URL...", "id": 69173, "time": "2005-01-03T18:39:50Z", "bug_id": 32922, "creation_time": "2005-01-03T18:39:50Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 32922, "attachment_id": null, "is_private": false, "id": 69174, "time": "2005-01-03T18:50:09Z", "creator": "woolfel@yahoo.com", "creation_time": "2005-01-03T18:50:09Z", "text": "So are you still having problems?\n\nCurrently, the sampler does not save the WSDL URL, only the webservice URL used\nto process the request. I'll update the sampler this week to save the WSDL URL.\nAlthough it isn't used at runtime, there's no harm in saving that in the test\nplan. I forget exactly why i decided not to save the wsdl url. adding that\nfeature should be simple.\n\npeter"}, {"count": 4, "attachment_id": null, "bug_id": 32922, "is_private": false, "id": 69195, "time": "2005-01-04T09:18:47Z", "creator": "theshaman@laposte.net", "creation_time": "2005-01-04T09:18:47Z", "tags": [], "text": "Sorry if I have difficulties to explain my problem, english is not my native\nlanguage...\nTo sum up my situation :\n- I never had difficulties to run my test plan (all the web service requests are\nwell processed)\n- I don't give much interest to the field WSDL URL : I let it empty, so it does\nnot bother me whether the field is saved or not \n- if I look the test results, all the requests appear but, and it is my\n\"problem\", the column URL is empty, so it is not easy to know which row is which\nweb service request. I would like this column to show the web service URL. It is\njust a little problem and it will not prevent me from using JMeter...\n\nThanks for the time you spend in trying to understand me!\n"}, {"count": 5, "tags": [], "creator": "woolfel@yahoo.com", "is_private": false, "text": "thanks for taking time to explain the problem. for some stupid reason I thought\nyou were having problems with sending requests. I will look at the sampler and\ndouble check the implementation. It most likely isn't setting the url in the\nsample result, so adding that should be relatively easy to do.\n\npeter", "id": 69205, "time": "2005-01-04T13:43:28Z", "bug_id": 32922, "creation_time": "2005-01-04T13:43:28Z", "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 32922, "is_private": false, "id": 69244, "time": "2005-01-05T16:22:18Z", "creator": "woolfel@yahoo.com", "creation_time": "2005-01-05T16:22:18Z", "tags": [], "text": "I've updated the webservice sampler to include the response header and set the \nlabel for the sample result. Tonight i will check it into CVS. thanks again for \nreporting the bug and taking time to explain it.\n\npeter"}]