[{"count": 0, "attachment_id": null, "bug_id": 32951, "text": "I seem to have this problem with Batik as well (Scribus fixed it already).\n\nhttp://bugs.scribus.net/view.php?id=1328", "id": 69231, "time": "2005-01-05T10:20:28Z", "creator": "ivg2@cornell.edu", "creation_time": "2005-01-05T10:20:28Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 32951, "is_private": false, "id": 71102, "attachment_id": null, "creator": "deweese@apache.org", "creation_time": "2005-02-17T01:27:04Z", "time": "2005-02-17T01:27:04Z", "text": "I don't follow the problem.\n\nReading the bug report you reference doesn't make it very clear to\nme either (the comments seem to be talking at cross purposes,\nso I can't tell who's fix went in).\n\nCan you attach a sample SVG that shows the issue, with a\ndiscussion of what you expect the rendering to be?"}, {"count": 2, "attachment_id": null, "bug_id": 32951, "text": "The problem... the problem is that when I take any svg with graphics out \nof inkscape, and try to use it with any other svg program, the graphics\nare way bigger than they should be. My theory as to why that is, \nwas that every other svg program seems to implement the unit spec incorrectly.\nParticularly, the spec says that numbers without units on them should\nbe interpreted in user units, which are equivalent to 1 px, not 1pt,\nwhich is what everyone seems to be implementing. I don't know anything\nabout graphics units, but looking online says that 1pt = 1.25 px.\n\nSample svg? Any svg with graphics (like a large square) \nproduced by inkscape should suffice.\n\nCan you reproduce, or should I retest? (I don't have batik w/ pdf\ninstalled right now, but I can reinstall for testing). IIRC what I \nwas trying to do is convert an inkscape svg to a pdf document using batik,\nand it was resulting in something that was the wrong size, and cut off\nat the end of the page.", "id": 71104, "time": "2005-02-17T01:46:37Z", "creator": "ivg2@cornell.edu", "creation_time": "2005-02-17T01:46:37Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 32951, "is_private": false, "id": 71113, "attachment_id": null, "creator": "deweese@apache.org", "creation_time": "2005-02-17T03:00:26Z", "time": "2005-02-17T03:00:26Z", "text": "The problem is that Inscape is relying on undefined\nbehaviour.  It is assuming that the relationship\nis 1.25px = 1pt.  It should really provide a\nviewbox attribute that explictly provides the mapping\nbetween the width/height real world units and the\nuserspace of the SVG element.\n\nIt might be a nice enhancement to the PDF transcoder\nif it would respect the '-dpi' flag like the rest of\nthe transcoders, but it is not a violation of the SVG\nspecification."}, {"count": 4, "attachment_id": null, "bug_id": 32951, "text": "I just got the lastest copy of the PDF transcoder from FOP.\nIt does handle this properly now.  I'll deliver to Batik\nshortly (next day or two).", "id": 71117, "time": "2005-02-17T03:40:50Z", "creator": "deweese@apache.org", "creation_time": "2005-02-17T03:40:50Z", "tags": [], "is_private": false}]