[{"count": 0, "tags": [], "creator": "t.hartwig@crapoud.com", "text": "For short what I'm aiming at: I develop a web application and try to make this\npublic. One of the potential users are windows users who might want to use this\napplication. (see the application: http://www.itth.de/Produkte/TTraq_en.html)\n\nThe problem I faced was the everlasting old problem with configuring the \"fork\"\nproperty in \"web.xml\". If this is set to \"false\" then Tomcat can't compile JSP\npages:\n<pre>\norg.apache.jasper.JasperException: Unable to compile class for JSP\n\nGenerated servlet error:\n05-01-12 12:02:11 ERROR org.apache.jasper.compiler.Compiler:412 - Javac exception \nUnable to find a javac compiler;\ncom.sun.tools.javac.Main is not on the classpath.\nPerhaps JAVA_HOME does not point to the JDK\n</pre>\n\nI used a vanilla fresh Java SDK (1.4.2.xxx) and Tomcat 5.0.30 (Windows installer\nversion) and this error occurs by default because the \"fork\" is set to \"false\"\nby default in the Windows installation distribution of Tomcat.\n\nI'm sure this is one of the most annoying bugs/misfeatures which can occure (in\nsome circumstances even on Unix systems) and longs for a very long time now.\nEven the error message can drive an administrator insane.\n\nWhat is the reason for setting the \"fork\" to \"false\" by default? And what is the\ndetailed problem if set to \"true\"? I'm not so deep in Tomcat sorry, I'm just an\nadministrator who wants to use Tomcat and show how fine it is. But with this\nproblem a Windows administrator might become never a better human. ;-)\n\nThere is an other bug which handled this, but there it is spoken that the \"fork\"\nparameter has to set to \"false\" for working. But I'm sure this is wrong:\n\nhttp://issues.apache.org/bugzilla/show_bug.cgi?id=19269\n\nSorry if I might reactivate a very old issue, but I just want to help make\nTomcat and Java popular.\n\nThomas", "id": 69589, "time": "2005-01-12T12:15:05Z", "bug_id": 33060, "creation_time": "2005-01-12T12:15:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 33060, "attachment_id": null, "id": 69768, "time": "2005-01-17T14:25:17Z", "creator": "t.hartwig@crapoud.com", "creation_time": "2005-01-17T14:25:17Z", "is_private": false, "text": "Sorry for bothering you guys. For my shame the error was on my site with an old\nversion of ant, which was consulted for compiling.\n\nThanks for you attention.\nThomas\n"}]