[{"count": 0, "tags": [], "creator": "ninju_bohra@yahoo.com", "attachment_id": null, "is_private": false, "id": 69711, "time": "2005-01-14T22:15:49Z", "bug_id": 33105, "creation_time": "2005-01-14T22:15:49Z", "text": "Hey guys (and gals) of the ANT community,\n\n    First off, I love ANT (been using it since 1.4.2) and I find myself \nwriting build files have a greater need for branching and conditional \nexecution capabilities.  I like the ability to define an if(or unless) \nattribute to all targets to control their impact, but I am finding more and \nmore often that I need fine grained control.  \n\n    I am finding that I need to control the execution of specific tasks within \na process target that I wrote.  Currently, I am having to pull those tasks out \ninto seperate target(s) and do the if(or unless) check out there.  But this \nresults in a large number of un-natural targets and the flow of the build \ntarget logic is muddled.\n\n    I propose the addition of two optional attributes ('if' and 'unless') \navailable to all tasks that control the calling of the .execute() function \nwith the same semantics of the similarly named attributes of the <target> \nentity.\n\n    The obvious (to me) place to put this new logic would be in the .perform() \ncall of the Task class.  Below is an example of the pseudo-code:\n\n    public final void perform() {\n        if (!invalid) {\n            // **** Pseudo-code begin\n            if (if_condition_check_says_exit() ||\n                unless_condition_check_says_exit()) {\n               return;\n            }\n            // **** Pseudo-code ends\n            getProject().fireTaskStarted(this);\n            Throwable reason = null;\n            try {\n                maybeConfigure();\n                execute();\n            } catch (BuildException ex) {\n              .\n              .\n              .\n      }\n\n    The implementation of the helper functions (if_condition_checks_says_exit\n() and unless_condition_check_says_exit()) are trivial and would have the same \nsemantics as the <target> process (and/or the <fail> task)\n\n    I am not sure whether the if checks should occur before or after the \ngetProject().fireTaskStarted(this) call and would leave it up to the community \nto decide where it would make most sense.\n\n    I am making the change to our local version of ANT that we are using.  I \nhave no experience in working on an open-source contribution and if it decided \nto promote my change into the build, I would need guidance on how to proceed.  \nI work on a Windows XP environment.\n\n    Awaiting your response,\n\n\n    Ninju Bohra\n    ninju_bohra@yahoo.com"}, {"text": "This has been proposed many times before, but was never accepted. Just use Ant-\nContrib's <if> task or any similar one for finer grained conditional control. \n\nSorry, --DD", "tags": [], "bug_id": 33105, "is_private": false, "count": 1, "id": 69712, "time": "2005-01-14T22:19:28Z", "creator": "ddevienne@lgc.com", "creation_time": "2005-01-14T22:19:28Z", "attachment_id": null}]