[{"count": 0, "tags": [], "bug_id": 33155, "attachment_id": null, "id": 69812, "time": "2005-01-18T20:00:10Z", "creator": "william.poitras@thomson.com", "creation_time": "2005-01-18T20:00:10Z", "is_private": false, "text": "It makes sense to have FixCRLF functionality available as a FilterReader so that\nall the varied semantics of the Copy task that FixCRLF doesn't support (like\ntaking a Fileset as an embedded element) can be used to fix CRLF issues at the\ntime the file is copied."}, {"count": 1, "tags": [], "bug_id": 33155, "is_private": false, "id": 69815, "creation_time": "2005-01-18T20:12:12Z", "time": "2005-01-18T20:12:12Z", "creator": "mbenson@apache.org", "text": "A user offered this up at one time (see\nhttp://issues.apache.org/bugzilla/show_bug.cgi?id=33155), but I never saw\nanything else about it.  I definitely agree that it is good and right to add\nthis.  I would want the filter code to use the same code as the task, but the\nage and design of the task makes this easier said than done, which is why I\nnever did it myself.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 33155, "is_private": false, "id": 69983, "creation_time": "2005-01-22T20:38:20Z", "time": "2005-01-22T20:38:20Z", "creator": "kevin.greiner@compsol.cc", "text": "I've written the filter using the task's functions.  The code is ugly but passes\nthe same testcases as the task.  I'm currently writing a version 2\nimplementation that is based on a stream model.  It should be considerably\neasier to understand.\nShould I submit the version 1 code now or wait until version 2 is done?\n", "attachment_id": null}, {"count": 3, "tags": [], "creator": "kevin.greiner@compsol.cc", "attachment_id": 14135, "id": 70239, "time": "2005-01-29T19:22:58Z", "bug_id": 33155, "creation_time": "2005-01-29T19:22:58Z", "is_private": false, "text": "Created attachment 14135\nNew fixCRLF filter\n\nHere is the fixCRLF filter.  It has been exhaustively tested to verify that it\nduplicates the behavior of the fixCRLF task."}, {"count": 4, "tags": [], "bug_id": 33155, "attachment_id": null, "text": "Thanks, Kevin.  I'll be looking at this.", "id": 70278, "time": "2005-01-31T16:17:14Z", "creator": "mbenson@apache.org", "creation_time": "2005-01-31T16:17:14Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 33155, "attachment_id": null, "text": "I finally looked at this... thought it would be rude I committed the\npreservelastmodified patch and hadn't yet looked at this.  Though this was a lot\nbigger.\n\nKevin:  WOW.  I didn't want to have two sets of code in Ant that did the same\nthing.  Plus two sets of unit tests that did the same thing.  So I took your\nfilter and renamed it to be completely distinct from FixCRLF the Task.  I played\naround with the code a little 'cause I can't resist doing that.  But I didn't\neven touch the real guts.  I really like the way you implemented the various\naspects of the task as separate filters.  Anyway, I never tested your code; I\nset immediately about changing the task to use your filter.  I figured if its\ntestcases still passed after that we were in the clear.  I got it converted and\nran the test suite, and everything passed immediately.  I was amazed.  Anyway, I\n set the task up so that it can function as a filter just so we wouldn't have to do:\n<filterchain>\n  <fixcrlffilter ... />\n</filterchain>\n\nor something silly... instead it's just <fixcrlf ... /> just like the task.\n\nAnyway, this is very cool... I had wanted this filter for quite awhile but was\ntoo lazy to attack it myself.  Looks like it represents a lot of work on your\npart.  I have this marked down for Ant 1.7 now, though I may merge it for 1.6.3\ndepending on how much time elapses and whether any negative fallout shows up.\n\nThanks!", "id": 71802, "time": "2005-03-03T22:56:02Z", "creator": "mbenson@apache.org", "creation_time": "2005-03-03T22:56:02Z", "is_private": false}]