[{"count": 0, "tags": [], "bug_id": 33214, "attachment_id": null, "text": "I recently used the FTP task a lot the last days and I stuck many times due to\nlimitations of the FTP task in different ant versions 1.5.x - 1.6.x. Still with\n1.6.2 I have issues that ore not working properly at least when transfering from\nWinXP to AIX 5.1 (e.g. in a put the chmod will only work for files not directories).\n\nAt the end I always end up using a new TELNET task after the FTP and fixing\neverything I could not do with the FTP.\n\nDiscussing with a collegue we came to the point that the overall design of the\nFTP task is probably to limited. Everytime someone tries something new the task\nhas to be extended.\n\nThe TELNET task is much more flexible. START Session - do whatever you want -\nSTOP Session. In a native ftp session everybody is working in the same way. Open\nthe session, do several actions, close it. I don't see why the FTP task cannot\nbe implemented that way. Am I missing something there?\n\nWouldn't it be a good idea to refactore FTP task according to the TELNET task in\norder to use the same paradigm? Apart from the \"migration-problem\" of exsiting\nant-scripts using FTP I don't see any problems.\n\nOn the other sides other enhancement request like \"use one ftp session for\nseveral commands\" would become obsolete then.\n\nRegards\n\nDan", "id": 70012, "time": "2005-01-24T08:53:00Z", "creator": "daniel.lipp@gmx.net", "creation_time": "2005-01-24T08:53:00Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 33214, "attachment_id": null, "text": "This might be interesting as an alternative to the existing FTP options. \nHowever it seems that an uncomplicated implementation of this capability would\nlack the ability to deal with Ant filesets.  What might then proliferate among\nbuildfiles would be side-by-side usage of both approaches, for good or ill. \nJust thinking \"aloud\"...", "id": 70042, "time": "2005-01-24T19:26:49Z", "creator": "mbenson@apache.org", "creation_time": "2005-01-24T19:26:49Z", "is_private": false}, {"count": 2, "tags": [], "creator": "scohen@apache.org", "text": "I agree with Matt.  This is almost a different task. <interactive-ftp> or some\nsuch.  What it lacks is the ability to deal with filesets.  If the files are not\nin your local current directory you'd have to be able to do LCD commands.  It\nmight work, it might even be useful, but in some sense, it's not quite the \"ant\nway\", for good or for ill.\n\nI hadn't ever really paid much attention to the <telnet> task before.  After a\nquick look-see, I see that it depends reading certain prompts from the server. \nWhich, I guess, is fine if you know exactly the server you are dealing with and\nit never changes.  It may even be good - since you can adjust for any locale issues.\n\nI think a lot of the present users will not want to work this way.  They'll not\nwant to have to think about the specific prompts and such on the server. \nAnother possible objection is how dependency checking will get done in the\ncontext of a sequential series of commands.  As a series of separate targets,\nthe dependency checking is relatively easy to understand.  As a bunch of\nsequential commands sent to the server, it's much less so.\n\nI recommend creating a contribution of <interactive-ftp>.  It shouldn't be that\nhard to do, I just don't think it fits into the <ftp> task as now developed. \nPossibly we can put it into the main stem if there is demand for it.", "id": 75597, "time": "2005-05-30T18:04:21Z", "bug_id": 33214, "creation_time": "2005-05-30T18:04:21Z", "is_private": false, "attachment_id": null}]