[{"count": 0, "tags": [], "creator": "eph1v3t8@mailblocks.com", "attachment_id": null, "id": 70102, "time": "2005-01-26T16:16:49Z", "bug_id": 33249, "creation_time": "2005-01-26T16:16:49Z", "is_private": false, "text": "Intermittently, when I copy a WAR file into the webapps directory to deploy it\n(which I usually do via ant, but the problem can also happen when deploying via\nthe manager servlet) Tomcat unpacks only part of the WAR file, and then outputs\nthe message:  \"Missing application web.xml\".  Usually quite a bit more than just\nthe web.xml is missing from the unpacked version.  If I \"undeploy\" via the\nmanager servlet, and then re-copy the same WAR file, the second time around\nTomcat usually unpacks it correctly and the application starts.\n\nMy suspicion is that the autodeployment thread is detecting the presence of the\nnew WAR file and trying to unpack it before the copy operation has fully\ncompleted.  If this is a possibility, then one fix that comes to mind would be\nfor Tomcat to check the file size of the WAR file before and after doing the\nunpack, and re-doing the unpack if there is a difference.\n\nThe problem is reproducible, but not every time.  In the case of the servlets\nI've been working with lately, it happens maybe 1 in 3 or 4 times."}, {"count": 1, "tags": [], "bug_id": 33249, "attachment_id": null, "id": 70104, "time": "2005-01-26T16:23:14Z", "creator": "remm@apache.org", "creation_time": "2005-01-26T16:23:14Z", "is_private": false, "text": "It is very impossible to check for the case of a file being dropped in the host\nappBase. Do a local move to get a nearly atomic filesystem operation, rather\nthan a copy.\nThis will work fine from the manager servlet (unlike what you seem to imply)."}, {"count": 2, "tags": [], "text": "Changing the copy to a move is a very good suggestion, and I expect that that \nwill solve the problem.\n\nJust as an FYI, though, the manager app's deployment procedure is to do a copy of \nthe file, and not a move, so I would expect that it will still have the problem.\n (The method I was using in the manager app was to click on the \"browse\" button,\nselect a local WAR file, and then click \"deploy\".  The file is still there in\nthe original location, and a copy is placed into webapps.)\n\nThanks for the \"move\" tip -- that was helpful.", "attachment_id": null, "bug_id": 33249, "id": 70106, "time": "2005-01-26T16:40:45Z", "creator": "eph1v3t8@mailblocks.com", "creation_time": "2005-01-26T16:40:45Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 33249, "attachment_id": null, "id": 70112, "time": "2005-01-26T17:21:29Z", "creator": "remm@apache.org", "creation_time": "2005-01-26T17:21:29Z", "is_private": false, "text": "The manager webapp is part of the Tomcat code, and therefore can communicate\nwith the application deployer. I believe that code works fine."}, {"count": 4, "tags": [], "creator": "zsolt.berentey@i-logic.hu", "attachment_id": null, "id": 42531, "time": "2005-03-22T10:34:02Z", "bug_id": 33249, "creation_time": "2005-03-22T10:34:02Z", "is_private": false, "text": "Excuse me, but the manager app's deploy function causes the same problem as a \nsimple file copy. I have just tried to deploy a quite big WAR file, and after \ndeployment it containg only a log folder in the WEB-INF and of course \ncomplained about a missing web.xml..."}, {"count": 5, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "Works for me.", "id": 42431, "time": "2005-03-22T10:57:31Z", "bug_id": 33249, "creation_time": "2005-03-22T10:57:31Z", "is_private": false}, {"count": 6, "attachment_id": null, "creator": "eph1v3t8@mailblocks.com", "is_private": false, "id": 72878, "time": "2005-03-26T03:49:54Z", "bug_id": 33249, "creation_time": "2005-03-26T03:49:54Z", "tags": [], "text": "I believe I found what was causing this problem.  It turned out that my\nservlet's code left file handles open to files within the context directory. \nThere's a bug in the PC version of Java that prevents open files from being\ndeleted, so that prevented Tomcat from removing the old context directory when\nunpacking a new version of the WAR file.  Once I closed the file handles, the\nproblem went away."}, {"count": 7, "tags": [], "text": "Good, thanks for reporting your findings.", "is_private": false, "bug_id": 33249, "id": 72879, "time": "2005-03-26T04:04:17Z", "creator": "yoavs@computer.org", "creation_time": "2005-03-26T04:04:17Z", "attachment_id": null}]