[{"count": 0, "tags": [], "text": "When server start dosn't mather what we set for atribut jvmRoute server not \nread this value, and StandardEngine hasn't set field jvmRoute.\nThis way we can't setup configuration for clastering tomcat with sticky session.\nThe main reason for this is not readed atribute from file server.xml from \nsection <Engine....\nJ find out this becouse atribute JSESSIONID is not set for number.{jvmRoute}\nBeafore changes in class StandardEngine, which can read this atribute sticky \nsession with mod_jk and mod_jk2 works well with this version of tomcat", "is_private": false, "id": 70085, "creator": "kczerw@as.net.pl", "time": "2005-01-25T21:00:56Z", "bug_id": 33244, "creation_time": "2005-01-25T21:00:56Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 33244, "attachment_id": null, "text": "This looks like a configuration problem. Bugzilla is for reporting bugs. It is\nnot a support forum. You will get a much better response if you post your\nquestion to the tomcat-user mailing list.", "id": 70486, "time": "2005-02-04T00:44:44Z", "creator": "markt@apache.org", "creation_time": "2005-02-04T00:44:44Z", "is_private": false}, {"count": 2, "tags": [], "creator": "kczerw@as.net.pl", "text": "From my opinion this is a BUG because of this unread atribut jvmroute tomcat\ncannot work with claster. This's not a configuraton problem. Tutorial say that\nwe can from this way configure this, but it's not working properly. This is\nrequired for working tomcat with mod_jk or mod_jk2.", "id": 71810, "time": "2005-03-04T10:28:55Z", "bug_id": 33244, "creation_time": "2005-03-04T10:28:55Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "I was reading old publication about jvmRoute and I was finding that bad working\nsession name managment was because of default configuration where probably was\njmvRoute. When I get current version of tomcat 4.1.31 jvmRoute works well. I'm\nsorry about unnessesery report. Thanks a lot.", "is_private": false, "id": 71814, "creator": "kczerw@as.net.pl", "time": "2005-03-04T12:42:09Z", "bug_id": 33244, "creation_time": "2005-03-04T12:42:09Z", "attachment_id": null}]