[{"count": 0, "tags": [], "bug_id": 33281, "attachment_id": null, "text": "http://ant.apache.org/manual/using.html#arg\n\nTwo suggestions for this page:\n\nSUGGESTION 1:\nThe arguments section says:\n\n     <arg value=\"-l -a\"/>\n\n     is a single command-line argument containing a space character.\n\nThis is a confusing example, as it appears (to anyone who knows Unix)\nlike two command line options (% ls -l -a), which implies it is two\narguments, not one.  (I had tried to do <arg value=\"-d docs\">\nfor javadoc, which causes an error.  I thought of this as one argument \nwith two parameters.)\n\nThe other problem is that this example is identical to the next one,\nwhich is described in a contradictory fashion as \"two separate \ncommand-line arguments\".  \n\nIt would be a lot clearer to use a string that contains a space\nand doesn't look like  two arguments.  Here's one that is well-known \nto many:\n\n     <arg value=\"Program Files\">\n\n\nSUGGESTION 2:\nThis concerns <project>, <target>, <property>, <classpath>, and <arg>\nEach of the main sections on this page do not show the element prominently\nin the first sentence (or at all, for project).  This is a reference guide\nafter all, and who knows what a \"project\" is if you don't define its syntax?\nExamples are not definitive.  The first few times I visited this page, I was \nunsure if this was the definitive page or not.\n\nThis makes the docs quite hard to understand or search through and find\nthese elements.  I think it would be sufficient to add \"<target>\" \nrather than \"<target attrib=value>\".  \n\nIf I were doing this, in addition to a reference in the first sentence,\nfor prominence and clarity, I would also add the syntax ahead of each \ntable. Instead of:\n\n  A target has the following attributes:\n\nI would say:\n\n  A <target> element has the following attributes:", "id": 70217, "time": "2005-01-28T03:09:18Z", "creator": "douglas.kramer@sun.com", "creation_time": "2005-01-28T03:09:18Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 33281, "text": "Left the examples as is, but added text emphasising that the first one does not\nsplit the arguments in two. Please check from CVS to see it is clearer; reopen\nif not. ", "id": 70638, "time": "2005-02-08T20:13:36Z", "creator": "stevel@apache.org", "creation_time": "2005-02-08T20:13:36Z", "is_private": false, "attachment_id": null}]