[{"count": 0, "tags": [], "creator": "douglas.kramer@sun.com", "text": "On the import task page: http://ant.apache.org/manual/CoreTasks/import.html\nThis documentation could be clearer.\n\n  Target overriding\n\n  If a target in the main file is also present in at least one of the \n  imported files, it takes precedence.\n                  ^^\nPlease replace \"it\" with either \"the main target\" or \"the imported target\".\n\n  So if I import for example a docsbuild.xml file named builddocs, \n  that contains a \"docs\" target, I can redefine it in my main buildfile \n  and that is the one that will be called. This makes it easy to keep the \n  same target name, so that the overriding target is still called by any other \n  targets--in either the main or imported buildfile(s)--for which it is a \n  dependency, with a different implementation. \n\nThis seems to say the target in the import file is called by \"docs\" name.\n(since it doesn't require changing the other references to it.)\n\n  The original target is made available by the name \"builddocs.docs\". \n  This enables the new implementation to call the old target, thus \n  enhancing it with tasks called before or after it.\n\nThe use of the word \"original\" is unclear.  I would think that the\nmain file contains the original target, but it cannot be overridden\nby the imported target.  but the the name \"builddocs.docs\" leads me\nto think this is the imported target being referred to.  \nPlease supplement \"original\" to either \"original main\" or \"original imported\".\n\nNormally, I think of an add-on (import) as overriding the original (main)\nbehavior.  So this has my thinking turned around.", "id": 70218, "time": "2005-01-28T04:10:42Z", "bug_id": 33282, "creation_time": "2005-01-28T04:10:42Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Docs have been clarified in CVS.\n\nActaully the add-on here is the main build file.  Think of the imported file as\na generic template that gets refined by the main build file.", "attachment_id": null, "id": 71177, "creator": "bodewig@apache.org", "time": "2005-02-18T14:33:24Z", "bug_id": 33282, "creation_time": "2005-02-18T14:33:24Z", "is_private": false}]