[{"count": 0, "tags": [], "bug_id": 33414, "attachment_id": null, "text": "With JDK 1.5, it should be possible to run xml-security without an Apache Xalan\nin the path, but the Init routine (and possibly other code) imports\norg.apache.xpath directly instead of supporting javax.xml.xpath and being\nlibrary independent.\n\nNote that Sun provides a JAXP 1.3 package for JDK 1.4, so if xml-security\nswitched, it would still support JDK 1.4. If support for JDK 1.3 is still\nrequired, perhaps other ant tricks could be used to deal with that.", "id": 70559, "time": "2005-02-06T20:51:27Z", "creator": "cantor.2@osu.edu", "creation_time": "2005-02-06T20:51:27Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 33414, "attachment_id": null, "id": 70645, "time": "2005-02-08T22:11:31Z", "creator": "raul-info@r-bg.com", "creation_time": "2005-02-08T22:11:31Z", "is_private": false, "text": "Sadly I haven't see any good way to mantain xalan and JAXP xpath at the same\ntime(and I have spent couple of hours).\n\nThe main problem is that the support neaded to define the here() xpath function\nis not exported in the JAXP 1.3. You can see the noted in the XPathFunctionResolver:\n\n\"\"\"In particular, the resolver is only called for functions in an another\nnamespace (functions with an explicit prefix). This means that you cannot use\nthe XPathFunctionResolver to implement specifications like XML-Signature Syntax\nand Processing which extend the function library of XPath 1.0 in the same\nnamespace. This is a consequence of the design of the resolver.\"\"\"\n(It seems aimed explicetly for us)\n\nI know that here support is not needed in all cases(me myself have\nimplementations that never use it), but I don't think it worths to complicate\nthe design a lot to give less funcionality.\n\nAnyway if there is some working patch for this funcionality I will recosinder my\nposittion."}, {"count": 2, "tags": [], "bug_id": 33414, "attachment_id": null, "id": 70647, "time": "2005-02-08T22:21:02Z", "creator": "cantor.2@osu.edu", "creation_time": "2005-02-08T22:21:02Z", "is_private": false, "text": "Thanks...is there any value though in making this part of the code optional or\ndisabling it via a property for people using the library in a manner that\ndoesn't require XPath?\n\nI'm under the impression that using enveloped signatures in a simple manner\ndoesn't require it. That means at least some of us could disable the xalan\ndependency and basically run without it entirely. It used to be that xmlsec Init\nused all those XPath calls, but now this looks like more of a proper dependency\nfor actual code in the signature system, and if that's not being used...\n\nIf I'm mistaken, sorry for wasting your time, just want to be sure there's not a\nway around this. The support mess waiting for me here is not small."}, {"count": 3, "attachment_id": null, "bug_id": 33414, "is_private": false, "id": 70658, "time": "2005-02-08T23:08:55Z", "creator": "raul-info@r-bg.com", "creation_time": "2005-02-08T23:08:55Z", "tags": [], "text": "I feel the same about running without xalan. I want to have xml security running\nin J2ME and having to have xalan is really a pain. I will try to take a look at\nit, and see how to fix it.but take on account that XPath is also used in\nsearching URI references(I think it will be faster to find them using DOM, but\nthat's other case). \nAnyway I don't think it will be included in 1.2.1 it is a very big change for a\nbugfix release. But for future development, it is a good goal."}, {"count": 4, "tags": [], "creator": "cantor.2@osu.edu", "text": "Thanks for considering it, as long as somebody's aware of the problem, that's\nall I was trying to accomplish anyway.", "id": 70659, "time": "2005-02-08T23:13:18Z", "bug_id": 33414, "creation_time": "2005-02-08T23:13:18Z", "is_private": false, "attachment_id": null}, {"text": "The xml-sec can now work without xalan in the endorsed even in the classpath. If\nit is not in the endorsed the here() function in xpath transformations will not\nwork. If xalan is not in the classpath the xpath transformation will not work.\nAll the other functionality does not need xalan. ", "tags": [], "bug_id": 33414, "is_private": false, "count": 5, "id": 91970, "time": "2006-08-06T17:47:55Z", "creator": "raul-info@r-bg.com", "creation_time": "2006-08-06T17:47:55Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 33414, "attachment_id": null, "id": 91971, "time": "2006-08-06T17:49:07Z", "creator": "raul-info@r-bg.com", "creation_time": "2006-08-06T17:49:07Z", "is_private": false, "text": "Closing old bugs."}]