[{"count": 0, "tags": [], "bug_id": 33493, "text": "per the email thread below, I am attaching the source code for the \nsolution to log the servlet session/request parameters and \nattributes. You guys can put it in the log4j sandbox (under the \nservlet package I assume). The code is well-documented and should \ncompile with the build.xml used in the sandbox build. (It needs \nservlet.jar and log4j.jar).\n\nThanks,\nWinston Huang\n\n----- Original Message -----\nFrom: \"Jacob Kjome\" <hoju@visi.com>\nTo: \"Log4J Users List\" <log4j-user@logging.apache.org>\nSubject: Re: contribution to log4j: servlet diagnostic context\nDate: Mon,  7 Feb 2005 11:19:35 -0600\n\n>\n>\n> It might be a contrib or it could go into the logging-log4j-sandbox \n> to bake for\n> a bit.  There are other classes there right now that depend on the \n> servlet and\n> other API's, so the servlet dependency is not really an issue.  I would post\n> code to the Dev list because I think you can attach .zip files there, which\n> isn't the case on the user list.  Either that, or open a bug in Bugzilla and\n> attach the code there.\n>\n>\n> Jake\n>\n> Quoting Winston Huang <weiqingh@mail.com>:\n>\n> > it's difficult to filter the log messages based on the parameter values.\n> > similar to the %t converter for printing thread name, how would you\n> > selectively print the log statement based on the thread name? (i.e. logs\n> > printed by thread called \"thread foo\" is logged but not logs from other\n> > threads.) I think layout is purely meant to customize the log layout.\n> >\n> > if you really want to do it, you may resort to post-processing \n> filter such as\n> > grep or chainsaw.\n> >\n> > I am not sure what and how authorization phase would help in this \n> case. Would\n> > you shed some light on it?\n> >\n> > I am re-organizing the code and will publish it soon. Should I just post to\n> > the user list or send it to some committer? My opinion is it belongs to\n> > contribs. It needs the servlet library to compile. You don't want \n> to have any\n> > of it in log4j.\n> >\n> > ----- Original Message -----\n> > From: \"Arthur Brown\" <arthur.brown@gmx.net>\n> > To: \"Log4J Users List\" <log4j-user@logging.apache.org>\n> > Subject: Re: contribution to log4j: servlet diagnostic context\n> > Date: Mon, 7 Feb 2005 11:13:26 +0100 (MET)\n> >\n> > >\n> > > Hi Winston,\n> > >\n> > > I was looking also for a simple solution for the same situation.\n> > >\n> > > I thought, I could use MDC for this problem.\n> > > You are absolutelly right it is specific to Aplication Server provider,\n> > > wether the servlet request is handled by the same thread.\n> > >\n> > > The only thing you can use for sure is the session object.\n> > >\n> > > Another problem is to filter the logging statement\n> > > with the key value paars, that contained in servlet session (or request).\n> > >\n> > > In your sample:\n> > > only the logging events with userId=user_id_foo\n> > > is looged and not for userId=user_id_bar\n> > >\n> > > For only session specific attributes, no servlet filter\n> > > is nessesary, because the logging specific attributes can be\n> > > writen during authorisation phase.\n> > >\n> > > My opinion, this stuff belongs to the core, because neither NDC, nor MDC\n> > > could be used for this purpose.\n> > >\n> > > Could you please post your solution.\n> > >\n> > > Ciao\n> > > Arthur Brown\n> > >\n> > >\n> > > > all,\n> > > >\n> > > > I have encountered a lot of situations where I would like to \n> inspect the\n> > > > servlet context information (such as session attributes, request\n> > > attributes)\n> > > > with the application logging, without touching the original \n> logging code.\n> > > > It's similar to the %t conversion specifier in the \n> PatternLayout to print\n> > > > out the current thread name. I ended up developing my own\n> > > > solution using servlet filter and extension\n> > > > to the layout classes. (I tried to use MDC and it didn't work \n> because the\n> > > > servlet request could be handled by different threads.) The result is\n> > very\n> > > > interesting. For instance, if you have this logging statement in your\n> > > servlet\n> > > > application:\n> > > >\n> > > > logger.debug(\"this is a test\");\n> > > >\n> > > > and you configure your pattern layout to be %p %S{userId} %m%n\n> > > >\n> > > > then the log output will be:\n> > > >\n> > > > DEBUG user_id_foo this is a test\n> > > >\n> > > > assuming the logging statement was executed inside a servlet \n> session with\n> > > > userId set to user_id_foo. I have created two new conversion\n> > > > specifiers %S and %R for attaching\n> > > > servlet session and request attributes. Would it make sense that\n> > > > I contribute it to Log4j in some way? I don't\n> > > > believe it belongs to the core. Maybe I can put it under contribs? Any\n> > > help is\n> > > > appreciated. Thansk,\n> > > > Winston", "id": 70763, "time": "2005-02-10T16:30:53Z", "creator": "weiqingh@yahoo.com", "creation_time": "2005-02-10T16:30:53Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 33493, "text": "Created attachment 14244\nsource code for printing servlet diagnostic info", "id": 70764, "time": "2005-02-10T16:31:59Z", "creator": "weiqingh@yahoo.com", "creation_time": "2005-02-10T16:31:59Z", "is_private": false, "attachment_id": 14244}, {"count": 2, "tags": [], "bug_id": 33493, "text": "I think this is an excellent contribution but unit tests are needed for documentation purposes and to ensure that things are working correctly as part of the build process.\n\nCould you provide a functional WAR file with sample output which can be refactored into something testable? ", "id": 119314, "time": "2008-08-03T03:21:52Z", "creator": "thorbjoern@gmail.com", "creation_time": "2008-08-03T03:21:52Z", "is_private": false, "attachment_id": null}]