[{"count": 0, "tags": [], "bug_id": 33497, "text": "While the SignJar task can accept a nested fileset of jars to be signed, there\nis no way to make the task output the signed jars to a different directory (the\njars will always be signed \"in-place\"). This makes it hard for the SignJar task\nto be \"smart\" and avoid re-signing jars when the nested fileset is used.\n\nPlease add a \"toDir\" attribute to the SignJar task. This attribute would likely\nonly be valid when a nested fileset is provided. It is also important that the\nSignJar task would NOT resign jars in the fileset if the dates of the source and\ndestination files indicate there is no need to resign them.\n\nThe ant mailing list archives mention one strategy for this: Have the SignJar\ntask extend the Copy task, thereby reusing the Copy task logic to determine if\nthe sign operation should occur.", "id": 70771, "time": "2005-02-10T18:23:20Z", "creator": "drollo@ets.org", "creation_time": "2005-02-10T18:23:20Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 33497, "text": "Are you saying you can make a single fileset return duplicate files, or is this\nonly an issue when using >1 fileset?", "id": 70774, "attachment_id": null, "creator": "mbenson@apache.org", "creation_time": "2005-02-10T19:03:39Z", "time": "2005-02-10T19:03:39Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 33497, "text": "Here's an example: \n\n    <signjar keystore=\"${security.keystore}\"\n        storepass=\"${security.storepass}\"\n        keypass=\"${security.keypass}\"\n        alias=\"${security.alias}\"\n        todir=\"dist/signed\"\n        >\n\n        <fileset dir=\"dist/unsigned\"/>\n    </signjar>\n\nNote: the \"todir\" attribute does not yet exist in the signjar target.\n\nThe above example would result in a signed copy of jars in \"dist/unsigned\" being\ncreated in \"dist/signed\". If I re-ran the same target again, Ant should realize\nthat none of the jars in \"dist/unsigned\" have been changed and would avoid\nre-signing the jars in \"dist/signed\". Does that clarify anything?\n", "id": 70775, "time": "2005-02-10T19:14:26Z", "creator": "drollo@ets.org", "creation_time": "2005-02-10T19:14:26Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 33497, "attachment_id": null, "text": "I know what you are asking for.  The intent of my question was to discover your\nmotivation.  As its documentation says, the signjar task is merely a wrapper to\nthe jarsigner executable, so any support of such an attribute as you suggest\nwould be a lot of kludge-work on the back end.  If you are able to sign the same\njar multiple times in one go, from a single fileset, I would consider that a\nbigger problem.  Also, you should be aware that a future version of Ant\n(possibly the next) will include an issigned condition to check for any, or a\nparticular signature on a jar.  I will say here that I am not familiar enough\nwith jar-signing to know what happens when you re-sign a jar; feel free to\nenlighten me on that subject.\nThanks,\nMatt", "id": 70776, "time": "2005-02-10T19:26:44Z", "creator": "mbenson@apache.org", "creation_time": "2005-02-10T19:26:44Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 33497, "attachment_id": null, "text": "I think that all that is been asked for is an extension\nof the \"signedjar\" (a.k.a \"tofile\" in a \"copy\" task) attribute.\n\nThis does (I think) the behaviour requested, but only for a single\nfile.\n", "id": 70777, "time": "2005-02-10T19:32:45Z", "creator": "peterreilly@apache.org", "creation_time": "2005-02-10T19:32:45Z", "is_private": false}, {"count": 5, "tags": [], "text": "Ah, hadn't seen that option.  So really the best solution for that is a mapper,\npossibly with force or overwrite semantics.  Still I'd like to clarify whether\nthe user is seeing multiple signatures of the same jar during one invocation of\nthe task against a single fileset.", "is_private": false, "id": 70783, "creator": "mbenson@apache.org", "time": "2005-02-10T20:19:51Z", "bug_id": 33497, "creation_time": "2005-02-10T20:19:51Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 33497, "text": "Matt,\n\nApologies if I'm totally missing the point of your question. What I'm asking for\nis indeed the exact same behavior that occurs with SignJar now when a single\nfile is used:\n\n    <signjar keystore=\"${security.keystore}\"\n        storepass=\"${security.storepass}\"\n        keypass=\"${security.keypass}\"\n        alias=\"${security.alias}\"\n        jar=\"dist/signed/one.jar\"\n        signedjar=\"dist/signed/one.jar\"\n        />\n\nThe very fist time the above example is called, a new output jar will be created\nand signed (dist/signed/one.jar).\nIf you call the same example 5 minutes later, the above example will NOT resign\nthe output jar (dist/signed/one.jar) if the input jar (dist/unsigned/one.jar)\nhas not changed.\n\nI'd like the example I provided in Additional Comment #2 (above) to behave in\nexactly the same way. Calling signjar many minutes later should avoid resigning\nany output jar who's input jar is unchanged.\n\nIn answer to you general \"jar-signing\" question: Resigning a jar with the same\ncredentials is not dangerous, except for the huge waste of time it incurs. The\nimportant point for this request is: When I talk about \"resign\", I am not\nrefering to a single invokation of ant signing jars multiple times. I am\nrefering to totally separate invocations of ant being smart enough to avoid\ndoing the work of signing a jar that is already signed when there is no reason\nto sign the jar again (as in exactly how the signjar task works today when the\n\"jar\" and \"signedjar\" attributes are used instead of a fileset). \n\nThis is a request for enhancement, and is NOT reporting a bug involving jars\nbeing signed multiple times during a single invocation.\n\nClear as mud?", "id": 70785, "time": "2005-02-10T20:57:35Z", "creator": "drollo@ets.org", "creation_time": "2005-02-10T20:57:35Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 33497, "attachment_id": null, "text": "That was my main problem, ensuring we were not talking about a malfunction on\nthe part of the file selection mechanism.  Again, a nested mapper element should\ndo half of the trick you are asking for.  Regarding the other half, is signjar's\nlazy attribute not sufficient?  It seems better than timestamps IMO.", "id": 70786, "time": "2005-02-10T21:12:13Z", "creator": "mbenson@apache.org", "creation_time": "2005-02-10T21:12:13Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 33497, "text": "Ah... I see now.  For some ? reason, the lazy attribute does not come into play\nwhen the signing is done in place.  In my limited understanding of the problem I\nwould call this a bug and the mapping an enhancement.", "id": 70788, "time": "2005-02-10T21:15:22Z", "creator": "mbenson@apache.org", "creation_time": "2005-02-10T21:15:22Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 33497, "text": "\n\n*** This bug has been marked as a duplicate of 23058 ***", "id": 72634, "time": "2005-03-17T18:06:38Z", "creator": "stevel@apache.org", "creation_time": "2005-03-17T18:06:38Z", "is_private": false, "attachment_id": null}, {"count": 10, "tags": [], "text": "(In reply to comment #9)\n> \n> *** This bug has been marked as a duplicate of 23058 ***\n\nOne question: The bug for which this has been marked as a duplicate may not be\nquite the same. If I read bug 23058, correctly, it is expecting all the jar\nfiles in the input fileset to be combined into a single output jar.\n\nThe intention of my RFE is to provide an input fileset containing multiple jar\nfiles, and to have the SignJar task produce multiple output jars in a specified\noutput directory (one signed output jar for each input jar).\n\nDan", "attachment_id": null, "bug_id": 33497, "id": 72639, "time": "2005-03-17T18:18:52Z", "creator": "drollo@ets.org", "creation_time": "2005-03-17T18:18:52Z", "is_private": false}]