[{"count": 0, "attachment_id": null, "bug_id": 33527, "text": "I'm not sure if this is intended functionality, which is why I'm filing this as\nan enhancement and not a bug.  If it's indeed a bug, please correct me.\n\nWe're noticing that if AuthAuthoritative is off, mod_auth returns DECLINED back\nto the core if the user ID provided is not in the password file.  This results\nin the server's request.c handling the DECLINED and calling decl_die().  The\ndrawback of this is that an internal server error is thrown back to the client\nrather than the appropriate 401.\n\nI understand the technical reasons for this (the mod_auth returning back a\nDECLINED so that additional modules can process) and the core really doesn't\nknow the root reason for the DECLINE, but perhaps it should, and be able to\nproperly throw back a HTTP_UNAUTHORIZED to the client?", "id": 70862, "time": "2005-02-11T21:50:38Z", "creator": "dopey@moonteeth.com", "creation_time": "2005-02-11T21:50:38Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 33527, "text": "Forgot one more piece.  Because the 500 is thrown back, the client web browsers\nstill cache the \"failed\" auth credentials.  This results in having to restart\n(or clear the client http auth if the browser is capable of this) to be able to\nretry connecting to the URL.  This doesn't seem like an ideal situation.", "id": 70863, "time": "2005-02-11T21:52:18Z", "creator": "dopey@moonteeth.com", "creation_time": "2005-02-11T21:52:18Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 33527, "attachment_id": null, "text": "This is exactly the problem I'm currently faced with when trying to connect a\nPTC Windchill PDMLink system (coming with Apache2) to a Microsoft Active\nDirectory Server combined with a local password file. \nMy workaround is to display a special error-500 page telling the user to restart\nthe browser (which is not the ideal solution to this problem).", "id": 92299, "time": "2006-08-17T14:31:57Z", "creator": "christian.lenhard@leoni.com", "creation_time": "2006-08-17T14:31:57Z", "is_private": false}, {"count": 3, "tags": [], "creator": "nick@webthing.com", "attachment_id": null, "id": 138550, "time": "2010-07-20T08:32:50Z", "bug_id": 33527, "creation_time": "2010-07-20T08:32:50Z", "is_private": false, "text": "This looks like a genuine bug, but no longer applies.  If a similar problem is found in 2.2 or trunk it should be fixed, but I think we've dealt with it.  Closing the 2.0.x bug: if 2.0.latest isn't fixed, it never will be."}]