[{"count": 0, "tags": [], "text": "I've been looking at taskdefs.compilers and been playing with adding in functionality for the AspectJ \ncompiler following in a similar vein as the Jikes compiler adapter.  I still have a couple of issues to \nresolve, but the simplicity of adding the functionality is a real eye-opener.  I've only been on this for \nabout 2 hours and I've got a basic version working (albeit not through Eclipse, some kind of funky \nenvironment problems there).\n\nSo my question is, would this addition be valuable?  At the moment I'm simply doing this to look at the \nCompilerAdapter design and see how it works.  I know that there's a taskdef for ant for AspectJ (iajc) \ncompiler, but as Ant supports other compilers internally (Jikes, Gjc, even MS crappy compiler), I don't \nthink its outragous to suggest adding core support for AspectJ (given how trivial it seems so far)\n\nI've still got to work on this a bit more, but comments on viability would be welcome.\n\nKev\nPS I'd post to the dev list as normal, but my ISPs smtp server seems to be dead - sorry", "attachment_id": null, "id": 70883, "creator": "kevin.jackson@it.fts-vn.com", "time": "2005-02-12T13:28:38Z", "bug_id": 33534, "creation_time": "2005-02-12T13:28:38Z", "is_private": false}, {"count": 1, "tags": [], "creator": "kevin.jackson@it.fts-vn.com", "attachment_id": null, "text": "Ok, so after a quick break to watch the football...\n\nI've implemented a compiler for iajc, but I've only tested with an old version of AspectJ, this has one \nmajor problem:\n\nOld versions (ajc) require that aspect source files be called foo.aj, not foo.java.  New versions of AspectJ \ncompiler (iajc) don't have this deficiency.  To get it working with the old (ajc) I replaced the \nGlobPatternMapper with a RegexpPatternMapper so that it could pull in *.aj and *.java files.  I'm now \ngoing to download the newer compiler (iajc) and rename my files, revert the RegexpPatternMapper to \nthe GlobPatternMapper and see if this works.\n\nApart from this problem (which should be resolved with the newer compiler), all the changes will be \nlocal to taskdefs.compilers.\n\nObviously this implementation hasn't been thoroughly tested, and as yet I've only got a barebones \n(compile, no fancy debug options etc) implemetation completed.\n\nPros:\n- enables compilation of AspectJ code within Ant without having to use an external taskdef\n- iajc is based on the eclipse compiler and will happily compile 'normal' Java code along with aspects\n- minimal impact on the codebase (one change to CompilerAdapterFactory, and a new Iajc class)\n\nCons:\n- still requires aspectjtools.jar on the classpath for the target eg:\n\n  <classpath>\n            <pathelement location=\"${ajlibs}/aspectjtools.jar\"/>\n            <pathelement location=\"${build}\"/>\n  </classpath>\n\nAgain sorry for using Bugzilla for this, but my ISP is still not happy.\nKev", "id": 70886, "time": "2005-02-12T17:06:14Z", "bug_id": 33534, "creation_time": "2005-02-12T17:06:14Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 33534, "attachment_id": 14263, "text": "Created attachment 14263\nAspectJ Compiler (Ajc)\n\nThis implementation allows you to compile aspects and java source files with\nthe AspectJ compiler.\nRequires:\n- all source files to have a .java suffix\n- AspectJ to be installed on the system (just as Jikes compiler requires Jikes\nexecutable)\n- AspectJ compiler (ajc) to be on the system PATH (same as Jikes)\n\nTested with basic options (source, destdir etc), will post build.xml next\n\nKev", "id": 70891, "time": "2005-02-13T08:22:23Z", "creator": "kevin.jackson@it.fts-vn.com", "creation_time": "2005-02-13T08:22:23Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 33534, "attachment_id": 14264, "text": "Created attachment 14264\nbuild file to test with\n\nbuild file to test with", "id": 70892, "time": "2005-02-13T08:25:15Z", "creator": "kevin.jackson@it.fts-vn.com", "creation_time": "2005-02-13T08:25:15Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 33534, "attachment_id": 14265, "id": 70893, "time": "2005-02-13T08:27:08Z", "creator": "kevin.jackson@it.fts-vn.com", "creation_time": "2005-02-13T08:27:08Z", "is_private": false, "text": "Created attachment 14265\nFirst of two source files to test with"}, {"count": 5, "tags": [], "creator": "kevin.jackson@it.fts-vn.com", "text": "Created attachment 14266\nSecond of two source files to test with (aspect source)", "id": 70894, "time": "2005-02-13T08:27:53Z", "bug_id": 33534, "creation_time": "2005-02-13T08:27:53Z", "is_private": false, "attachment_id": 14266}, {"count": 6, "tags": [], "bug_id": 33534, "attachment_id": null, "text": "Use the provided ajc task", "id": 109114, "time": "2007-10-08T02:52:07Z", "creator": "foamdino@gmail.com", "creation_time": "2007-10-08T02:52:07Z", "is_private": false}]