[{"count": 0, "tags": [], "bug_id": 33604, "is_private": false, "text": "The classconstants filter reader seems to be limited in the number of constants \nit can read from a single class file. I have a class with 184 constants of \nvarious types (int, short, string), which I want to load as properties with \nloadproperties task, but I keep getting an IOException when trying to load the \nfile. \nI have to reduce them to 84 for classconstants to process the file, but this \nmay not be a viable solution.", "id": 71073, "time": "2005-02-16T12:48:13Z", "creator": "ronen@jacada.com", "creation_time": "2005-02-16T12:48:13Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 33604, "attachment_id": 14297, "text": "Created attachment 14297\nThe source file of the class that can't be read by classconstants", "id": 71074, "time": "2005-02-16T12:50:15Z", "creator": "ronen@jacada.com", "creation_time": "2005-02-16T12:50:15Z", "is_private": false}, {"count": 2, "attachment_id": 14298, "creator": "jan@materne.de", "text": "Created attachment 14298\ntest scenario\n\nI prepared a testscenario (buildfile, failing and passing sources)", "id": 71077, "time": "2005-02-16T13:44:48Z", "bug_id": 33604, "creation_time": "2005-02-16T13:44:48Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "Sebastian.Leske@bigfoot.de", "text": "The problem appears to depend on the version of Ant.\n\nI tried the test scenario supplied (attachment #2 to this bug) under\nboth Ant 1.6.1 and Ant 1.6.2.\n\nBoth \"test-should-fail\" and \"test-should-pass\" succeed under 1.6.1,\nwhile _both_ fail under 1.6.2. Weird...\nMight this be a bug introduced with Ant 1.6.2?\n\nTest system: \nSuSE Linux 9.1\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.4.2-b28)\nJava HotSpot(TM) Client VM (build 1.4.2-b28, mixed mode)", "id": 73680, "time": "2005-04-15T10:24:06Z", "bug_id": 33604, "creation_time": "2005-04-15T10:24:06Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 33604, "is_private": false, "text": "What is the platforms default characterset? (according to java)\n\nIt seems that the bytes comprising the class are first translated into a String\nusing the default charset (unless specified otherwise) and that that String is\ntranslated back into the bytes comprising the class (always using the default\ncharacter set). With certain encoding schemes this will most likely fail at some\npoint, as either the bytes obtained from the string do not match the bytes in\nthe file, or the file contains a sequence of characters that will trigger an\nIOException because the bytes do not form legal characters and can therefore not\nbe read into a String.\n\n", "id": 73720, "time": "2005-04-15T21:19:29Z", "creator": "jkf@apache.org", "creation_time": "2005-04-15T21:19:29Z", "attachment_id": null}, {"count": 5, "attachment_id": null, "creator": "peterreilly@apache.org", "is_private": false, "id": 93700, "time": "2006-09-17T22:10:19Z", "bug_id": 33604, "creation_time": "2006-09-17T22:10:19Z", "tags": [], "text": "Martijn is correct, this is a character\nencoding problem. Both UTF-8 (common as default on\nlinux) and CP152 (common as default on windows) readers cannot read\nin an arbitary sequence of bytes, convert them\nto characters and back again to bytes. CP152 can read/write\nmost, but not all, 8-bit bytes. this is the reason that the\nRonen (on windows) is able to read smaller files (less chance of illegal\nbytes). The reason Sebastian sees failures for both the files\nis that UTF-8 has a lot more illegal byte sequences than CP152.\nWhy it works for ant 1.6.1, I am not too sure - perhaps the\ndefault character encoding was set to latin1 ?.\n\nIn any case using the default encoding is clearly incorrect, so I have\nmade a modification to ant to use ISO-8859-1 as the character\nencoding to use to convert the characters back to bytes, and updated the manual\nwith a big block of text to say that one has to use ISO-8859-1 as\nthe encoding. The handling of exceptions has also been altered\nto remove the spurious IOException, as the exception reporting\nthe problem was thrown away.\nThanks for the report and for the brillant test case (will\nbe incorporated into ant test suite when I get a chance).\n(Missed the cut for ant 1.7.0beta2, will be in release after that!)"}, {"count": 6, "tags": [], "text": "*** Bug 40584 has been marked as a duplicate of this bug. ***", "is_private": false, "id": 94023, "creation_time": "2006-09-22T20:46:12Z", "time": "2006-09-22T20:46:12Z", "creator": "peterreilly@apache.org", "bug_id": 33604, "attachment_id": null}]