[{"count": 0, "tags": [], "bug_id": 33607, "attachment_id": null, "id": 71084, "time": "2005-02-16T15:07:11Z", "creator": "mru@inprovide.com", "creation_time": "2005-02-16T15:07:11Z", "is_private": false, "text": "From batik-users mailing list:\n\n> I'm using Batik to dynamically generate and rasterize some graphics\n> from a tomcat servlet.  I supply my own truetype font to make sure the\n> correct font gets used.\n>\n> The problem is that something, presumably Batik, is copying this font\n> file to a temporary file (in the tomcat temp directory), and fails to\n> remove it.  Over time, I get hundreds of copies of the same file there\n> (with names like +~JF4554.tmp), and have to delete them manually.\n\n    I'm fairly certain that it is not Batik, we use Font.createFont\nwhich takes an InputStream.  I would suspect that this method is\ncopying the file so it can use some sort of native library to read\nthe font...  Not that this helps you, I'm just \"passing the buck\" to\nthe JVM :)\n\n> Am I doing something wrong?  I am certain that I am not telling anyone\n> to do the copying, so I can't see how to make file go away when not\n> needed.\n\n    I have two suggestions.\n[snip]\n\t2) Add a font cache similar to our Image cache into Batik.\nThis way as long as the same URL was used each time for the font, you\nwould only create one instance of the font.  This would probably make\na minor speed improvement.  I could point out the places where changes\nwould need to be made (I don't think this would be difficult).\n\n     Even if you decide to go with #1 for now could you file a Bugzilla\nrequesting #2 so it's not forgotten (I think it's a good idea)."}, {"count": 1, "tags": [], "creator": "deweese@apache.org", "is_private": false, "text": "There is a report that this problem is fixed with JDK 1.5.\n", "id": 71813, "time": "2005-03-04T12:16:11Z", "bug_id": 33607, "creation_time": "2005-03-04T12:16:11Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 33607, "attachment_id": null, "id": 40403, "time": "2005-03-22T12:16:24Z", "creator": "deweese@apache.org", "creation_time": "2005-03-22T12:16:24Z", "is_private": false, "text": "Reassigning all open bugs to the development list.\nSorry for the mass mailing."}]