[{"count": 0, "tags": [], "bug_id": 33771, "text": "The ftp task could save us some typing by using a default \"anonymous\" user name\nand password, if none is specified, rather than refusing to do anything.", "id": 71611, "time": "2005-02-28T14:36:53Z", "creator": "eric.jain@gmail.com", "creation_time": "2005-02-28T14:36:53Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 33771, "is_private": false, "id": 75606, "attachment_id": null, "creator": "scohen@apache.org", "creation_time": "2005-05-30T20:33:57Z", "time": "2005-05-30T20:33:57Z", "text": "But isn't the standard protocol with anonymous FTP to leave your email address\nas the password?  Granted you can lie, but should Ant encourage this?  I think\nnot.  And what password WOULD you use?\n\nSo at most, we save one property from being defined.\n\n"}, {"count": 2, "tags": [], "bug_id": 33771, "attachment_id": null, "text": "ncftp uses \"NcFTP@\" as a default password. Now you may argue that Ant is morally\nsuperior to ncftp, but then you should also insist that the user specify a\ncustom user agent string with contact information when using the \"get\" task :-)\n\nMy suggestion: Default the username and password to \"anonymous\" and \"ant@\". It's\na trivial improvement, but it does help make Ant a little bit simpler and less\ncumbersome to work with.\n", "id": 75621, "time": "2005-05-31T08:27:59Z", "creator": "eric.jain@gmail.com", "creation_time": "2005-05-31T08:27:59Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 33771, "text": "I still think that in the majority of cases where Ant is used to perform FTP we\nare not using anonymous access.  The user is contacting some site repeatedly, to\nwhich he has real user access and getting/putting/updating files.  While I can\nimagine use cases for Ant involving anonymous access, I think they are the\nminority.  I could be wrong.  But ask yourself why this request has NOT been\nmade very much, if at all, before.\n\nI think you are talking about a convenience default for what is a rather\nuncommon use case.  Instead of this, however, we are beginning to think about\nsomething that would much more powerfully increase the convenience factor of\nusing the ftp task, for many more users.  That is, separating the connection\nfrom the action performed and leaving the connection live for several\nconsecutive actions.  So instead of specifying username, password, server, port,\nsystem type, custom settings on every ftp action performed, you could specify\nall of these once for a whole group of actions.  Each action would not have to\nbe a separate call to the ftp task.", "id": 75630, "attachment_id": null, "creator": "scohen@apache.org", "creation_time": "2005-05-31T12:41:14Z", "time": "2005-05-31T12:41:14Z", "is_private": false}, {"count": 4, "tags": [], "creator": "eric.jain@gmail.com", "attachment_id": null, "id": 75631, "time": "2005-05-31T13:04:49Z", "bug_id": 33771, "creation_time": "2005-05-31T13:04:49Z", "is_private": false, "text": "I agree, most people probably use the ftp task for publishing generated\nartifacts. On the other hand the ftp task can also be useful for retrieving\nrequired libraries that are not bundled with a project, without having to resort\nto a full blown dependency management tool. In any case, it's just convenience\nwe are talking about here...\n\nI don't have any cases where I need to perform several operations, and if I had,\nI would probably write a macro. Having a better mechanism like you suggest would\nof course improve performance, especially if you need to perform dozens of\noperations (now that must be rare :-)."}]