[{"count": 0, "tags": [], "creator": "noorani_786@yahoo.com", "attachment_id": null, "text": "The web application I am load testing is written in Java.  Apache is the web \nserver, WebLogic the web container.  We are using SiteMinder for user \nauthentication.  First I will describe the scenario:\n\n1.  Send HTTP Request to login user. Siteminder logs user in successfully and \nsends a FORMCRED cookie back to the client.  \n2.  The second HTTP Request to any page on the site works successfully.  It \nsends back the FORMCRED cookie to the server.  SiteMinder picks up the \nFORMCRED cookie, validates it and sets it to null (or empty string) and sends \nback a SMSESSION cookie.  \n3.  The third and all subsequent requests then send SMSESSION cookie\nto the server.  They dont send the FORMCRED cookie anymore since it is now \nnull. \n\nThis is how IE and Netscape work when sending cookies to the server.  Neither \nof them send cookies with null value back to the server.  JMeter, on the other \nhand, sends all cookies back to the server even if they have been nulled out.  \nSo, on the third request JMeter sends FORMCRED back to the server.  SiteMinder \nsees it and tries to validate it.  Since FORMCRED is null (or empty string), \nSiteMinder kicks the user back to the login page.  Thus my test case fails \nwhen I run it in JMeter.  \n\nI fixed this issue my modifying \norg.apache.jmeter.protocol.http.control.CookieManager.java file.  I modified \nthe public void add(Cookie) method.  Below is my modification:\n\n/**\n    * Add a cookie.\n    */\n   public void add(Cookie c) {\n\n      /** My Modification Start */\n      if (c.getValue() == null || c.getValue().equals(\"\")) {\n         removeCookieNamed(c.getName());\n      }\n      /** My Modification End */\n      else {\n         JMeterContext context = getThreadContext();\n         getCookies().addItem(c);\n         if (context.isSamplingStarted()) {\n            context.getVariables().put(c.getName(), c.getValue());\n         }\n      }\n   }\n\nI am not sure if I have fixed a bug or if the bug is in SiteMinder since it \nshould be reading FORMCRED if it is null.  Either way, I wanted to submit my \nmodification and let you decide if you want to put it into JMeter.\n\nNizar Noorani\nConsultant, Tallan, Inc.\nnoorani_786@yahoo.com", "id": 71673, "time": "2005-03-01T20:21:51Z", "bug_id": 33796, "creation_time": "2005-03-01T20:21:51Z", "is_private": false}, {"count": 1, "text": "Thanks for the report.\n\nDid a bit of searching in RFCs etc and it does look as though cookies with\nnull/empty values are not supposed to be sent.\n\nHowever, just in case the original behaviour is valid in some circumstances, the\ncookie is only deleted if the proporty \"CookieManager.delete_null_cookies\" not\nset to false (i.e. the default is true).\n\nThis change has been applied to the 2.0 branch.", "bug_id": 33796, "is_private": false, "id": 71863, "time": "2005-03-05T14:25:23Z", "creator": "sebb@apache.org", "creation_time": "2005-03-05T14:25:23Z", "tags": [], "attachment_id": null}]