[{"count": 0, "tags": [], "creator": "wojtek@brandlay.com", "is_private": false, "id": 71715, "attachment_id": null, "bug_id": 33807, "creation_time": "2005-03-02T14:07:31Z", "time": "2005-03-02T14:07:31Z", "text": "I'm running 5.5.4 with sun jdk 1.4 (but this problem exists probably with every\njdk version and with many tomcat versions).  I have a very loaded site.  When I\nrestart tomcat it gets immediately hit by hundreds of clients.  The load goes up\nand processing requests starts taking a very long time.  As a result all the\nworker threads become busy and I get the following message in the log:\n\nMar 1, 2005 3:33:31 PM org.apache.tomcat.util.threads.ThreadPool logFull\nSEVERE: All threads (900) are currently busy, waiting. Increase maxThreads (900)\nor check the servlet status\n\nAfter this tomcat stops processing new requests.  I believe that the correct\nbehaviour would be to continue processing requests with the existing threads and\nprocessing new as the threads become free.  But in this case, as I said tomcat\nsimply stops accepting new connections and 'hangs' not doing anything.\n\nIncreasing max threads seems to be a workaround but not a good one."}, {"count": 1, "tags": [], "bug_id": 33807, "attachment_id": null, "text": "My guess is that you may be having deadlocks somewhere in your code.\n\nYour report is also very incomplete (no mention of configuration, platform,\netc). I recommend posting to tomcat-user instead.", "id": 71717, "time": "2005-03-02T14:53:10Z", "creator": "remm@apache.org", "creation_time": "2005-03-02T14:53:10Z", "is_private": false}, {"count": 2, "tags": [], "creator": "yoavs@computer.org", "attachment_id": null, "text": "Yeah, ditto on Tomcat's suggestions.  There's also the tunable acceptCount\nparameter available for your use.  If your load is so heavy that both maxThreads\nand acceptCount fill up, you need to consider alternative (e.g. cluster or\nload-balanced) architectures.", "id": 72748, "time": "2005-03-23T17:33:59Z", "bug_id": 33807, "creation_time": "2005-03-23T17:33:59Z", "is_private": false}]