[{"count": 0, "tags": [], "text": "I recently upgraded ANT from 1.5 to 1.6.2.  My builds started failing with \ntiming problems because of the recent addition of granularity.  Prior to \n1.6.2, COPY would perform an absolute comparision of timestamps to see if a \nfile should be copied.  It now uses a 2second granularity window instead, when \nANT is run on \"DOS\"-based systems.  This new 2second window breaks my builds \nunder Windows 2000 and Windows Server 2003.\n\nI don't know the history behind this change.  Perhaps the 2 second grace \nperiod is realistic for old MS-DOS systems.  But it is not realistic in modern \nWindows systems.\n\nAssuming that 2-seconds is reasonable for MS-DOS systems, I propose that the \nANT family test be refined so that the default for Windows systems (NT and \nbeyond, at least) is 0 and a granularity of 2 be limitted to older systems.\n\nEven better, the granularity should always default to 0, and the build.xml \nauthor should be allowed to override the granularity where it is appropriate \nto the local environment.  This would preserve backwards compatability, remove \na special case, and be much more understandable in general.", "is_private": false, "id": 71977, "creator": "gjfdh@yahoo.com", "time": "2005-03-08T16:41:39Z", "bug_id": 33906, "creation_time": "2005-03-08T16:41:39Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 33906, "attachment_id": null, "text": "The reason behind this change is that FAT16 and FAT32 filesystems have limited\ngranularity, even when running under WinNT. It is not enough to check the OS, it\nis a per filesys problem, which means that it is essentially a per-directory\nfeature on a sufficiently distributed filesys. \n\nThis is why, when changing this stuff, we added a granularity attribute to\n<copy>; you can select a tighter granularity if need be. Note that even on unix,\nwe have a granularity of 1; I wouldnt go for zero on anything. Millisecond\naccuracy is what we really need, but no FS goes to that detail.\n\nI'm marking as worksforme because of the granularity option. This isn't quite\nwhat you want, which is a broad, cross-system granularity switch, but probably\nthe best we can easily do. \n\nHowever, I am thinking about whether we could have a generic\nant.filesys.granularity property that sets it for a project.", "id": 71980, "time": "2005-03-08T17:20:29Z", "creator": "stevel@apache.org", "creation_time": "2005-03-08T17:20:29Z", "is_private": false}]