[{"count": 0, "text": "Scenario:\nApache runs under a user account instead of the SYSTEM account.\n\nApache is installed at c:\\web\\apache2\\\nWeb roots are located at d:\\sites\\domainname\\www\n\nThe Apache account has all the necessary permissions for both directories, \ntheir files and subdirs.\n\nProblem:\nApache unnecessarily requires read access to all the parent paths in order to \nstart up. For instance: it will attempt to open c:\\, then c:\\web\\, then \nc:\\web\\apache2, then d:\\, then d:\\sites, then d:\\sites\\domainname and finally \nd:\\sites\\domainname\\www.\n\nSince it only has read access to the two paths mentioned earlier, any attempt \nto open for example c:\\ will fail. However, traversal rights are granted by \nthe default setting in the local security policy so the proper thing to do \nwould be for Apache to just open the supplied path directly instead of \ncrawling the directory tree.\n\nIn this scenario a failed attempt to get read access to d:\\ will result in \na \"Directory d:\\sites\\domainname\\www does not exist\" error in the event log, \nwhich is clearly wrong.\nIf Apache does for some reason need to open each directory for read, the error \nmessage should reflect a failed attempt and indicate a potential permission \nproblem instead of concluding that the target directory does not exist.", "creator": "gorilla@europe.com", "attachment_id": null, "id": 71970, "time": "2005-03-08T16:03:03Z", "bug_id": 33903, "creation_time": "2005-03-08T16:03:03Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "I forgot to include the workaround:\nGrant the Apache user the 'List Folder / Read Data' permission for each parent \ndirectory up to and including the root.\n\nThe workaround is trivial, but complicated by the fact that the initial error \nmessage doesn't accurately pinpoit the problem (namely the suggestion that \ntarget directory doesn't exist, rather than indicate than a permission \nproblem).", "is_private": false, "id": 71973, "creator": "gorilla@europe.com", "time": "2005-03-08T16:10:17Z", "bug_id": 33903, "creation_time": "2005-03-08T16:10:17Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "wrowe@apache.org", "is_private": false, "text": "\"Apache unnecessarily requires read access to all the parent paths\"\n\nyes; very simply - we cannot determine that your webfil~1 request was\nthe very same as webfileset meaning there's no way to offer any support\nfor <directory > blocks.  So this is by design, and as far as apache\nwas concerned, that file certainly was not found.", "id": 112076, "time": "2007-12-21T22:16:04Z", "bug_id": 33903, "creation_time": "2007-12-21T22:16:04Z", "attachment_id": null}]