[{"attachment_id": null, "tags": [], "bug_id": 33940, "is_private": false, "count": 0, "id": 72084, "time": "2005-03-09T21:48:58Z", "creator": "daniel.fleischer@active-endpoints.com", "creation_time": "2005-03-09T21:48:58Z", "text": "I'm using the WebServices(SOAP) Request and a Graph Results listener a simple \nTest Plan I'm using to become familiar with JMeter.  I'll run 10 Threads, with \na 3 second delay and have it Loop for a count of 100.  \n\nI'll start running the test and the \"Throughput\" value displayed on the bottom \nof the Graph Results page will show a value such as \"515.185/minute\".  The \ngreen line shown in the Graph itself will be displayed in a position \nrepresenting this value, this is correct behavior.  However, sometimes when \nrunning the Test Plan, when the \"Number of Samples\" reaches 700+ \nthe \"Throughput\" value will be displayed with a value such as \"4.322764E-\n5/minute\".  When this happens the green line shown in the Graph drops all the \nway to the bottom.  After this happens, \"sometimes\" when I try to run another \ntest the green Graph line will stay at the bottom of the graph, even though \nthe \"Throughput\" value is a value such as \"515.185/minute\".  I see no errors \nin the console or in the log file, nor are there any errors in the application \nunder test."}, {"attachment_id": null, "tags": [], "bug_id": 33940, "is_private": false, "count": 1, "id": 73273, "time": "2005-04-04T21:56:14Z", "creator": "daniel.fleischer@active-endpoints.com", "creation_time": "2005-04-04T21:56:14Z", "text": "The problem was caused by bugs within the WebServices(SOAP) Request feature.  \nA developer at my company has resolved the errors and submitted his fixes \nthrough the normal procedure you folks have in-place."}, {"count": 2, "tags": [], "bug_id": 33940, "is_private": false, "text": "I was mistaken with my previous post that the bug was fixed. The throughput \nbug still exists and would show up in other circumstances when there's an \nerror generating a sample.\n", "id": 73275, "time": "2005-04-04T22:20:39Z", "creator": "daniel.fleischer@active-endpoints.com", "creation_time": "2005-04-04T22:20:39Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 33940, "attachment_id": null, "is_private": false, "id": 151032, "time": "2011-10-29T16:42:05Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-10-29T16:42:05Z", "text": "Cannot reproduce with trunk"}]