[{"attachment_id": null, "tags": [], "creator": "jbaden@usc.edu", "text": "The scheme directive appears to be acting up on the coyote connector in tomcat\n4.1.x (tried multiple 4.x flavors).\n\nWe have an app that does a fair share of:\n   response.sendRedirect(request.getContextPath() +\n\"/render.userLayoutRootNode.uP\");\nso we've set\n   scheme=\"https\"\nin the connector configs.\n\nThis 'works' rather sporadically... sometimes we'll get the redirect and\nsometimes not, but no pattern is visible, or even reproducible.  Without\nexplicitly setting the scheme to \"https,\" the redirects are consistently done\nvia http.\n\nFor the record, our setup is such that the https redirect would hit a load\nbalancer which SSL offloads and transmits to port 80 on apache, which then hands\noff to mod_jk/tomcat.\n\nThe inconsistency of this whole issue suggests it may be a misconfigured load\nbalancer, or that the configs across the servers aren't identical, but those\nelements have been double and triple checked.\n\nGoing through the amount of notes, there appears to be a known issue with\nscheme, but nothing conclusive.  If anyone has any suggestions, feedback, or\ntips, please drop me a line.  In the meantime, I'll try to reproduce (or more\naccurately, hopefully not reproduce) the same issue with 5.x\n\nThx.", "count": 0, "id": 72242, "time": "2005-03-11T22:22:16Z", "bug_id": 33970, "creation_time": "2005-03-11T22:22:16Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 33970, "text": "Without any way to reproduce this this, tracking this down is going to be tricky\nto say the least. The number of elements that appear to be involved isn't going\nto help either.\n\nIt would help considerably if you could do the following:\n- provide references for the 'known issue' with scheme\n- test with 4.1.31\n\nAlso, anything you can do in the way of providing a test case would help enormously.\n\nWhilst the issue isn't repeatable it does sound as if it happens pretty\nfrequently. I suggest logging the appropriate request/response headers in\ntomcat, apache and anywhere else you can to see if this sheds any light on the\nissue.", "id": 72280, "time": "2005-03-12T13:05:53Z", "creator": "markt@apache.org", "creation_time": "2005-03-12T13:05:53Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "abbotter@bc.edu", "is_private": false, "count": 2, "id": 72762, "time": "2005-03-23T19:36:37Z", "bug_id": 33970, "creation_time": "2005-03-23T19:36:37Z", "text": "Very likely a dup of bug 32781.\nThere has been no release since the fix was put in cvs.\n(5.0.x line also borked)"}, {"count": 3, "tags": [], "bug_id": 33970, "attachment_id": null, "text": "It looks very much like a duplicate so I am going to resolve this bug as such.\n\nThe fix will be included with the next release. If you are able, please test\nwith the latest build from CVS and re-open if the issue is not resolved.\n\n*** This bug has been marked as a duplicate of 32781 ***", "id": 73653, "time": "2005-04-14T19:44:34Z", "creator": "markt@apache.org", "creation_time": "2005-04-14T19:44:34Z", "is_private": false}, {"count": 4, "tags": [], "creator": "Keith@Apache.org", "is_private": false, "text": "backported to 5.0", "id": 73819, "time": "2005-04-19T16:51:55Z", "bug_id": 33970, "creation_time": "2005-04-19T16:51:55Z", "attachment_id": null}]