[{"count": 0, "tags": [], "creator": "netspam@shic.co.uk", "attachment_id": null, "id": 72496, "time": "2005-03-16T16:38:27Z", "bug_id": 34037, "creation_time": "2005-03-16T16:38:27Z", "is_private": false, "text": "I've a few files which represent a draft for a very simple website - plain\nXHTML/simple Javascript and a couple of jpeg photos. I can view these files\nfine when I use a file://... URI - but run into a curious problem when I try to\naccess them via Apache on my local PC. I plop all the files into the htdocs\ndirectory and point my browser (I've tried Firefox; IE6 and Lynx - all generate\na similar problem) at http://localhost/ as well as trying browsers on other PCs\n- all my attempts exhibit the same problem.\n\nWhile there is no problem with any of the XHTML pages (each of which is only a\nfew K) Whenever I point my browser at a photograph (One 124K and one 202K) I\nseem to only correctly receive the first portion of each file... from\napproximately two thirds of the way down each Jpeg is displayed corrupt. When I\ndo a binary comparison between a jpg downloaded from Apache and the original\nfile I find they are identical up-to an offset of 64K - thereafter I see\nabsolutely no similarity between the binary files - though the distribution of\nbyte values seems fairly uniform in both files and both files are of identical size.\n\nSuspecting a problem with Apache configuration I uninstalled Apache 2.0.48,\ndeleted my configuration files and installed 2.0.53 (the current latest) - but\nthis had no effect.\n\nCan anyone shed any light on this?  I find it difficult to believe I'm the first\nto discover this - AFAIK I've done nothing even slightly out of the ordinary."}, {"count": 1, "tags": [], "creator": "chip@force-elite.com", "text": "Try the commands listed here:\nhttp://www.apache.org/dist/httpd/binaries/win32/#problems\n\nAlso, look at removing any firewall software (eg norton).  They all commonly cause this type of issue.\n\nIf the issue still persists, feel free to repoen the bug.", "id": 72506, "time": "2005-03-16T16:58:42Z", "bug_id": 34037, "creation_time": "2005-03-16T16:58:42Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "Thanks for the prompt and spot-on feedback.  You are right - this was a \"known\"\nissue - though one for which I was previously unable to find the documentation.\n\nSetting \"EnableSendfile Off\" was the key for me... I wonder, given that I was\nusing a fairly vanilla XP SP2 (with Symantec antivirus) and only the default\nwindows firewall... wouldn't it be a better idea if the default Win32\nconfiguration was more conservative?  It would have saved me a lot of\nfrustration... My hunch is that those running Apache on Win32 are likely to be\ndoing this for smaller trafic volumes - hence a (potentially) slower but more\nreliable default configuration would be extremely helpful.", "attachment_id": null, "bug_id": 34037, "id": 72575, "time": "2005-03-17T12:28:52Z", "creator": "netspam@shic.co.uk", "creation_time": "2005-03-17T12:28:52Z", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 34037, "text": "IMHO \"EnableSendfile Off\" should be present and uncommented in the default\nconfig files for all platforms, except for highperformance.conf.  I'll bring\nthis up again on the developer mailing list.  The subset of users who need a\nlittle better performance can uncomment it and verify that the web server is\nstill operating properly.\n", "id": 72581, "time": "2005-03-17T13:50:18Z", "creator": "trawick@apache.org", "creation_time": "2005-03-17T13:50:18Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "nick@webthing.com", "text": "*** Bug 39698 has been marked as a duplicate of this bug. ***", "id": 89656, "time": "2006-06-01T15:27:55Z", "bug_id": 34037, "creation_time": "2006-06-01T15:27:55Z", "is_private": false, "attachment_id": null}]