[{"count": 0, "tags": [], "bug_id": 34047, "attachment_id": null, "id": 72543, "time": "2005-03-17T03:07:09Z", "creator": "paul_manofsky@stercomm.com", "creation_time": "2005-03-17T03:07:09Z", "is_private": false, "text": "Found in:  WCK 2.2pre1\n\nI don't know if the problem I am experiencing is a bug, or by design.   I am \nusing Eclipse as a client and have created a custom store to \nretreive/lock/edit resources in a database.   I can lock and retreive the \nresources without any problem.  Although, when I try to retreive a resource \nthat has been locked, I want to display a message stating that the resource is \nlocked and show the owner of the lock.   I can retreive the \nLockDiscoveryProperty object, but the owner is missing.  Here is\nwhat I have found within the WCK source.  \n\nThe WebdavStoreAdapter class (specifically the inner class \nTransactionId.enumerateLocks(WebdavStoreAdapter.java:892) calls my custom \nstore to get the lock on the specified resource.  The \nWebdavStoreLockExtension.Lock[] that is returned from my store\nis used to create a NodeLock. \n\nfor (int i = 0; i < ids.length; i++) {\n     WebdavStoreLockExtension.Lock lockId = ids[i];\n     NodeLock lock = new NodeLock(lockId.getId(), uri.toString(),              \nlockId.getSubject(), \"/actions/write\", lockId.getExpirationDate(), \nlockId.isInheritable(), lockId.isExclusive());\n\n     locks.add(lock);\n}\n\nThe LockDiscoveryProperty obj will then use this NodeLock obj to display the \nowner.\n\nI would assume that the owner would be the 'subject' from the \nWebdavStoreLockExtension.Lock.  However, it turns out that the owner from the \nLockDiscoveryProperty obj is populated from the 'ownerInfo' field of\nthe NodeLock. From the developer comments in the NodeLock class I found the \nfollowing definitions:\n\nsubject -is defined as the user who is the lock owner.\nownerInfo - is defined as contacting information about the lock owner.\n\nI verified this by doing a setOwnerInfo( name ) on the NodeLock just after it \nwas created.   After doing that, the owner then showed up in the \nLockDiscoveryProperty obj.   \n\nFrom the developer comments, I would assume that the 'subject' should be used \nas the owner, not the ownerInfo.  My apologies if I am incorrect.   \n\nThe constructor used to create the NodeLock sets the ownerInfo field to null \nwhich propogates to the null owner in the LockDiscoveryProperty .  I am not \nsure if the constructor needs to be changed to set the ownerInfo, or if the \nLockDiscoveryProperty is referencing the ownerInfo field and it should really \nbe using the 'subject' field."}]