[{"count": 0, "tags": [], "bug_id": 34045, "attachment_id": null, "text": "I have been using ANT since day one and have written MANY tools which make use\nof ANT and integrate with ant including a flash build server, swing clients,\nover 15 new tasks and 10's of thousands of lines of ant script. My only\ncomplaint to this day is that there is still no real intuitive way to declare a\ntask 'internal/external'. As I personally believe EVERY task should have a\ndescription, I don’t agree with the ant documentation in that:\n\n'Targets without such a description are deemed internal and will not be listed,\nunless either the -verbose or -debug option is used.'\n[http://ant.apache.org/manual/using.html#targets]\n\nI'm currently working at the largest telecommunications company in Australia\nwhere in my spare time I manage the build process for over 7 very large\nprojects. One project alone has 23 files (not including around 10 common files\nfor things like cvs/vss/svn tasks) totalling over 7000 lines. One of those files\nalone has 43 targets. It is a very complex build and deployment environment. \n\nSince I have managed many build environments before I introduced something into\nthis build environment which has made it much easier to determine which targets\nare allowed to be called externally and which are main entry points. I have been\nusing the standard OO scope methodology such that targets which can be called\nfrom any ant script I have added the scope=\"public\" attribute to the target\nelement. Targets which can be called from scripts in the same directory have the\nscope=\"protected\" attribute. Targets which can only be called by other targets\nwithin the same script are marked with the scope=\"private\" attribute.\n\nI had to make a couple of mods to the ant source so that parsing of the build\nscripts is achieved without error, etc. This has worked great, especially with\nbuild scripts which are used in IDE's. In the flash build server and swing ant\nclients I've written, only public targets are visible/executable which cuts down\non a lot of confusion. I currently have 120 build scripts loaded into my IDE.\nGets a bit confusing if all the scripts show all their targets, especially when\n90 percent of the targets are internal targets.\n\nPlease let me know what you feel about this approach. Sorry about all the\nhistory but I wanted to make the point that I didn't write my first script\nyesterday.\n\nThanks,\n\n- Jay\n\n\n[internal public private scope visibility description]", "id": 72536, "time": "2005-03-17T00:18:34Z", "creator": "sprokitthemonkey@gmail.com", "creation_time": "2005-03-17T00:18:34Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 34045, "text": "\n\n*** This bug has been marked as a duplicate of 6757 ***", "id": 72550, "time": "2005-03-17T07:42:20Z", "creator": "jan@materne.de", "creation_time": "2005-03-17T07:42:20Z", "is_private": false, "attachment_id": null}]