[{"count": 0, "tags": [], "creator": "gabrio@teamperfecto.com", "attachment_id": null, "text": "hello\n\ni am running the following system:\n\np3 1.0 ghz, QDI advance 10b, 768 mb ram @ 133 mhz, 2 x 80 gb WD EIDE, ATI \nradeon 32 mb on windows 2000 server version.\n\ni have installed apache_2.0.53-win32-x86-no_ssl.msi and after doing this, the \nproblems started to arise. i have installed apache and then ive installed mysql-\nessential-4.1.10-win32.msi and php-5.0.3-installer.exe and i think also php-\n5.0.3-Win32.zip since i wanted to have php + sql + apache running at the same \ntime and i didn't find an overall package altho i know they do exist.\n\nso i tried running all that together and apparently it was running, but soon \nafter that apache started to become unstable, didnt want to start (options were \ngood), like if at startup it wouldn't load, then i couldn't 'restart' the \nserver, so i had to restart the whole machine...\n\nthen i have given up since often after working and with apache running i was \ngetting the blue screen of death, actually i dont remember the exact error i \nwas receiving. so i uninstalled everything, php, apache and sql.\n\neverything apparently went smooth (un-install process) but then i noticed the \nfollowing:\n\n1) apache 2 wasn't completely un-installed, i found in the registry a legacy2 \nkey which is still connected with apache and there's no way i can delete that, \ni have also tried to run in safe mode which usually always works, but i \ncouldn't delete that key either.\n\nbut this wouldn't be really an issue...i can live with that....the REAL ISSUE \nis that now the computer goes in blue screen and PAGE FAULT IN NON PAGED AREA \nquite frequently, and this started to happen exactly since i un-installed \napache 2, so i think that it made some major fuckup. i ofcourse get a memory \naddress error.\n\ni have then thought it could be a RAM issue, so i have tried to swap several \nram modules i have here, but the problem is still there and i am quite lost \nright now.\n\nif you are aware of any fix i can do or something i can change in order to have \nthis not happening again, please advise.\n\nright now i have re-installed apache, even though i am not using it, because i \nthink that maybe windows needs something which i had uninstalled (and that \ncannot be removed) so maybe this way it will work.\n\nbut i would like to know if you have any ideas before spending 1-2 days for \nredoing the entire machine which i need for work, and working like this for me \nit's impossible.\n\nthanks and sorry for the long email.\n\nkind regards\n\ngabrio - team perfecto\n\nemail gabrio@teamperfecto.com\nmsn gabrio@teamperfecto.com\nicq #132516819", "id": 53109, "time": "2005-03-21T11:00:20Z", "bug_id": 34100, "creation_time": "2005-03-21T11:00:20Z", "is_private": false}, {"count": 1, "tags": [], "creator": "the_angry_angel@blueyonder.co.uk", "attachment_id": null, "text": "The non-paged area of memory is the memory used by windows to store the vitals\nof the operating system, plus anything else third parties decide is important\n(such as norton). As far as I am aware, apache does nothing to add itself to\nthis exclusive list which would normally cause this.\n\nYou might want to try running a quick memtest (you're correct this is usually a\nRAM problem) on the box (if you can), as it's likely this is a coincidence and\ncheck to see if any other third party applications have been installed around\nabout the same time. \n\nGiven the fact that you're running on older hardware, it could be that you may\nhave some other faulty components within the machine, perhaps?", "id": 94134, "time": "2006-09-26T19:01:04Z", "bug_id": 34100, "creation_time": "2006-09-26T19:01:04Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 34100, "text": "This is quite old. Please test/confirm with more recent versions and reopen if needed.", "count": 2, "id": 106291, "time": "2007-08-03T08:12:39Z", "creator": "jim@apache.org", "creation_time": "2007-08-03T08:12:39Z", "is_private": false}]