[{"count": 0, "attachment_id": null, "creator": "amishra@yantra.com", "text": "During the build proccess on AIX 4x & 5x I get the warning \" [chmod] Warning: \nUNIXProcess.forkAndExec native error: The parameter or environment lists are \ntoo long.\" when I try to perform chmod as follows:\n\n   <target name=\"xyz\">\n     <chmod dir=\"${yfs_home}/webpages\" perm=\"ugo+rwx\" includes=\"**/om/**/*.jsp\">\n\t <exclude \nname=\"**/apidata/**,**/console/icons/**,**/yfcicons/**,**/application/**\"/>\n     </chmod>\n   </target>\n\nThe Warning as such is harmless as the chmod proccess is completed without \nintruptions and successfully, but this could be a bug with ANT 1.6.2 since the \nchmod operation as such from the OS shell doesn't throw the Warning.\n\nThe total no. of files on which chmod is done is abt 1500 and bringing it down \nto abt 300 doesn't result in this Warning.\n\nAny idea why this Warning is encountered and how it can be avoided?", "id": 49840, "time": "2005-03-22T06:31:04Z", "bug_id": 34119, "creation_time": "2005-03-22T06:31:04Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 34119, "text": "If you run ant -verbose, you'll see the command line (or an approximation of it)\nAnt would use.  You'll probably get the same warning if you try that command on\nthe command line as well.\n\nTo work around the problem, you should set the maxparallel attribute of the task.\nYour own experiments suggest that a value of 300 would do the trick.\n\nWith this Ant would create mutliple chmod invocations instead of a single one.\n\nI mark this as a documentation bug and will modify the chmod manual page to\nexplicitly mention this.", "count": 1, "id": 40581, "time": "2005-03-22T11:56:52Z", "creator": "bodewig@apache.org", "creation_time": "2005-03-22T11:56:52Z", "is_private": false}, {"count": 2, "tags": [], "creator": "amishra@yantra.com", "is_private": false, "text": "stefan,\n\nUsing the maxparallel attribute did resolve this issue but I don't believe this \ncan be classified as a documentation bug. since this is a limitation with the \nant code execution on AIX and using maxparallel is just a workaround.\n\nI would like this issue to be looked up as a low priority BUG.", "id": 73181, "time": "2005-04-01T06:21:05Z", "bug_id": 34119, "creation_time": "2005-04-01T06:21:05Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 73516, "time": "2005-04-11T11:34:00Z", "bug_id": 34119, "creation_time": "2005-04-11T11:34:00Z", "is_private": false, "text": "Since Ant has no idea which command line length is acceptable by the underlying\nOS, I don't see how it could fix that."}, {"attachment_id": null, "tags": [], "bug_id": 34119, "is_private": false, "count": 4, "id": 73518, "time": "2005-04-11T11:56:19Z", "creator": "amishra@yantra.com", "creation_time": "2005-04-11T11:56:19Z", "text": "(In reply to comment #3)\n> Since Ant has no idea which command line length is acceptable by the \nunderlying\n> OS, I don't see how it could fix that.\n\n\nSince there is no limitation with the chmod exeution from the cmdline (shell) \non AIX. This doesn't seem like a problem with the OS directly, hence I thought \nit could be something to do with ant.\n"}, {"attachment_id": null, "tags": [], "bug_id": 34119, "text": "Sure there is, you just have to be very patient while typing 8-)\n\nAll OSes have limits on the command line length, on some of them the limit is\neven different if you use a shell as opposed to forking a new process from another\none.\n\nIn theory we could even keep a list of the limits around and adapt them every now\nand then, but then again it would be an incomplete (since we wouldn't have\ninput for each OS), outdated (information may change with a new OS version), hard\nto maintain (the system property os.name may be different on different VMs) list.\n\nAnd this with no real gain since <apply> wouldn't be smart enough to know how\nto deal with command lines that are too long.  <chmod> is different, I agree, it\ncould know that it should simply split the command line and use multiple\ninvocations.", "count": 5, "id": 73519, "time": "2005-04-11T12:05:29Z", "creator": "bodewig@apache.org", "creation_time": "2005-04-11T12:05:29Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 34119, "is_private": false, "text": "Marking as WONTFIX as it would not be nice to try\nto figure out various maximum limits, however I have\nadded a note on using the maxparallel attribute\nto the manual page and referred to the warning\nseen on AIX.\n", "id": 97746, "time": "2007-01-07T07:28:03Z", "creator": "peterreilly@apache.org", "creation_time": "2007-01-07T07:28:03Z", "attachment_id": null}]