[{"count": 0, "tags": [], "creator": "matthew@digitalstratum.com", "attachment_id": null, "id": 45774, "time": "2005-03-21T21:42:41Z", "bug_id": 34114, "creation_time": "2005-03-21T21:42:41Z", "is_private": false, "text": "Affects all 1.x and 2.x versions of Apache when using the \"reliable-pipe\" option\nfor writing to log files.\n\nAccording to POSIX and The Single UNIX Specification Version 3:\n\nhttp://www.opengroup.org/onlinepubs/009695399/functions/write.html\n\n\"Write requests of {PIPE_BUF} bytes or less shall not be interleaved with data\nfrom other processes doing writes on the same pipe. Writes of greater than\n{PIPE_BUF} bytes may have data interleaved, on arbitrary boundaries, with writes\nby other processes, whether or not the O_NONBLOCK flag of the file status flags\nis set.\"\n\nThis is a problem since Apache has each child process log it's own entries\ndirectly to the log file/pipe, and does not take any consideration for entries\nlarger than PIPE_BUF in length.\n\nIn the Apache 1.x branch, the actual writing to a log file uses this code (found\nin mod_log_config.c, line 839):\n\n    str = ap_palloc(r->pool, len + 1);\n\n    for (i = 0, s = str; i < format->nelts; ++i) {\n        memcpy(s, strs[i], strl[i]);\n        s += strl[i];\n    }\n\n    write(cls->log_fd, str, len);\n\nWhen writing to a pipe, if the length of the log entry is greater than PIPE_BUF,\nit is possible the entry will be interleaved with other log entries being\nwritten by other child processes which are writing their log entries at the same\ntime.\n\nIn the Apache 2.x branch, there is actually a mutex used when the *experimental*\nBufferedLogs config option is used, but the normal logging code does not use the\nmutex (nor is the mutex used if threads are not available, obviously.)\n\nThe normal logging code in 2.x (readwrite.c, line 194):\n\n        do {\n            rv = write(thefile->filedes, buf, *nbytes);\n        } while (rv == (apr_size_t)-1 && errno == EINTR);\n\nFixing the problem in the 2.x branch could be a simple matter of utilizing a\nmutex in the apr_file_write() function, for both buffered and non-buffered\nlogging.  The 1.x branch would require possibly using a semaphore or some other\nlocking solution to serialize the writing of log entires.\n\nIf no locking is performed, when writing to a pipe, to ensure that only one\nprocess writes a log entry at a time, then the only other options are:\n\n1. Truncate the log entry to PIPE_BUF and log an error to the error log.\n2. Drop the entry completely and log an error to the error log.\n\nThe severity of this problem depends on how seriously one considers accurate\nlogging.  For a commercial website I'm sure this is more serious than for a\npersonal web server.\n\nI'm more than happy to provide any further information and/or assist with\ntesting/patching related to this problem.\n\n\nMatthew"}, {"count": 1, "text": "The mutex is only used in the buffered logs code because the buffer used is\nprocess-global.  I'd expect that using a server-global mutex for logging would\nbe absymal for performance and nobody really wants that.\n\nReal answers would probably include:\n\n- use an OS with a larger PIPE_BUF (Linux has 4K IIRC)\n- don't use piped logging if you're worried about this\n- use magic tricks to ensure that each log entry is <PIPE_BUF in length\n ... e.g. using Rici Lake's bug 29559 stuff; certainly something more clever\ncould be done if mod_log_config knew about PIPE_BUF\n\nIt's true this should be a Documented Feature of piped loggers; so I'd refile\nthis as a docs bug.", "bug_id": 34114, "attachment_id": null, "id": 31287, "time": "2005-03-22T17:17:02Z", "creator": "jorton@redhat.com", "creation_time": "2005-03-22T17:17:02Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 34114, "attachment_id": null, "text": "Moving docs bugs to docs@httpd.a.o ownership.", "id": 141200, "time": "2010-10-29T11:06:30Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-29T11:06:30Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 34114, "attachment_id": null, "text": "Can someone please offer some translation here? What exactly should be documented? I've read through this several times and am unable to arrive at any interpretation of the term \"interleaved\" that corresponds to anything I've ever seen in the real world.", "id": 142957, "time": "2010-12-27T15:18:24Z", "creator": "rbowen@apache.org", "creation_time": "2010-12-27T15:18:24Z", "is_private": false}, {"count": 4, "tags": [], "creator": "rbowen@apache.org", "text": "Closing due to inactivity, inability to reproduce, and lack of followup information. Please reopen, with the requested additional data, if anyone thinks that this is a real-world problem.", "id": 143866, "time": "2011-02-01T14:14:21Z", "bug_id": 34114, "creation_time": "2011-02-01T14:14:21Z", "is_private": false, "attachment_id": null}]