[{"id": 43878, "tags": [], "bug_id": 34118, "is_private": false, "count": 0, "text": "When you include static content with <jsp:include> or similar (without \nflush=\"true\") the DefaultServlet implementation calls setHeader for the Last- \nModified header. This is passed to the response for the overall request and \noverwrites any previously set value.\n\nThis means that the Last-Modified header varies depending on the last include. \nAdmittedly the size of the response may mean that flush() was called prior to \nthe include, complicating the issue further.\n\nThe problem cropped up with a dynamic page that handles a login for users. If \nyou are already logged in it includes a different page to that of a public user. \nThis meant that the Last-Modified date was being overwritten depending on when \nthe various included content pages were modified. It was very difficult to \nisolate the cause of the problem as it very inconsistent from page to page.\n\nThe problem manifested itself irregularly and only with certain browsers/proxies \ncaching the content. Only some setups seem to observe the Last-Modified Date \nover other headers that were set to discourage caching. This in turn lead to \nproblems logging in or out of the site for certain users. (Generally a browser \nrefresh fixed the problem)\n\nIt seems appropriate that the Last-Modified header should either not be set at \nall by included content, or at least not to a value prior to any current value. \nThe latter option would be the most correct. However it probably should not \npreclude overwriding the modified date with a smaller value if that was what you \nwanted.\n\nA workaround is not to include static content (only dynamic content). You can \nalso call response.flush() to send the headers prior to the include.\n\nSorry that there is no example URL. It's pretty easy to replicate. Set the last \nmodified timestamp of a non-jsp file (using touch -B for example) and include \ninto a small page with <jsp:include page=\"...\" flush=\"false\"/>\n\nA simple examination of the response headers should reveal that the Last-\nModified date is the date of the included file not the JSP.", "time": "2005-03-22T06:00:22Z", "creator": "colinlear@gmail.com", "creation_time": "2005-03-22T06:00:22Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "william.barker@wilshire.com", "attachment_id": null, "is_private": false, "id": 46276, "time": "2005-03-22T07:12:40Z", "bug_id": 34118, "creation_time": "2005-03-22T07:12:40Z", "text": "Trying the simple example suggested above, I (correctly) see no Last-Modified \nheader returned at all.\n\nFeel free to reopen if you can provide a war file that demonstrates the \nproblem."}]