[{"count": 0, "tags": [], "bug_id": 34183, "attachment_id": null, "text": "o.a.j.r.JspFactoryImpl has USE_POOL static member initialized to true. It should\nbe configurable similar to how tag pooling can be turned on/off.", "id": 72866, "time": "2005-03-25T19:09:56Z", "creator": "p_rudrakshala@yahoo.com", "creation_time": "2005-03-25T19:09:56Z", "is_private": false}, {"count": 1, "tags": [], "creator": "remm@apache.org", "text": "I disagree with this.", "id": 72867, "time": "2005-03-25T19:14:48Z", "bug_id": 34183, "creation_time": "2005-03-25T19:14:48Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "This can be useful for trouble shooting purposes, avoiding memory leaks due to\nbugs, etc., Also Sun recommends against implementing object pools. It is all\nabout choice. If some one wants to use pooling they can use it, if others do not\nwant it, they should be able to turn it off.", "is_private": false, "id": 72868, "creator": "p_rudrakshala@yahoo.com", "time": "2005-03-25T20:27:53Z", "bug_id": 34183, "creation_time": "2005-03-25T20:27:53Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 34183, "attachment_id": null, "text": "If Sun recommended to jump off a cliff, would you ? Remember those are the same\nguys who told you to use Swing in JDK 1.2 to build all your desktop apps.\n\nLet's say that since you're the first one who has a \"need\" for this (like you\nwere the first one to use close inside your tags), then the feature is not\nactually needed, and would be bloat. If you really want it, it can be compiled\neasily.", "id": 72874, "time": "2005-03-25T22:30:02Z", "creator": "remm@apache.org", "creation_time": "2005-03-25T22:30:02Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 34183, "attachment_id": null, "text": "I do evaluate Sun or any other vendor's guidelines/recommendations first, and if\nit makes sense I follow them. In the case of Sun's recommendation against object\npooling it makes sense. We tried to implement object pooling in our apps and\nfound that it is not worth the trouble. Modern hotspot JVMs are so mucch better\nat allocating memory and garbage collecting them compared to older JVMs. Also,\nwhen recyling objects state should be cleared properly to avoid risk of memory\nleaks/bugs. This is the same case with Jasper runtime too. \n\nI have said many times, that we do not call close() from the JSP tags. The tags\nare  either jakarta taglibs tags or struts tags. Any one has access to the\nsource code. Why do you keep telling we have close() from tags? Have you ever\nlooked at the source code for these tags? \n\nI can certainly make code changes myself and get these missing functionality.\nThis is not good for maintanenace of our apps as we do want to keep upgrading to\nnewer versions of open source software we use. \n\nIf you are not interested in making fixes/enhancements based on customer needs\nthat is really up to you. ", "id": 72876, "time": "2005-03-26T03:01:04Z", "creator": "p_rudrakshala@yahoo.com", "creation_time": "2005-03-26T03:01:04Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "remm@apache.org", "text": "As you said, in the end, it is up to me.\n\nThe obvious benefit of open source is that, if you do not agree, you can\nexperiment in any way you would like.", "count": 5, "id": 72887, "time": "2005-03-26T09:27:24Z", "bug_id": 34183, "creation_time": "2005-03-26T09:27:24Z", "is_private": false}]