[{"count": 0, "tags": [], "bug_id": 34245, "attachment_id": null, "text": "For the following code snippet (which also appears in the uploaded sample code):\n--------------------------------------------------------------------------------\nprotected void service(HttpServletRequest req, HttpServletResponse resp)\n\tthrows ServletException, java.io.IOException {\n\treq.getSession();\n\tresp.reset();\n\treq.getSession();\n\tresp.getWriter().println(\"<b>Hello World!</b>\");\n}\n------------------------------------------------------------------\nthe JSESSIONID cookie is not set in the response header.\nIt seems that once response.reset() has been called, the session cookie will not\nbe inserted into the response header even though request.getSession() is called\nagain.\nThe attached WAR file demonstrates this problem.", "id": 73113, "time": "2005-03-30T22:37:02Z", "creator": "peilinz@hotmail.com", "creation_time": "2005-03-30T22:37:02Z", "is_private": false}, {"text": "Created attachment 14596\nThe WAR file that demonstrates the problem", "tags": [], "bug_id": 34245, "attachment_id": 14596, "count": 1, "id": 73114, "time": "2005-03-30T22:38:32Z", "creator": "peilinz@hotmail.com", "creation_time": "2005-03-30T22:38:32Z", "is_private": false}, {"text": "This looks extremely suspicious. I will test it, though, since you provide a\ntest case.", "tags": [], "bug_id": 34245, "attachment_id": null, "count": 2, "id": 73117, "time": "2005-03-30T23:05:48Z", "creator": "remm@apache.org", "creation_time": "2005-03-30T23:05:48Z", "is_private": false}, {"count": 3, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "I thought about it some more, and the behavior is actually understandable.\nreset clears the whole HTTP body, including cookies. We only set the session\ncookie when creating the session. The session will not be cleared by reset.\nThere's also no reason at all to set a cookie every time you call\nreq.getSession(): you should invalidate the session yourself after the reset call.\n\nAs a result, the behavior you want will not be supported. Please do not reopen\nthe report (if you do, I will close it again as WONTFIX without further comments).", "id": 73119, "time": "2005-03-30T23:13:09Z", "bug_id": 34245, "creation_time": "2005-03-30T23:13:09Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 34245, "text": "I would argue that the current behavior does not completely comply to the\nServlet spec. \nThe documentations on HttpServletRequest.getSession() says:\n\"Returns the current session associated with this request, or if the request\ndoes not have a session, creates one.\"\nAnd the documentation for ServletResponse.reset() says:\n\"Clears any data that exists in the buffer as well as the status code and\nheaders. If the response has been committed, this method throws an\nIllegalStateException.\"\nThere is nothing said about \"if reset() is called, session cookie will not be\nadded to the header\". The fact that I called getSession() after reset() was call\ned but no session cookie was set, indicates an implementation deficiency. As a\nuser, I shouldn'd care when the cookie is actually set in Tomcat's\nimplementation and why it didn't do it after reset() was called. All I see is\nthat I asked the Servlet container to set up a session but it was not done.\nIf a web application is based on a framework (e.g. Struts), in some cases, there\nmay be headers set up automatically by the framework before the application will\nget a chance to process request. In the case of Struts, for example, a developer\ncan configure it to set up a default content type of say\n\"text/html;charset=UTF-8\" for most of its pages. The problem I have ran into\nwith Struts and Tomcat is that once that's set, calling\nresponse.setContentType(\"application/pdf\") will not clear the \"charset=UTF-8\"\npart in the response header, because I believe at least with Tomcat 4.x, the\ncharset is stored in a seperate variable. Now when Adobe Acrobat Reader (or\nmaybe the browser) gets the content type \"applicaton/pdf;charset=UTF-8\", it does\nnot know how to handle it in some cases and the user would get a blank screen in\ntheir browser. \nOnce could argue it's Adobe's responsibility to support a content type with\ncharset specified, but I just wish if everyone in this complicated integration\ntries to make their piece more reasonable, our developers' job will be a lot easier.\n", "id": 73122, "time": "2005-03-30T23:53:33Z", "creator": "peilinz@hotmail.com", "creation_time": "2005-03-30T23:53:33Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 34245, "attachment_id": null, "id": 73123, "time": "2005-03-30T23:58:54Z", "creator": "remm@apache.org", "creation_time": "2005-03-30T23:58:54Z", "is_private": false, "text": "Calling reset clears all cookies which have been previously set (as cookies are\nset through HTTP headers in the response, which are cleared - something which I\ndidn't realize right away in comment #2).\n\nYou know, there are lots of ways the user can screw things up, and it's not\npossible to prevent everything."}, {"count": 6, "tags": [], "creator": "peilinz@hotmail.com", "attachment_id": null, "text": "Agreed. There is always ways to screw things up in any given system.\nIn my case, I did not try to screw anything up. I was trying to follow the\nServlet documentation to find a solution for my PDF problem. I really wasn't\ncomfortable calling reset() but I could not find any other way to clear the\ncharset field.\nFor now, I had to change the configuration in Struts so that \"charset=UTF-8\" is\nnot included. Maybe I should put another bug report for Tomcat for not clearing\nthe charset field when response.setContentType() is called without \"charset\"\nspecified.", "id": 73125, "time": "2005-03-31T00:09:57Z", "bug_id": 34245, "creation_time": "2005-03-31T00:09:57Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 34245, "text": "From what you told me, is it correct to deduce the following:\nIn the same request/response scope, if I start out by creating a session and\nlater on invalidate it and then create a new one, I would get two JSESSION\ncookies set up in the response header?\nI still think the cookie should only be added when the response is about to be\ncommitted. ", "id": 73127, "time": "2005-03-31T00:16:19Z", "creator": "peilinz@hotmail.com", "creation_time": "2005-03-31T00:16:19Z", "is_private": false, "attachment_id": null}]