[{"count": 0, "tags": [], "text": "On our intranet web site, we have numerous Word and Pdf files for employees to \ndownload.  For some reason, some files will not download and the problem is \nrandom.  Rebooting the web server fixes the problem temporarily then it begins \nagain.  The web browser (almost all IE and one FireFox) acts as if it is \ndownloading the file and is just hung.  Sometimes the browser displays \"Done\" \nin the status bar, but the browser window is blank.  When a file does not \ndownload, we have discovered that we can cut and paste the URL to the file in \nthe address bar and replace the FQDN in the URL with the IP address and the \nfile will download just fine...even though we accessed the web site via the \nFQDN to get to the download page (and both FQDNs are the same).  We did not \nhave this problem in Tomcat 4 and I don't know if this is related to the \nproblem users are reporting about not being about to download via HTTPS/SSL.  \nWe are just using HTTP with no SSL for our downloads.", "is_private": false, "id": 73082, "creator": "jjbanks@gdph.state.ga.us", "time": "2005-03-30T17:25:38Z", "bug_id": 34240, "creation_time": "2005-03-30T17:25:38Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Please use the tomcat-user list to debug this. Bugzilla is not a help desk.", "attachment_id": null, "id": 73085, "creation_time": "2005-03-30T17:35:24Z", "time": "2005-03-30T17:35:24Z", "creator": "funkman@joedog.org", "bug_id": 34240, "is_private": false}, {"count": 2, "tags": [], "text": "(In reply to comment #1)\n> Please use the tomcat-user list to debug this. Bugzilla is not a help desk.\n\nAfter searching the Bugzilla web site and seeing how little help is given \nwith \"bugs\" (doesn't happen for me--sorry), I'm starting to understand why \nMicrosoft fanatics condemn open-source software so much.\n\nFirst, how can you read the description of the problem and immediately know \nit's not a bug in the software?  Second, if you want me to go to tomcat-user \nlist to \"debug\" this, aren't you admitting there's a bug?  I'm not looking for \na help desk...I'm looking for you to troubleshoot issues with YOUR SOFTWARE!\n\n", "attachment_id": null, "id": 73088, "creator": "jjbanks@gdph.state.ga.us", "time": "2005-03-30T17:47:06Z", "bug_id": 34240, "creation_time": "2005-03-30T17:47:06Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 34240, "attachment_id": null, "id": 73089, "time": "2005-03-30T17:59:34Z", "creator": "funkman@joedog.org", "creation_time": "2005-03-30T17:59:34Z", "is_private": false, "text": "http://jakarta.apache.org/tomcat/bugreport.html\n\nWhile there *might* be a bug in tomcat with respect to this, there is no way to\nreproduce this based on the existing report. Until enough detail is provided so\nthis bug may be reproduced - or a section of code which is at fault - this will\nremain INVALID.\n\nBugzilla is not a helpdesk. The tomcat-user list can help flush out any\nimportant details.\n"}]