[{"count": 0, "text": "According to profiler output gathered when running NetBeans build with JDK1.4.2\nusing Ant 1.6.2 it should be possible to improve Ant performance.\n\nConstructor of Location in ProjectHelper2.ElementHadler.onStartElement is\nexpensive. This is because conversion between URI and file is happening here.\nPerhaps it is worth to optimize Locator.fromURI assuming that most of URIs do\nnot contain '%' and thus avoid StringCharacterIterator use in most of cases.\n\nI also noticed what Jesse described in bug #25767 - creating of new SAX parsers\nis not for free.\n\nRuntimeConfigurable maintains two data structures holding overlapping data -\nlist of attributes and map <attribute;value>. One more efficient storage can\nbring some benefit.\n\nProjectHelper.getProjectHelper is not a hot spot but still can be a bit faster\nif it checks for resource first and thries to get the stream. This will not use\nexception to control the program flow. Filling of stack trace cost something in\ntheir constructor.", "creator": "radim.kubacki@sun.com", "is_private": false, "id": 73831, "time": "2005-04-19T20:39:47Z", "bug_id": 34529, "creation_time": "2005-04-19T20:39:47Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 34529, "text": "Decoding file URI's without % sign by the Locatorclass now has improved\nperformance. By not trying to interpret % in URIs that do not contain % signs at\nall. Further optimizations may be applied when this spot stays \"hot\".\n\nBug 25767 is described elsewhere and not taken into consideration in this report.\n\nRuntimeConfigurable indeed has two data structures, one is a List with keys,\nmaintaining the order, one is a HashMap for fast retrievel. In jdk 1.2 no Map is\npresent maintaining both speed, and ordered storage. Please note that the data\nitself is not duplicated, it is just that the keys are referenced from two\ndifferent data structures. If you have a good way to get both, please let us know.\n\nProjectHelper.getProjectHelper uses methods get(System)ResourceAsStream, which\nare specified to return null in case the resource is not available, so there\nshould not be a need to do a check first. The null value is checked before\nactually reading from the stream.", "count": 1, "id": 73842, "time": "2005-04-19T23:21:18Z", "creator": "jkf@apache.org", "creation_time": "2005-04-19T23:21:18Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 34529, "text": "When was Locator improved? Can you set the Target Milestone accordingly?", "id": 73845, "time": "2005-04-19T23:55:27Z", "creator": "jglick@apache.org", "creation_time": "2005-04-19T23:55:27Z", "is_private": false, "attachment_id": null}]