[{"count": 0, "tags": [], "bug_id": 34584, "is_private": false, "text": "Many commercial/non-commercial web products lay down Tomcat as an out-of-the-\nbox servlet container when they are installed. For Windows customers, such \nproducts also often configure an instance of the JK ISAPI filter/extension to \nIIS (isapi_redirect.dll).  \n\nUnfortunately, the /jakarta-tomcat-\nconnectors/jk/native/iis/isapi_redirect_plugin.c module is written in such a \nway that only one instance of the JK ISAPI filter/extension will function \nproperly per instance of IIS.  When you have two or more filters/extensions \nconfigured within IIS, only the final filter in the filter chain functions \nproperly.  The other filters kick out Tomcat 404 errors for all request URIs \nthat match the URL patterns in the corresponding uriworkmap.properties file.\n\nAs a developer for Compuware Corporation, I recently took it upon myself to \nresolve this issue. Because I am working behind an authenticating firewall, I \ncannot connect my CVS client to your CVS repositories in order to create a \npatch file, as recommended by your contribution guidelines.\n\nI have nevertheless resolved the issue by adding a single line to the /jakarta-\ntomcat-connectors/jk/native/iis/isapi_redirect_plugin.c file as shown below:\n\ndiff -r1.2 -r1.3\n23c23\n<  * Version:     $Revision: 1.2 $                                          *\n---\n>  * Version:     $Revision: 1.3 $                                          *\n903a904\n>                 return SF_STATUS_REQ_HANDLED_NOTIFICATION;\n\nMy analysis of the problem revealed that when a given instance of the JK ISAPI \nfilter finds that a request URI matches one of the URL patterns in its map, it \nredirects to the proper JK ISAPI extension, but it also passes the request \nalong to the next filter in the chain.  This is what is causing the problem.  \nWhen a match is found by one filter, the redirection should go directly to the \nextension without going through the other filters further down the chain.  This \ncan be achieved by returning SF_STATUS_REQ_HANDLED_NOTIFICATION from the \nHttpFilterProc function instead of SF_STATUS_REQ_NEXT_NOTIFICATION whenever a \nURI match is found.\n\nI have tested this fix by installing three separate instances of Tomcat, each\nwith its own corresponding JK ISAPI filter/extension. I did this on Windows \n2000 Server, Windows 2003 Server, and Windows XP professional. In every case, \nall three instances of the JK ISAPI filter/extension worked properly.  The first\nfilter to find URI pattern match handles the request by routing to the \ncorresponding extension.\n\nThis fix will yield significant savings for my company in terms of time and \nmoney spent on support calls, and I believe that other Tomcat redistributors \nwill benefit from it as well.  I therefore hope that you will incorporate this \nchange, or one similar to it, into your codebase for the Tomcat JK Connector.", "id": 74015, "time": "2005-04-22T22:46:10Z", "creator": "Carlos.Devoto@compuware.com", "creation_time": "2005-04-22T22:46:10Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "mturk@apache.org", "text": "Your solution will simply not work, because it will break any other\nfilter in the chain, like custom authentication filters, etc...\n\nJK ISAPI filter has many static variables that limit it's option to\nbe included more then once. What we would need is the option to have\nmultiple configurations for each virtual web server, not having multiple\nfilter instances. And that is not an easy fix :).\n\nRegards,\nMladen.", "id": 74027, "time": "2005-04-23T10:54:56Z", "bug_id": 34584, "creation_time": "2005-04-23T10:54:56Z", "is_private": false, "attachment_id": null}]