[{"count": 0, "tags": [], "creator": "doug_rand@percussion.com", "attachment_id": null, "id": 74245, "time": "2005-04-28T17:55:07Z", "bug_id": 34669, "creation_time": "2005-04-28T17:55:07Z", "is_private": false, "text": "I find that despite there being an incoming JSESSIONID cookie, sometimes this\ndoesn't make it into the requests Cookies. I've confirmed this by trapping the\ncase in my servlet filter, and then examining the request. In this case I can\nsee the cookie header, but the cookies are empty.\n\nSome specifics - I'm using JBoss 4.0.1sp1, which has Tomcat 5.0 embedded. The\nuse of the session is in a servlet filter for security. I store a JAAS subject\non the session in my login form, and I test the existence in the filter.\n\nThe pages generated by the application then make many other requests. IE\ncorrectly sends the cookie in the requests, but sometimes, perhaps one in five\nor one in ten requests, the cookie is ignored as stated in the first paragraph.\n\nI access the sessions using synchronized blocks to avoid multiple simul updates.\nI tried adding a sync on the doFilter method on the off chance that there was a\nsession issue (although, as noted above, the issue appears to be due to the\ncookies)."}, {"count": 1, "tags": [], "bug_id": 34669, "text": "I am sorry, but I simply do not believe you. Objects used for reading and\nparsing the requests are per thread, and as a result are fully independent (this\nincludes headers and cookies). If you believe there's an issue, you'll have to\ninvestigate it yourself, and submit a fix (or at least find out what goes wrong\ninside the Tomcat code, and where).", "id": 74246, "time": "2005-04-28T18:07:10Z", "creator": "remm@apache.org", "creation_time": "2005-04-28T18:07:10Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 34669, "text": "I will do more investigation. But \"I don't believe you\" isn't a particularly\nreasonable response. It may be the fault is outside of Tomcat, but it really is\nhard to argue with what I saw in the debugger. If I had a dollar for every time\nI thought that, and later found the problem I could probably retire.", "id": 74247, "time": "2005-04-28T18:22:26Z", "creator": "doug_rand@percussion.com", "creation_time": "2005-04-28T18:22:26Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "doug_rand@percussion.com", "text": "OK, I've done more investigation. I believe what's happening is that the \nunprocessed flag in the cookies object is getting set to false before the \nheaders are all available. Here's why: I put a breakpoint in my servlet filter \njust before I get the session. I ask for the cookies and I break if cookies \nreturns null.\n\nThen I go into the data structure and look at the CoyoteRequest object. The \nCookies object has unprocessed=false and no cookies, but the headers include a \ncookie header.\n\nI reset unprocessed to true, then I reaccess Cookies and the JSESSIONID cookie \nappears.\n\nMore data: I put a breakpoint in the cookie parser and it never failed to find \nthe header. So what I'm wondering is if there is a case where parsing might be \nbypassed? For example, it looks like the cookies are normally processed on \nobject creation and then if recycle is called. Could the headers sometimes be \ngetting set without calling recycle?\n\nThe other bug I'm seeing is that sometimes the scheme isn't set on the \nrequest. request.getScheme returns null (which breaks redirect).", "id": 74250, "time": "2005-04-28T20:00:19Z", "bug_id": 34669, "creation_time": "2005-04-28T20:00:19Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 34669, "text": "This does not make any sense at all, especially:\n\n(In reply to comment #3)\n> unprocessed flag in the cookies object is getting set to false before the \n> headers are all available\n\nThe first thing which occurs is parsing the headers. If cookie parsing is done\n\"before\", then you are looking at improper access to the container objects. Try\nto enable the security manager to get some NPEs to reveal them.\n\nI don't know where your problem is, but all I know is that it is not in Tomcat.\nPlease do not reopen the report.", "id": 74251, "attachment_id": null, "creator": "remm@apache.org", "creation_time": "2005-04-28T20:13:32Z", "time": "2005-04-28T20:13:32Z", "is_private": false}]