[{"count": 0, "tags": [], "bug_id": 34747, "attachment_id": null, "id": 74452, "time": "2005-05-04T21:17:15Z", "creator": "dalewis@tikva.com", "creation_time": "2005-05-04T21:17:15Z", "is_private": false, "text": "I checked out the latest log4j code into eclipse, including chainsaw.  I was\npreviously using JDBCAppender with log4j 1.2.8, but I wanted to use chainsaw to\nview the logs, so I changed to DBAppender so I could use DBReceiver.\n\nThe dialect/mssql.sql file worked great for setting up the tables.  However,\nonce I started trying to write to the log, I got this error:\n\njava.sql.SQLException: [Microsoft][SQLServer 2000 Driver for JDBC]Can't start a\ncloned connection while in manual transaction mode.\n\nI found a reference on Microsoft's support site\n(http://support.microsoft.com/default.aspx?scid=kb%3Ben-us%3B313181):\n\n\"This error occurs when you try to execute multiple statements against a SQL\nServer database with the JDBC driver while in manual transaction mode\n(AutoCommit=false) and while using the direct (SelectMethod=direct) mode. Direct\nmode is the default mode for the driver.\"\n\nI started digging into the code, and saw that in fact DBAppender was opening\nmultiple statements on the same connection if getGeneratedKeys is not supported\n(as it is not in this instance).\n\nI have a patch that I will attach."}, {"count": 1, "tags": [], "creator": "dalewis@tikva.com", "text": "Created attachment 14933\nPatch to correct opening multiple statements on the same connection.\n\nSmall patch that no longer opens multiple statements off of the connection.", "id": 74453, "time": "2005-05-04T21:20:14Z", "bug_id": 34747, "creation_time": "2005-05-04T21:20:14Z", "is_private": false, "attachment_id": 14933}, {"count": 2, "tags": [], "bug_id": 34747, "attachment_id": null, "text": "Seems like a reasonable patch.  I've applied it to CVS HEAD, test seems OK. \nThanks for the contribution.", "id": 77860, "time": "2005-07-30T22:37:13Z", "creator": "yoavs@computer.org", "creation_time": "2005-07-30T22:37:13Z", "is_private": false}]