[{"count": 0, "tags": [], "bug_id": 34822, "attachment_id": null, "text": "We run a RedHat v9 system on a 2.1GHz AMD Athlon processor with 1GB of RAM.  The\nsystem is currently running a 2.4.29 kernel.  We are running Apache v1.3.33 with\n894 virtual hosts.  The Apache server starts to use massive amounts of CPU soon\nafter it has been launched; we have seen the server exceed a load of 100.00 on\nan uptime.  When attempting to shutdown the server, the parent process will die,\nbut the children do not die and the load on the server continues to increase. \nThere are about 50 children running at the time and a kill -9 will not remove\nthese processes.  The only solution is to reboot the server as soon as possible;\nbefore all control is lost.\n\nIn attempting to debug this issue, we removed all of the modules one at a time,\nbut the problem continued.  Finally, after having removed all the modules, we\nstarted eliminating all of the logging.  Once we removed the custom access logs\nfrom the config file, the server began performing normally.  We have 1 error log\nfile and 406 custom access log files configured on this system.  We believe the\nproblem started when the 406th custom access log entry was added.  The server\nhad been running without incident for almost 2 months prior to this event. \nThere was also no evidence of any memory-related issues; the system was not\nswapping.\n\nThe server spirals out of control quickly; typically, the load will reach 100\nwithin 15 minutes.", "id": 74626, "time": "2005-05-09T19:50:35Z", "creator": "w.peter.howell@meccahosting.com", "creation_time": "2005-05-09T19:50:35Z", "is_private": false}, {"count": 1, "tags": [], "creator": "urkle@outoforder.cc", "attachment_id": null, "id": 74628, "time": "2005-05-09T20:24:45Z", "bug_id": 34822, "creation_time": "2005-05-09T20:24:45Z", "is_private": false, "text": "Check the number of available filehandles..  odds are you are running out of\nfile handles with that many log files open.   Try to consolidate the log files\nto a handlful and split them w/ post processing scripts.\n"}]