[{"attachment_id": null, "tags": [], "bug_id": 34850, "is_private": false, "count": 0, "id": 74692, "time": "2005-05-10T21:10:34Z", "creator": "rowley@musicstrands.com", "creation_time": "2005-05-10T21:10:34Z", "text": "When using ExternallyRolledFileAppender, Multiple calls to\nPropertyConfigurator.configure will result in an endless slough of JVM.Bind\nerror messages.  These messages will fill up their eventual endpoint incredibly\nfast.\n\nIt would be great if the configurator or the HUP class in\nExternallyRolledFileAppender would quit attempting to bind after a certain\nnumber of failures.  Also, an error message needs to be sent to the log4j.debug\nlog when this case is encountered."}, {"count": 1, "attachment_id": null, "bug_id": 34850, "is_private": false, "id": 74693, "time": "2005-05-10T21:16:15Z", "creator": "rowley@musicstrands.com", "creation_time": "2005-05-10T21:16:15Z", "tags": [], "text": "Note that you'll need to have the port configured to a non-zero value to see the\nissue in action.  "}, {"attachment_id": null, "tags": [], "bug_id": 34850, "is_private": false, "count": 2, "id": 74694, "time": "2005-05-10T21:34:32Z", "creator": "carnold@apache.org", "creation_time": "2005-05-10T21:34:32Z", "text": "I was just thinking about this class.  In the log4j 1.3 development, the previous rolling file appenders \nhad been removed in favor of a new generic RFA framework (in org.apache.log4j.rolling).  Unfortunately \nthis left users of the former RollingFileAppender and DailyRollingFileAppender without a migration \npath.  To address that I added emulations of RFA and DRFA that wrap the new framework.  I was \nunaware of ExternallyRolledFileAppender at that time.  The CVS log for the removal of ERFA says it was \nan \"unused\" class but since there are several bug reports on ERFA, I can't see how it can be claimed as \nunused.\n\nI hope to add an emulation similar to those added for the other log4j 1.2 xRFA's and make a stab at \naddressing the bugs.  If you are able to provide feedback on that work, that would be appreciated.  I've \nalso just posted a thread suggesting a new minor release branch, that may be able to incorporate any \nfixes from the 1.3 line, however the 1.2 line has been closed to anything less than a critical bug. \n\nMay be same bug as 30407"}, {"count": 3, "tags": [], "text": "Thanks for the quick response!  The wrapper class in the 1.3 release would be\nmuch appreciated.", "is_private": false, "bug_id": 34850, "id": 74695, "time": "2005-05-10T22:28:41Z", "creator": "rowley@musicstrands.com", "creation_time": "2005-05-10T22:28:41Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 34850, "attachment_id": null, "is_private": false, "id": 74739, "time": "2005-05-11T21:33:29Z", "creator": "carnold@apache.org", "creation_time": "2005-05-11T21:33:29Z", "text": "Wrapper class now in CVS HEAD for 1.3.  Reworked to retry on bind failures which occur on respository \nreset.  Added test case in unit tests, but not in Gump tests since network IO may be restricted.  To run \nunit tests:\n\ncd tests\nant ExternallyRolled\n\nWould appreciate feedback.\n\n*** This bug has been marked as a duplicate of 30407 ***"}]