[{"count": 0, "tags": [], "bug_id": 34883, "text": "Simple Logging Facade for Java (SLF4J, http://www.slf4j.org) is a continuation of the former UGLI effort \nwithin log4j.\n\nWhen SLF4J was spun out of Apache, the log4j build was modified to fetch the current SLF4J source by \ninvoking a 3rd party Java class (org.tmatesoft.svn.cli.SVN).  This approach: required locating the SVN \nclass, did not allow reproducable builds, and was unlike any other library required for log4j.\n\nThis modification will allow log4j to be build with integrated an SLF4J implementation or without and \nuses any .jar file (typically slf4j-nop.jar) from an SLF4J release to provide the SLF4J class definitions.  \n\nTo build with an SLF4J implementation, specify -Dslf4j=true -Dslf4j-api.jar=slf4j-1.0-beta2/slf4j-\nnop.jar on the command line or the equivalent in build.properties.  The org.slf4j.ULogger interface will \nbe extracted from the source SLF4J jar and placed in the log4j.jar file.\n\nTo build without, omit specify -Dslf4j=false or omit it.\n\nLog4j had referenced org.slf4j.impl.MessageFormatter and other SLF4J implementation classes to reuse \nfunctionality that had no relation to the SLF4J factory pattern.  These classes were resurrected from the \nUGLI code base and moved to org.apache.log4j.helpers.MessageFormatter, \norg.apache.log4j.spi.NOPULogger and org.apache.log4j.spi.SimpleULogger.\n\nThe previous UGLI tests have been resurrected but only test the log4j implementation, to run the tests\n\ncd tests\nant -f ugli-test.xml runAll\n\nThe UGLI names were retained to maintain the version history, but may be renamed after the expected \nmigration to Subversion.\n\nThe definition of org.apache.log4j.ULogger differs between SLF4J and non-SLF4J builds and the SLF4J \nbuild contains an implementation of org.slf4j.LoggerFactory.  The build.core task will either compile the \nfiles in the src/slf4j or src/no-slf4j directory depending on the value of the slf4j property.", "id": 74761, "time": "2005-05-12T05:45:28Z", "creator": "carnold@apache.org", "creation_time": "2005-05-12T05:45:28Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Created attachment 15930\nChanges to make CVS HEAD compatible with slf4j-1.0-beta4\n\nSLF4J-1.0-beta4 changes signatures in a way that could be problematic if\nimplemented directly.  This patch will make the CVS HEAD as of 5 Aug 2005\ncompatible with slf4j-1.0-beta4 but should not be committed without discussion\nand vote.", "is_private": false, "id": 78191, "creator": "carnold@apache.org", "time": "2005-08-06T00:29:52Z", "bug_id": 34883, "creation_time": "2005-08-06T00:29:52Z", "attachment_id": 15930}, {"count": 2, "tags": [], "text": "The support code for the slf4j build variant was removed in rev 356972.  The \nSLF4j support had stalled at beta4, and SLF4J provides a log4j facade in its \nproject.", "is_private": false, "id": 83682, "creator": "carnold@apache.org", "time": "2005-12-15T03:47:31Z", "bug_id": 34883, "creation_time": "2005-12-15T03:47:31Z", "attachment_id": null}]