[{"count": 0, "tags": [], "bug_id": 34978, "attachment_id": null, "is_private": false, "id": 75089, "time": "2005-05-20T00:28:19Z", "creator": "stevel@apache.org", "creation_time": "2005-05-20T00:28:19Z", "text": "If you set a systemTypeKey you can explicitly choose the system. But what if you\nwant to have property-file driven deployment; you also need a \"unknown\" option\nto tell the system to work it out itself, so that you can set \n  ftp.systemTypeKey=unknown\nin the properties file and feed it in to the <ftp> task."}, {"attachment_id": null, "tags": [], "bug_id": 34978, "text": "I think we can accomodate this but I'd like to get a little more familiar with\nyour use case.  There is a relationship between systemTypeKey and the other new\nattributes:\n\nIf any of these new attributes (serverTimeZoneConfig, defaultDateFormatConfig,\nrecentDateFormatConfig, serverLanguageCodeConfig, shortMonthNamesConfig) is\nspecified and systemTypeKey isn't, a default system type of UNIX is selected. \nIf none is selected and the systemTypeKey ISN'T chosen, then the old default\nautodetect mechanism is used.\n\nThe reason for this is that the five new attributes must be applied to a parser\nobject which must precreated to be of some particular system type.  In the\nautodetect scheme, it is assumed that the \"normal\" configuration for the\nautodetected system type will be used and this type will be determined by that.\n\nIn other words, there are two use cases here.  One for specifying a connection\nto a specific server with non-standard characteristics (non-English month names,\nall-numeric timestamp listings in a server type where this is not the norm, a\ntime zone different from that of the client).  The other says, autodetect and\nI'll take my chances, this system is vanilla.  That's the easier way and good\nfor most cases.  The other system is for the hard cases.\n\nNow, in your property-driven use case, the question I want to ask is this:  Do\nyou want to specify some of these non-standard attributes sometimes and other\ntimes not?  Or do you imagine you'll never need them?  If it's the latter, you\ncan just leave out systemTypeKey and just autodetect everything.\n\nHowever, I suspect that that won't really suit.  So the right fix is to make all\nthe new attributes respect the convention that attribute=\"\" is equivalent to not\nspecifying attribute at all.  Does that sound like it would work for what you\nare trying to do?", "count": 1, "id": 75093, "time": "2005-05-20T02:58:43Z", "creator": "scohen@apache.org", "creation_time": "2005-05-20T02:58:43Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 34978, "is_private": false, "count": 2, "id": 75171, "time": "2005-05-21T16:09:18Z", "creator": "scohen@apache.org", "creation_time": "2005-05-21T16:09:18Z", "text": "Fixed, along the lines outlined above.\n\nYou should now be able to specify in your build file\n\n<property file=\"my.properties\" />\n<property system.type.key=\"\"/>\n<property server.time.zone=\"\"/>\n...\n<ftp action=\"get\"\n    ...\n    systemTypeKey=\"${system.type.key}\"\n    serverTimeZoneConfig=\"${server.time.zone}\"\n/>\n\nand then overrride these defaults in my.properties:\nsystem.type.key=WINDOWS\nserver.time.zone=America/Honolulu\n\nor whatever.\n\nIf you want to use the default autodetect mechanism, simply don't include these\nproperties in my.properties.\n\nI believe that satisfies your request."}]