[{"count": 0, "tags": [], "creator": "briberyjoust@gmx.li", "text": "From my understanding, the ccmcheckintask is supposed to check in a task. To do\nso, it requires a task id or \"default\". The point is: This task complains about\na missing file or fileset and throws an exception. \nLooking at the source code, the execute method used by this task found in the\nclass org.apache.tools.ant.taskdefs.optional.ccm.CCMCheck contains the bug: It\nchecks for a file or filset regardless of the ccm command given. A special\ncondition has to be added to avoid this check in case the command is\n\"COMMAND_CHECKIN\". Even better would be changing the architecture of the classes\nin this package to allow overriding the execute method instead of adding tons of\nconditions.\nI found the bug using Ant 1.6.2. I investigated the sources of that version as\nwell as the HEAD version of each source file. I would like to do these changes\nby myself but I am afraid a little bit of using the cvs repository.", "id": 75279, "time": "2005-05-24T18:40:12Z", "bug_id": 35044, "creation_time": "2005-05-24T18:40:12Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 35044, "attachment_id": null, "text": "Hello,\n\nFirst of all, if you want to prepare a patch, you are more than welcome to do so.\n\nAs you are not a committer, you cannot checkin directly a patch.\nif you are interested, you should check out a local copy of ant from CVS (take\nthe HEAD revision, as the 1.6 branch is closed).\nthis document http://ant.apache.org/cvs.html explains how.\n\nTo prepare your patch, read this document :\nhttp://ant.apache.org/ant_task_guidelines.html\nparagraph \"submitting to ant\".\n\nCheers,\n\nAntoine", "id": 75319, "time": "2005-05-25T07:30:20Z", "creator": "antoine@apache.org", "creation_time": "2005-05-25T07:30:20Z", "is_private": false}, {"attachment_id": 15167, "tags": [], "bug_id": 35044, "is_private": false, "count": 2, "id": 75368, "time": "2005-05-25T18:07:55Z", "creator": "briberyjoust@gmx.li", "creation_time": "2005-05-25T18:07:55Z", "text": "Created attachment 15167\nContains the patch.txt with the patch for that bug."}]