[{"count": 0, "tags": [], "bug_id": 35079, "attachment_id": null, "id": 75403, "time": "2005-05-26T07:44:29Z", "creator": "cowwoc@bbs.darktech.org", "creation_time": "2005-05-26T07:44:29Z", "is_private": false, "text": "I want to set enableLookups=\"true\", resolveHosts=\"true\" but with a timeout\nsetting of 100ms. I expect that if the DNS does not reply within 100ms, Tomcat\nshould log the IP address instead. From actual experience, I have noticed that\nif I don't get a reply within 100ms, the DNS is going to fail the lookup anyway\n(and this takes 5-20 seconds to come back) so I might as well fail it right\naway. I cannot enable resolveHosts with the current behavior because I get very\npoor performance on IPs where lookup fails (and results in a 5-20 seconds delay\nper request)."}, {"count": 1, "tags": [], "text": "IMHO, adding a DNS Provider to Tomcat is outside the scope of the project.  \nIt's very unlikely to be implemented in any case without a patch.\n\nIf you are using Sun's default DNS Provider, you need to configure this at the \nOS level.  You could also try googling to see if any of the ones floating \naround meet your needs.", "attachment_id": null, "bug_id": 35079, "id": 75440, "time": "2005-05-26T20:04:16Z", "creator": "william.barker@wilshire.com", "creation_time": "2005-05-26T20:04:16Z", "is_private": false}, {"count": 2, "tags": [], "text": "I tried placing jndi.properties in <installdir>\\common\\classes with the new DNS\ntimeout settings but it did not work. Any ideas?\n\nI don't mind patching this application-wide like you recommended, but I don't\nsee this working. Worse yet, I see no mention anywhere of anyone else getting it\nto work, on Google.\n\nLastly, by handling the issue directly in Tomcat, we'd be addressing it in a\nportable manner which I think might be quite appropriate given the fact that\nthis isn't standardized or adequetly handled at any other level at this point.", "attachment_id": null, "id": 75449, "creator": "cowwoc@bbs.darktech.org", "time": "2005-05-26T22:03:05Z", "bug_id": 35079, "creation_time": "2005-05-26T22:03:05Z", "is_private": false}, {"count": 3, "tags": [], "text": "I agree with Bill Barker, this is bloat from the Tomcat perspective.  If you\ndon't want to take the DNS lookup delay risk, don't set enableLookups and\nresolveHosts: you should do the host lookup in log analysis and processing, not\non a real running server.  Virtually all modern DNS servers allow you to\nconfigure timeouts on queries: the specific instructions vary by server.", "is_private": false, "bug_id": 35079, "id": 100868, "time": "2007-03-25T07:57:24Z", "creator": "yoavs@computer.org", "creation_time": "2007-03-25T07:57:24Z", "attachment_id": null}]