[{"count": 0, "tags": [], "text": "This information has been removed as its provenance was unclear. The contributor has been contacted.", "attachment_id": null, "bug_id": 35125, "id": 76711, "time": "2005-07-02T00:48:47Z", "creator": "sander@temme.net", "creation_time": "2005-07-02T00:48:47Z", "is_private": false}, {"count": 1, "tags": [], "creator": "dominic.adatia@uk.bnpparibas.com", "attachment_id": null, "text": "Any progress on this..", "id": 117509, "time": "2008-06-09T06:38:01Z", "bug_id": 35125, "creation_time": "2008-06-09T06:38:01Z", "is_private": false}, {"count": 2, "tags": [], "creator": "aha@scireum.de", "is_private": false, "id": 129597, "attachment_id": null, "bug_id": 35125, "creation_time": "2009-08-10T09:09:24Z", "time": "2009-08-10T09:09:24Z", "text": "Here is a PERL version which can write autofilters: http://search.cpan.org/~jmcnamara/Spreadsheet-WriteExcel-2.25/lib/Spreadsheet/WriteExcel.pm\n\nBasically one has to write an AutofilterinfoRecord which contains the number of filters. Additionally one has to create an MSODRAWING and an OBJ for each col containing a filter. Sadly, excel always crashes when it tries to read my testfile, although, in BiffViewer they look almost identical to a dump what excel generated.\n\nI can provide my testcode which was hacked against the 3.2 FINAL. I also welcome any tipps ;-)"}, {"count": 3, "tags": [], "creator": "yegor@dinom.ru", "attachment_id": null, "text": "Initial support for auto-filters was committed in r983382.\nTo test-drive you need to build poi from trunk or download the latest daily build from http://encore.torchbox.com/poi-svn-build/\n\nIn current version you can only apply auto-filter on a range of cells:\n\nsheet.setAutoFilter(CellRangeAddress.valueOf(\"C5:F200\"));\n\nCustomizing of auto-filter properties (filter criteria, sort, etc.) is not yet supported. The feature is available both for HSSF and XSSF.\n\nYegor", "id": 139021, "time": "2010-08-10T02:36:51Z", "bug_id": 35125, "creation_time": "2010-08-10T02:36:51Z", "is_private": false}, {"count": 4, "tags": [], "creator": "sangeetha.chandran@nokia.com", "attachment_id": null, "id": 190701, "time": "2016-05-03T10:33:54Z", "bug_id": 35125, "creation_time": "2016-05-03T10:33:54Z", "is_private": false, "text": "Hi Yegor Kozlov,\n\nI need to custom filter the value of a column(based on one of the value of the column) after applying the auto-filter.\n\nThe below method helps me to apply autofilter for the columns A3 through E3\nsheet.setAutoFilter(CellRangeAddress.valueOf(\"A3:E3\"));\n\nBut if I use the same method for custom filtering, like below. It doesn't work.\nIn this case, I want to filter the rows for the value of column E3 as \"Near End\" \nsheet.setAutoFilter(CellRangeAddress.valueOf(\"E3:Near End\"));\nIt did not work and throws - java.lang.IllegalArgumentException error.\n\nI tried to use the HSSFAutoFilter class like below, with method 'equals'. It also did not work.\nHSSFAutoFilter autofilter;\nautofilter = sheet.setAutoFilter(CellRangeAddress.valueOf(\"E3\"));\nautofilter.equals(\"Near End\");\n\n\nIs the custom filtering supported in HSSFAutoFilter for HSSFSheet?\nIf not supported now, when it will be available. I am using the poi 3.15 JAR files.\n\nIs there any other way for this. Please provide information on this."}, {"count": 5, "tags": [], "text": "Please note that reopening such an old bug requires developers and interested people to sift through old discussion that is likely not relevant any more. REOPEN means the original bugfix was broken and should be redone. \n\nOtherwise it is usually better to create a new bug where you describe your problem and improvement suggestions. You can link back to this bug-entry for reference there. \n\nFor general usage questions the mailing lists are much better suited.\n\nTherefore I am setting this one back to FIXED for now.", "attachment_id": null, "bug_id": 35125, "id": 190705, "time": "2016-05-03T15:07:27Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-05-03T15:07:27Z", "is_private": false}]