[{"count": 0, "tags": [], "text": "When entering a scoped IPv6 address (e.g.\nhttp://[fe80::23a:45ff:fe42:4aac%wlan0]/) in my browser (Galeon, Firefox, etc.)\nthat same address is put in the HTTP Host: header (which is correct in my\nopinion). Apache then responds with a 400 Bad Request and logs \"Client sent\nmalformed Host header\" in the error log. \n\nThe problem is in fix_hostname() in server/vhost.c:715. Before that line\napr_parse_addr_port() is called and parses the address correctly, but\n    if (rv != APR_SUCCESS || scope_id) {\n        goto bad;\n    }\nrejects it.\n\nReproduceable: Always\nSteps to reproduce: (replace fe80::23a:45ff:fe42:4aac%wlan0 with an actual\nlink-local IPv6 address and the corresponding interface)\n1. telnet -6 fe80::23a:45ff:fe42:4aac%wlan0 80\n2. Enter \nGET / HTTP/1.1\nHost: [fe80::23a:45ff:fe42:4aac%wlan0]\nConnection: close\n\nActual result: 400 Bad Request error\nExpected result: No error\n\nSuggested fix: Remove the || scope_id on the beforementioned line.", "is_private": false, "bug_id": 35122, "id": 75592, "time": "2005-05-30T16:36:11Z", "creator": "henryk@ploetzli.ch", "creation_time": "2005-05-30T16:36:11Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 35122, "is_private": false, "text": "Ive seen this code before, but I didn't understood why we can't accept the scope_id.\n\nAnyone?", "id": 75866, "time": "2005-06-03T01:09:46Z", "creator": "chip@force-elite.com", "creation_time": "2005-06-03T01:09:46Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 35122, "attachment_id": null, "id": 76036, "time": "2005-06-05T05:11:00Z", "creator": "henryk@ploetzli.ch", "creation_time": "2005-06-05T05:11:00Z", "is_private": false, "text": "According to the svn log this code was added by Jeff Trawick 4 years ago, so he\nwould be the only one to know for sure. \n\nAfter looking at more of the code my best guess is that scope ids are not\nallowed in the Host: header because they are not allowed in the vhost\nconfiguration (in get_addresses(): if (scope_id) { return \"Scope ids are not\nsupported\"; }). And they are probably not allowed in the vhost configuration\nbecause the semantics are not obvious and/or nobody wanted to implement them.\n\nHowever, that's IMHO no good reason to reject a scope id in the Host: header\nwith a 400 Bad Request message indicating a client error (if anything it's a\nserver error, so 501 Not Implemented would be more appropriate). Simply ignoring\nthe scope id should be acceptable as an easy fix, although not completely\ncorrect. The correct solution (I think) would be to allow scoped addresses in\nthe vhost configuration and store the scope together with the IP address. Then\nget the scope from the sockets of incoming requests and compare that to the\nstored scope, as if it was part of the IP address (which it is, kind of)."}, {"count": 3, "tags": [], "bug_id": 35122, "attachment_id": null, "is_private": false, "id": 76042, "time": "2005-06-05T15:49:43Z", "creator": "trawick@apache.org", "creation_time": "2005-06-05T15:49:43Z", "text": "I assumed that scope id in the IPv6 literal address notation is interesting only\nto the machine where it was used, and was used to select an interface to use on\nthe outbound, or identify an interface on the outbound.  It is not part of the\nIPv6 header after all.  So a client may indeed specify a scope id on a connect()\nbut it doesn't make since in a Host since the client's view of the scope isn't\ninteresting on the server (the server may indeed get a different scope in\nsin6_scope_id when the client address is reported from accept() or getpeername()).\n\nBased on this discussion I'm willing to assume that this understanding was\nnaive/incomplete/completely-ignorant/etc.  Do you have a pointer to a good\ndescription?"}, {"count": 4, "tags": [], "text": "I'm sorry, it looks like you are right. I browsed through the RFCs: 2616\nreferences 2396 when it comes to the Host: header which doesn't allow literal\nIPv6 addresses at all, so it's probably not relevant. Then there is 4007 (pretty\nnew) which more or less forbids scope ids in the Host: header:\n\n|                Hence, the format MUST be used only within a\n| node and MUST NOT be sent on the wire unless every node that\n| interprets the format agrees on the semantics.\n -- RFC 4007, section 11.2\n\nI also checked some more browsers and the only one accepting scoped IPv6 address\nbesides the different Gecko derivatives seems to be Konqueror (at least on my\nsystem): Konqueror does not include the scope id in the Host: header. However\nKonqueror also does not include the port number if it's the default port while\nGecko seems to copy the host verbatim from the address bar.\n\nConclusion (and to correct my earlier statement): In principle it is not correct\nof the browser to include the scope id into the Host: header. However, I still\nbelieve that it would not hurt to simply ignore it in the server. Especially\nsince other likely malformed formats are already ignored, and also because it is\nsimilar to the handling of a port number (accept, but ignore and override with\nthe actual port of the socket when matching) in the Host: header.", "attachment_id": null, "id": 76044, "creator": "henryk@ploetzli.ch", "time": "2005-06-05T17:03:19Z", "bug_id": 35122, "creation_time": "2005-06-05T17:03:19Z", "is_private": false}, {"count": 5, "tags": [], "creator": "masa141421356@gmail.com", "attachment_id": null, "id": 122357, "time": "2008-11-10T19:43:43Z", "bug_id": 35122, "creation_time": "2008-11-10T19:43:43Z", "is_private": false, "text": "See also:\n https://bugzilla.mozilla.org/show_bug.cgi?id=464162\n\n"}, {"count": 6, "tags": [], "text": "Now, this problem on Firefox is fixed on Trunk.\n\n", "attachment_id": null, "id": 123145, "creator": "masa141421356@gmail.com", "time": "2008-12-06T06:08:55Z", "bug_id": 35122, "creation_time": "2008-12-06T06:08:55Z", "is_private": false}, {"count": 7, "attachment_id": null, "creator": "masa141421356@gmail.com", "is_private": false, "id": 128499, "time": "2009-07-04T17:01:48Z", "bug_id": 35122, "creation_time": "2009-07-04T17:01:48Z", "tags": [], "text": "Firefox 3.5 contains fix of this problem.\n(fixed at 1.9.1 branch or later)"}, {"count": 8, "attachment_id": null, "creator": "nick@webthing.com", "is_private": false, "id": 138532, "time": "2010-07-19T20:37:20Z", "bug_id": 35122, "creation_time": "2010-07-19T20:37:20Z", "tags": [], "text": "Seems to be a bug only in a \"be liberal in what you accept\" sense.  Changing this would add complexity and scope for something more serious."}]