[{"count": 0, "tags": [], "creator": "dsb@smart.net", "attachment_id": null, "id": 75650, "time": "2005-05-31T16:33:20Z", "bug_id": 35141, "creation_time": "2005-05-31T16:33:20Z", "is_private": false, "text": "In the Ant User Manual, in the whichresource task's page, the text does not \nwrap to fit the user's browser window (or pane within that window).  This\nbehavior (and that page's formatting in general) is consistent with most of\nthe rest of the Ant Manual pages.\n\nThe text in the body of the page does not wrap to fit because the header\nand the body are wrapped in a table.  (That forces the browser to format\nthe body to match the width of the header, instead of letting the browser\nshrink or stretch the body to fit the user's chosen browser window width.)\n\n(Also, something, possibly that wrapping in a table, prevents the browser \nfrom trying to narrowing the header text column enough to make it and the \nAnt logo fit next to each other.)\n\nAdditionally, the formatting of the page is inconsistent with the rest of\nthe Ant manual.  (It looks like someone cut and pasted from something other\nthan another Ant task.)"}, {"attachment_id": null, "tags": [], "creator": "mbenson@apache.org", "is_private": false, "count": 1, "id": 75655, "time": "2005-05-31T17:07:49Z", "bug_id": 35141, "creation_time": "2005-05-31T17:07:49Z", "text": "This page was automatically generated using a means that was, at the time, \nunder investigation for being the generation facility for the entire Ant \nmanual.  At present more options continue to be investigated.  This may offend \nthe occasional eye but you must agree the only possible harm here would be to \naesthetic sensibilities."}, {"attachment_id": null, "tags": [], "creator": "dsb@smart.net", "is_private": false, "count": 2, "id": 75695, "time": "2005-06-01T04:27:08Z", "bug_id": 35141, "creation_time": "2005-06-01T04:27:08Z", "text": "> This may offend the occasional eye but you must agree the only possible \n> harm here would be to aesthetic sensibilities.\n\nWrong.  That is not the only possible harm.  \n\nThe much more signficant harm is to usability and user efficiency.  When \nthe text doesn't fit in the user's chosen browser window width, the user \nhas to scroll horizontally to read the text.  Note that the user has to \nscroll right and then back left for EACH line of text.  That is horrible.\n\n(Remember that some users have big screens so they can see _multiple_\nwindows, say, an editor editing some file (.../build.xml, maybe?) and,\nsay, a browser displaying relevant documentation (the Ant manual, anyone?).\nDon't treat users as if they're too stupid to be able to handle multiple\nwindows (by assuming they use full-screen browser windows).)\n\nHTML is designed so that by default the browser can wrap regular text to\nfit the user's chosen window width.  Don't break that ability, by tying \nthe width of the text column to something else, especially when breaking \nit is completely unnecessary.\n\n\nSorry for the snippiness, but maybe you shouldn't claim that I must agree\nwith something that is clearly false and shouldn't summarily discard my \nbug report without showing any understanding of the problem.\n\n\n\n"}, {"count": 3, "tags": [], "bug_id": 35141, "text": "1. As I mentioned before, the Ant developer community is currently \ninvestigating options for auto-generation of Ant's documentation (see bug 34116 \nfor information on the most-evolved option).\n\n2. Because of #1 above, format-related changes to existing manual pages are \nfairly low-priority.\n\n3. Never forget that you as a concerned member of the community are free to re-\nformat the page to look like the rest of the manual and attach the resulting \ndiff to this bug report.  It would probably be committed.\n\n4. Even better, head on over to bug 34116 and have a say in the future of Ant's \ndocumentation to prevent this type of problem in the future.  Remember that the \nformat of this page at one time represented the future of Ant's documentation.  \nMost likely it is only by virtue of the fact that programmers like code better \nthan documentation that the entire manual is not formatted this way.\n\nThanks,\nMatt", "id": 75736, "time": "2005-06-01T16:43:03Z", "creator": "mbenson@apache.org", "creation_time": "2005-06-01T16:43:03Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "peterreilly@apache.org", "attachment_id": null, "id": 75739, "time": "2005-06-01T16:57:38Z", "bug_id": 35141, "creation_time": "2005-06-01T16:57:38Z", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of 35142 ***"}, {"count": 5, "tags": [], "text": "That page was generated through a combination of xdoclet and velocity. We dont\nwant to fix it by patching the HTML page, but by fixing the xdoclet and velocity\ntemplates.\n\nIn the Ant1.7 docs, the task looks a lot more consistent than the rest, as they\nall share the same .CSS files. We should check that they all resize properly.\n\nNote also that wherever we use [pre] tagged code snippets, things dont resize\nproperly as they are preformatted. That means that a lot of the stuff wont\nshrink to a very small width, though they can handle height. ", "is_private": false, "bug_id": 35141, "id": 75760, "time": "2005-06-01T23:49:11Z", "creator": "stevel@apache.org", "creation_time": "2005-06-01T23:49:11Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 35141, "attachment_id": null, "text": "> Even better, head on over to bug 34116 and have a say in the \n> future of Ant's documentation to prevent this type of problem \n> in the future\n\nThanks for the pointer.", "id": 75769, "time": "2005-06-02T02:37:05Z", "creator": "dsb@smart.net", "creation_time": "2005-06-02T02:37:05Z", "is_private": false}, {"count": 7, "tags": [], "creator": "dsb@smart.net", "attachment_id": null, "id": 75770, "time": "2005-06-02T02:47:17Z", "bug_id": 35141, "creation_time": "2005-06-02T02:47:17Z", "is_private": false, "text": "> Note also that wherever we use [pre] tagged code snippets, things dont \n> resize properly as they are preformatted. That means that a lot of the \n> stuff wont shrink to a very small width, though they can handle height. \n\nSure; some things can't be resized.  As long as fixed-format text isn't\nunreasonably wide (ideally, still following the 80-character standard),\nit doesn't bother me.\n\nI just wanted to make sure that things that could be resizable (regular \ntext, most columns) weren't set to a fixed width (either directly or\nindirectly).\n\n\n\n"}]