[{"count": 0, "tags": [], "creator": "dsb@smart.net", "attachment_id": null, "id": 75651, "time": "2005-05-31T16:35:54Z", "bug_id": 35142, "creation_time": "2005-05-31T16:35:54Z", "is_private": false, "text": "In the Ant User Manual, in the subant task's page, the text does not \nwrap to fit the user's browser window (or pane within that window).  This\nbehavior (and that page's formatting in general) is consistent with most of\nthe rest of the Ant Manual pages.\n\nThe text in the body of the page does not wrap to fit because the header\nand the body are wrapped in a table.  (That forces the browser to format\nthe body to match the width of the header, instead of letting the browser\nshrink or stretch the body to fit the user's chosen browser window width.)\n\n(Also, something, possibly that wrapping in a table, prevents the browser \nfrom trying to narrow the header text column enough to make it and the \nAnt logo fit next to each other.)\n\nAdditionally, the formatting of the page is inconsistent with the rest of\nthe Ant manual.  (It looks like someone cut and pasted from something other\nthan another Ant task.)"}, {"count": 1, "tags": [], "bug_id": 35142, "attachment_id": null, "id": 75656, "time": "2005-05-31T17:08:19Z", "creator": "mbenson@apache.org", "creation_time": "2005-05-31T17:08:19Z", "is_private": false, "text": "This page was automatically generated using a means that was, at the time, \nunder investigation for being the generation facility for the entire Ant \nmanual.  At present more options continue to be investigated.  This may offend \nthe occasional eye but you must agree the only possible harm here would be to \naesthetic sensibilities."}, {"count": 2, "tags": [], "bug_id": 35142, "attachment_id": null, "id": 75696, "time": "2005-06-01T04:28:33Z", "creator": "dsb@smart.net", "creation_time": "2005-06-01T04:28:33Z", "is_private": false, "text": "As I wrote for bug 35141:\n------------------------------------------------------\n\n> This may offend the occasional eye but you must agree the only possible \n> harm here would be to aesthetic sensibilities.\n\nWrong.  That is not the only possible harm.  \n\nThe much more signficant harm is to usability and user efficiency.  When \nthe text doesn't fit in the user's chosen browser window width, the user \nhas to scroll horizontally to read the text.  Note that the user has to \nscroll right and then back left for EACH line of text.  That is horrible.\n\n(Remember that some users have big screens so they can see _multiple_\nwindows, say, an editor editing some file (.../build.xml, maybe?) and,\nsay, a browser displaying relevant documentation (the Ant manual, anyone?).\nDon't treat users as if they're too stupid to be able to handle multiple\nwindows (by assuming they use full-screen browser windows).)\n\nHTML is designed so that by default the browser can wrap regular text to\nfit the user's chosen window width.  Don't break that ability, by tying \nthe width of the text column to something else, especially when breaking \nit is completely unnecessary.\n\n\nSorry for the snippiness, but maybe you shouldn't claim that I must agree\nwith something that is clearly false and shouldn't summarily discard my \nbug report without showing any understanding of the problem.\n----------------------------"}, {"attachment_id": null, "tags": [], "bug_id": 35142, "text": "See my comment #3 from bug 35141.", "count": 3, "id": 75737, "time": "2005-06-01T16:43:40Z", "creator": "mbenson@apache.org", "creation_time": "2005-06-01T16:43:40Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 35142, "attachment_id": null, "id": 75738, "time": "2005-06-01T16:57:02Z", "creator": "peterreilly@apache.org", "creation_time": "2005-06-01T16:57:02Z", "is_private": false, "text": "Changing the title, as this is true for\nall the generated manual pages - subant, tempfile, whichresource,\ncsc, ilasm, ildasm, importtypelib, jsharpc, setproxy, vbc,\nand wsdltodotnet.\nReducing the severity to enhancement."}, {"count": 5, "tags": [], "text": "*** Bug 35141 has been marked as a duplicate of this bug. ***", "attachment_id": null, "bug_id": 35142, "id": 75740, "time": "2005-06-01T16:57:39Z", "creator": "peterreilly@apache.org", "creation_time": "2005-06-01T16:57:39Z", "is_private": false}]