[{"text": "While I was trying to get to the bottom of why my webapp ServletContextListener\nclass was working fine under standalone TOMCAT but getting an error under\nEclipse WTP I seem to have uncovered that my contextInitialized() method is\nactually called twice.\n\nThis does not seem like correct behaviour.  If I startup, use; then shutdown\ntomcat my webapp handlers are called in this sequence:\n\ncontextInitialized();\ncontextInitialized();\ncontextDestroyed();\n\nThe above relates to the bug I'm filing.\n\n\nBelow is how I think it relates to another problem I am seeing (and other people\nseem to be having with integrated tomcat development with Eclipse WTP, check\ngoogle for \"SEVERE: Error listenerStart\" and \"SEVERE: context [/webapp] startup\nfailed due to previous errors\" with \"ClassNotFoundException\") :\n\n\nI _*SUSPECT*_ the first contextInitialized() call is made from the\nserver/outside-container executation context and therefore has the incorrect\nclass loader in play.\n\nI believe this is the reason why my Eclipse WTP tomcat launches fail when any \nServletContextListener is in use.  For whatever reasons the classpaths and\nconfiguration Eclipse specifies seems tighter than the default one when\n$CATALINA_HOME == $CATALINA_BASE and is uncovering this problem.  Eclipse WTP\nuses $CATALINA_BASE pointed to its mini-deployment directory.\n\nI _*SUSPECT*_ the 2nd call I see to run the handler is the proper time to do it,\nthis being from inside the webapp/container executation context and therefore\nthe correct class loader.", "tags": [], "bug_id": 35196, "attachment_id": null, "count": 0, "id": 75946, "time": "2005-06-03T04:59:18Z", "creator": "darryl@darrylmiles.org", "creation_time": "2005-06-03T04:59:18Z", "is_private": false}, {"count": 1, "tags": [], "creator": "darryl@darrylmiles.org", "attachment_id": 15280, "text": "Created attachment 15280\nCataling Log Output\n\nMy Error I have two <Host .../> inside <Engine> and my class is being instated\nfor each one of those.", "id": 75947, "time": "2005-06-03T05:59:12Z", "bug_id": 35196, "creation_time": "2005-06-03T05:59:12Z", "is_private": false}]