[{"count": 0, "tags": [], "bug_id": 35211, "text": "Currently, mod_cache is RFC compliant in its handling of Vary headers, but it\nbehaves in a less than optimal manner.\n\nIf a reply contains the vary header, it is noted.  If the varied headers match\nin both the stored version and the client request, the cache is used. If the\nvaried headers are missing or do not match, the cached copy is not used.  When\nthe cached copy is not used, a new version is fetched from the backend, and\nreplaces the previously cached copy, that contained different values for the\nVaried headers.  This effectively kills the cache hit rate when using the Vary\nheader, since anytime a header does vary the cached copy is destroyed.\n\nThe enhancement would be storing one copy of the page, for every Varied header\nvalue/combination.\n\nOne possible solution is to include the Varied headers in the Cache Hash.  This\nwould give each combination of varied headers, values and URLs their own unique\nhash, and would enable the current mod_disk_cache and mod_mem_cache to operate\nwith little or no changes.  The problem is that we do not know if a URL should\nbe varied, until after we have already determined the Cache Hash.  If this route\nis taken, some method to change the cache hash at a later time might be needed.\n\nAnother possible solution, that would require changes to both mod_mem_cache,\nmod_disk_cache, and htcacheclean, would be to make some knid of 'index' node. \nThis node would contain a list of all known combinations for each varied header,\nand the location of the cached version of each.", "id": 75989, "time": "2005-06-03T20:36:49Z", "creator": "chip@force-elite.com", "creation_time": "2005-06-03T20:36:49Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "chip@force-elite.com", "attachment_id": null, "text": "Fixed in trunk.  Went with modifiying the .headers file format to include a new\n'Vary Headers' format.", "id": 76363, "time": "2005-06-14T02:39:59Z", "bug_id": 35211, "creation_time": "2005-06-14T02:39:59Z", "is_private": false}]