[{"count": 0, "attachment_id": null, "creator": "solprovider@gmail.com", "text": "There should be a large one-click \"Download Lenya for Windows\" on the homepage.\n Use a big graphic saying \"WINDOWS DOWNLOAD HERE\".  It should immediately\ndownload the Windows Installer for the last stable release.  One click; not 3\nclicks choosing a mirror and wondering what \"tar\", \"gz\", \"asc\", and \"md5\" mean\nwhile trying to decide which version is for me.\n\nSee http://www.mozilla.org/ for an example.  Another site (I forgot which) has\nan even bigger \"Windows Download Here\" with a much smaller \"other downloads\"\nbelow it.", "id": 76122, "time": "2005-06-07T06:37:52Z", "bug_id": 35251, "creation_time": "2005-06-07T06:37:52Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "hubertus@groepper.com", "text": "I'm all for simplifying the download process and propose that the homepage gets some more verbose \ndownload links: Stable Windows (Binary installer), stable windows (source version), stable unix (bin/src), \nnightly dev snapshort (source) etc. \n\nIn addition, i'd prefer to have only a single download page (maybe in the project tab) that provides a \ngood summary of what files are available. This page should\n- let the user know what version is currently stable with link to release notes\n- explain any possible drawbacks for any given distribution form (Windows installer)\n- provide a link to further information on how to deal with MD5 etc.\n- link to the installation instructions and where to go from there\n\nThe download button at Mozilla is based on what OS you use and tries to guess the language. It often \nfailed for me. The mirror-thing is fine, sourceforge and many other high traffice download site use the \nsame method.", "id": 76127, "time": "2005-06-07T11:14:02Z", "bug_id": 35251, "creation_time": "2005-06-07T11:14:02Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "hubertus@groepper.com", "attachment_id": null, "is_private": false, "id": 76175, "time": "2005-06-08T18:11:46Z", "bug_id": 35251, "creation_time": "2005-06-08T18:11:46Z", "text": "Sorry, forgot about that one. Please review patches for bug 35271"}, {"count": 3, "attachment_id": null, "bug_id": 35251, "is_private": false, "id": 85224, "time": "2006-01-30T20:42:04Z", "creator": "hubertus@groepper.com", "creation_time": "2006-01-30T20:42:04Z", "tags": [], "text": "This can be closed even though there is no big download button I believe? "}, {"count": 4, "attachment_id": null, "creator": "solprovider@gmail.com", "is_private": false, "id": 85237, "time": "2006-01-31T00:11:48Z", "bug_id": 35251, "creation_time": "2006-01-31T00:11:48Z", "tags": [], "text": "The idea was for a one-click link on the homepage that picks a mirror and starts\nthe download.  Also the Download section might be moved before the News\n(especially since the latest news is we have not released in 7 months.)\n\nThe homepage was improved because of this request, and it can be closed if\nnobody else wants \"the big button\"."}, {"count": 5, "attachment_id": null, "bug_id": 35251, "is_private": false, "id": 102491, "time": "2007-04-26T08:03:01Z", "creator": "andreas@apache.org", "creation_time": "2007-04-26T08:03:01Z", "tags": [], "text": "I'm closing this bug, please re-open if there's need for further improvement."}]