[{"attachment_id": null, "tags": [], "creator": "BBurgess@tiaa-cref.org", "is_private": false, "count": 0, "id": 76226, "time": "2005-06-09T21:27:35Z", "bug_id": 35295, "creation_time": "2005-06-09T21:27:35Z", "text": "Currently the StarTeam Checkout Ant task has an attribute named \"forced\" with\nthe description: \n\nIf true, checkouts will occur regardless of the status that StarTeam is\nmaintaining for the file. If false, status will be used to determine which files\nto check out. Defaults to \"false\".\n\nWhen false, the task uses status to determine which files should be checked out.\n This is currently implemented so that OUTOFDATE and MISSING are the only\nstatuses where a checkout does occur.  If it is MERGE, UNKNOWN, MODIFIED, or of\ncourse CURRENT, it does not checkout the file.\n\nThis is not optimal behavior for an automated process such as part of a\ncontinual build process (which I believe is where this target is mostly used). \nFor automated processes, what is intended is that the checkout will leave the\nlocal folder exactly as the repository (checkouts would occur for MERGE,\nUNKNOWN, and MODIFIED as well as OUTOFDATE and MISSING).  Because the current\ntask is not implemented like this, I wonder if most script users are left using\nforced=\"true\" which causes CURRENT files to be checked out needlessly, \nsignificantly increasing the build time.\n\nWhat is the best way to fix this problem?  Change the behavior of checkout when\nforced=\"false\" to perform checkouts on the above mentioned statuses?  Change the\nbehavior of forced=\"true\" to skip CURRENT files (as I think this may always be\nunnecessary)?  Or perhaps add a new attribute called sync (or whatever) that\noverrides the forced attribute and performs the checkout as described above?"}, {"count": 1, "tags": [], "creator": "BBurgess@tiaa-cref.org", "is_private": false, "text": "Created attachment 15766\nFixes unnecessary retrieval of file encoding property", "id": 77630, "time": "2005-07-25T19:21:04Z", "bug_id": 35295, "creation_time": "2005-07-25T19:21:04Z", "attachment_id": 15766}, {"count": 2, "tags": [], "creator": "BBurgess@tiaa-cref.org", "attachment_id": 15767, "is_private": false, "id": 77631, "time": "2005-07-25T19:22:16Z", "bug_id": 35295, "creation_time": "2005-07-25T19:22:16Z", "text": "Created attachment 15767\nFixes unnecessary status update and checkout of CURRENTs"}, {"count": 3, "attachment_id": null, "bug_id": 35295, "text": "\n\n*** This bug has been marked as a duplicate of 35852 ***", "id": 77634, "time": "2005-07-25T19:24:51Z", "creator": "BBurgess@tiaa-cref.org", "creation_time": "2005-07-25T19:24:51Z", "tags": [], "is_private": false}]