[{"count": 0, "tags": [], "bug_id": 35297, "text": "This patch adds chunked encoding for IIS responses - i.e. Transfer-Encoding:\nchunked responses for HTTP/1.1 clients - allowing IIS to maintain persistent\nconnections to HTTP/1.1 clients through the ISAPI redirector.\n\nIIS hands a lot of the responsibility for HTTP protocol handling to the ISAPI\nextension - Apache is sooo much nicer to deal with.\nIIS will keep connections alive if there is a Content-Length specified in the\nrequest, but won't do transfer encoding for requests that don't like Apache does.\n\nContents of the patch:\n- Added 'enable_chunked_encoding' param (bool) to enable chunked encoding\n(default is disabled)\n- Modified isapi_private_data_t to track whether chunked encoding is enabled per\nrequest\n- Modified start_response to:\n   - Detect HTTP 1.1 clients and enable chunked encoding for the response (if\nthe Tomcat response hasn't already precluded that)\n   - Determine whether IIS should be told to keep the connection alive (IIS\nmakes us manage this as well if we want to have the ability to keep connections)\n   - Set the Transfer-Encoding: chunked header when used\n   - Use the HSE_SEND_HEADER_EX_INFO/ServerSupportFunction API to allow us to\ntell IIS to keep the connections open\n- Factored the WriteClient calls into a new function (for the new write())\n- Added support in write() for writing a chunked encoded response chunk\n- Added a flush hook for IIS (with flush_packets false) to allow the chunked\nencoded terminator (the 0 chunk) to be written on response completion\n\nI'd consider the chunked encoding experimental at the moment - we're beta\ntesting at the moment - which is why it's disabled by default.\nWe've run this against fairly complex web applications, with a mix of jsp, htm,\nxml, Content-Length, no Content-Length and some Connection: close behaviour, IE,\nFirefox etc.\nAll seems to work fine at the moment - chunked encoding isn't that complex -\nthough IE does get confused if there are non-chunk-encoded files in the cache.\nThe only reported failure is when using Fiddler with an HTTP/1.0 client, though\nI suspect this is Fiddlers problem (it can't handle 1.0 to the unpatched connector).\nStraight HTTP/1.0 from IE works fine.\n\nIt'd be great to get this into the codebase and have people beta test it to see\nif if any problems show up.\nAny problems are likely to be the result of incorrect negotiation of keep-alive\nor incorrect detection of responses from Tomcat that preclude using chunked\nencoding.\n\ncheers\ntim", "id": 76229, "time": "2005-06-09T22:30:32Z", "creator": "Tim.Whittington@orionhealth.com", "creation_time": "2005-06-09T22:30:32Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 35297, "attachment_id": 15357, "id": 76231, "time": "2005-06-09T22:33:07Z", "creator": "Tim.Whittington@orionhealth.com", "creation_time": "2005-06-09T22:33:07Z", "is_private": false, "text": "Created attachment 15357\nChunked encoding patch for JK/ISAPI\n\nPatch against jk_isapi_plugin.c r1.49"}, {"count": 2, "tags": [], "creator": "mturk@apache.org", "attachment_id": null, "id": 76950, "time": "2005-07-03T11:27:37Z", "bug_id": 35297, "creation_time": "2005-07-03T11:27:37Z", "is_private": false, "text": "The complexity of your patch it too big to be considered as bug.\nSomething like that should be considered for the 1.3 branch.\nThe current implementation works fine for the majority of the users."}, {"count": 3, "tags": [], "creator": "Tim.Whittington@orionhealth.com", "attachment_id": null, "id": 78487, "time": "2005-08-14T23:42:12Z", "bug_id": 35297, "creation_time": "2005-08-14T23:42:12Z", "is_private": false, "text": "I've improved this functionality a bit - mostly tweaking and adding some of the\nHTTP/1.1 edge cases for enabling chunked encoding.\n\nI won't repatch until JK 1.3 is branched, as there's no roadmap for that at the\nmoment."}, {"count": 4, "tags": [], "creator": "Tim.Whittington@orionhealth.com", "attachment_id": null, "id": 104589, "time": "2007-06-21T01:42:46Z", "bug_id": 35297, "creation_time": "2007-06-21T01:42:46Z", "is_private": false, "text": "I'm still maintaining this against the head of JK for my customers, and still\nwaiting for JK 1.3 (two years and counting).\nThe IIS connector without chunked encoding is pretty much useless for high\nvolume sites (I've had customers completely exhaust the TCP ports on a Windows\nServer because of the lack of reuse, even with the TCP params tweaked up).\n"}, {"count": 5, "tags": [], "creator": "Tim.Whittington@orionhealth.com", "attachment_id": 21551, "id": 113841, "time": "2008-02-17T14:05:16Z", "bug_id": 35297, "creation_time": "2008-02-17T14:05:16Z", "is_private": false, "text": "Created attachment 21551\nChunked encoding patch for JK/ISAPI\n\nI've updated the patch against head following discussions with Rainer and\nMladen on the dev list.\nThis patch separates out all chunk encoded behaviour based on whether chunk\nencoding is enabled for the redirector (in the case of response writes this is\na flag on the private date object for the request).\nI've tested this on IIS 6.0 and 5.1 with chunk encoding enabled and disabled.\n\nThere are a couple of minor variances from trunk behaviour here:\n- I've disabled SF_NOTIFY_AUTH_COMPLETE for IIS 5.1 (copied from my patchset),\nas I've never found a 5.1 it didn't break OPTIONS/PUT etc. on.\n- The basic response write code has been reworked into isapi_write_client so it\ncan be reused for the chunked encoding on IIS 5 (vector writes are used for 6)."}, {"count": 6, "tags": [], "bug_id": 35297, "attachment_id": null, "text": "Chunked encoding support for the ISAPI redirector has been added in the meantime.", "id": 180108, "time": "2014-12-31T15:17:41Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2014-12-31T15:17:41Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 35297, "attachment_id": null, "text": "(In reply to Rainer Jung from comment #6)\n> Chunked encoding support for the ISAPI redirector has been added in the\n> meantime.\n\nTo be specific: it was r701029 and r704677 (and maybe others in October 2008), included in 1.2.27 onwards.", "id": 180112, "time": "2014-12-31T19:44:29Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2014-12-31T19:44:29Z", "is_private": false}]