[{"count": 0, "tags": [], "creator": "frank.mau@sun.com", "text": "Graceful restart should wait for thread-termination to restart smooth", "id": 76258, "time": "2005-06-10T11:52:51Z", "bug_id": 35308, "creation_time": "2005-06-10T11:52:51Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 35308, "attachment_id": null, "text": "It does wait a little already. Please do not reopen the report.", "id": 76266, "time": "2005-06-10T16:40:53Z", "creator": "remm@apache.org", "creation_time": "2005-06-10T16:40:53Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 35308, "attachment_id": null, "text": "Please also also refer to bug 34140.\n\nI was (probably incorrectly) assuming that the Tomcat implementation of the\nstop() method in the org.apache.commons.daemon.Daemon interface blocks until all\nrequests are serviced and no new requests are admitted.\n\nIf what Remy Maucherat says is correct that Tomcat only waits a little then this\nis not sufficient as one cannot possibly know how long a request takes to\ncomplete unless on can watch pending requests.\n\nI am kindly asking for confirmation that Tomcat truly waits for the last pending\nrequest to terminate and then immediately returns from stop(). If that question\ncannot be answered with \"yes\" then re-opening of this bug should be considered.\n\nAnother thought which is probaly close to what the reporter has in mind is a\nreload function that avoids re-instantiating the server but re-loads\nconfiguration files, i.e. calls stop(), init() and start() in that sequence. I\nguess this would have to be implemented through BOTH the socket control\ninterface and the commons-daemon project. This also be useful for those who run\nhttpd mod_jk with the only difference that they have to use an extended\nsequence: httpd stop, tomcat reload, httpd start. Obviously they they have to\nstop httpd entirely because otherwise server errors would occur while httpd is\nrunning and cannot connect to the reloading tomcat.", "id": 76284, "time": "2005-06-10T23:56:14Z", "creator": "bht@actrix.gen.nz", "creation_time": "2005-06-10T23:56:14Z", "is_private": false}]