[{"count": 0, "tags": [], "creator": "castel.pierre@free.fr", "attachment_id": null, "id": 76427, "time": "2005-06-15T15:19:00Z", "bug_id": 35370, "creation_time": "2005-06-15T15:19:00Z", "is_private": false, "text": "When a sampler has a name which corresponds to the name of a header declared in \na HTTP Header Manager component its name is well reported in listeners the \nfirst time it is processed but it is replaced by the name of the first variable \ncomponent (maybe other kind of components are eligible for giving the \nreplacement name) next times the sampler is processed.\n\nFor instance, consider the following Test Plan :\nTest Plan\n|----- Thread Group (looping infinitely)\n       |----- Interleave Controller\n              |----- HTTP Sampler (named \"Test 01\")\n              |----- HTTP Sampler (named \"Test 02\")\n              |----- HTTP Sampler (named \"Test 03\")\n              |----- Results Table\n       |----- Java Sampler (sleep request - optional)\n       |----- HTTP Header Manager (with a header called \"Test 02\")\n       |----- User Defined Variables (named \"My Var\")\n\nBy launching it the Results table listener should display something like this :\n  - Test 01\n  - Test 02 <==== first time it'OK\n  - Test 03\n  - Test 01\n  - My Var <==== next times name is KO\n  - Test 03\n  - Test 01\n  - My Var\n  - Test 03\n  ...\n\nRemark :\nThe bug is not linked to the Interleave controller. With a Random\ncontroller the same behaviour is observed (the first time test #2 is\nprocessed \"Test 02\" is displayed, next times the name is replaced by \"My\nVar\")."}, {"count": 1, "tags": [], "bug_id": 35370, "text": "Bug is also not dependent on any controllers - all it needs is a Header Manager\nand sampler with the same name as a header.\n\nI've fixed the code in CVS Head - I hope.", "id": 76432, "time": "2005-06-16T00:57:20Z", "creator": "sebb@apache.org", "creation_time": "2005-06-16T00:57:20Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "The fix seems to work, but changes the name of one of the entries in test \nplans, so is not backward compatible - i.e. existing plans don't work...\nThis obviously needs to be backed-out or further fixed.\n\nBy the way, a header manager should normally be added as a child of the target \nhttp sampler. In your example the Header Manager is in scope for all the \nsamplers...", "attachment_id": null, "bug_id": 35370, "id": 76464, "time": "2005-06-16T12:12:27Z", "creator": "sebb@apache.org", "creation_time": "2005-06-16T12:12:27Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 35370, "text": "Using a same HTTP Header Manager with several samplers is another subject, \nisn't it ?\nMoreover I have not found such a restriction in User's manual. I only saw that \npoint : \"If there is more than one Header Manager in the scope of a Sampler, \nthere is currently no way to specify which one is to be used.\" (which is not \nthe same thing)\n\nIn any cases if the HTTP Header Manager is in the scope of all the samplers in \nmy example this is because, in my personal case, same headers have to be used \nfor all the samplers (duplicating the HTTP Header Manager would not be very \nuser-friendly and especially not easy to maintain).", "id": 76469, "time": "2005-06-16T13:46:45Z", "creator": "castel.pierre@free.fr", "creation_time": "2005-06-16T13:46:45Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 76479, "time": "2005-06-17T02:07:44Z", "bug_id": 35370, "creation_time": "2005-06-17T02:07:44Z", "is_private": false, "text": "Yes, you can share the HeaderManager between samplers.\nIn your case you could add it to the InterLeave Controller, so that it only\napplied to the HTTP samplers.\n\n==\n\nI've updated CVS again - this time existing test plans should still work."}]