[{"attachment_id": null, "tags": [], "creator": "rbrown3@bluebottle.com", "is_private": false, "count": 0, "id": 76607, "time": "2005-06-22T16:18:56Z", "bug_id": 35466, "creation_time": "2005-06-22T16:18:56Z", "text": "PROCEDURE:\n\n1: Install Slide WAR and Slide document WAR file on Tomcat\n2: Start Tomcat\n3: In the browser, go to the main slide documentation page (Assuming we are \nusing Port 8080, we go to: http://localhost:8080/slide-doc)\n\nNote that the Slide documentation identifies 4 standard users that come with \nSlide: root, john, john2, and guest. The documentation suggests that you should \nbe able to log in as root.\n\n4. Follow the instructions given in http://localhost:8080/slide-doc/howto-\nacl.html to enable athentication on Slide.\n\n5: Attempt to follow the instructions for creating a user as given on the page:\nhttp://localhost:8080/slide-doc/howto-create-users.html\n(alternatively, go to http://jakarta.apache.org/slide/howto-create-users.html \nsince the pages are the same).\n\n5a. Download and install the DAVExplorer application\n5b. Run DAVExplorer\n5c. Attempt to connect to localhost:8080/slide\n\nPROBLEM 1: The root login and password does not work. You cannot log in to \nSlide's resources at all!\n\n6. Go to Apache Foundation's Bugzilla, search through Slide's open bugs for the \nkeyword \"login\"\n\n7. Read bug #22409\n\nNOTE: Bug 22409 talks about adding usernames to the tomcat-users.xml file in \norder to log in to Slide. Nowhere in Slide's configuration docmentation is \nthere mention of needing to edit anything other than the web.xml file (for \nenabling authentication) and the Domain.xml file (for user information and \nproperties). This is just one aspect of some serious documentation bugs which \nwill be entered seperately into this Bugzilla system.\n\n8. Based on information in Bug #22409, edit the tomcat-users.xml file and add \nentries for \"root\" and \"john2\".\n\n9. Restart Tomcat and DAV Explorer\n\n10. Log in to Slide (this time, the login works)\n\n11. Attempt to add a user as instructed in http://localhost:8080/slide-\ndoc/howto-create-users.html.\n\n12. Restart Tomcat.\n\n13. Restart DAV Explorer\n\n14. Attempt to log in as the new user.\n\nPROBLEM 2: Login FAILS. Apparently, changes made following the user instruction \nDO NOT WORK.\n\n15. Add a new entry for \"test\" in the tomcat-users.xml directory.\n\n16. Restart everything and attempt to log in as the new user (test) again.\n\nPROBLEM 3: Login succeeds. This indicates that the security system does not \nwork as \"documented\". According to the \"documentation\", users are added through \nentries in the /slide/users directory, and the entries in the Domain.xml file \nhandle the user' permissions and passwords.\n\nIn actuality, it is the tomcat-users.xml file that actually creates users \nrecognized by Slide. The users, passwords, and roles entered into that file \ndetermine who can log in and what their permissions are.\n\nRoles defined in Domain.xml seem to work, though, and testing shows that you do \napparently need to define entries for a user's permissions in Domain.xml in \norder to log in without errors (Note: creating a new user accordig to the \ninstructions in http://localhost:8080/slide-doc/howto-create-users.html doesn't \nwork at all because the system apparently ignores any changes made to \nproperties that aren't done through editing Domain.xml).\n\nThe bottom line is that Slide's security system does not work as it is \ncurrently documented. The documentation is abysmal as it is, but the fact that \nit is also inaccurate does not help matters.\n\nEither this system must be fixed so that it operates as \"documented\", or the \ndocumentation needs to be changed. The way things are now is unacceptable."}, {"count": 1, "text": "Headnote: reading your bug report left me with the feeling you are someone who   \ndoesn't understand the basics of J2EE environnement and is blaming people for   \nhis ignorance, I simply don't like such behaviour. I admit the doc is not  \nalways clear, but if you need hints on how to configure slide on your tomcat,  \nyou'll better have posted your question the mailing list. And for the sake, if  \nyou don't know how to configure a j2ee container and just want a ready to run  \nWEBDAV server, download the tomcat bundle version of slide.  \n   \n- First, enabling authentification for slide in web.xml does not mean slide        \ndoes the authentification, this only mean access to DAV servlet will require         \nauthentification from container (see any J2EE basic documention on web.xml        \nauth-constraint section) \n         \n- Second, as stated in      \nhttp://jakarta.apache.org/slide/howto-create-users.html, <<I believe this      \ndepends upon you having the Slide Realm as the default authentication      \nmechanism for Slide. This is the default if you have installed the Tomcat      \nbundle.>> So you are following a doc which refers to using the Slide-Realm,      \nnot the default tomcat realm (tomcat-user.xml is the default tomcat-realm) and \nwhich was written by someone who used the tomcat-bundle    \n     \n- Thirds, as indicated in http://jakarta.apache.org/slide/howto-acl.html, the    \nrealm wrappers.catalina.SlideRealm does the link between slide user and the    \ntomcat users.    \n    \n    \n/users/* and /roles/* are used by slide to manage it's ACLs, that is the     \nwebdav authorisations part. If you want to use slide to do the     \nauthentification too, you need to follow the instructions at     \nhttp://wiki.apache.org/jakarta-slide/SlideRealm      \n    \nI quote you: \"In actuality, it is the tomcat-users.xml file that actually    \ncreates users recognized by Slide. The users, passwords, and roles entered    \ninto that file determine who can log in and what their permissions are.\"    \nThat is false, in your configuration, tomcat-users.xm define authentification    \nand authorization managed by CONTAINER, If you add users only there, tomcat    \nwill not grant them any right accoring to acl as there is no    \ncorresponding /user/    \n    \n    \nI'll recommend you learn a bit how security work with servelts and J2EE    \ncontainers before you starting blaming slide docs. Explaining the J2EE    \nsepecifications is out of the scope of slide documentation,    \n    \n    \nThough i admit there are some ambiguities in    \nhttp://jakarta.apache.org/slide/howto-create-users.html were this should be    \nstated explicitly that you need slide realm.     \n    \nAlso in http://jakarta.apache.org/slide/howto-acl.html the sentence \"By    \ndefault, when running inside Tomcat, authentication for the WebDAV servlet is    \ncontrolled by the realm wrappers.catalina.SlideRealm which accesses user names    \nand passwords directly from the Slide namespace at /slide/users.\"     \nshould be replaced by \"By default, when running inside Tomcat-bundle,    \nauthentication for the WebDAV servlet is controlled by the realm    \nwrappers.catalina.SlideRealm which accesses user names and passwords directly    \nfrom the Slide namespace at /slide/users.\" ", "bug_id": 35466, "is_private": false, "id": 76638, "time": "2005-06-23T10:25:48Z", "creator": "delbd@oma.be", "creation_time": "2005-06-23T10:25:48Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "rbrown3@bluebottle.com", "text": "I have read your comments with great interest.\n\nI have one suggestion for *you*:\n\nLearn who you are dealing with before making assumptions about that person's\n(lack of) knowledge and/or who or what they are \"blaming\" for their troubles.\n\nFYI: I have been working with J2EE since 1998 and with Tomcat since its first\nversion became publicly available. I know about security setups, realms, etc. In\nfact, I am currently running a pretty secure set of J2EE- based applications out\nof my basement webserver -- all of which are running under Tomcat. I suspect\nthat I may know more about such things than you -- but then, I don't want to\nmake the kinds of assumptions about you that you are making about me.\n\nThe situation with Slide security is quite simple: either it isn't working as\ndocumented, or your documentation is faulty. According to you, security is\nworking \"correctly\" which means your documentation is faulty.\n\nThank you for clarifying this. You might want to consider closing this bug. As\nfor me, apparently what I really need to do is file several bugs against your\ndocumentation. No problem. I'll be happy to do so -- especially since it will be\nnecessary to demonstrate to you just how wrong you are about my J2EE ignorance...", "count": 2, "id": 76675, "time": "2005-06-23T20:09:40Z", "bug_id": 35466, "creation_time": "2005-06-23T20:09:40Z", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 35466, "is_private": false, "id": 76684, "time": "2005-06-24T02:51:43Z", "creator": "rbrown3@bluebottle.com", "creation_time": "2005-06-24T02:51:43Z", "tags": [], "text": "Oh, by the way:\n\nThis is bit a \"trivial\" bug, especially since you yourself admit inadequacies in\nthe documentation. Inadequacies in documentation contribute to non- usability of\nsoftware and as such should not be considered \"trivial\"."}, {"attachment_id": null, "tags": [], "bug_id": 35466, "is_private": false, "count": 4, "id": 76689, "time": "2005-06-24T09:55:17Z", "creator": "delbd@oma.be", "creation_time": "2005-06-24T09:55:17Z", "text": "Hello,      \n      \nFirst, am not a slide developper, just a user watching the bug reports. My      \nopinion does not represent in any way the opinion of the slide team.      \n      \nYou probably know more than me about J2EE environnements, for sure.          \nAs i said, this was the feeling your bugreport left on me. After reading your          \ncomment and rereading twice your report, i came to the conclusion you tried to    \nexpress in the report how some beginner could feel when reading documention,    \nleaving him clueless on what to do, so to express slide developper team there    \nwas some documentation problem there.      \n      \nThis is all to your honor. But in the lenghtly procedure you decribed, mixed      \nwith word such as \"must be fixed\" and \"unacceptable\" and uppercase messages, I      \nconsidered you someone feeling higher than others and giving orders, which was      \nvery aggressive. That's why i suggested basic questions on configuration  \nshould go to the mailing list, gave you hints on were to look    \nfor and expressed you the fact i did not like such behaviour.   \n      \nDo not take me wrong, there are indeed bugs in documentation and i appreciate      \nthe fact someone put a bug reports on it, this is a good way to help the      \ndeveloppement of a project.   \n   \n \nAnd by the way, sorry i made a mistake there: \nI said 'If you add users only there, tomcat will not grant them any right \naccoring to acl as there is no corresponding /user/' where the correct \nsentence is 'If you add users only there, slide will not grant them any right \naccoring to acl as there is no corresponding /user/' \n  "}, {"count": 5, "tags": [], "text": "Calm down.\nAll of us work for the community, many of the projects would not be possible,\nbut because the commitment of many people that just do it for the benefit of the\ncommunity we have such good products.\nJust keep focused on the facts and respect other ideas.", "is_private": false, "id": 76690, "creator": "philosophyofmind@yahoo.com.mx", "time": "2005-06-24T10:04:38Z", "bug_id": 35466, "creation_time": "2005-06-24T10:04:38Z", "attachment_id": null}]