[{"count": 0, "tags": [], "bug_id": 35497, "attachment_id": null, "id": 76696, "time": "2005-06-24T15:45:09Z", "creator": "kenny.pearce@hxti.com", "creation_time": "2005-06-24T15:45:09Z", "is_private": false, "text": "Installation details: Tomcat standalone servlet container (standard installation\nfrom source)\njdk1.5.0_03\nRed Hat Enterprise Linux 3\n\nAdditional JARs in shared/lib: Sun AppServer SAAJ implementation (saaj-api.jar,\nsaaj-impl.jar)\nJSP standard taglib\nJavaMail\n\nServer Use Pattern: development platform for a handful of programmers working on\nservlets simultaneously. Lots of undeploying and redeploying of applications as\nthey change and need to be tested. \n\nTomcat Invocation: started via the script included in\nbin/jsvc-src/native/Tomcat5.sh, slightly modified to support the \"restart\"\ncommand and installed in /etc/init.d/tomcat. \n\nConfiguration: standard (nothing changed except hostname to IP on local network,\nport from 8080 to 80, etc.)\n\nBehavior: Twice now in the period of a week Tomcat has spontaneously stopped\nresponding to requests (doesn't reject them, just times out). Servlet threads\nrunning in the background also stop. This includes the Tomcat test servlets, not\njust the servlets we are developing. Subsequently, the jsvc processes (there are\ntwo; one runs as uid root, the other as uid tomcat5, not sure why) do not\nrespond to the TERM signal. They must be killed with the KILL signal and\nrestarted before any server content (including static HTML) can be accessed. I\ndoubt if this is of any significance, but I think it is strange that it has\nhappened at almost exactly the same time of day in both cases (~16:30, system\ntime). The behavior is sporadic and I have as yet been unable to produce it at\nwill, but am working on it."}, {"count": 1, "tags": [], "bug_id": 35497, "attachment_id": null, "is_private": false, "id": 76697, "time": "2005-06-24T15:51:35Z", "creator": "remm@apache.org", "creation_time": "2005-06-24T15:51:35Z", "text": "The issue is that on this (broken) OS, the thread which accepts new sockets\ndisappears (so Tomcat becomes dead).\n\nSee the release notes (RHEL 3 is based on RH 9):\n\n================\nTomcat on Linux:\n================\nGLIBC 2.2 / Linux 2.4 users should define an environment variable:\nexport LD_ASSUME_KERNEL=2.2.5\n\nRedhat Linux 9.0 users should use the following setting to avoid\nstability problems:\nexport LD_ASSUME_KERNEL=2.4.1"}, {"count": 2, "tags": [], "text": "Hello, I appeared to have the exact same problem but it happened on Windows.\n\nServer 1:\nWindows 2000\n5.00.2195\nService Pack 4\nSingle Processor (Athlon XP 2000+)\nTomcat 5.0.28\nJ2SDK1.4.2_03\n\n\nServer 2:\nOriginal dev/test server:\nWindows 2000\n5.00.2195\nService Pack 4\n1/2/4 Xeon CPUs @ 2.4GHz (removing CPUs didn't help the situation)\nTomcat 5.0.28\nJ2SDK1.4.2_08\n\n\nServer 1 listed above worked without any problems. However, when I deployed the\nservice on server 2, Tomcat would stop responding after the servlets are not\naccessed for a period of time (around 4-5 hrs). Executing shutup.bat produced no\nvisible effect. Strangely, as far as I can tell, the JSP pages worked just fine. \nWhen I modified the web.xml file within the WEB-INF directory of my application,\nthe supposely dead Tomcat did a context-reload and the previously unresponding\nservlets came back alive too. After some futher testings, to my amazement, I\nfound that could bring Tomcat back alive by simply focus on the Tomcat console\nand pressed \"Enter\" (I assum press any other key would work too).\n\nI would appreaciate it if anyone can shed some light on this matter, and for now\nI'll test to see whether or not having a external thread calling a dummy servlet\nperiodicaly can remove this problem.", "is_private": false, "id": 77326, "creator": "kaichun.lin@gmail.com", "time": "2005-07-15T12:15:18Z", "bug_id": 35497, "creation_time": "2005-07-15T12:15:18Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "For this kind of problem, you need to investigate using posts on tomcat-user,\nwhich will yield far more useful feedback.", "is_private": false, "id": 77330, "creator": "remm@apache.org", "time": "2005-07-15T14:14:03Z", "bug_id": 35497, "creation_time": "2005-07-15T14:14:03Z", "attachment_id": null}]