[{"count": 0, "tags": [], "creator": "xdelabouret@cvf.fr", "is_private": false, "text": "Hello log4j-dev,\n\nUsing Log4J in a production environment involving syslog and alerting, we would\nlike to have some minor parametrability added to the Syslog appender (it may\nimpact other Log4J parts):\n\n1) Customize the syslog level corresponding to FATAL \n\nToday the syslog level corresponding to FATAL is EMERG (hardcoded). As FATAL has\nno equivalent in syslog, it can be desirable feature to have it customized with\nthe log4j.properties file. In fact it is desirable for us, for we already use\nthe ALERT syslog level to raise alerts and reserve EMERG for other specific needs.\n\n==> Proposal: add a FatalSyslogMapping property for syslog appenders, e.g:\n\nlog4j.appender.A1=org.apache.log4j.net.SyslogAppender\nlog4j.appender.A1.SyslogHost=localhost\nlog4j.appender.A1.Facility=LOCAL7\nlog4j.appender.A1.FatalSyslogMapping=ALERT\n\n\n2) Customize the text corresponding to a given level\n\nToday a given Log4J level corresponds to a (hardcoded) string when you print\nthis level in a file or a syslog log. We would like to use slightly different\nstrings for the log4j levels, for example:\nLevel.DEBUG => \"debug\"\nLevel.INFO  => \"info\"\nLevel.WARN => \"warning\"\nLevel.ERROR => \"error\"\nLevel.FATAL => \"alert\"\n\nWe would like to customize this with the log4j.properties too, it needs some\nmore investigation for a concrete proposal. We already use other APIs that\nproduce this format though, so it is an important need for us to have a unified\nlog format through syslog.\n\n\nTo address these needs we are going to write our own appender. We may provide\nyou patches to merge these features to mainstream. Would you be interested in\nthese patches? Or are you working on such features for Log4j1.3alpha?\n\nBest regards", "id": 76839, "time": "2005-06-30T17:42:50Z", "bug_id": 35563, "creation_time": "2005-06-30T17:42:50Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 35563, "attachment_id": null, "text": "Submit a patch off of SVN trunk.", "id": 98635, "time": "2007-01-28T03:22:45Z", "creator": "genman@noderunner.net", "creation_time": "2007-01-28T03:22:45Z", "is_private": false}]