[{"count": 0, "tags": [], "text": "Please be aware that I am a Windows guy and am aware that this problem was \nprobably generated out of my ignorance so please excuse me.\nMy company is having a new web site developed and I was asked to utilize Tomcat \nas an option by our new web developer. We previously ran only IIS so this is \nnew territory for me. I am running a w2k3 web edition server with IIS 6.0. \nInstalled the jdk and jre then installed tomcat. The developer gave me a war \nfile, I installed it and all was good. I originally thought that I would have \nto maintain separate file locations for each program to serve there respective \ncomponents. I then realized after talking to the JSP ISAPI program support team \nthat it would allow me to point a virtual directory in IIS to the directory \nthat tomcat creates. I realized at that point that I had installed tomcat with \nthe default locations on the system partition and that conflicted with the \npartition on the server that I had created to house the web data. With me so \nfar? I hope so.\nI decided to uninstall tomcat and re-install it on the partition for the web \ndata, and since I did that I cannot get the Apache Server Service to start on \nthe server. I have tried to uninstall the program, the JDK and JRE and start \nover which did not fix the problem. I then did all of that again and went into \nthe registry to strip all of the references that I could find for tomcat and \nthen reinstalled it and still cannot get the service to start. Is there \nanything in the install that could be pointing in the wrong direction or does \nthe install have to be done to the primary partition. \nI need to get this remedied ASAP since our new site is going live Thursday of \nnext week and they are asking to have it in place for testing by Tuesday. My \nonly other solution would be to reinstall the OS and start from scratch \nassuming that it is a registry issue.", "is_private": false, "id": 76863, "creator": "bcharles@seec.com", "time": "2005-07-01T02:00:52Z", "bug_id": 35570, "creation_time": "2005-07-01T02:00:52Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 35570, "text": "Bugzilla is not a support forum. Please use the tomcat-user mailing list.", "id": 76898, "time": "2005-07-01T20:19:56Z", "creator": "markt@apache.org", "creation_time": "2005-07-01T20:19:56Z", "is_private": false, "attachment_id": null}]