[{"count": 0, "tags": [], "bug_id": 35573, "attachment_id": null, "id": 76869, "time": "2005-07-01T07:28:35Z", "creator": "bht@actrix.gen.nz", "creation_time": "2005-07-01T07:28:35Z", "is_private": false, "text": "There is an urgent need to identify virtual servers within Tomcat by an ID or\nzone name and not by server name.\n\nThe scenario is multiple virtual servers and mod_jk with Apache httpd.\n\nThe reason for the request is as follows:\n\nA virtual server might need to have its name changed.\nIn that case, with the current state of affairs the following changes\nwould have to be performed:\n\n1) In Apache httpd.conf, change the server name.\n2) In Apache httpd.conf, change the server name aliases.\n3) In Tomcat server.xml, change the the name attribute in the <Host element.\n4) In Tomcat server.xml, change the the server name aliases.\n5) In Tomcat, in conf/Catalina, change the name of the directory with the name\nof the server.\n6) Stop Apache httpd.\n7) Re-start Tomcat.\n8) Start Apache httpd.\n\nThese steps are by far too many.\n\nIn comparison, when a server entity is referenced by an ID, such as a servlet\nzone, then only the following steps are required to change the server names and\naliases:\n\n1) In Apache httpd.conf, change the server name.\n2) In Apache httpd.conf, change the server name aliases.\n3) Re-start Apache httpd.\n\n\nAs can be seen here, with a servlet zone based scheme, a server name change does\nNOT require a Tomcat re-start because the zone name remains unchanged.\n\nThis is because the connector responds to the servlet zone name and Tomcat is\nfreed from having to duplicate the server alias lookup of Apache httpd.\n\nAs is obvious from the steps in the current state of affairs, that a lot of\nduplication has to be painfully maintained both in Apache httpd and Tomcat\nconfiguration files.\n\njserv, the predecessor of Tomcat, employed a servlet zone based scheme as\nsuggested and did not require a re-start on a change of server name."}, {"count": 1, "tags": [], "bug_id": 35573, "text": "Sorry ...", "id": 76870, "time": "2005-07-01T08:04:35Z", "creator": "remm@apache.org", "creation_time": "2005-07-01T08:04:35Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 35573, "text": "Remy,\n  The nature of your comment indicates to me that you feel insulted by this\nrequest. By no means did I intend to insult you.\n\nWe have a business case for this so our management requres discussion as to why\nit is not possible, especially in light of the fact that the predecessor, jserv,\nsatisfied our requirements.\n\nI am re-opening this as an enhancement.\nOur management assumes that Tomcat is a cooperative project where discussion is\npossible and encouraged, but they indicateed to me that they are eager to be\ninformed about any changes to the project's nature in that respect.", "id": 76957, "time": "2005-07-04T00:30:07Z", "creator": "bht@actrix.gen.nz", "creation_time": "2005-07-04T00:30:07Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "Then use jserv ;)", "id": 76966, "time": "2005-07-04T09:23:31Z", "bug_id": 35573, "creation_time": "2005-07-04T09:23:31Z", "is_private": false}]