[{"count": 0, "tags": [], "creator": "bmf@opentext.com", "text": "When a <junit> timeout occurs, the formatter log files do not contain the logs\nof the test, though if you use \"showoutput=true\" the logs are visible on the\nconsole.\n\nIf I have a formatter set up for the <junit> task and a timeout occurs during a\ntest execution, then the log output of the test does not appear in the formatter\ntext file.  However, if I specify \"showoutput=true\" in the <junit> task, then\nthe output of the test appears in the console.\n\n<junit\n\tprintsummary=\"true\"\n\tfork=\"true\"\n\tdir=\"${ecm.basedir}\"\n\thaltonfailure=\"true\"\n\tfailureproperty=\"test.failed\"\n\ttimeout=\"600000\"\n\tmaxmemory=\"1024m\"\n\tshowoutput=\"${junit.showoutput}\">\n\n\t<formatter type=\"brief\" />\n\t<formatter type=\"xml\" />\n\nIf a timeout occurs after 10 minutes, the *.TXT and *.XML files of the formatter\ndo not contain any log output. They only have a couple of lines indicating that\na timeout occurred.\n\nHowever, if I set showoutput to true, then the console contains all of the\nlogging data of the test prior to the timeout, which makes it much easier to\nfigure out why the test timed out.\n\nIn our case, we use the MailLogger to send out the log, so we can't have all the\noutput going to the console, since it grows too large to be sent via e-mail.\n\nThe doc for the showoutput attribute indicates that it should be the same data\nthat goes to the formatters:\n\nShowoutput - Send any output generated by tests to Ant's logging system as well\nas to the formatters. By default only the formatters receive the output.", "id": 77046, "time": "2005-07-06T20:13:41Z", "bug_id": 35634, "creation_time": "2005-07-06T20:13:41Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "hi,\n\nThis issue is still present in ant 1.7.0. \nIf the timeout is reached, or if the VM exits by its own, logs are displayed on\nthe console but are not printed by the XML formatter. \n\nHow an user is supposed to understand why a test had crashed if logs are lost ? :-)\n", "bug_id": 35634, "is_private": false, "id": 105716, "time": "2007-07-17T05:59:42Z", "creator": "clement.mathieu@sophia.inria.fr", "creation_time": "2007-07-17T05:59:42Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 35634, "is_private": false, "text": "This is a known issue of the fact that the XML format includes summary\nattributes on the root element; the test result formatter builds up a DOM in\nmemory and saves it on success.\n\nwhen the JVM is killed, no file, so no diagnostics.\n\na brand new XML format would fix this, but there's no easy way to do an\nstream-to-disk version of the current format.\n\nWhat we could do is add an option to save the (incomplete) DOM to disk after\nevery test. This is something you could turn on with a java property in the test\nprocess. It would make big test runs slower, but let people diagnose what the\nlast test that finished was, and from that, infer what went wrong. ", "id": 111591, "time": "2007-12-09T14:40:33Z", "creator": "stevel@apache.org", "creation_time": "2007-12-09T14:40:33Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "ed.randall@ingenotech.com", "text": "I'm finding that, when using <junit> with a timeout and <batchtest>, if the\ntimeout occurs there is no output written to the XML results file at all.\n\nThe test does not then appear in the subsequent junitreport.\n\nAs a result of this nobody noticed that a dozen or so of our tests were never\nbeing executed due to a timeout.\n\nA fix or workaround for this whould be highly appreciated.\n", "id": 112433, "time": "2008-01-02T02:29:38Z", "bug_id": 35634, "creation_time": "2008-01-02T02:29:38Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "I think this has been fixed as a side effect of fixing bug 39946.\n\nIn either case, svn revision 728058 contains testcases for this and they path with trunk as well as Ant 1.7.1.", "attachment_id": null, "bug_id": 35634, "id": 123426, "time": "2008-12-19T08:07:05Z", "creator": "bodewig@apache.org", "creation_time": "2008-12-19T08:07:05Z", "is_private": false}]