[{"count": 0, "tags": [], "creator": "apinstein@mac.com", "text": "During a recent install of awstats there was a config problem which manifested itself via this error \nmessage:\n\nPermission denied: /opt/showcase/awstats/.htaccess pcfg_openfile: unable to check htaccess file, \nensure it is readable\n\nThe error message is a little misleading, as it implies that .htaccess exists and is not readable. There is \nno .htaccess file in that location. However, /opt/showcase/awstats was chmod 700 and thus httpd \ncouldn't CHECK to see if the .htaccess file was there.\n\nThe error message would be more helpful if it said:\n\nPermission denied: <path> pcfg_openfile: unable to check for existence of htaccess file or read it if it \ndoes exist; make sure <path> is readable by httpd.\n\nSomething along those lines. Since the message implied that .htaccess existed, it really threw me for a \nloop trying to figure out the problem.", "id": 77083, "time": "2005-07-07T19:46:43Z", "bug_id": 35652, "creation_time": "2005-07-07T19:46:43Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 35652, "text": "Well, it is not readable if the containing directory is not readable; the error\nis not inaccurate per se, I don't think the more verbose error message is much\nbetter.  \n\nThe 2.1 FAQ has a section on EPERM errors which might help:\nhttp://httpd.apache.org/docs/2.1/faq/error.html", "id": 79548, "attachment_id": null, "creator": "jorton@redhat.com", "creation_time": "2005-09-07T17:15:51Z", "time": "2005-09-07T17:15:51Z", "is_private": false}, {"count": 2, "tags": [], "creator": "apinstein@mac.com", "attachment_id": null, "id": 79559, "time": "2005-09-07T17:44:05Z", "bug_id": 35652, "creation_time": "2005-09-07T17:44:05Z", "is_private": false, "text": "Hmm. While I agree that the data in the FAQ entry would've probably helped me solve the problem \nfaster, the actual error I got did not suceed in leading me to that FAQ entry, so that's kindof a moot \npoint.\n\nAlso, simply check out this google query:\nhttp://www.google.com/search?client=safari&rls=en-us&q=%22unable+to+check+htaccess+file,\n+ensure+it+is+readable%22+awstats&ie=UTF-8&oe=UTF-8\n\nto see how many people are having this same problem. I don't think it's unusually stupid of me to have \nhad so much trouble tracking it down, even if it is something that'd be obvious to an expert.\n\nIt makes perfect sense to check perms along the path if an EXISTING file cannot be read. However, it \ndoesn't really make sense that a NON-EXISTING FILE cannot be read due to permissions. That's why the \nerror message is confusing. \n\nWhile I certainly understand not wanting to get more granular with the error messages (because it'd \ntake more code and performance to supply the more granular info), is there a good reason not to \ninlcude a link to the FAQ entry in the error message? Or to put some more text in the error message to \nremind people of what to check in case of permission denied?\n\nThe simple fact that the answer to this question lies in an FAQ IMHO is ample evidence to support the \nimprovement of the error message! If the error message were better, the FAQ entry would not be \nnecessary..."}, {"count": 3, "text": "The message is a bit longer now in trunk\n\n[Sat Aug 06 19:34:20.087359 2011] [core:crit] [pid 17061:tid 2860051312] (13)Permission denied: [client 127.0.0.1:45326] /tmp/a/.htaccess pcfg_openfile: unable to check htaccess file, ensure it is readable and that '/tmp/a/' is executable.", "bug_id": 35652, "is_private": false, "id": 148444, "time": "2011-08-06T23:36:02Z", "creator": "covener@gmail.com", "creation_time": "2011-08-06T23:36:02Z", "tags": [], "attachment_id": null}]