[{"count": 0, "tags": [], "creator": "tu.nguyen@bil.konicaminolta.us", "text": "NT service will not start if the installation path contains unicode path name\n\nSteps 1:\nDownload JDK 1.4.1_02 and install it.\nStep 2:\nSet JAVA_HOME=[MY JDK PATH]\nStep 3:\nInstall jakarta-tomcat-4.1.27.exe \nInstall path chosen : C:\\Program Files\\ƒT\u0081[ƒrƒX\\Tomcat4\n(suppose this path contains some Japanese characters)\nSelect NT Service option\nStep 4:\nInstallation completed but Tomcat service won't start\nStep 5:\nTry to start the service manually by clicking on Start from the properties of \nthe service.\nStep 6:\nView the logs file from the window viewers.log and see and error \nmessage \"Could not create a FileOutputStream for System.out redirect\".", "id": 77132, "time": "2005-07-08T23:51:41Z", "bug_id": 35666, "creation_time": "2005-07-08T23:51:41Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 35666, "is_private": false, "id": 77410, "time": "2005-07-19T00:34:05Z", "creator": "markt@apache.org", "creation_time": "2005-07-19T00:34:05Z", "tags": [], "text": "This is a \"feature\" of the third-party tool use to wrap Tomcat as a Windows Service.\n\nTomcat runs from the command prompt quite happily with unicode characters in the\ninstallation path.\n\nThe service wrapper used by Tomcat 4.1.x (JavaService) has changed licence\nmodels which makes it impossible to ship the latest versions. Currently 1.2.0 is\nused and versions up to 1.2.3 are available under the old licence but nothing in\nthe release notes suggests that this issue has been fixed in those verisons (or\nin fact any later version).\n\nYou have several options:\n- get the latest JavaService and see if it has been fixed\n- if not, file a bug against JavaService and once fixed, use the new version\n- don't use unicode characters in your install path\n- use one of the many alternative service wrappers - Tomcat 5 uses Jakarta\nCommons Daemon and a Google search will find some more\n\nI am marking this as INVALID since the bug is in JavaService rather than Tomcat."}]