[{"attachment_id": null, "tags": [], "bug_id": 35678, "text": "Often in a Java project, one needs to separate the java sources of a package \ninto different sub-directories to reflect some functional association.  All \nthe java sources are still part of the same package but they reside in \ndifferent sub-directories (or ultimately some other directory).  I find myself \nin this situation often when the number of java sources in a package grows, it \nis desirable to separate the sources of a package into sub-directories while \nkeeping the same package.  By keeping the same package one avoids multiple \nimport statements.\n\nJava does not prevent this sort of configuration.  I find that the problem is \nANT itself.   ANT forces the java source directory to be the same as the \npackage directory.  This is obviously not always the case.\n\nI suggest allowing the user to have different source directory and package \ndirectory for certain source files.   This would be an additional feature used \nonly in special cases.", "count": 0, "id": 77147, "time": "2005-07-10T09:19:43Z", "creator": "cp1965@ROGERS.com", "creation_time": "2005-07-10T09:19:43Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 35678, "is_private": false, "count": 1, "id": 77148, "time": "2005-07-10T11:41:29Z", "creator": "jkf@apache.org", "creation_time": "2005-07-10T11:41:29Z", "text": "Why not use different packages for different functional associations? When a\ngood interface is defined on the different packages the number of import\nstatements per class should be low.\n\nby the way, this is already possible, both with dislocated files (dislocated\nfiles are always compiled though) and with multiple source directories (by using\n<src ...> elements instead of the srcdir attribute.\n"}, {"count": 2, "tags": [], "bug_id": 35678, "attachment_id": null, "text": "I concur with Martin; I have never had a problem compiling source files from\nmultiple directories.", "id": 77149, "time": "2005-07-10T13:23:45Z", "creator": "carej@us.ibm.com", "creation_time": "2005-07-10T13:23:45Z", "is_private": false}, {"count": 3, "attachment_id": null, "creator": "peterreilly@apache.org", "text": "See manual.\n   <javac srcdir=\"${src}:${src2}\"\n         destdir=\"${build}\"\n         includes=\"mypackage/p1/**,mypackage/p2/**\"\n         excludes=\"mypackage/p1/testpackage/**\"\n         classpath=\"xyz.jar\"\n         debug=\"on\"\n  />\nIf however you want files with a package x.y.x *not* to\nbe in a directory <src2>/x/y/z, then Ant will not support\nit as it will not be possible to figure out when\nthe files need to be compiled without parsing the source\nfile.\n", "id": 77175, "time": "2005-07-11T11:14:47Z", "bug_id": 35678, "creation_time": "2005-07-11T11:14:47Z", "tags": [], "is_private": false}]