[{"attachment_id": null, "tags": [], "creator": "shliang@middleware.com.cn", "is_private": false, "count": 0, "id": 77460, "time": "2005-07-20T11:37:59Z", "bug_id": 35801, "creation_time": "2005-07-20T11:37:59Z", "text": "Sometimes ANT can't replace the file on Windows 2000 Server.\nI write a program that invokes class Replace(which is used for ant task\n'Replace') to replace some string in a file, this program works well on Fedora3,\nbut can't work correctly on Windows. \nWhen the program runs on windows, it often says that it is failure to delete the\n targeted file. But sometime it works rightly and says nothing."}, {"count": 1, "tags": [], "creator": "conor@apache.org", "text": "Unlike Unix, Windows will not let you delete a file which is \"in use\" by another\nprocess. I guess that is what is happening here. In fact the process in question\nmay even be Ant's JVM. This is not really an Ant bug. \n\nI suggest you use the handle tool from SysInternals\n(http://www.sysinternals.com/Utilities/Handle.html) to see what process has\nlocked your file. ", "id": 77461, "time": "2005-07-20T12:48:50Z", "bug_id": 35801, "creation_time": "2005-07-20T12:48:50Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "shliang@middleware.com.cn", "is_private": false, "count": 2, "id": 77530, "time": "2005-07-22T05:23:48Z", "bug_id": 35801, "creation_time": "2005-07-22T05:23:48Z", "text": "I don't think so. As I know, Replace call FileUtils.rename() to rename the file.\nThe problem is in the rename() method. Sometimes it can't delete the files\ncorrectly, but if I use class Delete & Move to do the same thing -- renaming the\nfile, it works well under Windows. After reading the implement of class Delete\nand method FileUtils.rename(), I found the class Delete have a complex and\nuseful implementation of deleting mechanism that can delete the file correctly\nunder windows, and the implementation of FileUtils.rename() is too simple to\nhandle the situation under Windows. I suggest to use the deleting mechanism of\nclass Delete(is also a task) rewrite the implementation of FileUtils.rename()."}]