[{"attachment_id": null, "tags": [], "bug_id": 35842, "is_private": false, "count": 0, "id": 77607, "time": "2005-07-24T22:15:05Z", "creator": "Minto@MultiMach.com", "creation_time": "2005-07-24T22:15:05Z", "text": "Hi,\n\nWhen extracting the download file (tar.gz) I get a trailing null block and a\nfailure code from tar. In itself this would not be to bad. But I use these\ndownloads in an automated process that fails if extracting tar archives fail.\n\nThis actually is a problem with a lot of the Apache downloads.\n\nkind regards"}, {"count": 1, "tags": [], "bug_id": 35842, "attachment_id": null, "text": "What operating system, version of tar, and command-line are you using to\ntrigger the error?  If you've encountered this problem with a lot of Apache\npackages, then either:\n  1. the problem lies with the version of tar you're using and can be remedied\n     by switching to a different version (e.g., GNU tar 1.15.1)\n  2. the problem lies with the Ant tar task, in which case you should refile\n     this issue with the Apache Ant project.\n\nI've never encountered the problem, but--for other reasons--in my\npersonal projects, I have taken to using:\n    <exec executable=\"tar\" dir=\"${top.dir}\">\n      <arg line=\"zcf ${tarball.bin} ${project.name}\"/>\n    </exec>\ninstead of the Ant tar and gzip tasks.  However, jakarta-oro uses\nthe Ant tar and gzip tasks, and it's entirely possiible the problem\nmay lie there.", "id": 77608, "time": "2005-07-24T23:10:52Z", "creator": "dfs@apache.org", "creation_time": "2005-07-24T23:10:52Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 35842, "text": "For what it's worth, I tried the following:\n\nif /bin/tar xf ~/jakarta-oro-2.0.8.tar; then\n  echo SUCCESS;\nelse\n  echo FAILURE;\nfi\n\nwith a now ancient BSD-derived version of tar on NEXTSTEP 3.3 m68k with the\nfollowing identifying information in the binary:\n\n@(#)PROGRAM:tar  PROJECT:sgcmds-56  DEVELOPER:root  BUILT:Wed Oct 19 04:46:45\nWET 1994\n@(#) Copyright (c) 1980 Regents of the University of California.  All rights\nreserved.\n\nand the result was SUCCESS.  Historically, the NEXTSTEP version of tar tended\nto have many problems with tar files generated by other flavors tar.\nTherefore, if there's no issue with that tar, it's a good bet the problem\nisn't the archiving format.\n\nIf you are uncompressing the archive first before untarring it (as\nopposed to using tar zxf as supported by GNU tar), tar may not be\nthe problem at all.  In some environments, creating a file from\nSTDOUT like\n  gunzip -c foo.tar.gz > foo.tar\nwill add an additional null to mark EOF.  If you're doing something\nlike that, try not using STDOUT redirection.  Alternatively, use\nthe zip archive.\n\nRegardless, I don't believe this is really a jakarta-oro issue and\nwill eventually mark the issue as Resolved: INVALID unless it turns\nout the problem is Ant tar or gzip task issue and the issue is refiled.", "id": 77609, "time": "2005-07-24T23:35:28Z", "creator": "dfs@apache.org", "creation_time": "2005-07-24T23:35:28Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 35842, "is_private": false, "count": 3, "id": 77883, "time": "2005-07-31T23:49:03Z", "creator": "dfs@apache.org", "creation_time": "2005-07-31T23:49:03Z", "text": "Resolving as WORKSFORME because the issue is not reproducible and there is\ninsufficient information to determine if the user's version of tar is\ncausing the problem or the ant tar task.  In either case, it's not really\nan oro issue."}]