[{"count": 0, "tags": [], "bug_id": 35852, "attachment_id": null, "text": "I have come up with some changes to be made which will more than double the\nspeed of the StarTeam checkout task.  I have tested them and our company has\nbeen using these changes currently for the last 4 weeks now with complete success.\n\nThe current stcheckout task takes about 4 units of time for every single file\nchecked out.  The value of these units of time depends on your StarTeam server\nsetup (for us here, each unit of time is 1 second).  For every single file\nchecked out, the following occurs: \n\n1) (one unit of time) - Fetch the encoding property for the file\n\n2) (two units of time) - Perform the checkout\n\n3) (one unit of time) - Update the local cache with the files new status\n\nBoth steps 1 and 3 can be removed safely.\n\nAn unforced checkout is used by developers on their local machines in order to\nmake sure they have the latest code that has been checked in by any other team\nmembers.  It will only checkout the files whose status is OUTOFDATE or MISSING.\n However any files whose status is reported as MODIFIED or MERGE or UNKNOWN will\nnot be checked out as this could overwrite local work that has been done on the\nfiles.  Also, files with the CURRENT status will not be checked out as the local\nversion is an exact copy of what's in the server (so re-checking out an exact\ncopy of what you already have is silly and a huge waste of time).\n\nA forced checkout is used by automated scripts on build machines and servers in\norder to sync the local folder with what is on the server.\nTherefore files are checked out regardless of their status.  The problem is that\neven files with the Status CURRENT are checked out.  In a continuous build\nscenario using forced checkouts, 90% or more of the time spent to checkout a\nproject is wasted on re-checking out files that are already CURRENT.", "id": 77629, "time": "2005-07-25T19:18:26Z", "creator": "BBurgess@tiaa-cref.org", "creation_time": "2005-07-25T19:18:26Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 35852, "attachment_id": 15768, "text": "Created attachment 15768\nFixes unnecessary retrieval of file encoding property", "id": 77632, "time": "2005-07-25T19:24:08Z", "creator": "BBurgess@tiaa-cref.org", "creation_time": "2005-07-25T19:24:08Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 35852, "attachment_id": 15769, "text": "Created attachment 15769\nFixes unnecessary status update and checkout of CURRENTs", "id": 77633, "time": "2005-07-25T19:24:36Z", "creator": "BBurgess@tiaa-cref.org", "creation_time": "2005-07-25T19:24:36Z", "is_private": false}, {"count": 3, "tags": [], "creator": "BBurgess@tiaa-cref.org", "attachment_id": null, "id": 77635, "time": "2005-07-25T19:24:51Z", "bug_id": 35852, "creation_time": "2005-07-25T19:24:51Z", "is_private": false, "text": "*** Bug 35295 has been marked as a duplicate of this bug. ***"}, {"count": 4, "tags": [], "bug_id": 35852, "attachment_id": null, "text": "*** Bug 14208 has been marked as a duplicate of this bug. ***", "id": 80859, "time": "2005-10-06T19:44:54Z", "creator": "BBurgess@tiaa-cref.org", "creation_time": "2005-10-06T19:44:54Z", "is_private": false}, {"count": 5, "tags": [], "creator": "BBurgess@tiaa-cref.org", "attachment_id": null, "text": "While minor code changes, these patches make a very large and noticable boost in\nperformance of the StarTeam checkout task.  They have now been in use at my\ncompany for 6 months with no problems.  I would like to see these commited\nbefore Ant 1.7 is released.\n\nSteve Cohen used to be the major contributor when it came to StarTeam, but now\nthat he no longer uses StarTeam at his work, he has not done so in a while.  I\nhave been writing StarTeam SDK code for over a year now and have had significant\nStarTeam SDK code patches commited at other open source tools such as\nCruiseControl.  Please feel free to contact me with questions.", "id": 84312, "time": "2006-01-06T22:00:33Z", "bug_id": 35852, "creation_time": "2006-01-06T22:00:33Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 35852, "attachment_id": null, "id": 84327, "time": "2006-01-07T21:18:20Z", "creator": "jkf@apache.org", "creation_time": "2006-01-07T21:18:20Z", "is_private": false, "text": "I have committed your changes, thanks, \n\nAs I am not able to verify your changes, you are kindly requested to do so by\ncompiling the svn version of ant, and verify that the changes applied do fix the\ndescribed performance improvements, and that the changes applied do not change\nthe behaviour of ant on starteam. (and that I didn't do anything very stupid,\nmaking it impossible to compile starteam)\n\nPlease resolve this bug to fixed after verifying."}, {"count": 7, "tags": [], "creator": "BBurgess@tiaa-cref.org", "attachment_id": null, "text": "I downloaded a nightly distribution of source from here\nhttp://cvs.apache.org/snapshots/ant/ant_20060108173757.tar.gz then compiled\nsuccessfully and ran a handful of various types of StarTeam scripts.  All worked\nas expected (in fact it was even faster than my 1.6.5 distro with the same\npatches applied).", "id": 84374, "time": "2006-01-09T16:14:53Z", "bug_id": 35852, "creation_time": "2006-01-09T16:14:53Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 35852, "attachment_id": null, "text": "Thanks", "id": 84405, "time": "2006-01-09T19:25:57Z", "creator": "jkf@apache.org", "creation_time": "2006-01-09T19:25:57Z", "is_private": false}]