[{"count": 0, "tags": [], "bug_id": 35871, "attachment_id": null, "id": 77671, "time": "2005-07-26T19:01:21Z", "creator": "surfer97301@yahoo.com", "creation_time": "2005-07-26T19:01:21Z", "is_private": false, "text": "I use the java api for ant quite frequently and usually I guess the java names\nof the classes by looking at the documentation for the xml interface.  In the\ncase of unjar it took me a while to figure out that the proper class was expand.\n In order to do that I had to debug ant and jump into the code.  If the\nunjar/untar/unear/unwar ant xml page mentioned that they are all just aliases to\nthe expand task then it would have made things a fair bit easier.  I think this\nis even valuable for the xml interface."}, {"count": 1, "tags": [], "bug_id": 35871, "attachment_id": null, "text": "Why would the typical Ant user care about class name that is backing the task\nimplementation?\n\nRegardless, you can readily find these mappings in the defaults.properties file\nin the org.apache.tools.ant.taskdefs package; marking as fixed-worksforme.", "id": 77681, "time": "2005-07-26T22:20:58Z", "creator": "carej@us.ibm.com", "creation_time": "2005-07-26T22:20:58Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 35871, "attachment_id": null, "id": 78130, "time": "2005-08-04T22:46:12Z", "creator": "surfer97301@yahoo.com", "creation_time": "2005-08-04T22:46:12Z", "is_private": false, "text": "Typical ant user would care because instead of using different tasks which all\nalias to the same one they could just use the expand task.  Actually makes your\nxml a lot simpler and easier to search and modify all expand tasks when you find\nyou need to change the duplicate behavior to prevent duplicates.  A quick little\nsentence about these tasks just aliasing to expand would be nice."}, {"count": 3, "tags": [], "bug_id": 35871, "attachment_id": null, "is_private": false, "id": 78131, "time": "2005-08-04T23:20:39Z", "creator": "carej@us.ibm.com", "creation_time": "2005-08-04T23:20:39Z", "text": "Unless it was added post-1.6.2, there is no \"expand\" task. There is a task class\ncalled oata.taskdefs.Expand that is the backing implementation class for unzip,\nunjar, untar & unwar, but this \"expand\" task of which you speak does not exist.\n\nBesides which, the manual already makes it pretty clear that unzip, unjar, untar\n& unwar are all the same."}]