[{"count": 0, "tags": [], "bug_id": 35922, "text": "We are using Batik 1.6. Our Java application GUI uses mutliple JSVGCanvas \ncomponents to render various SVG's to help our users. Depending on the panel \nthat is being displayed, about 2-8 JSVGCanvas components are displayed. During \nthe display of these SVG's we are seeing some of the SVGs render offset from \nthe upper left hand corner. In some cases resizing the panel that the SVG is in \ncauses the SVG to render properly. Other times no amount of resizing/repainting \nwill cause the SVG to display properly. It's almost like the SVG canvas is \ncaching bad coordinates and doesn't release them, even on the resize. We can \nreproduce this problem consistently with our application but do have test \nprogram.\n\nWe have spordically seen a similiar or maybe the same problem where the SVG \ndoes not appear to render on the JSVGCanvas. Not sure if the image is rendering \nbut outside the viewport of the panel so that it does not display at all.\n\nOur temporary workaround, is to first display a 'loading' SVG and then display \nthe real SVG in the canvas. This seems to always work but it's not very \nefficient. \n\nOur application instaniates the JSVGCanvas, does a setURI(..), and then adds \nthe panel to a parent panel that is then displayed. This takes place multiple \ntimes depending on the number of SVG's being displayed.", "id": 77800, "attachment_id": null, "creator": "dvanwate@mail.donaldson.com", "creation_time": "2005-07-28T21:28:30Z", "time": "2005-07-28T21:28:30Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 35922, "attachment_id": null, "text": "I suspect the base of the problem is that you set the URI before\nyou add it to the SWING hierarchy.  Before the component is part\nof the Swing tree it has no size so Batik has to make one up this\nthen changes at some point when you add it to the SWING tree.\n\nAlso do you make sure to do all this instantiation from the Swing\nthread?", "id": 78039, "time": "2005-08-04T01:15:33Z", "creator": "deweese@apache.org", "creation_time": "2005-08-04T01:15:33Z", "is_private": false}, {"count": 2, "tags": [], "creator": "dvanwate@mail.donaldson.com", "text": "Yes, we are setting the URI before the viewer is added to the Swing hierarchy. \nYes, all of our instantiation is from the Swing thread. \n\nWe are using the JSVGCanvas like an image viewer panel but instead of \ndisplaying JPEGs we display SVGs which can be zoomed(an important advantage). A \nsingle panel may contain 3 or 4 SVGs which it knows it wants to display so it \ndoes the setGraphicURI using constants, that do not change, and which we would \nlike to set once and in most cases be done with it. \n\nIt makes sense that Batik would make up a size to start with and then change \nthe SVG size when a resize event occurs. It seems that the heart of the problem \nis that when resizing does occur Batik displays the SVG offset, which is wrong. \nIn some cases, no amount of resizing will cause Batik to display properly. \n\nGiven our usage, shouldn’t resize events cause Batik to display properly?\n", "id": 78124, "time": "2005-08-04T18:25:08Z", "bug_id": 35922, "creation_time": "2005-08-04T18:25:08Z", "is_private": false, "attachment_id": null}]