[{"attachment_id": null, "tags": [], "bug_id": 35965, "is_private": false, "count": 0, "id": 77916, "time": "2005-08-01T20:38:40Z", "creator": "john@rimell.cc", "creation_time": "2005-08-01T20:38:40Z", "text": "I'm wanting to extend the JMSAppender to reuse the JMS code (I can just pass in\nthe required connection info), however, I can't use the append method as it\nstands (I need it to publish TextMessage's not ObjectMessage's). I wanted to be\nable to simply override the append method, but the internal properties\n(topicConnection, topicSession etc) are not accessible. They should be\n\"protected\" to allow extended classes to have access to them."}, {"attachment_id": null, "tags": [], "bug_id": 35965, "is_private": false, "count": 1, "id": 77920, "time": "2005-08-01T22:59:18Z", "creator": "mwomack@apache.org", "creation_time": "2005-08-01T22:59:18Z", "text": "1.2.12 candidate"}, {"count": 2, "tags": [], "bug_id": 35965, "attachment_id": null, "id": 77922, "time": "2005-08-02T00:11:25Z", "creator": "carnold@apache.org", "creation_time": "2005-08-02T00:11:25Z", "is_private": false, "text": "I'd be okay with adding accessors, but protected variables are problematic and we shouldn't be adding to \nthe ones that we already have.  Do you think you need mutators too?"}, {"count": 3, "tags": [], "bug_id": 35965, "text": "Actually, in this case I think that protected member variables are a better \nsolution.  Opening these members to be accessed via getter methods will also \nopen them up to being manipulated by other entities besides subclasses of \nJMSAppender.  Any class could access the getter methods and then use the \nreturned object to do whatever it wants.  It implies a contract with the \noutside world that it is ok to get and manipulate these member variables, which \nit isn't.  Whereas if they are just changed to protected, only subclasses can \nscrew things up, but we expect them to be a bit more knowleable.", "id": 77926, "time": "2005-08-02T05:51:43Z", "creator": "mwomack@apache.org", "creation_time": "2005-08-02T05:51:43Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "mwomack@apache.org", "text": "Doh.  Of course, protected accessor/mutator methods would solve what I was just \ntalking about.  Sorry, I have been working just plain old bean objects now for \ntoo long, obviously.  I would only add the accessor ones and not mutators.", "count": 4, "id": 77927, "time": "2005-08-02T08:26:02Z", "bug_id": 35965, "creation_time": "2005-08-02T08:26:02Z", "is_private": false}, {"count": 5, "tags": [], "creator": "mwomack@apache.org", "attachment_id": null, "text": "Added protected accessors for the JMS member variables.  Subclasses should be \nable to use these to get at the values need to override other methods to change \nbehavior.", "id": 77981, "time": "2005-08-03T07:06:19Z", "bug_id": 35965, "creation_time": "2005-08-03T07:06:19Z", "is_private": false}]