[{"count": 0, "tags": [], "text": "There appears to be no way (cms gui) to restrict access to a section of the live\narea of a site.  \n\nThe InheritingPolicyManager (FilePolicyManager) steps through the request url\nand adds up all the policies (inclusive).  This works out great for the\nauthoring area, but is fairly useless for the live area (as far as I understand).\n\nThis patch to FilePolicyManager just uses the first ancestor-or-self policy for\nthe requested document (instead of all the policies belonging to the document\nand it's ancestor nodes) when the request is for a live document.", "attachment_id": null, "bug_id": 35985, "id": 77975, "time": "2005-08-02T22:53:01Z", "creator": "dhc4z@virginia.edu", "creation_time": "2005-08-02T22:53:01Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 15858\nuse closest ancestor-or-self policy", "attachment_id": 15858, "bug_id": 35985, "id": 77976, "time": "2005-08-02T22:54:21Z", "creator": "dhc4z@virginia.edu", "creation_time": "2005-08-02T22:54:21Z", "is_private": false}, {"count": 2, "tags": [], "text": "This is a compilation of my posts about security to the MLs.  They started with\na complaint that Lenya's specifications are not being met.  This line is from\nLenya's homepage:\n\"The access control allows you to restrict access to parts of your site to\nmembers of a group or individuals.\"\n\nThat line was there when I downloaded Lenya 1.2.2, and is still there today.  I\ndid much work to make it true for my project, including rewriting how Search\nresults are generated.  The default pub grants access to \"world\" for the\nhomepage, and all other pages inherit that access, so \"restricting access to\nparts of your site\" is difficult.\n\nMy project handles security in XSL, but XSL should be for formatting, not\nfunctionality.  My workaround has an \"awareness\" security flaw: an unauthorized\npage returns different results than a nonexistent page.  The message in both\ncases should be:\n\"The page requested could not be found, or you are not allowed to access it. \nYou may need to login.\"\n\nThis could be handled in a Sitemap with something like auth-protect, but that is\nwhere application functionality is defined; a Usecase sitemap should not bypass\nthe security because the author forgot to copy some code.  I think it needs to\nbe built into the File Generator.  That might be a Virtual Component (if they\nexist), but hardcoding into the Java would be best.\n\nOn 6/24/05, Andreas Hartmann <andreas@apache.org> wrote:\nMaybe it could even be added in the repository layer, or at least in the\nRepositorySource (lenya:// protocol). Then it wouldn't be restricted to\ngeneration, but it would also apply to all other operations on a document.\n[END Andreas' input]\n\nGreat!\n1. The protocol gets request for a file.\n2. Checks if document exists.\n3. Checks if security exists for file.\n4. Checks if security passes for file.\n5. Checks if language exists.\n- language-version-does-not-exist flag:  (document-level, but falls up path to\npublication flag)\nE = Standard error\nD = Fallback to default language (Standard error if it does not exist.)\nC = Show language choice page (nolang.xml explained below.)\n6. If any check fails, return publication error message.  If publication does\nnot have error message, use global error message.\n\nIf this is implemented, we can remove these from the Pipelines:\n- language-exists Action\n- document-does-not-exist Exception\nbecause it would be impossible to create them.  Sitemaps become slightly\nsimpler; productivity increases (less code!)\n\nWhere is the security config?  In every document? In sitetree.xml?  Or in a new\nfile?\n\nWhere are the error messages?  An errors directory under config or content?\n- error.xml (Standard Error for NotFound, NoLanguageVersion, and NotAuthorized)\n- anonerr.xml (Standard Error suggesting login, fallback to error.xml)\n- nolang.xml (\"<i18n>The requested document is available for these\nlanguages</i18n>: de, us, xx.\")\n\n[Referring to search results using my Search which has been integrated with\nLenya1.2.4.]\nSecurity should read from a configuration file.  It is easy to add reading a\nfile to search-and-results.xsp, but that configuration file should also be used\nfor preventing protected pages from displaying, and removing items from the menus.", "is_private": false, "id": 77984, "creator": "solprovider@gmail.com", "time": "2005-08-03T08:27:53Z", "bug_id": 35985, "creation_time": "2005-08-03T08:27:53Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "dhc4z@virginia.edu", "attachment_id": 15893, "is_private": false, "id": 78132, "time": "2005-08-04T23:40:11Z", "bug_id": 35985, "creation_time": "2005-08-04T23:40:11Z", "text": "Created attachment 15893\nuse closest ancestor-or-self policy take 2\n\nWith this mod to FilePolicyManager you can use the AC Live tab to restrict\naccess to a page or group of pages in the live area.  I had to clean a few\nthings up from the first patch."}, {"count": 4, "tags": [], "creator": "dhc4z@virginia.edu", "attachment_id": null, "is_private": false, "id": 79005, "time": "2005-08-25T17:12:51Z", "bug_id": 35985, "creation_time": "2005-08-25T17:12:51Z", "text": "applied patch"}]