[{"count": 0, "tags": [], "creator": "dhananjay.bhandari@bea.com", "attachment_id": null, "id": 5522, "time": "2001-09-14T01:12:44Z", "bug_id": 3601, "creation_time": "2001-09-14T01:12:44Z", "is_private": false, "text": "Hi,\n   I downloaded Xerces-J-src.1.4.3.zip from http://xml.apache.org/dist/xerces-\nj/ site.\n   I am trying to compile this xerces. But, I dont want to use any of the \nmakefiles that come with source code. I have my own make scripts, in thode I \ncollect names of all the java files in the xerces hierarchy and then run sj on \neach of those. I am using sj version 3.00.042.\n   I noticed a weird thing abt the compilation of \napache/xerces/validators/schema/TraverseSchema.java file. sj just aborts if I \ntry to compile this file. \n   When i took a look at this file, I found that this file is very big (9000 + \nlines) and it has nested class definitions.\n   is it possible to simplify the this file, or even if it is not, then at \nleast some kind of workaround.\n\nThanks,\nDhananjay."}, {"count": 1, "tags": [], "text": "I don't think this has anything to do with Java/Xerces. Maybe some problem in\nyour thode script. All the source files of xerces-j compile perfectly well. Ya,\nTraverseSchema is indeed a very big file but, it compiles right.\n\nIn the new design of xerces2, this file is broken into several small traverses.\nMaybe your thode scriot works now with this. But, this does not seems to be a\nBUG in xerces.", "is_private": false, "id": 6155, "creator": "rahul.srivastava@sun.com", "time": "2001-09-28T01:51:34Z", "bug_id": 3601, "creation_time": "2001-09-28T01:51:34Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 3601, "attachment_id": null, "id": 6185, "time": "2001-09-28T16:34:09Z", "creator": "dhananjay.bhandari@bea.com", "creation_time": "2001-09-28T16:34:09Z", "is_private": false, "text": "\nI am not using any script to compile the code. It is simple sj cpmmand that i \nam using, and I could reproduce the behaviour with different machines.\nTo reproduce it :\n 1. Remove all the classes from the build dir.\n 2. Remove the reference of xerces.jar file in the classpath, if at all it is \npresent.\n 3. AMek sure that you have sj 3.00.042 verison.\n 4. Use the ant script with \n    build.compiler set to \"Semantic\" or sj class wrapper.\n\n Since, you have also mentioned that in the new design of xerces 2, the \ntraverseschema.java file is split. Which version is that, and is that version \nproduct ready. Meaning, Can I use that release as a production-ready release.\n"}]