[{"count": 0, "tags": [], "creator": "account.consult-smi@airbus.fr", "text": "webdav works only for certain security configurations.\n\nAs webdav clients I use IE5 or IE5.5 or FileExplorer; all on a win2000 OS.\nI can always see the directory tree and the files and read-operations work fine \nas well. However, depending on the security configuration of the webdav webapp, \nsome features of webdav fail.\n\nIf the webdav-webapp is configured to allow http and to have no authentication, \nthen everything seems to work fine.\n\nIf the webdav-webapp is configured to inforce(!) HTTPS access by specifing a \ntransport guarantee of \"CONFIDENTIAL\", then I cannot RENAME files and I cannot \ncopy a file from the client to the server, overwriting a file there. However, \ncopying a file to the server, which is not already there, works fine. File \nDeletion works as well. Directories can be queried, files can be read.\n\nIf the webdav-webapp is configured to inforce(!) HTTPS access by specifing a \ntransport guarantee of \"CONFIDENTIAL\" and is furthermore configured to have a \nCLIENT-CERT authentication, then copying files to the server doesn't work at \nall. Renaming also doesn't work. Directories can be queried, files can be read.\n\n(I have set the read-only attribute in the webdav web.xml to \"false\".)", "id": 5542, "time": "2001-09-14T07:27:52Z", "bug_id": 3613, "creation_time": "2001-09-14T07:27:52Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "id": 5555, "time": "2001-09-14T09:56:14Z", "bug_id": 3613, "creation_time": "2001-09-14T09:56:14Z", "is_private": false, "text": "The problem should be fixed (\"http://\" was hardcoded when parsing the \ndestination header).\n\nThe last problem seems to be a problem with the authentication mechanism. \nThere's nothing in the PUT handling which would make it dependent on the \nprotocol used. I'd recommend testing again with this SSL fix and filing a new \nbug if there is a problem."}]