[{"count": 0, "text": "Here are the steps to reproduce the error, using Struts (though the issue is not\nstruts-specific):\n\n* Voice browser submits back to JSP 1 when input matches the grammar in the RDC.\n The RDC now has correct input, and an rdc:struts tag forwards to Struts action 1.\n\n* Struts action 1 does whatever it needs to in response to the input, then\nforwards to Struts action 2 for the next page/step.\n\n* Struts action 2 forwards to the JSP for step 2.\n\nExpected behavior:\n\nThe second JSP renders and the voice browser correctly interprets the second\npage and its RDC.  (Note, if the voice browser is pointed directly to page 2,\nthis page functions correctly).\n\nActual behavior:\n\nThe voice interpreter (one provided in IBM Voice Toolkit 6.0) complains that\n\"Msg   : The markup in the document following the root element must be well-formed.\"\n\nAdditional details (current workaround we are using):\n\nUsing redirects to transition between JSP pages fixes the symptoms.  In the\nabove example, if Struts action 1 redirects to Struts action 2 (so the voice\ninterpreter issues a new request for the next page) the symptoms disappear and\nthe application works properly.\n\nI believe this is due to JspWriter buffer flushing issues, where content from\nthe partial rendering of Jsp 1 is not properly cleared before the rendering of\nJsp 2.  Looking over the JSP 2.0 specification, section 5.5 (page 1-111) states\nthat when using jsp:forward, any buffered content must be flushed by the\ncontainer prior to forwarding the request.  I was not able to find a similar\nrequirement for the use of RequestDispatcher.forward, which is what\nrdc:struts-submit uses.\n\nI don't know if this is a bug in WebSphere 6.0, and error I am making, or if\nthis basic usage pattern in RDCs is not compatible with the specification.  I've\ncreated a simple example case to demonstrate the problem, and will try to attach\nit to this report.  It's 3.6 Megs, so if that's too big, I'll have to find some\nother way to submit it.", "bug_id": 36150, "attachment_id": null, "id": 78422, "time": "2005-08-11T21:47:03Z", "creator": "srobertson@nvisia.com", "creation_time": "2005-08-11T21:47:03Z", "tags": [], "is_private": false}, {"count": 1, "text": "I tried attaching a test case (RAD 6 project) but it is too large.  So I emailed\nthis to Rahul instead.  If we need it here, I could take out all of the jars,\nand it should be small enough at that point.", "bug_id": 36150, "is_private": false, "id": 78424, "time": "2005-08-11T22:02:58Z", "creator": "srobertson@nvisia.com", "creation_time": "2005-08-11T22:02:58Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 36150, "text": "Created attachment 16015\nRAD 6 projects demonstrating this issue.  To be run in WAS 6.0.2 test environment\n\nInside this zip there are two RAD 6 projects containing a simple test case\nshowing these symptoms.  1 Web project, and the EAR project required by\nWebSphere.  You should be able to load them into your workspace using File ->\nImport -> Existing Project into Workspace.  I've removed the jars from\nWEB-INF/lib to make the attachment small enough to submit.  There's an image in\nWEB-INF/lib showing what jars must be in the directory for the application to\nwork properly.\n\nThere are 2 simple Struts actions, FirstAction and SecondAction, and their JSPs\nare first.jsp and second.jsp.  If you point the voice interpreter to\n/first-action.do, you will be prompted for a single digit.  Upon entering 1\ndigit, the RDC will forward to first-action.do.  FirstAction will then forward\nto second-action.do, which forwards to second.jsp.\n\nIt is the rendering of second.jsp that fails for us.\n\nTo see how redirection changes the symptom, there is a flag in FirstAction\ncalled USE_REDIRECTS.  Setting this to true uses redirection to transition to\nthe next page.\tThis works for us, and is the way we transition between all of\nour pages as a workaround to this issue.", "id": 78426, "time": "2005-08-11T22:48:57Z", "creator": "srobertson@nvisia.com", "creation_time": "2005-08-11T22:48:57Z", "is_private": false, "attachment_id": 16015}, {"count": 3, "tags": [], "text": "Created attachment 16087\nCorrected version of first.jsp from earlier attachment", "attachment_id": 16087, "bug_id": 36150, "id": 78617, "time": "2005-08-18T08:57:05Z", "creator": "rahul@apache.org", "creation_time": "2005-08-18T08:57:05Z", "is_private": false}, {"count": 4, "tags": [], "creator": "rahul@apache.org", "attachment_id": null, "text": "Thanks for taking time to put together the simple test case.\n\nThe <rdc:struts-submit> tag should be used after the last bit of template text \nin the JSP (i.e. in this case, after </vxml> in first.jsp - I've attached a \ncorrected first.jsp to this ticket few minutes ago - and tried your test case \nsuccessfully on Tomcat 5.0.28 and WAS 6.0.2).\n\nI'll take responsibility for the lack of documentation, and add a note to the \nStrutsInterface tutorial on the wiki in a day or two, unless you beat me to it.\n", "id": 78618, "time": "2005-08-18T09:07:20Z", "bug_id": 36150, "creation_time": "2005-08-18T09:07:20Z", "is_private": false}]