[{"count": 0, "tags": [], "bug_id": 36166, "attachment_id": null, "text": "The documentation of the Redirect and RedirectMatch directives [1] reads, in part, like this:\n\nSyntax:\tRedirect [status] URL-path URL\n\nURL-path must be a fully qualified URL, not a relative path, even when used with .htaccess files or \ninside of <Directory> sections.\n\nI believe this should read \"URL must be a fully qualified URL\" since URL-path is certainly supposed to be \na path, and not fully-qualified, and none of the examples show URL-path to be fully-qualified. This \nerror appears in the 1.3, 2.0, and 2.1 documentation pages.\n\n[1] http://httpd.apache.org/docs/2.1/mod/mod_alias.html#redirectmatch", "id": 78448, "time": "2005-08-12T19:27:11Z", "creator": "apache-2011@ryandesign.com", "creation_time": "2005-08-12T19:27:11Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "slive@apache.org", "is_private": false, "count": 1, "id": 78514, "time": "2005-08-15T16:54:10Z", "bug_id": 36166, "creation_time": "2005-08-15T16:54:10Z", "text": "It does actually refer to the URL-Path, although the term \"fully qualified\" is\nprobably misleading.  It means that the path must start with a slash, and cannot\nbe relative to the directory containing the .htaccess file."}, {"attachment_id": null, "tags": [], "creator": "apache-2011@ryandesign.com", "is_private": false, "count": 2, "id": 78517, "time": "2005-08-15T17:30:33Z", "bug_id": 36166, "creation_time": "2005-08-15T17:30:33Z", "text": "Ah, I see... And what of \"URL\"? Must it be a full URL with protocol, or can it be a \"fully-qualified URL\" (i.e. \nstarting with a slash)? Could it be a relative URL? The examples only show full URLs with protocol, but the \ndocumentation does not seem to specify whether other forms are also permissible."}, {"count": 3, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "is_private": false, "id": 78522, "time": "2005-08-15T19:21:25Z", "bug_id": 36166, "creation_time": "2005-08-15T19:21:25Z", "text": "It is best practice to use a full URL starting with a scheme, although I believe\nthat recent versions will also take a URL-path and tag on the current server name.\n\nBut you are right that this all should be clarified.  Something along the lines\n<usage>\n<p>The Redirect directive maps an old URL into a new one by asking the client to\nrefetch the resource at the new location.</p>\n\n<p>The old <em>URL-path</em> is a (%-decoded) path beginning with a slash.  A\nrelative path is not allowed.  The new <em>URL</em> should be an absolute URL\nbeginning with a scheme, but a URL-path beginning with a slash may also be used,\nin which case the scheme and hostname of the current server will be added.</p>\n\n<p>Then any request beginning with <em>URL-Path</em> will return a redirect\nrequest to the client at the location of the target <em>URL</em>.  Additional\npath information beyond the matched <em>URL-Path</em> will be appended to the\ntarget URL.</p>\n\n..."}, {"count": 4, "tags": [], "bug_id": 36166, "attachment_id": null, "text": "Fixed in 2.1.", "id": 79080, "time": "2005-08-26T19:55:02Z", "creator": "slive@apache.org", "creation_time": "2005-08-26T19:55:02Z", "is_private": false}]