[{"count": 0, "tags": [], "bug_id": 36174, "is_private": false, "text": "Today, to use Ant with a proxy, you either have to use <setproxy> task or use\nthe ANT_OPTS with a long sequence of system properties.\n\nThe former is horrible, because a proxy setting is by nature different from a\nperson to person. Doing this as a task requires you to either hard-code a proxy\nname, or put the burden on the build script writer to externalize the property\ndefinitions, and ask users to configure them individually.\n\nANT_OPTS is little better, but the proxy string is very lengthy.\n\nIn both cases, the user who wishs to move between different network environments\n(such as between home and office) need to spend a lot of effort changing proxy\nsettings in many places.\n\n\nThis situation can be improved by using the system property\n\"java.net.useSystemProxies\", a new addition in JDK 5.0.\n\nWhen enabled, unless a proxy is configured specifically, URL class\nwill automatically consult the platform default proxy setting. On\nWindows, this is a connection setting of IE, and on Unix this is\na setting of Gnome.\n\nUnfortunately, this property is designed to read only once when\nthe proxy related code is initialized for the first time. So for\nthis to be usable, Ant has to set this property to true at the very\nbeginning, perhaps like this:\n\n-----------------------------------\ntry {\n    System.setProperty(\"java.net.useSystemProxies\",\"true\");\n} catch (SecurityException e) {\n    ; // failing to set this property isn't fatal\n}\n-----------------------------------\n\nIn earlier JVMs this takes no effect, which is a resonable behavior.\n\nPlease consider doing this in the future.", "id": 78463, "time": "2005-08-12T23:46:45Z", "creator": "kk@kohsuke.org", "creation_time": "2005-08-12T23:46:45Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 36174, "is_private": false, "text": "As the author of setproxy, I am somewhat disappointed by the use of \"horrible\"\nas an adjective. Unsatisfactory, would be more appropriate :) It does at least\nlet you write build files that use <isreachable> (ant1.7) to check for proxies\nbeing there before trying to connect to them, which is something that laptop\nusers will appreciate. \n\nReturning to the system property, yes, this does seem a good idea by default.\n\nBut\n\n-we need a way of turning it off, a --noproxy option. \n\n-I wonder what the effects of running Ant under an IDE will be. If it is only\nread at the start of the JVM URL classes, then by the time that it gets to Ant\nit is probably too late. does this mean that we shouldnt do it? No. I just dont\nwant to break the IDE itself by unexpectedly fidding with proxy settings.\n\nProposal\n-we turn this on in ant main\n-the --noproxy option will skip this. \n-we document proxy setup in ant properly; that is, how to use ANT_OPTS,  the\n--noproxy command and the java1.5 stuff\n-ant diagnostics adds proxy configuration diagnostics.\n\n", "id": 78508, "time": "2005-08-15T15:11:06Z", "creator": "stevel@apache.org", "creation_time": "2005-08-15T15:11:06Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "stevel@apache.org", "attachment_id": null, "is_private": false, "id": 78582, "time": "2005-08-17T16:01:27Z", "bug_id": 36174, "creation_time": "2005-08-17T16:01:27Z", "text": "Test CVS_HEAD to see if it works. \n\nThis does not seem to work on my java1.5.01 runtime on Linux...there may be gulf\nbetween what is intended and what is implemented. "}, {"count": 3, "attachment_id": null, "creator": "stevel@apache.org", "text": "see this bug here: http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=5092063\n\nit looks like Java1.5 proxy server handles laptops badly as it always tries to\ndo RDNS lookup, even when handed an ipaddr to connect to.\n\nwe may need to provide our own ProxySelector, one that assumes that whenever you\ngive an absolute IPAddress, that means you want to bypass the proxy.\n\n\n", "id": 78819, "time": "2005-08-22T16:29:53Z", "bug_id": 36174, "creation_time": "2005-08-22T16:29:53Z", "tags": [], "is_private": false}]