[{"count": 0, "tags": [], "creator": "ljanda@checkstop.com", "text": "The version 2 document indicates that a module can be statically linked, PHP \npeople tell me that version 2 does not support static modules. The document is \nvery confusing and limited, with no examples. \n\nShould have:\n1. how to link static\n2. how to link with the normal shared libs\n3. how to link using DSO.\n\nThe Apache HTTP Server is a modular program where the administrator can choose \nthe functionality to include in the server by selecting a set of modules. The \nmodules can be statically compiled into the httpd binary when the server is \nbuilt. Alternatively, modules can be compiled as Dynamic Shared Objects (DSOs) \nthat exist separately from the main httpd binary file. DSO modules may be \ncompiled at the time the server is built, or they may be compiled and added at \na later time using the Apache Extension Tool (apxs).", "id": 78581, "time": "2005-08-17T15:58:25Z", "bug_id": 36225, "creation_time": "2005-08-17T15:58:25Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "text": "\n  FYI,\n\n>  2. how to link with the normal shared libs\n>  3. how to link using DSO.\n\n  There is no difference between these two, a DSO *is* a normal shared lib.\n", "id": 78591, "time": "2005-08-17T17:57:43Z", "bug_id": 36225, "creation_time": "2005-08-17T17:57:43Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 78592, "time": "2005-08-17T18:05:49Z", "bug_id": 36225, "creation_time": "2005-08-17T18:05:49Z", "is_private": false, "text": "Although I agree that the documentation on adding third-party modules is not\nvery user-friendly, I don't see any specific suggestion to improve it here. \nThere certainly are examples under \"Usage Summary\".\n\nYour particular problem is with PHP, not apache httpd.  httpd 2.0 certainly does\nsupport static modules, but it may be that PHP has chosen not to support or\ndocument how to build PHP in that way.  For complex third-party modules, it is\nreally up to the module author to document the build process.  There are too\nmany variations to get them all in the apache docs.\n\nAdditional docs on building apache httpd are here:\nhttp://httpd.apache.org/docs/2.0/programs/configure.html"}]