[{"count": 0, "tags": [], "bug_id": 36285, "attachment_id": null, "is_private": false, "id": 78755, "time": "2005-08-20T20:49:35Z", "creator": "zaks@so.ct.edu", "creation_time": "2005-08-20T20:49:35Z", "text": "When attempting to write a modular test plan consisting of several logically\ngrouped samplers,files currently must be merged into an existing thread group as\na series of individual samplers.  This can lead to long, undifferentiated lists\nof samplers in more complex test scenarios, and make maintenance of test groups\ndifficult.  My request is to have a level of grouping available between 'Thread\ngroup' and 'Sampler' (say, 'Sampler Group').  You could merge a file into a\nsampler group and manage your test scenarios better.  If you linked a sampler\ngroup to a .jmx file, you would be able to move toward 'import'/#include type\nfunctionality.\n\nFor example -- you have twenty scenarios that all use the same authentication\ncode that is saved as 'login.jmx'.  If the login protocol changes, currently you\nwould have to manually make changes to all twenty scenarios and merge them\ndirectly into a Thread Group.\n\nIf you had a login sampler group (called 'Login') , you would be able to\nvisually identify all of the samplers associated with that functionality.  You\ncould make a change in login.jmx, delete the old samplers from Login, then merge\nthe new samplers into 'Login' from the file. \n\nIdeally, you should be able to link the sampler group to a file and have it\nmerge automatically when you open the test plan -- like a C #include or java\nimport. In the example above, the sampler group 'Login' could be directly linked\nto the file login.jmx. This would make complicated test plans much easier to\nmaintain."}, {"text": "A basic version of the include controller has been implemented and checked into\nCVS. It should be in today's nightly build. The current implementation does not\nshow the requests in the included .jmx file. it dynamically loads the partial\nchunk and adds it at runtime. More time is needed to figure out to display the\nincluded controller and requests.\n\nideally, jmeter should allow users to edit those .jmx chunks directly and have\nit update the original file. that kind of ability would be nice to have, but\nrather than implement something poorly, I decided to implement a simple version\nfor now.", "tags": [], "creator": "woolfel@yahoo.com", "is_private": false, "count": 1, "id": 79021, "time": "2005-08-25T23:22:10Z", "bug_id": 36285, "creation_time": "2005-08-25T23:22:10Z", "attachment_id": null}]