[{"count": 0, "tags": [], "text": "When log4j initilizes the logger calls remove all appenders. I dont get a reason\nwhy it does that. I am using log4j in a Application server environment that has\nthree applicaitons using log4j. First is the server second is my web application\n(app1) and the third is another web application (app2). Both the apps try to\nattach their main appender to org.apache logger. Now when the second applicaiton\ninitilizes the appenders that were configures as a part of first application\ngets closed. Since the log4j is a common library between all the servers the\nlog4j logger repository is shared the last application that gets initialized\ngets its way.", "attachment_id": null, "id": 78940, "creator": "namanjp@hotmail.com", "time": "2005-08-24T19:30:20Z", "bug_id": 36342, "creation_time": "2005-08-24T19:30:20Z", "is_private": false}, {"count": 1, "tags": [], "creator": "carnold@apache.org", "attachment_id": null, "id": 91773, "time": "2006-08-01T18:46:00Z", "bug_id": 36342, "creation_time": "2006-08-01T18:46:00Z", "is_private": false, "text": "Marking as need info for now, but will eventually likely close as invalid.  Your\nreport doesn't go into enough detail to reproduce the problem or offers any\nsuggested remedy.  At this late in the lifetime of log4j any significant change\nin behavior is unlikely, so any suggested modification would have to be very\nconservative so that it would address your issue without break apps that depend\non the current behavior.\n\nYou do not mention how you are configuring log4j.  Default configuration using\nlog4j.properties or log4j.xml should only be called once per log4j instance. \nYour report suggests that you may be explicitly calling a configurator multiple\ntimes.  If so, there is not much opportunity to change the behavior since it\nwould also affect a console app for example that makes multiple calls to a\nconfigurator.  There is a provision (in log4j 1.3, I believe) to support\nmultiple logging domains for just such as scenario as you describe, but I'm not\nall that familiar with it.  Ask on log4j-user if you are interested."}, {"count": 2, "tags": [], "bug_id": 36342, "attachment_id": null, "id": 95735, "time": "2006-11-12T10:20:37Z", "creator": "kay.abendroth@raxion.net", "creation_time": "2006-11-12T10:20:37Z", "is_private": false, "text": "No reply since more than 3 months.\n\nShould be closed."}, {"count": 3, "tags": [], "bug_id": 36342, "text": "When Log4j is shared across applications, all application will use the same\nlogger repository unless a repository selector is used.  Ideally, the repository\nselector would be set by the appserver upon server startup, but can be set by\nthe first app that gets configured.  The selector can/should only be set once,\nand is protected by a guard object after initially set.  There is no selector\nimplementation that ships with Log4j-1.2.xx, but the ContextJNDISelector\nimplementation ships with Log4j-1.3alpha.  A search of the web should come up\nwith at least a few implementations for Log4j-1.2.xx.\n\nAs far as removing the appenders go, that probably makes sense, since if the new\nconfiguration doesn't use the same appenders as the old configuration, one\nwouldn't want to leave those non-utilized resources active.\n\nIn any case, it is well known that reconfiguring log4j multiple times in a\nshared logger repository  (the default one) will affect all apps using that\nlogger repository.  This should not have been reported as a bug, but asked as a\nquestion on the user list.  BTW, a search of the user list should provide more\nthan enough information to answer the question.\n\nResolving as WONTFIX.\n\nJake", "id": 95738, "time": "2006-11-12T10:48:46Z", "creator": "hoju@visi.com", "creation_time": "2006-11-12T10:48:46Z", "is_private": false, "attachment_id": null}]