[{"count": 0, "tags": [], "creator": "brody@gebit.de", "text": "Hi,\nI wanted to use the input task for selecting a name from a (valid) list of\nitems. Therefore I feed the input tasks attribute \"validargs\" with an adequate\nformatted list. \nAfter starting the surrounding target, I discovered that the shown input dialog\nshows the valid values (inside brackets) by appending the list to the input\nmessage. Because the list has many items, only the start of the list is shown.\n\nI would suggest, that\neither the boundaries of the shown dialog have to be recalculated (which can\nresult in an dialog, which cannot be displayed)\nor the displayed list have to be split automatically (by using carriage returns)\nto fit into the dialog.", "id": 79048, "time": "2005-08-26T13:53:12Z", "bug_id": 36377, "creation_time": "2005-08-26T13:53:12Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 36377, "attachment_id": null, "id": 79063, "time": "2005-08-26T15:34:26Z", "creator": "stevel@apache.org", "creation_time": "2005-08-26T15:34:26Z", "is_private": false, "text": "Ant doesnt implement any dialog box for input. It prints stuff to stdout, and\nwaits for stuff in stdin.\n\nAre you using an IDE? Which one?"}, {"count": 2, "tags": [], "bug_id": 36377, "is_private": false, "id": 79065, "creation_time": "2005-08-26T15:56:18Z", "time": "2005-08-26T15:56:18Z", "creator": "brody@gebit.de", "text": "Yes, I use Eclipse (as my IDE); and for easyness I tested this feature inside\nthe IDE - when using a shell, the output is completely printed inside the\nconsole window using the actual size of the window...\n\nSorry, must forward this bug report to Eclipse Group\nWill \"resolve\" bug, if I allowed to.", "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "patjlm@online.fr", "is_private": false, "id": 79067, "time": "2005-08-26T16:15:45Z", "bug_id": 36377, "creation_time": "2005-08-26T16:15:45Z", "tags": [], "text": "You might want to have a look at antform (http://antforms.sourceforge.net/)\nwhich provides an easy UI for editing ant properties.\nPatrick Martin."}]