[{"count": 0, "tags": [], "bug_id": 36384, "attachment_id": null, "text": "While attempting to try the new RollingFileAppender I ran into problems where I\ncould not set the rollingPolicy/triggeringPolicy from a properties file.\n\nI wasted quite a bit of time trying permutations and searching the web.\n\nLater I found this link:\nhttp://mail-archives.apache.org/mod_mbox/logging-log4j-user/200309.mbox/%3c5.2.1.1.0.20030923153840.025f3850@mail.qos.ch%3e\n\nI believe that the following corrections should be made:\n\n1) Properties should be fully supported.  Many people do not want to load and\nrun an XML parser just to read small 50 line config files.\n\n2) Documentation should be clear on what is and is not supported.\n\n3) It would help to have a tool/option/trace that would express the properties\nand probably the XML attributes that are supported for particular component.\n\nI turned on log4j.debug and got the less than helpful:\n\nFailed to set property [triggeringPolicy] to value\n\"org.apache.log4j.rolling.TimeBasedRollingPolicy\". \n\nand later\n\nPlease set a TriggeringPolicy for the RollingFileAppender named 'foo'", "id": 79075, "time": "2005-08-26T18:17:09Z", "creator": "jak.mang@gmail.com", "creation_time": "2005-08-26T18:17:09Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 36384, "is_private": false, "text": "1) Putting log4j.xml in your classpath is sufficient\n2) Care to contribute? Not sure I understand the deficiency.\n3) Properties of an appender are now logged (as debug) for SVN trunk\n\nThis needs to be a bug report, not a list of complaints", "id": 98639, "time": "2007-01-28T03:37:55Z", "creator": "genman@noderunner.net", "creation_time": "2007-01-28T03:37:55Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "carnold@apache.org", "is_private": false, "id": 98664, "time": "2007-01-28T21:00:08Z", "bug_id": 36384, "creation_time": "2007-01-28T21:00:08Z", "tags": [], "text": "I'm going to reopen this one.  Basically the deficiency is that every other included appender with the \nexception of the org.apache.log4j.rolling.RollingFileAppender can be configured by either the \nPropertyConfigurator or the DOMConfigurator while the new RFA can only be configured by the \nDOMConfigurator.  If you have an existing property file configuration and decide to extend it to include a \no.a.l.r.RFA, then you would have rewrite the whole configuration as an XML configuration file.\n\nThis is similar to https://issues.apache.org/jira/browse/LOGCXX-102 which includes a patch to log4cxx \nto support configuration of o.a.l.r.RFA through the property configurator.  While I have some issues with \nputting RFA specific code in PropertyConfigurator (as the patch does), it does show that it is not \ntechnically insurmountable to modify property configurator to support the new RFA.  My preferred process \nwould be to come up with a fix in log4j and then port the fix over to log4cxx."}, {"count": 3, "attachment_id": null, "creator": "thorbjoern@gmail.com", "is_private": false, "id": 118257, "time": "2008-07-03T14:08:26Z", "bug_id": 36384, "creation_time": "2008-07-03T14:08:26Z", "tags": [], "text": "This is reported against 1.3alpha which has been discontinued.  Is this behaviour backported to 1.2 or should this be closed with WONTFIX?"}, {"count": 4, "attachment_id": null, "creator": "thorbjoern@gmail.com", "is_private": false, "id": 119250, "time": "2008-08-02T09:41:42Z", "bug_id": 36384, "creation_time": "2008-08-02T09:41:42Z", "tags": [], "text": "No response in a month.  Changing to NEEDINFO."}, {"count": 5, "tags": [], "bug_id": 36384, "is_private": false, "text": "I've been fighting for a couple of days with the propertyconfigurator to try to have this working when I finally found this bug. Our project has a lot of log files, and of course, every thing is configured with properties. So updating all the configuration files into XML is a project in itself.\n\nI have included apache-log4j-extras to try to have the RFA compressing the old log files when rotating along with log4j 1.2.14 without success. I would really love to have a fix included into 1.2 mainstream for this issue.\n\nApologies if this is not the right place to post.", "id": 119383, "time": "2008-08-05T02:58:10Z", "creator": "hugues@labarben.org", "creation_time": "2008-08-05T02:58:10Z", "attachment_id": null}, {"count": 6, "tags": [], "creator": "carnold@apache.org", "text": "The org.apache.log4j.rolling.RollingFileAppender is available for log4j 1.2 in the extras companion, so this issue is relevant to log4j 1.2.  This is an issue that I'd be willing to accept a patch for, so I would not like to prematurely mark it as closed and prevent someone interested party to come up with a patch, but it isn't blocking since it is an enhancement and not a regression or some other critical issue. ", "id": 119453, "time": "2008-08-05T16:47:50Z", "bug_id": 36384, "creation_time": "2008-08-05T16:47:50Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 36384, "attachment_id": 22396, "text": "Created attachment 22396\npatch to log4j's PropertySetter agaisnt today's code in trunk\n\nHere is a quick patch I've been working on. It basically allows to configure the appender with an object by providing a class name and then configure the object via sub-properties.\n\nI've been able to configure the rootLogger with the following properties:\n\n#### ROOT category ###\nlog4j.rootLogger=DEBUG, ROOT\nlog4j.appender.ROOT=org.apache.log4j.rolling.RollingFileAppender\nlog4j.appender.ROOT.RollingPolicy=org.apache.log4j.rolling.TimeBasedRollingPolicy\nlog4j.appender.ROOT.RollingPolicy.FileNamePattern=/logs/root.log-%d{yyyy-MM-dd-HH-mm}.gz\nlog4j.appender.ROOT.File=/logs/root.log\nlog4j.appender.ROOT.layout=org.apache.log4j.PatternLayout\nlog4j.appender.ROOT.layout.ConversionPattern=%d{ABSOLUTE} [%t] %-5p %c - %m%n\n\nAnd the log files was nicely rolling every minute and compressing the data. Also the mvn build was working fine (excepted for one test that was not passing before anyway).\n\nI did not create a Unit test for that though. Point me in the right direction if you need one, and I'll find some time to create it.", "id": 119511, "time": "2008-08-06T09:06:09Z", "creator": "hugues@labarben.org", "creation_time": "2008-08-06T09:06:09Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 36384, "text": "Committed similar approach to submitted patch in rev 684948 along with unit test.  Original patch could not be accepted since it changed the signatures on existing public methods.\n\nResolving as fixed, but reopen if there are problems.", "id": 119695, "time": "2008-08-11T14:40:43Z", "creator": "carnold@apache.org", "creation_time": "2008-08-11T14:40:43Z", "is_private": false, "attachment_id": null}]