[{"count": 0, "tags": [], "bug_id": 36390, "attachment_id": null, "id": 79092, "time": "2005-08-26T22:25:27Z", "creator": "hgleaves@mail.acponline.org", "creation_time": "2005-08-26T22:25:27Z", "is_private": false, "text": "Include a configurable feature that enables the HTTP server to dynamically strip\ncomments from input files, like html, css etc.\n\nSince such comemnts are primarily intended for development staff that work on\nthese files and that the number of bytes to transmit is reduced, this is an\nattractive way to manage this activity.\n\nIf possible a caching algorithm could be introduced (unless one exists already,\nI am unfamilair with the Apache design and internals) that caches the stripped\nfiles data and that can be \"re-served\" whenever that resources is re-requested\n(with the usual consideration given to \"stale\" processing etc).\n\nFurthernore the performance gain in not transmitting the comment bytes, would\noffset (to some degree) the cost incurred by the lexical analysis and stripping\noperation, and conceivably might even lead to a performance increase for heavily\ncommented files.\n\nI can conceive of at least these potentially very useful configuration options:\n\n1. Set a default strip_mode (on/off)\n2. Apply the default strip_mode for clients whose IP is within a specified\nrange. (this allows internal testers to see coments but external users to not\nsee them).\n3. Support strip types: full (every comment byte and delimiter removed), blanked\n(replace comments including delimiters, with spaces) and obfuscated (retain\ndelimiters but replace every other char/space with a \"X\").\n\nThese options allows one to at least see that comments are in place or that\ncomments are being forcibly blanked, all of these are useful under\ndevelopment/testing/support conditions).\n\nI was informed by a regular Apache contributor that mod_include.c might be an\nideal place to implement such a change and that some degree of lexical\nprocessing already exists, that it might be a \"small\" change.\n\nAlthough doing this processing might be considred by some, to be redundant,\ninelegant etc, it is configurable so nobody would be forced to use this, rather\nindividual users sights would have the option if they ever needed it and such\nfeatures can be very very useful for some users in some scenarios.\n\nThanks"}, {"count": 1, "tags": [], "bug_id": 36390, "attachment_id": null, "id": 79108, "time": "2005-08-27T17:26:06Z", "creator": "nick@webthing.com", "creation_time": "2005-08-27T17:26:06Z", "is_private": false, "text": "I'll leave this open just in case someone wants to hack it. \n \nBut why are you looking for new features in a server that's been obsolete for \nover three years?  Just upgrade to Apache 2 and you have all you're asking \nfor. "}, {"count": 2, "tags": [], "text": "no new features in 1.3", "attachment_id": null, "bug_id": 36390, "id": 106201, "time": "2007-08-02T13:03:53Z", "creator": "jim@apache.org", "creation_time": "2007-08-02T13:03:53Z", "is_private": false}]