[{"count": 0, "tags": [], "creator": "palaste@cc.helsinki.fi", "attachment_id": null, "text": "If a <fo:block> node in the XSL:FO source given to FOP has the hyphenate=\"true\"\nattribute set, enabling hyphenation, and the contents of the block have lots of\nconsecutive digits stretching beyond the block boundary, like so:\n\n                                | <-- boundary\nThe phone number is 12345678901234567890.\n\nthen FOP splits the consecutive digits at the boundary, rendering the text like so:\n\n                                | <-- boundary\nThe phone number is 1234567890123\n4567890.\n\nI would prefer it to treat the entire digit sequence as a single,\nnon-hyphenatable word, causing it to render as follows:\n\n                                | <-- boundary\nThe phone number is\n12345678901234567890.\n\nHowever, I couldn't find out any way to configure FOP to do this, because it\nuses the same hyphenation pattern format as TeX, and apparently TeX only takes\nletters, not other symbols, into account when parsing the hyphenation rules.\n\nIs there some kind of way I could stop FOP from splitting consecutive digits\nonto separate rows?", "id": 79138, "time": "2005-08-29T19:01:29Z", "bug_id": 36408, "creation_time": "2005-08-29T19:01:29Z", "is_private": false}, {"count": 1, "tags": [], "creator": "bowditch_chris@hotmail.com", "attachment_id": null, "text": "The correct way to stop a piece of text being split across line/page/column \nbounaries in XSL-Fo is to use keep-* properties.\n\ne.g.\n\n<fo:inline keep-together=\"always\">12345678901234567890</fo:inline>\n\nHowever, keep-* properties are not implemented in 0.20.5. They have been \nimplemented in the current development version. 0.20.5 is about to be \nsuperceeded by a release of the development code and since work has stopped on \nthe maintenance code, this bug won't be fixed in 0.20.5 and I'm closing this \nbug report.", "id": 79163, "time": "2005-08-30T13:07:04Z", "bug_id": 36408, "creation_time": "2005-08-30T13:07:04Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 36408, "attachment_id": null, "text": "The suggested fix wouldn't work in my case.\n\nTo achieve what I want to do with the suggested fix, I'd have to write the\n<fo:block> as:\n\n<fo:block hyphenation=\"true\"><fo:inline>The phone number is\n</fo:inline><fo:inline\nkeep-together=\"always\">12345678901234567890</fo:inline><fo:inline>.</fo:inline></fo:block>\n\nHowever, the text contents of the <fo:block> are dynamically generated and thus\nI can't decide in advance where the <fo:inline> nodes should go. I am reopening\nthis bug. If the bug is invalid because of the wrong version, please reclose the\nbug and tell me how to report it with the corret version.\n", "id": 79181, "time": "2005-08-30T16:01:35Z", "creator": "palaste@cc.helsinki.fi", "creation_time": "2005-08-30T16:01:35Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 36408, "attachment_id": null, "id": 79194, "time": "2005-08-30T18:05:58Z", "creator": "jeremias@apache.org", "creation_time": "2005-08-30T18:05:58Z", "is_private": false, "text": "I can't prove it but I'd say that FOP 0.20.5 illegally splits the long number. A\nnumber is not subject to hyphenation, is it? Anyway, FOP Trunk currently doesn't\nsplit the number but keep-together.within-line doesn't work, either. So, Joona\nwould actually be fine with FOP Trunk except that there is no warning message,\nyet, when a word is rendered beyond the content rectangle (i.e. overflows the\nbox). Other FO implementations compress the word to fit it into the content\nrectangle but that's probably a bad idea since it results in badly looking output.\n\nIMO this bug can be closed again, but only because Joona's problem shouldn't\nhappen in FOP Trunk and it won't be fixed in 0.20.5. I don't have a work-around\nfor 0.20.5, either, except to try to shut off hyphenation. Sorry. The missing\nkeep-together.within-line feature is a different story and IMO not related to\nJoona's problem."}, {"count": 4, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "text": "please provide (1) an input FO test file, (2) an output PDF file (if any), (3) console output as file (if any), and (4) FOP version being tested", "id": 157020, "time": "2012-04-01T16:23:46Z", "bug_id": 36408, "creation_time": "2012-04-01T16:23:46Z", "is_private": false}]