[{"count": 0, "tags": [], "creator": "a-mickel@microsoft.com", "attachment_id": null, "text": "1. Install Windows Vista ADS 5215 build.\n2. Make sure your IIS website is running.(Go to Run>inetmgr>Default website)\n3. Start installation of Apache HTTP Server 2.0.54.\n4. Watch for any error message.\n5. After completion of installation, try start, stop or restart of apache \nservice through services.msc wizard or from Apache Application.\n6. Watch for any error message.\n7. Start and stop IIS Website through inetmgr. Watch for any error message.\n8. Browse port 80 http://localhost:80. Observe that it displays the default \nwebsite configured on the Apache server.\n. Check which website it shows on browser.\n\nAdditional Notes:\nBy default, IIS Website Service is running on Longhorn. When Apache got \ninstalled on this machine, it does not pop an error to stop default IIS \nwebsite. Apache gets installed and its service can start, stop or restart \nwithout an error. It is found that both the services use port 80 and both are \nin running mode.\nExpected behavior of throwing an error message is observed on Windows 2003 \nServer (1830).\nWhen both IIS and Apache services are simultaneously running on the same \nmachine with websites using port 80 in both cases, and when we try to browse \nhttp://localhost:80  we get the Apache website.\n\nResults: Apache does not detect the existence of an IIS server on the same \nmachine. Apache does not throw any error message during installation when IIS \nwebsite is running on same port. System does not throw an error message when \nstarting and stopping either of the services.\n\nExpected Results:  Apache must throw an error message during installation when \nIIS website is running on same port. Again, it must throw an error message \nwhen starting and stopping either of the services.", "id": 79189, "time": "2005-08-30T17:23:53Z", "bug_id": 36422, "creation_time": "2005-08-30T17:23:53Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "nick@webthing.com", "text": "Why is this an error?   \n   \n1. People run more than one webserver for all sorts of reasons.   \n2. I'd call your \"expected behaviour\" a serious bug.  Why should you stop a \nrunning service just to *install* another package?  Someone upgrading from an \noperational IIS to Apache will surely want time to install, configure and test \nApache before switching IIS off. \n3. It's not clear from your report, but if two processes are binding   \nsimultaneously to the same IP:port, it's for the operating system to deal with  \nany conflicts.  So *if* there's a bug, it's in the OS.  ", "count": 1, "id": 84244, "time": "2006-01-05T07:56:15Z", "bug_id": 36422, "creation_time": "2006-01-05T07:56:15Z", "is_private": false}]