[{"count": 0, "tags": [], "bug_id": 36569, "attachment_id": null, "id": 79704, "time": "2005-09-09T08:10:54Z", "creator": "tdunning@veoh.com", "creation_time": "2005-09-09T08:10:54Z", "is_private": false, "text": "When an HTTP request includes query string parameters whose values include\nspaces and this request is redirected, Tomcat can produce a redirect location\nthat has unescaped spaces because the reconstructed URL contains a query string\nwhose components have not been url-encoded.  This has predictably bad results\nwhen used without repairing the URL.  It is likely that other escaping is also\nnot done which could conceivably be used used in an injection attack of some kind.\n\nBrowsers such as firefox can and do partially compensate for this, but they\ncan't deal with all cases since unescaped /'s, ?'s and &'s can't reliably be\ndistinguished from the functional versions of these characters."}, {"count": 1, "tags": [], "bug_id": 36569, "attachment_id": null, "text": "sendRedirect takes a URL as a parameter. If you don't give more details, I'll\nclose as INVALID.", "id": 79714, "time": "2005-09-09T12:06:37Z", "creator": "remm@apache.org", "creation_time": "2005-09-09T12:06:37Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 36569, "text": "\nOn further examination, I think what you are right in essence ... the real\nproblem is that acegi is providing an invalid URL to Tomcat.\n\nThis raises the question, however, about whether sendRedirect shouldn't check\nit's input and provide an informative error message so that errors like this are\ncaught early rather than much later.\n\nAlso, the resulting access after the invalid location is used could provide a\nbetter message.  The GET message that begins the transaction looks somehting\nlike this:\n\n       GET http://host.domain.tld/usrl?arg1=first second&arg2=foo HTTP/1.1\n\nTomcat interprets this as meaning that the protocol is \"second&arg2=foo\".  What\nshould really happen is that Tomcat should generate a 505 invalid request.\n\nChanging the error checking is more important than it might appear to be due to\nthe widespread use of acegi.", "id": 79738, "time": "2005-09-09T18:21:05Z", "creator": "tdunning@veoh.com", "creation_time": "2005-09-09T18:21:05Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 36569, "attachment_id": null, "text": "Mmmm.. The Servlet Spec already says all URLs passed to sendRedirect should\nfirst be passed to encodeRedirectURL.  That method, in Tomcat, calls\norg.apache.catalina.connector.Response#isEncodeable, which in doIsEncodeable\ntries to construct a URL and returns false if there's a MalformedURLException. \nIn theory we could do something with this MalformedURLException, but the Servlet\nSpec API for encodeRedirectURL doesn't allow for declared exceptions, so it\nwould have to be a runtime exception, which seems like an ugly surprise for our\nusers.\n\nI'll stew about this a bit more as time permits, but alternative ideas welcome...", "id": 82785, "time": "2005-11-23T23:07:00Z", "creator": "yoavs@computer.org", "creation_time": "2005-11-23T23:07:00Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 36569, "attachment_id": null, "text": "One thought is that if sendRedirect gets a malformed URL, it can redirect to an\nerror page that says that there was an invalid redirect.  This is similar to\nredirecting to a special page if a jsp can't be compiled or if an uncaught\nexception is thrown by a servlet.\n\nThis doesn't solve the problem, but it does make it very clear when it happens.", "id": 82786, "time": "2005-11-23T23:45:49Z", "creator": "tdunning@veoh.com", "creation_time": "2005-11-23T23:45:49Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 36569, "attachment_id": null, "id": 94563, "time": "2006-10-05T15:16:57Z", "creator": "markt@apache.org", "creation_time": "2006-10-05T15:16:57Z", "is_private": false, "text": "Marking as an enhancement. As always, patches are welcome."}, {"count": 6, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Hmm. No patch has been forthcoming and I don't recall this as something that users are complaining about on the users list.\n\nGiven that if the API is used as recommended by the spec, this should be a non-issue I am resolving this as WONTFIX.", "id": 146485, "time": "2011-05-20T19:04:00Z", "bug_id": 36569, "creation_time": "2011-05-20T19:04:00Z", "is_private": false}]