[{"count": 0, "tags": [], "bug_id": 36586, "attachment_id": null, "text": "HttpSession access is not being synchronized.  Please understand that any time\nthe HttpSession is accessed there is no guarentee if the underlying system will\nprotect the data.  Other Servlet and J2EE servers other than Tomcat may behave\nthis way.\n\nPlease see the bug http://issues.apache.org/bugzilla/show_bug.cgi?id=36541 for\nmore details.  getAttribute in Tomcat is not synchronizing the underlying\nHashMap and this can cause more than one issue.  \nOnes noted:\n1) A validly set session variable might not get retrieved on a call to\ngetAttribute if a setAttribute occurs on the same session from another Thread,\nJSP page, or Servlet.\n\n2) Infinite loops have been reported\n\n3) It makes the software unpredictable", "id": 79751, "time": "2005-09-10T00:09:02Z", "creator": "hwadechandler-apache@yahoo.com", "creation_time": "2005-09-10T00:09:02Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 36586, "attachment_id": null, "id": 79752, "time": "2005-09-10T00:09:40Z", "creator": "hwadechandler-apache@yahoo.com", "creation_time": "2005-09-10T00:09:40Z", "is_private": false, "text": "Tomcat however happens to have other code within itself which is not\nsynchronizing access to the HttpSession.  Bug reports will have to be filed for\nall instances.  Any help in locating them and filing them is welcome."}, {"count": 2, "tags": [], "bug_id": 36586, "attachment_id": null, "text": "removeAttribute needs to be synchronized as well.  Basically ANY HttpSession\naccess should be synchronized as there is no guarentee that access will ever be\nsynchronized for sessions.", "id": 79753, "time": "2005-09-10T00:18:30Z", "creator": "hwadechandler-apache@yahoo.com", "creation_time": "2005-09-10T00:18:30Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 36586, "attachment_id": null, "text": "Corresponded with Yoav Shapira from the Tomcat project and he agreed no contract\nexists that the session is synchronized by the container.  Tomcat itself will be\nsynchronized at the lower levels, but that does not mean this will remain true\nin future versions, nor does it mean this can be assumed for any other container.", "id": 79892, "time": "2005-09-13T17:46:00Z", "creator": "hwadechandler-apache@yahoo.com", "creation_time": "2005-09-13T17:46:00Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 36586, "attachment_id": null, "text": "BZ#36541 has the tedious details, which indicates that the next servlet spec \nwill clarify this much better so its fixed at the level of all containers. \nIMO, fixing this in all taglibs is a non-trivial task that will be redundent \nover time (because when the containers fix this, it will remain as cruft, \npossibly eating away cycles). Having said that, if anyone wishes to do the \nwork in providing patches for one or more of the taglibs to ensure threadsafe \nsession accesses, please re-open and provide the patch(es). In that case, it \nwould be nice if, when the world moves to the next servlet spec (which \narguably may take a while), someone also remembers to take those bits out.\n", "id": 80423, "time": "2005-09-24T18:17:20Z", "creator": "rahul@apache.org", "creation_time": "2005-09-24T18:17:20Z", "is_private": false}]