[{"count": 0, "tags": [], "bug_id": 36619, "attachment_id": null, "is_private": false, "id": 79825, "time": "2005-09-12T18:52:55Z", "creator": "philip.thatcher@anite.com", "creation_time": "2005-09-12T18:52:55Z", "text": "Created a thread group with \"Stop Test on error\" set,a JDBC sampler, and added \na duration assertion using the work around described in \nhttp://issues.apache.org/bugzilla/show_bug.cgi?id=36465.\n\nWhen executed with an actual loop count specified, JMeter does indeed stop the \ntest following a breech of the duration assertion :).  However, when executed \nwith a thread group loop count of 'Forever', JMeter does seem to stop the \ntest, but the green light remains on and the 'Run->Start' option is still \ndisabled :(.  Further to this, the JDBC connections remain in use and \nselecting 'Run->Stop' causes a lockup.\n\nThe issue appears to be the thread group \"loop forever\" setting incorrectly \ntaking priority over thread group \"stop on error\"."}, {"count": 1, "tags": [], "bug_id": 36619, "is_private": false, "id": 79881, "attachment_id": null, "creator": "philip.thatcher@anite.com", "creation_time": "2005-09-13T16:08:17Z", "time": "2005-09-13T16:08:17Z", "text": "Hmmmmm.  There's more to this.  It all works fine with a small number of \nthreads in the thread group - say 10 threads, ramping over 10 seconds.  But \nfails with the symtoms reported with 40 threads ramping over 10 seconds.  And \nI don't think I'm getting caught by the thread shutdown time - (I've allowed \nit hours while investigating).  I also doubt it's directly the number of \nthreads that's the factor, but more how many are underway when the assertion \nkicks in and the \"Stop Test\" functionality tries to halt the test.  It just \nseems to \"lose control\" of the threads being initiated during the \"Stop Test\" \nactivity."}, {"count": 2, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 79889, "time": "2005-09-13T17:30:45Z", "bug_id": 36619, "creation_time": "2005-09-13T17:30:45Z", "is_private": false, "text": "It's still a bug, so re-opening"}, {"count": 3, "tags": [], "bug_id": 36619, "text": "The shutdown/stop handling has been improved, and this should now work in nightly builds (and JMeter 2.3.3+)\n\nPlease re-open with details if if does not work.", "id": 126883, "attachment_id": null, "creator": "sebb@apache.org", "creation_time": "2009-05-08T17:58:32Z", "time": "2009-05-08T17:58:32Z", "is_private": false}]