[{"count": 0, "tags": [], "bug_id": 36649, "attachment_id": null, "is_private": false, "id": 79920, "time": "2005-09-14T09:22:16Z", "creator": "colonel_angel2004@yahoo.com", "creation_time": "2005-09-14T09:22:16Z", "text": "I've had all I can personally take... If Apache wasn't so highly recommended and\nthe fact that it's the main stream web server for Linux, I wouldn't use it.\n\nThe documentation on proxying is not very helpful to the newbies.\n\nFor example, it only gives you brief conjectures of what to do, but no real\nexamples to follow.\n\nNext, it seems very much like the proxying is turned on, even if you don't use\nthe mod_proxy.so module.\n\nThe only thing I found after NUMEROUS hours is a \"NoProxy aaa.bbb.ccc.ddd\nwww.somedomain.com\" type of thing.\n\nWhile it is supposed to improve performance of websites, it however is a\nsecurity flaw by allowing non-authorized users, especially PORN sites to use the\nweb server as a proxy service for their own use.\n\nNow to my dilemma...\n\nFor my logging, it's showing people as using my server as a proxy service, even\nthought it's turned off and it doesn't seem to include the module for proxying\n(mod_proxy.so).\n\nFor those of us that are not as \"savvy\" as those of you who will read this, we\nare needing a way to completely disable this feature in clear and concise\ninstructions.\n\nI'm using Mandriva 2005 Limited, with Apache 2.0.53.  \n\nI don't want people using my server for their own needs, but my own.\n\nLastly, I had to spend at least 2 days to find \"NoProxy\", but even that has to\nbe used with mod_proxy.so.\n\nSo, proxying should be a completely \"optional\" feature, not one that's\nautomatically there and turned on.  It should be an added on module that people\nhave to download or compile it with Apache.\n\nYou can view my webalizer stats @ http://www.netdesignconceptions.com/usage/ \nThere shouldn't be anything other than my site on URL's, but yet there's...\nYahoo and Sun Microsystems on my URL's.\n\nPlease help before I go entirely insane!!!!!!!"}, {"count": 1, "text": "You appear to be looking for ProxyRequests, which features very prominently in \nthe mod_proxy documentation, as well as in third-party articles such as mine \nat ApacheWeek.  \n  \nPlease ask support questions in a user support forum. ", "creator": "nick@webthing.com", "is_private": false, "id": 79929, "time": "2005-09-14T11:06:45Z", "bug_id": 36649, "creation_time": "2005-09-14T11:06:45Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 36649, "is_private": false, "count": 2, "id": 79946, "time": "2005-09-14T15:41:43Z", "creator": "slive@apache.org", "creation_time": "2005-09-14T15:41:43Z", "text": "And in fact, this is a documented FAQ:\nhttp://httpd.apache.org/docs/1.3/misc/FAQ.html#proxyscan"}]