[{"count": 0, "attachment_id": null, "bug_id": 36830, "text": "I am trying to send cookies for a HTTPRequest HTTPClient sampler, but the \ncookies aren't being sent.  This occurs when I do a follow redirect, the first \nresponse sets cookies, and the redirect request does not set cookies.  It may \nalso occur for other cases.\n\nI am using commons-httpclient-2.0.2\n\nReferring to code - HTTPSampler2.java\nIn the setupConnection function, the cookies are set for the HTTPMethod object.\nIn the sample function, the request is processed using the processRequest \nmethod, which leads to an execute call on HTTPMethod object.\n\nThen it goes into httpclient code.  In that code, referring to \nHTTPMethodBase.java (which does the actual writing of the request and header \nover the connection), there is a addCookieRequestHeader function that is \ncalled.  This function removes the \"cookie\" from the header, then tries to add \nit back in using the HTTPState.  However, the HTTPState object does not contain \nthe cookies (it is not modified in the setupConnection function which uses \nCookieManager to setup cookies for the request).\n\nAnybody else see this problem?", "id": 80515, "time": "2005-09-27T20:23:08Z", "creator": "chung@amazon.com", "creation_time": "2005-09-27T20:23:08Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 36830, "is_private": false, "count": 1, "id": 80520, "time": "2005-09-27T22:15:09Z", "creator": "sebb@apache.org", "creation_time": "2005-09-27T22:15:09Z", "text": "Are you using Redirect Automatically or Follow Redirects?\n\nThe former relies on the underlying protocol implementation to do the redirect.\n\nDoes the same problem occur with the original HTTP Sampler?\n\nIf you could attach a simple test-case to this issue, it would be a great help."}, {"count": 2, "tags": [], "creator": "chung@amazon.com", "attachment_id": null, "text": "I'm using \"Follow Redirect\", but looking at the code, it seems like the problem \nwould occur no matter what the request is a result of.  In general, it looks \nlike that cookies would never be sent to the server.\n\nThe cookies are printed out in the request tab of the \"Results Tree\" element, \nbut it's not being sent (the \"Results Tree\" prints out the request string prior \nto it actually being sent).  The HTTPClient class modifies the request header.\n\nThe same problem occurs with HTTPSampler.\n\nAs for a test case, I'm not sure if I can give you one.  I can describe a test \nscenario, but the server I'm hitting is a private test server that nobody can \naccess from the outside.\n\nIf you hit a server page that does a set-cookie, then a redirect, the second \nrequest won't have cookies sent to it (I know this because I am doing tcpdump \non my server) even though the result tree shows it.  I have jmeter setup in \neclipse and debugged it up to the point that httpclient is writing the header.  \nAt this point, httpclient inserts it's own header information, and the cookie \nheader values that HTTPSampler2 setup are removed.\n\nSee the addCookieRequestHeader function in HTTPMethodBase.java (found in \ncommons-httpclient-2.0.2).\n\nI have a fix for this that I'm using right now.  I just want to make sure that \nothers might be having this problem.", "id": 80521, "time": "2005-09-27T22:25:54Z", "bug_id": 36830, "creation_time": "2005-09-27T22:25:54Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 36830, "attachment_id": null, "id": 80522, "time": "2005-09-27T22:27:23Z", "creator": "chung@amazon.com", "creation_time": "2005-09-27T22:27:23Z", "is_private": false, "text": "Just tried without doing follow redirects.  If I hit the server, it sets \ncookies.  If I hit it again, cookies are not sent (shows up in result tree, but \nserver doesn't get any).  Monitored on client side too, the request header has \nno cookie key.  Stepped through the code and saw the same problem"}, {"count": 4, "tags": [], "bug_id": 36830, "text": "This has been fixed in the current code. Please re-open if there are still \nproblems", "id": 82525, "time": "2005-11-15T20:45:47Z", "creator": "sebb@apache.org", "creation_time": "2005-11-15T20:45:47Z", "is_private": false, "attachment_id": null}]