[{"count": 0, "tags": [], "creator": "prestonj@bitheads.com", "attachment_id": null, "is_private": false, "id": 81004, "time": "2005-10-11T20:06:39Z", "bug_id": 37025, "creation_time": "2005-10-11T20:06:39Z", "text": "I have a bunch of small webservers running under the HTTP/0.9 protocol. When\nbinary data (ie jpg files) is requested via an apache proxy server, the data\ncomes back missing a few bytes (2 missing bytes in apache 2.0.47 and 1 missing\nbyte in apache 2.0.54). \n\nAccording to section 6 of the HTTP1.0/0.9 protocol:\nhttp://www.faqs.org/rfcs/rfc1945.html\n\"A Simple-Response should only be sent in response to an HTTP/0.9\n   Simple-Request or if the server only supports the more limited\n   HTTP/0.9 protocol. If a client sends an HTTP/1.0 Full-Request and\n   receives a response that does not begin with a Status-Line, it should\n   assume that the response is a Simple-Response and parse it\n   accordingly. Note that the Simple-Response consists only of the\n   entity body and is terminated by the server closing the connection.\"\n\nFrom my investigation, it looks like mod_proxy is trying to read the first\nLF-terminated line of the response and parse it as if it were an http header.\nSpecifically the call to function \"ap_getline(...)\" in proxy_http.c function\n\"ap_proxy_http_process_response(...)\" will alter the buffer by throwing away the\nLF character (ie hex 0A). This works fine if the response has an http header (or\nis completely text based). However binary data becomes corrupted during this\nprocess. So it would seem that the HTTP/0.9 protocol is not fully supported by\nmod_proxy."}, {"count": 1, "tags": [], "bug_id": 37025, "is_private": false, "text": "I don't think we have a huge obligation to really support HTTP/0.9 in mod_proxy.\n It is barely still supported in the core, and clients don't exist anymore.", "id": 83300, "time": "2005-12-06T08:06:53Z", "creator": "chip@force-elite.com", "creation_time": "2005-12-06T08:06:53Z", "attachment_id": null}]