[{"count": 0, "tags": [], "creator": "apache@dckd.nl", "attachment_id": null, "is_private": false, "id": 81009, "time": "2005-10-11T22:45:39Z", "bug_id": 37031, "creation_time": "2005-10-11T22:45:39Z", "text": "I have a simple webserver, for which I wanted to add SSL support. So I added mod_ssl, looked at the \nconfiguration.\nI then found a howto, complete with the procedure for generating a (self)signed certificate. But then \ncame the hard part: there was absolutely no documentation whatsoever on how you would add SSL \nsupport for even the simple case of having just one webserver, let alone several virtual domains.\n\nI googled somewhat and vaguely remembered something I did once with Apache 1.3 and made a copy \nof ssl.conf and added my own stuff to it. Of course I also added \"Listen 443\" to the ports.conf and \nfinally I added \"SSLEngine On\" after the check that everything was correct.\n\nI immediately found the following error message in my error.log:\n\n    Illegal attempt to re-initialise SSL for server (theoretically shouldn't happen!)\n\nThe last addition drew most of my attention, because it was very much possible what I was doing and in \nmy mind not very stupid either. I googled for it, but I didn't come up with much.\n\nI finally tried to disable \"SSLEngine On\", leaving the rest of the configuration in and that worked, httpd \nwas even listening on port 443 (plain text, but still).\n\nAfter a couple of days of letting this sink in, I finally came up with the solution, googled for the \nconfiguration of virtual hosts and got it to work by changing the configuration by using a virtual host \nfor SSL.\n\nConclusion:\nThe error message is vague at best and the addition between parenthesis should be deleted \nimmediately. It is very much possible to make this to happen and only makes the user feel stupid.\n\nAnd it would also be nice if there was some really simple example configuration for how to configure \nSSL. (And perhaps add the error message to the FAQ as well, because there's not a lot of google hits for \nit that provide useful feedback)."}, {"count": 1, "tags": [], "bug_id": 37031, "text": "I thorougly concur with all that Jeroen  Jeroen van der Ham has said.  I wasted\nwell over two days trying to find the solution to this problem.  His post at\nhttp://www.je-ju.net/~jeroen/blog/2005/10/11/theoretically-impossible-solution/http://www.je-ju.net/~jeroen/blog/2005/10/11/theoretically-impossible-solution/\nwas especially useful.\n\nI don't know how such a basic problem could not have been rectified and properly\ndocumented before now.\n\nOf course, having said that, the whole world including myself, is indebted to\nthe Apache project for their otherewise generally excellent work.\n\nCan I suggest that the documentation for the SSLEngine directive be changed to\ninclude the warning :\n\nBe warned: If the server is to listen to more than one port per IP address,\ntypically port 80 and port 443, where both http and https protocols are to be\nserved, the directive must be placed within a VirtualHost stanza (one, at most,\nfor each IP address) for the https protocol.  If not, the apache server will\ncrash with a message similar to : \"Illegal attempt to re-initialise SSL for\nserver\".  This is because the apache server will attempt to initialise the SSL\nengine for each of the two ports.  Be sure to specify the port number, typically\n443, in both the VirtualHost and NameVirtualHost directives.\n\nAlso, feel welcome to copy the docuementation for the SSLEngine directive,\nmodified to include the above, from :\nhttp://www.notunnels.org/ssl-headaches/SSLEngine-xml.txt", "id": 85796, "time": "2006-02-15T05:03:23Z", "creator": "jaymz@bigpond.net.au", "creation_time": "2006-02-15T05:03:23Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 37031, "attachment_id": null, "is_private": false, "id": 88935, "time": "2006-05-08T23:22:31Z", "creator": "steve.piner@signify.co.nz", "creation_time": "2006-05-08T23:22:31Z", "text": "This message also occurs when \"SSLEngine on\" is in the server config, but not \nspecified in VirtualHost sections.\n"}, {"count": 3, "tags": [], "bug_id": 37031, "attachment_id": null, "is_private": false, "id": 91426, "time": "2006-07-20T08:30:40Z", "creator": "apache@dckd.nl", "creation_time": "2006-07-20T08:30:40Z", "text": "Please please, pretty please, someone take the 5 minute effort of changing this\nerror message and adding the above text to the documentation?\n\nThe documentation really should contain a how-to for configuring both HTTP and\nHTTPS on an apache server, because I believe that is how it is typically used."}, {"count": 4, "tags": [], "bug_id": 37031, "attachment_id": null, "is_private": false, "id": 91440, "time": "2006-07-20T17:31:14Z", "creator": "wrowe@apache.org", "creation_time": "2006-07-20T17:31:14Z", "text": "I've reclassed this bug to hopefully put it on the partys' radar."}, {"count": 5, "tags": [], "bug_id": 37031, "attachment_id": null, "is_private": false, "id": 141168, "time": "2010-10-29T11:04:49Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-29T11:04:49Z", "text": "Moving docs bugs to docs@httpd.a.o ownership."}, {"count": 6, "tags": [], "bug_id": 37031, "text": "Error message improved in r1031057\n\nAs far as I can tell, this happens pretty consistently when SSLEngine On is in the wrong scope - ie, in global rather than virtualhost scope.\n\nShould make a \"don't do that\" remark in the docs, as well.", "id": 141411, "time": "2010-11-04T12:17:31Z", "creator": "rbowen@apache.org", "creation_time": "2010-11-04T12:17:31Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "is_private": false, "id": 141413, "time": "2010-11-04T12:39:31Z", "bug_id": 37031, "creation_time": "2010-11-04T12:39:31Z", "text": "I've updated the documentation in trunk and 2.2 to say that you should put this in the VirtualHost rather than the main scope. I've improved the error message itself in trunk, and proposed the same patch for 2.2.\n\nMeanwhile, I'm going to mark this closed, since the documentation aspect of it has been addressed."}]