[{"count": 0, "tags": [], "bug_id": 37062, "is_private": false, "text": "The JasperException that is thrown whenever an exception is thrown either directly on a JSP or by code \ninvoked directly or indirectly from the JSP only ever contains the line number of the line in the \ngenerated java servlet file.  This means that developers have to trawl through the Tomcat working \ndirectory, dig up the generated java file, then compare the generated line against their JSP to figure out \nwhere the error originated from.\n\nSeveral other containers, WebLogic and Resin to mention but two, provide more information; crucially \nthe line number in the JSP and in WebLogic's case a fragment of the JSP showing the error in context.\n\nI have assembled a patch (which I will attach here) that provides similar functionality in Tomcat.  The \ndiff is against SVN as of the date of submitting this bug.  The full modified source files are available for \ndownload at the URL attached to this bug, should the patch be out of date by the time it is processed.\n\nI find this is a huge productivity booster for me, and my post to the Tomcat user mailing list elicited \nreplies asking for the source code *now*.  I hope this can find it's way into the next build(s) of Tomcat.  \nI've tested it against 5.5.9 and 5.5.12, but not the 5.0 releases.", "id": 81075, "time": "2005-10-13T03:40:28Z", "creator": "tfenne@tfenne.com", "creation_time": "2005-10-13T03:40:28Z", "attachment_id": null}, {"count": 1, "attachment_id": 16679, "bug_id": 37062, "text": "Created attachment 16679\nPatch file generated against SVN on October 12th 2005\n\nPatch contains modifications to ...jasper.compiler.Compiler.java and\n...jasper.servlet.JspServletWrapper.java", "id": 81076, "time": "2005-10-13T03:43:08Z", "creator": "tfenne@tfenne.com", "creation_time": "2005-10-13T03:43:08Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 37062, "text": "Tim, this looks like a fantastic enhancement.  Thank you for submitting it and\nall the associated information at http://www.tfenne.com/jasper/.  I've committed\nit into HEAD, it'll be in 5.5.13.", "id": 81210, "time": "2005-10-17T00:08:59Z", "creator": "yoavs@computer.org", "creation_time": "2005-10-17T00:08:59Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 81226, "time": "2005-10-17T01:32:56Z", "bug_id": 37062, "creation_time": "2005-10-17T01:32:56Z", "text": "Most people likely use development mode in production. This could lead to memory\ntrouble :("}, {"count": 4, "tags": [], "bug_id": 37062, "attachment_id": null, "text": "The new line numbering information is helpful but it looks like post 5.5.13,\nafter this change has gone in, the root cause exception is wrapped in an\nadditional layer, making it difficult to catch with settings in the web.xml like\n\n    <error-page>\n      <exception-type>javax.persistence.EntityNotFoundException</exception-type>\n      <location>/errors/404.jsp</location>\n    </error-page>\n\nThat config works in 5.5.12 and earlier, but with 5.5.13+ with development mode,\nthe exception appears to be wrapped one layer thicker (once in the generated\ntags code, and once in the ServletWrapper) so that the error-page behavior breaks.", "id": 87552, "time": "2006-04-04T02:11:15Z", "creator": "jolly.chen@borland.com", "creation_time": "2006-04-04T02:11:15Z", "is_private": false}]