[{"count": 0, "tags": [], "creator": "venkat.thirumal@gmail.com", "attachment_id": null, "id": 81316, "time": "2005-10-18T14:04:42Z", "bug_id": 37141, "creation_time": "2005-10-18T14:04:42Z", "is_private": false, "text": "Hi I am Thirumal,\nWell to be honest I am a rookie and I am still 15 years old. Well I'm pretty \ngood in Php, Html, and Javascript, but I installed your MSI Win 32 on my Windows \n98 Second Edition, The first time it worked properly, but the second time I \nclick on it(Even after Formatting my Disk and Installing New OS) the message \n\"Error 2075. Could'nt Resolve ServerName \" appears on a new MessageBox and Then \nI don't have any choice to click on \"Finish\" and exit the setup; download a new \ncopy and install it. Make your software a bit easier to be accessible. I hope \nthis problem occours if you change the \"Name of the Setup Program\" or \"Folder \nwhere we Keep the Setup Program\". Please help innocents like me to have a \nserver?\nYours Sincerely\nThirumal Venkat"}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "text": "You have TCP/IP installed on the box?  Were you disconnected from the network\nat that time (e.g. using Dialup Networking, without dialing in first)?\n\nIf we fail to resolve servername, we could use your IP address as the server\nname, I'll look at making that adjustment.  In the interim, please add this\nline to to your \\WINDOWS\\System32\\drivers\\etc\\hosts file (if it doesn't exist\nyou can copy the hosts.sam sample file to be named 'hosts'):\n\n123.45.67.89   www.example.com\n\nwhere 123.45.67.89 is your IP address, and www.example.com is whatever you\nwant to call this machine.  ONLY MACHINES WHERE YOU MODIFY 'hosts' WILL KNOW\nTHIS NAME - it's not a substitute for registering the name with a DNS provider.\n\nBut, it's a slick trick for testing.  Please report back if this works.\n \n\n", "id": 81333, "time": "2005-10-18T18:23:35Z", "bug_id": 37141, "creation_time": "2005-10-18T18:23:35Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 37141, "attachment_id": null, "text": "\n  No response, assuming issue is resolved.", "id": 89643, "time": "2006-06-01T06:33:23Z", "creator": "wrowe@apache.org", "creation_time": "2006-06-01T06:33:23Z", "is_private": false}]