[{"count": 0, "tags": [], "creator": "timorhatamy@hotmail.com", "attachment_id": null, "text": "It is about one month that an unknown server frequently calls a non-existing \npage on my server. Eventually, I have blocked that IP in httpd.conf but the \nerror messages are still filling up the server error logs and I have found no \nway to adjust apache to suppress those messages. If this option would exist in \napache server, it would be a very grate help.", "id": 81975, "time": "2005-10-31T08:45:28Z", "bug_id": 37307, "creation_time": "2005-10-31T08:45:28Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 37307, "is_private": false, "id": 81988, "creation_time": "2005-10-31T13:48:48Z", "time": "2005-10-31T13:48:48Z", "creator": "nick@webthing.com", "text": "What are you asking for?  Something like the env=foo argument to CustomLog  \nthat'll suppress Errorlog logging? ", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 37307, "is_private": false, "text": "Exactly that is something I would find useful too. \n\nI know situations where load balancers test http server accessibility using\nprobing requests. In case of https it is not uncommon, that they don't really do\na full SSL handshake and as a result you get an entry in the error_log and\nssl_engine_log every time the load balancer probes.\n\nenv=foo for Errorlog (and also the SSLlog) would be great.", "id": 82018, "time": "2005-11-01T20:05:27Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2005-11-01T20:05:27Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "sambukkaa@hotmail.com", "text": "The idea is very simple; Apache has only 8 directives for error log levels:\ndebug, info, notice, warn, error, crit, alert and emerg.\n\nBut there is no possibility to select only those error messages that we would \nlike to gather.\nFoe example, I would be interested of only some specific notification [notice] \nmessages and some from [warn] group.\nEach time I have a server crash, I open the server error log file and after \nhundreds of times reading the same line like \"Disabled use of AcceptEx() \nWinSock2 API\" I start to swear on my fathers grave that I know that I have \ndisabled the use of \"AcceptEx() WinSock2 API\" in the httpd.conf file and I \nwould very much like to choke that output! :(((\n", "id": 84551, "time": "2006-01-12T18:16:43Z", "bug_id": 37307, "creation_time": "2006-01-12T18:16:43Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 37307, "is_private": false, "text": "It would seem to me that the only way to be able to do this would be to create a new directive \"SuppressErrorLogMatching\" that accepts a regular expression and then check the log messages in a lower level function like log_error_core.\n\nI would be happy to write a patch to accomplish this, but I would like input from the devs as to the feasibility.\n\n1. Add to the conf: SuppressErrorLogMatching \"Disabled use of AcceptEx\"\n2. Allow multiple occurrences of this directive?\n3. In the startup, compile the regular expression to ensure validity and add the ap_regex_t struct to an array or as a single item (depending on whether we should allow multiple occurrences)\n4. During every call to log_error_core, check the regex against the log message and return immediately if it matches\n\nWhile it's all I can come up with to suit the request, I have concerns about the approach. This could easily increase load depending on the level and amount of logging. Although we would be dealing with a compiled regex, we still have to spend the time to know if it matches - adding those cycles to all log messages in debug level with something like mod_ssl dumping data would be rather nasty to do.", "id": 135775, "time": "2010-03-29T20:35:47Z", "creator": "DRuggeri@primary.net", "creation_time": "2010-03-29T20:35:47Z", "attachment_id": null}]