[{"count": 0, "tags": [], "text": "I have a custom context classloader that worked with any Tomcat 4 and 5\nversions, excepted 5.5.12.\nWith Tomcat 5.5.12, my loader can't find classes from Tomcat jar files (jar\nfiles from /common/lib).\nThe problem is that custom loader's constructor receive an instance of\nAppClassloader (it looks like it is the 'System' classloader). Previously\nloader's constructor received an instance of StandardClassloader (which should\nbe the 'Common' classloader)\n\nI found the following change in Tomcat 5.5.12 compared to Tomcat 5.5.9 : in\nTomcat 5.5.9 'addRuleInstances' method in 'ContextRuleSet' class contained the\nfollowing line :\n digester.addRule(prefix + \"Context\",\n                         new CopyParentClassLoaderRule());\n\nIn Tomcat 5.5.12, this line was removed. \n\nReintegrting this line solve my problem. Maybe this removal was done on purpose\nbut I didn't find any explanation for it.\n\nBruno", "attachment_id": null, "id": 81927, "creator": "leroux_bruno@yahoo.fr", "time": "2005-10-29T14:07:51Z", "bug_id": 37302, "creation_time": "2005-10-29T14:07:51Z", "is_private": false}, {"count": 1, "tags": [], "text": "This rule is useless.", "attachment_id": null, "bug_id": 37302, "id": 81929, "time": "2005-10-29T23:16:51Z", "creator": "remm@apache.org", "creation_time": "2005-10-29T23:16:51Z", "is_private": false}, {"count": 2, "tags": [], "text": "(In reply to comment #1)\n> This rule is useless.\n\nI don't like to reopen a bug, but for me this is a regression issue that needs\nsome explanations. Maybe this rule is useless, but as I wrote in my previous\ndescription, reintroducing this rule fix the problem.\n\nI did the a test to see if the problem is the same with the default Loader. \nI added these lines in server.xml :\n<Context path=\"/servlets-examples\" docBase=\"C:\\TEMP\\servlets-examples\" >\n\t<Loader className=\"org.apache.catalina.loader.WebappLoader\" />\n</Context>\n\nThis fails in Tomcat 5.5.12 and works in Tomcat 5.5.9.\nThank you to do this test, it takes only a few minutes. \n\nBruno", "attachment_id": null, "id": 81936, "creator": "leroux_bruno@yahoo.fr", "time": "2005-10-30T21:40:32Z", "bug_id": 37302, "creation_time": "2005-10-30T21:40:32Z", "is_private": false}, {"count": 3, "tags": [], "text": "I did some more testings, the problem happens when the context definition is in\nserver.xml, if the context definition is in its own individual file it works.\n\nSo there are two solutions to fix this regression :\n- fix the bug by reintroducing the rule or finding another technical solution.\n- update the documentation by changing this sentence \"Please note that for\ntomcat 5, unlike tomcat 4.x, it is NOT recommended to place <Context> elements\ndirectly in the server.xml file\" by \"Please note that for tomcat 5.5, unlike\ntomcat 4.x, it is NOT SUPPORTED to place <Context> elements directly in the\nserver.xml file\"\n\n\nAs written in the changelog this removal was based on the feelings that this\nrule was useless and that \"maybe it used to be useful\", so yes it was very\nuseful before Tomcat 5, when defining context in server.xml was the recommended way.\n>------------------------------------------------------------------------\n>r303856 | remm | 2005-04-15 01:58:46 -0700 (Fri, 15 Apr 2005) | 4 lines\n>- I don't see the purpose of the copy CL rule, as\n>ContainerBase.getParentClassLoader will return the parent class loader anyway.\n>If a custom parent is set, the rule will dumbly override it, thus it seems it\n>never serves a useful purpose. Maybe it used to be useful.\n\nBruno", "attachment_id": null, "id": 81999, "creator": "leroux_bruno@yahoo.fr", "time": "2005-10-31T20:46:44Z", "bug_id": 37302, "creation_time": "2005-10-31T20:46:44Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 37302, "attachment_id": null, "id": 88308, "time": "2006-04-20T07:46:41Z", "creator": "michaelpub@gmail.com", "creation_time": "2006-04-20T07:46:41Z", "is_private": false, "text": "We too had this problem and I spent a few days trying to figure it out.  We have\none project using 5.5.9 and it worked fine.  So we used their same environment\nbut with Tomcat 5.5.16 and was having problems.  I ended up downloading all the\ntomcat versions from 5.5.9 to 5.5.17 to find out what was causing the problem.\n\nWhen going form 5.5.x to 5.5.y, one would expect minor changes and bug fixes\nonly.  Perhaps it's just a confusion about the versioning system, but I believe\nsuch a minor increment should not have regression issues.\n\nI vote to add the rule back, and to make the change for the next major version,\n5.6 or 6.0 or whatever.  I could understand if the rule was removed because it\nwas causing problems, but to remove it simply because it was thought to be\nuseless is a bit careless, especially now with evidence to the contrary.\n\n-Michael"}, {"count": 5, "tags": [], "creator": "gary.hirschhorn@fetch.com", "attachment_id": null, "id": 88418, "time": "2006-04-24T10:46:19Z", "bug_id": 37302, "creation_time": "2006-04-24T10:46:19Z", "is_private": false, "text": "I also agree that this change should either be reverted (my preference) or the\ndocumentation for the Loader element changed. We had a working Tomcat\napplication (using a custom classloader) that unexpectedly broke when migrating\nfrom 5.0 to 5.5.16.  It took me several frustrating hours to track it down. \n\nFor anyone else following this issue, there are at least two other related bugs:\nASF Bugzilla Bug 37054, ASF Bugzilla Bug 37302."}, {"count": 6, "tags": [], "text": "Sorry, one of the related bugs in my last comment pointed back to this one. The\nrelated bugs are: ASF Bugzilla Bug 37054, ASF Bugzilla Bug 38877.", "attachment_id": null, "id": 88419, "creator": "gary.hirschhorn@fetch.com", "time": "2006-04-24T10:53:11Z", "bug_id": 37302, "creation_time": "2006-04-24T10:53:11Z", "is_private": false}, {"count": 7, "text": "\n\n*** This bug has been marked as a duplicate of 37054 ***", "bug_id": 37302, "attachment_id": null, "id": 88431, "time": "2006-04-24T13:52:52Z", "creator": "remm@apache.org", "creation_time": "2006-04-24T13:52:52Z", "tags": [], "is_private": false}]