[{"count": 0, "tags": [], "bug_id": 37328, "attachment_id": null, "text": "Copied from the developer mailing list:\n---------------------------------------\nAll:\n\nI've recently encountered some difficulties with the multithreaded build \nextensions that I've mentioned on the list before. \n\nAs part of the Mantis project that we use to build WAS we have a custom \nlogger. This logger uses a different banner format ([project/target/task]) \nfrom the default logger. The current problem is that the banners on \nmessages from the sub-builds have the wrong context information; \nspecifically they either no context (i.e. the banner is empty) or they \nhave the parent project's context.\n\nI've done a lot of debugging in the past few days and found that the \nparent context bit is due to a bug in our code, so mea culpa there. But \nthe no context bit I traced to some code in oata.taskdefs.Definer. Definer \ncreates an Antlib task instance to load our antlib. Now, creating a \n\"delegate task\" is a fairly common pattern; I do it in Mantis a lot. The \nproblem (as I see it anyway) is that Definer calls \"perform\" instead of \n\"execute\" to make the Antlib instance do its work.  Because \"perform\" is \nused that blows away the currently registered task for the current thread. \nI've overridden Definer locally to call \"execute\" instead of \"perform\" and \nmy problems seem to have cleared up with no side-effects. (Also \ninteresting that this isn't really threading related - it happens even \nwhen everything is running on the main thread.)\n\nSo, getting to the point, is there a general policy regarding \n\"execute\"/\"perform\" for delegate task instances? Based on my experience I \nwould think that \"execute\" would be preferred, so I wasn't sure if \n\"perform\" was required in this instance. I've prepared a patch for \nDefiner, but I didn't want to open a bugzilla report until we had some \ndiscussion here on the list.\n\nCheers,\nJEC\n-- \nJeffrey E. Care (carej@us.ibm.com)\nWebSphere v7 Release Engineer\nWebSphere Build Tooling Lead (Project Mantis)", "id": 82024, "time": "2005-11-02T00:08:07Z", "creator": "carej@us.ibm.com", "creation_time": "2005-11-02T00:08:07Z", "is_private": false}, {"count": 1, "tags": [], "creator": "carej@us.ibm.com", "text": "Created attachment 16850\npatch for Definer", "id": 82025, "attachment_id": 16850, "bug_id": 37328, "creation_time": "2005-11-02T00:12:52Z", "time": "2005-11-02T00:12:52Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 37328, "text": "Your assessment seems correct; perform() calls should be more for \"inner Ant.\"", "id": 82026, "time": "2005-11-02T00:13:34Z", "creator": "mbenson@apache.org", "creation_time": "2005-11-02T00:13:34Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 37328, "is_private": false, "id": 82843, "creation_time": "2005-11-24T17:42:22Z", "time": "2005-11-24T17:42:22Z", "creator": "stevel@apache.org", "text": "OK, I've checked the patch in. let's see how it goes your\nextended-functional-test of our build, Jeffrey ;)\n\n", "attachment_id": null}]