[{"count": 0, "tags": [], "bug_id": 37480, "text": "This issue was reported by Edward Lee via security@apache.org. After private\ndiscussion amongst the Tomcat committers and the original reporter, it was\nagreed that this issue could be made public.\n\nThe original message follows. The attachments will be attached to this bug report.\n\n> Hi,\n> \n> \tIn an audit for log forging issues, we discovered multiple\n> vulnerabilities in Apache Tomcat 5.5.12.  The attached PDF contains\n> further details on these vulnerabilities.  If you feel that any of our\n> findings are in error or would like additional details concerning these\n> vulnerabilities, please feel free to contact me at this email address.  \n> \n> Please let us know if you would like us to follow any protocol that you\n> have in regards to disclosing vulnerabilities to public forums.\n> \n> -Eddie", "id": 82421, "time": "2005-11-12T23:08:28Z", "creator": "markt@apache.org", "creation_time": "2005-11-12T23:08:28Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "Created attachment 16954\nAudit report (PDF)", "id": 82422, "time": "2005-11-12T23:09:42Z", "bug_id": 37480, "creation_time": "2005-11-12T23:09:42Z", "is_private": false, "attachment_id": 16954}, {"count": 2, "attachment_id": null, "bug_id": 37480, "is_private": false, "id": 82423, "time": "2005-11-12T23:16:59Z", "creator": "markt@apache.org", "creation_time": "2005-11-12T23:16:59Z", "tags": [], "text": "Apart from the example webapp, all code paths listed in this report that exhibit\nthis issue require that debug level logging is enabled.\n\nWhether or not to encode debug level log messages is a trade off between a low\nrisk vulnerability - difficult to attack without being spotted(1) and a low\nimpact(2) - and the risk of causing developer issues when reading debug messages\nas well as adding complexity to the logging code.\n\nHaving debugged a fair number of i18n issues in Tomcat, I'd much rather have\nun-encoded log output.\n\n(1) You don't know which debug logging is turned on where and at what level, the\nmessage may get logged by multiple components with different message formats,\nyou need to get the timestamp right etc\n\n(2) Could be used to disguise another attack but in itself does not actually do\nany harm.\n\n\nTherefore, I am changing the component for this issue to the examples webapp."}, {"count": 3, "tags": [], "bug_id": 37480, "text": "Why is this still open?  I thought we decide to leave it be?", "id": 88160, "time": "2006-04-17T15:37:19Z", "creator": "yoavs@computer.org", "creation_time": "2006-04-17T15:37:19Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 37480, "is_private": false, "id": 88167, "time": "2006-04-17T16:21:15Z", "creator": "markt@apache.org", "creation_time": "2006-04-17T16:21:15Z", "tags": [], "text": "I was going to go through the examples webapp and make sure any looging calls\nwere escaped. AFAICR this still needs to be done."}, {"count": 5, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 95437, "time": "2006-11-04T17:29:23Z", "bug_id": 37480, "creation_time": "2006-11-04T17:29:23Z", "text": "Having now reviewed the code in the examples, the only place where user input is\nlogged directly is in the RequestDumperFilter. Given this is a debug tool my\nview, as above, is that it should remain unencoded.\n\nI am therefore resolving this issue as WONTFIX."}]