[{"count": 0, "tags": [], "text": "Hi,\n\nI see some issue in the Tomcat-5.0.28 installables. Unicode(UTF8) is not \nworking consistently in this version: I used the following link to download \ninstallables\n\nhttp://archive.apache.org/dist/tomcat/tomcat-5/v5.0.28/bin/\n\nI used the following meta tag to enable UTF8 in my web app.\n\n<META http-equiv=\"Content-Type\" content=\"text/html;charset=UTF-8\">\n\nScenario 1:\n\nI installed Tomcat on Windows-XP using the executable jakarta-tomcat-\n5.0.28.exe. When I access the web app it is working perfectly. I am able to \nsee chinese fonts as expected.\n\nScenario 2:\n\nI installed Tomcat on Windows-XP by extracting jakarta-tomcat-5.0.28.zip. Now, \nwhen I access the web app UTF8 encoding is not working and the chinese fonts \nare not getting displayed as expected.\n\nScenario 3:\n\nI installed Tomcat on Red Hat Linux 2.1AS/i386 Server by extracing jakarta-\ntomcat-5.0.28.tar.gz. Now, in this scenario also UTF8 encoding is not working \nand the chinese fonts are not getting displayed as expected.\n\nCan I know as why application behaviour is changing based on how I am \ninstalling Tomcat?\n\nIs there any fix available for this? Please let me know.\n\nThanks n Advance\n- Kishore", "is_private": false, "id": 82441, "creator": "chitrala@rediffmail.com", "time": "2005-11-14T11:18:37Z", "bug_id": 37487, "creation_time": "2005-11-14T11:18:37Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 37487, "attachment_id": null, "id": 82485, "time": "2005-11-14T19:48:22Z", "creator": "markt@apache.org", "creation_time": "2005-11-14T19:48:22Z", "is_private": false, "text": "META tags are not how you enable UTF-8 support in a web application.\n\nIt is unexpected that the .zip and .exe installers result in different\nbehaviours but not impossible given that Tomcat gets started differently and the\nenvironment it is running in is different.\n\nDifferent behaviour on a different OS is entirely unsurprising.\n\nYou need to read the JSP and Servlet specs to see how character encoding works.\nIf passing UTF-8 data to Tomcat then you should set the URIEncoding parameter on\nthe connector.\n\nBefore re-opening this bug, I suggest you try the tomcat-user list for help on\nhow to write a web app that uses UTF-8. If you do re-open this report you will\nneed to provide the simplest possible web app (single JSP or servlet) that\ndemonstrates non-spec compliant behaviour. With reference to the spec, you need\nto state what behaviour you expect, what you see, what happens that you do not\nexpect and/or what does not happen that you do expect."}]