[{"count": 0, "tags": [], "creator": "mmc@mortench.net", "attachment_id": null, "id": 5873, "time": "2001-09-21T05:24:55Z", "bug_id": 3763, "creation_time": "2001-09-21T05:24:55Z", "is_private": false, "text": "The current strategy used in CATALINA to handle classpath problems is\nreally annoying when using CATALINA for development in non-trivial \nsituations. I have several libraries inc. a Oracle database driver\nwhich I do not want to copy into CATALINA or to include in my webapp\n(since some of them may be updated and I do not want to keep track of\ndifferent version). \n\nRather I would prefer to be able to simply add a global CATALINA_CLASSPATH \n(e.x. CATALINA_CLASSPATH=%ORACLE_HOME%\\jdbc\\lib\\classes12.zip) AND/OR a webapp \nclasspath in web.xml (i.e. <Context path=\"/frontend\" ... classpath=\"%\nORACLE_HOME%\\jdbc\\lib\\classes12.zip\"/>).\n\nI guess this would involve changing the default startup script AND/OR\nsome DTD etc. Just changing the startup script would help a lot (I have\nhandcode some script changes myself but would like this to be standard)\n\nP.S. I selected unknown under version in this report, but I mean final 4.0 \nrelease (not on list)"}, {"count": 1, "tags": [], "text": "The current behavior was introduced because class path problems cause a *very*\nlarge percentage of difficulties for new users of Tomcat, and these problems\nhave vanished since Tomcat was changed to ignore any previously set CLASSPATH.\n\nGiven this, I am -1 on changing it to do as you propose.  You can always create\nyour own modified copy of \"catalina.bat\" or \"catalina.sh\", but then you are also\non your own for debugging any problems that this causes.\n", "is_private": false, "bug_id": 3763, "id": 5883, "time": "2001-09-21T09:44:35Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-09-21T09:44:35Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 3763, "attachment_id": null, "text": "In response to the response from  Craig McClanahan:\nWell, I understand that CLASSPATH gave some problems which is why\nI proposed an alternative CATALINA_CLASSPATH or setting the path in\nthe web.xml file using a Context/Classpath element.", "id": 5895, "time": "2001-09-21T12:24:20Z", "creator": "mmc@mortench.net", "creation_time": "2001-09-21T12:24:20Z", "is_private": false}, {"count": 3, "tags": [], "text": "MMC, there is a patch attached to bug 3368 \n(http://nagoya.apache.org/bugzilla/show_bug.cgi?id=3368) that you can apply \nprivately (unfortunately, it is slightly out of date) in case the powers that \nbe close it again (they most certainly will).\n\nResponding to the statement about problems having vanished, I am sure we are \ngoing to see \"what's happened to CLASSPATH\", and \"you mean there is no way to \nlocate jars outside Tomcat directory structure\" as people start *using* TC4. It \nis too early to say (to me at least) that the silence means the approach had \nits desired effect. In any case, you can't justify this (again, to me at least) \nby pointing at novice users without providing any way for non-novice users to \nsolve the problem other than patching the code (or writing their own startup \ncode).", "attachment_id": null, "bug_id": 3763, "id": 5896, "time": "2001-09-21T13:33:11Z", "creator": "katkere@praja.com", "creation_time": "2001-09-21T13:33:11Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 3763, "attachment_id": null, "text": "People who understand enough about class paths to keep themselves out of trouble\nare also able to create their own customized versions of the catalina.bat and\ncatalina.sh startup scripts.  I'm sure such enterprising users will also\nmaintain a place where current versions of such a script can be downloaded.\nIt doesn't need to be changed in the standard distribution.\n", "id": 6043, "time": "2001-09-25T19:50:21Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-09-25T19:50:21Z", "is_private": false}]