[{"count": 0, "tags": [], "bug_id": 3776, "is_private": false, "text": "Under Tomcat 3.2, which implemented the JSP 1.1 spec, I could not use certain custom tags within a (custom) include tag. I would get an exception that it is \"Illegal to flush within a custom tag\". I was told that this limitation was removed in the JSP 1.2 spec, so I switched to the Tomcat 4.0 betas. My application worked fine up to and including Tomcat 4.0-b7. Today I switched to the Tomcat 4 final release. I am again getting these same exceptions, which from my understanding should not be occurring. I was able to isolate the issue to the jasper-runtime.jar, which has changed between the two releases. If I replace this jar in Tomcat 4.0 final with the jar from b7, my application works.", "id": 5912, "time": "2001-09-22T13:07:14Z", "creator": "kroll@alltel.net", "creation_time": "2001-09-22T13:07:14Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 3776, "is_private": false, "text": "Without seeing your stack trace, it is impossible to know what the problem is\nfor certain.  However, there was a significant change between 4.0-b7 and 4.0\nfinal that *might* have been related.\n\nThe JavaDocs for the PageContext.include() method include the statement:\n\n    \"The current JspWriter \"out\" for this JSP is flushed\n    as a side effect of this call, prior to processing\n    the include.\"\n\nTomcat 4.0-b7 did not correctly implement this method, because it didn't do the\nflush.  Flushing the response was added in Release Candidate 1 in order to be\ncompliant with the specification requirments.\n\nIf you don't believe that this was the cause of your problem, please reopen this\nbug report - but in order to be able to debug it, you should provide an example\nJSP page that illustrates the problem, plus the stack trace that is generated. \nWithout this, little useful debugging is possible.\n", "id": 6039, "time": "2001-09-25T18:57:25Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-09-25T18:57:25Z", "attachment_id": null}]