[{"count": 0, "attachment_id": null, "bug_id": 3778, "is_private": false, "id": 5916, "time": "2001-09-22T18:50:00Z", "creator": "cdog1977@excite.com", "creation_time": "2001-09-22T18:50:00Z", "tags": [], "text": "Ant currently has the ability to create HTML of the javadoc tags placed\nin our source code.  However, sometimes its also nice to have the source\ncode available on a WEB site as well as the generated API.  Therefore, I am\nrequesting an enhancement that will create fully styled web pages (aka Line \nNumbers, comments in gray, etc..) of source code.  That way the API \ndocumentation is created in html (javadoc) as well as a slew of html \nrepresenting the actual source code.  Our developers can then view what source \ncode was rolled out in each build from their web browswer."}, {"count": 1, "tags": [], "creator": "umagesh@rediffmail.com", "text": "Visit http://home.austin.rr.com/kjohnston/javasrc.htm\n\nThis site hosts an open-source java based \"HTML Cross-Reference Tool\".  I don't \nknow as yet if someday ANT will be shipped with a task like this.  But \nmeanwhile, you can download this tool and from within your build.xml file, you \ncan call it:\n\n<project name=\"demonstration\" basedir=\".\" default=\"srctohtml\">\n    <target name=\"srctohtml\">\n        <java classname=\"javasrc.app.JavaSrc\"\n            args=\"/path/to/your/java/src\"\n            classpath=\"/javasrc/bin/javasrc.jar:/javasrc/bin/antlr.jar\"\n        />\n    </target>\n</project>\n\nIf ant-dev is interested in making an 'antified' version of this tool, here\nis something that the author has to say:\n\n\"I've included the source, so feel free to improve upon it, fix any bugs you \nfind, etc. If you decide to redistributed a derived work, I do ask that you \nnote at least somewhere in your documentation where the original came from, \njust as I've given credit to ANTLR and the Java Cross-Reference Tool.\"\n\nThanks,\nMagesh", "id": 5941, "time": "2001-09-23T17:32:24Z", "bug_id": 3778, "creation_time": "2001-09-23T17:32:24Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "steve_l@iseran.com", "is_private": false, "text": "Also check out doxygen, from http://www.doxygen.org/. This is a native exe for \nwindows and unix which handles javadoc comments in java, C, C++ and IDL. It \nthen generates manual pages hyperlinked with the documentation, and can pump \nout html, rtf, latex, even PDF (sort of). This makes it very slick indeed.\n\nBeing a native binary you can call it using <exec>; adding a wrapper task \ndefinition to do that would not take you that long (hint hint), which could \nthen be incorporated into the ant source.", "id": 5942, "time": "2001-09-23T18:32:52Z", "bug_id": 3778, "creation_time": "2001-09-23T18:32:52Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "sbailliez@apache.org", "text": "I'm not sure this feature will be of interest for Ant. This is a rather limited \nfeature for a build and there are many tools like this available on the web, \nthat would be difficult to select one and that would not be clever to create \nanother one.\n\nIt is rather straightforward to call your favorite Java2HTML converter from a \nbuild file or authors can themselves choose to code an Ant task for their own \ntool.\n\nAlternatively you can check http://www.java2html.com/, this is the tool used by \nSun for displaying the Pet Store code.\n\nIt would not be correct to set this RFE to 'fixed' therefore I'm setting it \nas 'invalid' for the reasons above.\n", "id": 7234, "time": "2001-10-28T14:04:20Z", "bug_id": 3778, "creation_time": "2001-10-28T14:04:20Z", "is_private": false, "attachment_id": null}]