[{"count": 0, "tags": [], "bug_id": 37834, "text": "the compressibleMimeTypes option for the Http Connector is buggy in that it only\nallows you to add mime types to the default list, but does not allow you to\noverride the whole list ( remove default ones ).\n\nSo even if I set compressibleMimetypes = \"one/type\" the connector would behave\nas if I had used \"text/html,text/xml,text/plain,one/type\".\n\nThe problem lies in Http11Processor prefilling the compressibleMimeTypes array\nwith the defaults, and the setCompressibleMimeTypes method not remove them, but\nadd them.\n\nPossible solutions:\n1) Have that array default empty.  This can work because the parent/using class,\nHttp11Protocol already has the mimetypes within its defaults.\n2) Have setCompressibleMimeTypes method empty out the array, as probably expected.\n\n\nBackground:\nHttp Compression is a HUGE win for production environments.  But there is a bug\nin IE's handling, that causes it to not decompress content when plugins (flash)\nask for it.  So those plugins (flash) are stuck with unexpectedly compressed\ncontent, bringing your web application to malfunction.\n\nOur hope was to turn off compression only for our xml files, so that our flash\napplication could download them appropriately.", "id": 83406, "attachment_id": null, "creator": "fern@alum.mit.edu", "creation_time": "2005-12-08T05:27:48Z", "time": "2005-12-08T05:27:48Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 37834, "attachment_id": null, "id": 87999, "time": "2006-04-13T20:58:06Z", "creator": "yoavs@computer.org", "creation_time": "2006-04-13T20:58:06Z", "is_private": false, "text": "Mmmm, you're absolutely right that setCompressibleMimeTypes should reset the\narray to whatever argument is provided, not append the argument to pre-existing\ntypes.  But changing this now would be a possible regression for a lot of users\n;(  Not sure what to do, deferring handling for now."}, {"count": 2, "tags": [], "bug_id": 37834, "text": "Marking this as a dup as the newer bug has a patch.\n\n*** This bug has been marked as a duplicate of 43191 ***", "id": 107380, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2007-08-29T04:48:14Z", "time": "2007-08-29T04:48:14Z", "is_private": false}]