[{"count": 0, "tags": [], "bug_id": 37854, "text": "Using Extension-List in MANIFEST.MF jar files allows to specify dependencies  \nbetween libraries or webapps.  \n  \nWhen a jar depends on an Extension without specifying an  \nImplementation-Vendor-Id AND the corresponding extension does not specify an  \nImplementation-Vendor-Id, tomcat fails loading the corresponding context  \nclaiming for a missing dependency.  \n  \nI thing that in this case (no Implementation-Vendor-Id in either files) the  \nImplementation-Vendor-Id's must be considered OK and that it must not be  \nenought to consider the dependency broken.", "id": 83484, "time": "2005-12-09T18:13:38Z", "creator": "pgrange@cvf.fr", "creation_time": "2005-12-09T18:13:38Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 37854, "attachment_id": null, "text": "Do you have a reference for a relevant speicifcation that requires the behaviour\nyou describe? I can't find one. I am leaning towards your interpretation but I\nwould like to see a proper definition of the required behaviour.", "id": 83773, "time": "2005-12-18T17:47:33Z", "creator": "markt@apache.org", "creation_time": "2005-12-18T17:47:33Z", "is_private": false}, {"count": 2, "text": "The servlet spec v.2.3 p. 63 just makes a reference to the manifest spec \nspecifying that the web container must reject the app and display an \ninformative message if it can not satisfy a dependency. \n \nOn the other hand, the manifest spec \n(http://java.sun.com/j2se/1.3/docs/guide/extensions/versioning.html) specifies \nthe behavior of the Java plugin. Since the servlet specification makes a direct \nreference to this manifest specification, I think we can consider that this \nbehavior also applies to web containers. It specifies that : \n \n<extension>-Specification-Version \n<extension>-Implementation-Version \n<extension>-Implementation-Vendor-Id \n \nare all *OPTIONAL* in a manifest that indicate a dependency to <extension>. \nMoreover, still in manifest specification : \n \n\"If the applet's manifest doesn't contain one or more of the optional \nattributes, the plug-in will accept any value of the corresponding attribute in \nthe optional package's manifest.\" \n \nI suppose that \"any value\" also include no value. \n \nHope it helps. ", "bug_id": 37854, "is_private": false, "id": 83879, "time": "2005-12-21T11:03:46Z", "creator": "pgrange@cvf.fr", "creation_time": "2005-12-21T11:03:46Z", "tags": [], "attachment_id": null}, {"count": 3, "text": "The attributes are optional for the plugin manifest but the same reference also\nstates:\n\n\"Note that all of the above manifest attributes should be included in an\noptional package's manifest.\"\n\nThe key word here is \"should\". If it was \"must\", the current Tomcat behaviour\nwould be fine. Nothing states explicity what the desired behaviour is if the\noptional package's manifest does not include one of the attributes.\n\nYour interpretation is a sensible one but hinges on the assumption that \"any\nvalue\" is the same as \"no value\". I want to think about this for a little while\nbefore I make any changes. Watch this space...", "bug_id": 37854, "is_private": false, "id": 83897, "time": "2005-12-21T23:57:45Z", "creator": "markt@apache.org", "creation_time": "2005-12-21T23:57:45Z", "tags": [], "attachment_id": null}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 84097, "time": "2005-12-31T15:10:35Z", "bug_id": 37854, "creation_time": "2005-12-31T15:10:35Z", "text": "This and some related issues have been fixed in TC4 and TC5."}]