[{"count": 0, "tags": [], "bug_id": 37897, "text": "I am using <ftp> with depends=yes to transfer only changed files from my\ndevelopment machine to my server.  Both machines are on a local 100MB network.\nBoth machines are pretty fast. One is a windows XP P4 3.0 Ghz 2GB mem and\nthe other is a Solaris 9 2 cpu 4GB mem machine.\n\nIn the example below, I have 225 files in web/html/jsp.\nIf I modify a single file, and then run this ant task, it takes\n52 seconds to complete the operation.  The file transfer of that\none file takes less than 1 second if I do it manually using ftp\ncommand in the command shell. So, I assume the rest of the time\nis spent checking the timestamps of the files on the server side.\n\n\nI am guessing tha the <ftp> is making individual requests for each\nfile to check it's timestamp on the server side?  \nIs there anyway this could be condensed into a single call?\nIf I run ftp manually in the command shell, If I do \"dir\" it will\nprint out all the files with their timestamps. \nWhy can't <ftp> do something similar?\n\nI was expecting this operation to take about 2 seconds instead of\nthe 52 seconds it is currently taking.\n\n\n<ftp server=\"${SERVER_NAME}\"\n     userid=\"${SERVER_USER}\" password=\"${SERVER_PASSWORD}\"\n     remotedir=\"/usr/pronto/web/html/jsp\"\n     depends=\"yes\"\n     verbose=\"yes\">\n     <fileset dir=\"${TOP}/web/html/jsp\">\n        <include name=\"*.jsp\"/>\n        <include name=\"*.jspf\"/>\n     </fileset>\n</ftp>", "id": 83628, "time": "2005-12-14T04:45:35Z", "creator": "y3x1-wwm9@spamex.com", "creation_time": "2005-12-14T04:45:35Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 37897, "text": "Some clarification in case you aren't familiar with the \"depends=yes\" option.\nThe first time you run the example above, it will ftp all 224 files in\nweb/html/jsp. But after that, it will only ftp only those files which have changed.\n\nActually, the initial invocation takes even longer because it looks like <ftp>\ntask is creating a new connection to transfer each file because it takes a long\ntime to transfer the files.   I'm not as concerned about that, though, because\nthis happens only the first time you run the task.\n\n", "id": 83629, "time": "2005-12-14T04:54:33Z", "creator": "y3x1-wwm9@spamex.com", "creation_time": "2005-12-14T04:54:33Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 37897, "attachment_id": null, "text": "I was taking a look at FTP.java task source code\n\nhttp://svn.apache.org/viewcvs.cgi/ant/core/trunk/src/main/org/apache/tools/ant/taskdefs/optional/net/FTP.java?rev=278420&view=log\n\nThe problem looks like as I expected. sendFile() calls isUpToDate() which makes\ncalls ftp.listFiles(remoteFile);\n\nSo, if I have 224 files in the remote directory, there will be 224 ftp\ntransactions to test the timestamps.  This is why it is so slow.  I change one\nfile, and then execute my ftp task to ftp it, but instead of taking 1 second\nit takes 50 seconds because it is doing 224 ftp.listFiles() and one\nftp.storeFile(). This could be optimized to do only one ftp.listFiles() and one\nftp.storeFile().\n\nIt looks like to optimize this, you need to look at the path selectors,e.g.\n/usr/pronto/web/html/jsp/*.jsp, and do a listFiles() for the entire directory\n\"/usr/pronto/web/html/jsp\", or is it possible to get the list of files, and then\nmake a single listFiles() request on only the jsp files in /usr/pronto/web/html/jsp?\n\nI'm not familiar with the apache commons net library.", "id": 84318, "time": "2006-01-07T02:17:40Z", "creator": "y3x1-wwm9@spamex.com", "creation_time": "2006-01-07T02:17:40Z", "is_private": false}, {"count": 3, "text": "I checked out the commons net javadoc\nhttp://jakarta.apache.org/commons/net/apidocs/org/apache/commons/net/ftp/FTPClient.html\n\nIt says you can get a list of files (w/ timestamps) for a whole directory:\n  FTPFile[] files = listFiles(directory);\n\nIt recommends against putting wildcards in the directory name; It says the\nserver may or may not support it. Any ftp server I have used in recent memory\nsuports basic file globbing, so I'm not sure if this is a real problem or not.\n\nIdeally you would want to do\n\nFTPFile[] files = ftp.listFiles(\"/usr/pronto/web/html/jsp/*.jsp\");\n\nrather than listing all the files in the directory with\n\nFTPFile[] files = ftp.listFiles(\"/usr/pronto/web/html/jsp\");\nbecause the latter would make the ftp task slower in the case were there\nis only a few files which match in a directory which has lots of files.\n\nIn my case, I have 224 JSP files in /usr/pronto/web/html/jsp, and no\nother files.\n\n\nThe main complication is that Ant's path selectors are so powerful, it would be\nhard to handle all the cases.  \n\nOne thought I had was to go ahead and let the current code create the list of\nfiles to be transfered from the path selectors.  Then, examine all the files and\nfind all the unique directory names.   Then, if \"depends=yes\" has been set, we\ncould go ahead and do a ftp.listFiles() on each of the directories, and manually\nthrow away and FTPFiles which don't match one of the files to be transferred;\nthe FTPFIles which match our list of files are kept around in a hash table map.\nThen when sendFile() calls isItUpToDate(), we can refer to the  FTPFiles lookup\ntable.\n\nIn some situations, this might be slower, but I think it many of the use cases,\nthis will speed things up dramatically.\n\nIn my case, the ftp task will probably take 1 or 2 seconds whereas it is taking\n50 seconds right now.", "creator": "y3x1-wwm9@spamex.com", "is_private": false, "id": 84319, "time": "2006-01-07T02:37:24Z", "bug_id": 37897, "creation_time": "2006-01-07T02:37:24Z", "tags": [], "attachment_id": null}, {"count": 4, "text": "After researching this problem, I found a workaround that reduces the problem,\nalthough the behavior is different, and might not work for some use cases.\n\nIf you use the <modified> selector on the fileset, then ant will\nkeep track of changes made to the local copies of the files, and only\nthe modified files will be selected for the ftp transfer.\n\nFor my case, this works just the same as the \"depends=true\" option\nfor the <ftp> task, but the behavior is slightly different.  \"depends\"\noption forces a comparison of the timestamps of the files on the server\nand the files on the local filest, whereas <modified> works only with\nthe local files. There is a potential for a disconnect if the files on\nthe server are reverted to an older version; For example, I am doing\nsoftware development on enterprise web applications. If I reinstall my\nserver with a different version of the software after I have already invoked\nthe <ftp> tasks on my machine; Then the server will not have the updated\njsp, etc. files I am actively working on, and when I run the <ftp> task again,\nthe newer versions will not be transfered because I haven't changed them\nlocally since the server software was reinstalled. \n\nSince I have full control of the server I am ftping the files to, if the above\nsituation happpens, I can just remove the cache.properties file that the\n<modified> selector uses, and then the <ftp> will transfer all files the next\ntime invoked.\n\n<ftp server=\"${SERVER_NAME}\"\n     userid=\"${SERVER_USER}\" password=\"${SERVER_PASSWORD}\"\n     remotedir=\"/usr/pronto/web/html/jsp\"\n     verbose=\"yes\">\n     <fileset dir=\"${TOP}/web/html/jsp\">\n        <include name=\"*.jsp\"/>\n        <include name=\"*.jspf\"/>\n        <modified>\n          <param name=\"cache.cachefile\"\nvalue=\"${TMP_DIR}/ftp-jsp-cache.properties\"/>\n        </modified>\n     </fileset>\n</ftp>\n\nI recommend that the ftp task should include a reference to\nthe <modified> selector. Because I didn't even think to use\nthat until I found a reference to it on the web.\n\nhttp://ant.apache.org/manual/CoreTypes/selectors.html#modified", "creator": "y3x1-wwm9@spamex.com", "is_private": false, "id": 84633, "time": "2006-01-15T03:17:23Z", "bug_id": 37897, "creation_time": "2006-01-15T03:17:23Z", "tags": [], "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 37897, "attachment_id": null, "is_private": false, "id": 84634, "time": "2006-01-15T03:20:52Z", "creator": "y3x1-wwm9@spamex.com", "creation_time": "2006-01-15T03:20:52Z", "text": "I forgot to mention that with the <modified> selector, my <ftp> tasks now takes\n13 seconds instead of 50 seconds to scan 224 files, and then transfer 1 changed\nfile.\n\nWith the <modified> selector, there doesn't appear to be an option to just\ncompare the timestamps of the files. That would be faster than generating MD5\ndigests.\n\nAnyway, I still would like to see the \"depends=true\" be optimized since it still\npreferable because it ensures the server has the newest files whereas using the\n<modified> selector doesn't guarantee anything about the client version of the\nfiles versus the server version of the files because <modified> only tracks the\nclient version of the files."}, {"count": 6, "tags": [], "creator": "stevel@apache.org", "attachment_id": null, "text": "If you just want to compare file timestamps and not contents, then\n\n<different ignoreContents=\"true\" /> should do the work; you could also fiddle\nwith the granularity attribute to deal with clock skew. I think different will\nalso look at file length, so if your ftp is doing text conversion, it will\nalways view the remote files as different.", "id": 84654, "time": "2006-01-16T11:15:56Z", "bug_id": 37897, "creation_time": "2006-01-16T11:15:56Z", "is_private": false}]