[{"count": 0, "tags": [], "creator": "kensnooker@yahoo.com", "attachment_id": null, "is_private": false, "id": 83646, "time": "2005-12-14T14:28:17Z", "bug_id": 37906, "creation_time": "2005-12-14T14:28:17Z", "text": "if I create a page with no margins or padding and have a block with text this\ncorrectly appears butted up to the left.\n\nif I create a table after that text again with the table having 0 margins or\npadding it is also butted to the left.\n\nhowever when I set the margin-left of the block to 10pt the text moves out by\n10pt while the left of the table moves out double that.\n\nit is always double, this is also the case if margin-left of the table.\n\nthis appears to be the case just since version 0.9\n\nit can be currently worked around by putting tables in separate blocks with the\nmargin-left set to half of that of the rest of the page.\n\nKen."}, {"count": 1, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "is_private": false, "id": 83647, "time": "2005-12-14T14:47:17Z", "bug_id": 37906, "creation_time": "2005-12-14T14:47:17Z", "text": "This effect is due to indent inheritance, as I call it. I've documented the\nwhole topic on our Wiki: http://wiki.apache.org/xmlgraphics-fop/IndentInheritance\n\nIn contrast to many commercial implementations we've chosen to closely follow\nthe specification which, unfortunately, may have certain side-effects. The\nspecialist group at the W3C is aware of the issue. There are two solutions here:\n\n1. Spec-conformant solution: margins are mapped to the start-indent and\nend-indent properties. The latter two properties are inherited. If you cross a\nreference area boundary you will the see the effect you describe unless you\nreset start-indent and end-indent to 0. For a table, this can conventiently be\ndone on the table-body, so it fans out to all child elements. For more detail,\nplease see the Wiki page indicated above.\n\n2. Non-spec-conformant solution: I've recently added an option to FOP that lets\nyou activate an alternative set of rules concerning indent inheritance. These\nrules try to mimic the behaviour implemented by some commercial FO\nimplementations. With these rules enabled you don't get the strange side-effect\nas long as you work with margins only because the margins are not automatically\n propagated to the start-indent and end-indent properties. Documentation on how\nto turn this on will be available shortly. I've already written it, but it's not\nyet published. The fix for that is found in FOP Trunk (available via SVN only).\nPlease note that enabling this feature makes FOP behave differently from what\nthe specification says it should do. I've recently asked the W3C SG about their\nupdated opinion on the matter:\nhttp://lists.w3.org/Archives/Public/xsl-editors/2005OctDec/0026.html"}, {"count": 2, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156581, "time": "2012-04-01T13:50:06Z", "bug_id": 37906, "creation_time": "2012-04-01T13:50:06Z", "is_private": false}]