[{"count": 0, "tags": [], "creator": "dtessman@zelestra.com", "attachment_id": null, "id": 83662, "time": "2005-12-14T19:49:44Z", "bug_id": 37913, "creation_time": "2005-12-14T19:49:44Z", "is_private": false, "text": "It appears that when a Set-Cookie: HTTP header is sent from the server to the \nAnt Client during a 302 Moved Temporarily response to a Get core task (or a \nPost optional task) the cookie is not stored within the Ant client. This \nviolates RFC-2109 (sec 4.2.1). The result is that certain security mechanisms, \nsuch as SAML, that rely on HTTP redirection to establish a security context \nfail.\n\nExample:\n<target name=\"restart\" depends=\"init\">\n  <get src=\"https://insecure-bank.org/saml/login?Target=/restart.jsp\" \n    dest=\"results.html\" \n    username=\"1214\";\n    password=\"secret\"/>\n</target>\n\nIf /saml/login establishes the security context and then sends a redirect \nresponse (status code 302) that contains a Set-Cookie and the Location header \n(/restart.jsp).  The Set-Cookie is ignored by Ant and the security context is \nlost."}, {"count": 1, "tags": [], "creator": "BBurgess@tiaa-cref.org", "attachment_id": null, "id": 83663, "time": "2005-12-14T20:13:32Z", "bug_id": 37913, "creation_time": "2005-12-14T20:13:32Z", "is_private": false, "text": "The get task in Ant was never built to be a \"client\" (its not a browser) - it\njust implements the HTTP protocol."}, {"count": 2, "tags": [], "bug_id": 37913, "is_private": false, "id": 83664, "creation_time": "2005-12-14T20:42:12Z", "time": "2005-12-14T20:42:12Z", "creator": "dtessman@zelestra.com", "text": "(In reply to comment #1)\n> The get task in Ant was never built to be a \"client\" (its not a browser) - it\n> just implements the HTTP protocol.\nNeither is it a client in that it does not pay us for our services [grin].  \nHowever, when it is performing a \"get\" or \"post\" task, it does perform the \nrole of client. It certainly is not the server in that instance. The point is \nthat it appears, on my system anyway, to break RFC-2109. This will cause \nproblems as more environments move toward a federated security model such as \nSAML. I want to restart a process on my server after I upload new code. The \nrestart is protected using SAML, which requires conformance to the HTTP \nprotocol standard including proper handling of cookies as defined in RFC-2109.\n", "attachment_id": null}, {"count": 3, "tags": [], "creator": "jkf@apache.org", "text": "The GET task in ant uses the standard java interfaces on HTTP.\n\n(URL and HttpURLConnection) according to Sun, cookie management is taken care of.\n(http://forum.java.sun.com/thread.jspa?threadID=452352&tstart=195)\n\nWhen testing against an own server I Can see that firefox returns the cookie on\nthe 302 redirect and the sun implementation doesn't.\n\nAlso, please note cookies are not part of the HTTP/1.1 specification (RFC2616),\ntherefore I'll mark this report as an enhancement request.", "id": 83678, "time": "2005-12-15T00:30:03Z", "bug_id": 37913, "creation_time": "2005-12-15T00:30:03Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 37913, "attachment_id": null, "text": "I'm using JMeter to test Moodle (open source PHP app) - it gives a 302 redirect when you successfully post to the login page, so this bug destroys the login session.  It's never a problem for any web browsers.  I'm working around it by not following the redirect, instead using a separate request to go to the redirect page.", "id": 123864, "time": "2009-01-08T05:52:52Z", "creator": "ashley@netspot.com.au", "creation_time": "2009-01-08T05:52:52Z", "is_private": false}]