[{"count": 0, "text": "Substantial changes were made to the public API of the SyslogAppender on\n2004-11-29 (rev 310971) with the comment \"Checnhes to make SyslogAppender RFC\n3164 compatible\" (sic).  There appear to be no discussion of the changes around\nthe time of the commit, but the following messages may be related to the\nchanges, but do not appear to be the direct source of the changes:\n\nRFC Complient SyslogAppender, 2003-03-17\nhttp://marc.theaimsgroup.com/?l=log4j-dev&m=104788203427770&w=2\n\nSysLog and SysLog-ng daemon on Solaris, 2003-03-12\nhttp://marc.theaimsgroup.com/?l=log4j-dev&m=104747156207068&w=2\n\nOther messages in the archives contain contributions of a JNI-based\nSyslogAppender and charset encoding support, but those are outside the scope of\nthis bug, but may be desirable after this bug is complete.\n\nWeb searching on one of the distinct method names in the 1.3 implementation\n(facilityStringToint) did not identify any potential source of the\nimplementation.  Any information on the motivation and rationale of the changes\nwould be appreciated. \n\nThe initial commit on this bug is a test case on the v1_2-branch that tests the\npublic API of the SyslogAppender which eventually will be ported to the HEAD as\nits implementation is modified to be compatible with the 1.2.x API.", "creator": "carnold@apache.org", "is_private": false, "id": 83821, "time": "2005-12-20T03:39:53Z", "bug_id": 37965, "creation_time": "2005-12-20T03:39:53Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "text": "Tests committed on v1_2-branch on revision 357884.", "is_private": false, "bug_id": 37965, "id": 83822, "time": "2005-12-20T03:49:18Z", "creator": "carnold@apache.org", "creation_time": "2005-12-20T03:49:18Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "carnold@apache.org", "is_private": false, "count": 2, "id": 83869, "time": "2005-12-21T02:04:08Z", "bug_id": 37965, "creation_time": "2005-12-21T02:04:08Z", "text": "Rev 358162 adds the SyslogAppenderTest to the test suite and addresses the API changes identified by \nthe clirr target.\n\nThere are several issues with the 1.3 implementation that have not been addressed.  \n\nFirst, I'm uncertain if the 1.3 implementation was functional.  The implementation of activateOptions \ndid not call super.activateOptions() which resulted in any attempted appending to be stopped with \nAppenderSkeleton's check that the appender had been activated.\n\nlog4j 1.2's API had a facilityPrinting property that is now supported but is not referenced in the 1.3 \ncode and no obvious place to add equivalent behavior.\n\nThe 1.3 branch changed the behavior of activateOptions so that a call on an imcompletely configured \nappender would throw an IllegalStateException.  In 1.2, an incomplete configuration would result the \nErrorHandler being called on the first log attempt.  The testAppenderNoHost test was changed so that it \nexpects the 1.3 behavior.\n\nThe unit tests exercise the API as much as possible, but do nothing to check that anything ever made it \nto the syslog in either the 1.2 or 1.3 branches."}]