[{"count": 0, "tags": [], "text": "Negative values for margin-top and space-before attributes of fo:block have no\neffect on the position of text as rendered in PDF format.  FOP seems to ignore\nnegative values for these attributes.  I assume the other margin-bottom, right\nleft, etc. are effected as well.  This was tested using FOP 0.91\n\nI tried to find out if the XSL-FO specs allow negative values here, but I didn't\ndiscover an answer.  Negative values work in XEP, however, and are pretty darn\nuseful.  I tried to work around this by moving the fo:block with the top\ncoordinate property, but that didn't work with FOP or XEP.", "attachment_id": null, "id": 84019, "creation_time": "2005-12-27T20:11:30Z", "time": "2005-12-27T20:11:30Z", "creator": "laklare@ml1.net", "bug_id": 38054, "is_private": false}, {"count": 1, "tags": [], "text": "Would you please attach an example that shows the effect that you describe? My\nsuspicion is that you don't take space conditionality into account. Please note\nthat the .conditionality part of space-before/space-after defaults to discard.\nAnd if a space-before occurs at the beginning of a document (i.e. starting a\nreference area) it may be discarded if it is conditional. AFAIK, XEP may have\nsome issues here. For more details, please see the XSL-FO specification at\nhttp://www.w3.org/TR/xsl/slice4.html#area-space.\n\nmargin-top is a different beast. It is mapped to space-before and the\n.conditionality component is set to retain (5.3.2 in the spec) so it shouldn't\nbe discarded. On the other side, we do have tests that verify that negative\nvalues are properly handled. A short test shows me that everything is working as\nexpected. So please do provide a test file.", "attachment_id": null, "id": 84147, "creation_time": "2006-01-03T10:00:18Z", "time": "2006-01-03T10:00:18Z", "creator": "jeremias@apache.org", "bug_id": 38054, "is_private": false}, {"count": 2, "tags": [], "creator": "laklare@ml1.net", "attachment_id": 17355, "id": 84310, "time": "2006-01-06T19:34:43Z", "bug_id": 38054, "creation_time": "2006-01-06T19:34:43Z", "is_private": false, "text": "Created attachment 17355\ndemonstrates how negative space-before values are ignored\n\nThis test case shows two problems:\n1) negative space-before values are ignored when the preceding block has\nspan=all in a 2 column region.\n\n2) negative space-before values work without span=all on the block before, but\nthen there are some quirks with how the text is printed in the PDF (see XML\ncomments)"}, {"count": 3, "tags": [], "text": "Matt, I've had a look at your test case. I must say that I can't determine with\n100% confidence what you're trying to show. I've found one problem with your\ntest case: Running your test case unmodified causes the span=\"all\" block to be\nignored. The problem here is that the negative space-before is larger than the\npositive height by the height of the single line of text and the space-after\nadded together (-18pt + 12pt + 2.5pt = -3.5pt). There is some code in the area\ntree that causes a span area with a negative height to be removed. This seems\nwrong. I'm going to change that.\n\nAs for the other cases you describe, I can't reproduce them. A negative\nspace-before with conditionality=\"retain\" on a block after a block with\nspan=\"all\" works just fine (your point 1). On your point 2, I can only say that\nyour test case is a little weird, since the lines \"HeaderText1\" etc. have a huge\nstart-indent. Your text in the first block is indeed balanced to two columns\n(which is correct). HeaderText lines 3 to 6 are not visible as they have a\nstart-indent that places them outside the main reference area (even outside the\npage) for the second column.\n\nI'd like to suggest you revise your test case again, maybe try to simplify it.\nWhat's often helpful to determine problems is using background-color on\nregion-body and blocks to see which area is taken up exactly by the various\nelements. Also, set overflow to \"visible\" while looking for problems. As an\nadvanced means you can have a look at the output of the area tree XML output\n(-at on the command-line). It can give you an indicator whether some parts have\nbeen ignored/discarded or if they are painted but offset so they are not visible.", "attachment_id": null, "id": 84352, "creation_time": "2006-01-09T10:17:08Z", "time": "2006-01-09T10:17:08Z", "creator": "jeremias@apache.org", "bug_id": 38054, "is_private": false}, {"count": 4, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "id": 84353, "time": "2006-01-09T11:19:28Z", "bug_id": 38054, "creation_time": "2006-01-09T11:19:28Z", "is_private": false, "text": "The problem with spans of negative height being swallowed is fixed now:\nhttp://svn.apache.org/viewcvs?rev=367262&view=rev"}, {"count": 5, "tags": [], "creator": "laklare@ml1.net", "attachment_id": 17494, "is_private": false, "id": 84959, "time": "2006-01-24T21:15:05Z", "bug_id": 38054, "creation_time": "2006-01-24T21:15:05Z", "text": "Created attachment 17494\nthis case shows how space-before is ignored if the previous block has a space-after attribute\n\nPlease ignore my previous comments and take a look at the behavior here.  I\nrealized that my fo:block was ignoring its space-before attribute because its\nprevious sibling had a space-after property larger than 0in.  But I don't think\nthe output makes sense."}, {"count": 6, "text": "Additional info concerning the second attachment:\n\nThe native XSL-FO space-* properties support a .precedence component.\n\nIf you make it:\n<fo:block space-after=\".1in\" space-after.precedence=\"0\" background-color=\"red\">\n  Red block\n</fo:block>\n<fo:block space-before=\"-.1in\" space-before.precedence=\"1\" background-color=\"blue\">\n  Blue block\n</fo:block>\n\nthen FOP Trunk renders it as intended. If no .precedence is specified, then they both revert to zero, and \nthe 'largest' space wins.\n\nAlso, margin-top seems to correctly lead to a retained space, so I consider this to be fixed.", "bug_id": 38054, "is_private": false, "id": 99561, "time": "2007-02-19T09:54:25Z", "creator": "adelmelle@apache.org", "creation_time": "2007-02-19T09:54:25Z", "tags": [], "attachment_id": null}, {"count": 7, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "id": 155831, "time": "2012-04-01T06:43:42Z", "bug_id": 38054, "creation_time": "2012-04-01T06:43:42Z", "is_private": false, "text": "batch transition pre-FOP1.0 resolved+fixed bugs to closed+fixed"}]