[{"count": 0, "tags": [], "bug_id": 38114, "attachment_id": null, "id": 84197, "time": "2006-01-04T01:25:31Z", "creator": "lisa@osafoundation.org", "creation_time": "2006-01-04T01:25:31Z", "is_private": false, "text": "We're trying to understand how HTTP and WebDAV clients can pre-emptively\nauthenticate.  I note in looking for duplicate bugs on this topic that there's\nalready been some work on getting HTTP-client to be able to pre-emptively\nauthenticate (http://issues.apache.org/bugzilla/show_bug.cgi?id=10532).  But we\nseem to have found a case where this doesn't work -- perhaps it's because the\nresource we queried doesn't require authentication in order to download.  \n\nHere's the telnet session of Julian Reschke testing this:\n\nTrying 66.96.29.211...\nConnected to www.webdav.org.\nEscape character is '^]'.\nGET /bind/ HTTP/1.1\nHost: www.webdav.org\nAuthorization: Basic QWxhZGRpbjpvcGVuIHNlc2FtZQ==\n\n\nHTTP/1.1 200 OK\nDate: Sat, 31 Dec 2005 11:11:56 GMT\nServer: Apache/2.0.49 (Fedora)\nLast-Modified: Mon, 18 Jul 2005 13:44:03 GMT\nETag: \"46d0c1-5df6-cae68ec0\"\nAccept-Ranges: bytes\nContent-Length: 24054\nContent-Type: text/html; charset=UTF-8\n\n<html xmlns:v=\"urn:schemas-microsoft-com:vml\"\nxmlns:o=\"urn:schemas-microsoft-com:office:office\"\nxmlns:w=\"urn:schemas-microsoft-com:office:word\"\nxmlns=\"http://www.w3.org/TR/REC-html40\">\n\n... rest of response truncated ...\n\n---\n\nWhat we expected to happen, rather than a 200 OK, would be a 401 Unauthenticated\nwith an authentication challenge.  Once the client gets the authentication\nchallenge with the domain, it can maybe do a successful authentication.\n\nMy understanding of why it should happen that way is based on RFC2617\n(http://rfc.net/rfc2617.html#s1.2):\n\n   \"If the origin server does not wish to accept the credentials sent\n   with a request, it SHOULD return a 401 (Unauthorized) response. The\n   response MUST include a WWW-Authenticate header field containing at\n   least one (possibly new) challenge applicable to the requested\n   resource.\"\n\nIn this case webdav.org is the origin server, and we believe it did not accept\nthe credentials.  Those credentials (copied from the example in RFC2617) should\nmap to the userid \"Aladdin\" and password \"open sesame\" which we didn't expect\nought to work :)\n\nIs there something we're not aware of here or some reason why the server ignores\nthe SHOULD in RFC2617?  -- thanks"}, {"count": 1, "tags": [], "creator": "jorton@redhat.com", "attachment_id": null, "text": "Yes, the header is ignored if there is no authz requirement configured for the\nresource.  I don't think that violates the 2617 SHOULD; the server *does* accept\nthe credentials and just ignores them, it has no reason to reject them.\n\n(Indeed, the client may very legitimately be sending the Auth header for this\nresource because e.g. it has just moved out of an auth-protected domain\nsomewhere else in this URI space.)\n\nThere is no 401 response that could be sent anyway; there is no realm\nconfigured, no scheme chosen, etc, so what 401 would you expect exactly anyway?  \n\nI'd say that the idea of pre-emptively authenticating yourself in a\nchallenge/response authentication mechanism such as HTTP's, is, um, challenging\n:)  But we can discuss this on the HTTP WG list or somewhere rather than httpd\nbugzilla.", "id": 84214, "time": "2006-01-04T17:13:46Z", "bug_id": 38114, "creation_time": "2006-01-04T17:13:46Z", "is_private": false}]