[{"count": 0, "tags": [], "creator": "bjoern@syltonline.de", "is_private": false, "text": "When JK2 was stopped, it was said that all major functions will be backported \nto JK1.\n\nWe set up a huge environment (Clustered IIS and Clustered TCs) based on JK2.\nBut one of the major enhancements in JK2 for the IIS has been forgotten so we \ncan't join you lot on the JK1 - and I guess we are not the only ones.\n\nIn JK2, you could map an real URL in the URI-Mappings, including VHost-Name:\n[URI:my.webname.de/tomcatapp/*]\n...\n\nIn JK1, it still gives an error when you try a full URL:\nmy.webname.de/tomcatapp/*=wlb\n\nbecause you explicitly forbid that in the JK:\n    if (*uri != '/') {\n        jk_log(l, JK_LOG_WARNING,\n                \"Uri %s is invalid. Uri must start with /\", uri);\n        JK_TRACE_EXIT(l);\n        return NULL;\n    }\n\nWhy is that? The JK2 had no problem doing that. We need that function because \nwe have some 40-60 VHOSTS on our Webservercluster, and we do not want global \nTomcat mappings - only for VHosts and contexts we name.\n\nIn the file the dev even say:\n# The general syntax for this file is:\n# [URL]=[Worker name]\nbut a URL is not possible to use, so it must be an error.\n\nI know it is now possible to use a properties file for configuration and have \na config per VHost that way, but this would be a administration nightmare with \nour webfarm size.\nPlease backport this feature / bugfix this issue soon.", "id": 84386, "time": "2006-01-09T17:01:33Z", "bug_id": 38200, "creation_time": "2006-01-09T17:01:33Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 38200, "attachment_id": null, "id": 84390, "time": "2006-01-09T17:08:51Z", "creator": "jessh@ptc.com", "creation_time": "2006-01-09T17:08:51Z", "is_private": false, "text": "I suspect that you should look to mod_proxy_ajp in Apache 2.2.  Since it is out\nI suspect work on mod_jk will be primarily \"as needed\" maintenance and bug fixing.\n\nI could be wrong, of course."}, {"count": 2, "tags": [], "bug_id": 38200, "attachment_id": null, "is_private": false, "id": 84392, "time": "2006-01-09T17:17:53Z", "creator": "bjoern@syltonline.de", "creation_time": "2006-01-09T17:17:53Z", "text": "I'd like to do that, but this bug referes to Microsoft IIS 6 like in \nisapi_redirect.dll instead of apaches mod_*. "}, {"count": 3, "tags": [], "text": "Ah, I missed the \"uriworkermap.properties\" bit.  Sorry.\n\nisapi_redirect.dll seems to be the stepchild no one wants.  There are those\n(including me) that are very dependent on there being a high quality IIS/Tomcat\nconnector, but even amongst those in this boat no one has any love for IIS,\nISAPI, etc.  Personally, I'd love it if my customers would just drop IIS and use\nApache (which we bundle), but some of them are rather stubborn on this point...", "attachment_id": null, "id": 84395, "creator": "jessh@ptc.com", "time": "2006-01-09T17:24:03Z", "bug_id": 38200, "creation_time": "2006-01-09T17:24:03Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 38200, "attachment_id": null, "is_private": false, "id": 84396, "time": "2006-01-09T17:25:52Z", "creator": "mturk@apache.org", "creation_time": "2006-01-09T17:25:52Z", "text": "JK 1.2 already supports that for qute some time (forever).\nJust prefix the URL with '/':\n/my.webname.de/tomcatapp/*\n"}, {"count": 5, "tags": [], "creator": "bjoern@syltonline.de", "is_private": false, "text": "@ Jess Holle:\n> isapi_redirect.dll seems to be the stepchild no one wants.\nyes, I got that feeling too. poor kid.\n\n> Personally, I'd love it if my customers would just drop IIS and use\n> Apache (which we bundle), but some of them are rather stubborn on \n> this point...\nwell, Apache has advantages, IIS other. I work with both and IIS6 is realy was \nbetter then the versions before. Hard to say which is better.\nBut we do professional IT services, so we serve whatever the paying customer \ndemands. If it's ASP or similar combined with Java, its IIS. If plain Java, \nApache & Tomcat is the way.\n\n@ Mladen Turk:\nIs that really so? Where is that documented? We searched for quite some time. \nWe spend many weeks developing and bugfixing the JK2 after it was discontinued \nbecause we thought we couldn't use JK1. If that Syntax realy works as \nexpected, please add it to some docu and the sample \"uriworkermap.properties\". \nThat would surely help some people out there. Everyone who depends on doing \nMicrosoft stuff in ASP together with the power of Java in webapps need a IIS-\nTomCat combination.", "id": 84402, "time": "2006-01-09T18:21:44Z", "bug_id": 38200, "creation_time": "2006-01-09T18:21:44Z", "attachment_id": null}, {"count": 6, "tags": [], "text": "The feature has been added to the docs in the meantime, see\n\nhttp://tomcat.apache.org/connectors-doc/reference/uriworkermap.html\n", "attachment_id": null, "id": 112375, "creator": "rainer.jung@kippdata.de", "time": "2008-01-01T16:00:49Z", "bug_id": 38200, "creation_time": "2008-01-01T16:00:49Z", "is_private": false}]