[{"count": 0, "tags": [], "bug_id": 38282, "attachment_id": null, "text": "This patch should implement the from-table-function.\n\nChanges to TableFObj.java:\n1) Make the getTable method public to have a quick access.\nAlternatives:\n1a) Only make public in TableCell (and call there super.getTable)\n1b) Explicitly traverse back in the FromTableColumnFunction\n    with getParent until we reach the Table object.\n\nChanges to TableColumn:\n2) Preserve PropertyList and add an accessor for this list\nNote:\nPreserved PropertyList could be cleared at the end of the table\nat fo tree parsing (for memory freeing) because it is not needed\nfor the layout-managers.\nShould I do this in Table.endOfNode?\n\nChanges to FromTableColumnFunction.java:\nDetails of implementation under discussion at fop-dev.\nThread: \"table-columns and number-columns-spanned\"\n\"last fallback\" and eventually \"second fallback\" may be\nobsoleted by this discussion.", "id": 84642, "time": "2006-01-15T23:08:02Z", "creator": "gerhard.oettl@oesoft.at", "creation_time": "2006-01-15T23:08:02Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 38282, "text": "Created attachment 17426\ninitial patch", "id": 84644, "time": "2006-01-15T23:09:20Z", "creator": "gerhard.oettl@oesoft.at", "creation_time": "2006-01-15T23:09:20Z", "is_private": false, "attachment_id": 17426}, {"count": 2, "attachment_id": 17427, "bug_id": 38282, "is_private": false, "id": 84645, "time": "2006-01-15T23:09:58Z", "creator": "gerhard.oettl@oesoft.at", "creation_time": "2006-01-15T23:09:58Z", "tags": [], "text": "Created attachment 17427\nan example fo-file"}, {"count": 3, "tags": [], "bug_id": 38282, "attachment_id": 17530, "text": "Created attachment 17530\nalternative patch\n\nGerhard,\n\nI finally got around to taking a look at the column-numbers again. In the end,\nI think the solution was \npretty straightforward (see attached patch). \nI managed to make the function applicable to table-cells as well... I only\nneeded to make sure column-number and number-columns-spanned were treated the\nsame way as font-size (see alterations to PropertyList). Maybe in the longer\nterm, some rational ordering of the possibly specified properties needs to be\nlooked at in a more global sense. (Apart from the above three, are there any\nother cases where the property parsing implies knowing the explicit values for\nother properties, so we need to make sure they are available first?)\n\nRoughly, I think my patch does more or less the same as yours. Differences are:\n\n* that I preferred to expose the isColumnNumberUsed() method, instead of using\niterators over the columns List (a matter of taste? seemed to result in less\nobjects being created...)\n* replaced the PropertyList reference in TableColumn with a StaticPropertyList\n(efficiency+)\n* did some cleanup: moved validation/overlapping colnrs to the PropertyMaker\n\nLet me know if this agrees with you...\n\nCheers,\n\nAndreas", "id": 85178, "time": "2006-01-29T21:49:37Z", "creator": "adelmelle@apache.org", "creation_time": "2006-01-29T21:49:37Z", "is_private": false}, {"attachment_id": 17539, "tags": [], "bug_id": 38282, "is_private": false, "count": 4, "id": 85216, "time": "2006-01-30T19:38:45Z", "creator": "adelmelle@apache.org", "creation_time": "2006-01-30T19:38:45Z", "text": "Created attachment 17539\ncorrection...\n\nSlightly corrected and updated version of the proposed patch."}, {"count": 5, "attachment_id": null, "bug_id": 38282, "text": "OK, after fumbling with it myself... Time for the questions/remarks ;-)\n\nad 1) agreed. 1a) also sounds attractive. [As I was thinking about moving the column-numbering to the \nPropertyMaker --which turned out to be nearly impossible and quite unnecessary-- I also considered \ncreating a private inner class to the PropertyMaker, which subclassed TableFObj...]\n\nad 2) Indeed! Seems I overlooked that. Table.endOfNode() seems like the right place to clear those \nreferences.\n\nad 3) I think my proposed implementation offers the right approach (though not at all sure; feel free to \nobject :-)), namely:\n- if there is an exact match in column-number, whatever the span, take that column\n- if there is no exact match, try to match any (colnr + s), where s is 1 .. (colspan_cell - 1)\n\nIMO, this is the way to read the definition in 5.10.4:\n\"... from the fo:table-column whose column-number matches the column for which this expression is \nevaluated and whose number-columns-spanned also matches any span. If there is no match for the \nnumber-columns spanned, it is matched against a span of 1.\"\nThis just seems like a way-too-complicated way of saying that, if there is an exact match, number-\ncolumns-spanned becomes irrelevant (?)\n\nRegardless of the debate on how to interpret number-columns-spanned on fo:table-column, the \ncolumn-indices used by column-spanning columns will be flagged as occupied --\nisColumnNumberUsed() will return true--, so the function will work properly in both interpretations.", "id": 85218, "time": "2006-01-30T20:12:39Z", "creator": "adelmelle@apache.org", "creation_time": "2006-01-30T20:12:39Z", "tags": [], "is_private": false}, {"count": 6, "attachment_id": null, "bug_id": 38282, "is_private": false, "id": 85231, "time": "2006-01-30T23:18:59Z", "creator": "gerhard.oettl@oesoft.at", "creation_time": "2006-01-30T23:18:59Z", "tags": [], "text": "No objections at all. I am very happy with your implemention."}, {"count": 7, "tags": [], "bug_id": 38282, "is_private": false, "text": "Created attachment 17541\nRemove propertylist when not neccessary anymore\n\nTo apply after the other patch.", "id": 85232, "time": "2006-01-30T23:21:21Z", "creator": "gerhard.oettl@oesoft.at", "creation_time": "2006-01-30T23:21:21Z", "attachment_id": 17541}, {"count": 8, "tags": [], "creator": "manuel@apache.org", "text": "This is a bit of side issue but I noticed that the patch uses the same \nmechanism of early property evaluation as for font-size. However, there is an \nissue with the early evaluation of the font-size property in the context of \nmarkers. Could we introduce the same problem here for column-numbers?", "id": 85243, "time": "2006-01-31T03:01:29Z", "bug_id": 38282, "creation_time": "2006-01-31T03:01:29Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "creator": "adelmelle@apache.org", "text": "Hi Manuel,\n\nI think it doesn't apply in this particular case... The problem with font-size, IIRC, concerns retrieved \nmarkers (?) Should be no problem here. Column-number 3 will always remain column-number 3, \nregardless of whether the table is contained in a marker or not.\n\nI don't know precisely --will have to look it up-- whether a marker that is in column-number 3 in a \ntable descending from the flow, can be retrieved into a table in the static-content and thus end up in a \ndifferent column...\n\nCheers,\n\nAndreas", "id": 85278, "time": "2006-01-31T22:18:01Z", "bug_id": 38282, "creation_time": "2006-01-31T22:18:01Z", "is_private": false, "attachment_id": null}, {"count": 10, "tags": [], "bug_id": 38282, "attachment_id": null, "text": "OK, just looked it up, and it seems like it *is* possible --although I wouldn't dream of it myself to do \nso, that's another issue.\n\nThen again: this problem will always pose itself, and it is not so much a matter of 'early property \nevaluation'. All properties are evaluated early, and some need to come first because of possible \ndependencies of other specified properties (i.e. relative font-sizes or core function calls). In itself, this \nisn't wrong, but the solution may be to postpone the whole property evaluation cycle for a marker and \n*all* of its descendants until the marker is retrieved (since we cannot possibly know how inherited \nproperties specified on the retrieve-marker or its containing block will affect the properties of the \nmarkers and its descendants... Maybe this is another case where we absolutely need to keep a reference \nto the original PropertyLists instead of binding the individual properties to instance variables (?)\n\nI'll apply the patch as is, with a few added comments indicating that markers still need to be treated \nwith caution.\n\nCheers,\n\nAndreas", "id": 85279, "time": "2006-01-31T22:37:12Z", "creator": "adelmelle@apache.org", "creation_time": "2006-01-31T22:37:12Z", "is_private": false}, {"count": 11, "attachment_id": null, "bug_id": 38282, "is_private": false, "id": 156028, "time": "2012-04-01T06:54:11Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T06:54:11Z", "tags": [], "text": "batch transition pre-FOP1.0 resolved+fixed bugs to closed+fixed"}]