[{"count": 0, "text": "mod_status and mod_info both suggest the same basic configuration code, namely:\n\n<Location /server-status>\n  SetHandler server-status\n  Order Deny,Allow\n  Deny from all\n  Allow from .foo.com\n</Location>\n\nNeither mentions that this configuration makes those accessible from all the\nvirtual hosts defined.  \n\nThere doesn't seem to be a way to configure a <Location> in the main server that\nis unique to that main server, without having to then use the same definition in\neach virtual host to reverse the definition, ie:\n\n<Location /server-status>\n   SetHandler None\n</Location>\n\nSince <Location> can't be used in .htaccess or <Directory> blocks, and <Files>\nlooks for existing file system object (although you can create false entries,\nthat requires the use of \"Action <name> <script> virtual\" and neither of the two\nlisted mods provide a similar method.\n\nI'm sure there's arguments to be made on both sides of the issue as to whether\nthis constitutes a bug or not, especially since it could be considered a\n\"feature\" in some respects and based on the legacy of how this is interpreted,\nbut it doesn't seem to be documented as such, either in the <Location> directive\nentry or the mod_ pages.  \n\nIMHO, there should be a reasonably simple manner (and it may just be that I'm\ntoo tired or focused to see it) to implement both _info and _status ONLY for the\nmain server's IP without having it carry over to all the vhosts.  This is\nespecially true if one of the vhosts wants to use the particular URL within it's\nown space for a completely different purpose, especially if it exists in the\nfile system, ie <Location /info>SetHandler server-info</Location> in main config\nand a vhost uses http://www.vhost.com/info/index.html to hold an actual page.  \n\nI know.  Change names.   Not a simple thing to do with dozens, even hundreds of\nscripts, pages, etc referencing both.", "bug_id": 38297, "attachment_id": null, "id": 84692, "time": "2006-01-17T08:51:21Z", "creator": "mmclagan@invlogic.com", "creation_time": "2006-01-17T08:51:21Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "slive@apache.org", "is_private": false, "text": "This is not a bug.  It is documented at\nhttp://httpd.apache.org/docs/2.2/sections.html\n\nThe config you want can be easily obtained by putting the <Location> sections\ninside the default virtual host.  (How you do this depends on whether you have\nname-based or IP-based virtual hosts and is an appropriate topic of discussion\nfor the users mailing list, but not here.)", "id": 84718, "time": "2006-01-17T16:59:02Z", "bug_id": 38297, "creation_time": "2006-01-17T16:59:02Z", "attachment_id": null}]