[{"count": 0, "tags": [], "creator": "christian.campo@mac.com", "attachment_id": null, "text": "I know its illegal to have a servlet-api.jar in the webapp classpath. Normally\nit just gets ignored with a warning. With tomcat-5.5.9 and the servlet-api from\nthe previous tomcat version 5.0.28 which is then the servlet-api-2.3. I realize\nthat no warning is created and servlets don't function anymore.\n\nAfter debugging a little bit I found a ClassCastException is produced in the\nStandardWrapper.java when loading the servlet (line 1048). Thats because the\nmyServlet can not be casted to the servlet class of tomcat. It seems that tomcat\nis in fact loading the servlet class of the webapp classloaded and therfore can\nnot cast it to the class of its own classloader.\n\nIts quit unfortunate that it is not rejected that servlet-api and its not\nshowing ANY error message whatsoever in the normal tomcat log. The\nclasscastexception is not displayed, at least not when I start Tomcat normally.", "id": 84746, "time": "2006-01-18T17:49:45Z", "bug_id": 38312, "creation_time": "2006-01-18T17:49:45Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "funkman@joedog.org", "text": "This is really a one off complaint as compared to\nhttp://tomcat.apache.org/faq/classnotfound.html#filter", "count": 1, "id": 84749, "time": "2006-01-18T17:53:43Z", "bug_id": 38312, "creation_time": "2006-01-18T17:53:43Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 38312, "attachment_id": null, "id": 84752, "time": "2006-01-18T18:33:37Z", "creator": "christian.campo@mac.com", "creation_time": "2006-01-18T18:33:37Z", "is_private": false, "text": "I disagree since I the whole point is that I did not get an exception of any kind. The only result was that a \nservlet that I thought I defined properly was not found in the browser. The Browser said \"Servlet xxxx \ncould not be found\".\n\nAlso I don't quit get it why you changed the behavior that .jars with packages like javax.servlet are not \nloaded in the first place in tomcat. That existed in tomcat5 and was a big help. I know I am a nerd but I \nlove it if tomcat keeps on telling me rather than I have to waste hours to find that out by myself :-)"}, {"count": 3, "tags": [], "creator": "christian.campo@mac.com", "attachment_id": null, "text": "I reopen and ask you to supply a comment why you think I need to debug (literally debug) into the tomcat \ncode to find that I have a configuration issue...thanks in advance", "id": 84754, "time": "2006-01-18T19:59:12Z", "bug_id": 38312, "creation_time": "2006-01-18T19:59:12Z", "is_private": false}]