[{"count": 0, "tags": [], "creator": "tlhackque@yahoo.com", "text": "I ran into the \"SSL fails to renegotate on a POST bug\" & was able to apply the \npatch from #12355 to fedora with a minor adaptation.  (The header file changed \nfrom mod_ssl.h to ssl_private.h)  Thank you - it solved the immediate crisis.\n\nHowever, it seems to me that sooner or later, someone will hit this when \nposting a 10MB file.  (or 100MB.. or whatever the pain threshold is above which \nraising the buffer size limit is unacceptable.)  Since this is application/user \nbehavior, the current fix imposes an arbitrary limit that the protocol and \ncurrent usage do not.\n\nSuggestion: when an incoming POST in this situation exceeds the memory buffer \nthreshhold, spool the data to a file.  Let the config file directive specify \nthe maximum file size.  That puts control in the hands of the person running \nthe system, rather than the address space limit of the server.  But smaller \nrequests still use the memory bucket brigade for performance.\n\nIn reviewing the previous bug report's history, I see that using a file was \nsuggested.  (Few ideas are truly new.)  I think this is the right way to \npermanently close this issue.  \n\nI suggest that the config file specify the spooling directory and max post \nsize.  \n\nThanks for your consideration.", "id": 84865, "time": "2006-01-22T16:07:26Z", "bug_id": 38350, "creation_time": "2006-01-22T16:07:26Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 38350, "attachment_id": null, "id": 85191, "time": "2006-01-30T10:52:34Z", "creator": "jorton@redhat.com", "creation_time": "2006-01-30T10:52:34Z", "is_private": false, "text": "Spooling to a file adds too much complexity and risk (\"Hey, my SSL server\nstopped working properly when my /var/tmp filled up.  WTF?\"), for little\nbenefit.  You should really design your site/application such that it does not\nrequire request bodies of unlimited size to be sent to a resource which may\nrequire a per-location SSL renegotiation."}]