[{"count": 0, "tags": [], "creator": "cowwoc@bbs.darktech.org", "attachment_id": null, "id": 85431, "time": "2006-02-05T08:11:44Z", "bug_id": 38516, "creation_time": "2006-02-05T08:11:44Z", "is_private": false, "text": "In the Tomcat Configuration Manager, Log On tab, I enter a username/password for\nTomcat to run as. When I restart the configuration manager the settings revert\nto Log on as \"local system account\". If I try launching Tomcat anyway I can see\nit runs as the SYSTEM user so it is clear my settings are getting lost.\n\nThe problem is caused by the fact that the specified user did not have a \"run as\na service\" permission and this needed to be added by the config manager. If one\nconfigures the Tomcat service directly and try configuring the \"run as\" user\naccount then windows will pop up a window saying that it automatically added\nthis permission on the user's behalf. We should do the same and automate this\nprocess.\n\nOnce the account was given this access, I went back to the tomcat config manager\nand it worked properly this time."}, {"count": 1, "tags": [], "creator": "cowwoc@bbs.darktech.org", "attachment_id": null, "is_private": false, "id": 85432, "time": "2006-02-05T08:20:25Z", "bug_id": 38516, "creation_time": "2006-02-05T08:20:25Z", "text": "I stand corrected. The Tomcat configuration manager doesn't seem to work at all\nfor Log On settings. It always loses any settings in the Log On tab no matter\nwhat I do; though the bit about giving a user \"run as service\" permission is\nstill important if we are to ever make this work."}, {"count": 2, "tags": [], "bug_id": 38516, "is_private": false, "text": "Gili, it's been more than a year since this issue was filed, and evidently no\none cares (no votes, comments, emails on either mailing list, nothing).  Do you\ncare enough to provide an enhancement path to the service configuration manager?", "id": 100907, "time": "2007-03-25T14:04:24Z", "creator": "yoavs@computer.org", "creation_time": "2007-03-25T14:04:24Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "cowwoc@bbs.darktech.org", "attachment_id": null, "is_private": false, "id": 100932, "time": "2007-03-25T15:40:52Z", "bug_id": 38516, "creation_time": "2007-03-25T15:40:52Z", "text": "Yoav, is it possible to remove that section from the configuration manager\naltogether. Right now it's just misleading people into thinking it works. If\nenough people care one it's removed then it will warrant enough action to go\nback and fix it."}, {"count": 4, "tags": [], "creator": "andree.wormuth@myview.de", "attachment_id": null, "is_private": false, "id": 114418, "time": "2008-03-07T08:00:43Z", "bug_id": 38516, "creation_time": "2008-03-07T08:00:43Z", "text": "(In reply to comment #3)\n> Yoav, is it possible to remove that section from the configuration manager\n> altogether. Right now it's just misleading people into thinking it works. If\n> enough people care one it's removed then it will warrant enough action to go\n> back and fix it.\nI DO care, since I'm trying to connect to the process via jconsole, which apparently does not work it I'm logged in on the server. Since I cannot connect remotely to the process for security reasons I cannot establish a connection at all :-(\n\nGreetz from Germany,\nAndree\n\n"}, {"count": 5, "tags": [], "bug_id": 38516, "is_private": false, "text": "The issue, at least with the latest tomcat5w.exe is that it does not display the current settings, the display always indicates a local system account even when another account is configured.\n\nI have confirmed that the user settings entered are used, even if they are not displayed.\n\nTomcat uses Commons Daemon to provide the service wrapper. I have created https://issues.apache.org/jira/browse/DAEMON-126 to track this", "id": 128471, "time": "2009-07-01T15:37:15Z", "creator": "markt@apache.org", "creation_time": "2009-07-01T15:37:15Z", "attachment_id": null}]