[{"count": 0, "tags": [], "creator": "olivier.jaquemet@jalios.com", "attachment_id": null, "id": 85470, "time": "2006-02-06T16:58:08Z", "bug_id": 38532, "creation_time": "2006-02-06T16:58:08Z", "is_private": false, "text": "The \"Content-Type\" header is not returned by tomcat when accessing file that\nhave not changed since the last access.\nTo reproduce:\n - store a static file on server, say myfile.xls\n - access the file a first time (with IE), everthing work as expected, the\n\"Content-Type\" is provided by Tomcat.\n - access the file a second time (with IE), IE provides a \"If-Modified-Since\"\nheader and Tomcat response is 304, as expected, but the \"Content-Type\" header is\nmissing and IE goes crazy. It works well with firefox 1.5 as it does not provide\nthe \"If-Modified-Since\".\n\nThe HTTP 1.1 RFC states:\n\"Any HTTP/1.1 message containing an entity-body SHOULD include a Content-Type\nheader[...]\", a 304 response is not an entity-body.. therefore it does not\nreally violate any RFC, but it is not the behavior expected by the (current)\nmain browser IE... \nhttp://www.w3.org/Protocols/rfc2616/rfc2616-sec7.html#sec7.2.1"}, {"count": 1, "tags": [], "creator": "olivier.jaquemet@jalios.com", "attachment_id": null, "id": 85471, "time": "2006-02-06T17:36:54Z", "bug_id": 38532, "creation_time": "2006-02-06T17:36:54Z", "is_private": false, "text": "Just for information, as I don't desesperately want this bug to be solved, could\nyou provide the explanation on why this bug won't be fixed?\nThat way I'll try not to submit bug of the same kind in order to limit the\namount of bugs you need to deal with.\nThanks! :)"}, {"count": 2, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 85474, "time": "2006-02-06T17:55:17Z", "bug_id": 38532, "creation_time": "2006-02-06T17:55:17Z", "text": "Proper resolution."}, {"count": 3, "tags": [], "text": "The answer is that 304 responses should not contain a Content-Type,\naccording to RFC 2616 section 10.3.5:\n\nhttp://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.3.5\n\n  If the conditional GET used a strong cache validator (see section 13.3.3),\n  the response SHOULD NOT include other entity-headers. Otherwise (i.e., the\n  conditional GET used a weak validator), the response MUST NOT include other\n  entity-headers; this prevents inconsistencies between cached entity-bodies\n  and updated headers.\n\nMSIE does not \"go crazy\" when receiving a 304 response, so my guess is\nthat the 304 has nothing to do with the observed problems.", "attachment_id": null, "bug_id": 38532, "id": 85572, "time": "2006-02-08T01:50:02Z", "creator": "fielding@apache.org", "creation_time": "2006-02-08T01:50:02Z", "is_private": false}]