[{"count": 0, "tags": [], "creator": "paul.carr@express-gifts.co.uk", "attachment_id": null, "is_private": false, "id": 85515, "time": "2006-02-07T11:46:18Z", "bug_id": 38549, "creation_time": "2006-02-07T11:46:18Z", "text": "Batik scales A4 images down slightly meaning that the resulting printout is \nincorrect. I'm working on a project where we need to print to various paper \nsizes accurately( i.e. to stick a persons name into a box on a pre printed \nCertificate) I was determined to use SVG, but this issue is stopping me from \nproceeding.\n\nTo reproduce : \n(1)use inkscape to create an A4 portrait image with a 48pt \"X\" in each corner \nof the page. \n(2)save\n(3)open file in squiggle (the top right \"X\" has already moved to the left)\n(4)print file to A4 with zero margins\n\nresults:-\nthe \"X\" at the top left is correctly positioned\nthe \"X\"'s at the bottom have moved up slightly \nthe \"X\" at the top right has moved left slightly\n\nYou can actually notice the problem in squiggle before it even comes to \nprinting it...the top right \"X\" is visibly further left.\n\nI also took the latest SVN, same problem, This is very urgent for me, I'd love \nto use batik in this new project and have a couple of days left to give my \ntechnical recommendations....pls help \n\nBest Regards\nPaul."}, {"count": 1, "tags": [], "creator": "paul.carr@express-gifts.co.uk", "attachment_id": 17616, "text": "Created attachment 17616\nSVG to reproduce\n\nThis is the SVG I used. It was produced with inkscape and saved as plain SVG.", "id": 85516, "time": "2006-02-07T11:48:25Z", "bug_id": 38549, "creation_time": "2006-02-07T11:48:25Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 38549, "attachment_id": 17617, "text": "Created attachment 17617\nA java app to test the SVN version of batik\n\nThis is a littlwe app I tried to see if it was a squiggle specific\nproblem....it is not.....all this app does is loads SVG and renders it....it\nrenders it scaled down.", "id": 85517, "time": "2006-02-07T11:50:56Z", "creator": "paul.carr@express-gifts.co.uk", "creation_time": "2006-02-07T11:50:56Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 38549, "text": "AFAIK, Batik uses 96 dpi as default resolution. This is important when no\nviewBox is used in the SVG files. And that is exactly what happens if you\nproduce an SVG file using Inkscape. I'd check the screen resolution setting in\nyour operating system. Normally this is 96 dpi, but in Windows, for example, you\ncan set the screen resolution to \"Large Fonts\" which results in a 72dpi\nresolution. Maybe that's where the problem comes from. AFAIK, it's not possible\nto query the screen resolution from Java.\n\nMaybe that helps...", "id": 85519, "time": "2006-02-07T11:58:30Z", "creator": "jeremias@apache.org", "creation_time": "2006-02-07T11:58:30Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "paul.carr@express-gifts.co.uk", "attachment_id": null, "text": "AHA ... had a bit of a breakthough...Cameron McCormack from the batik mailing \nlist sent me some better SVG (in mm), and it made batik display the SVG on \nscreen correctly, but when printing it had the same problem. I used inkscape to \nprint the same SVG file and it came out perfectly, so I'm now fairly certain \nthat there is a bug in the batik PrintTranscoder / printing mechanism. I used \nthe java print API before to accurately print A4 jpegs, so I'm ruling that out \nas a bug. It could actually be a bug in Squiggle and nothing to do with batik \nat all ???", "id": 85587, "time": "2006-02-08T11:50:26Z", "bug_id": 38549, "creation_time": "2006-02-08T11:50:26Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 38549, "attachment_id": null, "text": "I suspect that this is related to the thread:\n\nhttp://www.nabble.com/Bug-%28-I-think%29-t1075235.html\n\nIf so it turns out to be a bug in JDK 1.5 & 1.6.\nSo unless anyone has a good idea for workaround\n(and patch ;) I've marked it as WONTFIX.", "id": 85789, "time": "2006-02-15T02:06:21Z", "creator": "deweese@apache.org", "creation_time": "2006-02-15T02:06:21Z", "is_private": false}]