[{"count": 0, "tags": [], "bug_id": 38567, "attachment_id": null, "id": 85588, "time": "2006-02-08T12:33:00Z", "creator": "prabhu@efrontier.com", "creation_time": "2006-02-08T12:33:00Z", "is_private": false, "text": "Hi all,\n\nI am trying to create a custom appender by extending DailyRollingFileAppender. I\nam also overriding the method, subAppend, to do some more formatting of my\nmessages, before writing. \n\nBut if I override this method, log rotation is not happening.\n\nThe only solution, I had is to copy lot of code from DailyRollingFileAppender\nlike the method rollOver etc.\n\nSuggest me some simple solution or do some changes to the design, so that log\nrotation does not happen in subAppend method.\n\nPrabhu"}, {"count": 1, "tags": [], "bug_id": 38567, "attachment_id": null, "id": 85596, "time": "2006-02-08T18:10:14Z", "creator": "carnold@apache.org", "creation_time": "2006-02-08T18:10:14Z", "is_private": false, "text": "org.apache.log4j.DailyRollingFileAppender has been deprecated in log4j 1.3 in preference to the \norg.apache.log4j.rolling.RollingFileAppender which allows pluggable TriggeringPolicy's (detects when to \nroll over the file) and RollingPolicy's (which control how files are renamed or modified during a rollover).  \nThis represents our attempt to \"change the design\" of o.a.l.DailyRollingFileAppender.  If you encounter \nissues with log4j 1.3's o.a.l.rolling.RollingFileAppender design, please describe your situation on the \nlog4j-dev mailing list and we can work through the issues and possibly improve its design.\n\nIf you override DRFA.subAppend() and do not call super.subAppend() or duplicate its code, log rotation \nwill not be triggered since the calls to check the rollover criteria are in super.subAppend().  If you must \nuse log4j 1.2.x, you could describe your problem on log4j-user and perhaps we could find a better \nsolution, however changes to DRFA are highly unlikely since it is deprecated. "}, {"count": 2, "tags": [], "creator": "jessh@ptc.com", "attachment_id": null, "id": 85598, "creation_time": "2006-02-08T18:16:54Z", "time": "2006-02-08T18:16:54Z", "bug_id": 38567, "text": "DailyRollingFileAppender may be deprecated, but it should be noted that\nrequiring a complex XML configuration to attain this functionality will\ngenerally not be appreciated.\n\nHaving the existing DailyRollingFileAppender config be a simple configuration of\nthe new general mechanism and *not* be deprecated would be preferable overall...", "is_private": false}]