[{"count": 0, "tags": [], "bug_id": 38572, "attachment_id": null, "id": 85593, "time": "2006-02-08T17:09:53Z", "creator": "andreas@apache.org", "creation_time": "2006-02-08T17:09:53Z", "is_private": false, "text": "http://article.gmane.org/gmane.comp.cms.lenya.devel/14179\n\nI had to disable the code which updates the search index in the\ndefault publication instantiator.\n\nSorry for this rant, I'm just expressing some concerns and don't want\nto offend anybody - the code is appreciated and just needs some\npolishing. I'm sure the problems can be solved without too much effort.\n\n----\n\nThe code works directly on patch files for cocoon.xconf. These files\naren't copied to the build directory anymore (well, they are\npatch files ...).\n\nThe code violates SoC by handling component configuration, which\nis the responsibility of the Avalon framework. It assumes the existence\nof patch files and manipulates and applies the content of the patches\nwithout using the framework. The \"// TODO: release all objects\" should\nbe taken care of. And it should be moved to the lucene module, the\ninstantiator shouldn't bother about search index configuration details.\n\n----\n\nIMO the code needs a redesign. Is someone familiar with it?\nIf not, I'll try to analyze it and look for solutions to the\nproblems mentioned above.\n\nAgain - apologies if someone feels offended.\nAny support is greatly appreciated!"}, {"count": 1, "tags": [], "creator": "josias.thoeny@wyona.org", "text": "the search-index configuration has been re-enabled in the instantiator some time\nago (r388556).\nthe configuration has been changed such that no patching of cocoon.xconf is\nnecessary to add new indexes. the index configuration is stored in a separate\nfile (lucene_index.xconf), which can be modified at run time.\n\nthe other points are still open:\n- release all objects\n- move to lucene module\n- general redesign (?)\n\n", "id": 93380, "time": "2006-09-12T08:04:23Z", "bug_id": 38572, "creation_time": "2006-09-12T08:04:23Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "I'll close this bug for the moment. The services seem to be released properly. I hope the code will become obsolete soon - I see no point in configuring the index for each publication.", "is_private": false, "id": 115216, "creator": "andreas@apache.org", "time": "2008-04-01T16:59:33Z", "bug_id": 38572, "creation_time": "2008-04-01T16:59:33Z", "attachment_id": null}]