[{"count": 0, "tags": [], "bug_id": 38585, "attachment_id": null, "id": 85619, "time": "2006-02-09T04:23:25Z", "creator": "anonaye2@hotmail.com", "creation_time": "2006-02-09T04:23:25Z", "is_private": false, "text": "Sorry I know Encryption is in beta so it may simply be not implemented yet.\n\nI have tried creating a ReferenceList object with DataReference, placing that \nin the EncryptedKey object during encryption.  However, the final document was \nnot able to create the elements and sibling for <xenc:ReferenceList>.\n\nThe same behaviour is found for decryption where the <xenc:ReferenceList> \nappears to be ignored and cannot be found in the EncryptedKey object.\n\nCheers,"}, {"count": 1, "attachment_id": null, "creator": "sean.mullan@oracle.com", "is_private": false, "id": 85634, "time": "2006-02-09T15:32:36Z", "bug_id": 38585, "creation_time": "2006-02-09T15:32:36Z", "tags": [], "text": "What version of XMLSec are you using? If not 1.3, please try that as there\nwere some changes in that code to fix some bugs.\n\nAlso, please attach a test case so that we can reproduce the problem."}, {"count": 2, "tags": [], "creator": "anonaye2@hotmail.com", "text": "Created attachment 17638\nThis test sample will attempt to encrypt two elements, and create a data reference list in the encrypted key\n\nI was using 1.2.1 and now switching to Java version of the XML security 1.3\n\nWhen encrypting (1.3), no data reference list is being created (see attached\ncode).\n\nDecryption is ok in 1.3 -- it is able to loadEncryptedKey and get the data\nreference list inside.\tNo problem with decryption.", "id": 85669, "time": "2006-02-10T04:26:19Z", "bug_id": 38585, "creation_time": "2006-02-10T04:26:19Z", "is_private": false, "attachment_id": 17638}, {"count": 3, "tags": [], "bug_id": 38585, "attachment_id": null, "text": "This is technically not a bug, but it is a subtle problem that probably should\nbe addressed in a better way. In your test program, you should actually use the\nkeyCipher to create the ReferenceList and not the xmlCipher:\n\n<         ReferenceList refList = xmlCipher.createReferenceList(\nReferenceList.DATA_REFERENCE );\n---\n>         ReferenceList refList = keyCipher.createReferenceList(\nReferenceList.DATA_REFERENCE );\n\nThis is because there is no context document associated with the xmlCipher\nobject at the time that you create and marshal the ReferenceList. But there is\none associated with the keyCipher object. The problem with using xmlCipher\noccurs when you add the EncryptedKey to the KeyInfo object which marshals \nit to an element, but there is no context document to create the element. The\nKeyInfo class is part of the signature packages and these classes are a little\ndifferent with respect to marshalling - they marshal as you add objects \nwhereas with the encryption classes marshalling is triggered at the end when \nyou encrypt data.\n\nI'm going to mark this as INVALID for now. If anyone thinks of a better way\nto help users avoid this problem, let me know or open an RFE.", "id": 86803, "time": "2006-03-14T19:10:49Z", "creator": "sean.mullan@oracle.com", "creation_time": "2006-03-14T19:10:49Z", "is_private": false}, {"count": 4, "tags": [], "creator": "raul-info@r-bg.com", "text": "Closing old bugs.", "id": 91955, "time": "2006-08-06T17:34:57Z", "bug_id": 38585, "creation_time": "2006-08-06T17:34:57Z", "is_private": false, "attachment_id": null}]