[{"attachment_id": null, "tags": [], "creator": "maint@intercollab.kiev.ua", "text": "I have JSP files in different directories with different security constraints.\nWhen I am not logged, I usually get login form . But when I am logged and I try\nto get protected resource (I have not such role), I get always message\n'HTTP Status 403 - Access to the requested resource has been denied'.\n\n    I remember that in Tomcat 3.x I get login form again. What is the\nreason to get this simple message ? It's bad when in complex application user \ngets it. \n\n    Why don't provide such situation with re-login or error-page ?\n\n    Thank you.", "count": 0, "id": 6157, "time": "2001-09-28T04:40:57Z", "bug_id": 3865, "creation_time": "2001-09-28T04:40:57Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 3865, "text": "According to the servlet specification, the login page is only displayed if the\ncontainer does not know who the user is.  Since you are already logged in, it\n*does* know who you are.  When it checks your roles against those required by\nyour security constraint, a 403 (Forbidden) error is the correct and required\nresponse if you do not possess the appropriate role.  If Tomcat 3.x did\nsomething different, then it was broken.\n\nNote that you can customize the look and feel of the error by registering an\nerror page handler for the 403 status code:\n\n    <error-page>\n        <error-code>403</error-code>\n        <location>/my-403-error-page.jsp</location>\n    </error-page>\n\nin the web.xml file.  The text on this page could offer a link that invalidates\nthe session (logging you off) and then redirects to the page you tried to access\n(which will trigger the login dialog again since it is protected).\n\nWARNING:  This technique won't work in the 4.0 final release, because of a bug\nin the way error pages for HTTP errors issued by the container are handled --\nbut this will be fixed in the upcoming 4.0.1 release.\n", "id": 6167, "time": "2001-09-28T08:48:04Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-09-28T08:48:04Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "medthomas@ntlworld.com", "text": "*** Bug 11208 has been marked as a duplicate of this bug. ***", "count": 2, "id": 49386, "time": "2003-12-18T23:08:54Z", "bug_id": 3865, "creation_time": "2003-12-18T23:08:54Z", "is_private": false}]