[{"count": 0, "tags": [], "creator": "simon@baltovic.com", "attachment_id": null, "text": "We use chainsaw to monitor various application across different servers, and to\nhelp organise this visually we set the \"Application-wide Preferences\" -> \"Tab\nidentifier\" to \"PROP.hostname\". This allows us to arbitrarily group log messages\nonto the same tab.\n\nThe problem here is that Chainsaw messages are then sent to a tab called\n\"Chainsaw\", which then creates the config files \"Chainsaw.colors\",\n\"Chainsaw.properties\" and \"Chainsaw.xml\". The last filename conflicts with the\napplication wide config file of the same name.\n\nDepending on whether or not a user has applied layout changes to the \"Chainsaw\"\ntab, and on which file is written to last when closing chainsaw, the application\nwide file may or may not be overwritten with the Tab config file.\n\nTo remedy this, we've set the \"Tab identifier\" to \"PROP.hostname -\", but it's\nkind of a messy solution. Would it not make more sense to name the global xml\nconfig file to something more specific ie; chainsaw.settings.xml to match the\nname of the properties file for instance?", "id": 85947, "time": "2006-02-20T12:52:06Z", "bug_id": 38717, "creation_time": "2006-02-20T12:52:06Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 38717, "attachment_id": null, "text": "I'll make the suggested change.\n\nThere is one drawback to this change which affects existing Chainsaw users -\ntheir global settings won't be loaded (loaded config file, tab identifier, etc)\n- they'll have to re-apply their changes.\n\nThey recently had to go through this when we started to use Xstream to load most\nChainsaw settings - and Chainsaw is still alpha (2 years now?), so not much harm\ndone, just a bit annoying.\n\nI'll add a note in the release notes when I make the change.\n\n\n", "id": 85957, "time": "2006-02-20T15:39:39Z", "creator": "sdeboy@iname.com", "creation_time": "2006-02-20T15:39:39Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 38717, "attachment_id": null, "id": 85961, "time": "2006-02-20T16:29:50Z", "creator": "sdeboy@iname.com", "creation_time": "2006-02-20T16:29:50Z", "is_private": false, "text": "Committed - will show up in the Web Start build/bundle/Mac dmg image at some\npoint in the near future (after a few unrelated fixes/enhancements are made)."}]