[{"count": 0, "tags": [], "bug_id": 38877, "attachment_id": null, "id": 86560, "time": "2006-03-07T10:59:55Z", "creator": "mabuffo@gva.eri.ch", "creation_time": "2006-03-07T10:59:55Z", "is_private": false, "text": "When you have a \"Loader\" tag for your \"context\" in the \"server.xml\" file, the\nclass loading scheme of tomcat is broken.\n\nIn this case, your custom Loader receieves, as a parent ClassLoader, an instance\nof the System ClassLoader, instead of an instance of the Shared ClassLoader (see\nhttp://tomcat.apache.org/tomcat-5.5-doc/class-loader-howto.html).\n\nThis is because, when the \"Loader\" tag is present, the custom loader (typically\na subclass of \"WebappLoader\") is created while reading the XML file, BEFORE\nknowing the parent container (and therefore, defore knowing the parent\nClassLoader = Shared ClassLoader) [class ContextRuleSet, method begin(),line 253].\n\nIn this case, the default class loader is set to the SystemClassLoader [class\nContainerBase, method getParentClassLoader(), line 580].\n\nOn the other hand, if you DON'T have the tag, the loader is created later [class\nStandardContext, method start, line 4022].\n\nI consider this bug a a major one, as the class loading scheme is broken (I\nconsider class loading as a fundamental element of J2EE). This bug prevents an\neasy professionnal development of web applications, as it imposes the manual\ncopy of classes and jars into the apposite WEB-INF locations, instead of using a\nsuited class loader allowing an easy share of classes between projets.\n\nRelated bugs: ASF Bugzilla Bug 37054, ASF Bugzilla Bug 37302.\n\nMathieu"}, {"count": 1, "tags": [], "creator": "yoavs@computer.org", "text": "There are plenty of ways to easily share classes and their object instances\nbetween webapps without using a custom loader ;)  But I'll leave this bug open,\nwe'll see if anyone cares to submit a patch.", "id": 88091, "time": "2006-04-14T18:57:13Z", "bug_id": 38877, "creation_time": "2006-04-14T18:57:13Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 38877, "is_private": false, "id": 88433, "time": "2006-04-24T13:53:00Z", "creator": "remm@apache.org", "creation_time": "2006-04-24T13:53:00Z", "tags": [], "text": "\n\n*** This bug has been marked as a duplicate of 37054 ***"}]