[{"count": 0, "tags": [], "text": "Setup: \nJmeter client/frontend 2.1.1 running on Windows XP SP2 with Java 1.4.2_09\nJmeter server 2.1.1 running Linux Fedora Core 4 with Java 1.4.2_11\n\nThe Jmeter server needs to connect through a Windows ISA Firewall (funny MS\nauthentication needed). In order to do that on Linux you can use a tool called\n'NTLM Authorization Proxy Server' (http://www.geocities.com/rozmanov/ntlm/).\ni.e. Jmeter server MUST connect via a proxy running on the same machine on port\n5865.\n\nProblem:\nTo test that it works I started my (simple) script without a client-server\nconfig on the server.\n\n./jmeter -n -t openbc.jmx -l test.txt -H localhost -P 5865\n\nThis works just fine. Tcpdump gives me a whole lotta lines like this:\n\n03:20:22.071691 IP 172.17.2.32.33156 > 172.25.10.102.http: . ack 18875....\n\n,which show me that the NTLM proxy is working and connecting to 172.25.10.102\n(which is the external proxy).\n\nNow if I start the server like this:\n\n./jmeter-server -H localhost -P 5865\n\nand run the same test from the client/frontend, it doesn't work. Tcpdump gives\nme output like this:\n\n03:20:53.815486 IP 172.17.2.32.43208 > 213.238.59.20.http:\nS180175323:180175323(0) win 5840....\n\n213.238.59.20 is the address of the server my script calls. i.e. Jmeter server\nis not using the proxy. Eventually the client shows me that the test was\nunsuccessful because the test has timed out.\n\nExpected behaviour:\nIf I include -H and -P options when calling the jmeter server I would expect it\nto use the proxy.\n\nComment:\nI don't have enough systems to try this with other constellations. Maybe\nsomebody can try this and confirm my findings.\n\nI'm also interested in an interim fix or workarround if somebody has any ideas.\nI can't proceed with my tests here until this is solved.\n\nBest Regards & Thanx in advance!\nOliver Erlewein", "is_private": false, "id": 86751, "creator": "olivere@datacom.co.nz", "time": "2006-03-13T04:30:28Z", "bug_id": 38945, "creation_time": "2006-03-13T04:30:28Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 38945, "attachment_id": null, "id": 86931, "time": "2006-03-16T19:55:13Z", "creator": "olivere@datacom.co.nz", "creation_time": "2006-03-16T19:55:13Z", "is_private": false, "text": "The error disappeared during detailed investigation. At the moment it cannot be\nreproduced. \n\nMaybe somebody gets the chance to try the same setup on another system and\nconfirm that it works. Until then this defect is closed.\n\nOliver"}]