[{"count": 0, "tags": [], "creator": "akeister@vt.edu", "text": "I am a complete newbie, a \"dummy\", as you might say. I searched and searched for\ninfo on port conflicts when installing Apache, but nothing seemed to match my\nsituation. I had ZoneAlarm installed, and after I finally found out that\nfirewalls are a problem, I uninstalled ZoneAlarm, cleared the browser cache,\nrebooted, and reinstalled Apache. When I tested the Apache installation, I still\ngot the message: \"The connection was refused when attempting to contact\nlocalhost.\" My httpd.conf file is as follows (a minimal file):\n\nListen 9000\nServerRoot \"c:/Program Files/Apache Group/Apache2\"\nDocumentRoot \"c:/web/web/htdocs\"\nServerAdmin akeister@vt.edu\n\nWhen I execute c:\\> apache -k restart, Apache uses my local IP address for the\nServerName, and does not otherwise appear to have any problem. \n\nIs there still a port conflict? If so, how do I fix it? How do I tell which\nports are used and which aren't?", "id": 86941, "time": "2006-03-17T03:17:10Z", "bug_id": 39004, "creation_time": "2006-03-17T03:17:10Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 39004, "is_private": false, "id": 94133, "time": "2006-09-26T18:40:26Z", "creator": "the_angry_angel@blueyonder.co.uk", "creation_time": "2006-09-26T18:40:26Z", "tags": [], "text": "Make sure Apache isn't running. Then if you goto start > run and type \"cmd\", you\nshould get the command prompt up. If you then type \"netstat -an\" followed by\nreturn you should see a list of all connections to your machine. Near the top\nshould be a number of listening sockets. Make sure you select a port number\nwhich is not used there.\n\nUsually Apache will tell you if theres a problem, so if you can start the apache\nservice, and it doesn't complain, it's a good start.\n\nWhen you selected port 9000 did you goto http://localhost:9000? If not, heres\nthe problem. By default it is assumed that you're going to be connecting via\nport 80, otherwise you have to explicitly tell your browser.\n\nIf that didn't work (when apache was running), then you've got another problem\nI'm afraid. \n\nIf it did then you've probably got something else running on port 80; IIS\nperhaps, or Skype (which uses 80 by default also)."}, {"count": 2, "tags": [], "creator": "nick@webthing.com", "text": "looks like a user support question, and presumably long-since resolved.", "id": 109096, "time": "2007-10-07T17:43:18Z", "bug_id": 39004, "creation_time": "2007-10-07T17:43:18Z", "is_private": false, "attachment_id": null}]