[{"count": 0, "tags": [], "bug_id": 39053, "is_private": false, "id": 87080, "creation_time": "2006-03-21T20:24:39Z", "time": "2006-03-21T20:24:39Z", "creator": "juergen@jwi.de", "text": "An sample Java program to show how to run Tomcat embedded should be included in\nthe distribution. It should include a java main program that should not need any\ndisc based config files. Also there should be included a build.xml to show what\nlibraries are are needed at compile and run time.\n\nA starting point could be these posts:\n\nhttp://www.theserverside.com/discussions/thread.tss?thread_id=30625\nhttp://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg144216.html\n\n(the sample from theserverside.com fails with\njava.lang.NoClassDefFoundError: javax/management/MBeanRegistration)", "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 39053, "text": "I started with that sample (theserverside). One thing I found tricky to emulate\nis the behavior of the actual Catalina startup class, where it starts the\nconnector in a suspended state, and then activates it after all the webapps are\ndeployed.\n\nThis prevents the server from replying back with a 500 code to an overly eager\nclient who comes in \"too early\" - today, if they can connect, they'll block till\nall webapps are deployed, and then get a proper response.\n\nIn my own embedded startup, I had to emulate this by creating the connector (as\ndescribed in the article), and then immediately invoking the \"pause()\" API on\nthe connector, deploying the webapps, and then invoking the \"resume()\" API on it.\n", "id": 87094, "time": "2006-03-22T00:29:44Z", "creator": "shankarunni@netscape.net", "creation_time": "2006-03-22T00:29:44Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "yoavs@computer.org", "attachment_id": null, "text": "If you have a sample, submit it, and we will gladly review and add it as relevant.", "id": 87964, "time": "2006-04-13T19:33:52Z", "bug_id": 39053, "creation_time": "2006-04-13T19:33:52Z", "is_private": false}, {"count": 3, "tags": [], "creator": "juergen@jwi.de", "text": "Created attachment 18100\nTomcatServer.java\n\nThis is the code I use for starting Tomcat embedded. The code should be very\nmuch enhanced to serve as a sample.\n\nIt uses a JNDIRealm.\n\nThe webapps are loaded from wars from the default Tomcat ones. The manager app\nseems to work, but the ROOT context yields \"The requested resource (/) is not\navailable.\"\n\nBTW: How does my application know when Tomcat is up and running? This does not\ntrigger a LifecycleEvent.", "id": 88079, "attachment_id": 18100, "bug_id": 39053, "creation_time": "2006-04-14T16:06:10Z", "time": "2006-04-14T16:06:10Z", "is_private": false}, {"count": 4, "tags": [], "text": "Thank you for submitting a sample application.  I don't want to include it in\nthe distribution until you enhance it to your satisfaction, as you say yourself\nit needs to be \"much enhanced\" before serving as a sample.  Please feel free to\nattach an updated sample if/when you feel like it, and I'll be glad to take\nanother look at it then, and maybe include it in the distro.  (I do agree an\nembedded sample would be cool).", "is_private": false, "bug_id": 39053, "id": 97244, "time": "2006-12-24T18:57:31Z", "creator": "yoavs@computer.org", "creation_time": "2006-12-24T18:57:31Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 39053, "is_private": false, "text": "(In reply to comment #4)\n\nI don't feel I am apt to enhance the sample. If I knew so much about Tomcat's \nintricacies I wouldn't have opened the bug in the first place. The sample is\nwhat I could gather from some articles, but it is only rudimentary and should be\nover-worked by someone who knows Tomcat very well.", "id": 97347, "time": "2006-12-26T13:13:14Z", "creator": "juergen@jwi.de", "creation_time": "2006-12-26T13:13:14Z", "attachment_id": null}, {"count": 6, "attachment_id": null, "creator": "markt@apache.org", "text": "For the now deprecated Embedded class, Catalina serves as an example.\n\nFor the new Tomcat class, there are numerous examples in the unit tests.", "id": 144462, "time": "2011-02-21T19:08:35Z", "bug_id": 39053, "creation_time": "2011-02-21T19:08:35Z", "tags": [], "is_private": false}]