[{"count": 0, "tags": [], "text": "The following patch contains a WebDAV prototype done in January 2005,\nbut not finished yet because of lack of time. I want to contribute\nit to the lenya community as there seems to be some effort to bring WebDAV\nintegration a step ahead.\n\nThe following modifications/enhancements are included:\n\n- Replacement method for isCheckedOutByUser() with a more meaningful\n  method which returns the user name who checked out the document\n  or null if the document is not checked out at the moment.\n  Redefinition in src/java/org/apache/lenya/cms/repository/Node.java\n  \n  Unfortunately, it was not possible to reconcile my implementation with\n  the current head revision (LCR 387571) because there is a class\n  implementing this interface, org.apache.lenya.cms.repo.adapter.RepoNode,\n  which does not have a getter method for the RevisionController to get\n  the identity of the user who checked out the document.\n\n- Refactoring of the method getMimeType() in\n  src/java/org/apache/lenya/cms/repository/SourceNode.java.\n  The mimetype of a document is saved in Dublin-Core format field.\n  Every document should have its mime-type defined in this (mandatory) field as\n  it is used to determine the document's extension (needed for proper\n  WebDAV handling; uses the newly added class\n  src/java/org/apache/lenya/util/MimeTypeHelper.java for mapping mime-types\n  to extensions).\n\n- Refactoring of\n \nsrc/java/org/apache/lenya/cms/cocoon/components/modules/input/CustomMetaDataModule.java\n  Uses a different call syntax, defined as follows:\n \n{custom-metadata:{attribute-name}:{publication-id}:{area}:{document-language}:{document-id}}\n\n- Refactoring of getExtension() method of\n  src/java/org/apache/lenya/cms/publication/DefaultDocument.java\n  Uses the MimeTypeHelper class to deduce the extension from the document's\n  mime-type. Used for WebDAV file names.\n  \n- Refactoring of resource-type modules' sitemaps. Uses a new call syntax\n  defined as follows:\n  /format:{publication-id}:{area}:{docid}:{doc-lang}:{format}:{rendertype}\n  whereas format may be xhtml, text, webdav, etc.\n  This is an nice solution to get documents in different formats independent\n  of the current publication. The WebDAV prototype makes use of this.\n\n- WebDAV Prototype in module webdav2.\n  Implements a WebDAVPropfindGenerator to return results on a PROPFIND request.\n  The generator is implemented in pure Java as opposed to the existing solution\n  based on jxtemplates. The generator is feature complete according to the\n  WebDAV standard (e.g. considering depth header, etc.),\n  there might be a need to implement some additional\n  legacy properties (e.g. for OpenOffice, Konqueror, etc.) for documents.\n  As of the time of writing the code the get request worked for all existing\n  example docment types as well as for the resource types.\n  \n  There are two matchers, one for documents and one for resources. The URL\n  space is handled differently from how it is done in the existing WebDAV\n  implementation. Each document is a collection containing the content and\n  its resources.\n  \n  WebDAVRequest parses a WebDAV request (currently PROPFIND requests only) and\n  dispatches the request to the right instance.\n  \n  To access the webdav2 prototype, use webdav2 instead of webdav in\n  the Lenya WebDAV URL.\n  \n- All document's meta files are enriched with the documents mime-type\n  (mandatory field).\n  \nThe WebDAV prototype is based on Doug Chestnut's WebDAV implementation and I\nwish to thank him for his great effort. I will not commit the prototype\ninto the repository but rather submit a patch for the ones who are interested\nin this topic. If there are any questions, I'm happy to answer them.", "is_private": false, "bug_id": 39051, "id": 87073, "time": "2006-03-21T18:18:25Z", "creator": "froethenbacher@apache.org", "creation_time": "2006-03-21T18:18:25Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 39051, "attachment_id": 17931, "text": "Created attachment 17931\nPatch for WebDAV prototype.", "id": 87074, "time": "2006-03-21T18:22:04Z", "creator": "froethenbacher@apache.org", "creation_time": "2006-03-21T18:22:04Z", "is_private": false}]