[{"count": 0, "tags": [], "text": "I have an ear application working with Jonas, served by an embedded tomcat. I \nhave installed the isapi connector with IIS6 and evertything works fine, but \nenviroment get lost inside the application. All the env-entry app parameters \nare some time not found by the application. When i open the tomcat http por \ndirectly (tcp port 9000) it works always, but when i use the IIS integration, \nit dont works. it is a prodduction enviroment, and i need to use IIS at http \nport, so i'm currently blocked.\n\nPD: Sorry for my poor english.", "is_private": false, "id": 87309, "creator": "ofc587a87@gmail.com", "time": "2006-03-27T09:39:49Z", "bug_id": 39113, "creation_time": "2006-03-27T09:39:49Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "What Tomcat version?  What JDK version?  Can you post the test code you're using\nto asset that the env-entry parameters are missing and/or a test script we can\nuse to reproduce your issue?", "attachment_id": null, "bug_id": 39113, "id": 88159, "time": "2006-04-17T15:36:06Z", "creator": "yoavs@computer.org", "creation_time": "2006-04-17T15:36:06Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 39113, "attachment_id": null, "id": 95515, "time": "2006-11-06T21:00:15Z", "creator": "markt@apache.org", "creation_time": "2006-11-06T21:00:15Z", "is_private": false, "text": "env-entry parameters are defined in web.xml, the processing of which is entirely\nindependent of the connector.\n\nThe only mechanism I can imagine where this might happen is some form of\nconfiguration error that leads to contexts you aren't expecting (that don't have\nthe env-entry settings defined) and IIS mapping requests to one of these\nunexpected contexts.\n\nWithout a test case there is nothing we can do to investigate this.\n\nGiven configuration error is the most likely cause I am resolving this as\nINVALID and suggest that if you still see this error you use the Tomcat users\nmailing list to confirm your configuration is correct. If your configuration is\ncorrect, please re-open this bug and attach a test case and I'll look into it\nsome more."}]