[{"count": 0, "tags": [], "bug_id": 39120, "text": "This is a minor feature request.\n\nAt present, if the \"path\" attribute is specified in a context.xml file embedded\nin the META-INF directory of a warfile, it is ignored and the context is\ndeployed as having the name of the warfile. This is inconvenient in a number of\nways:\n\n* It creates unnecessary complexity for the user by modifying the behavior of\nthe context.xml file depending upon how it is deployed.\n\n* It means that the warfile name cannot contain versioning information, making\nit more difficult for a systems administrator with no knowledge of a web\napplication's internals to determine the version of the deployed webapp.\n\nIt would be very nice if the \"path\" attribute of the context.xml file could have\nthe same semantic meaning (specifying the context path under which the webapp is\ndeployed) across all of the different deployment methods available. If the\n\"path\" attribute is not added or left blank, the current behavior can then be\nassumed as the default.\n\nThanks,\n\nKris Nuttycombe", "id": 87326, "time": "2006-03-27T18:59:09Z", "creator": "kris.nuttycombe@noaa.gov", "creation_time": "2006-03-27T18:59:09Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 39120, "is_private": false, "text": "This is not just an enhancement IMHO. Prior to Tomcat 5.5 the path element could\nbe set to something different from the filename of the war file / context\ndescriptor. Now it is being ignored and the context path is taken from the\nfilename of the context descriptor.\n\nThis is not only very inconvenient but also breaks our apps when upgrading from\nTomcat 5.0 to 5.5.\n\nChanging severity.", "id": 87933, "time": "2006-04-13T18:17:46Z", "creator": "carsten.guenther@scalix.com", "creation_time": "2006-04-13T18:17:46Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 39120, "attachment_id": null, "is_private": false, "id": 94131, "time": "2006-09-26T17:56:20Z", "creator": "kris.nuttycombe@noaa.gov", "creation_time": "2006-09-26T17:56:20Z", "text": "I'm giving this bug a bump to see if anyone could possibly take a look at it. As\nCarsten stated, this has broken the upgrade path for webapps from Tomcat 5.0 to\n5.5 and is quite inconvenient. At very least, could one of the Tomcat developers\npossibly comment upon it?\n\nKris"}, {"count": 3, "tags": [], "bug_id": 39120, "attachment_id": null, "text": "This is an intentional change in functionality between 5.0.x and 5.5.x\n\nThe docs weren't great about this - there are some fixes in SVN that will be in\n5.5.21 onwards. Further suggestions for documentation improvements are always\nwelcome but the requested functionality change will not be made.", "id": 95511, "time": "2006-11-06T19:01:13Z", "creator": "markt@apache.org", "creation_time": "2006-11-06T19:01:13Z", "is_private": false}]