[{"count": 0, "tags": [], "bug_id": 39238, "attachment_id": null, "id": 87669, "time": "2006-04-07T14:22:44Z", "creator": "js@jscomputerworks.com", "creation_time": "2006-04-07T14:22:44Z", "is_private": false, "text": "Apache 2.0.55 on win2000 with mod_auth worked great. I disabled mod_auth and \ntried mod_auth_dbm with no AuthDBMGroupFile directive since all I want to check \nare username and password. Got the error message \"configuration error:  couldn't \ncheck access.  No groups file?\". A google check of this revealed that many \ndifferent authentication schemes were encountering this error message and I \ndidn't see any answers. After much configuration experimentation, I re-enabled \nmod_auth along with mod_auth_dbm, and then mod_auth_worked! I suspect this \ndependency is not wanted.  As a minimum, the mod_auth_dbm documentation should \nnote this dependency."}, {"count": 1, "tags": [], "bug_id": 39238, "attachment_id": null, "is_private": false, "id": 87671, "time": "2006-04-07T16:14:11Z", "creator": "trawick@apache.org", "creation_time": "2006-04-07T16:14:11Z", "text": "I posted this to the development list a while back but didn't get any feedback.\nDoes it work for you (i.e., allow mod_auth_dbm to stand on its own two feet)?\n\nhttp://people.apache.org/~trawick/auth_dbm.txt"}, {"count": 2, "tags": [], "creator": "bnicholes@apache.org", "is_private": false, "text": "The dependancy actually exists in the httpd core rather than with the modules \nthemselves.  The problem is that the ap_run_check_user_id and the \nap_run_auth_checker hooks are tied very closely together in the request \nprocessing.  Without mod_auth loaded, there is no valid-user handler \nimplemented.  And since you decided not to use the group authorization \nhandler, nothing handled the ap_run_auth_checker hook so it threw an error.  \nUnfortunately the error message, rather than telling you what really happened, \ngave you some error about \"no groups file\" which is targeted directly at \nmod_auth.  \n\nThis issue will still exist in Apache 2.2 but the auth architecture of 2.2 \nmakes it more clear that you need to have the correct authz module loaded to \nhandle the authorization hook.  Apache 2.3 eliminates this problem by \ndecoupling the various auth hooks and extending the definition of \nauthorization.  mod_auth_dbm in Apache 2.3 will work as you expect it to.  But \nunfortunatly the 2.3 functionality can not be back ported into 2.0 or 2.2.  \nHowever, Jeff's patch should get you what you want.", "id": 87676, "time": "2006-04-07T16:42:01Z", "bug_id": 39238, "creation_time": "2006-04-07T16:42:01Z", "attachment_id": null}]