[{"count": 0, "tags": [], "bug_id": 39277, "attachment_id": null, "id": 87807, "creation_time": "2006-04-11T22:25:01Z", "time": "2006-04-11T22:25:01Z", "creator": "jonathan.addison@wyona.com", "text": "This is a follow-up to bug#39019 (removing read-only restriction in Word 2003).\n The goal is to output a .wordml file using a server-side xhtml2wordml\ntransformation, edit with Word 2003, save, and transform back using a\nserver-side wordml2xhtml transformation.", "is_private": false}, {"count": 1, "tags": [], "creator": "jonathan.addison@wyona.com", "attachment_id": 18075, "is_private": false, "id": 87809, "time": "2006-04-11T22:46:45Z", "bug_id": 39277, "creation_time": "2006-04-11T22:46:45Z", "text": "Created attachment 18075\nadd ability to edit wordml files with webdav\n\nThis patch creates a second output file for each document with a .wordml\nextension, so the tutorial page shows as both tutorial_en.html and\ntutorial_en.wordml in the webdav folder.  I used wordml as the extension to\nmake it explicit but it could be changed to xml or even doc.  The default\nwebdav GET matcher was also changed from davget.xml to davget.html to match its\noutput format and simplify the pipelines.\n\nTwo stylesheets were added for transforming to and from wordml on the server:\nxhtml2wordml.xsl and wordml2xhtml.xsl.\tOriginally these transformations were\nbeing done within Word, but Word has a bug when fetching stylesheets from a\nwebdav or http address on saving so we switched to doing the transformations\nserver-side.  A benefit is that the Professional version of Word 2003 is no\nlonger needed because the advanced xml features aren't needed when the file is\nwordml.  There is also a free plugin available that lets you use the wordml\nformat with older versions of Word, but I have not tested it yet.\n\nThe stylesheets only implement a basic subset of xhtml at the moment (p, h1-h6,\nem, strong, a).  They also restrict what styles are available while editing in\nWord, which is useful for enforcing markup guidelines.\tThe wordml2xhtml.xsl\nalso has support for tables and lists, a big thanks to Josias for adding this."}, {"count": 2, "tags": [], "bug_id": 39277, "attachment_id": 18131, "id": 88233, "time": "2006-04-18T22:05:58Z", "creator": "jonathan.addison@wyona.com", "creation_time": "2006-04-18T22:05:58Z", "is_private": false, "text": "Created attachment 18131\nadded change to odt module to previous patch"}, {"count": 3, "tags": [], "bug_id": 39277, "text": "Could someone please review + apply this? Or should we schedule it for 1.4.1?", "id": 102671, "time": "2007-04-30T09:05:55Z", "creator": "andreas@apache.org", "creation_time": "2007-04-30T09:05:55Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 39277, "attachment_id": null, "text": "i don't use word.\nthe patch looks very clean, but i don't like how everything gets stuffed into\nthe xhtml module. using the format mechanism for wordml certainly makes sense,\nbut i'd be more comfortable if we had a separate xhtml2wordml module... \nbut i wonder: how much demand is there for such a feature? the word-to-web stuff\ni've seen in the past has been the antithesis of standards-compliance and\nsemantic structure - does it really make sense to encourage people to publish\nfrom word?", "id": 102676, "time": "2007-04-30T09:21:03Z", "creator": "nettings@apache.org", "creation_time": "2007-04-30T09:21:03Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 39277, "text": "Considering that this is over a year old now, I'm sure the patch would need to\nbe resubmitted with corrections to the sitemaps.\n\nWe could also create a word module similar to the opendocument module to hold\nthe stylesheets.\n\nAnd Joern, if you are curious about the semantic structure you may want to read\nthe description above and have a look at the stylesheets.  Most Word-to-web\nstuff doesn't use WordML directly but rather has other transformations performed\nbefore saving, which is where a lot of the non-compliance comes in.  These\nstylesheets work directly on the wordml and keep only the elements you want. \nRight now there is only a minimal set of xhtml elements supported so it is\nstandards compliant.\n\nI would save this for 1.4.1.", "id": 102702, "time": "2007-04-30T17:49:38Z", "creator": "jonathan.addison@wyona.com", "creation_time": "2007-04-30T17:49:38Z", "is_private": false, "attachment_id": null}]