[{"count": 0, "tags": [], "creator": "brett-hunsaker@automation-software.com", "attachment_id": null, "text": "The description of the Registry and Registry-Strict parameters is imprecise \nwhen it references which registry value is used.  The current implementation \nuses the (Default) value of the key.\n\nMightI suggest the following description:\n\nSetting ScriptInterpreterSource Registry will cause the Windows Registry tree \nHKEY_CLASSES_ROOT to be searched using the script file extension (e.g., .pl) as \na search key. The command defined by the default value of the registry subkey \nShell\\ExecCGI\\Command or, if it does not exist, by the default value of the \nsubkey Shell\\Open\\Command is used to open the script file. If the registry keys \ncannot be found, Apache falls back to the behavior of the Script option.\n\nFor example, the registry setting to have a script with the .pl extension \nprocessed via perl would be:\n\nHKEY_CLASSES_ROOT\\.pl\\Shell\\ExecCGI\\Command\\(Default) => C:\\Perl\\bin\\perl.exe -\nwT\n\nSecurity\n\nBe careful when using ScriptInterpreterSource Registry with ScriptAlias'ed \ndirectories, because Apache will try to execute every file within this \ndirectory. The Registry setting may cause undesired program calls on files \nwhich are typically not executed. For example, the default open command on .htm \nfiles on most Windows systems will execute Microsoft Internet Explorer, so any \nHTTP request for an .htm file existing within the script directory would start \nthe browser in the background on the server. This is a good way to crash your \nsystem within a minute or so.\n\nThe option Registry-Strict which is new in Apache 2.0 does the same thing as \nRegistry but uses only the default value of the subkey Shell\\ExecCGI\\Command. \nThe ExecCGI key is not a common one. It must be configured manually in the \nwindows registry and hence prevents accidental program calls on your system.", "id": 87947, "time": "2006-04-13T19:02:35Z", "bug_id": 39306, "creation_time": "2006-04-13T19:02:35Z", "is_private": false}, {"count": 1, "text": "Patch added:  http://svn.apache.org/viewvc?view=rev&rev=560011\nShould be visible within a few hours or so. Sorry for the delay.\n\nCheers,\nTony\n", "creator": "tony@pc-tony.com", "attachment_id": null, "id": 105984, "time": "2007-07-26T14:53:17Z", "bug_id": 39306, "creation_time": "2007-07-26T14:53:17Z", "tags": [], "is_private": false}]