[{"count": 0, "tags": [], "creator": "delbd@oma.be", "is_private": false, "id": 88039, "attachment_id": null, "bug_id": 39310, "creation_time": "2006-04-14T09:33:06Z", "time": "2006-04-14T09:33:06Z", "text": "Because jsp are converted to servlet by jasper, and because, as i understood, \njsp are not unloaded/reloaded unless they change, once a jsp has been \naccessed, it remain in tomcat memory as long as webapplication is running. If \nan applications has a lot of jsp with a lot of static content inside the jsps, \nthis whole set of datas remain in memory while the dedicated place to store \nsuch data should be the system disk. If the server runs for enough time, you \nend up loading all your .jsp content inside java memory, uselessly consuming \nmemory.\n\nThe memory consumption could be reduced by externalizing the static part of \nthe jsp. If you look at a jasper generated jsp .java file, you see lots of \nlines like\nout.print(\"this is some static content\\n\");\n\nif jasper was to create a separate file storing all this static content, along \nwith a caching system for performances, that would reduce a lot the memory \nfootprint of some generated jsp. \n\nyou could for example end up with a servlet having a code similar to this\nString[] jsp_jasper_messages = acquireStaticText();\n...\nout.print(jsp_jasper_messages[53]);\n\nthis way, tomcat is not forced to use too much memory. the String[] could be \nloaded on demand from disc and unloaded when not used using a cache mecanism."}, {"count": 1, "tags": [], "creator": "remm@apache.org", "is_private": false, "id": 88044, "attachment_id": null, "bug_id": 39310, "creation_time": "2006-04-14T10:23:48Z", "time": "2006-04-14T10:23:48Z", "text": "This was proposed earlier on the Tomcat development mailing list, and I refused\nadding this feature."}, {"count": 2, "tags": [], "bug_id": 39310, "attachment_id": null, "text": "Sorry for that, could you provide a link to corresponding ml thread?\nThanks.", "id": 88049, "time": "2006-04-14T11:36:49Z", "creator": "delbd@oma.be", "creation_time": "2006-04-14T11:36:49Z", "is_private": false}]