[{"count": 0, "tags": [], "bug_id": 39328, "is_private": false, "text": "It would be very useful to add a facility to XML Schema Assertion to use part \nof the response or a variable. This comes very handy for validating Web \nServices Response Messages which are wrapped in SOAP. This utility would enable \nvalidation of embedded XML messages against its schemas, thus eliminating the \nneed to modify original schemas to add SOAP definitions.", "id": 88171, "time": "2006-04-17T19:49:51Z", "creator": "amelaao@gmail.com", "creation_time": "2006-04-17T19:49:51Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 39328, "is_private": false, "text": "Created attachment 19217\nPatch for the XMLSchema assertion and GUI files using rel-2-2 as the base.\n\nI have substantially modified the XML Schema assertion with the patch above. \nIt will now accept multiple XSD files and validate an XML response based on all\nof the XSD types.\n\nThe GUI class is /very/ rudimentary as I know next to nothing about Swing.  I\nused the AssertionGui class as a basis for the new XML Schema interface.  The\ntext rows need to be cleaned up to not allow multiple lines in each row.  A\nbetter interface would be nice as well.\n\nThe XMLSchemaAssertion class probably needs to be tightened up somewhat as\nthere is little to no parameter checking.  In addition, the\ninternationalization properties file stuff needs to be checked by someone that\nknows more about it than I.", "id": 96544, "time": "2006-12-05T14:59:17Z", "creator": "pkuyken@gmail.com", "creation_time": "2006-12-05T14:59:17Z", "attachment_id": 19217}, {"count": 2, "tags": [], "bug_id": 39328, "is_private": false, "text": "Thanks for the patch.\n\nNot sure what happened - there seem to be a lot of spurious changes in the \npatch - makes it quite difficult to follow what has actually changed. Would it \nbe possible to generate a patch which shows the changes more clearly? [e.g., \none of the method parameters has been renamed]", "id": 96547, "time": "2006-12-05T15:52:01Z", "creator": "sebb@apache.org", "creation_time": "2006-12-05T15:52:01Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "pkuyken@gmail.com", "attachment_id": 19218, "is_private": false, "id": 96571, "time": "2006-12-06T11:10:28Z", "bug_id": 39328, "creation_time": "2006-12-06T11:10:28Z", "text": "Created attachment 19218\nUpdated patch for XML Schema assertion using rel-2-2 as base\n\nI've updated the patch file.  It seems that my IDE took it upon itself to\nchange all of the indents and whatnot.\tThe patch is still rather significant.\n\n\nXMLSchemaAssertion Change notes:\n-----------------------------------------------------------------------------\n\nThe main structural change is to move the meat of the setSchemaResult() method\ninto getResult() method however the actual logic that resided in\nsetSchemaResult() changed very little.\n\nIn the patched version of XMLSchemaAssertion at line 145 is the only change\ndone to the actual parsing portion of the code.  Instead of passing in a single\nString containing a filename, a String array is passed with each element being \nan XSD filename that should be included in the validation.  \n\nLines 124-138 were added to read pull the XSD filenames from the test plan\nstructure.\n\nThere were several unused attributes methods that were removed and attributes\nand corresponding accessor methods were added to support the additional\nfunctionality.\n\nI cleaned up the import list to reflect the new import requirements.\n\nI removed several (now) unused String constants.\n===========================================================================\n\nXMLSchemaAssertionGUI change notes:\n---------------------------------------------------------------------------\n\nSo much of XMLSchemaAssertionGUI has changed that it is practically a rewrite. \nI based the GUI class on the AssertionGui class.  There are some issues with\nthe list, mainly being able to have multiple lines in the entry.  Like I said\nbefore, Swing isn't my forte so I'll defer those changes to someone more\nknowledgeable."}, {"count": 4, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "is_private": false, "id": 99220, "time": "2007-02-10T05:23:43Z", "bug_id": 39328, "creation_time": "2007-02-10T05:23:43Z", "text": "Unfortunately I cannot apply the patch as it stands.\n\nThis is because it would invalidate any existing test plans, as the property \nthat stores the file name has been renamed, and is now a list, not a string.\n\nThe test element needs to be able to work with existing test plans."}, {"count": 5, "tags": [], "creator": "pkuyken@gmail.com", "attachment_id": null, "is_private": false, "id": 99221, "time": "2007-02-10T06:05:51Z", "bug_id": 39328, "creation_time": "2007-02-10T06:05:51Z", "text": "I understand.  I have not had available time to modify the code to work with the\nold test plans.  If I have get some free time I will continue to work on the\nfeature, but the priority slipped very low.  The feature can either be left in\nNEEDINFO or moved to LATER if it is a more appropriate resolution type."}]