[{"count": 0, "tags": [], "creator": "jparrpearson@galdosinc.com", "text": "When using an aggregate report for a thread with a loop count (either on the \nthread or using a loop controller) the 'Throughput' column is not calculated \ncorrectly.\n\nFor example:\nI have a loop count of 4 on a thread that has one request (so it should execute \nthe request four times when I run the test group).  Here are the time and \nthroughput values from a sample run taken from JMeter:\n\nResponse Time (s, from 'View Results in Table' report) - Average Throughput \n(#/min, from 'Aggregate Report')\n1. 23.1s - 2.6/min\n2. 22.6s - 1.9/min\n3. 23.6s - 1.7/min\n4. 22.9s - 1.6/min\n\nNotice how the response times are very similar, yet the average throughput \nvalue as reported by JMeter decreases and is not consistent with what we would \nexpect.  If we add up the time for all four requests we get 102.2s or ~1.6 \nminutes, which is what the aggregate report shows.  However this is not taking \ninto account that this is for four iterations of the same request over that \ntime, not just one.  The actual value should be very close to 2.6/min as \nreported after the first request since all the times average to about 23s.\n\nAs a result, it appears that the calculation does not correctly factor the \nnumber of loops executed (either on the thread group or on a loop controller \nwithin the thread) into the calculation when reporting the throughput value on \nthe aggregate report.", "id": 88182, "time": "2006-04-17T23:55:10Z", "bug_id": 39330, "creation_time": "2006-04-17T23:55:10Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 39330, "attachment_id": null, "id": 88184, "time": "2006-04-18T00:36:28Z", "creator": "sebb@apache.org", "creation_time": "2006-04-18T00:36:28Z", "is_private": false, "text": "Are there any timers in the test plan?"}, {"count": 2, "attachment_id": 18126, "bug_id": 39330, "text": "Created attachment 18126\nExample JMX File (Multiple requests and one timer in a thread)\n\nThe attached file (example.jmx) is a subset of a test plan I am using.\tThere\nis one thread with three requests and a timer (0.5s - negligible).  I have done\nsome additional investigation and when there is only one request in the thread\nJMeter displays the correct throughput value (even after multiple loops), but\nwith more than one request the throughput value decreases (according to JMeter)\nwhen we would expect it to stay the same.  We have checked the server logs and\nthe timestamps after a test run and do not calculate any decrease in\nthroughput.\n\nWhat is the exact throughput calculation and queuing model being used by\nJMeter?  Perhaps it is different from what I assumed it to be.", "id": 88215, "time": "2006-04-18T16:31:01Z", "creator": "jparrpearson@galdosinc.com", "creation_time": "2006-04-18T16:31:01Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "text": "It would be helpful to have an example JTL file in either CSV or XML format. \nMake sure that the time stamp and time fields are present; thread name would \nalso be useful. No need for response data etc.", "id": 88217, "time": "2006-04-18T17:46:59Z", "bug_id": 39330, "creation_time": "2006-04-18T17:46:59Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 39330, "attachment_id": null, "id": 88219, "time": "2006-04-18T17:53:42Z", "creator": "sebb@apache.org", "creation_time": "2006-04-18T17:53:42Z", "is_private": false, "text": "Remember that the timer will apply to all samples.\n\nAlso, all the listener output files will contain exactly the same data (unless \nyou have specified different fields)"}, {"count": 5, "tags": [], "bug_id": 39330, "attachment_id": 18128, "id": 88221, "time": "2006-04-18T19:35:00Z", "creator": "jparrpearson@galdosinc.com", "creation_time": "2006-04-18T19:35:00Z", "is_private": false, "text": "Created attachment 18128\nExample JTL Output File\n\nThe attached JTL file is the Aggregate Report output from JMeter when running\nthe attached JMX test plan.\n\nI know that the timer value will be used in the calculation, but 0.5s is\nnegligible when compared to the ~23s response time for the requests (Q1\nespecially).  Even without the timer I get the same results; when there is more\nthan one request the throughput is not calculated as I would expect."}, {"count": 6, "tags": [], "creator": "sebb@apache.org", "text": "When I load the JTL file in the aggregate report listener, it shows the\nindividual throughput as about 1.6 samples/min; overall throughput as 4.5/minute.\n\nThe test ran for 161069 milliseconds = (final start time + final elapsed time -\ninitial start time), and there were 12 samples.\n\nI make that (12*60)/161.069 = 4.47 samples per minute, which agrees with the\nAggregate report.\n\nThe slight variation in the other throughput figures is no doubt due to the\nslightly different overall times for the other samples (I've not done the\ncalculations)\n\nWhat should the Aggregate Report do differently?", "id": 88236, "time": "2006-04-18T22:20:58Z", "bug_id": 39330, "creation_time": "2006-04-18T22:20:58Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 39330, "attachment_id": null, "text": "Just looking at one of the samples, Q1, the problem is that JMeter is reporting \n1.6 samples/min, when the actual value should be close to 2.6 samples/min.  \nJMeter correctly reports 2.6 samples/min when Q1 is the only sample in the \nthread group after all 4 loop iterations.  However, when additional samples are \nadded to the thread group the throughput is listed as only 1.6 samples/min for \nQ1 when the response times are consistent and the throughput should stay the \nsame (~2.6).\n\nIf a sample takes about 23 seconds to complete (and all the samples were very \nclose to this time) and the timer value is negligible (.5s) it would make sense \nthat after all 4 loop iterations the throughput would be about (23s + timer + \nJMeter think time goes into a minute about 2.6 times) 2.6 samples/min not 1.6 \nsamples/min.\n\nAm I misunderstanding the way JMeter should calculate this throughput value, or \nis there a bug when more than one sample is in a thread that throws this \ncalculation off?", "id": 88237, "time": "2006-04-18T22:36:38Z", "creator": "jparrpearson@galdosinc.com", "creation_time": "2006-04-18T22:36:38Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 39330, "attachment_id": null, "id": 88240, "time": "2006-04-18T23:13:40Z", "creator": "sebb@apache.org", "creation_time": "2006-04-18T23:13:40Z", "is_private": false, "text": "When calculating the aggregate throughput of a particular sample type, JMeter\ntakes into account the total time over which those samples were generated. \nThat is how it appears to the server.\n\nThe other samples in the thread also take time to run. For the purpose of\ncalculating throughput of Sample Q1, samples Q2 & Q3 might as well be timers.\n\nOK?"}, {"count": 9, "tags": [], "bug_id": 39330, "text": "I see how JMeter handles it now, although this is not the value I want (I will \nhave to calculate it myself with the JMeter output).  Maybe this should be \ndocumented better in the component reference or elsewhere; that samples will \ninfluence the other samples' throughput and reporting values within the same \nthread.  When looking over the component reference for the Aggregate Report and \nother places this is not apparent.\n\nThanks for your help Sebb.", "id": 88243, "time": "2006-04-18T23:24:51Z", "creator": "jparrpearson@galdosinc.com", "creation_time": "2006-04-18T23:24:51Z", "is_private": false, "attachment_id": null}, {"count": 10, "tags": [], "bug_id": 39330, "attachment_id": null, "text": "I'll update the documentation.\n\nIf you want to suggest a different calculation method, please raise a Bugzilla\nenhancement request, and we'll see about incorporating it in a future release.", "id": 88245, "time": "2006-04-18T23:34:40Z", "creator": "sebb@apache.org", "creation_time": "2006-04-18T23:34:40Z", "is_private": false}]