[{"count": 0, "tags": [], "bug_id": 39331, "text": "It would be nice to be able to call nested objects with the input tags.  For\nexample, <input:text name=\"person.address.zip\" .../> would translate to a call\non the default bean of getPerson().getAddress().getZip().\n\nIt would also be very helpful to be able to specify the optionMap and\noptionValues and optionLabels as bean names to be looked up in the request to\nget the Map instead of only expecting a Map object in the property itself.  So,\nfor example, <input:select name=\"color\" options=\"themap\"/> would look up the\nattribute \"themap\" in the request object, find the corresponding value of type\nMap (put there by the controller) and use that for the options.", "id": 88187, "attachment_id": null, "creator": "mh983@yahoo.com", "creation_time": "2006-04-18T04:16:16Z", "time": "2006-04-18T04:16:16Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 18117\nA Patch to the input taglib to provide nested calls and request lookup for options map.\n\npatches Util.java and Select.java from the input tree.\n\nfirst time submitting a patch.\tplease let me know if I missed anything.", "is_private": false, "id": 88188, "creator": "mh983@yahoo.com", "time": "2006-04-18T04:18:18Z", "bug_id": 39331, "creation_time": "2006-04-18T04:18:18Z", "attachment_id": 18117}, {"count": 2, "tags": [], "text": "Thanks for this Mike, and my sincere apologies that it is just over a year later that I reply to this bug. \nThis is a great idea. It would need to work backwards-compatibly with previous usage, so we would \nneed to add some extra attribute or something to let the taglib know that it could treat \".\"s like that... \nperhaps even a beanProperty=\"person.address.zip\" option.\n\nI believe that the best option is actually to use the new \"value\" attributes and EL, eg. <input:text \nname=\"zip\" value=\"${person.address.zip}\" /> then you have complete flexibility over the name field. \nThis renders the \"bean\" attribute only useful for simple forms, but I think that is appropriate. The \ngeneral direction seems to be to use EL for doing this kind of bean accessing, and the new \"value\" \nattribute enables this to work properly.\n\nI'm going to close the bug, hoping that this is a satisfactory solution for you as well (if you're still \ninterested in a solution after all this time!).\n\ncheers,\nKarl ", "is_private": false, "bug_id": 39331, "id": 102010, "time": "2007-04-22T01:30:19Z", "creator": "karl@xk72.com", "creation_time": "2007-04-22T01:30:19Z", "attachment_id": null}]