[{"count": 0, "tags": [], "bug_id": 39359, "attachment_id": null, "text": "We're currently looking into some problems with filespecs and return codes on \nOpenVMS.  These are two areas where OpenVMS is very different from Unix-like \noperating systems.  \n\nFilespecs on OpenVMS have a different format than standard Unix filespecs.  A \nconversion routine to convert between the Unix-style and OpenVMS-style formats \nis already in FileUtils.java, but it is out of date since it assumes (older) \nODS-2 style OpenVMS filespecs, and the current format is ODS-5 style.  We \npropose to update this routine to support the conversion of ODS-5 style \nOpenVMS filespecs to/from Unix-style filespecs.\n\nIn addition, OpenVMS normally returns a 1 for success from functions and \nsystem calls, for failures it returns a value which is a predefined error code \n> 1.  However, Java assumes that the return value is the number of errors \nencountered, which means that 0 is successful.  We're proposing changes to \nExecute.java to control which return style is used (conditionally on OpenVMS \nsystems) by checking the value of a logical name on OpenVMS (like an \nenvironment variable).\n\nAlso in Execute.java, some changes to the way certain DCL commands are built \nwill enable tasks like <exec/> to work properly.  At this time, if the \nargument to <exec/> is an image represented by a Unix-style filespec, the \n<exec/> will fail. \n\nAs an example, a test suite that reproduces these problems is \n\nTest: org.apache.tools.ant.taskdefs.SignJarTest\n[test-junit] Tests run: 32, Failures: 2, Errors: 19, Time elapsed: 284.826 sec \n\nWith your permission we will post the entire test results (from OpenVMS) \nbefore and after and the patches here to this bug report.", "id": 88297, "time": "2006-04-19T20:16:07Z", "creator": "Meg.watson@hp.com", "creation_time": "2006-04-19T20:16:07Z", "is_private": false}, {"count": 1, "tags": [], "creator": "antoine@apache.org", "attachment_id": null, "text": "We are interested in your test results and in your suggested patches.\nAre you sure that there are no more systems around wit this ODS-2 format ?\nI know nothing about OpenVMS.\n\nRegards,\n\nAntonie", "id": 88355, "time": "2006-04-21T14:01:20Z", "bug_id": 39359, "creation_time": "2006-04-21T14:01:20Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 39359, "is_private": false, "id": 88358, "time": "2006-04-21T14:05:54Z", "creator": "Meg.watson@hp.com", "creation_time": "2006-04-21T14:05:54Z", "tags": [], "text": "Thank you.  We're working on testing the changes right now.\n\nODS-5 is a superset of ODS-2 so extending support to ODS-5 will not prevent \nODS-2 support from working.  \n\nI'll post the diffs and the test results (before and after) later today.  \n\nI also posted a question to the dev mailing list about naming suggestions for \na property to control the return status from Ant (small change to isFailure \nfor OpenVMS).\n\nMeg"}]