[{"count": 0, "tags": [], "bug_id": 39441, "attachment_id": null, "id": 88615, "creation_time": "2006-04-28T04:24:58Z", "time": "2006-04-28T04:24:58Z", "creator": "thomasw@connectorsystems.co.nz", "text": "Hi guys,\n\nfirst:\n--   I think you guys really need to be listening to the feedback in this area,\nand not just telling people they can go elsewhere. This kind of answer says more\nabout *your* code and whether it is up to scratch, due to its defensive/\naggressive nature, than about anything else.\nPlease have a *proper* look at the Deployer stuff because having tried several\napproaches, and read quite a lot of docs, and having used TC for some time now;\nthis all seems less than happy to me.  \nPlease talk to the project manager if there is still any confusion. --\n\n\nI've been trying some slightly different Webapp Deployment under Tomcat 5.5 and\nrun into problematic behaviours, with most of the Context specification methods.\n\nMy goal is simple: to make Manager and my 'eonaJava' webapp available at\n/tomcat/manager and /tomcat/eonaJava paths within a largely Apache/ PHP system.\n\nAttempt 1, problem 1:\n- specifying Contexts into 'server.xml' with path and docBase\n- setting path as '/tomcat/eonaJava' etc\n- files deployed under 'webapps'\n\nThis approach worked on the surface, but was deploying the app twice behind the\nscenes. It would appear the code fails to recognize 'docBase' matching with my\nexplicitly-specified contetx path, or some such, don't really care.\n\nIt worked for a while, but during debugging I realized that 'reloading' the app\nwas reloading the wrong context; my code changes & deploy/ restart script were\nnot resulting in changed behaviour in the executed app. \n\nBTW, behaviour of the app I was testing is socket-based in this area. \n\n\nAttempt 2, problem 2:\n- specifying Contexts into conf/[engine]/[host]/eonaJava.xml with path and docBase\n- setting path as '/tomcat/eonaJava' etc\n- files deployed under 'webapps'\n\nThis worked great. For a while. Later on, it appears to have auto-magically\nremoved the 'web.xml' file from the webapps/eonaJava/WEB-INF folder. Then\neverything was broken.\n\n\nLook, you guys already have a Working directory separate from where I can place\nmy webapps. My deploy script copies files from development machine onto the host. \n\nMy analysis is that if I am responsible for copying one set of files, I should\nbe responsible for copying the context file too. I'm not going to give\nwebservers access to my dev machine.\n\nI think the conf/ Context file mechanism should *parallel* the file deployment\nmechanism. As pointed out, you guys have a 'working' directory which I don't\ncopy files into directly. You can create or delete, as required, over there. \n\nI expect my uploads, into the well-known and time-honoured 'webapps' directory,\nto be honoured and not treated as your second working (read 'mangling') directory.\n\n\nPLEASE REFER this to the PROJECT MANAGER because I think there may be some\nserious conceptual problems here.\n\n\nNow, there had been quite a lot of warnings from Deployer about docBase being\ninside appBase. \n\nTraditionally, webapps have always gone in the webapps/ folder. I tried the\nconf/ AppName/xml context mechanism since your doc warned that server.xml might\nnot be supported in future.\n\nI'm going to state at this point, that \n1) the documentation isn't clear or good enough.\n2) major conceptual changes in Deployer behaviour and directory ownership are\nbeing introduced  \n   (my contention is that these aren't logically sound, either)\n3) recognition of Apps to avoid double-deployment is broken/\n\n\nInvestigation 3, problem 3, not proceeded with:\n- looked at the doc for using META-INF/context.xml inside the webapp.\n- some docs recommend against this for security reasons.\n\nDidn't proceed with this due to 1) needing to specify the  Manager  with an\nexplicit context-path and it being outside of webapps  and 2) security\nrecommendation against and need for extra directory.\n\n\nAttempt 4, successful so far:\n- went back to Contexts in 'server.xml'\n- set 'autoDeploy' false\n- set 'deployOnStartup' false\n\nThis is still not satisfactory, due to the failure to match contexts under the\nsame docBase and incorrect double-deployment.\n\nI should be able to copy my webapp files somewhere (let's go wild and say,\nperhaps, webapps/), copy an explicit context descriptor somewhere and have\nTomcat deploy that application:\n1) once only,  and\n2) according to my descriptor\n\nI cannot see how the Tomcat 5.5 deployer fulfills these fundamental requirements\nin a correct manner.\n\nAs stated, there also appear to be significant conceptual problems with who owns\nthe webapps directory. In the past this has traditionally been owned by the\ndeveloper; with perhaps 'assistive' help from Tomcat.\n\nWith the 5.5 Deployer this appears to be treated more like a second working\ndirectory. You've already got a directory, please stop tromping on my\napplication deployment area.\n\n\n----\n\nTomcat is a great product, and I respect the work that you guys have put into\nit, but the reason I've put the header and this footer is that I've already read\nthe NG threads etc and I think you guys need to have a real think about this and\ntalk with the product manager. \n\nThanks for your great work and the best server development environment in existence,\n\n\nRegards\nThomas", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 39441, "is_private": false, "id": 88621, "time": "2006-04-28T10:06:12Z", "creator": "remm@apache.org", "creation_time": "2006-04-28T10:06:12Z", "tags": [], "text": "Ok, so you have specific needs. This is great, but at this point, there does not\nseem to be anyone willing to redo the deployer just so that we can support your\nuse case. Even if there was, it is extremely difficult to do something with\nmaximum flexibility. I think you should simply write a very small listener,\nwhich would programmatically deploy the webapps you need, or something similar.\nAnother major problem is that this report reads like a giant rant, like there\nare more and more of them these days. You should probably post to the user list\nif you'd like to understand better how to use the deployer, but I'd recommend\nasking questions there in a more friendly manner (shorter email, with fewer rants).\n\nPlease do not reopen the report."}, {"count": 2, "tags": [], "bug_id": 39441, "is_private": false, "text": "Remy,  please forward this the tomcat Product Manager for review.\n\nNo, I don't believe I have any special needs whatsoever.  Just the ability to\nspecify basic Context details, for what I have deployed.\n\nThe fact that there are issues with this,  sticks out like a sore thumb. (!)\n\nPerhaps you could kindly either forward me the email of the Product Manager, who\ncan either enlighten me/ or address the issues I've raised.  This way we can\ndetermine what to do without necessarily being tedious by re-opening the issue.\n\nThanks.\nThomas\n", "id": 88685, "time": "2006-05-01T00:33:35Z", "creator": "thomasw@connectorsystems.co.nz", "creation_time": "2006-05-01T00:33:35Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "(In reply to comment #2)\n> Perhaps you could kindly either forward me the email of the Product Manager, \nwho\n> can either enlighten me/ or address the issues I've raised.  This way we can\n> determine what to do without necessarily being tedious by re-opening the \nissue.\n> Thanks.\n> Thomas\n\nTo the extent that there is a Product Manager on an Open Source project like \nTomcat, the email address would be remm <at> apache.org (aka Remy :).\n\n", "is_private": false, "bug_id": 39441, "id": 88686, "time": "2006-05-01T00:41:25Z", "creator": "william.barker@wilshire.com", "creation_time": "2006-05-01T00:41:25Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 39441, "attachment_id": null, "is_private": false, "id": 88687, "time": "2006-05-01T01:07:55Z", "creator": "thomasw@connectorsystems.co.nz", "creation_time": "2006-05-01T01:07:55Z", "text": "saw your response on the 'tomcat-dev' list, William.\n\nok - for now I'm going to go away and read up heavy on the docs, just in case\nthis thing *might* make sense.\n\nHOWEVER--\n1)  off the cuff, the 'concept' here seems unsound\n2)  NG posts and others with simple/ trivial needs, are finding problems here?\n       ... and being given the shove-off like from Remy just above  :-)\n3)  i'm going to call this early as SMELL.\n\ni'll come back to you guys once I determine in-depth whether I'm right or wrong.\n\none thing for you guys to think about:  \nTomcat already has a 'working' directory.\n"}]