[{"count": 0, "tags": [], "text": "Hi,\n\nWe have been using Apache Proxy Server and we have noticed some strange \nbahavior w.r.t network usage.\n\nThe network usage of Apache Proxy server and the client machine which is \nconnected to it are being monitored. A download \n(http://ftp.surfnet.nl/ftp/pub/os/Linux/distr/fedora/1/i386/iso/) have been \ninitiated from the client machine. Before the download gets completed, it is \ncancelled from the client.\n\nIt is noticed that the network usage of Apache Proxy Server is still high, \neven if the download gets cancelled and it remains high for considerable time( \nthe time equivalent for the entire download to complete). \n\nWhat are the reasons for this behavior?\n\nTo ascertain the fact that Proxy server still process the download, when it is \ncancelled from client, we did few more tests with only one client connected to \nApache Proxy. \n\n1. Download initiated from client, cancelled it after 20 minutes. The after 20 \nminutes, the Apache Proxy Server is stopped.\n\nIt is noticed that as soon as download is initiated, the network bandwidth \nusage (transmit bps ) by Apache Proxy Server goes high ( almost 0.8 Mbps ). \nWhen the download is cancelled from client, the transmit bps of Apache proxy \nserve remains same. \n\nOnly when Apache is stopped, the transmit bps comes down (obvious). In one of \nthe tests, Apache was not stopped, and monitored the transmit bps, which has \nremained high for the time equivalent to complete download time.\n\n2. Two proxy servers were used in the second test, where the client is \nconnected to first Apche Proxy Server, which is connected to Second Proxy \nServer.\n\nThe download is initiated from client, cancelled it from client, then First \nApache Proxy Server is stopped and Finally Second Apache Proxy Server is \nstopped.\n\nWhen the download is cancelled, the transmit bps of both the First Apache \nProxy and Second Apache Proxy remains high. Even if the First Proxy Server is \nstopped, the transmit bps of Second Proxy Server remains high.\n\n\nWe would like to know why is such behavior being exhibited by Apache Proxy. \n\nIn case, more information is required, I can send more details.\n\n\nThanks and Regards,\nSaleem.", "attachment_id": null, "id": 88617, "creator": "saleem@cordys.com", "time": "2006-04-28T06:11:01Z", "bug_id": 39442, "creation_time": "2006-04-28T06:11:01Z", "is_private": false}, {"count": 1, "tags": [], "creator": "saleem@cordys.com", "text": "Hi,\n\nThe same issue is found to be reported earlier. See the bug \"\nBugzilla Bug 138359 – mod_proxy ignores abortion of downloads\" in the \nlink \"https://bugzilla.redhat.com/bugzilla/show_bug.cgi?id=138359\" for details.\n\nIt is found that the problem is solved in httpd-2.0.46-54.1.\nThis distribution is available at http://people.redhat.com/jorton/Taroon-httpd/\n\nThe later versions of Apache (later to httpd-2.0.46-54.1) doesn't have the \npatch. \n\nWhy is the patch not included in the later versions? How far will the patch \neffect the current releases of Apache?\n\n\nRegards,\nSaleem.", "id": 88951, "time": "2006-05-09T09:16:42Z", "bug_id": 39442, "creation_time": "2006-05-09T09:16:42Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "jorton@redhat.com", "attachment_id": null, "id": 88957, "time": "2006-05-09T14:15:29Z", "bug_id": 39442, "creation_time": "2006-05-09T14:15:29Z", "is_private": false, "text": "The fix for this was added in 2.0.53 and later, it may have regressed since then\nsince there has been significant churn in the proxy code.\n\n*** This bug has been marked as a duplicate of 32443 ***"}]