[{"count": 0, "tags": [], "bug_id": 39444, "attachment_id": null, "id": 88623, "time": "2006-04-28T11:44:07Z", "creator": "Bodo.Piehl@web.de", "creation_time": "2006-04-28T11:44:07Z", "is_private": false, "text": "I read in the documentation in chapter \"A word on Contexts\" the text\nbelow.\n\nIf I put a war-file (which doesn't contain a META-INF/context.xml) into\nthe webapps-dir, the war-file is extracted and the webApp deployed, e.g.\non startup.\n\nBut afterwards the Context Descriptor isn't autogenerated and placed in\n  $CATALINA_HOME/conf/[enginename]/[hostname]/\nas expected.\n\nAs a result my webApp is deployed every startup again.\n\n----\nContext Descriptors not only help Tomcat to know how to configure\nContexts but other tools such as the Tomcat Manager and TDC often use\nthese Context Descriptors to perform their roles properly.\n\nThe locations for Context Descriptors are;\n\n   1. $CATALINA_HOME/conf/[enginename]/[hostname]/context.xml\n   2. $CATALINA_HOME/webapps/[webappname]/META-INF/context.xml\n\nIf a Context Descriptor is not provided for a Context, Tomcat\nautomatically creates one and places it in (1) with a filename of\n[webappname].xml although if manually created, the filename need not\nmatch the web application name as Tomcat is concerned only with the\nContext configuration contained within the Context Descriptor file(s).\n----"}, {"count": 1, "tags": [], "text": "To add to this bug if you supply a webapps/[application]/META-INF/context.xml \nwith the following content:\n\n<Context path=\"/[PATH]/[APPNAME]\"></Context> or\n<Context path=\"/[PATH]/[APPNAME]\"/>\n\neg. <context path=\"/foo/barplication\"/>\n\nThe context.xml does get copied to engine/host/[APPNAME].xml.  But the [PATH] \nappended before the name of the context does not work. So:\nhttp://localhost:8080/foo/barplication  - does not work but\nhttp://localhost:8080/barplication -  does work just as though there were no \ncontext descriptor at all.\n\nThe only way I have been able to get the path attribute to work is if I add \nthe context tag to my server.xml <host>, which according to the documentation \nis not recommended and not really what I want to do.", "attachment_id": null, "id": 95673, "creator": "davidpaterson@verizon.net", "time": "2006-11-10T13:17:21Z", "bug_id": 39444, "creation_time": "2006-11-10T13:17:21Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 39444, "attachment_id": null, "id": 100909, "time": "2007-03-25T14:11:30Z", "creator": "yoavs@computer.org", "creation_time": "2007-03-25T14:11:30Z", "is_private": false, "text": "Guys, while we recognize that these specific examples may be annoying, the\nTomcat dev team has more or less decided to not do further refactoring or\nenhancement on the Tomcat 5.x auto-deployment mechanism.  The plethora of\noptions available in automatic application deployment were intended to make life\neasier, but resulted in a lot of complicated and somewhat fragile code.  Now\nthat Tomcat 5.x is in maintenance mode, serious changes to this code are -1ed on\nthe grounds that they're as likely to break some people's deployment setups as\nthey are to help others, such as yourselves.\n\nTomcat 6 is a different story.  It's got improved deployment code, simpler\ndeployment code, and since it's the currently active development branch,\nenhancement requests like yours are more likely to get done.  Please try Tomcat\n6 (6.0.10 is the latest stable release at this time), and let us know what you\nthink via the mailing list(s)."}]