[{"count": 0, "tags": [], "creator": "apowers+asf@cmu.edu", "is_private": false, "text": "This is a minor feature request for usability.\n\nSummary: when using the copy task and overwrite is false (or none is set,\ndefaulting to false) and verbose is true, and it decides not to overwrite, copy\nshould print that it's not overwriting the files because they exist. Currently,\nin 1.6.5, copy doesn't print anything in this case.\n\nThis is a usability issue, for a couple reasons. Imagine the following task:\n     <copy file=\"a\" todir=\"folder/\" verbose=\"true\"/>\nAfter execution, the user sees no output, gets confused because usually copy\ngives output in verbose mode when it copies or fails. Next, the user checks the\nfile time -- and the file time still says yesterday. The user really gets\nconfused, maybe thinking this is a bug.\n\nIf the user is used to the unix \"cp\" command, the default is to overwrite\nwithout asking, not caring whether the files are the same or not, so the default\nbehavior of copy might be unintuitive to users unfamiliar with the \"overwrite\" flag.\n\nThe simple fix is to have copy print something in this case, such as \"File ___\nnot overwritten because source file has not been updated\" in verbose mode when\noverwrite is false.\n\nMy reason: In my experience, this has happened twice (several years apart) and\neach time it took me quite a few hours to track down the functionality of copy\nand figure out why it wasn't happening -- should have been obvious if I'd looked\nin the right places, but it wasn't.\n\nThere might be a separate issue that I haven't tracked down yet. On my setup\nwhen overwrite is false (by default) it's not overwriting even though the source\nfiles have a newer modification date. (I'm using Linux, Fedora Core 3, ant 1.6.5\nin Eclipse). This is a separate issue that I haven't tracked down yet but may be\na separate entry if I find an actual bug there.", "id": 88995, "time": "2006-05-10T14:36:06Z", "bug_id": 39544, "creation_time": "2006-05-10T14:36:06Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 39544, "attachment_id": null, "is_private": false, "id": 88997, "time": "2006-05-10T15:20:23Z", "creator": "mbenson@apache.org", "creation_time": "2006-05-10T15:20:23Z", "text": "There should already be such a verbose warning being issued by the code that\nchecks files for up-to-date-ness.  But if your files are not being overwritten\nanyway, I would think that issue would be the thing to scrutinize."}]