[{"count": 0, "tags": [], "bug_id": 39646, "attachment_id": null, "is_private": false, "id": 89401, "time": "2006-05-23T18:26:44Z", "creator": "prashanthsukumaran@yahoo.com", "creation_time": "2006-05-23T18:26:44Z", "text": "Hi,\n\nWe have an application in the public space deployed on Sun Sparc Solaris 7, \nTomcat 5.5.12, Jdk1.4.2_10.  Every thing is fine about this configuration.  \n\nWe would like to provide the users a single sign on like functionality. Since \nit is in the secured space(https) the reverse proxy, challenges back with a \nlogin page.  So I am screen scraping this login page and do a post along with \nthe cookies to get the secure space.\n\nThe weird thing is that, all of a sudden my application in the public space \nthrows an UnknownHostException, when getting to the application in the secured \nspace. We are having intermittent problems for the last 6 months.  We had the \nsame problem with Tomcat 4.1.29. \n\n      WebApp   -------> Screen Scraping ------>   WebApp\n [Public Space](http)                         [Secure Space](https)\n\nWhen i restart tomcat i don't get this exception anymore, only to start \nthrowing this exception after a few hours.  I even tried setting the \nnegative.ttl = 0 in the java.security in my jvm. \n\nAny idea what could be causing this?  Please Help.\n\nThanks\nPrashanth."}, {"count": 1, "attachment_id": null, "creator": "markt@apache.org", "text": "As far as I can tell from your description, it is your application that is doing\nthe screen scraping and the reverse proxying. If this is the case, I can't see\nhow a Tomcat bug could be causing the issue you are seeing. It looks more like\nan application bug or network problem to me. Restarting Tomcat will, of course,\nalso restart your applciation.\n\nI suggest you try the tomcat users mailing list for assistance. If you can find\nsomething that points to Tomcat being the problem, and better yet provide a way\nwe can reproduce the issue, then please feel free to re-open this issue.", "id": 90179, "time": "2006-06-14T03:01:21Z", "bug_id": 39646, "creation_time": "2006-06-14T03:01:21Z", "tags": [], "is_private": false}]