[{"count": 0, "tags": [], "bug_id": 39692, "text": "mod_proxy_balancer doesn't appear to retry requests that fail before completing.\n\nFor example with the setup, two Tomcat servers connected to an Apache server\nbalanced with mod_proxy_balancer.  If I manually kill one of the Tomcat servers\nduring a long request, the request continues until timeout (and eventual 503\nService Unavailable result).  Shouldn't mod_proxy_balancer really timeout and/or\nread the response code and then retry the request (thus pushing it onto a\nfailover server)?", "id": 89619, "time": "2006-05-31T14:48:28Z", "creator": "rednetnoc_suoires@yahoo.co.uk", "creation_time": "2006-05-31T14:48:28Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "rpluem@apache.org", "text": "It may be a good idea to have this somewhat configurable like this is possible\nwith mod_jk's recovery_options\n(http://tomcat.apache.org/connectors-doc/config/workers.html), but as a default\nI would prefer leaving it as it is.\n\n1. The retry behaviour should be only allowed for requests that are idempotent\naccording to RFC2616 9.1.2, see also 8.1.4 of RFC2616. \n2. Even methods marked as idempotent as GET are not always idempotent, e.g. if\nthey have a query string.\n3. You cannot resend the request to a different Tomcat once you have sent out\ndata to the client. This would corrupt the response.", "count": 1, "id": 89623, "time": "2006-05-31T19:47:25Z", "bug_id": 39692, "creation_time": "2006-05-31T19:47:25Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 39692, "attachment_id": null, "id": 89654, "time": "2006-06-01T15:03:47Z", "creator": "rednetnoc_suoires@yahoo.co.uk", "creation_time": "2006-06-01T15:03:47Z", "is_private": false, "text": "After some careful thought to your reply, I think you are indeed correct in how\nmod_proxy_balancer should, by default, respond with a failure mid-request.  It\nis not the responsibility of the proxy to know if a request is idempotent or not\nand so cannot retry assuming that it is.\n\nIt would be nice to see this configurable as per mod_jk's recovery_options\nhowever as it is possible to develop web requests so they are idempotent and an\nautomated proxy retry (even if corrupted due to a part-written response) could\nbe useful."}]