[{"count": 0, "tags": [], "creator": "nmix@pandora.com", "attachment_id": null, "text": "It is unsafe to use a mod-rewrite rule that transfers a portion of the path into the query string.  This is \nbecause it is not possible to encode the matching portion of the path to be a safe query value.  For \nexample, if I wanted to rewrite:\n  /foo/bar+baz\ninto:\n  proxy:http://www.domain.com/blah?arg=bar%2Bbaz [last]\nI'm out of luck because it is impossible to translate the '+' in the path into it's query-string-safe \nequivalent, '%2B'.  As a result, the destination server will decode the query arg into \"bar baz\", removing \nthe '+'.\n\nAccording to the documentation, I can escape URLs using the RewriteMap directive:\n\n  RewriteMap escape int:escape\n  RewriteRule /foo/(.*) proxy:http://www.domain.com/blah?arg=${escape:$1} [last]\n\nHowever, this doesn't work because the escape method doesn't do what one would expect based on \ncasual reading of the docs.  The escape method is a pass-through to ap_escape_uri, which in turn is a \nmacro for ap_os_escape_path.  The docs could reasonably lead one to believe that the escape method \nmakes a string safe for use in a query string (i.e. url-encodes the string).  Instead, it makes the string \nsafe for use as part of a file name.  (I think.)  Several query-string-unsafe characters are not encoded by \nthis method, and the set of encoded characters varies from platform to platform.\n\nI would recommend a fix that augments mod_rewrite's list of internal map functions.  First, deprecate \nint:escape.  Next, create int:escape_path which does the same thing that the deprecated int:escape \ndoes.  Last, create int:escape_query which url-encodes the value for safe use as a query-string value.\n\nIf there is general agreement that this is the correct fix but developer resources are lacking, let me \nknow (or re-assign to me) and I can take a stab at creating a patch.  (Although it may be a long while in \ncoming.)", "id": 89849, "time": "2006-06-07T00:01:29Z", "bug_id": 39739, "creation_time": "2006-06-07T00:01:29Z", "is_private": false}, {"count": 1, "tags": [], "creator": "bobsiegen@googlemail.com", "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of 32328 ***", "id": 98541, "time": "2007-01-25T19:03:10Z", "bug_id": 39739, "creation_time": "2007-01-25T19:03:10Z", "is_private": false}]