[{"count": 0, "attachment_id": null, "bug_id": 39756, "text": "After successfully authenticating with a valid LDAP user account the \"require \nvalid-user\" directive fails to authenticate the user.\n\nThe issues appears to be located in the method authz_ldap_check_user_access \nand related to the variable method_restricted being set to 1. This variable is \nset to 1 when the requirements loop has at least one element and as far as I \ncan tell the \"require valid-user\" counts as an item for this loop, which is \ncausing the method_restricted to be set to 1 when it shouldn't.\n\nIdeally the requirements loop shouldn't be executed at all of a require valid-\nuser is specified. (Not sure how this effects a Satisfy Any directive as well).\n\nAs a work around, I suggest using the \"require ldap-group\" directive and place \nall users in one group. Alternatively you could use the \"require ldap-filter\" \nand specify a wild-card, which will cause this method to return true.", "id": 89928, "time": "2006-06-08T07:49:56Z", "creator": "cullin@emaildatasource.com", "creation_time": "2006-06-08T07:49:56Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "Florian.Dufour@inrialpes.fr", "attachment_id": null, "text": "\"require valid-user\" with ldap auth works for me (Apache 2.2.3 and OpenLDAP).\n\nMaybe you forgot to set the AuthzLDAPAuthoritative directive to off (as said in\nthe docs : http://httpd.apache.org/docs/2.2/mod/mod_authnz_ldap.html#reqvaliduser) ?", "id": 92075, "time": "2006-08-09T06:10:39Z", "bug_id": 39756, "creation_time": "2006-08-09T06:10:39Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 39756, "attachment_id": null, "id": 92081, "time": "2006-08-09T14:21:18Z", "creator": "bnicholes@apache.org", "creation_time": "2006-08-09T14:21:18Z", "is_private": false, "text": "\"require valid_user\" is not handled by mod_authnz_ldap.  It is handled by \nmod_authz_user.  If AuthzLDAPAuthoritative is not set to off, mod_authnz_ldap \nwill try to handle valid_user, discover that it can't and since it is \nauthoritative, it will fail the request.  Turn off AuthzLDAPAuthoritative to \nallow mod_authz_user to handle the authorization."}]