[{"attachment_id": null, "tags": [], "creator": "barbwest@avaya.com", "is_private": false, "count": 0, "id": 90309, "time": "2006-06-16T20:03:11Z", "bug_id": 39826, "creation_time": "2006-06-16T20:03:11Z", "text": "In a webapp I am working on, we are storing attributes in the HttpSession \nobject that are used for user authentication and authorization. A filter is \nbeing used to look at each URL and insure the associated user is authorized to \naccess that URL. I can reliably reproduce a problem where the HttpSession \nobject does not persist across the entire user session. Within less than a \nminute, I see the HttpSession object change (id changes and we loose all of the \nsession attributes). I am using Java 1.5.03 with Tomcat 5.5.9. Is this a know \nproblem and is there any work around?"}, {"attachment_id": null, "tags": [], "creator": "yoavs@computer.org", "text": "1. No it's not a known bug (to me at least)\n2. I can't reproduce it on 5.5.17 (the latest stable release at this time): if\nyou have a test case that shows this  behavior, please attach it to this issue.\n3. Please retry your testing on Tomcat 5.5.17, and maybe even JDK 1.5.0_07 (the\nlatest stable JDK at this time) if you can, and see if the behavior is the same.\n4. Bugzilla is not ideal forum for discussion: workarounds, debugging\napproaches, and more are typically best handled on the Tomcat mailing lists. \nPlease see http://tomcat.apache.org/lists.html for subscription information.", "count": 1, "id": 90310, "time": "2006-06-16T20:29:39Z", "bug_id": 39826, "creation_time": "2006-06-16T20:29:39Z", "is_private": false}, {"count": 2, "attachment_id": null, "creator": "fhanik@apache.org", "is_private": false, "id": 90311, "time": "2006-06-16T20:30:53Z", "bug_id": 39826, "creation_time": "2006-06-16T20:30:53Z", "tags": [], "text": "Try it with 5.5.17, if the problem persist, attach a test case."}, {"count": 3, "tags": [], "bug_id": 39826, "text": "No test case provided, can't reproduce.\n\nIf re-opening this bug please provide the simplest possible testcase that\nreproduces it.", "id": 94997, "time": "2006-10-19T16:18:41Z", "creator": "markt@apache.org", "creation_time": "2006-10-19T16:18:41Z", "is_private": false, "attachment_id": null}]