[{"count": 0, "text": "Sir,\n  The problem i am facing with Tomcat3.2.1 is given in detail at the bottom and \ni have already sent a mail to jason hunter and his reply is also available for \nyour reference.I need a solution at the earliest as i have recommended ur \nproduct for our clients ,so need ur help at the earliest.please mail me the \nreply to my mail id provided.\nrgds\nrabia\n\n\nYou should talk with the Tomcat folks about this.  As mentioned in my\nbook, the behavior of the server when posts are too large depends on the\nserver and client.\n\n-jh-\n\nyrabia@dsqsoft.com wrote:\n \n> Sir,\n>    I am having a immediate requirement for which i need your help.My\n> requirement is,i need to upload a file to the server and the limit of the\n> file size is 5MB and if i try to upload a file greater than this then it\n> should redirect me to a error page which is just another servlet(catches\n> the error or exception and displays).I am using the latest\n> com.orielly.servlet package,that is the MultipartRequest file which is\n> provided by java servlet programming book.The server which i am using is\n> Tomcat3.2.1.The problem i am facing is,when i uplaod a file less than 5MB\n> then the file gets uplaoded very fast to the server,but when i try to\n> upload a file greater than 5MB then it does not redirect to error page nor\n> catches the exception but instead gives a popup Internet Explorer message\n> as \"The connection with the server was terminated abnormally\" and i dont\n> know how to proceed,i have tried all means but cannot find a\n> solution,please help me to solve the problem at the earliest.\n> rgds\n> Rabia", "creator": "yrabia@dsqsoft.com", "is_private": false, "id": 6403, "time": "2001-10-05T00:34:59Z", "bug_id": 3983, "creation_time": "2001-10-05T00:34:59Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "creator": "marc.saegesser@apropos.com", "text": "So far I have not been able to duplicate this problem using the latest code.  \nThe reported supplied a sample application that I ran in both standalone and \nbehind Apache 2.0 using AJP13.  ", "id": 7195, "time": "2001-10-26T07:01:41Z", "bug_id": 3983, "creation_time": "2001-10-26T07:01:41Z", "is_private": false, "attachment_id": null}]