[{"count": 0, "tags": [], "bug_id": 39849, "text": "Hi,\n\nIt could be that I've identified a bug in Apache that prevents large\nfiles from being downloaded successfully when a 'lower than default'\nTimeout setting is used in httpd.conf. I sent this to the mailing list first \nand waited for 6 days, but as there was no reply I'd thought I'd open a bug \nreport. \n\nMy apologies for not yet investigating this issue in more depth and providing a \nfull patch, but I just don't have the time and thought it would be better to \nreport it, to help creating a better Apache, than just to ignore the issue.\n\nA roundup of the issue:\n\n- We publish the following file:\n\n115120550 (size) May 22 17:21 Syllable-0.6.1-dev4.zip\n\nWhen this file is downloaded, the download halts intermediately, at\naround 24 MB. From the point of view of the server, it looks like the\ndownload completed succesfully. This is the same on the client side.\n\nThis was tested and identified as an issue with Apache 1.3.24, 2.0.58\n(both with added modules) and Apache 2.2.2 (clean install per bug\nreporting requirements, no additional modules). This was on the same\nserver, running RedHat 7.1 with Apache installed from source. A test\nwith another Apache 2.0.58 on a separate server showed the same issue,\nbut at a different point in the download.\n\nThis interruption occurred on one server after approximately 7 minutes,\nwhen the transfer had completed 24 MB. On the other server I tested,\nthis happened after 9 minutes, with a 20 MB completion rate. Downloads\nfrom faster connections (less than 6 minutes of transfer time) went\nsmoothly and without interruption.\n\nThe issue only occurs when the Timeout parameter in httpd.conf is\nlowered from its default of 300 seconds to 60 seconds. Note that this is\na common change, made to either improve performance or mitigate the\nimpact of certain types of denial of service attacks against the server.\nWhen changing the value back to its default of 300 seconds the download\ndoes complete correctly.\n\nNo entry appears in the error log, but a regular 200 request appears in\nthe access_log:\n\n203.59.90.155 - - [16/Jun/2006:08:19:14 +0000] \"GET\n/Syllable-0.6.1-dev4.zip HTTP/1.1\" 200 115120550\n\nThis was tested with Firefox, Internet Explorer and Wget, which all gave\nidentical results (with wget automatically retrying using a specified\nbyte-range so it did in fact complete the download).\n\nApache documentation mentions that Timeout defines the amount of time\nApache will wait for any of the following three things:\n\n- The total amount of time it takes to receive a GET request.\n- The amount of time between receipt of TCP packets on a POST or PUT\nrequest.\n- The amount of time between ACKs on transmissions of TCP packets in\nresponses.\n\nI've made a PCAP file of an interrupted transfer:\n\nhttp://www.daemon.be/apache-failed-down.cap\n\nIf you look at this file you can see that everything seems to go fine,\nand then suddenly at frame 25947, 7.35 minutes after the connection was\nestablished, the Apache server suddenly sends a packet with the fin,\npush and ack flags set. This disrupts the connection.\n\nAs such, none of the above conditions apply: (1) a GET request was\nreceived and is being served, (2) I don't really see any of both parties\nin the transaction being unresponsive. This shouldn't match the Timeout\nvalue. It appears somewhere in the download code the counter used to\nmeasure this timeout isn't being increased.\n\nIf you have issues replicating it with a different file, the original\nwhich caused us issues for quite a while prior us discovering the link\nwith the Timeout option can be found here:\n\nhttp://www.cilinder.be/syllable/Syllable-0.6.1-dev4.zip\n\nCheers,\nMaarten", "id": 90421, "time": "2006-06-21T09:01:40Z", "creator": "maarten@daemon.be", "creation_time": "2006-06-21T09:01:40Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 39849, "text": "Have you tried adding the following to your configuration file:\nEnableSendfile off\nEnableMMAP off\n\nI would guess on such an old version of redhat, it might be a broken sendfile.", "id": 90428, "time": "2006-06-21T09:25:51Z", "creator": "chip@force-elite.com", "creation_time": "2006-06-21T09:25:51Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "Hi Paul,\n\nThanks for your reply. On the RedHat box, I stopped the daemon, added these into\nhttpd.conf and restart it. Afterwards tested the download again, but it still\nfails. Tested this twice to make sure. Also note that the second machine on\nwhich I tested this was a Debian 3.1. \n\nCheers,\nMaarten", "attachment_id": null, "bug_id": 39849, "id": 90430, "time": "2006-06-21T10:08:20Z", "creator": "maarten@daemon.be", "creation_time": "2006-06-21T10:08:20Z", "is_private": false}, {"count": 3, "tags": [], "text": "Can you run strace against the httpd child when it is serving this file? The\ntechnique is:\n\n1. start the download\n2. run mod_status or \"netstat -pant\" or similar to find out the pid of the httpd\nprocess handling the download (compare against the client address)\n3. run \"strace -o /tmp/httpd.trace -p <pid>\" using the pid found in step 2\n\nthen attach the /tmp/httpd.trace here.\n", "is_private": false, "bug_id": 39849, "id": 90436, "time": "2006-06-21T12:32:47Z", "creator": "jorton@redhat.com", "creation_time": "2006-06-21T12:32:47Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "maarten@daemon.be", "attachment_id": null, "id": 90438, "time": "2006-06-21T13:21:26Z", "bug_id": 39849, "creation_time": "2006-06-21T13:21:26Z", "is_private": false, "text": "Hi Joe,\n\nThanks. Below is the output:\n\npoll([{fd=8, events=POLLOUT}], 1, 60000) = 0\nread(8, 0x8167960, 8000)                = -1 EAGAIN (Resource temporarily\nunavailable)\nwrite(7, \"203.59.90.155 - - [21/Jun/2006:1\"..., 101) = 101\nclose(8)                                = 0\nread(4, 0xbffff8e3, 1)                  = -1 EAGAIN (Resource temporarily\nunavailable)\nclose(9)                                = 0\naccept(3,  <unfinished ...>\n\nDespite the <unfinished ...> the process no longer showed up with netstat at the\ntime that I ended the strace.\n\nYou may also be interested in the fact that immediately after the download\nstarts (of a file which is 109.8 MB in size), the Send-Q value is immediately\nset to the size of the part that effectively downloads (so 24 MB). \n\nWhile doing the \"slow\" download as I described (60kb/sec) it goes into FIN_WAIT\nstate shortly after the download starts:\n\ntcp        0 4021417 64.246.44.158:80        203.59.90.155:60185     FIN_WAIT1   -\n\nWhen doing a \"fast\" download (900kb/sec), the Send-Q value increases again\nautomatically and the connection remains alive."}, {"count": 5, "tags": [], "creator": "jorton@redhat.com", "text": "The poll() call is a 60 second write timeout, which implicates packet\nloss/network congestion/network issues of some kind, as would a high send queue\nvalue from netstat.  There's nothing here really to indicate anything other than\nthat.", "id": 90441, "time": "2006-06-21T14:09:31Z", "bug_id": 39849, "creation_time": "2006-06-21T14:09:31Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "creator": "maarten@daemon.be", "attachment_id": null, "text": "Hi Joe,\n\nThat makes sense, however it's still strange that it's happening on two servers\nsimultaneously. To make sure no network issues are involved I'll build a new box\nwith a default install OS on a clean (local) network to try and replicate this\nissue. Will get back to you should it continue to appear.\n\nThanks again for your assistance.\n\nBest regards,\nMaarten\n", "id": 90442, "time": "2006-06-21T14:44:11Z", "bug_id": 39849, "creation_time": "2006-06-21T14:44:11Z", "is_private": false}, {"count": 7, "attachment_id": null, "bug_id": 39849, "text": "[please don't change bug owners, we rely on the default assignment to see updates]", "id": 90444, "time": "2006-06-21T15:43:32Z", "creator": "jorton@redhat.com", "creation_time": "2006-06-21T15:43:32Z", "tags": [], "is_private": false}, {"count": 8, "tags": [], "bug_id": 39849, "attachment_id": null, "id": 91381, "time": "2006-07-18T12:17:13Z", "creator": "jorton@redhat.com", "creation_time": "2006-07-18T12:17:13Z", "is_private": false, "text": "Any update?"}, {"count": 9, "tags": [], "creator": "maarten@daemon.be", "text": "Dear Joe,\n\nMy apologies for my late response. In the meanwhile we've tested this again on a\nphysically different network and indeed, the issue is no longer occuring. As\nsuch, this was likely indeed related to a timeout issue, and Apache was acting\ncorrectly. We're currently reviewing the network setup to pinpoint the exact\nissue, but are confident it is not related to the Apache software.\n\nThank you for your assistance in troubleshooting this issue.\n\nBest regards,\nMaarten", "id": 91579, "time": "2006-07-25T17:23:34Z", "bug_id": 39849, "creation_time": "2006-07-25T17:23:34Z", "is_private": false, "attachment_id": null}, {"text": "No problem, thanks for reporting back.", "tags": [], "creator": "jorton@redhat.com", "attachment_id": null, "count": 10, "id": 91598, "time": "2006-07-26T11:07:06Z", "bug_id": 39849, "creation_time": "2006-07-26T11:07:06Z", "is_private": false}]