[{"count": 0, "attachment_id": null, "bug_id": 39850, "text": "Currently there is no way to invalidate SSL-sessions that have been created for\na web application that use a SSL/TLS Connector. There is a request parameter\n(javax.servlet.request.ssl_session) that contains the SSL session-id but there\nis no API that gives access to the underlying SSL-session.\n\nInvalidating the SSL-session is important for web application that use SSL\nclient-authentication. Once a user is logged in to the application with a client\ncertificate, he will not be logged out until the SSL-session expires.\n\nTomcat should expose an interface to obtain a particular SSL-session so that it\ncan be invalidated when a user logs off. Or, even better, SSL-sessions should be\nautomatically invalidated when a HTTP-session is invalidated.", "id": 90429, "time": "2006-06-21T10:03:02Z", "creator": "gjkreeft@hotmail.com", "creation_time": "2006-06-21T10:03:02Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "yoavs@computer.org", "attachment_id": null, "text": "Once approved by the user, an SSL certificate will be considered valid for at\nleast the duration of the browser session (from\nhttp://tomcat.apache.org/tomcat-5.5-doc/ssl-howto.html).  In other words, this\nis controlled by the client, not by the server, as other places such as\nhttp://forum.java.sun.com/thread.jspa?threadID=790598&messageID=4498738 note. \nThat's why there's no Servlet Specification hook to let you do what you want,\nunlike with the HTTP session.  It's not a Tomcat issue.", "id": 100925, "time": "2007-03-25T15:07:02Z", "bug_id": 39850, "creation_time": "2007-03-25T15:07:02Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 39850, "attachment_id": null, "id": 101086, "time": "2007-03-28T01:03:45Z", "creator": "gjkreeft@hotmail.com", "creation_time": "2007-03-28T01:03:45Z", "is_private": false, "text": "The forum exactly illustrates the point I am trying to make. The existing\nSSL-session will let the user (or worse, some other user) back in to the\napplication without really loging in. The only way to prevent this is by closing\nall browser windows which will clear the SSL cache on the client side. But of\ncourse we can't expect our users to close all browser windows every time they\nlog off.\n\nA possible solution is to invalidate the SSL-session on the server side. The\nSSL-stack provides methods to find a particular SSL-session and invalidate it.\nThe problem is that you can't find the right SSLContext from a web application.\nI agree that there is no Servlet Specification that specifies this but it would\nbe nice if Tomcat could solve this problem. The best way to do this would be\ninvalidating the SSL-session when the HTTP-session is invalidated. That would\nmake it transparent to the application developer and does not require a\nproprietary extension on the Servlet API."}, {"count": 3, "attachment_id": null, "bug_id": 39850, "text": "We are also experiencing same problem. This makes client SSL authentication\nunreliable and really unusable in enterprise applications. It would be very nice\nif Tomcat could solve this problem.", "id": 101087, "time": "2007-03-28T01:08:12Z", "creator": "venia@4you.lt", "creation_time": "2007-03-28T01:08:12Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 39850, "attachment_id": null, "id": 101090, "time": "2007-03-28T04:09:02Z", "creator": "yoavs@computer.org", "creation_time": "2007-03-28T04:09:02Z", "is_private": false, "text": "It's never going to be automated invalidation because that might break existing\napps.\n\nPlease understand that WONTFIX is not the same as INVALID.  I closed the bug as\nWONTFIX because you (neither of you) didn't submit a patch, the issue is an\nenhancement and not a bug, and no one else was interested in even commenting on\nit in the year plus since it's been opened.\n\nI'm going to close it again as WONTFIX.  If you want to reopen it, please do so\nonly with a working patch attached.  I'll be glad to look at said patch and\ncommit it if applicable or at least discuss it.  But please don't reopen this\nissue just for the sake of reopening it."}, {"count": 5, "tags": [], "creator": "gjkreeft@hotmail.com", "attachment_id": null, "text": "Ok, thanks for the quick reply. I do not have a patch (or time to create one)\nthat implements the automtic invalidation. I agree that changing the behaviour\nof Tomcat might break existing apps but that can be fixed by by making this\nbehaviour configurable.\n\nI still hope this feature will be implemented in future versions of Tomcat\nbecause it is absolutely required when you use client authentication over SSL.", "id": 101142, "time": "2007-03-29T00:27:49Z", "bug_id": 39850, "creation_time": "2007-03-29T00:27:49Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 39850, "text": "Would it be acceptable if I'll try to create a path which will set session\nattribute kind of \"org.apache.tomcat.ssl.session\" with the SSLSession object\n(javax.net.ssl.SSLSession)?\n\nWe will be able to call invalidate() on that object.", "id": 101143, "time": "2007-03-29T00:34:03Z", "creator": "venia@4you.lt", "creation_time": "2007-03-29T00:34:03Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "fhanik@apache.org", "attachment_id": null, "text": "I'm not sure I understand, wouldnt simply \nresponse.getInputStream().close() take care of it? javax.ssl doesn't cache\nsession ids", "id": 101174, "time": "2007-03-29T12:48:19Z", "bug_id": 39850, "creation_time": "2007-03-29T12:48:19Z", "is_private": false}]