[{"count": 0, "tags": [], "bug_id": 39973, "attachment_id": null, "id": 90926, "time": "2006-07-06T02:36:22Z", "creator": "Dave@Yost.com", "creation_time": "2006-07-06T02:36:22Z", "is_private": false, "text": "Say apache-2.1.0 is running in /var/apache/. Now I want to build 2.2.2 and try it out using port 8080.\n\nIn the apache-2.2.2 src dir, I run\n  configure --prefix=/var/apacheTest\nso I won't clobber the running server, and I tweak the /var/apacheTest dir with a new httpd.conf file \nand maybe some symlinks to the live htdocs dir etc.\n\nThere are two problems with this approach:\n1. I have to build a special version of php etc. for the /var/apacheTest location.\n2. When I decide it's OK to cut over to 2.2.2, I have to re-configure and rebuild apache-2.2.2, php, etc. \nand take the server down while make install is clobbering things in /var/apache.\n\nIt seems to me that the solution is for apachectl to work like this:\n  apachectl start [ <apache-root-dir> ]\nThe only file that should maybe have an apache-root-dir path burned into it is apachectl itself, so it can \ndefault to the standard location.  But on unix even that is unnecessary because it is possible to deduce \nthe dir from which apachectl was executed by looking at argv[0].\n\nAll pathnames used in conf files and used by modules should normally be relative to apache-root-dir \n(whether it was given explicitly or defaulted to).  If you want to put stuff outside of the apache-root-dir \ntree, you can use full paths in conf files or you can use symlinks on platforms that support them.\n\nOr something like that.  Forgive me if I am missing something obvious."}, {"count": 1, "tags": [], "bug_id": 39973, "text": "A completely rational suggestion, I've reclassified it.", "id": 90939, "time": "2006-07-06T11:49:30Z", "creator": "wrowe@apache.org", "creation_time": "2006-07-06T11:49:30Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 39973, "attachment_id": null, "id": 90944, "creation_time": "2006-07-06T13:58:45Z", "time": "2006-07-06T13:58:45Z", "creator": "slive@apache.org", "text": "I believe this feature already exists.  \n\nCan you explain how this suggestion differs from\napachectl -d /path/to/serverroot\n\nIf you are saying that there are some paths used in httpd that are not relative\nto ServerRoot (and there probably are), than I agree that those should be fixed.\n But  the basic infrastructure is there.", "is_private": false}, {"count": 3, "tags": [], "creator": "Dave@Yost.com", "attachment_id": null, "text": "I don't see any mention of a -d argument on the apachectl doc page.\nhttp://httpd.apache.org/docs/2.2/programs/apachectl.html", "id": 90946, "time": "2006-07-06T14:37:29Z", "bug_id": 39973, "creation_time": "2006-07-06T14:37:29Z", "is_private": false}, {"count": 4, "tags": [], "creator": "Dave@Yost.com", "text": "If the apachectl -d option does exist, then is php just behind the times in its use of absolute paths into \nthe apache tree?  Is the infrastructure there for a module such as php to use the runtime apache /path/to/\nserver/root?\n\nZ% find /var/apache/php -type f | xargs strings -a | grep /var/apache\n     52     187   33203\n", "id": 90947, "time": "2006-07-06T14:48:03Z", "bug_id": 39973, "creation_time": "2006-07-06T14:48:03Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 39973, "attachment_id": null, "text": "Josuha, that wouldn't solve the issue, FWIW.\n\nI actually have written the same patch over and over which breaks\nout arg one (the action verb) and then allows the remaining args\nto be parsed in httpd command arg syntax.\n\nE.g.\n\n./apachectl start -d foo\n\ndoesn't work today.  With my patch, it does.\n\nBut apachectl would also have to load the proper bin/envvars that's\nrelative to the desired installation of apache, so your comment\ndoesn't actually contribute to solving the requested feature.", "id": 90948, "time": "2006-07-06T14:49:12Z", "creator": "wrowe@apache.org", "creation_time": "2006-07-06T14:49:12Z", "is_private": false}, {"count": 6, "tags": [], "creator": "Dave@Yost.com", "attachment_id": null, "text": "The first directive doc entry I looked at,\n  http://httpd.apache.org/docs/2.2/mod/core.html#directory\nsays, \"directory-path is either the full path to a directory, or a wild-card string using Unix shell-style \nmatching.\"\n\nIt says nothing about a path relative to ServerRoot.\n", "id": 90951, "time": "2006-07-06T15:11:10Z", "bug_id": 39973, "creation_time": "2006-07-06T15:11:10Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 39973, "attachment_id": null, "id": 90952, "creation_time": "2006-07-06T15:16:01Z", "time": "2006-07-06T15:16:01Z", "creator": "trawick@apache.org", "text": ">If the apachectl -d option does exist\n\nHere's the clue:\n\nIf apachectl doesn't see its traditional init script-style parameter\n(start/stop/restart/etc.), it assumes the command-line consists of httpd\nparameters, and passes them straight through to httpd.  That, and the fact that\nhttpd is a non-portable* way to start Apache 2+, are not clear from the\ndocumentation.\n\n*httpd may work perfectly, may not start at all, or may appear to work but with\nsuboptimal settings, depending on the platform and exactly how Apache was built\n\nIf we rework apachectl to expand its use, we should keep in mind some of the\nconfusion which has occurred with Apache 2+ with httpd options vs. apachectl\noptions, including confusion of users of binary builds which require apachectl.\n\nThe idea that apachectl is primarily an init script and should be symlinked to\nthe proper rc directory, or run directly with the familiar init script\ncommand-line, is a nice simplification.  Also, for every web server install a\nsuitable apachectl will be created which already has the proper install path.\n\nSeparately there is a value in a lower-level interface, but which unlike the\ncurrent httpd executable, also picks up the required settings from envvars, so\nthat the same low-level command-line works for source users and binbuild users\nand everything in-between.", "is_private": false}, {"count": 8, "attachment_id": null, "bug_id": 39973, "text": "First, regarding apachectl arguments, I think it is quite clearly documented at\nhttp://httpd.apache.org/docs/2.2/programs/apachectl.html\nthat apachectl also takes all the httpd arguments.\n\nWill: Your patch is not necessary.  Simply use\napachectl -k start -d /path\nI've made an effort to update the docs to discourage the use of the \"naked\"\ncommands for just this reason:  Using the \"-k\" format allows you to easily\nincorporate other options.  The sysv style naked commands should really only be\nused when you want apachectl to act as a sysv init script.  (And Jeff, we did\nhash this issue out a couple years ago.  I think the present compromise isn't\nthat bad and is relatively well-documented.  But of course the documentation can\nalways be improved.)\n\nWith regard to picking up the envvars from the right place, that I would buy as\na possible enhancement request, although I doubt that solving it really requires\na new apachectl command-line argument.  Perhaps just assuming that it lives in\nthe same directory as apachectl (since they are both installed to exp_sbindir)\nwould be sufficient.\n\nAnyway, this bug report has already gone off on several tangents and I suggest\nbringing the discussion to dev@httpd.", "id": 90956, "time": "2006-07-06T17:07:21Z", "creator": "slive@apache.org", "creation_time": "2006-07-06T17:07:21Z", "tags": [], "is_private": false}, {"count": 9, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "Oh, and Dave, the issue of <Directory> not being ServerRoot-relative is a whole\nother ball-of-wax.  It isn't really necessary for the common case of trying\ndifferent versions to have a ServerRoot-relative <Directory>, since you usually\nwant to point both versions at the same content.\n\nI wouldn't actually object to the concept of allowing ServerRoot-relative\n<Directory> entries.  But it could cause some confusion.  (Many people already\nassume that <Directory> is DocumentRoot-relative.)\n\nAnd as I mentioned, too many threads in this bug report.  If you want a\nServerRoot-relative <Directory>, you should start a new bug report.", "id": 90957, "time": "2006-07-06T17:11:33Z", "bug_id": 39973, "creation_time": "2006-07-06T17:11:33Z", "is_private": false}, {"count": 10, "tags": [], "bug_id": 39973, "attachment_id": null, "text": "I'm fine with defining some relative pathX as being relative to some pathY, as long as the relation is \ntransitive, resolving finally to ServerRoot.", "id": 90959, "time": "2006-07-06T17:30:00Z", "creator": "Dave@Yost.com", "creation_time": "2006-07-06T17:30:00Z", "is_private": false}, {"count": 11, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "id": 90961, "time": "2006-07-06T17:43:36Z", "bug_id": 39973, "creation_time": "2006-07-06T17:43:36Z", "is_private": false, "text": "Joshua, why are you arguing?\n\nThe request is that apachectl would not only trigger a different configuration\ntree (how you interpreted the request) but ALSO...\n\nthat you could pass an arguement to apachectl triggering a *different* apache\nhttpd binary and dependent libraries (envvars) path.  This could be used, for\nexample, to launch one of two binaries (e.g. one built event mpm, one built\nwith plain old worker mpm).  \n\nI find the request interesting, so I'm accepting the bug :)  apachectl is a\nfairly dirt simple stupid script that should basically work against any of\nthe installed httpd's, as long as it picks up the desired httpd binary and\nthe desired envvars dependent libraries path.\n"}, {"count": 12, "tags": [], "creator": "slive@apache.org", "text": "I don't mean to argue, but I see two problems here:\n\n1. Dave isn't interested in the same thing as you.  He wants to be able to pick\nup an apache installation, move it someplace else, and still have it work.  I\nactually think that is an interesting thing to be able to do, and there are\nvarious things we could do in httpd to make it easier.  But just fixing this one\nthing in apachectl wouldn't get you that far.  To work on that issue, I think he\nneeds a better understanding of what is already possible, and then to\nspecifically identify where he things the barriers are in separate bug reports\n(like ServerRoot-relative <Directory>, for example).\n\n2. You are proposing adding a third type of command-line argument to apachectl.\n We already have sysvinit-style arguments and httpd arguments and you want to\nadd apachectl-specific config arguments.  I think that is too complicated (or at\nleast, I can't imagine how to write clear and simple docs to explain it).  Two\nalternatives I see are: 1) use the assumption that httpd and envvars live in the\nsame directory as apachectl (doesn't solve the two-binaries in one install tree\nproblem you mention); or 2) tell people to copy and edit apachectl as needed. \nAs you mention, it is just a simple shell script -- that is, until we add too\nmany different command-line arguments.", "id": 90962, "time": "2006-07-06T18:15:32Z", "bug_id": 39973, "creation_time": "2006-07-06T18:15:32Z", "is_private": false, "attachment_id": null}, {"count": 13, "tags": [], "bug_id": 39973, "attachment_id": null, "id": 90964, "creation_time": "2006-07-06T18:55:11Z", "time": "2006-07-06T18:55:11Z", "creator": "wrowe@apache.org", "text": "To 1) above, yes if I've misunderstood, there is an issue.  httpd is not\nrelocation-friendly.  I presumed he had two parallel installs and wanted\nto use a single apachectl script.\n\nTo 2) above, yes, I don't like the syntax.  Propose your desired alternative\nand modify the subject line here.\n", "is_private": false}, {"count": 14, "tags": [], "creator": "Dave@Yost.com", "attachment_id": null, "text": "This is good.  You get it about what I' saying: \"He wants to be able to pick up an apache installation, move \nit someplace else, and still have it work.\"  I regret to say that this bug report is going to have to be a \ndrive-by shooting.  I'm pinch-hitting for a sysadmin, updating an apache installation, and I happened to \nnotice something important enough to say something in my RFE.  But I won't be around to post other \nrelated bugs.  I hope you do make the change.  It will be a great thing. And thanks loads for all your work.", "id": 90965, "time": "2006-07-06T19:27:42Z", "bug_id": 39973, "creation_time": "2006-07-06T19:27:42Z", "is_private": false}, {"count": 15, "tags": [], "bug_id": 39973, "attachment_id": null, "id": 91366, "time": "2006-07-17T18:05:32Z", "creator": "Dave@Yost.com", "creation_time": "2006-07-17T18:05:32Z", "is_private": false, "text": "Perhaps a test case will make this crystal clear:\n\nThree folders:\n  apache/             (contains 2.2.1)\n  apache-2.2.2/\n  apachedata/       (contains htdocs, conf, logs, etc.)\nThe first two folders contain no runtime data, only symlinks, like this:\n  ln -s ../apachedata/htdocs htdocs\n  etc.\n\n1. I should be able to start either of these servers and everything works.  Perhaps this is true today.  For \nthis to be true, nothing in the conf files should be required to reference the actual software folder.\n2. I should be able to do the following and have everything still work.\n     apache/bin/apachectl stop\n     mv apache apache-2.2.1\n     mv apache-2.2.2 apache\n     apache/bin/apachectl start\n3. It would be nice if configure would allow one to specify a separate folder for all runtime data and \nthen make all the appropriate symlinks.\n\nWith the problem stated this way, it appears that relative pathnames in the conf files is a nonissue, \nsince directives can simply use the full path to the apachedata/ folder."}, {"count": 16, "tags": [], "creator": "Dave@Yost.com", "text": "Changed the Summary", "id": 91367, "time": "2006-07-17T18:08:22Z", "bug_id": 39973, "creation_time": "2006-07-17T18:08:22Z", "is_private": false, "attachment_id": null}]