[{"count": 0, "tags": [], "creator": "bhushan.tari@iflexsolutions.com", "attachment_id": null, "is_private": false, "id": 91042, "time": "2006-07-10T06:56:56Z", "bug_id": 39998, "creation_time": "2006-07-10T06:56:56Z", "text": "Hi,\n\nI have an excel file. I have entered the value 1234 in a cell (without the \nsingle quote). But when i read the excel from my java program the value is \nbeing read as 1234.0. I am reading the value in a string variable. Also, if the \nnumber is big ex. 410012985 without the single quote, then it gets converted to \n4.10012985E8. I want the value and format of the number read to be retained as \nit is when i open the excel file through microsoft excel."}, {"count": 1, "tags": [], "creator": "yegor@dinom.ru", "attachment_id": null, "is_private": false, "id": 101950, "time": "2007-04-19T10:40:34Z", "bug_id": 39998, "creation_time": "2007-04-19T10:40:34Z", "text": "It's not a POI bug. What you see in Excel is not exactly the same what is stored\nin xls file. To get the formated values you need to do the following:\n\n (1) get raw value as double\n (2) get the cell formatter as follows:\n\n  HSSFDataFormat dataformat = workbook.createDataFormat();\n  short idx = style.getDataFormat();\n  String format = dataformat.getFormat(idx);\n\n  (3) create appropriate Java formatter and convert double to string\n\nRegards,\nYegor\n\n"}, {"count": 2, "tags": [], "bug_id": 39998, "is_private": false, "text": "Possibly this is slightly wrong.  A while back someone pointed out that we're\nnot going to the same precision that we should (possibly some functions should\nbe decoded as big decimals)", "id": 101951, "time": "2007-04-19T10:43:57Z", "creator": "poi-support@buni.org", "creation_time": "2007-04-19T10:43:57Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "Andy,\n\nI got the point.\n\nThe thread you are talking about is \"Numeric Cell Type not consistent\" from 28 \nFeb 2007. \n\nYegor", "is_private": false, "bug_id": 39998, "id": 101980, "time": "2007-04-20T03:17:23Z", "creator": "yegor@dinom.ru", "creation_time": "2007-04-20T03:17:23Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "himanshu.goyal@rs-components.com", "attachment_id": null, "id": 132281, "time": "2009-11-24T08:55:02Z", "bug_id": 39998, "creation_time": "2009-11-24T08:55:02Z", "is_private": false, "text": "Could you please paste a sample code to get the value displayed in Excel not what and how it is stored internally in Excel.\n\nI believe everyone is more interested in getting the same data as they see while opening the Excel document, not to go in the details of how Excel stores it (Text as numeric etc..)\n\nIf we have to do all of this again on each data type, It would be unnecessary piece of additional code that needs to be written when using apache poi library.\n\nfor example: If I as a user created an excel file and placed \"222\" as a value, what I wish from the library is to give me \"222\" and not \"222.0\" or something else based on how excel stores it internally.\n\nThe place where I had to use this to simply read the excel file and display them as a grid on the UI for user. Which when using Jexcel-API was displayed correctly (I am not sure what and how they display data, but this was what most of us are interested and expected) However when to support Excel 2007 document, I started playing with Apache POI I am stuck at the very first moment in reading the correct data.\n(Don't you think checking each column here for cell data type and converting to appropriate value for each column would be a pain and additional unnecessary code.)\n\nI do not understand why you being so ignorant in realizing the problems and seems more interested in discarding them.\n\nI hope you will realize the issue and will provide some sort of easy solution."}, {"count": 5, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "id": 132284, "time": "2009-11-24T09:01:05Z", "bug_id": 39998, "creation_time": "2009-11-24T09:01:05Z", "is_private": false, "text": "There is a very easy solution. However, this is not the place to ask for help with using POI / finding bits of the library to do what you want. It's for reporting bugs (hence the cunning name bugzilla).\n\nIf you'd taken 2 minutes to google, or asked on the mailing list, you'd have come across a class to do exactly what you want - \nhttp://poi.apache.org/apidocs/org/apache/poi/hssf/usermodel/HSSFDataFormatter.html"}]