[{"count": 0, "tags": [], "creator": "sczymaj@msls.de", "attachment_id": null, "id": 90993, "time": "2006-07-07T13:35:55Z", "bug_id": 39990, "creation_time": "2006-07-07T13:35:55Z", "is_private": false, "text": "Hi,\n\nwe are using CEWOLF to create charts. Works great if we talk to Tomcat directly.\nBut If we call Tomcat through Apache (2.0.55 with mod_jk 1.2.15 on Windows XP)\nthe Connector seems to pass wrong data to Apache, the image is broken and\nafterwards the connector keeps sending trash (the Servlet looks like a real mess\nuntil I restart tomcat).\n\nI was not abled to find any information about it, and if you want more\ninformation I'll do my best to provide it.\n\nRegards,\nS.Czymaj"}, {"count": 1, "tags": [], "bug_id": 39990, "attachment_id": 18569, "id": 90994, "time": "2006-07-07T13:36:48Z", "creator": "sczymaj@msls.de", "creation_time": "2006-07-07T13:36:48Z", "is_private": false, "text": "Created attachment 18569\nImage returned when accessing Tomcat directly\n\nImage returned when accessing Tomcat directly (via HTTP-connector)"}, {"count": 2, "tags": [], "bug_id": 39990, "is_private": false, "text": "Created attachment 18570\nImage returned when accessing via connector\n\nImage returned when accessing via connector (I got the image using the wget\ntool).", "id": 90995, "time": "2006-07-07T13:37:36Z", "creator": "sczymaj@msls.de", "creation_time": "2006-07-07T13:37:36Z", "attachment_id": 18570}, {"count": 3, "tags": [], "bug_id": 39990, "attachment_id": null, "id": 91031, "time": "2006-07-09T09:36:21Z", "creator": "mturk@apache.org", "creation_time": "2006-07-09T09:36:21Z", "is_private": false, "text": "Please use either Tomcat users list for that, or Tomcat dev list.\nThe reason your image is broken can be used to fix the mod_jk if\nyou don't provide additional debug data.\nIf other images can be server (and they can for years) then I\npresume you have a problem with your application that is not\nobserver by fault intolerant protocols and connectors."}, {"count": 4, "tags": [], "text": "I don't know what the tomcat users/dev-list is, and I don't know how I can make\nmod_jk produce any debug information, that's why I hoped someone here could help\nme on that.\n\nI'm sorry for bothering you. Please make sure my bugzilla account gets closed,\nI'm not going to use it anymore and I don't want to be dead freight to your\nBugzilla.\n\nThanks,\nS.Czymaj", "is_private": false, "id": 91045, "creator": "sczymaj@msls.de", "time": "2006-07-10T07:23:35Z", "bug_id": 39990, "creation_time": "2006-07-10T07:23:35Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "mturk@apache.org", "attachment_id": null, "id": 91048, "time": "2006-07-10T08:42:40Z", "bug_id": 39990, "creation_time": "2006-07-10T08:42:40Z", "is_private": false, "text": "There is no need to be sarcastic.\nYou obviously have no idea how open source works, and I'm very\nglad you have decided to not participate in this community any more.\nSince you have no idea what the Tomcat developer or Tomcat users\nlists are, you probably will neither receive any messages from\nit.\nNot sure if you can delete your bugzilla account, but since you\nwill not read this it doesn't matter anyhow.\n\nRegards."}, {"count": 6, "tags": [], "bug_id": 39990, "attachment_id": null, "text": "I'm sorry, you got me wrong. I did not want to be sarcastic, not at all.\n\nI'm really sorry for bothering you, because I was wrong putting my issue in\nhere. I'm pretty sure you have better things to do, and I'm using your time for\nsort of useless (at least from your point) things. Nothing more.\n\nAnd, indeed, I don't have any idea how open source development works, I'm not\npart of it and don't understand how you work, but I highly appreciate the work\nof everyone programming open source. That's why I have no reason to be\noffending, and I really didn't want to be.\n\nThe reason I asked you to close my bugzilla account is that - realizing while\nreading your replies - this is not the right place for me to put any errors I\nget when using your software.\n\nAnyway, have a nice day.", "id": 91050, "time": "2006-07-10T08:57:16Z", "creator": "sczymaj@msls.de", "creation_time": "2006-07-10T08:57:16Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 39990, "attachment_id": null, "id": 91159, "time": "2006-07-11T19:45:50Z", "creator": "remm@apache.org", "creation_time": "2006-07-11T19:45:50Z", "is_private": false, "text": "You really need to understand you should have posted to the user list, or\nconsulted the user list (or the changelog, or research similar corruption issues\nwith this build). You should also give a full description of your environment,\nwhich you failed to do.\n\nIt's simply the corruption bug that is in Tomcat 5.5.15 when using the APR\nimplementation of AJP. This has been fixed in Tomcat 5.5.16+."}, {"count": 8, "tags": [], "bug_id": 39990, "is_private": false, "text": "Thank you very much for your help. I will turn to the user list if I encounter a\nproblem again.\n\nConcerning the changelogs/release notes: as a \"normal end user\" I don't even\nknown what APR is, and usually the changelogs are full of things that a) take me\na day off to read them all and b) I don't understand.\n(I think this is necessary: I don't try to be offensive, or sarcastic, I just\nwant to point out that - concerning technical details - I'm to stupid to realize\nthat they have to do something with my problem. But it's not the aim of a\nchangelog to explain people like me (\"for dummies\") what went wrong in the\nprevious release.)\n\nAfter updating Tomcat it worked, so I'd like to thank everyone for your patience\nand help. I'll keep myself out of here in the future.\n\nGreetings from the baltic sea,\nS.Czymaj", "id": 91194, "time": "2006-07-12T06:53:12Z", "creator": "sczymaj@msls.de", "creation_time": "2006-07-12T06:53:12Z", "attachment_id": null}]