[{"count": 0, "tags": [], "creator": "sebastian@nohn.net", "attachment_id": null, "id": 91197, "time": "2006-07-12T07:43:48Z", "bug_id": 40026, "creation_time": "2006-07-12T07:43:48Z", "is_private": false, "text": "These work:\nHeader always add X-Test-Header: Success\nHeader always unset Content-Length\n\nThis does not work:\nHeader always unset Server"}, {"count": 1, "tags": [], "bug_id": 40026, "attachment_id": null, "text": "This currently works as designed. In the proxy case we have the following situation:\n\nIf no Server header is set (either because the backend does not set one or\nbecause you have unset it the Server header is set with the default value).\n\nIn the non proxy case the Server header is always set to the predefined value.\nIt cannot be changed.\nSo I mark this as invalid. Feel free to reopen if you think that this is either\na documentation bug or an enhancement.\n\nBTW: Unsetting the Content-Length header is not really a smart idea as it breaks\nHTTP/1.1 connections.\nS", "id": 91214, "time": "2006-07-12T15:44:52Z", "creator": "rpluem@apache.org", "creation_time": "2006-07-12T15:44:52Z", "is_private": false}, {"count": 2, "tags": [], "creator": "sebastian@nohn.net", "text": "In this case, the design is broken. \"Server\" is not required by RFC 2616.\n\nThe Content-Length header was unset for testing purposes (if unsetting headers\ndoes work).", "id": 91215, "time": "2006-07-12T15:54:30Z", "bug_id": 40026, "creation_time": "2006-07-12T15:54:30Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 91480, "time": "2006-07-22T04:19:23Z", "bug_id": 40026, "creation_time": "2006-07-22T04:19:23Z", "is_private": false, "text": "It has long been the policy of the httpd developers that Server cannot be\nomitted nor lied about using configuration.  I don't think that is unreasonable.\n There are very very few good reasons to omit the Server header, and if you\nreally need to, you have the source code.  The fact that Server is not required\nby the spec certainly doesn't mean that it is required to make it optional.  The\nheader is configurable via ServerTokens, but it can't be omitted.\n\nIf you disagree with this policy, you should take it up on the dev@httpd mailing\nlist.  This is not a bug or a design flaw."}, {"count": 4, "tags": [], "text": "Created attachment 18626\nDisable Server Header\n\nThis disables it at all. Very crude but may help people searching for this\nthrough the bugs database.", "attachment_id": 18626, "id": 91490, "creation_time": "2006-07-22T14:20:05Z", "time": "2006-07-22T14:20:05Z", "creator": "sebastian@nohn.net", "bug_id": 40026, "is_private": false}, {"count": 5, "tags": [], "creator": "sebastian@nohn.net", "attachment_id": 18629, "id": 91505, "time": "2006-07-23T16:06:56Z", "bug_id": 40026, "creation_time": "2006-07-23T16:06:56Z", "is_private": false, "text": "Created attachment 18629\nMake sending the Server header configurable via httpd.conf"}, {"count": 6, "tags": [], "bug_id": 40026, "attachment_id": 18630, "text": "Created attachment 18630\nMake sending the Server header configurable via httpd.conf (Documentation)", "id": 91506, "time": "2006-07-23T16:07:17Z", "creator": "sebastian@nohn.net", "creation_time": "2006-07-23T16:07:17Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 40026, "attachment_id": null, "text": "RFC 2616 says \"Server implementors are encouraged to make this field a\nconfigurable option\".\n\nFind the patch for making this configurable attached.", "id": 91507, "time": "2006-07-23T16:09:09Z", "creator": "sebastian@nohn.net", "creation_time": "2006-07-23T16:09:09Z", "is_private": false}, {"count": 8, "tags": [], "creator": "slive@apache.org", "text": "Out of context quote. Try the whole paragraph:\n\"      Note: Revealing the specific software version of the server might\n      allow the server machine to become more vulnerable to attacks\n      against software that is known to contain security holes. Server\n      implementors are encouraged to make this field a configurable\n      option.\"\n\nThe display of specific version information is already configurable.", "id": 91509, "time": "2006-07-23T18:45:26Z", "bug_id": 40026, "creation_time": "2006-07-23T18:45:26Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 40026, "attachment_id": null, "text": "I didn't notice you reopened this.  Thanks for the patches, which may indeed be\nuseful for people.  But as I said, there is no bug here.  If you wish to discuss\nthe policy decision, dev@httpd is the correct place.\n\n(I personally think it is stupid to remove this field, but I wouldn't strongly\nobject to your patch simply because there are so many silly people who request\nit that it continually wastes developer time.)", "id": 91510, "time": "2006-07-23T18:47:27Z", "creator": "slive@apache.org", "creation_time": "2006-07-23T18:47:27Z", "is_private": false}, {"count": 10, "tags": [], "text": "I don't see where my quote is of out context. Anyway, most people like to\n*change* the Server header. This is indeed silly. Removing it starts to make\nsense when you have to pay exorbitant high amounts of money for your traffic -\nfor what reason - and have a high traffic site. In this case saving these 17\nBytes can save you several hundred € a month.", "attachment_id": null, "bug_id": 40026, "id": 91513, "time": "2006-07-24T05:50:54Z", "creator": "sebastian@nohn.net", "creation_time": "2006-07-24T05:50:54Z", "is_private": false}, {"count": 11, "tags": [], "bug_id": 40026, "attachment_id": null, "text": "this is an enhancement request, not a bug report.", "id": 91801, "time": "2006-08-02T06:13:41Z", "creator": "fielding@apache.org", "creation_time": "2006-08-02T06:13:41Z", "is_private": false}, {"count": 12, "tags": [], "bug_id": 40026, "attachment_id": 18774, "text": "Created attachment 18774\nPatch against trunk (438824), respects and contains patch proposed in <cc67648e0608300618t5f133a85jc514a65009cbc359@mail.gmail.com>", "id": 92783, "time": "2006-08-31T07:03:56Z", "creator": "sebastian@nohn.net", "creation_time": "2006-08-31T07:03:56Z", "is_private": false}, {"count": 13, "tags": [], "creator": "sebastian@nohn.net", "attachment_id": 18775, "id": 92784, "time": "2006-08-31T07:48:28Z", "bug_id": 40026, "creation_time": "2006-08-31T07:48:28Z", "is_private": false, "text": "Created attachment 18775\nPatch against trunk (438824), respects, completes and contains patch proposed in <cc67648e0608300618t5f133a85jc514a65009cbc359@mail.gmail.com>"}, {"count": 14, "tags": [], "creator": "sbohdjal@gmail.com", "text": "Apache documentation (v2.0-v.2.2) states that the \"header unset Server\" directive should work:\n\n    \"The header is modified just after the content handler and output filters are run, allowing outgoing headers to be modified.\"\n\nThis is in contrast to what the documentation *used* to say (v.1.3):\n\n    \"The Header directives are processed just before the response is sent by its handler. These means that some headers that are added just before the response is sent cannot be unset or overridden. This includes headers such as 'Date' and 'Server'.\"\n\nThis change in the documentation implies that someone intended the \"header unset Server\" directive to work. Either the directive should be made to work (preferably) OR the documentation should be changed. Otherwise, this is a bug, not a feature or \"enhancement request\".\n\nI personally consider this important since, according to the HTTP specification, the \"Server\" field is unnecessary and, given I'm planning to publish a large number of pages less than 2 KB (compressed), it could represent more than 1% of my outgoing traffic.", "id": 122500, "time": "2008-11-14T11:25:24Z", "bug_id": 40026, "creation_time": "2008-11-14T11:25:24Z", "is_private": false, "attachment_id": null}, {"count": 15, "tags": [], "bug_id": 40026, "attachment_id": null, "text": "\"Except in early mode, the Header directives are processed just before the response is sent to the network. These means that it is possible to set and/or override most headers, except for those headers added by the header filter.\"\n\nThe document says not \"all headers\" but \"most headers\".\nI'm not sure what \"the header filter\" exactly means.\nI feel the document is somehow unkind.", "id": 122506, "time": "2008-11-14T16:59:46Z", "creator": "takashi.asfbugzilla@tks.st", "creation_time": "2008-11-14T16:59:46Z", "is_private": false}, {"count": 16, "tags": [], "creator": "takashi.asfbugzilla@tks.st", "text": "\"somehow\" -> \"a little\"", "id": 122507, "time": "2008-11-14T17:04:30Z", "bug_id": 40026, "creation_time": "2008-11-14T17:04:30Z", "is_private": false, "attachment_id": null}, {"count": 17, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "id": 149398, "time": "2011-09-17T16:04:29Z", "bug_id": 40026, "creation_time": "2011-09-17T16:04:29Z", "is_private": false, "text": "The project decided not to do this twice -- see \"vote on concept of ServerTokens Off\""}, {"count": 18, "tags": [], "creator": "smdrager@gmail.com", "text": "Out of principal, server administrators should have 100% control over what comes out of their server as long as it conforms to the spec. What if \"App: Notepad\" or \"App: Nano\" was prepended to every text document touched by these applications? It would be absurd. Please reconsider this \"feature\".", "id": 173347, "time": "2014-02-19T03:07:13Z", "bug_id": 40026, "creation_time": "2014-02-19T03:07:13Z", "is_private": false, "attachment_id": null}, {"count": 19, "tags": [], "creator": "trawick@apache.org", "attachment_id": null, "id": 173368, "time": "2014-02-19T17:30:36Z", "bug_id": 40026, "creation_time": "2014-02-19T17:30:36Z", "is_private": false, "text": "Please do not reopen the bug.  WONTFIX is the proper status until the development community decides otherwise on the dev@httpd mailing list.  Feel free to provide your input there.  (Personally, I've lost count of the different ways I have patched different versions of httpd to remove the server header.  :(  )"}, {"count": 20, "tags": [], "bug_id": 40026, "attachment_id": null, "text": "Ok so the \"opinions\" of not fixing this were from 2006 - surely 10 years later dev's have realised that it makes no sense for this limitation? Or are we still going to work against the few people who are still using this software?", "id": 191392, "time": "2016-06-05T08:04:40Z", "creator": "gunter@grodotzki.co.za", "creation_time": "2016-06-05T08:04:40Z", "is_private": false}, {"count": 21, "tags": [], "text": "(In reply to Gunter Grodotzki from comment #20)\n> Ok so the \"opinions\" of not fixing this were from 2006 - surely 10 years\n> later dev's have realised that it makes no sense for this limitation? Or are\n> we still going to work against the few people who are still using this\n> software?\n\nSee comment #19 if you're motivated to see a change here.  Ignoring it and posting more patronizing comments here is unlikely to help.", "attachment_id": null, "id": 191395, "creation_time": "2016-06-05T14:44:20Z", "time": "2016-06-05T14:44:20Z", "creator": "covener@gmail.com", "bug_id": 40026, "is_private": false}, {"count": 22, "tags": [], "bug_id": 40026, "attachment_id": null, "text": "\nFor a second, I thought this is a Microsoft, or rather Oracle forum. It sounds like Apache is your trademark, your are a large corp who MUST put your name everywhere. As an open-source developer for over 25 years, telling people WHAT to do, HOW to do, HOW NOT TO DO is exactly opposite of open source. As an ex-Microsoft contractor, I even didn't see this mentality at Microsoft. And here is the proof. You can do this with IIS:\n\nhttps://blogs.msdn.microsoft.com/varunm/2013/04/23/remove-unwanted-http-response-headers/\n\nServer header SHOULD be customizable like everything else. I don't need to explain why but here is one of the good reasons:\n\nI am working on an NTRIP caster. I plan to use Apache as NTRIP protocol is based on HTTP. However for NTRIP to work, Server header must start with \"NTRIP\". \nSo I won't patch Apache and deal with later upgrades. I will just add an HTTP Server handler in app which is in PHP and Apache won't be used at all.\n\nSo good job, you made Apache less useful and continue your path by telling people WHAT TO DO and WHAT NOT TO instead of adding a few lines of code that could allow customization in httpd.conf or in PHP.", "id": 199130, "time": "2017-06-10T09:31:29Z", "creator": "syalcintr@gmail.com", "creation_time": "2017-06-10T09:31:29Z", "is_private": false}, {"count": 23, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "id": 199530, "time": "2017-07-03T11:55:12Z", "bug_id": 40026, "creation_time": "2017-07-03T11:55:12Z", "is_private": false, "text": "Hi Sezer,\n\n(In reply to Sezer Yalcin from comment #22)\n> For a second, I thought this is a Microsoft, or rather Oracle forum. It\n> sounds like Apache is your trademark, your are a large corp who MUST put\n> your name everywhere. As an open-source developer for over 25 years, telling\n> people WHAT to do, HOW to do, HOW NOT TO DO is exactly opposite of open\n> source.\n\nI do get your frustration and I am pretty sure that all the above words were generated since you are passioned about open-source and httpd, but frankly it is a bit unfair to demolish all the work that the dev community puts on a daily basis to maintain httpd. From Jeff's and Eric's posts I see only invites to reach out to the dev@ mailing list to restart the conversation, not a blind deny nor any opposition to preserve a trademark. The httpd development community has a process to decide wether or not a change is needed, and in my experience it has always been open to anybody and very democratic. \n\nSo if you are passioned about the subject and you want to restart the conversation, I do invite you (or anybody else reading) to reach out to the dev@ httpd community with a proposal, but let's all do a good job in keeping bugzilla tasks strictly about important bugs or regressions, there is already tons of work to do and keeping open tasks is not really the best for anybody.\n\nI am going to close again this task as WONTFIX as it is supposed to be, but of course please re-open it if any new decision is taken by the dev@ community."}]