[{"count": 0, "tags": [], "creator": "darryl@darrylmiles.org", "attachment_id": null, "id": 91228, "time": "2006-07-12T18:47:29Z", "bug_id": 40030, "creation_time": "2006-07-12T18:47:29Z", "is_private": false, "text": "The documentaiton page at http://httpd.apache.org/docs/2.2/mod/mod_dav.html\n\nHas:\n\n<LimitExcept GET OPTIONS>\n  require user admin\n</LimitExcept>\n\n\nThis example does not seem the best general purpose case since it omits the HEAD\nand POST options, which would allow to standard URL access to occur but\ncorrectly limit methods employed by DAV.\n\n<LimitExcept GET HEAD OPTIONS POST>\n  require user admin\n</LimitExcept>"}, {"count": 1, "tags": [], "bug_id": 40030, "attachment_id": null, "id": 91479, "time": "2006-07-22T03:58:04Z", "creator": "slive@apache.org", "creation_time": "2006-07-22T03:58:04Z", "is_private": false, "text": "As the <Limit> directive doc says, HEAD is implied by GET.\n\nI'm neutral about POST.  Being more restrictive in the examples is usually\nbetter than less restrictive."}, {"count": 2, "tags": [], "bug_id": 40030, "attachment_id": null, "text": "If I may clarify my thoughts.\n\nSomeone adding DAV to their website wants to restricts the additional DAV\noperations but retain the existing web-application operations, so their\nweb-application continues to work like it did before.\n\nIf they wanted to restrict the POST operation they would already have configured\na rule for that outside of the additional configuration required for DAV.\n\n\nAre you saying that DAV utilizes the POST method for any operation and in doing\nso that optation may modify data or expose extra data to an anonymous website\nuser; that the anonymous website user wouldn't be able to have done otherwise.\n\nSo summarize that question \"Can a privilege escalation via the POST method occur\nfor an anonymous website user ?\"\n\nWhen I audited the example configuration changes myself by researching into the\ncommands I was adding this exact concern immediatly came to mind.  After 5 mins\nlooking over the code for what DAV does via the POST method I could not see any\nactive component.\n\nI'm trying to spare someone else less technical than me this headache that the\nsuggestion of <LimitExcept GET OPTIONS> implies, in that DAV maybe unsafe for\nany website utilizing the POST method for its everyday operations so we dont\nrecommend <LimitExcept GET OPTIONS POST>.\n\n\nPoint taken on the HEAD issue but again <LimitExcept GET HEAD OPTIONS POST> is\nmuch clearer to understand than <LimitExcept GET OPTIONS POST>, it means I dont\nhave the headache of finding out why HEAD wasn't included.  If they are equal\nand one way is clearer than the other, use the clearer way in the documentation.\n\nIs your neurtal stance due to being unsure of the effects of DAV+POST ?  Maybe a\nDAV guru will notice this and contribute their wizdom.  I'm now thinking if\nthere are side effects these should be documented.  Either way I'm just trying\nto remove the concern that a potential user may get after reading the current\ndocumentation.\n", "id": 91485, "time": "2006-07-22T09:58:38Z", "creator": "darryl@darrylmiles.org", "creation_time": "2006-07-22T09:58:38Z", "is_private": false}, {"count": 3, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 91508, "time": "2006-07-23T18:39:18Z", "bug_id": 40030, "creation_time": "2006-07-23T18:39:18Z", "is_private": false, "text": "I don't have any objection to adding POST.  In general, people should only open\nup the methods they use, which frequently will not include POST.  But I agree\nwith you that in the context of DAV, it may make sense to address the methods\nthat are not affected by \"Dav On\".\n\nI would certainly object to adding HEAD.  It would lead to people thinking they\ncould restrict HEAD and GET independently, resulting in more confusion, not\nless.   In fact, the server should probably issue a warning if HEAD is present\nin a <Limit(except)>. "}, {"count": 4, "tags": [], "creator": "darryl@darrylmiles.org", "text": "Understood your objections noted.\n\nHow abouts adding a comment line above the LimitExcept clause:\n\n...\n# HEAD not required explicitly, GET implies HEAD\n<LimitExcept GET OPTIONS POST>\n...\n\nThat would make things very clear and keep us both happy.", "id": 91542, "time": "2006-07-24T13:10:17Z", "bug_id": 40030, "creation_time": "2006-07-24T13:10:17Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 40030, "attachment_id": null, "id": 92419, "creation_time": "2006-08-22T17:06:04Z", "time": "2006-08-22T17:06:04Z", "creator": "slive@apache.org", "text": "I've added POST to the trunk version of the docs.  It is unlikely to get\nbackported, so it won't be seen in a release for a while.  Thanks for your\nsuggestion.", "is_private": false}]