[{"count": 0, "tags": [], "creator": "kriff@espial.com", "is_private": false, "id": 91362, "attachment_id": null, "bug_id": 40059, "creation_time": "2006-07-17T15:49:37Z", "time": "2006-07-17T15:49:37Z", "text": "Bug #15244 explains why it's pretty hard to read symlinks from the filesystem. \nHowever, it occurred to me that there's no reason why the <tar> task couldn't \nbe told explicitly what symlinks to create and include them in the archive. The \nadvantage with this approach is that I could run the build script on Windows \n(which doesn't support symlinks in the Unix sense) and still generate a .tar \narchive that could be extracted on Linux with the proper symlinks.\n\nI'm proposing the creation of a nested <symlink> element that provides the name \nand target (and perhaps other attributes) for the symlink. The <tar> task would \nread the element and generate a symlink within the .tar archive. At no point \nwould there need to be a symlink on the actual filesystem itself.\n\nFor example, this would create a symlink called \"link\" (in the root directory) \nwith a relative path pointing to the file \"foo/bar/target\":\n\n<tar destfile=\"archive.tar\">\n    <tarfileset dir=\"somedir\">\n        <include name=\"foo/bar/target\"/>\n    </tarfileset>\n    <symlink name=\"link\" target=\"foo/bar/target\"/>\n</tar>\n\nAnother option might be to have the <symlink> element under the <tarfileset> \nelement so that it can inherit settings like user, group and permissions."}, {"count": 1, "attachment_id": null, "bug_id": 40059, "is_private": false, "id": 120357, "time": "2008-09-04T06:32:59Z", "creator": "bodewig@apache.org", "creation_time": "2008-09-04T06:32:59Z", "tags": [], "text": "*** Bug 43689 has been marked as a duplicate of this bug. ***"}, {"count": 2, "tags": [], "creator": "meiklehmann@gmx.de", "text": "I also a similar functionality: I want to create a Mac-specific .tar.gz bundle which should contain the application's .app directory structure containing a PDF-documentation file, but the documentation should also be accessible parallel to the .app directory structure, so the average user is able to view the documentation after unpacking the .tar.gz file (note: the .app directory structure on OS X usually is treated as file by the Finder).\n\nWhen we can expect this issue to be fixed? Currently, I don't know of a work-around, except of duplicating the .pdf file in both locations.", "id": 133280, "time": "2010-01-03T04:58:51Z", "bug_id": 40059, "creation_time": "2010-01-03T04:58:51Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 40059, "is_private": false, "id": 133296, "time": "2010-01-04T03:39:58Z", "creator": "stevel@apache.org", "creation_time": "2010-01-04T03:39:58Z", "tags": [], "text": "Mike, nobody works on Ant in any paid form, the general rule is that to fix a problem that you have, the best way is to patch your local copy of the source, then submit a patch including those changes and some tests/documentation, as that is what is needed to get your patch in the main branch,\n\nThere is a workaround, which is you create the (hanging) symlink in the source filesystem pointing to the final destination, and then tar it using the native tar command, instead of the <tar> task. I've been using this when creating RPMs. It isn't x-platform though, only works on a unix system."}, {"count": 4, "tags": [], "text": "(In reply to comment #3)\n> There is a workaround, which is you create the (hanging) symlink in the source\n> filesystem pointing to the final destination, and then tar it using the native\n> tar command, instead of the <tar> task. I've been using this when creating\n> RPMs. It isn't x-platform though, only works on a unix system.\n\nThis is no work-around for us, because we work on Windows.\n\nIf I would have the experience of how the tar format looks like, I've already would have done the change myself and maybe suggested a patch. Unfortunately, I haven't that experience.", "is_private": false, "id": 133297, "creation_time": "2010-01-04T04:32:06Z", "time": "2010-01-04T04:32:06Z", "creator": "meiklehmann@gmx.de", "bug_id": 40059, "attachment_id": null}]