[{"count": 0, "tags": [], "creator": "randy.eye@cinea.com", "attachment_id": null, "is_private": false, "id": 91438, "time": "2006-07-20T17:14:54Z", "bug_id": 40085, "creation_time": "2006-07-20T17:14:54Z", "text": "I am using the 1.2.1 C++ library to validate an XML document signed with an\nRSA-SHA256 signature (http://www.w3.org/2001/04/xmldsig-more#rsa-sha256).  The\nlibrary expects the OID value within the decrypted signature to be the ASN.1 BER\nencoding for SHA1 (even though it will properly calculate a SHA256 hash for\ncomparison).\n\nAccording to RFC4051, Section 2.3.2, the OID in the signed portion must be the\nASN.1 BER SHA-256 algorithm designator for RSA-SHA256.   In looking at this\ncode, I believe that this bug exists for all versions of SHA other than SHA1.\n\nIf the XSEC library is used to produce the signature, the SHA1 OID is pre-pended\nto the hash and the validation is successful (although out of specification and\nnot interoperable with other implementations)."}, {"count": 1, "tags": [], "bug_id": 40085, "is_private": false, "text": "Looking at this now.  The way the code was originally written it expects a SHA-1\nhas for RSA.  It will also fail in a similar manner for MD-5 based sig.  The sig\nwould be calculated with a SHA-1 DER encoded prefix.\n\nI will add some code to the RSA validation interface to pass it the hash\nalgorithm and take the OID values from PCKS 1.", "id": 94157, "time": "2006-09-27T10:11:54Z", "creator": "blautenb@apache.org", "creation_time": "2006-09-27T10:11:54Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "blautenb@apache.org", "attachment_id": null, "is_private": false, "id": 94209, "time": "2006-09-28T07:53:33Z", "bug_id": 40085, "creation_time": "2006-09-28T07:53:33Z", "text": "I have updated the relevant code in all three interface libraries (Windows,\nOpenSSL and NSS).  Note that only the OpenSSL (>0.9.8) library interface truly\nsupports all the SHA variants with an RSA signature.\n\nLet me know if this does not work!"}]