[{"count": 0, "attachment_id": null, "bug_id": 40086, "is_private": false, "id": 91441, "time": "2006-07-20T19:21:42Z", "creator": "sjohnson@schwing.com", "creation_time": "2006-07-20T19:21:42Z", "tags": [], "text": "Our internal network was upgraded to Windows Server 2003 ADS.  The application \nserver where the Apache web server resides is still running Windows NT4 in a \nDMZ.  We cannot authenticate for file access to the internal network.  We can \nthrough windows explorer but not when going through the Apache web server.  We \nhave internal network drives mapped on the application server and an ALIAS \ndefined in the httpd.conf file.  The error we get is:  HTTP 404 The Page Cannot \nBe Found.  The entry in the httpd.conf file looks like:\n\nAlias /whitebear/ \"J:\\/\"\n\nwhere J:\\ is a file server in our internal network.  J:\\ was upgraded to Server \n2003."}, {"count": 1, "tags": [], "bug_id": 40086, "is_private": false, "text": "A blocker bug blocks the next release, not your scenario.  Changed priority.\n\nYour syntax was wrong, the alias should point to either \"J:/\" or \"//mach/share/\"\n\nYou will probably have to change the \"Logon as\" or \"Run as\" service property\ntab to an account with appropriate permissions.  That -user- must have a J: drive\nmap, but I really recommend the //mach/share/ falvor instead.\n\nApache 1.3/Win32 issues are no longer receiving any attention, Apache 2.2 is\ncurrent, upgrade already.  For that matter, upgrade your webserver's OS if you\ncan't get them to interoperate nicely.  That's not the Apache project's concern.\n\nFinally post these sorts of problems to the peer user support lists, bugzilla\nis for bugs in ASF software, not user configuration questions.\n", "id": 91442, "time": "2006-07-20T20:30:25Z", "creator": "wrowe@apache.org", "creation_time": "2006-07-20T20:30:25Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Thank you for your very fast response, Will.  We have tried many things.  The \nsyntax of the alias worked without problem prior to the upgrade to Windows \nServer 2003 ADS.  We have also tried using //machine/share/ syntax but that \ndidn't work, either.  We have also used an administrator account in the \"Run \nAs\" property.  Still didn't work.  Is there something else I can try?\n\nFinally, I am not sure what a peer support list is.  Our only experience with \nApache is that it came with our installation of Oracle Application Server \n9iAS.  They are not supporting the Apache Web Server.  I apologize if I am not \nposting this issue to the correct place.  I just don't know any better.\n\nThanks a lot!\nStuart Johnson", "is_private": false, "bug_id": 40086, "id": 91444, "time": "2006-07-20T20:48:54Z", "creator": "sjohnson@schwing.com", "creation_time": "2006-07-20T20:48:54Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "By 'peer support list', Will means the user mailing list. There's information\nabout it on the following page:  http://httpd.apache.org/lists.html#http-users\n\nThe cool part about a user mailing list (which is the peer part in Will's reply)\nis that the people on there are other users (as well as some of the developers)\nand the economies of scale mean there's a much higher chance that another user\nwill have the answer for you.", "is_private": false, "bug_id": 40086, "id": 91469, "time": "2006-07-21T17:35:48Z", "creator": "bayard@apache.org", "creation_time": "2006-07-21T17:35:48Z", "attachment_id": null}]