[{"count": 0, "tags": [], "bug_id": 40144, "text": "hi,\n\nwhen i use the number-rows-spanned attribute in a cell with big content\n(multiple pages), that give an infinite loop. \n\nwhen i delete this attribute or cut a text that seems to work nice.\n\nmy file : \n\n**************************************************\n<?xml version=\"1.0\" encoding=\"ISO-8859-1\" ?>\n<fo:root xmlns:fo=\"http://www.w3.org/1999/XSL/Format\">\n  <fo:layout-master-set>\n    <fo:simple-page-master \n\tmargin-right=\"1.5cm\"\n\tmargin-left=\"1.5cm\"\n\tmargin-bottom=\"2cm\"\n\tmargin-top=\"1cm\"\n\tpage-width=\"21cm\"\n\tpage-height=\"17cm\"\n\tmaster-name=\"first\">\n      <fo:region-body margin-top=\"1cm\" margin-bottom=\"1.5cm\"/>\n      <fo:region-before extent=\"1cm\"/>\n      <fo:region-after extent=\"1.5cm\"/>\n</fo:simple-page-master>\n  </fo:layout-master-set>\n  \n  <fo:page-sequence master-reference=\"first\">\n    <fo:static-content flow-name=\"xsl-region-before\">\n      <fo:block line-height=\"14pt\" font-size=\"10pt\" \n\t\ttext-align=\"end\">table examples</fo:block>\n    </fo:static-content>\n    <fo:static-content flow-name=\"xsl-region-after\">\n      <fo:block line-height=\"14pt\" font-size=\"10pt\" \n\t\ttext-align=\"end\">Page <fo:page-number/></fo:block>\n    </fo:static-content>\n    \n    <fo:flow flow-name=\"xsl-region-body\">           \n    \n    \n     <fo:block>\n    \n      <fo:table border-width=\"2pt\" border-color=\"red\" table-layout=\"fixed\">\n\n      \n    <fo:table-column column-width=\"10cm\"/>\n       <fo:table-body>\n\t  <fo:table-row border-width=\"10cm\" background-color=\"aqua\">\n\t    <fo:table-cell padding=\"1mm\" border-top-style=\"none\" border-bottom-\nstyle=\"none\" number-rows-spanned=\"2\">\n\t      <fo:block>\n\tJERUSALEM (AP) -- Conforté dans sa stratégie par l'échec de la \nconférence de Rome, Israël poursuivait jeudi son offensive au Liban. Le \nministre de la Justice a d'ailleurs estimé qu'en ne parvenant pas à s'entendre \nsur un appel au cessez-le-feu immédiat au Proche-Orient, la communauté \ninternationale avait donné son blanc-seing à l'Etat hébreu pour continuer ses \nopérations entamées le 12 juillet, après l'enlèvement de deux de ses soldats. \n\t\"Hier à Rome, nous avons eu de fait la permission du monde -la moitié \nen grinçant des dents, l'autre moitié en donnant sa bénédiction- à poursuivre \nnotre opération, cette guerre, jusqu'à ce que le Hezbollah disparaisse du Liban \net qu'il soit désarmé\", a dit Haïm Ramon, considéré comme un proche du Premier \nministre Ehoud Olmert, à la radio de l'armée israélienne. \n\tIl a aussi affirmé que les forces aériennes israéliennes devraient \nbombarder des villages avant l'entrée de troupes terrestres, laissant entendre \nque cela contribuerait à limiter les pertes israéliennes à l'avenir. \n\tMercredi à Rome, les participants à la conférence internationale sur le \nLiban ont appelé à l'arrêt des violences entre Israël et le Hezbollah et à la \ncréation d'une force multinationale d'interposition sous mandat de l'ONU. Mais \nun consensus n'a pu être trouvé sur une demande de cessez-le-feu immédiat et \naucune décision concrète n'a été prise. \n\tLe chef de la diplomatie française Philippe Douste-Blazy s'est \ndéclaré \"déçu\" sur ce point, mais satisfait sur d'autres, cruciaux, bien que \ndes divergences demeurent avec les Etats-Unis notamment: \"D'abord un accord \npolitique entre les parties, un cessez-le-feu durable, et uniquement à ce \nmoment-là une force internationale, pas sous commandement de l'OTAN, mais sous \nle mandat de l'ONU.\" Son homologue américaine Condoleezza Rice s'est dite prête \nà revenir au Proche-Orient pour obtenir \"un cessez-le-feu durable\", sans \npréciser de date. \n\tSur le terrain, les forces israéliennes ont frappé jeudi des caches \nprésumées du Hezbollah au Liban, poursuivant leur campagne aérienne après avoir \nsubi, mercredi, leurs plus lourdes pertes en vies humaines, avec neuf soldats \ntués et 25 blessés. Une roquette du Hezbollah a frappé une usine chimique de \nKiryat Shemona, selon des responsables israqéliens de la sécurité. Depuis le 12 \njuillet, l'offensive israélienne a fait 423 morts au Liban et 52 Israéliens ont \nété tués dans les combats, dont 34 soldats. \n\tJeudi, les frappes ont notamment visé une base de l'armée libanaise et \nune station relais, appartenant à la radio nationale libanaise, situées au nord \nde Beyrouth, ont rapporté des télévisions et radios locales. Plusieurs routes \nont également été détruites. L'armée israélienne a prévenu les Libanais du Sud \nque leurs villages seraient \"totalement détruits\" s'ils servaient de base de \ntirs de missiles. Les raids effectués dans le nord, l'est et le sud du Liban, \nqui ont fait au moins un mort et plusieurs blessés, continuaient alors que le \ngouvernement israélien était réuni pour étudier les suites de l'offensive, \nentrée dans sa troisième semaine. \n\tLe conseil a décidé de ne pas étendre les opérations mais ordonné le \nrappel supplémentaire de trois divisions de réserve, soit des milliers de \npersonnes, selon des responsables, ce qui risque d'alimenter les critiques sur \nla stratégie de l'armée. Ehoud Olmert a jugé que les objectifs de ces 17 jours \nd'attaques étaient en passe d'être atteints, d'après des participants. \n\tDe son côté, le numéro 2 d'Al-Qaïda a averti jeudi dans un \nenregistrement vidéo que le réseau terroriste réagirait aux attaques \nisraéliennes sur le Liban et la Bande de Gaza. Ayman al-Zawahri, considéré \ncomme le lieutenant d'Oussama ben Laden, a déclaré que le monde entier \nconstituait \"un champ de bataille ouvert devant\" le réseau terroriste. AP \n\t\n\n\t      </fo:block>\n\t    </fo:table-cell>\n\t  </fo:table-row>\n\t  \n\t  <fo:table-row border-width=\"10cm\" background-color=\"aqua\">\n\n\t  </fo:table-row>\n\t  \n\t  \n\t</fo:table-body>\n      </fo:table>\n    </fo:block>\n     \n    </fo:flow>\n  </fo:page-sequence>\n  \n</fo:root>\n*****************************************************************", "id": 91733, "time": "2006-07-31T15:16:46Z", "creator": "mahmou@gmail.com", "creation_time": "2006-07-31T15:16:46Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Created attachment 18665\nbig cell sample", "attachment_id": 18665, "id": 91734, "creator": "mahmou@gmail.com", "time": "2006-07-31T15:18:00Z", "bug_id": 40144, "creation_time": "2006-07-31T15:18:00Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "mahmou@gmail.com", "text": "i use fop to generate pdf file", "count": 2, "id": 91735, "time": "2006-07-31T15:21:20Z", "bug_id": 40144, "creation_time": "2006-07-31T15:21:20Z", "is_private": false}, {"count": 3, "tags": [], "creator": "bowditch_chris@hotmail.com", "attachment_id": null, "text": "This bug doesnt exist in FOP v0.92beta, so please upgrade. FOP 0.20.5 is no \nlonger maintained.", "id": 91736, "time": "2006-07-31T15:51:34Z", "bug_id": 40144, "creation_time": "2006-07-31T15:51:34Z", "is_private": false}, {"count": 4, "tags": [], "text": "(In reply to comment #3)\n> This bug doesnt exist in FOP v0.92beta, so please upgrade. FOP 0.20.5 is no \n> longer maintained.\n\n\nthank's for the information. i didn't know that fop 0.20.5 is no longer \nmaintained.\n\ncan you confirm please that it's really a bug in 0.20.5?\n\nso the problem is that i use fop with cocoon. can i use FOP v0.92beta with \ncocoon? and where can i find a documentation to upgrade to this new version (is \nit a stable version?)\n\nthank's a lot.", "attachment_id": null, "id": 91738, "creator": "mahmou@gmail.com", "time": "2006-07-31T16:20:47Z", "bug_id": 40144, "creation_time": "2006-07-31T16:20:47Z", "is_private": false}, {"count": 5, "tags": [], "text": "Yes this is a bug in FOP 0.20.5. I ran your FO on SVN Trunk code and it \nappeared to work okay. Although because you C&P the text into the bug instead \nof adding it as an attachment some extra line breaks are introduced so I cant \nguarantee we will see the same result.\n\nI dont know anything about cocoon, best to ask questions on the cocoon user \nmailing list.\n\nThere is some documentation on the website about upgrading to 0.92beta here:\n\nhttp://xmlgraphics.apache.org/fop/0.92/upgrading.html\n\nAlthough 0.92 has a beta tag, it is IMHO more stable than 0.20.5.\n\nBTW, please dont use bug reports to ask questions. In future please ask \nquestions on the fop-user mailing list.", "attachment_id": null, "id": 91756, "creator": "bowditch_chris@hotmail.com", "time": "2006-08-01T07:55:19Z", "bug_id": 40144, "creation_time": "2006-08-01T07:55:19Z", "is_private": false}, {"count": 6, "tags": [], "creator": "mahmou@gmail.com", "attachment_id": null, "text": "thank's for your help.\n\ni don't know how can i ask question in fop-user mailing list(i found a lot of \nmailin list!). can you send me the url please? or how can i subscribe? (i tried \nto subscribe by sending an email to fop-user-subscribe@xml.apache.org by i \nreceived \"Sorry, no mailbox here by that name\")\n\n\nthank's\n", "id": 91757, "time": "2006-08-01T08:10:08Z", "bug_id": 40144, "creation_time": "2006-08-01T08:10:08Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 40144, "attachment_id": null, "id": 91758, "time": "2006-08-01T08:38:50Z", "creator": "jeremias@apache.org", "creation_time": "2006-08-01T08:38:50Z", "is_private": false, "text": "The user mailing list has been moved since FOP 0.20.5 came out. The updated info\ncan be found here: http://xmlgraphics.apache.org/fop/maillist.html#fop-user\nThe new subscription address is: fop-users-subscribe@xmlgraphics.apache.org\n\nConcerning Cocoon: There are at least two patches in Cocoon's issue tracker\ncontaining a new Cocoon Block for the new FOP API. The problem with both\ncontributions is that they are far from being complete and will need some more\nwork. But one of them might be a starting point for you."}, {"count": 8, "tags": [], "bug_id": 40144, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156709, "time": "2012-04-01T13:51:43Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:51:43Z", "is_private": false, "attachment_id": null}]