[{"count": 0, "attachment_id": null, "bug_id": 40161, "text": "Hi Log4j-Dev,\n\nBug Description:\nI am using SyslogAppender to redirect the application specific logs to Unix\nSyslog but I am unable to find the Header of the Custom layout in \nSyslogs.Currently I am using log4j 1.2.8\n\nObservation:\nWhen I observe other appenders they are extending WriteAppender class which \nhas writeHeader() funtion to log the Header.But I found that this functionality\nis missing in SyslogAppender.\n\nSo when I simply use the SyslogAppender with the extra function WriteHeader()\nand just append to the writerlayout.getHeader().I am able to log the header\n\nI have seen that this funtionality is even missing in log4j 1.2.13.\n\n\nIf I am not wrong Can you please let me know whether there is any possibility \nof logging the header information with the existing verison(Currently I am \nusing log4j 1.2.8.) or When can I get the required funtionality in log4j \nbuilds because my application is unabling the cilents to configure the logs\n\nWaiting to find the fix in log4j builds soon\n\n\nThanks and Regards,\nAparna", "id": 91803, "time": "2006-08-02T10:43:05Z", "creator": "aparna.mokkapati@gmail.com", "creation_time": "2006-08-02T10:43:05Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 40161, "attachment_id": null, "id": 92781, "time": "2006-08-31T05:30:58Z", "creator": "carnold@apache.org", "creation_time": "2006-08-31T05:30:58Z", "is_private": false, "text": "Do you think that the layout header should be written once at the appender initialization, once at the first \nprocessed log request or once per log request?\n\nShould the footer be written once when the appender is closed or once per log request?"}, {"count": 2, "tags": [], "bug_id": 40161, "text": "SyslogAppender should be similar to other appenders in logging the header\nand footer.So I think that header should be logged once at the first \nprocessed log request and footer once when the appender is closed.\n\nIn case of reloading(change)the properties or config file,Logging of headers \nand footers should be similar to other appenders \n\n", "id": 92883, "time": "2006-09-01T12:29:08Z", "creator": "aparna.mokkapati@gmail.com", "creation_time": "2006-09-01T12:29:08Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "\nSysLogAppender now is a subclass of WriterAppender and behaves the same as other\nappenders writing the footer and header at activation and closing.\n\nThis is checked into SVN trunk, pending for 1.3", "attachment_id": null, "bug_id": 40161, "id": 98618, "time": "2007-01-27T23:17:32Z", "creator": "genman@noderunner.net", "creation_time": "2007-01-27T23:17:32Z", "is_private": false}, {"count": 4, "tags": [], "creator": "carnold@apache.org", "text": "Committed by Elias against log4j/trunk in rev 500749.\n\nChanging the base class of an established appender is a pretty significant architectural change for such a \nsmall enhancement and would have benefitted from prior discussion.  I would be very reluctant to make \nsuch a change in log4j 1.2.x and the 1.3 patch should be reviewed.  I think it is likely that the rebasing of \nthe class may have introduced behavioral changes (buffering, encoding, etc) in addition to the desired \nchange.\n", "id": 98793, "time": "2007-01-30T14:44:00Z", "bug_id": 40161, "creation_time": "2007-01-30T14:44:00Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "carnold@apache.org", "attachment_id": null, "text": "Committed minor tweak to SyslogAppender in log4j 1.2 branch on rev 510695 to address this issue.  \nHeader will be emitted on either call to activateOptions() or first handled logging event, footer will be sent \non close if initialization got to either of those points.", "id": 99705, "time": "2007-02-22T14:37:10Z", "bug_id": 40161, "creation_time": "2007-02-22T14:37:10Z", "is_private": false}]