[{"count": 0, "text": "If a ThreadGroup that is set to run more than once is created with nested\nIfControllers like this:\n\nThread Group\n|\n+-IfController 1, (condition A)\n| |\n| +-Sampler 1\n| |\n| +-IfController 2, (condition B)\n|   |\n|   +-Sampler 2\n|\n...\n\nthe Sampler 2 will not be run on the second pass despite the fact that the\nconditions in both IfControllers pass. On the third pass, it will be executed\nproperly.\n\nAfter stepping through the code, I verified that resetCurrent() on the nested\nIfController is not executed between the first and second passes. However, it is\nexecuted during the second pass. This explains why it runs properly on the third\npass.\n\nA simple workaround exists, (but it is not necessarily intuitive): the nested\nIfController is pulled out to the main level of execution and its condition is\nmodified to be the logical composite of the original top and nested IfController.\n\nThread Group\n|\n+-IfController 1, (condition A)\n| |\n| +-Sampler 1\n|\n|-IfController 2, (condition A && condition B)\n| |\n| +-Sampler 2\n|\n...\n\nHope that helps the next user with this problem until the bug is fixed!", "bug_id": 40229, "is_private": false, "id": 92132, "time": "2006-08-11T07:50:40Z", "creator": "rwatler@apache.org", "creation_time": "2006-08-11T07:50:40Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 40229, "attachment_id": 20173, "id": 103086, "time": "2007-05-11T04:30:56Z", "creator": "alf@i100.no", "creation_time": "2007-05-11T04:30:56Z", "is_private": false, "text": "Created attachment 20173\nTest plan with structure as described in bug report\n\nI am not able to reproduce the problem described.\nIf you can attach a simple test plan, then I can look more into this bug.\n\nThe attached bug report has the structure as specified as problematic in the\nbug report.\n\nFor now, I think that this bug is related to bug 41612, and it might even be a\nduplicate of that bug.\n\nHere is what I think happens :\nThe condition for \"If Controller 1\" evaluates to true, so Sample 1 is executed.\nThe execution of \"Sample 1\" somehow changes the condition tested in \"If\nController 1\", so because of bug 41612, after \"Sample 1\" is executed, then \"If\nController 1\" condition is evaluated once more, and now it fails, and therefore\nthe control is never passed on to \"If Controller 2\".\nBut I cannot explain why the simple workaround suggested works.\nSo I need a test plan to expose the bug."}, {"count": 2, "tags": [], "creator": "sebb@apache.org", "text": "The problem may be related to the conditions that were used - did these use \nvariables? If so, when did the variables change?\n\nA simple test plan (e.g. using Java Request Samplers) would be very helpful.", "id": 107621, "attachment_id": null, "bug_id": 40229, "creation_time": "2007-09-02T10:17:06Z", "time": "2007-09-02T10:17:06Z", "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 111402, "time": "2007-12-04T04:03:11Z", "bug_id": 40229, "creation_time": "2007-12-04T04:03:11Z", "is_private": false, "text": "Since we cannot reproduce the problem, closing the bug.\n\nIf the problem recurs, please feel free to re-open the call.\nBut please first check that the problem exists in the latest release,\nand ideally also check the latest nightly."}]