[{"count": 0, "attachment_id": null, "bug_id": 40231, "text": "Hello,\n\nIt is a feature request.\nIt would be great and very convenient to have all config files in pure xml \nformat. Current configuration format of virtual host is something similar to \nxml. But it would be much more convenient for users to have configuration (at \nleast of virtual hosts) in pure xml format.\nIt is very convenient to have configuration in xml files because xml can be \neasily parsed and generated if necessary.\nCan we expect to have xml configuration available for httd? And if so when this \ncan be possible?\n\nThanks", "id": 92138, "time": "2006-08-11T10:37:05Z", "creator": "radick@rambler.ru", "creation_time": "2006-08-11T10:37:05Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 40231, "attachment_id": null, "is_private": false, "id": 92139, "time": "2006-08-11T10:49:08Z", "creator": "nick@webthing.com", "creation_time": "2006-08-11T10:49:08Z", "text": "This has been discussed before.  Feel free to write or commission a module \nthat'll run apache config as XML.  But it would not be convenient to break the \nexisting httpd.conf so radically for millions of users."}, {"count": 2, "tags": [], "bug_id": 40231, "attachment_id": null, "is_private": false, "id": 92143, "time": "2006-08-11T14:48:52Z", "creator": "radick@rambler.ru", "creation_time": "2006-08-11T14:48:52Z", "text": "(In reply to comment #1)\n> This has been discussed before.  Feel free to write or commission a module \n> that'll run apache config as XML.  But it would not be convenient to break the \n> existing httpd.conf so radically for millions of users.\n\nYes, I understand your position. But not always things you are used to are good.\nAnd changing something doesn't mean that it would break something. As for me it\nis not very radical change and I think about it rather as about improvement. As\nabout something that should happen with evolution of software and technologies.\nAnd it can be good. \nI understand that such changes hardly to be done for existing version of apache.\nBut I hope that if some day you will start apache httpd version 3.0 maybe you\ncan take this option into consideration again. Maybe it can be good for the new\nversion."}, {"count": 3, "attachment_id": null, "bug_id": 40231, "text": "I agree that an XML-format would be great. Quite a few other programms created in pre-XML times are in a similar situation.\n\nBut I also agree that some kind of mapping between XML and the current configuration file format would be necessary to be able to make such a change.\n\nIt might make sense to have a look at Kochizz (http://kochizz.sourceforge.net/), an \"open source Apache configuration editor\". Unfortunately that project seems to be dead since two years.\n\nAny further ideas or suggestions?", "id": 130418, "time": "2009-09-15T09:27:23Z", "creator": "A.Kuckartz@ping.de", "creation_time": "2009-09-15T09:27:23Z", "tags": [], "is_private": false}]