[{"count": 0, "tags": [], "text": "(log4j-1.2.13)\n\nI'm using log4j in a WebLogic J2EE application and added an JMX interface using\nthe existing HierarchyDynamicMBean. During and after the first registration of\nthe MBean, everything seems to work fine. But when I unregister the MBean and\nregister it again (because of redeploying the application), I get a stacktrace\nindicating that the appender MBean is already registered.\n\nAs far as I understand by reading the code, the HierarchyDynamicMBean registers\nthe logger(s) but never unregisters them. I would expected automatic\nunregistration of the logger(s) when I unregister the HierarchyDynamicMBean,\nprobably somewhere in preDeregister().\n\nSince the addLoggerMBean() returns you the object name, the calling code can\nperform the cleanup itself as well, but that is IMHO not the option to prefer.\nIn case you want to stick to this behaviour, the method needs at least some\nexplicit javadoc comment explaining it.\n\nIf someone gives a hint which direction is the best, I'm willing to write a\nsmall patch.", "attachment_id": null, "bug_id": 40246, "id": 92189, "time": "2006-08-14T09:59:25Z", "creator": "wingtung.leung@gmail.com", "creation_time": "2006-08-14T09:59:25Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 40246, "attachment_id": 18715, "text": "Created attachment 18715\nPatch JMX MBean classes to perform automatic cleanup\n\nThis patch solves my problem and unregisters all MBean instances during\nundeployment. My previously described workaround is not working because some\nMBean instances are added automatically without needing the explicit\naddLoggerMBean() call.\n\nPlease review for inclusion.", "id": 92194, "time": "2006-08-14T12:25:34Z", "creator": "wingtung.leung@gmail.com", "creation_time": "2006-08-14T12:25:34Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 40246, "attachment_id": null, "id": 102176, "time": "2007-04-23T16:20:15Z", "creator": "psmith@apache.org", "creation_time": "2007-04-23T16:20:15Z", "is_private": false, "text": "1.2.15 consideration\n\nAlthough this patch is targetted for trunk, it would need slight rework for\ninclusion in the 1.2 tree, because it uses JDK 1.2+ Collections framework plus\nthe use of the getLogger() calls.  \n\nIf we consider this for the 1.2 tree, then it'll need to port that to standard\njava.util.Vector class, and use LogLog instead.  If the original author was able\nto, a patch against the 1.2 tree would be well received, otherwise I might take\na stab at it later."}, {"count": 3, "tags": [], "text": "Reassigning this one back to log4j-dev list, it was my mistake to completely\nreassign this issue, it prevents the comments from being seen on the mailing list.", "is_private": false, "id": 102640, "creator": "psmith@apache.org", "time": "2007-04-29T15:21:36Z", "bug_id": 40246, "creation_time": "2007-04-29T15:21:36Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Created attachment 20072\nlog4j 1.2 version of the mbean deregister patch\n\nI modified the original patch (which I had to apply by hand, wasn't quite a\nunified diff format) to make it log4j 1.2 compatible.\n\nI've had difficulty testing this however, because I can't seem to get the\npreDeregister method to fire at all.  I can't work out exactly what the correct\nway to 'shutdown' the JMX agent in my test harness app I have local.\n\nIf someone else knew what to do to verify behaviour, could they take the patch\nand try it out?", "is_private": false, "bug_id": 40246, "id": 102645, "time": "2007-04-29T16:19:59Z", "creator": "psmith@apache.org", "creation_time": "2007-04-29T16:19:59Z", "attachment_id": 20072}, {"count": 5, "tags": [], "text": "Help needed to verify the functionality of the code.", "is_private": false, "bug_id": 40246, "id": 119257, "time": "2008-08-02T10:03:13Z", "creator": "thorbjoern@gmail.com", "creation_time": "2008-08-02T10:03:13Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 40246, "attachment_id": null, "text": "I'd actually like to see this one done for 1.2.16 personally. ", "id": 119440, "time": "2008-08-05T15:29:59Z", "creator": "psmith@apache.org", "creation_time": "2008-08-05T15:29:59Z", "is_private": false}, {"count": 7, "tags": [], "text": "Fixed in revision 686131.  Tested by creating a local test harness class that instantiates an MBeanServer, and registers the Hierarchy Mbean and then unregister it.  The Loggers and Appenders appear to register and unregister successfully.\n\nThanks for the patch, it's only been 2 years and 1 day in applying!", "is_private": false, "id": 119848, "creator": "psmith@apache.org", "time": "2008-08-14T20:34:01Z", "bug_id": 40246, "creation_time": "2008-08-14T20:34:01Z", "attachment_id": null}]