[{"count": 0, "tags": [], "creator": "kevin.tan@morningstar.com", "text": "We are having a problem opening the pdf files that are being generated with \nXSL-FO. We need to open the file in Adobe Illustrator to look at the font \nsizes to make sure they are correct. We currently get this message when we try \nto open the file:\n \nCould not create internal representation of XMP metadata. \n\nThanks,\nKevin", "id": 92276, "time": "2006-08-16T19:16:39Z", "bug_id": 40269, "creation_time": "2006-08-16T19:16:39Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 40269, "attachment_id": null, "text": "That sounds like a bug in Illustrator. FOP 0.20.5 creates PDF version 1.3 which\ndoes not support XMP metadata, so it's no wonder that Illustrator cannot create\nan internal representation of XMP metadata. Actually, Illustrator shouldn't even\ntry to do anything with XMP metadata if it encounters a version 1.3 PDF.\n\nSince I've submitted a few bug reports about Adobe Acrobat myself I know that\nreporting a bug for Illustrator with Adobe probably won't help at all (just gets\nignored and the receipt not even acknowledged). So, a work-around could be to\ntry the latest FOP code from Subversion (FOP Trunk) which contains full XMP\nsupport. FOP 0.92beta could also work although it hasn't got the full XMP story in.\n\nBut don't be surprised if it doesn't work even with the latest FOP version.\nWhile implementing support for XMP, PDF/X-3:2003 and PDF/A-1b I found all sorts\nof weird behaviour in Adobe software. The Adobe stuff seems to be deficient\nconcerning interoperability. Although FOP strongly adheres to Adobe's\nspecifications Adobe Acrobat reports errors in preflight checks in FOP-generated\nPDFs. Still a few bugs left in their software.\n\nAs an alternative to Illustrator, you can also check font sizes in Adobe Acrobat\n(not the Reader edition). OTOH, you can trust FOP to generate the right font\nsizes if you specified them correctly in XSL-FO.", "id": 92282, "time": "2006-08-17T07:23:43Z", "creator": "jeremias@apache.org", "creation_time": "2006-08-17T07:23:43Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 40269, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156855, "time": "2012-04-01T13:53:56Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:53:56Z", "is_private": false, "attachment_id": null}]