[{"count": 0, "attachment_id": null, "bug_id": 40283, "is_private": false, "id": 92329, "time": "2006-08-18T10:39:33Z", "creator": "gareth.smith@certus-tech.com", "creation_time": "2006-08-18T10:39:33Z", "tags": [], "text": "To reproduce this behaviour: Create a workbook containing a named range on one\nworksheet and a group of radio buttons which are governed by the named range on\nanother worksheet.\n\nRead the workbook using POI, set the value of the named cell to be 1 (this\nshould then update the radio buttons and result in one of them having been\nselected) and then write the file out again. When you load up the output file in\nExcel the radio button is set correctly, however the named cell now has the same\nvalue which the input file was saved with (if the input file had no value set\nthen the cell withh have the value 0). If you save the .xls file with the named\ncell selected then when you open the file after it has been passed through POI\nit is sometimes possible to observe the cell having the value 1 in it before the\nsheet is updated by Excel and the value is reverted to what it was before POI\nread the file.\n\nThe radio buttons on the output file still function correctly; the only issue is\nthat the named range has its value reverted when the file is opened. I assume\nthat this issue is caused by the synchronisation between the cell setting the\nvalue of the radio buttons and the radio buttons setting the value of the cell.\n\nIt appears that this is probably an issue with the way Excel synchronises form\ncontrols rather than POI having corrupted the data, however I will attach an\nexample file and test which exposes this behaviour just in case and if there is\na known work-around for this issue then any feedback would be greatly appreciated.\n\nThanks for your continued work on this project,\nGareth"}, {"count": 1, "tags": [], "text": "Created attachment 18732\nXLS file configured to expose this behaviour", "is_private": false, "id": 92330, "creator": "gareth.smith@certus-tech.com", "time": "2006-08-18T10:40:50Z", "bug_id": 40283, "creation_time": "2006-08-18T10:40:50Z", "attachment_id": 18732}, {"count": 2, "tags": [], "bug_id": 40283, "attachment_id": 18733, "is_private": false, "id": 92331, "time": "2006-08-18T10:41:46Z", "creator": "gareth.smith@certus-tech.com", "creation_time": "2006-08-18T10:41:46Z", "text": "Created attachment 18733\nTest class which will expose the problem"}, {"count": 3, "tags": [], "bug_id": 40283, "attachment_id": null, "id": 92332, "time": "2006-08-18T10:52:50Z", "creator": "gareth.smith@certus-tech.com", "creation_time": "2006-08-18T10:52:50Z", "is_private": false, "text": "I forgot to mention: This test uses POI 2.5.1 final (poi-2.5.1-final-20040804.jar). \n\nI tried using the latest POI alpha (poi-3.0-alpha2-20060616.jar) however this\ncaused Excel to fail to load the file propely and \"repair\" the workbook,\nresulting in the form controls and all cell formatting being lost."}, {"count": 4, "tags": [], "bug_id": 40283, "attachment_id": null, "is_private": false, "id": 177490, "time": "2014-09-01T10:34:41Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2014-09-01T10:34:41Z", "text": "Still happens with current poi 3.11-beta2/trunk, one difference in the BiffViewer output seems to be the type of record for the number-value:\n\nOriginally it is a RKRecord\n\nOffset=0x00001077(4215) recno=192 sid=0x027E size=0x000A(10)\n[RK]\n    .row    = 0x0001\n    .col    = 0x0001\n    .xfindex= 0x001E\n  .value= 2.0\n[/RK]\n\nbut POI only supports reading those and thus converts this to a \n\nOffset=0x0000105E(4190) recno=192 sid=0x0203 size=0x000E(14)\n[NUMBER]\n    .row    = 0x0001\n    .col    = 0x0001\n    .xfindex= 0x001E\n  .value= 3\n[/NUMBER]\n\nNot sure if this is the culprit here, but it seems to be related as no other big change is visible int he Biff-output"}]