[{"count": 0, "tags": [], "creator": "ron.gomes@morganstanley.com", "attachment_id": null, "text": "We deploy Web applications using three-level context paths like\n\"/webinfra/access/webapp\".  When an app is deployed this way in Tomcat 5.5 using\na Context XML file, spurious \"applications\" are created that then appear in the\napp list displayed by the Manager.  In the case mentioned here (for example),\n\"/webinfra\" appears in the list once the real application has been deployed. \nThe spurious application can be undeployed from the Manager, and that\neffectively undeploys the original as well.\n\nThis is operationally troublesome and confusing, and it differs from the\nbehavior in Tomcat 5.0 (from which we want to convert).\n\nNote that the spurious contexts only appear if \"unpackWARs\" is set to \"true\"\n(the default) so that WAR files are expanded into Tomcat's work area.  (Running\nwith \"unpackWARs\" set to \"false\" is no longer a viable option for us because, in\nthat configuration, changes to the underlying WAR files, which we can't reliably\nprevent, often lead to JVM crashes on a running system.)", "id": 92677, "time": "2006-08-29T15:54:22Z", "bug_id": 40347, "creation_time": "2006-08-29T15:54:22Z", "is_private": false}, {"count": 1, "tags": [], "text": "The handling of directories in a host's appBase has changed from 5.0.x to 5.5.x\n\nThis is a config issue. If you are going to deploy apps with a multi-level\ncontext you need to do one of the following:\n- disable autoDeploy and deployOnStartup\n- set unpackWARs to false\n- move the WAR file outside the host's appBase \n\nIf you have further questions, please follow up on the users mailing list.", "attachment_id": null, "id": 92699, "creator": "markt@apache.org", "time": "2006-08-30T03:00:30Z", "bug_id": 40347, "creation_time": "2006-08-30T03:00:30Z", "is_private": false}, {"count": 2, "tags": [], "text": "(In reply to comment #1)\n\nSo satisfying any one of those three conditions should prevent the extra\ncontexts from being created?\n\nOur (new) standard configuration sets autoDeploy to \"false\", deployOnStartup to\n\"true\", and unpackWars to \"true\", but all our WAR files are in fact outside the\nhost's appBase.\n\nShould that not prevent the extra contexts from appearing?", "attachment_id": null, "id": 92727, "creator": "ron.gomes@morganstanley.com", "time": "2006-08-30T14:03:48Z", "bug_id": 40347, "creation_time": "2006-08-30T14:03:48Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 40347, "attachment_id": null, "is_private": false, "id": 92762, "time": "2006-08-30T23:17:52Z", "creator": "markt@apache.org", "creation_time": "2006-08-30T23:17:52Z", "text": "Sorry, I missed one of the combinations and it isn't that simple. Expand wars\nalways expands into the host's appbase which, with deploy on startup enabled\nwill then deploy the using the first level context.\n\nA solution that will work is to use a context.xml file (named\nlevel1#level2#level3.xml) and point to towards the expanded war which you\nmanually expeand as part of your deployment process.\n\nHope this helps but further discussion really does belong on the users list."}, {"count": 4, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "It's fairly logical, actually. I don't see any way how an autodeployer could\nreally deal with nested folders properly.", "id": 92763, "time": "2006-08-30T23:29:29Z", "bug_id": 40347, "creation_time": "2006-08-30T23:29:29Z", "is_private": false}]