[{"count": 0, "tags": [], "creator": "dies@jp.fujitsu.com", "text": "I am trying to run an application that worked fine on Tomcat 4.1 and encounter\nthe following problem on Tomcat 5.5.\n\nI have a JSP using a custom tag and which has expressions in its attributes:\n\n<vsi:loop begin=\"%= last - s %\" end=\"%= last++ %\" />\n\nI expect the expressions to be evaluated left to right: \"last - s\" is passed to\nthe first attribute, \"last\" to the second, and in the next line of code variable\n\"last\" will have been increased by one.\nThis works fine on Tomcat 4.1. However, on Tomcat 5.5 it passed \"last - s + 1\"\nto the first attribute.\n\nI discovered the generated code for the JSP is different.\nTomcat 4.1:\n    _jspx_th_vsi_loop_2.setBegin(last - s);\n    _jspx_th_vsi_loop_2.setEnd(last++);\n\nTomcat 5.5:\n    _jspx_th_vsi_loop_2.setEnd(last++);\n    _jspx_th_vsi_loop_2.setBegin(last - s);\n\nThis JSP is a JSP Document (XML base), for a \"normal\" JSP the order has not\nchanged since Tomcat 4.1.\n\nThe following change seems to be the cause:\nBefore:\n\t    int len = attrs.getLength();\n\t    for (int i=0; i<len; i++) {\n\nAfter:\n            /*\n             * Notice that due to a bug in the underlying SAX parser, the\n             * attributes must be enumerated in descending order. \n             */\n            for (int i = attrs.getLength() - 1; i >= 0; i--) {\n\nRevision: 305679\nAuthor: luehe\nDate: 8:26:50, 2003&#24180;4&#26376;22&#26085;\nMessage:\nDue to a bug in the underlying SAX parser, the XML attributes must be\nenumerated in descending order. When enumerated in ascending order,\nqName may be null, causing NPE. (This sucks!)\n----\nModified :\n/tomcat/jasper/trunk/jasper2/src/share/org/apache/jasper/compiler/JspDocumentParser.java\n\nI could not find any more details, but I wonder if the bug in the underlying SAX\nparser was that it returned attributes in opposite order and that this has been\nfixed (breaking the order again). I don't know how the NPE fits in, though.\n\nIt seems this issue has been brought up in the Tomcat dev ML before, but\nreceived no replies.\nhttp://mail-archives.apache.org/mod_mbox/tomcat-dev/200402.mbox/%3C1077582770.4212.27.camel@thames.spikesource.com%3E", "id": 92713, "time": "2006-08-30T06:00:35Z", "bug_id": 40356, "creation_time": "2006-08-30T06:00:35Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "william.barker@wilshire.com", "attachment_id": null, "text": "There is nothing in the spec that specifies the evaluation order of the \nattributes.  The container is free to evaluate them in any order that it sees \nfit.  This means that the bug is in your application code, not Tomcat.", "id": 98319, "time": "2007-01-21T07:25:27Z", "bug_id": 40356, "creation_time": "2007-01-21T07:25:27Z", "is_private": false}, {"count": 2, "tags": [], "text": "For reference I am adding an excerpt from the latest reply I received from Bill\nBarker in the dev mailing list regarding this issue ('> >' parts are mine):\n\n=======\n> The JSP in question has several expressions. I thought the following in \n> > the JSP 2.0 spec (section JSP.1.12.3) would apply:\n> >\n> >   Expressions are evaluated left-to-right in the JSP page.\n> >\n> > This does not apply when expressions are used in attributes?\n> >\n\nwell, no. however section 1.14 may apply.\n<spec-quote version=\"2.0\" spec=\"jsp\" section=\"1.14\" reason=\"ambiguous\">\nThe interpretation of all actions start by evaluating the values given to \nits attributes left to right, and assigning the values to the attributes.\n</spec-quote>\n\nA quick search didn't turn up much, but my recollection is that SAX isn't \nrequired to be order-preserving on attributes.\n=======\n\nSo the spec does specify the evaluation order of the attributes, but if the SAX\nparser does not preserve the order of the attributes it would take unreasonable\neffort to fix.\n\nI personally did not find anything either about the order of attributes in the\nXMLSchema nor SAX spec, but of all my tries using the Xerces 2 parser bundled\nwith Tomcat and the one with JDK5.0 the order was preserved, and Tomcat 5.5\nevaluates them in opposite order.", "attachment_id": null, "bug_id": 40356, "id": 98435, "time": "2007-01-23T23:36:36Z", "creator": "dies@jp.fujitsu.com", "creation_time": "2007-01-23T23:36:36Z", "is_private": false}, {"count": 3, "tags": [], "creator": "julian.reschke@gmx.de", "attachment_id": null, "id": 98454, "time": "2007-01-24T07:11:46Z", "bug_id": 40356, "creation_time": "2007-01-24T07:11:46Z", "is_private": false, "text": "XML processors do not need to report the order of attributes. An XML based\nlanguage that assigns semantics to the ordering of XML attributes thus would be\nseverely broken (no idea whether this applies here; I just wanted to clarify\nfrom an XML point of view).\n"}]