[{"count": 0, "tags": [], "bug_id": 40432, "attachment_id": null, "is_private": false, "id": 93144, "time": "2006-09-07T11:43:19Z", "creator": "egmont@gmail.com", "creation_time": "2006-09-07T11:43:19Z", "text": "The error text (e.g. \"Objekt nicht gefunden\" and its longer explanation) is \npresented in the language the client requests. Its character set is defined for \nevery language by the error templates Apache provides.\n\nHowever, in the footer, the date is shown in the language and charset \ncorresponding to the locale on the server side, with no character set \nconversion.\n\nAs a result, if these two character sets do not match, the date will be shown \nwith wrong accented characters.\n\nFor example, suppose Apache runs with LC_ALL=fr_FR.UTF-8 and the client \nrequests French language. The header of the returned page will define the ISO-\n8859-1 charset (taken from the error templates), but the date will be put there \nwith UTF-8, hence it appears as \"double UTF-8\". Stranger results (even invalid \nbyte sequences) can occur with other combination of the two languages (e.g. the \nserver may run with hu_HU while the client requests Japanese...)\n\nSuggested solutions:\n\n- [I'd prefer this one] Convert all error templates to UTF-8, and modify Apache \nto convert the date string received from libc (strftime() I guess) from the \ncurrent locale to UTF-8.\n\nor\n\n- Modify Apache to convert the date string received from libc from the current \nlocale to &#num; html entities so that they work with any character set. [I \nhate html entities anyway and I see no reason not to use bare UTF-8.]"}, {"count": 1, "tags": [], "bug_id": 40432, "attachment_id": null, "id": 93146, "time": "2006-09-07T12:00:50Z", "creator": "jorton@redhat.com", "creation_time": "2006-09-07T12:00:50Z", "is_private": false, "text": "For both this and bug 40431 the problem is basically the same: the locale is a\nprocess-global setting which cannot be changed per-request, and changing it to\nmatch an Accept-Language/Charset-supplied values would probably be a nightmare\nanyway.\n\nI think the right fix for this is to simply remove the date from the error\npages.  It's not particularly useful and this complaint is not unreasonable.\n\n[in glibc there are locale-specific interfaces which can use non-global locale\ncontext but being able to use these in httpd would be nearly impossible without\ndesigning a set of essentially glibc-specific interfaces]"}, {"count": 2, "tags": [], "bug_id": 40432, "attachment_id": null, "is_private": false, "id": 93148, "time": "2006-09-07T12:00:59Z", "creator": "jorton@redhat.com", "creation_time": "2006-09-07T12:00:59Z", "text": "*** Bug 40431 has been marked as a duplicate of this bug. ***"}, {"count": 3, "tags": [], "text": "Well, instead of removing the date, you could perhaps format it using numbers \nonly (e.g. 2006/09/07 14:15 +0200) or format in English using a built-in table \nof English month and weekday names (hence not using libc's localized names).\n\nI know about this newlocale()/uselocale()/*_l() stuff, but that's really glibc-\nspecific and requires a quite recent glibc, too. So it'd really be a bad \napproach for apache. I didn't realize when submitting the bug that apache is a \nmulti-thread app so using setlocale() around strftime() isn't safe.\n", "attachment_id": null, "bug_id": 40432, "id": 93150, "time": "2006-09-07T12:18:10Z", "creator": "egmont@gmail.com", "creation_time": "2006-09-07T12:18:10Z", "is_private": false}, {"count": 4, "tags": [], "text": "The date has been removed from the error pages.", "attachment_id": null, "id": 106113, "creator": "slive@apache.org", "time": "2007-07-31T12:49:22Z", "bug_id": 40432, "creation_time": "2007-07-31T12:49:22Z", "is_private": false}]