[{"count": 0, "tags": [], "bug_id": 40492, "text": "When an Apache proxy forwards requests to an origin server using SSL\nany and all Set-Cookie headers are lost in the responses.\n\nIf the proxy connections use plaintext the Set-Cookie headers remain as is.\nThis also applies to situations in which the plaintext connection is made\nto a localhost port to an stunnel instance which in turn implements the SSL\nconnection to the origin server.\n\nMoreover it should be noted that using the above mentioned stunnel hack to\nimplement the SSL connection to the origin server makes the response times\nquite a lot quicker than when using mod_ssl.", "id": 93492, "time": "2006-09-13T07:23:52Z", "creator": "ext-jukka.ukkonen@nokia.com", "creation_time": "2006-09-13T07:23:52Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Please specify the problem more carefully.  A proxy in an SSL connection sees \nan encrypted datastream.  To make any changes, such as finding a Set-Cookie \nheader, it has to decrypt the data.  I infer you haven't told us what you're \nreally doing.", "attachment_id": null, "id": 93503, "creator": "nick@webthing.com", "time": "2006-09-13T08:40:54Z", "bug_id": 40492, "creation_time": "2006-09-13T08:40:54Z", "is_private": false}, {"count": 2, "tags": [], "creator": "ext-jukka.ukkonen@nokia.com", "attachment_id": null, "text": "\n\tOK - I will show you a snippet from the configuration file.\n\tMaybe you understand better then...\n\n<Location \"/CKM/\" >\n    RequestHeader unset Accept_Encoding\n\n    ProxyPass   https://158.98.130.218/CKM/\n    ProxyPassReverse https://158.98.130.218/CKM/\n    ProxyPassReverse /CKM/\n\n</Location>\n\n\tWe go through whole HTTP protocol parsing catching certain\n\tpath prefices which will then be forwarded to be handled by\n\tan external server for further processing.\n\tThe apache instance is used as an authenticating proxy in\n\tthe middle which also tunnels the request over a potentially\n\thostile network using SSL connections.\n\n\tWhen the responses then are on their way back to the users\n\tthe Set-Cookie headers are lost as long as the proxied\n\tconnections shown above are made using SSL.\n\tIf we drop the SSL changing the protocol in the ProxyPass\n\tstatements to plain \"http\" the Set-Cookie headers travel\n\tthrough exactly as expected.\n\n", "id": 93575, "time": "2006-09-14T13:03:22Z", "bug_id": 40492, "creation_time": "2006-09-14T13:03:22Z", "is_private": false}, {"count": 3, "tags": [], "text": "OK, that's a reverse proxy.  The simple solution is to upgrade to 2.2, which \nfixes it for you.  Otherwise, apply the patches under PR#10722\n\n*** This bug has been marked as a duplicate of 10722 ***", "attachment_id": null, "id": 93586, "creator": "nick@webthing.com", "time": "2006-09-14T13:42:19Z", "bug_id": 40492, "creation_time": "2006-09-14T13:42:19Z", "is_private": false}, {"count": 4, "tags": [], "text": "\nAs much as you would like to see this as a duplicate of another problem\nin mod_proxy I do not think it is simply that, because this case of lost\nSet-Cookie headers only affects SSL connections.\nWhen the connections are proxied over plain text connections the cookies\nare not lost.\nIf this is really a problem in mod_proxy, it has to be aware of whether\nthe encapsulation used is plain text or SSL and treat these two alternatives\ndifferently. That again makes no sense. Why should mod_proxy care about\nthe encapsulation?\n\nIf you have an explanation about how and why would mod_proxy destroy only\nthose Set-Cookie headers which are passed over SSL I will agree. Otherwise\nI maintain that these are two different issues.\n\nSecondly, if this really is a known problem with known patches available,\nwhy are those patches not imported to the head of 2.0 branch?\nI my eyes this would warrant releasing a new version 2.0.60 or something.\n\nUsing 2.2 is out of the question, because the authentication is done using\nSiteMinder SSO tools. SiteMinder only supports 1.3.33 and higher or 2.0.54\nand higher.\nGoing over to 2.2 breaks the module ABI, which means there is no SiteMinder\nmodule for it.\n", "attachment_id": null, "id": 93589, "creator": "ext-jukka.ukkonen@nokia.com", "time": "2006-09-14T14:11:09Z", "bug_id": 40492, "creation_time": "2006-09-14T14:11:09Z", "is_private": false}, {"count": 5, "tags": [], "creator": "dlowry@bju.edu", "attachment_id": null, "text": "Do you have ProxyErrorOverride turned on? If you do, Apache will overwrite the\nresponse header from the reverse proxy which would get rid of any set-cookie\ndirectives.", "id": 94234, "time": "2006-09-28T14:17:17Z", "bug_id": 40492, "creation_time": "2006-09-28T14:17:17Z", "is_private": false}, {"count": 6, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "text": "Closing WONTFIX -- If there is a problem, it won't be fixed in 2.0 proxy now.", "id": 148447, "time": "2011-08-06T23:57:34Z", "bug_id": 40492, "creation_time": "2011-08-06T23:57:34Z", "is_private": false}]