[{"count": 0, "tags": [], "creator": "okiddle@yahoo.co.uk", "attachment_id": null, "is_private": false, "id": 93614, "time": "2006-09-15T07:40:22Z", "bug_id": 40517, "creation_time": "2006-09-15T07:40:22Z", "text": "I'm using the docbook-xsl stylesheets to create my XSL-FO files. FOP is not\nhandling links where the destination id is in a fo:page-sequence element. This\nmeans that in the table of contents, the page numbers are missing for all the\nchapter headings. Similarly, the cross-referencing is broken so clicking on the\nchapter heading in the table of contents or the PDF bookmark doesn't work.\n\nLooking at the generated XSL-FO, there is for example the following for the PDF\nbookmark: <fox:outline\ninternal-destination=\"id219576\"><fox:label>1.&#xA0;Introduction</fox:label>\nAnd, similarly in the table of contents: <fo:basic-link\ninternal-destination=\"id219576\">1. Introduction</fo:basic-link>\nAnd the destination is in a fo:page-sequence:\n<fo:page-sequence id=\"id219576\"\n\nI can hack around the problem by adding the id to the fo:block that surrounds\nthe title of the chapter later on the page but it'd be better if it could handle\nthe destination being in the page-sequence. I'm no expert on XSL-FO so I'm\nassuming this is valid (and hence not a docbook-xsl bug)."}, {"count": 1, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "is_private": false, "id": 93640, "time": "2006-09-15T18:55:54Z", "bug_id": 40517, "creation_time": "2006-09-15T18:55:54Z", "text": "FOP 0.20.5 is no longer maintained. All efforts go into the development of the\n\"trunk\" (0.92beta). The latest release is able to reference page-sequences but\nhas problem with a few other id-bearing FO elements. Due to a problem with\npage-number-citations, 0.92beta and later is probably not ideal for DocBook\napplications, yet. You can try if the result is better with the latest release\n(or FOP Trunk from the Subversion repository) but there are no guarantees."}, {"count": 2, "attachment_id": null, "creator": "gadams@apache.org", "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156449, "time": "2012-04-01T13:48:13Z", "bug_id": 40517, "creation_time": "2012-04-01T13:48:13Z", "tags": [], "is_private": false}]