[{"count": 0, "attachment_id": null, "bug_id": 40531, "text": "It's needed to make SavedRequest Serializable to allow the proper handling of\nsession replication in clustered enviroments where form-based authentication and\nmod_jk is used.\n\nmod_jk uses it's internal algorithm to switch between the different instances of\nthe session-replicated clustered environment (Jboss uses treecache for this) and\nbecause SavedRequest is not replicated, as it is not Serializable, the login\nprocess in a form-based authentication protected web application fails where the\nnode in which the login process has begun differs from the node where the\ncredentials are validated.\n\nThis bug report is related to a bug report/feature request available on jboss:\nhttp://jira.jboss.com/jira/browse/JBCLUSTER-148 and it's discussion thread in\nhttp://www.jboss.com/index.html?module=bb&op=viewtopic&t=89734", "id": 93713, "time": "2006-09-18T06:34:16Z", "creator": "argaldo@gmail.com", "creation_time": "2006-09-18T06:34:16Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 40531, "attachment_id": null, "is_private": false, "id": 93714, "time": "2006-09-18T07:25:32Z", "creator": "pr@objektpark.de", "creation_time": "2006-09-18T07:25:32Z", "text": "Hi,\n\nas you use JBOSS please fill this bug at JBOSS Cluster system :-)\n\nTomcat replicated the session principal. Please test you app with tomcat 5.5.17.\n\nThanks\npeter\n "}, {"count": 2, "tags": [], "bug_id": 40531, "attachment_id": null, "id": 93715, "time": "2006-09-18T07:42:47Z", "creator": "argaldo@gmail.com", "creation_time": "2006-09-18T07:42:47Z", "is_private": false, "text": "I'm sure you already know that Jboss constructs a layer on top of an unmodified\nTomcat to migrate and replicate Session info and unless a wrapper over Tomcat's\nSavedRequest Object is written the best way to replicate SavedRequest info is to\nserialize the original Object and well, ... the Object needs to be Serializable\nfor that purpose...\n\nI can't figure the implications of making SavedRequest Serializable but seems\nharmless and esases the replication of that object in different application\nservers embedding Tomcat, not only JBoss..."}, {"count": 3, "tags": [], "text": "Hi,\ncurrently the tomcat don't support real Clustered SSO. The JBOSS Cluster support SSO. We have no \nSavedRequest object. At last Google summer code camp  a SSO project is start but result is not included at \ntomcat 5.5 codebase. \n \nWhat I tell you is, that we transport the session principal to all backup nodes after FORM Login. With a \nsingle\napplication you don't must login after a failure of your primary node.\n\nPeter\n  ", "attachment_id": null, "bug_id": 40531, "id": 93716, "time": "2006-09-18T08:22:32Z", "creator": "pr@objektpark.de", "creation_time": "2006-09-18T08:22:32Z", "is_private": false}, {"count": 4, "text": "Sorry, I may have not provided the necesary info for this.\n\nThis is the situation:\n\nOne cluster of 4 Jboss instances wich use Tomcat as JSP/Servlet implementation\nfor serving a <distributable> web-app.., Jboss takes care of replication and\nclustering issues and Apache+mod_jk takes care of load balancing.\n\nWhen an authentication-protected webapp is deployed in such environment, things\nbegin to go wrong when the node that processes form-based authentication queries\n(j_security_check) is different from the node that redirected the user to the\nlogin page (and the one that saves a SavedRequest object as a note in tomcat's\nSession). That makes succesive authentication request happen as such\nSavedRequest Object is not granted to be available on all cluster nodes, as it\nis not Serializable and it is not monitorized to be replicated within the cluster.\n", "bug_id": 40531, "attachment_id": null, "id": 93717, "time": "2006-09-18T08:40:51Z", "creator": "argaldo@gmail.com", "creation_time": "2006-09-18T08:40:51Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "creator": "pr@objektpark.de", "is_private": false, "text": "Why the node is different? Is your request not correct registered with a session id <id>.<worker.name>.\nPlease, check your url rewriting or cookie handling.\nAlso chech that at server.xml the jvmroute has same name as mod_jk worker name.\n\nPeter\n ", "id": 93720, "time": "2006-09-18T09:07:38Z", "bug_id": 40531, "creation_time": "2006-09-18T09:07:38Z", "attachment_id": null}, {"count": 6, "text": "What we propose is in fact to avoid the use of sticky sessions and deploy a real\nfull replicated-distributed environment as you may see.", "bug_id": 40531, "is_private": false, "id": 93722, "time": "2006-09-18T09:35:30Z", "creator": "argaldo@gmail.com", "creation_time": "2006-09-18T09:35:30Z", "tags": [], "attachment_id": null}, {"count": 7, "tags": [], "text": "Hi\nAll java clustered solutions use stickyness. Only at a failure the session used at a backup.\nPlease read the servlet spec or discuss this topic with JSR servlet spec team.\n\nPeter\n", "is_private": false, "bug_id": 40531, "id": 93723, "time": "2006-09-18T09:50:45Z", "creator": "pr@objektpark.de", "creation_time": "2006-09-18T09:50:45Z", "attachment_id": null}, {"count": 8, "attachment_id": null, "bug_id": 40531, "text": "I can't discuss this with JSR-154 team because it's not specified how this\nparticular case should be handled.\n\nI'm refering SRV.7.7.2 section of the Servlet 2.4 spec wich Tomcat implements in\nrecent versions. Nowhere in that document sticky sessions are mentioned and only\ngeneral comments about serialization and concurrence are provided. In fact it\nsays that \"Migration of sessions will be handled by container-specific\nfacilities.\" so  implementations are free, and because SavedRequest info is\nsaved as a note in Tomcat's Session that's why we ask it to be Serializable\nand/or stored in the session and not as a non-serializable-internal note.\n\n", "id": 93726, "time": "2006-09-18T10:16:23Z", "creator": "argaldo@gmail.com", "creation_time": "2006-09-18T10:16:23Z", "tags": [], "is_private": false}, {"count": 9, "attachment_id": null, "bug_id": 40531, "is_private": false, "id": 93728, "time": "2006-09-18T10:25:15Z", "creator": "pr@objektpark.de", "creation_time": "2006-09-18T10:25:15Z", "tags": [], "text": "This is bugtracking system is not a support forum. \nPlease, discuss this topic a user or developer list. \n\nPeter"}]