[{"count": 0, "tags": [], "creator": "yurlit@gmail.com", "text": "Tomcat Service can not be started if Tomcat was installed into the path, \ncontaining non-ASCII (e.g. Japanese or Chinese) symbols.\n\nThe problem is apparently due to the improper treatment of non-ascii \ncharacters in the \"Java classpath\" section of the Service settings.\n\nIn tomcat5w.exe GUI or windows registry I could see proper PATH, namely\nC:\\[ONE CHINESE HIEROGLIPH]\\Tomcat 5.5\\bin\\bootstrap.jar\n\nUnfortunately, service doesn't get started with the following log:\n\n[2006-09-15 18:29:17] [457  javajni.c] [error] FindClass \norg/apache/catalina/startup/Bootstrap failed\n[2006-09-15 18:29:17] [935  prunsrv.c] [error] Failed loading main \norg/apache/catalina/startup/Bootstrap class C:\\ss\\Tomcat 5.5\\bin\\bootstrap.jar\n[2006-09-15 18:29:17] [1179 prunsrv.c] [error] ServiceStart returned 3\n\nwhere the non-ascii symbol gets replaced with improper ascii 'ss' sequence.\n\n\nMoreover, I tried to define environmental variables PR_CLASSPATH and \nPR_STARTPATH instead of using corresponding service params. The result is \nexactly the same.\n\nPlease, suggest me the workaround to make Tomcat service run.\n\nP.S. The problem is stable either under JRE 1.5.0_02 or 1.4.2_10 (within \ntomcat compatibility package). The problem exist apparently under all OS (in \nparticular, it was detected on Windows 2000 and Windows XP Pro 2002 SP2 either \nChinese version or standard English with Chinese System locale installed.", "id": 93709, "time": "2006-09-17T23:01:02Z", "bug_id": 40530, "creation_time": "2006-09-17T23:01:02Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 40530, "text": "I can reproduce this on the command line, without running Tomcat as a service.\n\nThis looks similar to the cmd.exe issue\nhttp://bugs.sun.com/bugdatabase/view_bug.do?bug_id=5013622\n\nBoth Java & Perl fail when the class file / Perl script are in a directory that\ncontains UTF-8 characters. The only work around I can suggest is to install\nTomcat in a directory that contains only ASCII characters.\n\nI do not believe that this is a Tomcat issue nor is there anything the Tomcat\nteam can do to fix it.", "id": 98022, "time": "2007-01-13T07:25:30Z", "creator": "markt@apache.org", "creation_time": "2007-01-13T07:25:30Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 40530, "text": "I also had this problem on tomcat 6.0.20.\nI installed it on Russian and Japanese machines and got the error.\n\nI found that java itself work fine, i.e if we try to run java class with classpath contained non-ASCII symbols (I used jdk 1.6.0_26). But it work only if PC have proper system locale (Russian or Japanese in my cases).\n\nThen I discovered that there was the similar problem in https://issues.apache.org/jira/browse/DAEMON-87 and it was solved, but it seems that is not the case.\n\nI found also that the problem was in the tomcat's procrun daemon that converts the classpath and other java options to UTF-8, but it seems that java requires ones in current system encoding, so I tried to convert them to ANSI encoding and tomcat started to works.\n\nSo please check my suggestion.", "id": 149881, "time": "2011-09-28T07:48:03Z", "creator": "grishkovalexey@gmail.com", "creation_time": "2011-09-28T07:48:03Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "If the issue is with Commons Daemon, you'll need to raise a bug against that project. Tomcat picks up new versions of Daemon as they become available.\n\nIt would be very helpful if your report for daemon included specific examples as that will make it easier to test.", "id": 149882, "time": "2011-09-28T07:51:09Z", "bug_id": 40530, "creation_time": "2011-09-28T07:51:09Z", "is_private": false}, {"count": 4, "tags": [], "creator": "ankit.shah@nimsoft.com", "attachment_id": null, "is_private": false, "id": 154351, "time": "2012-02-29T08:28:36Z", "bug_id": 40530, "creation_time": "2012-02-29T08:28:36Z", "text": "(In reply to comment #3)\n> If the issue is with Commons Daemon, you'll need to raise a bug against that\n> project. Tomcat picks up new versions of Daemon as they become available.\n> \n> It would be very helpful if your report for daemon included specific examples\n> as that will make it easier to test.\n\nIs this bug resolved ? if yes then in which version ? tomcat 5 or 6 or 7 ?"}]