[{"count": 0, "tags": [], "creator": "macke@yar.nu", "is_private": false, "text": "The latest 1.7 does not address this (according to the release notes), and I\ncould find no enhancement request discussing it either.\n\nMy simple proposal is:\n\nAllow the user to set a custom handler for resolving properties (with the option\nto handle unset properties as errors), similar to setting build listeners.\n\nWe've been running with a modified Ant 1.6.2 for some time that simply throws an\nexception if a non-set property is accessed (when another propery is set, namely\nant.disallow_unset_properties). It works really nice for us and has helped\nfinding quite a few bugs (that's why we added it in the first place), but a more\ngeneral solution would be to provide various property-policies. \n\nThis was discussed quickly on the ant-user-list and the response was 'why not?'.\nSo I'll try to get some time to write a small patch on this. Will post it here\nlater, unless someone has a strong opinion otherwise.", "id": 93776, "time": "2006-09-19T13:23:38Z", "bug_id": 40543, "creation_time": "2006-09-19T13:23:38Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 40543, "text": "Not sure how familiar you are with Ant's codebase.  Actually, though, there\nalready exists the concept of the PropertyHelper chain, which AFAIK could be\nused in the way you suggest.  In current and recent versions of Ant you can\ninstall a custom PropertyHelper using a custom task, or a <script>.  What is\nmissing is a better way to install a custom PropertyHelper.", "count": 1, "id": 93780, "time": "2006-09-19T14:08:35Z", "creator": "mbenson@apache.org", "creation_time": "2006-09-19T14:08:35Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 40543, "is_private": false, "text": "Getting better at that. *browse* :) Yes, using a custom PropertyHelper should work.\n\nI have no problem using a <script>, however I can't find out where to replace\nthe current PropertyHelper instance (which PropertyHelper's setNext() indicates\nshould be possible). I can move that query to the mail-list, if you'd like.\n\n", "id": 93783, "time": "2006-09-19T14:44:39Z", "creator": "macke@yar.nu", "creation_time": "2006-09-19T14:44:39Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 40543, "text": "This is solved in Ant trunk, slated for 1.8.0.  See the PropertyHelper task.", "id": 121962, "time": "2008-10-28T09:49:14Z", "creator": "mbenson@apache.org", "creation_time": "2008-10-28T09:49:14Z", "is_private": false, "attachment_id": null}]