[{"count": 0, "tags": [], "text": "I struggled a bit to determine the exact circumstances, but here goes.\n\nI have two named virtualhosts defined in my httpd-vhosts.conf:\n\n<VirtualHost *>\n    ServerName www.domain1.com\n    ServerAlias www.domainalias1.com\n    DocumentRoot \"D:/Web\"\n</VirtualHost>\n\n<VirtualHost *>\n    ServerName www.domain2.com\n    DocumentRoot \"D:/Web/domain2\"\n</VirtualHost>\n\nI won't bother with details such as RewriteRules and custom log defs, but you \nget the point. Now, if I use this setup, the second virtualhost does *not* \nwork. All requests point to the first host.\n\nIf I either remove the ServerAlias line from the first host, or add a \nServerAlias line to the second one (ServerAlias *.www.domain2.com for example), \neverything works fine.\n\nSo as a clear definition: If a ServerAlias is define in only one of your \nVirtualHost blocks, all requests will always point to the first defined \nVirtualHost.\n\nAs an appendice, this doesn't happen when using <VirtualHost *:80> instead of \njust <VirtualHost *>. But nowhere in the documentation does it mention the port \nis required on each VirtualHost block if they're all the same as the \nNameVirtualHost *:80 line, so let's assume this isn't normal behavior - am I \nright?", "is_private": false, "id": 93943, "creator": "eslachance@gmail.com", "time": "2006-09-21T05:56:33Z", "bug_id": 40563, "creation_time": "2006-09-21T05:56:33Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "eslachance@gmail.com", "text": "Changed version to 2.2.2 , though my Apache HTTPD server on Windows XP is \nactually version 2.2.3 .\n\nAlso, I want to add that I also tried to change the order around, and wherever \nthe ScriptAlias command appears doesn't matter - it's always the *first* host \nthat is used, not necessarily the one with the ScriptAlias.", "id": 93944, "time": "2006-09-21T05:58:59Z", "bug_id": 40563, "creation_time": "2006-09-21T05:58:59Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 40563, "attachment_id": null, "id": 93945, "time": "2006-09-21T06:12:37Z", "creator": "eslachance@gmail.com", "creation_time": "2006-09-21T06:12:37Z", "is_private": false, "text": "Awww double-damn it. I wasn't aware that using <VirtualHost *> was like setting \nthe \"default\" VirtualHost. My tests were flawed from trying more than one thing \nat once. Call me Tired, call me newbie, whatever. Case Closed."}]