[{"count": 0, "tags": [], "bug_id": 40601, "attachment_id": null, "id": 94085, "time": "2006-09-25T17:52:28Z", "creator": "hxbx@gmx.de", "creation_time": "2006-09-25T17:52:28Z", "is_private": false, "text": "I use log4j 1.2.12 in a linux and also in a windows environment.\nI configure a RollingFileApender via an AsyncAppender to my\nLogger. I use the XML Layout. This works fine.\nIn a linux environment can I delete the log file during the use of the\nlogger and I must restart my system to start with a new log file.\nIn a windows environment is the log file locked and I can not delete\nthe log file before the java VM is closed.\nHow can I protect my log files against deleting during use in linux environments?"}, {"count": 1, "attachment_id": null, "creator": "kay.abendroth@raxion.net", "text": "I don't get the point: What exactly do you mean in your last guestion? (Deletion\nfrom within log4j, the os, other users on your system?)", "id": 95705, "time": "2006-11-11T17:06:17Z", "bug_id": 40601, "creation_time": "2006-11-11T17:06:17Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 40601, "attachment_id": null, "text": "I mean how can I protect the active used log file angainst deletion.\nAs example I write my log to a file log.xml.\nThe java VM is active and the logger works and I can delete the file\nlog.xml from a shell with rm log.xml.\nIf I use XP is this not possible, because XP set a log to an open file.\nI can delete the logfile not until before the VM is stopped.\nIs there a way to get this behavior also with linux?\n\nIn a practical way not me delete the log file, but there are other users\nwhich call rm * in the log directory and complain that logging does not work.", "id": 95747, "time": "2006-11-12T12:47:03Z", "creator": "hxbx@gmx.de", "creation_time": "2006-11-12T12:47:03Z", "is_private": false}, {"count": 3, "tags": [], "creator": "kay.abendroth@raxion.net", "attachment_id": null, "id": 95775, "time": "2006-11-13T09:46:49Z", "bug_id": 40601, "creation_time": "2006-11-13T09:46:49Z", "is_private": false, "text": "This is not a bug, but os-specific behaviour. Linux/*nix allways assumes the\nuser knows what he or she is doing.\n\nYou should have asked on the user-list before filing a bug-report. In order to\nprevent your \"not-knowing-what-they-doing\"-users from removing those log-files,\nyou should assign a dedicated user to your application (let's name this user\n\"zeus\"). Create this user and make sure your application runs as this user.\nAfter that do `chown -vR zeus LOGDIR` (where LOGDIR is the path to your\nlog-directory) and `chmod -vR 600 LOGDIR`. Don't forget to change the umask for\nzeus in your login.conf (or whereever  this is done on your machine).\n\nSee your os-specific manuals and - for example - \nhttp://en.wikipedia.org/wiki/Umask for more information."}, {"count": 4, "tags": [], "bug_id": 40601, "attachment_id": null, "id": 95776, "time": "2006-11-13T09:48:01Z", "creator": "kay.abendroth@raxion.net", "creation_time": "2006-11-13T09:48:01Z", "is_private": false, "text": "Closing this as it's not bug."}]