[{"count": 0, "tags": [], "bug_id": 40611, "attachment_id": null, "text": "The example code in example/subclass shows instantiation of custom logger\nsubclasses like this: \n\nMyLogger c = (MyLogger) MyLogger.getLogger(\"some.cat\");\n\nIt does not mention that this mechanism relies on the external configuration\nfile providing necessary attributes to the new logger.  Thus, programmatically\ncreated subclass instances need to do extra work to make sure that the logger\nworks properly.\n\nTo properly create a logger registered with the current Hierarchy, the example\nshould show something like:\n\nMyLoggerFactory factory = new MyLoggerFactory();\nMyLogger c = (MyLogger) LogManager.getLogger(\"some.logger\", factory);\n\n...with the distinction that \"some.logger\" could be a dynamically-generated\nlogger name that does not need to be referenced in an external configuration file.\n\nFurther, if one does not do this, and then tries to add an Appender to the\nLogger, you get a NullPointerException (Category.java:162); this is because the\nLogger isn't part of the LoggerRepository, and has a null value for this.repository.\n\nA note should be added to Logger.getParent() that describes why there's no\nsetParent() and how you go about getting a Logger with a parent.\n\nIt should also be documented that LoggerFactory implementations cannot use\nmakeNewLoggerInstance() to initialize the state of the returned logger in ways\nthat may seem otherwise normal to a factory - e.g. you can't add Appenders to\nthe logger in that function.  This is because the function must return before\nthe logger is added to the Hierarchy before things like Appenders can be added\nwithout the above exception.\n\nFinally, it seems that a lot of the instances of getLogger() are misleading;\nsince they're meant only to be used by Log4j internals.  Again, it seems to me\nthat only the various forms of LogManager.getLogger() should be usable by\noutside callers; the other versions of getLogger() could do with some renaming\nor commenting to discourage mistaken explorations similar to mine.", "id": 94146, "time": "2006-09-27T05:23:05Z", "creator": "michael@frood.org", "creation_time": "2006-09-27T05:23:05Z", "is_private": false}, {"count": 1, "tags": [], "creator": "michael@frood.org", "attachment_id": null, "id": 94147, "time": "2006-09-27T05:45:30Z", "bug_id": 40611, "creation_time": "2006-09-27T05:45:30Z", "is_private": false, "text": "If you agree these changes should be made, I'm happy to spend time putting\ntogether suggested patches for some or all of the above.  I just want to make\nsure it's useful first."}]