[{"text": "This patch fixes a problem I had using the IncludeController in version 2.2,\nwhere nothing other then User Defined Variable assignments were being imported\nfrom the included .jmx file.\n\nBecause everything needs to be placed under a TestPlan in the IncludeController,\nbefore JMeter run, it traverses the subtree of the IncludeController; it only\nadds nodes which are instanceOf Sampler or Controller. Because TestPlan is not\nin these categories, JMeter just omits it and its children and that is why the\nIncludeController does not work.\n\nThe solution is to only return the subtree under the TestPlan when JMeter asks\nfor the replacement subtree. However, it means that all user defined variables\ndefined in the TestPlan will be lost, so we need to make a copy for all the user\ndefined variables from the TestPlan. Because the user defined variable\ncontroller works anywhere in the tree, so it just needs to copy them to\nsomewhere in the tree (I choose to copy them as a child under the TestPlan).\n\nThere is one problem though, the nested IncludeController will not work. I tried\nto fix it but it seemed to be quite a big task. As the most important part is\nworking so I don’t want to spend too much time on it unless someone proves to me\nthat it is worthwhile fixing.", "tags": [], "bug_id": 40671, "attachment_id": null, "count": 0, "id": 94455, "time": "2006-10-03T18:18:11Z", "creator": "nrhope@gmail.com", "creation_time": "2006-10-03T18:18:11Z", "is_private": false}, {"count": 1, "tags": [], "creator": "nrhope@gmail.com", "attachment_id": 18957, "text": "Created attachment 18957\nfixes the problem by \"including\" testplan's children/variables", "id": 94456, "time": "2006-10-03T18:20:07Z", "bug_id": 40671, "creation_time": "2006-10-03T18:20:07Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jmeter@ajilus.com", "text": "Embedded IncludeControllers is definitely a useful feature - especially with\nlarge-scale tests.  For instance, I have several independent tests that include\ncommon components (Login, Logoff, etc).  I also am trying to create a more\ncomprehensive test that runs all of the independent tests together by including\nthem.  Due to the bug mentioned above, the component controllers do not get\ncalled and the scripts fail due to not being logged in and missing other common\nbits.  \n\n", "id": 103856, "time": "2007-05-30T20:35:31Z", "bug_id": 40671, "creation_time": "2007-05-30T20:35:31Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 40671, "attachment_id": null, "id": 151465, "time": "2011-11-14T12:13:07Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-11-14T12:13:07Z", "is_private": false, "text": "Still in 2.5.1"}, {"count": 4, "tags": [], "bug_id": 40671, "attachment_id": 28496, "text": "Created attachment 28496\nTest Plan showing it works when using Test Fragment", "id": 155204, "time": "2012-03-22T08:16:29Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-03-22T08:16:29Z", "is_private": false}, {"count": 5, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "text": "Since JMeter 2.5, Test Fragment has been introduced and is the recommanded (and supported) way of using IncludeController.\n\nUsing this solution, User Defined Variable assignments are being imported as the attached test plan shows it.\n\nI close issue as WONTFIX.", "id": 155205, "time": "2012-03-22T08:18:05Z", "bug_id": 40671, "creation_time": "2012-03-22T08:18:05Z", "is_private": false, "attachment_id": null}]