[{"count": 0, "tags": [], "text": "I was doing load testing against XFire and AXIS (deployed on JBoss 4.0.1SP1). \nI used both JMeter and SOAPUI to measure response time, but the result is quite\ndifferent. SOAPUI says it takes about 10ms, while JMeter think it takes 200ms. \nI checked the reponse, both SOAPUI and JMeter did get the right response back.\n\nFinally, I got wireshark and captured the packets on wire. And here is what I\nobserved: when using JMETER, The HTTP request was segmented into two packets.\nThere was a significant delay (about 200ms) between the first segment and the\nACK. After the server got 2nd packet, it only took 5 ms to send a response back.\n\nAfter some research, I realize that JMeter is using Apache SOAP, which seems\nhandle HTTP request by itself instead of using commons-httpclient. I am guessing\n the improper HTTP handling in Apache SOAP is the root cause. I know Apache SOAP\nis not supported anymore and you are planning to move to another SOAP stack. So\nhopefully my observation give you another reason to move since the whole Web\nService(SOAP) sampler wont be able to provide accurate measurement at all.\n\nLet me know if you need any more information. I have the screen shot of\nwireshark and also the captured packets in pcap format . I dont know how to\nupload though.\n\nThanks for your help,\nFei", "attachment_id": null, "bug_id": 40757, "id": 94826, "time": "2006-10-13T13:48:51Z", "creator": "gbridge0@yahoo.com", "creation_time": "2006-10-13T13:48:51Z", "is_private": false}, {"count": 1, "tags": [], "creator": "woolfel@yahoo.com", "attachment_id": null, "is_private": false, "id": 94827, "time": "2006-10-13T13:54:18Z", "bug_id": 40757, "creation_time": "2006-10-13T13:54:18Z", "text": "Currently there is no plans to upgrade the soap sampler to Axis. I've thought\nabout using Axis, but just don't have the time these days to work on it. if\nanyone wants to upgrade it to use axis, I can provide assistance.\n\npeter"}, {"count": 2, "tags": [], "text": "One can also use SOAP/XML-RPC sampler which does use httpclient", "attachment_id": null, "bug_id": 40757, "id": 122302, "time": "2008-11-08T14:41:27Z", "creator": "sebb@apache.org", "creation_time": "2008-11-08T14:41:27Z", "is_private": false}]