[{"count": 0, "tags": [], "bug_id": 40768, "attachment_id": null, "text": "In any modern browser, the browser normally supports multiple,\nconcurrent, HTTP requests (TCP connections).\nThis is typically used when processing a page requested by the user --\nembedded links will be processed as they are received, and will be\nprocessed in parallel up to the maximum concurrent connection limit of\nthe browser.\n\nAfter fetching a page, each of the embedded URLs is\nfetched by the same thread, serially. The reported time for the top\nlevel page is reported as the sum of the times for loading the top level\npage and each of the embedded URLs. This has no relation at all to the\ntime that will be taken by by a browser. the closes seems to be to\ninhibit fetching embeded URLs, but this does not really emulate a real\nworld user load where the user will be fetching these URLs.\n\nWhat is needed is that a thread fetches a page, discovers embedded URLs,\nthen spawns up to N more threads to fetch these URLs. The reported time\nshould be timed from the commencement of fetching the top level page, to\nthe end of the last fetch of an embedded URL. This will correctly\nemulate a browser, and will report times in line with user experience.\n\nThis is needed to:\n\n* Impose the same load that a browser would.\n* Evaluate page load times experienced by a user with a browser.", "id": 94866, "time": "2006-10-16T11:02:07Z", "creator": "philip@vogon.net", "creation_time": "2006-10-16T11:02:07Z", "is_private": false}, {"count": 1, "tags": [], "text": "*** Bug 40769 has been marked as a duplicate of this bug. ***", "attachment_id": null, "id": 94877, "creator": "sebb@apache.org", "time": "2006-10-16T16:31:03Z", "bug_id": 40768, "creation_time": "2006-10-16T16:31:03Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 40768, "attachment_id": null, "id": 106765, "time": "2007-08-14T15:11:33Z", "creator": "sebb@apache.org", "creation_time": "2007-08-14T15:11:33Z", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of 16060 ***"}]