[{"count": 0, "tags": [], "text": "In Log4j 1.2, there is not a way to specified a level for a specified user.\n\nUse case:\nI have a web application and I want to keep the log level to info or error and\njust set to debug for a single user. \nI know with MDC i'm able to track the username and i know there is a MDCFilter\nin order to filter the log that matches the filter.\nWhat I can do is to set to ALL the global level and then in the filter, to log\nonly the record of the user/s I want.\nI think there is a big drawback in this approach. Basically my log calls are\ndone checking first of all if the level is enable (code guard):\n\nif (log.isDebugEnable()) { \n    log.debug(....);\n}\n\nin order to avoid the parameter evaluation if debug is disabled. \nUsing MDCFilter all calls will be evaluated with a potentially big impact on the\nperformance because the filters are evaluated when the log message is sent to\nthe appenders.\n\nMy idea is to add to each logger a level selector. Like for the appenders, log4j\ncould provide some implementations as LoggerLevelSelector (this should return\nthe level of the logger (maybe not needed)) or UserLevelSelector or\nMDCLevelSelector.", "is_private": false, "bug_id": 40784, "id": 94923, "time": "2006-10-18T03:11:25Z", "creator": "stefano.nichele@gmail.com", "creation_time": "2006-10-18T03:11:25Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 40784, "text": "\nOne solution is to create your own Logger subclass and specify a new\nLoggerFactory in your configuation that does the direct filtering checks that\nyou want.  This is a new feature in 1.3.  Essentially what you could do is\ncreate a Logger that has a filter chain and has a method to evaluate if a\nmessage will be logged.\n\nAnother is to utilize lazy initialization of your messages, i.e. by creating an\nObject where Object.toString() renders the message.\n\nAssuming one of these solutions is adequate, this will be closed in a few months\nas INVALID.", "id": 98599, "time": "2007-01-26T21:43:53Z", "creator": "genman@noderunner.net", "creation_time": "2007-01-26T21:43:53Z", "is_private": false, "attachment_id": null}]