[{"count": 0, "tags": [], "bug_id": 40791, "is_private": false, "id": 94947, "creation_time": "2006-10-18T13:07:05Z", "time": "2006-10-18T13:07:05Z", "creator": "ruben.laguna@gmail.com", "text": "Calculator.java used by SummaryReport uses the startTime of the first sample as\nstart time for it's own calculations. First sample to arrive to summary report\nis not always the first sample in time because some operations may have started\nearlier and will arrive later because the sample come from a jmeter-server (in\ndistributed testing with batch mode this is noticiable) or because the time to\ncomplete the sample locally is high. \n\nFurthermore Calculator (and Summary Report) take the endTime of the last sample\nto arrive as the endTime for all SummaryReport calculations. This is worse\nbecause  in distributed testing the time is not always synchonized to the\nmillisecond and the samples come in batches. \n\nThis produces inaccuracy in the calculations. I'll attach a patch to correct\nthis behavior. Taking the min of samples startTime and the max of the samples\nendTime", "attachment_id": null}, {"count": 1, "tags": [], "creator": "ruben.laguna@gmail.com", "text": "Created attachment 19027\nCalculator.java patch to take min and max of startTimes and endTimes into account\n\nChanges the way SummaryReport calculates the thoughput taking into account the\nmin and max of startTimes and endTimes. Previous version relies on samples\ncoming in order to accurately make the calculations. This assumption is false\nin distributed testing (very false in batch mode!)", "id": 94949, "time": "2006-10-18T13:10:48Z", "bug_id": 40791, "creation_time": "2006-10-18T13:10:48Z", "is_private": false, "attachment_id": 19027}, {"count": 2, "tags": [], "bug_id": 40791, "attachment_id": null, "id": 95031, "time": "2006-10-20T16:35:39Z", "creator": "sebb@apache.org", "creation_time": "2006-10-20T16:35:39Z", "is_private": false, "text": "Thanks.\n\nThe code in SVN branch 2.2 has been fixed, and is in the nightly build:\n\n2-2.20061020"}]