[{"count": 0, "text": "In attempting to resolve undeploy/deploy issues, I turned on antiJarLocking \nand antiResourceLocking in the CATALINE_HOME/conf/context.xml file.\n\nThis worked as expected but for a pretty nasty side-effect.\n\nOur app queries its own deployment context to ferret out db connect strings \nvia a matching jndi tree. We have a webapps/DeploymentProperties/ directory \nwhich contains the properties files for our context ie; \nDeploymentProperties/application/domaindb.properties would contain the db \nsettings for 'application' (we deploy for a specific customer in this fashion).\n\nBecause antiResourceLocking is \"moving\" context - the apps end up in the temp \ndirectory as x-application (where x is some number), calls to query the \ncontext no longer return a context matching our jndi properties tree.\n\nWe are unaware of a workaround for this. We are using getServletContextName() \nto return our context which is now a moving target. Instead of 'application' \nwe get 'x-application' and the app refuses to start when it cannot find its db \nconnection properties file.\n\nWe'd like to find some solution that would not then break the same application \nwhen deployed on tomcaton linux without these settings enabled.", "creator": "rick.fisk@authoria.com", "is_private": false, "id": 94994, "time": "2006-10-19T15:46:40Z", "bug_id": 40801, "creation_time": "2006-10-19T15:46:40Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 40801, "attachment_id": null, "id": 95513, "time": "2006-11-06T20:39:14Z", "creator": "markt@apache.org", "creation_time": "2006-11-06T20:39:14Z", "is_private": false, "text": "You should be able to use a context.xml file with the necessary configuration as\ncontext parameters. http://tomcat.apache.org/tomcat-5.5-doc/config/context.html\nprovides more information. If you have any questions, please use the tomcat\nusers mailing list.\n\nI am closing this as invalid since this isn't a bug but a usage question."}, {"count": 2, "tags": [], "bug_id": 40801, "attachment_id": null, "is_private": false, "id": 95514, "time": "2006-11-06T20:50:54Z", "creator": "rick.fisk@authoria.com", "creation_time": "2006-11-06T20:50:54Z", "text": "I beg to differ. We are using a context.xml file and it conforms to the \ndocument you've linked. \n\nThe problem is that getservletContextName() does not report the context of the \napplication as it was deployed when antiJarLocking and antiResourceLocking is \nenabled.\n\nIf I deploy my app at webapps/foo, getservletContextName reports 8-foo instead \nof the proper context. How is that not a bug?\n\nThe only question I asked was if there was a workaround. What we have had to \ndo is to strip off the leading [\\d-] from the erroneous value returned from \nthe call. "}, {"count": 3, "text": "Sorry, misunderstood what was causing the problem. I'll take another look.", "bug_id": 40801, "is_private": false, "id": 95516, "time": "2006-11-06T21:02:10Z", "creator": "markt@apache.org", "creation_time": "2006-11-06T21:02:10Z", "tags": [], "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 40801, "attachment_id": null, "id": 95708, "time": "2006-11-11T19:33:49Z", "creator": "markt@apache.org", "creation_time": "2006-11-11T19:33:49Z", "is_private": false, "text": "I have looked into this further.\n\nThe following line in a JSP displays the correct display name as defined in my\nweb.xml\n<p><%= pageContext.getServletContext().getServletContextName() %></p>\n\nI can't work out how you are managing to get the directory name unless you are\nusing a different API call. I have confirmed that the context is being deployed\nform the temp directory and that the directory name prefix increments with each\nredeploy.\n\nIf you still see this problem please provide a simple test case (ideally a WAR\nwith a single JSP or servlet) that reproduces the issue so I can look into this\nfurther."}]