[{"count": 0, "tags": [], "bug_id": 4081, "attachment_id": null, "id": 6556, "time": "2001-10-10T12:02:20Z", "creator": "jakarta@ehatchersolutions.com", "creation_time": "2001-10-10T12:02:20Z", "is_private": false, "text": "The following changes would be beneficial for XmlLogger:\n\n* Change it to implement BuildLogger instead of BuildListener (this wouldn't \nbreak backwards compatibility as a BuildLogger is also a BuildListener, so it \ncould be used interchangeably).   Its confusing at the very least to have it \nnamed \"Logger\" when its currently a \"Listener\".\n\n* Have the default output go to log.xml (or the value of XmlLogger.file \nproperty), but allow it to be overridden when using the BuildLogger \nsetOutputPrintStream and setErrorPrintStream."}, {"count": 1, "tags": [], "creator": "jakarta@ehatchersolutions.com", "is_private": false, "text": "* With the change to a BuildLogger, it could also take into account the \npriority of messages logged, and filter appropiately like DefaultLogger does \n(although this may not be desired, since the use of XSLT to view the results \ncould do the filtering).\n\n* Modify the distribution packaging such that log.xsl is included at least in \nant.jar, but perhaps it should be made available outside the .jar file in \na 'etc' directory.", "id": 6682, "time": "2001-10-14T05:47:53Z", "bug_id": 4081, "creation_time": "2001-10-14T05:47:53Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 4081, "attachment_id": null, "id": 8007, "time": "2001-11-16T12:50:01Z", "creator": "sbailliez@apache.org", "creation_time": "2001-11-16T12:50:01Z", "is_private": false, "text": "I'm not OK for filtering, as you mention it is the responsability of the xsl.\nOtherwise I'm OK. :-)"}, {"count": 3, "tags": [], "bug_id": 4081, "attachment_id": null, "id": 8037, "time": "2001-11-18T16:39:20Z", "creator": "robert.watkins@qsipayments.com", "creation_time": "2001-11-18T16:39:20Z", "is_private": false, "text": "There is a valid reason to filter in the XML logger itself, and that is the \nfile size.\n\nWith the full debug log information, the file sizes get quite a lot larger; on \nour build system, we get about 4.5 MB for a normal Ant build, vs 330 KB log \nfiles from CruiseControl (which does provide this filtering). These large files \nare an issue if you wish to store build logs, and they also add a lot of extra \nprocessing time for the XSL.\n\nAdding filtering is a minor addition to the logger, and I would be happy to \nprovide a patch for it if you want."}, {"count": 4, "attachment_id": null, "bug_id": 4081, "is_private": false, "id": 8070, "time": "2001-11-19T12:13:19Z", "creator": "sbailliez@apache.org", "creation_time": "2001-11-19T12:13:19Z", "tags": [], "text": "Point taken about memory size.\n\nThe DOM is stored in memory so this can get problematic for very large build.\nHowever how do you plan to setup a filter in command mode and how do you \nexpress the filter ? an XPath expression in a system property ?\nIf you have an idea, go for it."}, {"count": 5, "tags": [], "creator": "robert.watkins@qsipayments.com", "is_private": false, "text": "The hack I made for CruiseControl was simply to allow the XML Logger to be \naware of the default log level. This could be applied to the Ant XmlLogger \nfairly easily (I'll try and come back with a patch for that later today).\n\nFor more extensive filtering capabilities, I would be inclined to leave those \nto a post-build XSL stylesheet. If it was required, then the XPath in the the \nSystem property would be the way to go. However, the other listeners are only \nfiltered on the log level, and I feel that would be sufficient.", "id": 8073, "time": "2001-11-19T14:51:29Z", "bug_id": 4081, "creation_time": "2001-11-19T14:51:29Z", "attachment_id": null}, {"count": 6, "tags": [], "creator": "jakarta@ehatchersolutions.com", "is_private": false, "text": "Since XmlLogger is currently a *listener*, changing it to implement BuildLogger \nwould solve all of these problems, right?  When its being used as a listener it \nwould not have its logging level set and could pass through everything as it \ncurrently does.  When being used as a logger it could use the log level.  I \nthink it would be possible to just have a boolean flag 'useFilter' default to \nfalse, and set it to true when the log level is set.\n\nCan't we have our cake and eat it too on this issue?  :)", "id": 8094, "time": "2001-11-20T07:21:07Z", "bug_id": 4081, "creation_time": "2001-11-20T07:21:07Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 4081, "attachment_id": null, "id": 9137, "time": "2001-12-21T16:18:54Z", "creator": "sbailliez@apache.org", "creation_time": "2001-12-21T16:18:54Z", "is_private": false, "text": "Back to the original poster now that he is onboard. :-)"}]