[{"count": 0, "tags": [], "bug_id": 40831, "attachment_id": null, "is_private": false, "id": 95150, "time": "2006-10-27T10:10:35Z", "creator": "david+apache@fastolfe.net", "creation_time": "2006-10-27T10:10:35Z", "text": "The RewriteMap documentation says:\n\n   ${ MapName :  LookupKey }\n   ${ MapName : LookupKey | DefaultValue }\n\n   When such a construct occurs, the map MapName is consulted and the key \n   LookupKey is looked-up. If the key is found, the map-function construct is \n   substituted by SubstValue. If the key is not found then it is substituted by \n   DefaultValue or by the empty string if no DefaultValue was specified.\n\nIf the lookup succeeds, but the map contains no value for the given key (a line\nwith only a key, or a key followed by whitespace), this is treated as though the\nkey were absent entirely.  The documentation suggests that this \"no value\"\nsituation should result in an empty string expansion, not DefaultValue, when in\nfact, the DefaultValue is used instead.\n\nIt would actually be kind of nice if it expanded to an empty string (thus making\nthe situation where a key is present but without a value significantly different\nfrom a situation where a key is absent), but I'm fine with a documentation\nfix/clarification, perhaps something like this:\n\n   When such a construct occurs, the map MapName is consulted and the key \n   LookupKey is looked-up. If the key is found and has a non-empty value, the \n   map-function construct is substituted by SubstValue. If the key is not found \n   or is found but has no value, then it is substituted by DefaultValue or by \n   the empty string if no DefaultValue was specified.\n\nAnd perhaps even with this note:\n\n   It is not possible to distinguish between a key present in the map but\n   without a value from a key missing from the map entirely."}, {"count": 1, "tags": [], "bug_id": 40831, "attachment_id": null, "text": "To clarify, I was testing with the text map type.  It might be nice to see if\nthis behavior is the same across other types of maps before making any changes.", "id": 95152, "time": "2006-10-27T10:38:05Z", "creator": "david+apache@fastolfe.net", "creation_time": "2006-10-27T10:38:05Z", "is_private": false}, {"count": 2, "tags": [], "text": "Moving docs bugs to docs@httpd.a.o ownership.", "is_private": false, "bug_id": 40831, "id": 141238, "time": "2010-10-29T11:08:06Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-29T11:08:06Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 40831, "attachment_id": null, "is_private": false, "id": 141445, "time": "2010-11-04T19:13:35Z", "creator": "covener@gmail.com", "creation_time": "2010-11-04T19:13:35Z", "text": "thanks for the report, added an explanation about empty values."}]