[{"count": 0, "tags": [], "text": "sorry for my bad english !!\nplease contact me if anything is not understandable or if you need more information or the code i use\n\nthe problem seems to occur with every version of tomcat 4.x (tried everything since beta 7), i didn't test with any 3.x or older...\n\ni set up tomcat with cocoon2 (tried about every release of cocoon2, the problem remains the same)\n\ni'm generating websites using cocoon's xsp, then transforming and formatting the xml output via xsl into html pages. i use tomcat directly as http-server, not apache nor something else\n\nthe problem: \nmy server has a permanent internet connection with 128kBit bandwith but i'm just able to get about 1,5-2 kByte transfer speed with any client, no matter how much client bandwith i throw at the server. if i do a request with a browser directly from the server like http://localhost:8080/cocoon/foo i get transfer speeds of 45 to 75 kBytes per second (seems a bit low since i'm talking about an athlon 1,5GHz system). cpu utilization stays nearly 0% all the time !! - i think that clearly indicates that something's wrong. as far as i've testet the cocoon examples and documentation provided with the cocoon2 release are suffering from the same problem.\ntoday i tried jetty together with my cocoon2 installation (without any change) and now i'm getting up to 16kByte per sec from the server and a few hundred kBytes locally - seems right to me since cpu utilization is 100% all the time.\n\nif i did something really stupid please accept my apologies and forget about everything i wrote.", "attachment_id": null, "bug_id": 4083, "id": 6560, "time": "2001-10-10T13:12:31Z", "creator": "momo@novitatis.de", "creation_time": "2001-10-10T13:12:31Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 4083, "attachment_id": null, "id": 6561, "time": "2001-10-10T13:27:20Z", "creator": "momo@novitatis.de", "creation_time": "2001-10-10T13:27:20Z", "is_private": false, "text": "i really don't know if this helps but it seem that lynx does a much better job\nas web-cliet since it indicates transfer speeds of about 8kBytes per sec. the\nother measuring was done with opera 5.12. internet explorer 5 and netscape 4.75\nare just as slow as opera but for me there's no easy way to get transfer speeds\n- at least at the moment"}, {"count": 2, "tags": [], "creator": "remm@apache.org", "text": "Well, if we have some hard data, maybe we can do something about it. There's \nnothing I can do at the moment without some additional information.\n\nMaybe it's a connector problem. Try with the HTTP/1.0 connector to see if it \nworks better (it's commented out in the config).", "id": 6568, "time": "2001-10-10T14:05:39Z", "bug_id": 4083, "creation_time": "2001-10-10T14:05:39Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 4083, "is_private": false, "id": 6576, "time": "2001-10-11T01:45:21Z", "creator": "momo@novitatis.de", "creation_time": "2001-10-11T01:45:21Z", "tags": [], "text": "Okay - I really should have tried this before. You're absolutely right, with\nthe HTTP/1.0 connector Tomcat performes the way one would have expected.\nWhat information do you need? I'm not shure if I'm allowed to send the whole project but maybe I can give you a striped down version or I find another\nproject suffering this performance problem. But if you need some specific\ninformation just let me know."}, {"count": 4, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "id": 11602, "time": "2002-03-09T05:33:51Z", "bug_id": 4083, "creation_time": "2002-03-09T05:33:51Z", "is_private": false, "text": "Reopen"}, {"count": 5, "tags": [], "bug_id": 4083, "attachment_id": null, "id": 11603, "time": "2002-03-09T05:48:57Z", "creator": "remm@apache.org", "creation_time": "2002-03-09T05:48:57Z", "is_private": false, "text": "The new HTTP/1.1 connector should fix the problem. It is currently only\navailable in the nightly builds, starting 03/09."}]