[{"count": 0, "tags": [], "creator": "dcanofr@gmail.com", "text": "I have a problem with tomcat. I tried it with tomcat 4 and tomcat 5.\n\nSome users have something wrong in their connections. The problem is that they\nrequest a page, and tomcat response blocks on the write operation. I think, the\nproblem is the socket write. Finally this users could take all available\nconnections. The users free the connections after a looooooong time, so tomcat\nworks without many threads that are blocked.\n\nI supose the problem is that java doesn't support the write timeout in sockets.\nTo reproduce the problem is very easy. Build a program with a socket that\nrequest a big page and don't close it and don't read the response. Then you will\nsee in the tomcat manager that the thread is blocked in the send stage.\n\nThis is a problem if you have a big site and if someone want to do a DoS attack,\nthis is a very easy way. One computer even with a slow connection can make this\nattack.\n\nIs there a way to avoid this? May be apache server could work better with this\nsituation?\n\nThanks in advance.", "id": 95231, "time": "2006-10-31T00:26:34Z", "bug_id": 40848, "creation_time": "2006-10-31T00:26:34Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 95697, "time": "2006-11-11T13:47:57Z", "bug_id": 40848, "creation_time": "2006-11-11T13:47:57Z", "is_private": false, "text": "A Google search for \"slow client connection DOS\" provides lots if interesting\nreading including some discussions on httpd functionality.\n\nFor now I am closing this as INVALID as there isn't an actual Tomcat bug or\nrequest for a specific new feature in this report. I would suggest that the\nusers list is the best place to discuss options for handling this particular\nproblem. If the result of that discussion is \"If only there was an option in\nTomcat that enabled admins to...\" then please re-open this issue as an\nenhancement request and document the requirement. As ever in open source,\nenhancement requests are more likely to be implemented if accompanied by a\ntested patch."}]