[{"count": 0, "tags": [], "bug_id": 40878, "attachment_id": null, "id": 95354, "time": "2006-11-02T09:08:35Z", "creator": "rbaily@servicebench.com", "creation_time": "2006-11-02T09:08:35Z", "is_private": false, "text": "This is really more an enhance,ent request then a bug.  Here is the situation:\n\nWe set up Apache 2.2.3 on a Linux server and set up Subversion 1.4.0 to be\nhandled by it.  We set up authentication to use LDAP to authenticate users.  We\nare authenticating to a Windows 2003 server through its LDAP service (using\nGlobal Catalog).\n\nHere is the basic configuration.  I mangled some of the entries here as to not\nexpose anything.\n\n<Location />\n    AuthName \"SVN\"\n    AuthType Basic\n    AuthBasicProvider file ldap\n    AuthzLDAPAuthoritative Off\n    AuthLDAPURL ldap://machinename:3268/dc=Company,dc=com?sAMAccountName?sub\n    AuthLDAPBindDN \"user@domain.com\"\n    AuthLDAPBindPassword \"xxxxx\"\n    AuthUserFile /var/subversion/conf/svn-auth-users\n    Require valid-user\n</Location>\n\nSo what happens is that generally it works fine.  But then if a user is inactive\nfor a while (appears to be between 1 and 2 hours) and then tries to perform\nanother operation they get a 500 internal error and a message similar to this is\nlogged in the log file.\n\n[Wed Nov 01 11:50:40 2006] [warn] [client 10.1.2.47] [3994] auth_ldap\nauthenticate: user rbaily authentication failed; URI\n/svn/projects/candyland/trunk [LDAP: ldap_simple_bind_s() failed][Can't contact\nLDAP server]\n\nIf they attempt to rety the operation then usually between 2 to 5 times it comes\nback with no problem.  So this was becoming a major headache and causing our\ndevelopers some pain in getting code checked in or getting updates.  Also it was\ncausing some problems with a continuous build server.  I am not certain about\nthe exact time period or the inactivity but indications pointed to this.\n\nSo I looked at the code in modules/ldap/util_ldap.c and changed it slightly. \nThere is a section of code that attempts to do ldap_simple_bind_s and repeats 10\ntimes if it is getting a LDAP_SERVER_DOWN code.  What I noticed about this is\nthat the connection is not truly being reset everytime.  It basically starts\nwith the current state and tries to bind again.  So I moved out the code that\nwas in the upper part of the uldap_connection_open into a function called\nuldap_connection_init.  Then in the failures loop if we get halfway (5 tries)\nthen I changed it to unbind and then init it before trying to bind again.\n\nThis has worked well for us as we are no longer getting this.  So I realize this\nmay be a Windows only issue and people may not be too keen on corecting it but\nit seems like it could happen on other types of LDAP servers as well.  I also\nthink the design is a little better having the init stuff put out in a separate\nfunction rather than in the open function.  Also I changed some of the other\nplaces that had multiple statements for the unbind to call\nuldap_connection_unbind which handles it.\n\nI think ideally it would be better if we could configure the 10 and 5 numbers\nthrough the configuration file but I wasn't really sure how to handle that.\n\nI'll attach a patch to this shortly."}, {"count": 1, "tags": [], "text": "Created attachment 19076\nProposed patch for the enhancement.\n\nIdeally I think the 10 and 5 in the failures loop would be configrable with\nsome defaults like the numbers that are currently used.  However I wasn't\nreally sure about the best way to put that in so I did not do that.", "attachment_id": 19076, "id": 95355, "creator": "rbaily@servicebench.com", "time": "2006-11-02T09:10:19Z", "bug_id": 40878, "creation_time": "2006-11-02T09:10:19Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 40878, "is_private": false, "count": 2, "id": 95358, "time": "2006-11-02T09:26:22Z", "creator": "rbaily@servicebench.com", "creation_time": "2006-11-02T09:26:22Z", "text": "Changing severity to enhancement.  Although some people may think it is a bug\nsince it eventually fails the LDAP authentication."}, {"count": 3, "tags": [], "text": "Checked into trunk and proposed for backport to 2.2", "attachment_id": null, "id": 95585, "creator": "bnicholes@apache.org", "time": "2006-11-08T12:48:37Z", "bug_id": 40878, "creation_time": "2006-11-08T12:48:37Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 40878, "attachment_id": null, "id": 102135, "time": "2007-04-23T09:35:47Z", "creator": "john.tracy@covenant.edu", "creation_time": "2007-04-23T09:35:47Z", "is_private": false, "text": "In our environment we're running Apache 2.2.3 on a Solaris 10 box authenticating\nagainst a Windows 2003 LDAP server. This issue also appeared when our developers\nstarted porting applications over to Apache from IIS. In our situation, it would\nsometimes appear even upon an initial connection from a user after attempting to\nauthenticate against LDAP. This was after the web server daemon was online for a\nfew hours (four). The end user, if they entered their username/password\ncorrectly (or perhaps incorrectly too) would immediately get a 500 Internal\nServer error message, and an entry like this would be logged:\n\n[Mon Apr 23 12:05:36 2007] [warn] [client 101.10.115.53] [21514] auth_ldap\nauthenticate: user tracy authentication failed; URI /em/gs [LDAP:\nldap_simple_bind_s() failed][Can't contact LDAP server]\n\n"}, {"count": 5, "tags": [], "bug_id": 40878, "attachment_id": null, "id": 149390, "time": "2011-09-17T15:53:29Z", "creator": "sf@sfritsch.de", "creation_time": "2011-09-17T15:53:29Z", "is_private": false, "text": "in 2.2.4"}]