[{"count": 0, "text": "The attached patch provides several changes/enhancements to ScriptRunner.\n\nThey fall into two kinds of change. The first are changes to improve the\nfunctionality required by the script task and include:\n\n+ remove explicit groovy registration - this hack is no longer required as\nGroovy registration is built in to bsf 2.4.0 which is a dependency of\nant-apache-bsf.jar.\n\n+ make use of FileUtils reader functionality - reduces code in ScriptRunner and\nmay prove superior for handling scripts with encoding (this is the approach\nWebTest has used for the last 2-3 years without issues from its users)\n\n+ minor reduction in duplication when binding to components\n\n+ some additional refactoring to reduce method JavaNCSS and fix typos\n\nThe second kind are items which make ScriptRunner more functional as a support\nclass within the codebase. The functionality has existed within WebTest for\nseveral years but it would be good to not have to repeat code from Ant in\nWebTest. Here are the changes:\n\n+ allow script variable to be cleared - this allows ScriptRunner objects to be\ncached and re-used\n\n+ support both evaluateScript() as well as executeScript() - this is very handy\nfor single line scripts which return a value and saves having to set an Ant\nproperty to get something back (WebTest uses this to allow \"script properties\".\nProperties with a prefixed namespace 'script:' are passed to evaluate, e.g.\n${script:getProperty('user.home').reverse()} or\n${script:getProperty(numFiles).toInteger()*getProperty(maxFileSize).toInteger()}\n\nI believe the additional changes are low risk - this is just a helper object not\nnormally visible directly to Ant Scripts. Having the extra functionality\navailable will assist further integration between Ant and scripting languages\nlike Groovy, JRuby and Jython.\n\nIf the \"fancy\" additions are deemed not desirable, a workable minimum partial\nstep that would assist me is to make a protected reset() method that cleared the\nscript variable. At the moment, that variable is private and all public methods\nonly extend its value. This makes it difficult to minimise memory usage for\nlarge scripts which perform a lot of scripting.\n\nA slightly more elaborate workaround would be to make reset public or protected\nand also refactor out the methods used by evaluate (as per the patch) and make\nthose methods protected. Of course, these two workarounds are not as ideal as\nincorporating all of the patch.\n\nI am happy to help with any further work required to get this across the line -\npreferably for 1.7 (apart from additions, no publicly visible API changes are\nrequired and no tasks are affected so I hope this is a possibility still).\nThe patch has javadoc comments. The existing tests for script need to be run.\n\nThanks, Paul.", "bug_id": 40908, "attachment_id": null, "id": 95466, "time": "2006-11-06T04:42:57Z", "creator": "paulk@asert.com.au", "creation_time": "2006-11-06T04:42:57Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 40908, "attachment_id": 19090, "text": "Created attachment 19090\nuniversal diff for ScriptRunner", "id": 95467, "time": "2006-11-06T04:44:06Z", "creator": "paulk@asert.com.au", "creation_time": "2006-11-06T04:44:06Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 40908, "attachment_id": null, "id": 95472, "time": "2006-11-06T05:10:31Z", "creator": "peterreilly@apache.org", "creation_time": "2006-11-06T05:10:31Z", "is_private": false, "text": "Hi,\nthanks for the patch, I will see what can be done.\n\nthere is no need to remove the groovy registration\nas we will still need to support bsf < 2.4.0, the\ndependency is a compile-time, not a run-time.\n\nI am currently in the process of doing a big modification\nof script to support jsr scripting, it should be in ant 1.7.1.\n\n"}, {"count": 3, "text": "Hi Paul,\nI have committed a refactoring of ScriptRunner which\nincludes most of the changes in your patch - implemented\nin a different way (to allow future addition of jsr script\nrunner) Can you have a look at the changes.", "creator": "peterreilly@apache.org", "attachment_id": null, "id": 96128, "time": "2006-11-23T14:54:28Z", "bug_id": 40908, "creation_time": "2006-11-23T14:54:28Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "paulk@asert.com.au", "attachment_id": null, "id": 96146, "time": "2006-11-24T03:07:28Z", "bug_id": 40908, "creation_time": "2006-11-24T03:07:28Z", "is_private": false, "text": "Thanks very much Peter. This is great! I'll check out the code over the next few\ndays."}, {"count": 5, "tags": [], "bug_id": 40908, "attachment_id": null, "text": "The changes in this patch have mostly been implemented\nin Ant 1.7.0.", "id": 97424, "time": "2006-12-28T12:32:27Z", "creator": "peterreilly@apache.org", "creation_time": "2006-12-28T12:32:27Z", "is_private": false}]