[{"count": 0, "tags": [], "bug_id": 40947, "text": "Heya Folks,\n\nThe process to stop the server currently passes a string (\"SHUTDOWN\" by default)\nto a port (\"8005\" by default) on the localhost.\n\nThis is a security hole, since anyone with access to the machine can thus\nshutdown the server.\n\nYes, i know it's possible to prevent users access to the machine, change the\nport and string, setup firewall rules to prevent access to the port. But that's\nall working around the real problem.\n\nWe really need a new less insecure way to stop the server.\n\nMazzel,\n\nMartijn.", "id": 95683, "time": "2006-11-11T03:16:07Z", "creator": "Martijn.Ras@GMail.com", "creation_time": "2006-11-11T03:16:07Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 40947, "is_private": false, "id": 96554, "creation_time": "2006-12-06T02:21:49Z", "time": "2006-12-06T02:21:49Z", "creator": "remm@apache.org", "text": "We will be waiting for your suggestions on dev@tomcat.", "attachment_id": null}, {"count": 2, "tags": [], "creator": "rm@moosauer.de", "is_private": false, "id": 96556, "attachment_id": null, "bug_id": 40947, "creation_time": "2006-12-06T03:44:22Z", "time": "2006-12-06T03:44:22Z", "text": "On Unix, this is already possible using the 'jsvc'-Binary.\nAFAIK simply remove the 'shutdown'-element from server.xml\n\nI'm not sure for Windows, the procrun service behaves a little different.\nDoes anybody know?\n\nR."}, {"attachment_id": null, "tags": [], "creator": "shankarunni@netscape.net", "text": "(In reply to comment #2)\n> On Unix, this is already possible using the 'jsvc'-Binary.\n> AFAIK simply remove the 'shutdown'-element from server.xml\n\n\"jsvc\" doesn't do any magic - it just kills the process. You'd prefer to kill\ntomcat cleanly (by making it shut down cleanly somehow) - which is why you have\nthis mechanism to tell it to do so. \n\nOf course, on non-Windows boxes, Tomcat catches TERM signals and exits cleanly.\n\nAnd AFAIK, setting the Server's port to \"-1\" disables the opening of the port,\nand then you have to be logged in as the user that Tomcat is running under (or\nas root) in order to kill it (by sending it a \"TERM\" signal).\n\nSo that should take care of many of the security concerns on Unix.\n\nOn Windows, I'm not sure what signals terminate Tomcat if it's running as a\nservice - if it's running as a command-line process, then CTRL-BREAK should do it.\n", "count": 3, "id": 96632, "time": "2006-12-07T14:13:39Z", "bug_id": 40947, "creation_time": "2006-12-07T14:13:39Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "rm@moosauer.de", "text": "Hi Shankar,\n\nyour comment seems not to clarify anything. Can we agree on this:\n1. yes, jsvc is SIGTERM'ed on shutdown\n2. But the kill is _always_ clean, because Tomcat is properly shut down via \nthe 'Daemon' interface.\n3. Of course, jsvc is not available under Windows. There we have PROCRUN,\n  which does not use the daemon interface and use a quite different approach,\n  which is IMHO less clean.\n  (But procrun does a very good job controlling service parameters)\n4. Command-line-mode was not the subject here.\n\nMore comments?\n\nR.", "count": 4, "id": 96711, "time": "2006-12-10T13:59:45Z", "bug_id": 40947, "creation_time": "2006-12-10T13:59:45Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "shankarunni@netscape.net", "text": "The subject was that you felt that using a port and reading a string to shutdown\ntomcat was insecure.\n\nMy point was that you don't have to rely on that mechanism - there are other\nmechanisms already available to you. If you are uncomfortable with the shutdown\nport, you can disable it in your installation and use a method you think is more\nsecure.\n\nIn either case, if you want to disable the shutdown port, *and* have Tomcat work\nas a \"system service\" either on Linux/Unix or Windows, some custom work will be\nrequired on your part.\n\nFor Linux, you'll have to adjust the startup script to kill tomcat instead of\ninvoking its \"stop\" command.\n\nOn Windows, there may be an issue because the default service stop/start\ndefaults to using PROCRUN to invoke the Catalina stop() entry point which simply\nsends a string to the shutdown port. Perhaps a custom shutdown script can be\nwhipped up to send a CTRL-BREAK to the process instead, and have the service\ninvoke that for stopping the process (this may require some development work).\n\nOn second thought, I think this may be a valid enhancement request for the\nfuture - a more reliable semi-secure mechanism so that only the process owner or\nthe administrator can shut the process down. \n\nMartin: perhaps you can create a separate enhancement request for this?  But\nit's definitely not a very high priority - for most environments, this isn't an\nissue, and for the few where it is (shared Linux environments in schools, etc.),\nit's possible to hand-tweak the init scripts and server.xml to not use the\nshutdown port at all.", "count": 5, "id": 96921, "time": "2006-12-14T10:39:16Z", "bug_id": 40947, "creation_time": "2006-12-14T10:39:16Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "Martijn.Ras@GMail.com", "text": "The enhancement request is in bug #41188", "count": 6, "id": 96978, "time": "2006-12-16T01:39:30Z", "bug_id": 40947, "creation_time": "2006-12-16T01:39:30Z", "is_private": false}, {"count": 7, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 96980, "time": "2006-12-16T02:24:57Z", "bug_id": 40947, "creation_time": "2006-12-16T02:24:57Z", "text": "*** Bug 41188 has been marked as a duplicate of this bug. ***"}]