[{"attachment_id": null, "tags": [], "bug_id": 40967, "is_private": false, "count": 0, "id": 95806, "time": "2006-11-13T16:58:24Z", "creator": "Tim.Whittington@orionhealth.com", "creation_time": "2006-11-13T16:58:24Z", "text": "The IIS connector currently hard codes the default connection_pool_size to 10,\nwhich matches the PWS installed on NT Workstation and Win2k/XP Pro.\n\nThe Apache 2 connector in comparison auto detects the max threads per child\nprocess on all platforms (although the docs don't indicate that this works for\nmpm_winnt when it does).\n\nGiven that the docs are somewhat vague about the impacts of getting this wrong\n(e.g. a silently dropped TCP connection with only a warn level error message to\nindicate failure), this is a dangerous situation.\n\nThe attached patches:\n - Reports a failure to obtain an endpoint as an error (which it is) with the\nrecommendation that connection_pool_size be corrected.\n - Detects the current operating system and calculates the number of threads in\nthe IIS child process (this being the value of PoolThreadLimit, which is either\nspecified in the registry or calculated as 2*MB Ram on the machine capped at\n256). The default connection_pool_size is then set to match the max number of\nthreads that IIS will allocate.\n - Document the new behaviour for the IIS connector, and clarify the docs for\nApache connectors, especially when used with mpm_winnt.\n\nThe PoolThreadLimit calculation (which applies to IIS 5 and 6) was obtained from\nhttp://technet2.microsoft.com/WindowsServer/en/library/bd33bd8c-321a-4c28-8cb9-92ecc1b3b4381033.mspx?mfr=true\nThis has been tested on XP Pro and Windows 2003 Server Enterprise Edition."}, {"count": 1, "tags": [], "bug_id": 40967, "text": "Created attachment 19123\nPatch to automatically detect PoolThreadLimit for the IIS process and handle endpoint allocation failures", "id": 95807, "time": "2006-11-13T16:59:08Z", "creator": "Tim.Whittington@orionhealth.com", "creation_time": "2006-11-13T16:59:08Z", "is_private": false, "attachment_id": 19123}, {"count": 2, "tags": [], "bug_id": 40967, "text": "Created attachment 19124\nUpdated docs for auto-sizing of connection_pool_size", "id": 95808, "time": "2006-11-13T16:59:29Z", "creator": "Tim.Whittington@orionhealth.com", "creation_time": "2006-11-13T16:59:29Z", "is_private": false, "attachment_id": 19124}, {"attachment_id": null, "tags": [], "bug_id": 40967, "is_private": false, "count": 3, "id": 95834, "time": "2006-11-14T08:31:12Z", "creator": "mturk@apache.org", "creation_time": "2006-11-14T08:31:12Z", "text": "Hi,\n\nI have increased the default connection pool size to 250.\nThis value is the same as found in the Apache httpd.\nOn workstation the IIS itself will never create more then 10\nthreads, so the extra slots will not be used.\n\nI would be OK with the patch that would depend on the\nsetup value for the read_registry_pool_thread_limit, but\nnot with determinig that by some guessing like memory size, etc..\n\nSo, you can modify your patch to use only the exact value,\nand I'll commit that.\n\n"}, {"count": 4, "tags": [], "creator": "Tim.Whittington@orionhealth.com", "attachment_id": null, "text": "The calculation in this patch is exactly what IIS calculates - e.g. check for\nPoolThreadLimit in the registry, and calculate it as MIN(2*MB, 256) otherwise.\n(This is described clearly in the linked technet article, and repeated\nthroughout the IIS docs, so it's by no means guesswork).\n\ne.g. almost every IIS on a server in the world has 256 threads per process.\nSetting the default to 250 will still leave a small window where the connection\npool can be overloaded by the web server.\n\nI'd be fine with assuming that every server OS we'll encounter has a minimum of\n128MB RAM, and hard coding the 256 as the default for server OSes (with the\nregistry check for override). I can modify the patch to do that if you agree.\nLike you say, as long as high rather than low, it just won't use the extra slots.", "id": 95838, "time": "2006-11-14T11:07:50Z", "bug_id": 40967, "creation_time": "2006-11-14T11:07:50Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 40967, "attachment_id": null, "text": "Hmm,\n\nI even think that 250 is too large.\nIt should be the default value of Tomcat maxThreads for AJP/1.3 connector,\nand that is 40 for TC6 AJP APREndpoint, cca 150 for others.\n\nWith huge values for connection_pool_size the Tomcat will refuse\nconnections. So setting that to what IIS allows as max by guessing\nthe memory on the system is no go.\n\nLike said, only if there is a way to get the configured IIS value,\nthat was configured by the hand, then OK, part of the patch can be\napplied.\n\nPlease use develpers list if you wish to discuss the subject.", "id": 95839, "time": "2006-11-14T11:40:52Z", "creator": "mturk@apache.org", "creation_time": "2006-11-14T11:40:52Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 40967, "text": "My impression is, that these parameters are not well documented.\n\n1) MaxPoolThreads is said to not include ISAPI threads, but as I understand it,\nwe are only interested in ISAPI threads\n\n2) PoolThreadLimit is a system wide hard limit, but we need to know ISAPI\nthreads in one process\n\n3) Other docs contain totally different rules:\n\nhttp://download.microsoft.com/download/2/8/0/2800a518-7ac6-4aac-bd85-74d2c52e1ec6/tuning.doc\n\nI find the situation very confusing.\n", "id": 95842, "time": "2006-11-14T14:02:51Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2006-11-14T14:02:51Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 40967, "text": "Created attachment 21539\nUpdated IIS PoolThreadLimit detection patch\n\nI've updated the patch to remove the memory limit detection - even if it's\ncorrect there are very few servers in existence that it would matter for\nanyway.\nThis patch reads PoolThreadLimit from the registry and defaults to 256/10 for\nIIS/PWS variants respectively", "id": 113808, "time": "2008-02-15T17:48:41Z", "creator": "Tim.Whittington@orionhealth.com", "creation_time": "2008-02-15T17:48:41Z", "is_private": false, "attachment_id": 21539}]