[{"count": 0, "tags": [], "creator": "binghe.lisp@gmail.com", "attachment_id": null, "id": 95927, "time": "2006-11-17T07:13:55Z", "bug_id": 40993, "creation_time": "2006-11-17T07:13:55Z", "is_private": false, "text": "\"JSESSION\" is a standard session identifier, but sometimes this may need to do\nsome change. For example, if two J2EE application in then same site domain, and\nboth of them use a \"JSESSIONID\" cookie... something wrong may be happened.\n\nSo I think this patch may be useful, at least for me."}, {"count": 1, "tags": [], "creator": "binghe.lisp@gmail.com", "attachment_id": 19134, "id": 95928, "time": "2006-11-17T07:17:02Z", "bug_id": 40993, "creation_time": "2006-11-17T07:17:02Z", "is_private": false, "text": "Created attachment 19134\nA patch use tomcat's connector/jk as base dir"}, {"count": 2, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "id": 96059, "time": "2006-11-22T02:05:30Z", "bug_id": 40993, "creation_time": "2006-11-22T02:05:30Z", "is_private": false, "text": "We should discuss this for a post 1.2.20 release.\n\nIf I read it right, the spec mandates the use of ;jsessionid (path param) resp.\nJSESSIONID (cookie). On the other hand, mod_jk doesn't want to read a session\nvalue, it only needs a routing information, which the spec doesn't talk about.\nSo it would make sense to allow other models of passing the routing info.\n\nIf we make this configurable, we would need to discuss:\n\n- do we want to make path param and cookie configurable? Any relation between them?\n  Suggestion: make both configurable, independently\n\n- should it be possible to decide which of the two are used? What about the order?\n  Suggestion: one should be able to choose. Not sure about preferences.\n\n- cookie: how do we describe, what part of the cookie needs to be extracted as a\nrouting id from the value of the cookie? Seperator? Regexp? Position?\n\n- path param: would we also allow query attributes (think about POST requests)\nor only real path params? Would it be necessary to choose a seperator? How to\ndescribe the part of the param, that's the routing id (Separator? Regexp?\nPosition?).\n\n"}, {"count": 3, "tags": [], "bug_id": 40993, "attachment_id": null, "id": 110516, "creation_time": "2007-11-14T00:47:20Z", "time": "2007-11-14T00:47:20Z", "creator": "mturk@apache.org", "text": "Like Rainer said. This is for post 1.2 feature\n\nThe proper solution would be to use rewriting as well as configurable\nsession identifier, because configurable session identifier would require\nadditional changes in Tomcat as well, and that won't happen because it\nbreaks the spec.\n\nThe only solution is to rewrite the JSESSIONID cookie or ;jsessionid path\non the fly on each request/response.\nI'm almost sure you can already do that with Apache's mod_rewrite, but anyhow,\nit's a JK3 material", "is_private": false}, {"count": 4, "tags": [], "creator": "rainer.jung@kippdata.de", "text": "This was added in mod_jk 1.2.27.\nSee \"session_cookie\" and \"session_path\" on http://tomcat.apache.org/connectors-doc/reference/workers.html.", "id": 180099, "time": "2014-12-31T14:57:54Z", "bug_id": 40993, "creation_time": "2014-12-31T14:57:54Z", "is_private": false, "attachment_id": null}]