[{"count": 0, "tags": [], "bug_id": 41048, "is_private": false, "id": 96227, "attachment_id": null, "creator": "bugzilla@l-i-e.com", "creation_time": "2006-11-27T13:29:53Z", "time": "2006-11-27T13:29:53Z", "text": "I installed okay, and it ran okay, but as soon as I tried to restart, I was\ngetting errors with what Microsoft says was vendor-specific error code 1.\n\nStarting from a shell (cygwin, actually) yielded:\n\n$ ./httpd.exe -k start\n[Mon Nov 27 15:11:11 2006] [error] (OS 2)The system cannot find the file\nspecified.  : No installed service named \"Apache2\".\n\nI believe the problem is that I named the service as \"Apache2.2\" during the\ninstallation, which, upon reading these bug reports, is probably invalid.\n\nThe installer shouldn't let me do that.\n\nOr, if I'm reading this stuff wrong and \"Apache2.2\" is a valid service name, the\nstartup should not be looking for the default \"Apache2\" service name, but what I\nput in during the installation process.\n\nIf all of that is impossible, a better error message somewhere in the error log\nfile would have been very useful -- as it stands now, you have to be pretty\ngeeky to dink around with it long enough to get that error message out of a shell.\n\nAt any rate, I have to re-install, which is a pain, but will presumably be a\ngood workaround.\n\nPS\nIf I just run httpd.exe without the -k start flags, I then have what seems like\na running process, but it crashes as soon as I surf to it...\nThis may be part of the same problem, or I may be adding another bug report\nafter I fix the service name."}, {"attachment_id": null, "tags": [], "bug_id": 41048, "text": "All of this is by design\n\n\"if I'm reading this stuff wrong and \"Apache2.2\" is a valid service name, the\nstartup should not be looking for the default \"Apache2\" service name, but what I\nput in during the installation process.\"\n\nYou are, it is.  And I'll investigate if there should be a different default.\n\nIn ANY case the workaround is absolutely trivial...\n\n./httpd.exe -k start -n Apache2.2\n\nor if you have a space in a service name\n\n./httpd.exe -k start -n \"Apache Service\"\n\nalthough you can use the shorthand and simply omit the spaces.\n\nThe running apache as-a-service section in the docs spells this\nall out quite clearly.\n\n", "count": 1, "id": 96231, "time": "2006-11-27T13:58:09Z", "creator": "wrowe@apache.org", "creation_time": "2006-11-27T13:58:09Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 41048, "text": "All I know is, I didn't do anything THAT weird in installation, and it didn't go\nwell after I re-started with the GUI tools.\n\nAn attempt to re-install didn't seem to prompt me for the service name, so\neither it assumed I wanted to keep \"Apache2.2\", or it's hard-wired or...\n\nEven if I could start it by hand using ... -n Apache2.2, I'd then have to dink\nwith all the GUI settings to fix that in what seems to be several places, if I\ncan even find them all.\n\nPut it this way:\nWhen it ends up being easier for an end user to edit the Registry by hand and\nrename the key to \"Apache2\", you know you've got problems.\n:-)\n\nI'm seriously re-considering this whole plan, and installing a dual boot on my\nemployer's computer maybe be easier than dealing with Windows Apache MSI...\n", "count": 2, "id": 96236, "time": "2006-11-27T14:16:12Z", "creator": "bugzilla@l-i-e.com", "creation_time": "2006-11-27T14:16:12Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 41048, "text": "You reported a bug that Apache 2.2 is an invalid service name and it is valid.\n\nPlease leave the bug closed - issues.apache.org is for tracking source code\nflaws.\n\nThe document you need to read is\n\n  http://httpd.apache.org/docs/2.2/platform/windows.html#winsvc\n\nThe GUI tools present the INSTALLED NAME of each of the services, if you\ndescend into the command line you should learn the command syntax.", "count": 3, "id": 96241, "time": "2006-11-27T14:46:25Z", "creator": "wrowe@apache.org", "creation_time": "2006-11-27T14:46:25Z", "is_private": false}, {"count": 4, "tags": [], "creator": "bugzilla@l-i-e.com", "text": "Apache2.2 may be a valid name.\nBut if the MSI chooses 'Apache2.2', and the \"start\" script uses 'Apache2', it's\npretty broken.\n\nI've given up on the GUI.\n\nAnd I wish the MSI thing was gone and I could just unzip and copy like I used to.\n\nI'm a Linux/FreeBSD guy, forced by circumstances to try and install on Windows,\nand it was not pleasant.\n\nI fell back to 1.3.37 anyway, as I couldn't get 2.2 nor 2.0 to run without\ncrashing once I installed PHP5.\n\nMaybe you guys can get the bug reports that get sent off to Microsoft, or maybe not.\n\nI don't know how to do much of anything on Windows, so can't file a decent bug\nreport.\n", "id": 96295, "time": "2006-11-28T11:12:48Z", "bug_id": 41048, "creation_time": "2006-11-28T11:12:48Z", "is_private": false, "attachment_id": null}]