[{"count": 0, "tags": [], "creator": "bugzilla@l-i-e.com", "text": "It would be Really Nifty (tm) if the default MSI installer would add -E\n~/logs/error_log to its service and monitor startup parameters, so that when\nusers add modules or edit httpd.conf in other ways, they can get some feedback\non their problems.\n\nFor example, messed up permissions on DLLs for modules such as PHP will generate\nno useful info unless one does this.\n\nOr, at least, I was only able to figure out what was wrong with the permissions\nwith this...\n\nIt doesn't seem like -E logging would impact performance, as it occurs at\nstartup, and would get rid of a few bogus bug reports, for those users who DO\nlook at log files to try to find out what went wrong.\n:-)\n\nPS\nSending the errors to the Windows Event log as well would also be Nifty, for\nthose users who check there first...\n\nThe really WEIRD thing is that Windoze claims my System event log is corrupted.\nUnless I am editing it in PFE (a text editor) and then it doesn't.\nI don't even want to know how they managed to write code that did that...", "id": 96248, "time": "2006-11-27T15:22:44Z", "bug_id": 41050, "creation_time": "2006-11-27T15:22:44Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 41050, "attachment_id": null, "text": "The Windows Event log is used to collect these events by-default.  I don't really\nsee an advantage to the proposal (incidently, I implemented -E).\n\n-E is an alternative you are welcome to use...\n\nhttpd -k config -n servicename [more parameters]\n\nincluding -E will let you vary this behavior itself.  While httpd users are very\nfamiliar with looking in the error log, most incoming windows users don't even\nknow it exists - they are familiar with the event log.\n\nAs far as your corrupt system - ugh.  Good luck with that.\n\nI'll leave this open to see if others weight in.  I'm glad the feature helped\nyou in spite of a terribly borked OS install.", "id": 96259, "time": "2006-11-28T01:00:41Z", "creator": "wrowe@apache.org", "creation_time": "2006-11-28T01:00:41Z", "is_private": false}, {"count": 2, "tags": [], "text": "Since there was no further feedback, closing.\n\n", "is_private": false, "bug_id": 41050, "id": 112010, "time": "2007-12-21T20:20:44Z", "creator": "wrowe@apache.org", "creation_time": "2007-12-21T20:20:44Z", "attachment_id": null}]