[{"attachment_id": null, "tags": [], "bug_id": 41130, "text": "Consider a type-map containing this entry:\n\nURI: hello.ext\nContent-Type: application/foo\n\nSuppose some config file or .htaccess file says:\n\nAddType application/bar ext\n\nmod_negotation and mod_mime will fight each other and neither will have a clear\nvictory.  A request with Accept: application/bar will not get hello.ext, and a\nrequest with Accept: application/foo will get hello.ext in a response that says\nContent-Type: application/bar!\n\nI think apache should be self-consistent.  It shouldn't choose a file because\nit's one type and then return it as another type.  The Content-Type: in the\ntype-map, because it applies specifically to a single file, should override the\nAddType directive that applies generally to files with a certain extension.\n\nI don't know whether the hook order should be rearranged, or find_ct() should be\naltered to avoid clobbering data that mod_negotiation has already filled in.\n\nI don't know what priority/severity this is, so I left the defaults.  Someone\nmore experienced may want to adjust them.\n\nThis probably affects many or all operating systems, but I observed it only on\nLinux.", "count": 0, "id": 96642, "time": "2006-12-07T22:34:36Z", "creator": "bug.apache.amc+0+@nicemice.net", "creation_time": "2006-12-07T22:34:36Z", "is_private": false}, {"count": 1, "tags": [], "creator": "calestyo@scientia.net", "is_private": false, "text": "I'm stumbling accross the same... it should be clearly documented which setting wins (and the whole isn't just a problem for the type, but also for encoding, language, etc.).\n\n\nBehaviour seems to be even more weird, AFAICS,...\nNamely Apache uses the values from the type-map, to match the Accept* headers.... but it serves the file based on what mod_mime says.\n\n\nI think it should only fall back to mod_mime, when there is no Content-Type given for a variance in the type-map... which makes sense IMHO, if one just wants to override e.g. the language.", "id": 169548, "time": "2013-08-18T03:55:03Z", "bug_id": 41130, "creation_time": "2013-08-18T03:55:03Z", "attachment_id": null}]