[{"count": 0, "tags": [], "bug_id": 41161, "attachment_id": null, "is_private": false, "id": 96817, "time": "2006-12-12T09:09:48Z", "creator": "adam.buchbinder@gmail.com", "creation_time": "2006-12-12T09:09:48Z", "text": "It's possible to use formulas to deal with dates; for instance, the first cell\nin a column of dates will be set, and the rest of them will be set by reference,\nso that only one cell needs to be modified.\n\nHowever, getDateCellValue() doesn't test for formula cells, so that when one\ntries to pull a date from a cell set in this manner, it will default to an\nattempt to get the cell's numeric value and use that, which will not give the\ncorrect results.\n\nThe relevant class is org.apache.poi.hssf.usermodel.HSSFCell, and this issue is\npresent in SVN revision 486227."}, {"count": 1, "tags": [], "creator": "amolweb@yahoo.com", "text": "If you have last saved the file using an external application the following\nshould give you the expected date value:\n\nHSSFDateUtil.getJavaDate(value);\n\nHowever, if the cell value was last edited using POI, you will not get the\ncorrect \"date\" value. This is because until the file is opened by an external\napplication the formula will not be evaluated and hence the \"stored\" value will\nnot reflect the expected value. You could try to use the HSSFFormulaEvaluator to\nevaluate the formula cell and then use HSSFDateUtil.getJavaDate to convert the\nvalue to a Java Date.\n\nIf this does not resolve your problem,  please post some code that illustrates\nthe problem.", "id": 96835, "time": "2006-12-12T12:40:54Z", "bug_id": 41161, "creation_time": "2006-12-12T12:40:54Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 41161, "is_private": false, "id": 144568, "creation_time": "2011-02-25T17:16:04Z", "time": "2011-02-25T17:16:04Z", "creator": "apache@gagravarr.org", "text": "This has been fixed at some point in the last 4 years, and HSSFCell can get formula date values just fine now.", "attachment_id": null}]