[{"count": 0, "attachment_id": null, "bug_id": 41259, "text": "The addition of a \"comments\" field for the test plan was a step in the right \ndirection. However, it would be great if we could get the same thing for all \ntest elements.", "id": 97439, "time": "2006-12-29T05:55:06Z", "creator": "jens@voss-ahrensburg.de", "creation_time": "2006-12-29T05:55:06Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 41259, "text": "Created attachment 19323\nAddition of \"comments\" field for all test elements\n\nThe attached zip file contains a number of patches for existing source files as\nwell as two new files. I did a bit of refactoring to the NamePanel and\nextracted as much code into an abstract superclass as could possibly be reused\nby the new CommentPanel class. Moreover, I enhanced the JTree in the MainFrame\nclass a bit to display the test elements' comments as tool tips.\n\nI think that the number of rows (3) I picked for the comment field is a good\ncompromise, however, other people might have other views on this.\n\nFinally, the real pita is going to be the update to the documentation (dozens\nof new screen shots in section 18 of the user's manual...)", "id": 97440, "time": "2006-12-29T06:03:43Z", "creator": "jens@voss-ahrensburg.de", "creation_time": "2006-12-29T06:03:43Z", "is_private": false, "attachment_id": 19323}, {"count": 2, "attachment_id": 19339, "bug_id": 41259, "text": "Created attachment 19339\nUpdate all GUI elements to correctly show the new comments field\n\nSome existing GUI elements do not show the new comments field introduced in the\nfirst patch fo this enhancement request. The attached ZIP file contains 22\npatches to the GUI element classes that failed to do so; with these, all JMeter\nelements should now correctly display the comments field.", "id": 97525, "time": "2007-01-02T03:44:07Z", "creator": "jens@voss-ahrensburg.de", "creation_time": "2007-01-02T03:44:07Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 41259, "is_private": false, "count": 3, "id": 100438, "time": "2007-03-15T10:09:03Z", "creator": "sebb@apache.org", "creation_time": "2007-03-15T10:09:03Z", "text": "Thanks.\n\nThe feature has been added to SVN and will appear in the next release of JMeter"}]