[{"count": 0, "tags": [], "creator": "quartz12h@yahoo.com", "attachment_id": null, "id": 97546, "time": "2007-01-02T16:04:40Z", "bug_id": 41281, "creation_time": "2007-01-02T16:04:40Z", "is_private": false, "text": "In development mode of complex project with many output folders in order to\nenable the hot code replacement in an IDE, it would be very helpful to \nprovide a property for the wepapp loader classloader to pick classes from more\nthan the web-inf/classes location.\n\nFor example: a super project has 3 projects: mainapp, commoncode1, commoncode2.\n\nAll 3 projects cannot safely point to the web-inf-classes because they will\nscrub each other out upon rebuild. Having the capacity to add folders, zips and\njars outside the servlet spec normal folders would be a very simple workaround.\nWe would target these 3 projects output folders.\n\nTo keep it simple, the server.xml could receive a coma-separated list of\nfile/folder urls (or paths) in a single property for the standard \"loader\" tag."}, {"count": 1, "tags": [], "bug_id": 41281, "is_private": false, "id": 97568, "creation_time": "2007-01-03T10:42:04Z", "time": "2007-01-03T10:42:04Z", "creator": "funkman@joedog.org", "text": "This feature will be available in tomcat 6:\nhttp://issues.apache.org/bugzilla/show_bug.cgi?id=41260\n\nIf that is ok - feel free to close.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 41281, "attachment_id": null, "is_private": false, "id": 100890, "time": "2007-03-25T09:24:12Z", "creator": "yoavs@computer.org", "creation_time": "2007-03-25T09:24:12Z", "text": "I've tested it in Tomcat 6, and it works nicely.  For Tomcat 5.x, I think this\nis too big a scope, so if you want it, either write a custom Loader or take the\nTomcat 6 Virtual loader Tim mentioned and back-port it."}, {"count": 3, "tags": [], "creator": "quartz12h@yahoo.com", "attachment_id": null, "id": 123478, "time": "2008-12-22T07:26:15Z", "bug_id": 41281, "creation_time": "2008-12-22T07:26:15Z", "is_private": false, "text": "This is quite incomplete:\n\na) can one can set a jars folder? This is unclear. One would have to set ALL jars 1 by 1 manually, instead of pointing to a dir other than web-inf/lib where the jars are discovered. Maybe it is supported but not indicated.\n\nb) are the path elements are absolute or relative to the docbase?\n\nc) the paths given ARE NOT overriding the content of web-inf/lib jars. This makes the added feature useless in the context of debugging/patching a .war or a .jar in the regular classpath. We need a kind of \"prepend\" to override the .war, (or any of web-inf/classes and web-inf/lib/*.jar).\n\n"}]