[{"count": 0, "tags": [], "creator": "bjoern@syltonline.de", "is_private": false, "text": "First, thank you for implementing security in JK. I know it was possible to \nsecure it before in Apache, but in IIS, JK is run before the NTFS-Rights \napply. So this is a long awaited feature.\n\nBut seeing that this mainly applies to non-apache environments, it is bad that \nthe user check done case sensitive.In IIS, especially when working with domain \nUsers, User may com in UCase/LCase Domain\\User in any combination. Even Cast \ndifferences in the Username (i.e. First letter capital or not) occour. Windows \ndoes not care, but JK does. So one can auth against IIS, but still be blocked \nfrom JK, even with the right user.\n\nIn the moment we workaround this with trying to put any combination in the \nproperties-file. But this is a hopeless fight.\n\nI understand that you might not be able to simply LCase the username because \nthat would lose some compatibility to the unix side. But maybe you can \nintroduce a parameter like \"worker.jk-manage.casesensitive=True|False\" ?", "id": 97780, "time": "2007-01-08T09:40:04Z", "bug_id": 41318, "creation_time": "2007-01-08T09:40:04Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "rainer.jung@kippdata.de", "text": "Hi,\n\ngood to hear, that the feature basically works :)\n\nI'm sure you noticed, that this only secures the status worker? So we could only\ndiscuss securing access to the status worker in an appropriate way.\n\nI would like to consider, if we could make the string comparison case\ninsensitive dependent on the platform. So we could use case-insensitivity on the\nWindows platform, and sesitivity on the other ones. I'm not sure about Netware,\nbut we could ask Günter Knauf about the habits there.\n\nWe usually use\n\n#ifdef WIN32\n\nto destinguish the Windows platform. Actually I don't know, if this is still\ncorrect in times of 64 Bit Windows, but since Mladen actually does Windows 64\nBit builds since quote some time, I assume, that this is still correct.\n\nSo I would propose a patch as follows:\n\nIndex: jk_status.c\n===================================================================\n--- jk_status.c (revision 494133)\n+++ jk_status.c (working copy)\n@@ -2846,7 +2846,11 @@\n             unsigned int i;\n             denied = 1;\n             for (i = 0; i < w->num_of_users; i++) {\n+#if defined(WIN32)\n+                if (!strcasecmp(s->remote_user, w->user_names[i])) {\n+#else\n                 if (!strcmp(s->remote_user, w->user_names[i])) {\n+#endif\n                     denied = 0;\n                     break;\n                 }\n\nMaybe you could try this to find out, if this really handdles all the cases needed?\n\nThanks for the suggestion.", "id": 97781, "time": "2007-01-08T10:03:54Z", "bug_id": 41318, "creation_time": "2007-01-08T10:03:54Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 41318, "text": "Hi,\nthis seems like a good solution. Although there might be case-insensitive auth-\nsubsystems unter unix and sensitive ones in a windows environment (some LDAP-\nSystems), this is not the common way.\n\nWe'd be happy to test the enhancement, but we have no build environment here. \nSo if anyone could supply a win32 and/or win64 build, we'd test it and report \nback.", "id": 97782, "time": "2007-01-08T10:28:15Z", "creator": "bjoern@syltonline.de", "creation_time": "2007-01-08T10:28:15Z", "tags": [], "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 41318, "is_private": false, "id": 98647, "time": "2007-01-28T05:16:53Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2007-01-28T05:16:53Z", "tags": [], "text": "I added a new attribute user_case_insensitive to the status worker,\nwhich can be set to True in workers.properties to make the user\nname comparison case insensitive. Default is False=case sensitive.\nThis will be part of version 1.2.21."}, {"count": 4, "tags": [], "text": "Move a couple of fixed JK issues from resolved to closed.", "is_private": false, "id": 112409, "creator": "rainer.jung@kippdata.de", "time": "2008-01-01T16:51:30Z", "bug_id": 41318, "creation_time": "2008-01-01T16:51:30Z", "attachment_id": null}]