[{"count": 0, "tags": [], "bug_id": 41493, "attachment_id": null, "id": 98730, "time": "2007-01-29T19:48:14Z", "creator": "gergoe@belnet.hu", "creation_time": "2007-01-29T19:48:14Z", "is_private": false, "text": "Just installed the (stable?) 5.5.20 binary distribution (apache-tomcat-\n5.5.20.exe) using the included installer (custom install, took out the \nexamples, docs, etc.), worked fine (with JRE 5.0.11 and later 5.0.10). Deployed \nthe admin webapp (apache-tomcat-5.5.20-admin.zip) nicelly, which was working as \nexpected, except two odd things:\n\n1.) All connectors were appearing as HTTPS connectors regardless of their real \ntype; when adding a new one, the selection of the type was properly reflected \non the available fields, but upon saving the connector, they were again \ndisplayed as HTTPS connectors. When Commiting Changes, all values were properly \ncommited to the server.xml (an AJP connector was really saved as an AJP \nconnector, regardless that the admin webapp displayed HTTPS)\n\n2.) In all the context configurations the Session ID Initializer value was full \nwith garbage characters (quite random, although looks to be fixed length), kind \nof binary dump.\nROOT:     ®Ÿéð&Ìoc\u0016\bèæ™9ëBåè\u001cÍŠt&#65533;OXîºíŠb5 \n/admin:   Þ¾¥óet×\u008d`™ÔN$²•Á\u008f©ÉÜ…ïÄ­P6âÛ^¡ùM\n/manager: \u000bY\u0010Ešæ*\"ø\\L\u0015â e;PhÀu²”µv\u0001&ª\u008f£¥„\n\n\nTried to install a little older different java runtime, took over a prooven \nworking server.xml from an another server, deployed a different admin webapp \n(from 5.5.17), changed numerous things in the server.xml, but nothing helped.\n\nOnly workaround I could find was to downgrade to 5.5.17, where none of these \ncan be observed."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I have tested this with the latest version from svn and I can't reproduce this.\nNeither can I see anything in the change log that relates to fixes in any of\nthese areas since the 5.5.20 release.\n\nI also downloaded 5.5.20 and the admin webapp and did a clean install. The only\nconfiguration change I made was to add the admin user to the both user. The\nadmin app worked as expected and I saw neither of the errors you describe.\n\nThis looks like a configuration issue but no obvious explanation comes to mind.\nI suggest you use the tomcat users list for help in resolving this.", "id": 98732, "time": "2007-01-29T20:44:09Z", "bug_id": 41493, "creation_time": "2007-01-29T20:44:09Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 41493, "text": "My appologies for being short in writing down the circumstances, but in the \nmeantime it turned out that the tcnative-1.dll (v1.1.4.0), which was enabled \nduring the installation of the 5.5.20 (and was not used anymore when downgraded \nto 5.5.17) is causing this behavior, so I reopened this report.\n\nTo reproduce:\nInstall 5.5.20 using the installer, choose Custom install, and select the \nnative.dll for installation. Deploy the admin webapp as usual.\n", "id": 98748, "time": "2007-01-30T03:43:12Z", "creator": "gergoe@belnet.hu", "creation_time": "2007-01-30T03:43:12Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 41493, "attachment_id": null, "id": 98922, "time": "2007-02-02T17:19:33Z", "creator": "markt@apache.org", "creation_time": "2007-02-02T17:19:33Z", "is_private": false, "text": "Confirmed with the latest native dll as well. The all https makes sense but the\nsession ID initializer is very strange. I'll take a closer look."}, {"count": 4, "tags": [], "bug_id": 41493, "text": "1. Reporting all connectors as https is a bug that is now fixed in svn.\n\n2. The odd characters for are the Session ID Initializer a result of using APR\nto initialise the session Id generator. They are, as you observe, random and of\nfixed length. This is intentional. See\nhttp://svn.apache.org/repos/asf/tomcat/container/tc5.5.x/catalina/src/share/org/apache/catalina/session/ManagerBase.java\nfor the code that creates this.", "id": 99226, "time": "2007-02-10T12:21:13Z", "creator": "markt@apache.org", "creation_time": "2007-02-10T12:21:13Z", "is_private": false, "attachment_id": null}]