[{"count": 0, "tags": [], "bug_id": 41561, "attachment_id": null, "id": 99074, "time": "2007-02-07T15:38:55Z", "creator": "ariel18@safe-mail.net", "creation_time": "2007-02-07T15:38:55Z", "is_private": false, "text": "Please see\nhttps://sourceforge.net/tracker/?func=detail&atid=604306&aid=1652188&group_id=93438\nfor a discussion on this bug, relating to Inkscape. Basically, text which is\nmade in the right-to-left format (like Hebrew or Arabic) in Inkscape appears\nmisaligned in Batik."}, {"count": 1, "tags": [], "creator": "cam@apache.org", "is_private": false, "text": "[CCing the Inkscape bug]\n\nAs far as I know, the text layout is correct.  Where the text is anchored and\nwhich direction the text is rendered in are two different things.  Section 10.9\nof SVG 1.1 says:\n\n  The 'text-anchor' property is used to align (start-, middle- or end-alignment)\n  a string of text relative to a given point.\n\n  The 'text-anchor' property is applied to each individual text chunk within a\n  given 'text' element. Each text chunk has an initial current text position,\n  which represents the point in the user coordinate system resulting from\n  (depending on context) application of the x and y attributes on the 'text'\n  element, any x or y attribute values on a 'tspan', 'tref' or 'altGlyph'\n  element assigned explicitly to the first rendered character in a text chunk,\n  or determination of the initial current text position for a 'textPath'\n  element.\n\nand for the \"start\" value (which is the initial value):\n\n  The rendered characters are aligned such that the start of the text string is\n  at the initial current text position. For Latin or Arabic, which is usually\n  rendered horizontally, this is comparable to left alignment. For Asian text\n  with a vertical primary text direction, this is comparable to top alignment.\n\nSo the anchoring of the text is independent of directionality.  Test\ntext-intro-05 in the recently released SVG 1.1 test suite uses text-anchor=\"end\"\non the text elements to right align the Arabic text.\n\nDo you agree with this assessment?", "id": 99075, "time": "2007-02-07T16:04:32Z", "bug_id": 41561, "creation_time": "2007-02-07T16:04:32Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 41561, "is_private": false, "count": 2, "id": 99078, "time": "2007-02-07T16:12:04Z", "creator": "ariel18@safe-mail.net", "creation_time": "2007-02-07T16:12:04Z", "text": "I don't know. I'm not the expert, I just know that there is a problem somewhere.\nI also know that Arabic and Hebrew should be right aligned (as is done , as the\ntext is written right-to-left. As you can see in the thread from sourceforge,\nlots of programs have this same \"problem\". What you need to do is contact\nInkscape's designers and figure out where the problem really is."}, {"count": 3, "tags": [], "creator": "cam@apache.org", "is_private": false, "text": "Behaviour is conformant.", "id": 99264, "time": "2007-02-11T23:24:55Z", "bug_id": 41561, "creation_time": "2007-02-11T23:24:55Z", "attachment_id": null}]