[{"count": 0, "tags": [], "bug_id": 41578, "attachment_id": null, "id": 99156, "time": "2007-02-09T00:00:43Z", "creator": "arvind.srinivasan@sun.com", "creation_time": "2007-02-09T00:00:43Z", "is_private": false, "text": "Only 1 instance of the JspFactory object (JspFactoryImpl) is created.\nConsequently there is a single SimplePool of PageContext objects for all JSP\nrequests and so every JSP request must synchronize on the lock inside SimplePool\nwhen getting and releasing a PageContext instance. Moreover, the pool has a\nfixed capacity and after that, the code in JspFactoryImpl will first acquire the\nlock to see if there are any free objects in the pool, failing which a new\nPageContext object is created.\n\nInstead of a single process-wide pool, a per thread pool of PageContext objects\ncan be used by JspFactoryImpl."}, {"count": 1, "tags": [], "text": "Created attachment 19556\nUse a per-thread pool of PageContext objects instead of a process-wide pool.\n\nA version of SimplePool that didn't use locks would probably be more memory\nefficient than using an ArrayList (for the thread-local pool).", "is_private": false, "id": 99157, "creator": "arvind.srinivasan@sun.com", "time": "2007-02-09T00:03:59Z", "bug_id": 41578, "creation_time": "2007-02-09T00:03:59Z", "attachment_id": 19556}, {"count": 2, "tags": [], "creator": "remm@apache.org", "is_private": false, "id": 99179, "attachment_id": null, "bug_id": 41578, "creation_time": "2007-02-09T07:23:43Z", "time": "2007-02-09T07:23:43Z", "text": "This does change the memory usage, so this needs more work and/or options (this\nchange would use far more memory, since it's per thread and not bounded, while\nthe current one uses a global limit of 100 page contexts).\n\nAbout the other optimizations, they should be done by the JIT although it\ndoesn't hurt to help it a bit. I could maybe estimate the time I would spend\ncommitting them would be equivalent to the total CPU time saved across all\nTomcat users over a year."}, {"count": 3, "tags": [], "text": "I did not use the submitted patch, but tried switching to a thread local\nimplementation.", "attachment_id": null, "bug_id": 41578, "id": 99238, "time": "2007-02-11T06:20:19Z", "creator": "remm@apache.org", "creation_time": "2007-02-11T06:20:19Z", "is_private": false}]