[{"count": 0, "text": "MS Word 2003 XP2 (the only version I've tested so far) stores the CodePage value in the custom \nproperties section as an untitled property.\n\nWhen the custom properties are read in by DocumentSummaryInformation.getCustomProperties it \nignores untitled properties.  Therefore the CodePage value isn't read in and getCodePage() returns -1.\n\nThis has the side effect of changing the CodePage when the data is written out to a file because it is set \nto the default value of CP_UNICODE.\n\nTo repeat the problem:\n1.  Create a new document in Word with at least one custom property\n2.  Check the CodePage value for the custom properties section (e.g. using the sample reader code).  In \nmy case it was 65001.  As long as the value isn't 1200 the problem will occur.\n3.  Using the sample code that updates a custom property, update a value and write out the data to a \nfile\n4.  Check the CodePage value for the newly written doc.  It will have changed to 1200 (CP_UNICODE).\n\nThe workaround is as follows:\n* Firstly read in the document using the POIFSReaderListener interface (as per the sample code) and \ncache the codePage value.\n* After re-reading the document for update purposes set the custom properties codePage value to the \ncached value by building a CustomProperty and using CustomProperties.set(\"PID_CODEPAGE\", \nCustomProperty cp).", "bug_id": 41688, "attachment_id": null, "id": 99725, "time": "2007-02-23T04:14:06Z", "creator": "thingeley@netspeed.com.au", "creation_time": "2007-02-23T04:14:06Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "text": "No update for a long time => closing this for now. If this is still a problem for you please verify with a recent version of POI and reopen this bug with more information, ideally a unit-test that can be used to reproduce the problem.", "id": 181427, "time": "2015-03-01T21:47:53Z", "bug_id": 41688, "creation_time": "2015-03-01T21:47:53Z", "is_private": false}]