[{"count": 0, "tags": [], "creator": "schroeder.wolfgang@gmx.net", "attachment_id": null, "id": 99746, "time": "2007-02-25T02:08:53Z", "bug_id": 41696, "creation_time": "2007-02-25T02:08:53Z", "is_private": false, "text": "Bug or feature?\nI was trying to write a servlet-filter which should check on all posted\nrequest-parameters and replace potential cross-site-scripting attacks from the\nsent content by harmless equivalents.\n\nFirst I subclassed HttpServletRequestWrapper and overrode getParameter,\ngetParameterMap, getParameterValues and getParameterValues but the\napplicationdispatcher still used the parametermap from the wrapped request when\nforwarding the request. This is not nice since the parameters of the forwarded\nurl are not added to the filters parametermap. It happens because\nappclicationdispatcher internally unwraps all nested requests until an internal\ntype is reached. Everything works as expected as long as I dont forward the\nrequest! \n\nNext I tried to implement interface HttpServletRequest on my own (simple\ndelegatepattern) because ApplicationDispatcher explicitly does NOT unwrap\nNON-HttpServletRequestWrapper (ApplicationDispatcher.java line 871). But in this\ncase a ClassCastException is thrown at line 814 when unwrapping the request. At\nthis point Non-HttpServletRequestWrapper are not(!) ignored.\n\nSo in the end imho it comes down to these questions:\n1. HttpServletRequestWrapper delegates calls on every method to it's wrapped\nrequest. So in effect when merging requestparameters of the request with the\nparameters of a forward-url, calls on getParameterMap etc are delegated to the\noriginal request anyway as long as these methods are not overridden. I haven't\nfound a part in the spec where it is explicitly forbidden to alter\nrequest-parameters when using a wrapper.\n\n2. Should ApplicationDispatcher be able to handle any implementation of\nHttpServletRequest or does J2EE-Specs allow to rely solely on own implementation\ntypes? I ApplicationDispatcher should handle any implementation this should be\nconsidered as a bug and the unwrap-method should be fixed!\n\nWolfgang"}, {"attachment_id": null, "tags": [], "bug_id": 41696, "text": "This is a feature, done this way exactly to support your use case.  The \nservlet spec explicitly forbids using a custom ServletRequest that is not \nderived from ServletRequestWrapper.  For the case with a Wrapper, you simply \nneed to delay setting up your map:\n\n  public String getParameter(String name) {\n    if(myMap == null) {\n       loadMap();\n    }\n    return (String)myMap.get(name);\n  }", "count": 1, "id": 103391, "time": "2007-05-20T13:59:11Z", "creator": "william.barker@wilshire.com", "creation_time": "2007-05-20T13:59:11Z", "is_private": false}]