[{"count": 0, "tags": [], "creator": "phyre@rogers.com", "attachment_id": null, "is_private": false, "id": 100200, "time": "2007-03-08T17:49:05Z", "bug_id": 41796, "creation_time": "2007-03-08T17:49:05Z", "text": "It's clear that the Internal Dummy Connection requests are needed and it is my\nunderstanding that these exist in 2.0 but however are not logged.\n\nMy concern is not with them existing or logging, but with the request that is\nbeing made.\nThe \"GET /\" request used causes dynamic pages to generate- in some cases with\ntens or hundreds of requests in a matter of a few seconds.  A dynamic page I\nhave shows these Internal dummy connections making tens of database queries to\ngenerate and returning 100-200KB of data to the dummy connection.\n\nThis should be changed to either:\n a) request something else other than \"GET /\", such as using \"OPTIONS *\", or\n\"GET /robots.txt\" or \"GET /apache_internal_dummy_file.txt\" that would not be\nused or would not incur the massive processing of many of today's Web sites.\n -OR- (better yet)\n b) be handled specially by the request handler that in the case of a connection\nfrom the local IP with that user agent, it should avoid as much advanced\nprocessing as possible(rewrite rules, PHP scripts, Perl scripts, SSI, Directory\nrestrictions, htaccess processing, etc), and simply return a very short \"ACK\"\nstyle request with only the necessary headers to be deemed valid.\n\nWhen the whole server approaches the request limit near the same time or\nreceives certain commands that dispatch these, it is important that it is not\nmaking requests it shouldn't.\n\nAdvertisers and users depend on these database requests to count pageviews and\nother measures that Apache suddenly adds hundreds of throughout a day... which\ncan add up and show a difference in pageviews from what actually is occuring."}, {"count": 1, "tags": [], "bug_id": 41796, "text": "My TEMPORARY solution was to create these virtualhosts (apparently it's an IP6\nrequest in my configuration, so I needed the second).\n\n<Virtualhost 127.0.0.1>\n        ServerName      localhost\n        DocumentRoot    /var/www\n</VirtualHost>\n<Virtualhost [::1]>\n        ServerName      localhost\n        DocumentRoot    /var/www\n</VirtualHost>\n\nAt least these I know will return MY dummy file instead of a huge PHP script\nwhere the database queries and numbers do matter.\n\nHowever, this issue needs to be addressed if this method is used to wake up the\nchildren.  Making requests blindly and without care to a Web server can throw\noff numbers in more than the logs in an era where everything is dynamic.  The\nREQUEST FILE either NEEDS to be configurable, or the HOST NEEDS to be\nconfigurable, or the request TYPE needs to be harmless and dealt with\ninternally, or the request needs to be silently handled internally without doing\nany processing.  Either way really, with the preference being internally\nhandling it, then changing the type.\n", "id": 100201, "time": "2007-03-08T18:28:55Z", "creator": "phyre@rogers.com", "creation_time": "2007-03-08T18:28:55Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 41796, "attachment_id": null, "id": 100307, "time": "2007-03-12T07:50:07Z", "creator": "jorton@redhat.com", "creation_time": "2007-03-12T07:50:07Z", "is_private": false, "text": "Agreed, as discussed recently on dev@ - committed in: \n\nhttp://svn.apache.org/viewvc?view=rev&revision=517233"}]