[{"count": 0, "tags": [], "bug_id": 41803, "text": "When I open Apache service monitor and click start to start apache, I get this \nmessage: \"The requested operation has failed!\" And when I check my error log:\n\n[Thu Mar 08 13:28:02 2007] [notice] Child 520: Child process is running\n[Thu Mar 08 13:28:02 2007] [notice] Child 520: Acquired the start mutex.\n[Thu Mar 08 13:28:02 2007] [notice] Child 520: Starting 250 worker threads.\n[Thu Mar 08 13:28:02 2007] [notice] Child 520: Starting thread to listen on \nport 80.\n\nBut I tried it at 17:23 too, and lot's of times before that time(restarted my \ncomputer about 10 times) So it doesn't record it in the error log, please help \nme fix it because I have a major project to work on.", "id": 100221, "time": "2007-03-09T08:27:46Z", "creator": "teuneboon@gmail.com", "creation_time": "2007-03-09T08:27:46Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Teun, this is likely not a bug in Apache. Please subscribe to users@httpd.apache.org (send empty e-mail \nto users-subscribe@httpd.apache.org, and you get to respond to a confirmation e-mail), and ask your \nquestion there. I'll be on the lookout for it. \n\nMeanwhile, look in your Windows Event Viewer and see if there are any Apache entries in the Applications \ncategory. If Apache runs into an error before it can open the log file, it'll post there. The snippet that you \npost here suggests that your server has started correctly. Perhaps you're looking in the wrong place? Are \nyou using the same IP address and port for access that you configure in your httpd.conf? \n\nIn any case, this is not the right medium for your question. Bugzilla is for bugs in the Apache code. I'm \nclosing this report, and if we find out that there is indeed a code level issue we'll open a new one. ", "attachment_id": null, "id": 100222, "creator": "sander@temme.net", "time": "2007-03-09T08:35:50Z", "bug_id": 41803, "creation_time": "2007-03-09T08:35:50Z", "is_private": false}]