[{"count": 0, "tags": [], "creator": "russ.taylor@nifty.com", "text": "I have been trying to get Japanese fonts to display in a PDF generated with FOP\n0.93 for almost 24 hours straight.  I have followed the instructions to the\nletter, and I had a working version previously in FOP 0.20.5 a couple years ago,\nI can't find my old code now.\n\nAfter trying every possible iteration I could possibly come up with, I have\ndetermined it must be a problem in FOP 0.93.\n\nI built the metrics file with the included TTFReader using the exact command on\nthe FOP Fonts website, for TTFReader -ttcname \"MS Mincho\" msmincho.ttc\nmsmincho.xml  The file is created fine.\n\nI tried to add the <font> tags in the fop.xconf file, and I tried to add it\n,separately to a userconfig.xml file.  Neither way worked.\n\nI ran FOP from the command line using...  java org.apache.fop.cli.Main -d -c\nuserconfig.xml temp.xml out.pdf  the PDF is created, the English text is fine,\nbut the Japanese text, which is in <block> elements with font-family=\"MSMincho\"\nset...  only show as pound signs, #.\n\nI have tried, as I said, every iteration I could think of to tweak the situation\nbut FOP just complains, it can't find the font \"MSMincho, normal, 400\" and\nreplaces it with \"any, normal, 400\"\n\nIf this is user error, I apologize.", "id": 100271, "attachment_id": null, "bug_id": 41810, "creation_time": "2007-03-11T01:30:44Z", "time": "2007-03-11T01:30:44Z", "is_private": false}, {"count": 1, "tags": [], "creator": "russ.taylor@nifty.com", "text": "Forget it, I seem to have come across the solution just moments after I logged\nthe bug.\n\nThough I am not sure what I did differently yet.", "id": 100272, "attachment_id": null, "bug_id": 41810, "creation_time": "2007-03-11T01:50:03Z", "time": "2007-03-11T01:50:03Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 41810, "attachment_id": null, "is_private": false, "id": 100273, "time": "2007-03-11T01:51:21Z", "creator": "adelmelle@apache.org", "creation_time": "2007-03-11T01:51:21Z", "text": "Hi,\n\nThis is indeed more a question that belongs on fop-users@... but no bad this once, just try to keep it in \nmind for the future. Thanks!\n\nOK, as to your particular problem:\nHave you taken into account that the <fonts> elements in the userconfig in 0.93 must be specified as \nchild of the <renderer>? (should be visible in the example fop.xconf)\nAre you using absolute or relative URIs for the metrics-url/embed-url? If they're relative, you can add a \n<font-base> element to the configuration file to specify the base-url to which relative urls should be \nappended before resolving.\n\nI'm closing this bug, and marking it as invalid. Please post any follow-up to fop-users@. Thanks!"}, {"count": 3, "tags": [], "bug_id": 41810, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156881, "time": "2012-04-01T13:54:20Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:54:20Z", "is_private": false, "attachment_id": null}]