[{"count": 0, "attachment_id": null, "bug_id": 41848, "text": "Here's the patch to make user names case insensitive. There was someone on the\nuser list who likes having the names being case sensitive. Case sensitive user\nnames can be frustrating and don't make sense in my deployment. Case insensitive\npasswords are even worse, but Lenya does follow that (Oracle doesn't). The patch\nis here for anyone who wants to use it.", "id": 100431, "time": "2007-03-15T07:14:12Z", "creator": "rfrovarp@apache.org", "creation_time": "2007-03-15T07:14:12Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 19711\nmakes user name case insensitive", "is_private": false, "id": 100432, "creator": "rfrovarp@apache.org", "time": "2007-03-15T07:14:46Z", "bug_id": 41848, "creation_time": "2007-03-15T07:14:46Z", "attachment_id": 19711}, {"count": 2, "tags": [], "bug_id": 41848, "attachment_id": null, "text": "IMO that's not mission-critical for 1.4.", "id": 102426, "time": "2007-04-26T02:02:36Z", "creator": "andreas@apache.org", "creation_time": "2007-04-26T02:02:36Z", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 41848, "text": "I've closed the bug for the following reasons:\n\n1) Under Windows the login is case sensitive. However, only one case insensitive\nversion of the account can exist with the last one winning. If account test\nexists and the admin creates TEST, test will be wiped out and TEST will become\nthe correct casing with its password.\n\n2) Users don't expect case sensitivity, or if they do admins don't.\n\n3) Auto form completion in browsers can make it a war to enter the correct user\nname since most systems are not case sensitive and browsers don't recognize a\ndifference. \n\n4) If LDAP user name and ids match up, admin and user expectations of case\nsensitivity probably won't match reality and being case insensitive won't hurt\nanything.\n\n5) There is no way to know if a failed login is due to case sensitivity issues,\nbad user name, or a bad password. This can make providing support an issue,\ntrust me I know. ", "id": 107035, "time": "2007-08-22T08:54:36Z", "creator": "rfrovarp@apache.org", "creation_time": "2007-08-22T08:54:36Z", "tags": [], "is_private": false}]