[{"count": 0, "tags": [], "creator": "gopal.rkn@wipro.com", "is_private": false, "text": "I am working on Tomcat 5.0.30  and working an application based on Spring \nframework. Os for development is Windows xp.\n\nSome of the pages which uses JSTL References like the below does not work\n\nHere you could understand the TradeMap is the model name set in the controller\n\nand its value is a Map and one of the key inside the map is TradeList.\n\nFor your info the same application works in Websphere 5.x without any problems.\n\nI have searched the newsgroups and forums thoroughly and they say to update \nthe web.xml to give the namespace to web-app ,but nothing worked out.\n\nNewsgroup also suggested that it could be that Jsp1.2 doesnt evaluate the \nexpression language. Hoewever the coding is based on jsp1.2 and jstl1.0 and it \nworks on websphere 5.x which supports servlet 2.3 and jsp1.2.\n\nI tried in Tomcat 4.x and the result is the same error. I am running this from \neclipse using eclipse sysdeo plugin for tomcat.\n\n\norg.apache.jasper.JasperException: <h3>Validation error messages from \nTagLibraryValidator for c</h3><p>134: tag = 'forEach' / attribute = 'items': \nAn error occurred while parsing custom action attribute \"items\" with \nvalue \"${TradeMap[\"\\TradeList\"]}\": Encountered \"\"\\T\", expected one of \n[<INTEGER_LITERAL>, <FLOATING_POINT_LITERAL>, \n<STRING_LITERAL>, \"true\", \"false\", \"null\", \"(\", \"-\", \"not\", \"!\", \"empty\", \n<IDENTIFIER>]</p>", "id": 100455, "time": "2007-03-16T00:02:25Z", "bug_id": 41856, "creation_time": "2007-03-16T00:02:25Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "yoavs@computer.org", "text": "\"It works in WebSphere\" is not a good argument, as WebSphere is far more lax\nthan Tomcat in many areas of Specification implementation.  Tomcat's stricter,\nfor better or worse.  I would suggest four things:\n\n- Confirm this is a bug by asking on the Tomcat users mailing list,\n- Try to listen to the error message you quote and don't escape strings within\nthe parameter name map, i.e, in this case remove the leader backslash from \\T\n- Do your testing on the latest stable Tomcat 6.0.10, or at least 5.5.20, as 5.0\nis ancient and unlikely to get bugs fixed in a timely manner,\n- If you confirm that this a bug against the latest stable Tomcat release,\nplease reopen this issue and attach a test WAR file we can use to reproduce your\nissue.\n\nFWIW, I ran through the TagUnit\n(http://today.java.net/pub/a/today/2004/08/30/TagUnitIntro.html) tests on 5.5.20\nrecently and they worked just fine for me, including map accessors.", "id": 100869, "time": "2007-03-25T08:01:48Z", "bug_id": 41856, "creation_time": "2007-03-25T08:01:48Z", "is_private": false, "attachment_id": null}]