[{"count": 0, "tags": [], "bug_id": 41855, "attachment_id": null, "text": "This is what the problem is. I have some servlets that will take more than 10 \nmins to execute for the very first request. (I know this is wrong, but please \ngo ahead).\n\nWhat happens is when a number of users logs in and tries to access this page, \nit will take 10 mins for each such request. The users get frustrated and close \ntheir browser or presses stop button.\n\nBut our tomcat still continues to execute the servlet and finishes executing \nonly after 10 mins. This can be confirmed by looking at the log messages.\n\nThe direct effect is that when lots of such connections gets accumulated, \ntomcat eventually dies with out of memory.\n\nLet me know if this issue could be fixed or is already fixed.", "id": 100453, "time": "2007-03-15T23:28:26Z", "creator": "prabhu@efrontier.com", "creation_time": "2007-03-15T23:28:26Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 41855, "text": "Ideally, tomcat should stop execution when the HTTP connection is not alive.", "id": 100454, "time": "2007-03-15T23:29:36Z", "creator": "prabhu@efrontier.com", "creation_time": "2007-03-15T23:29:36Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 41855, "is_private": false, "text": "This is a problem with your application, if requests take 10 minutes to complete\nredesign your app to dispatch into your own thread pool. There are thousands of\napplications that already have solved this problem. Put your thinking cap on,\nand maybe you will too.", "id": 100478, "time": "2007-03-16T07:28:26Z", "creator": "fhanik@apache.org", "creation_time": "2007-03-16T07:28:26Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 41855, "attachment_id": null, "id": 100489, "time": "2007-03-16T09:11:22Z", "creator": "quartz12h@yahoo.com", "creation_time": "2007-03-16T09:11:22Z", "is_private": false, "text": "(please excuse the previous inappropriate insult; the privileged majesties of\nthe kingdom are, unlike the rest of us, under a lot of stress and pressure, and\nlack time to compose and post better insults).\n\nAll that to say, your servlet must do 2 things: perform the main work and\nmonitor the connection. This is not the responsibility of the container.\nActually the container cannot figure out (not without NIO* at least) that the\nservlet/socket output was abandoned/closed without attempting to write to it,\nwhich would corrupt the response stream content.\n\nIf your response content can support comment-like data, for example for html\ncomment, or some #ping text, or whatever appropriate to the ongoing protocol,\nthan your servlet could write periodically such comment to check the client\nconnection viability. But such background test, while the main task is still\nrunning, requires another thread unless you main task is asynchronous. Depending\nin the security manager in place, you might not have the right to spawn threads\nin the servlet container.\n\n*NIO: the servletoutputstream isn't a selectable channel, tomcat container would\nhave to perform such monitoring and expose the socket output state in the\nservlet api, which isn't about to happen soon...\n"}, {"count": 4, "tags": [], "creator": "fhanik@apache.org", "attachment_id": null, "text": "ok, I ran off to the king and asked him for some time, he devoted two whole\nseconds and said:\n\n\"oh, for heavens sake, just use google.\" \n\nThis has nothing to do with NIO, just spawn of a thread to do the job, then send\na response with a refresh header, the browser will open a new connection/request\nto check if the result is complete, if it isn't send another refresh header, if\nit is, send the results. you don't need to execute the 10min task on the servlet\nworker thread.\n\nlook for long running\nhttp://simple.souther.us/not-so-simple.html\n\nAlso, the another dude on the throne decided to throw in another tip\n\"Turn off keep alives otherwise you are still hogging the worker thread during\nyour refresh period\"\n\nnow for more support, this is not the place, The Tomcat User List is filled with\nbrilliant and nice people willing help.", "id": 100491, "time": "2007-03-16T09:57:07Z", "bug_id": 41855, "creation_time": "2007-03-16T09:57:07Z", "is_private": false}]