[{"count": 0, "tags": [], "bug_id": 41876, "attachment_id": null, "is_private": false, "id": 100516, "time": "2007-03-17T10:28:25Z", "creator": "alf@i100.no", "creation_time": "2007-03-17T10:28:25Z", "text": "I have the following ideas on options to add to the HTTP Proxy server :\n\n- Make it possible to filter requests by specifying \"content type to include\"\nand \"content type to exclude\" regular expressions\n- Allow user to specify if the HTTP Request or HTTP Request HTTP Client requests\nshould be put into test plan\n- Allow user to control more parameters for the HTTP Request, namely Follow\nRedirects, Download all images and applets\n- Restructure GUI of the HTTP Proxy slightly, to make it clearer what the\ndifferent options are controlling by grouping relevant items\n- Have a look if it is possible to figure out the character set encoding used,\nand then set the \"Content encoding\" on the HTTP Request\n- Have a look at how the parameter values are decoded and encoded, possibly\nshowing nice, unencoded values as the parameter values in the HTTP Request.\nI think there are several bugzilla reports around the proxy and handling of\nencoding and decoding\n\nThe filtering on content type and being able to set the \"download all images\",\nshould make it possible to make a more compact test plan,\nby just including text/html requests, and then setting \"download all images\" on\nall the requests that are added to the test plan."}, {"count": 1, "tags": [], "bug_id": 41876, "attachment_id": 19728, "is_private": false, "id": 100518, "time": "2007-03-17T10:39:01Z", "creator": "alf@i100.no", "creation_time": "2007-03-17T10:39:01Z", "text": "Created attachment 19728\nSuggested patch\n\nThis patch adds the following functionality :\nIt is now possible to specify the \"Redirect automatically\", \"Follow Redirects\",\n\"Download images\" for the HTTPSampler.\n\nIt is now possible to choose between the HTTPSampler and HTTPSampler2, i.e.\nHTTPClient.\n\nI have restructured the GUI slightly, by grouping items which I think are\nrelated.\n\nThere are some places where I should have used \"resource strings\", I'll fix\nthat before I submit another patch, which will at least add filtering on\ncontent type.\n\nAny comments appreciated."}, {"count": 2, "tags": [], "text": "Looks fine so I added it to SVN.\n\nHad to make some minor changes as the patch clashed slightly with one I had \njust made.", "is_private": false, "id": 100530, "creator": "sebb@apache.org", "time": "2007-03-17T15:13:58Z", "bug_id": 41876, "creation_time": "2007-03-17T15:13:58Z", "attachment_id": null}]