[{"count": 0, "tags": [], "creator": "alf@i100.no", "is_private": false, "text": "I'm hoping to enhance the HTTP Request sampler, by adding functionality to\nsupport multipart/form-data http post request with only parameters, if the user\nselects to do that. And also add support for uploading several files in one HTTP\nrequest.\n\nI feel that in order to be able to add more options for the user for HTTP\nRequest, the GUI needs to be restructured. I think it should be easy and simple\nfor normal users, who I guess only are doing \"HTTP GET\" requests. But it must\nalso have room for options for more advanced users, i.e. doing HTTP Post with\nmany files.\n\nI suggest to have the upper part of the GUI as it is now, but to change the\nlower part to use a tabbed pane layout. I suggest tabs such as \"options\",\n\"parameters\", \"file upload\".\n\nI have looked at the code, and will attach a suggested patch, just a prototype,\nshortly. Mainly, I want your opinion if it makes sense to restructure the GUI,\nand secondly, if it is possible to restructure the GUI and the code like I have\nstarted on doing, and still being able to read old test plans and populate the\nGUI correctly.\n\nI think the \"HTTP Request Defaults\" GUI can stay as it is, for now.\n\nIf you don't like my suggestion for restructuring the GUI, how do you think we\ncan add more options to this already quite crowded GUI ?", "id": 100721, "time": "2007-03-21T05:38:29Z", "bug_id": 41917, "creation_time": "2007-03-21T05:38:29Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Created attachment 19766\nSuggested prototype patch\n\nThis patch is not ready to be applied. It is a prototype.\nIt would be good if you could look at it, and also test the GUI that it\ncreates, and let me know what you think of :\na) the GUI look\nb) the code\nc) how easy / difficult you think it will be to restructure the GUI and\nrefactor the code like I have started on, and still maintain backwards\ncompatibility.\n\nThanks in advance", "attachment_id": 19766, "id": 100722, "creator": "alf@i100.no", "time": "2007-03-21T05:40:59Z", "bug_id": 41917, "creation_time": "2007-03-21T05:40:59Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 41917, "is_private": false, "count": 2, "id": 100765, "time": "2007-03-21T16:32:36Z", "creator": "sebb@apache.org", "creation_time": "2007-03-21T16:32:36Z", "text": "I think this might be better discussed on the mailing list (probably JMeter-\ndev); the Bugzilla entry can be updated as necessary when a decision is \nreached."}, {"count": 3, "tags": [], "text": "TOO OLD ISSUE.\nMany changes have been done on HTTP Request GUI since then.\nReopen if we decide to work on it.", "attachment_id": null, "id": 153014, "creator": "p.mouawad@ubik-ingenierie.com", "time": "2012-01-22T16:07:06Z", "bug_id": 41917, "creation_time": "2012-01-22T16:07:06Z", "is_private": false}]