[{"count": 0, "tags": [], "creator": "alf@i100.no", "is_private": false, "id": 100711, "creation_time": "2007-03-21T02:18:32Z", "time": "2007-03-21T02:18:32Z", "bug_id": 41913, "text": "The TransactionController was exactly what I needed, to measure the time it\ntakes to complete 8 different http requests as a whole.\n\nHowever, I think more useful information could be provided in the sample that\nthe TransactionController creates. I would like all the samples that are part of\nthe transaction to be subresults of the transaction sample. I would also like\nthat the transaction is marked as \"successfull\" only if all the subresults are\nsuccessfull.\n\nIf I now could choose somehow that the visualizers should only display the\ntransactions, and not also the subresults, then I would be perfectly happy with\nTransactionController, and measuring and viewing transaction times.", "attachment_id": null}, {"count": 1, "attachment_id": 19763, "bug_id": 41913, "is_private": false, "id": 100712, "time": "2007-03-21T02:27:26Z", "creator": "alf@i100.no", "creation_time": "2007-03-21T02:27:26Z", "tags": [], "text": "Created attachment 19763\nSuggested patch\n\nThe suggested patch makes TransactionController deliver samples that contains\nall the samples that are part of the transaction, as subresults of the\ntransaction sample.\nThe transaction sample is only marked as successfull if all of the subsamples\nare successfull. The transaction sample also contains the sum of number of\nbytes for all the subsamples.\nThe threadname of the sample from the TransactionController is also the same as\nthat of the subsamples, I did not understand why the thread name of the\ncontroller is used in the current version of the TransactionController.\n\nI have also changed the ViewResultsFullVisualizer, so that is shows the\nassertions that failed for subresults as well, and the assertions are now added\nafter the subrestults in the tree.\n\nSo this patch makes it easy to see if a transaction was a success or failure,\nand if it failed, it is easy to see which sample failed, and if it was an\nassertion which failed, you also easily see that.\n\nIf someone knows how to get a visualizer to only view results from the same\nlevel in the tree as the visualizer is placed, I would be happy. I cannot think\nof a way that is currently possible. The visualizer always seems to view the\nsamples from the current level and lower levels."}, {"attachment_id": null, "tags": [], "bug_id": 41913, "text": "Good idea, and the View Results Tree patch works for me, but the Transaction \nController patch does not seem to do what I expected.\n\nThe child samples of the Transaction Controller now appear twice in the View \nResults Tree. I think this needs to be fixed before the patch is committed.", "count": 2, "id": 100763, "time": "2007-03-21T16:07:17Z", "creator": "sebb@apache.org", "creation_time": "2007-03-21T16:07:17Z", "is_private": false}, {"count": 3, "tags": [], "creator": "alf@i100.no", "text": "If I have the following test plan :\n\nThreadgroup\n--Transaction Controller\n----Request A\n----Request B\n----Request C\n\nthen I currently see the following in the \"View Result Tree\" after sampling\nRequest A\nRequest B\nRequest C\nTransaction Controller\n--Request A\n--Request B\n--Request C\n\nIs that what you are seeing ?\n\nThe point is that the \"Transaction Controller\" is making a \"fake\" sample, and\nadding all the \"real\" samples of the transaction as the sub results of the\n\"fake\" transaction sample.\n\nDo you only want the \"Transaction sample\" sent to the visualizers ? I'm not sure\nif that is possible to do.\nBut as I think I said earlier, I would want one option to display only the\n\"transaction sample\" in the visualizers, and not all the \"real samples\". I'm not\nsure how to do it. I was thinking about telling a visualizer to only \"accept\"\nsamples from controllers on the same level as the visualizer in the three. But I\nfound no way of doing that.\n\nLet me know what you think.", "id": 100787, "time": "2007-03-22T03:27:02Z", "bug_id": 41913, "creation_time": "2007-03-22T03:27:02Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 41913, "text": "(In reply to comment #3)\n[...]\n\n> Is that what you are seeing ?\n\nYes\n\n> The point is that the \"Transaction Controller\" is making a \"fake\" sample, and\n> adding all the \"real\" samples of the transaction as the sub results of the\n> \"fake\" transaction sample.\n\nAt present it seems to be adding copies of the samples; the samples need to \nappear only as children of the TC. \n\nC.f. the HTTP Sampler when it retrieves embedded resources.", "id": 100789, "time": "2007-03-22T03:59:52Z", "creator": "sebb@apache.org", "creation_time": "2007-03-22T03:59:52Z", "tags": [], "is_private": false}, {"count": 5, "attachment_id": null, "bug_id": 41913, "is_private": false, "id": 100790, "time": "2007-03-22T04:57:31Z", "creator": "alf@i100.no", "creation_time": "2007-03-22T04:57:31Z", "tags": [], "text": "(In reply to comment #4)\nIs this what you want as the samples shown :\nTransaction Controller\n--Request A\n--Request B\n--Request C\n\nThe HTTP Request Sampler has an easier job, because that is creating one Sample,\nand has full control over what is put into that sample.\nThe Transaction Controller gets it's subsamples via an event, since it is a\nSampleListener. I doubt, at least I do not know how, that the Transaction\nController can prevent the \"real\" Samples from appearing at other\nSampleListeners. With events and listeners, you can never assume who will\nreceive the event first.\n\nI'm not sure if I understand you comments. Could you try to explain a bit more ?\n\n"}, {"attachment_id": null, "tags": [], "bug_id": 41913, "is_private": false, "count": 6, "id": 100797, "time": "2007-03-22T09:58:38Z", "creator": "alf@i100.no", "creation_time": "2007-03-22T09:58:38Z", "text": "(In reply to comment #5)\nOne think which would be easy, is to add an option to the \"Transaction\nController GUI\" along the lines of a checkbox with text \"Transaction sample\ncontains sub results\".\nIf this checkbox is true, then you would get test results like this :\nRequest A\nRequest B\nRequest C\nTransaction Controller\n--Request A\n--Request B\n--Request C\n\nAnd if the checkbox is false, you would get\nRequest A\nRequest B\nRequest C\nTransaction Controller\n\n\nI would like to suggest that the checkbox is true by default.\nI see a number of sitations where it would be useful to have the samples which\nare part of the transaction as a sub result. For example to add an assertion to\nthe transaction, to check that all the expected subsamples are part of the\ntransaction.\nIf you don't want to see the subsamples twice in some vizualisers, you unselect\nthis option."}, {"count": 7, "tags": [], "creator": "sebb@apache.org", "is_private": false, "id": 100800, "creation_time": "2007-03-22T10:56:44Z", "time": "2007-03-22T10:56:44Z", "bug_id": 41913, "text": "It could be an option, but if so should _not_ be on by default.\n\nOtherwise it will be confusing to users (it confused me), and may generate a \nlot of questions on the mailing lists...", "attachment_id": null}, {"count": 8, "attachment_id": 19777, "bug_id": 41913, "is_private": false, "id": 100818, "time": "2007-03-23T01:54:51Z", "creator": "alf@i100.no", "creation_time": "2007-03-23T01:54:51Z", "tags": [], "text": "Created attachment 19777\nUpdated patch\n\nThis is an updated patch, which adds an option to the transaction controller\ngui.\nThe option is a radio button group :\n\"Samples of the transaction to include in the transaction sample\"\nwith values \"None\", \"Failing\", and \"All\".\nThe default value is \"None\".\n\nI also looked into adding an option \"Abort transaction when sample fails\", to\nkind of simulate a rollback. It was not trivial to implement. If I was to\nimplement it, then I would have had to call the \"Sampler.sample(null)\" method\nin the TransactionControll, i.e. duplicate the code in JMeterThread.run that\nsets up the environment for the sampler, calls the sample method, and then\ncalls post processors, assertions and samplelisteners and so on. I don't think\nthat code should be duplicated into TransactionController.\nIf, however, the TransactionController somehow had been able to call the\n\"sample\" method of it's sub samplers, then I think we could have avoided that\nthe subsamples reached the sample listeners. It would be kind of neat, because\nthen you could have an option to only see the transaction sample in the\nvisualizers.\n\nAnyway, I hope the patch is ok now, and will investigate the issue of\n\"rollback\" and visualizers only seeing transaction samples if you could give me\nsome advice on how to proceed. The patch adds useful functionality as it is\nnow."}, {"count": 9, "tags": [], "creator": "alf@i100.no", "is_private": false, "text": "What do you think about the currently suggested patch ?\n\nBy the way, I think this also solves 40539, as far as it is possible.\nWhat you will be able to see, is the percentage of transactions which failed.\nYou will not see the percentage of samples of a transaction that failed.\n\nBut I think it will help a lot if the status of a transaction sample is set to\nfailure if any of it's subsamples fails.", "id": 101254, "time": "2007-03-30T13:43:21Z", "bug_id": 41913, "creation_time": "2007-03-30T13:43:21Z", "attachment_id": null}, {"count": 10, "tags": [], "creator": "sebb@apache.org", "text": "I'm not sure I understand why one would only want to add failing samplers as \nchildren of the TC.\n\nAlso I'm still concerned about the confusion that can be generated by having \nsamples appear twice.\n\nIf a flag is added to the Sample class to show which samples are included in \nthe TC, then it ought to be possible to use this to prevent the samples from \nshowing up twice. This would probably mean a small change to JMeterThread.\n\nThe other aspects of the patch are OK:\n* accumulating byte count\n* setting TC status failed if any sample fails", "id": 101267, "time": "2007-03-31T07:37:53Z", "bug_id": 41913, "creation_time": "2007-03-31T07:37:53Z", "is_private": false, "attachment_id": null}, {"count": 11, "tags": [], "bug_id": 41913, "text": "Created attachment 19860\nMinimal patch to let transaction sample fail if subsamples fails\n\nPerhaps you could apply this minimal patch first.\n\nIt sets the status of a transaction sample to failure if any of its' subsamples\nfails. And it set the byte count to the sum of its' subamples.\n\nIt also improves the ViewResultsFullVisualizer, by allowing any subresults to\nhave assertions that fails, and therefore will be shown in the GUI.\nThis is no strictly needed, but I think it is a useful improvement to the\nViewResultsFullVisualizer.\n\nI think this minimal patch is enough to solve the 40539 as good as it is\npossible.\n\nI suggest you leave this bug open, and then I will look more into your\nsuggestion on how to achieve the subsamples not to appear.\nIf I am able to do that, I think I will add an GUI option to the\nTransactionController : \"Include samples as subsamples of the transaction\nsample (checkbox)\", with default Off, i.e. like it is today.\nThen people like me, who want the subsamples to appear as subresults of the\ntransaction sample can turn this option on.\nI want this functionality, because I am doing functional testing, doing 8 HTTP\nrequests in sequence, as a transaction, and then when the transaction fails, i\nwant to be able to easily see which step of the transaction failed.", "id": 101296, "attachment_id": 19860, "creator": "alf@i100.no", "creation_time": "2007-04-01T07:10:07Z", "time": "2007-04-01T07:10:07Z", "is_private": false}, {"count": 12, "attachment_id": 19861, "bug_id": 41913, "text": "Created attachment 19861\nMinimal patch to let transaction sample fail if subsamples fails\n\nSorry, I was to quick when making the minimal patch.\n\nHere is the real minimal patch, which works as described above.", "id": 101297, "time": "2007-04-01T07:16:06Z", "creator": "alf@i100.no", "creation_time": "2007-04-01T07:16:06Z", "tags": [], "is_private": false}, {"count": 13, "tags": [], "creator": "sebb@apache.org", "text": "OK, I've applied patch 19861 (SVN r542617).", "id": 101302, "time": "2007-04-01T09:02:25Z", "bug_id": 41913, "creation_time": "2007-04-01T09:02:25Z", "is_private": false, "attachment_id": null}, {"count": 14, "tags": [], "creator": "alf@i100.no", "text": "Created attachment 20157\nPatch for letting TransactionSample contain sub results\n\nSuggested patch to let TransactionSample contain the samples of the transaction\nas sub results, and avoid the subsamples to appear in sample listeners.\n\nThis suggested patch restructures the transaction handling code quite a bit.\nThe TransactionController and TransactionControllerGui is moved from components\nto core, because the TransactionController is now referenced in JMeterThread,\nwhich is in core.\n\nThe source code in TransactionControllerGUI is not changed at all.\n\nI have made a new class TransactionSampler, which is responsible for handling\nthe sub sampler results.\n\nThe JMeterThread is changed, to handle transactions.\nThe transaction sample is only sent to listeners who do not receive the sub\nsamples. The transaction sample contains the sub samples as sub results.\nIt is also possible to have assertions for the transaction sample, for example\nDurationAssertion, to check the duration for the transaction. This assertion\nwill also be applied to the sub samples.\n\nThe TransactionController code is simpler than before.\n\nI will attach a test plan, to show one way of using the Transactions, Listeners\nand Assertions.\n\nIt could also be possible to add an option in the TransactionControllerGUI, to\nspecify that the transaction sample should not contain sub results, for more\nbackwards compatibility.\n\nFor now, I would appreciate comments about the code restructuring and the\nfunctionality. Do you think it makes sense, and does the code look ok to you,\nor is the code becoming to complex with these changes ?\n\nIdeally, I would have liked to handle everything inside the\nTransactionSampler.sample method instead of in JMeterThread, but I do not see\nhow that is possible currently.", "id": 102992, "time": "2007-05-09T06:10:14Z", "bug_id": 41913, "creation_time": "2007-05-09T06:10:14Z", "is_private": false, "attachment_id": 20157}, {"count": 15, "attachment_id": 20158, "bug_id": 41913, "text": "Created attachment 20158\nTest plan to show new transaction functionality\n\nThe test plan works before and after the suggested patch is applied.\n\nHave a look at what the different listeners are showing.\n\nYou might have to tweak the Duration Assertion time, to make the subsamples\npass, but the transaction fail in some cases.", "id": 102994, "time": "2007-05-09T06:22:53Z", "creator": "alf@i100.no", "creation_time": "2007-05-09T06:22:53Z", "tags": [], "is_private": false}, {"attachment_id": 20159, "tags": [], "bug_id": 41913, "text": "Created attachment 20159\nPatch for letting TransactionSample contain sub results\n\nSorry, I moved the TransactionControllerGui from components to core in last\nminute, so in the previous patch it was accidentially placed in /config/\ninstead of the correct /control/ package.\n\nPlease read the text for the 20157 attachment, which describes this patch.", "count": 16, "id": 102996, "time": "2007-05-09T06:26:21Z", "creator": "alf@i100.no", "creation_time": "2007-05-09T06:26:21Z", "is_private": false}, {"count": 17, "tags": [], "bug_id": 41913, "is_private": false, "id": 103470, "attachment_id": 20237, "creator": "alf@i100.no", "creation_time": "2007-05-21T23:51:06Z", "time": "2007-05-21T23:51:06Z", "text": "Created attachment 20237\nPatch for letting TransactionSample contain sub results\n\nUpdated patch. The subsampler result were delivered to soon to the transaction\nsample in JMeterThread. It was delivered before postprocessors and assertions\nhad been run. It is now delivered after those steps, so that the \"successfull\"\nstate of the subsampler result has been set before being delivered to\ntransaction sample."}, {"count": 18, "attachment_id": null, "bug_id": 41913, "is_private": false, "id": 103701, "time": "2007-05-26T03:19:48Z", "creator": "sebb@apache.org", "creation_time": "2007-05-26T03:19:48Z", "tags": [], "text": "Thanks, that works much better.\n\nThe code changes have been applied to SVN in r541883.\n\nThe move of two classes from components to core was applied separately in \nr541877 to make it easier to follow the subsequent changes."}]