[{"count": 0, "tags": [], "creator": "dlai333@hotmail.com", "is_private": false, "id": 100859, "attachment_id": null, "bug_id": 41941, "creation_time": "2007-03-25T01:43:40Z", "time": "2007-03-25T01:43:40Z", "text": "I'm using FOP 0.93 to convert FO to RTF. The FO has a numbered list with 3 \nitems numbered with letter a), b) and c). The numbered list in the output RTF \nis displayed correctly in MS Word as below:\na)\tItem one\nb)\tItem two\nc)\tItem three\n\nbut if you add a new item by pressing 'Enter' and type 'Item four' at the end \nof the list you will get\na)\tItem one\nb)\tItem two\nc)\tItem three\nc)\tItem four\n\nIt appears each list item is a list on its own and therefore the added list \nitem is numbered as 'c)' not 'd)'. This problem also occurs for Roman (i. ii. \netc) numbered list.\n\nHowever for Arabic (1. 2. etc) numbered list, all list items are numbered \nas '1.' incorrectly in the output RTF.\n\n1.0dev also gives the same results."}, {"count": 1, "tags": [], "creator": "adelmelle@apache.org", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of 41389 ***", "id": 105422, "time": "2007-07-14T03:52:59Z", "bug_id": 41941, "creation_time": "2007-07-14T03:52:59Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 41941, "is_private": false, "id": 141124, "attachment_id": 26221, "creator": "dinistangerino@gmail.com", "creation_time": "2010-10-28T10:14:06Z", "time": "2010-10-28T10:14:06Z", "text": "Created attachment 26221\npatch that might fix this and another unreported bug\n\nHello all,\n\nfirst of all, i believe this is not a duplicate of 41389.\n\ni came across the same issue. all the numbered list items rendered with '1.'. Furthermore, a second problem was that all subsequent blocks after the list block, inside the same containing table cell block, would be prefixed with '2.', '3.' etc respectively.\n\ni fixed the first problem by commenting a couple lines that, as david said, turned each list item in a list on its own. it seems to me like it is a relic from a time where something else wasn't working as it is now. someone else will have a a better judgement, but i didn't see any negative impact.\n\nfor the second problem, seems that the list block should be prefixed and suffixed with the 'pard' control word in order to restrain the formatting from \"bleeding out\" to neighbouring blocks. however, due to compatibility issues, this will explicitly not happen when the list is contained in a table. what i did was wrap the list with groupmarks regardlessly, (\"{}\") thus preventing the bleeding. again, this was just enough to solve my issue, and i didn't see any negative impact."}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 156913, "time": "2012-04-01T13:54:52Z", "bug_id": 41941, "creation_time": "2012-04-01T13:54:52Z", "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs"}]