[{"count": 0, "tags": [], "creator": "alf@i100.no", "attachment_id": null, "is_private": false, "id": 101609, "time": "2007-04-12T04:38:05Z", "bug_id": 42098, "creation_time": "2007-04-12T04:38:05Z", "text": "Currently, the HTTP Samplers always url encode the parameter values using the\nUTF-8 encoding when a HTTP GET request is made. This is according to the HTTP\nspecification.\n\nBut most, if not all browsers, do not follow the specification when urlencoding\nfor HTTP GET request. Most browsers use the encoding of the page where the form\nwas present, or uses the value of the \"accept-charset\" attribute for the <form>\nhtml tag.\n\nSince the HTTP Request GUI currently has a field \"Content encoding\", which is\nused in HTTP POST request to encode the URL for HTTP Post according to the\nspecified encoding, I would like to suggest the same functionality for HTTP GET.\n\nThis means that if the user has filled in a value in \"Content encoding\", and is\ndoing a HTTP GET, then the specified encoding will be used to encode the\nparameter values, if encoding checkbox is on. Only the parameter value will be\nencoded with this encoding, the parameter name will always be encoded using UTF-8.\nIf the user has not specified a value for \"Content encoding\", then \"UTF-8\" will\nbe used, which is like it is today.\n\nI think this patch makes it possible to let Jmeter behave more like other browsers."}, {"count": 1, "text": "Created attachment 19935\nSuggested patch for encoding HTTP GET urls\n\nThe suggested patch lets the HTTPSamplerBase construct the query string by\nencoding parameter values according to the specified encoding.\nThis also means that the PostWriter can use this\ngetQueryString(contentEncoding) method, instead of having it's own version of\nthe method.\n\nI have also added unit tests to TestHTTPSamplersAgainstHttpMirrorServer. If you\nonly apply the unit test, then the test from line 353 will fail.\nI.e. where the values are set like this :\ntitleValue = \"mytitle\\uc385\";\ndescriptionValue = \"mydescription\\uc385\";\nBecause these values look different when url encoded in utf-8 and iso-8859-1.\n\nThis patch will also make it easier to add functionality to the HTTP Proxy\nserver.", "bug_id": 42098, "attachment_id": 19935, "id": 101610, "time": "2007-04-12T04:43:54Z", "creator": "alf@i100.no", "creation_time": "2007-04-12T04:43:54Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 42098, "attachment_id": null, "is_private": false, "id": 101714, "time": "2007-04-14T05:51:15Z", "creator": "sebb@apache.org", "creation_time": "2007-04-14T05:51:15Z", "text": "Thanks, applied to SVN in r528800"}]