[{"count": 0, "attachment_id": null, "creator": "karen_tgha@yahoo.com", "text": "The server does not correctly get installed under Windows Vista.\nIt is possible to run it but configuration of it is a tough issue.\n\nApache keeps all the configuration information under Program Files directory. In\nVista the Program Files directory is protected, only processes with\nadministrative privileges can write under it.\nMy guess is part of installation is happening in processes that do not have\nadministrative privilege and the configuration files do not get populated\ncorrectly. The httpd.conf stay with unprocessed tokens.\n\nI think the whole installation procedure and the method of storing and using\nconfiguration files and data must be overhauled for Vista. Configration should\nbe stored under C:\\Program Data\\Apache Software Foundation\\ApacheServer folder\nwhich would be accessible to apache running as restricted application or app\nwith admin privileges. The Apache installation as service would also use this\ndirectory. Otherwise it's a nightmare to modify the configuration manually.\n\nIn other words, Apache is not exactly Vista-compatible.", "id": 101596, "time": "2007-04-11T14:58:37Z", "bug_id": 42095, "creation_time": "2007-04-11T14:58:37Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 42095, "attachment_id": null, "id": 103154, "creation_time": "2007-05-14T00:03:45Z", "time": "2007-05-14T00:03:45Z", "creator": "simon.lieschke@orionhealth.com", "text": "This can be worked around via the following steps:\n\n1. Navigate to Start --> All Programs --> Accessories\n2. Right-click Command Prompt and select Run as Administrator\n3. Run the following: msiexec /i path/to/your/apache.msi\n4. Run through the installer. When you get to the Setup Type screen, select Custom.\n5. Change your installation directory so Apache is not installed in the Program\nFiles directory structure. This is done otherwise Windows User Account Control\nwill prove problematic when you want to edit your httpd.conf file.\n6. Run through the remainder of the installer as per normal.\n\nWhen the installer completes a blank error dialog will be displayed. This is the\nApache Service Monitor program (that normally runs in the system notification\narea) failing to start. This error will also appear when starting Windows as a\nshortcut to the monitor is configured in the Startup folder. This problem can be\nresolved by right clicking on ApacheMonitor.exe executable in the bin directory\nof the Apache installation and configuring to run in Windows XP (Service Pack 2)\ncompatibility mode. This will stop the error from ocurring but you won't be able\nto stop/start/restart the Apache service from the monitor (due to other User\nAccount Control restrictions in Vista).", "is_private": false}, {"count": 2, "tags": [], "creator": "rwk@acm.org", "attachment_id": null, "text": "It appears that this is due to the virtualization technology in Vista.\n\nI found myself in the odd state of being able to see (and modify!) httpd.conf in\nEmacs, but not in my admin-privileged cmd.exe, or the explorer....  I went off\ninto the woods looking for rootkits for a while...\n\nThen it hit me what's going on. It really is creating the httpd.conf file\nproperly. But in the virtual environment the installer (and my original Emacs)\nwere in, this write is virtualized, and everything written ended up in\nC:\\Users\\<username>\\AppData\\virtualStore\\Program Files\\Apache Software\nFoundation\\Apache 2.2\\...\n\nI started another Emacs, turned off Virtualization on that Emacs, and saw the\nfile as missing. Just like the service did.\n\n(It's not just the httpd.conf file, either -- the *.in annd *.awk file stay in\nthe real directory, while they are removed and replaced with their munged\ncounterparts in the virtualized directory. And the install.log ends up in the\nvirtualized directory).\n\nThis is going to Seriously Confuse Lots of People; I think it's worth putting\nsomething up on the download page until this is resolved. Installing it\nelsewhere is probably the simplest option for people (I haven't tested it!). I'm\n probably just going to run the service as myself (I'm just doing a dry run on\nmy laptop, rather than doing anything production -- deployment will be on XP, so\nthat should more closely simulate the target install).", "id": 103731, "time": "2007-05-27T10:17:35Z", "bug_id": 42095, "creation_time": "2007-05-27T10:17:35Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 42095, "text": "*** Bug 42607 has been marked as a duplicate of this bug. ***", "id": 111193, "time": "2007-11-28T01:00:41Z", "creator": "takashi.asfbugzilla@tks.st", "creation_time": "2007-11-28T01:00:41Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 42095, "attachment_id": null, "id": 112062, "creation_time": "2007-12-21T21:50:31Z", "time": "2007-12-21T21:50:31Z", "creator": "wrowe@apache.org", "text": "this is resolved (not the troubles you'll have configuring, but the rights\nfor the installer's config rewrite scripts to handle the files.)  These\nwere updated in the latest release set.", "is_private": false}]