[{"count": 0, "tags": [], "bug_id": 42105, "text": "[Summarizing from the dev list here. See http://marc.info/?l=apache-httpd-\ndev&m=117027634505806&w=2 and following posts.]\n\nUsers have a problem with directory listings generated by mod_autoindex:\nIt is not possible to control the character setting which which the\nresponse is marked. The server cannot know what the real encoding on\ndisk is, it decides on a very rough guess based on the OS it is running\non: APR_HAS_UNICODE_FS, which is, as far (as little) as I looked, 1 on\nWindows, and 0 on Linux. Depending on it, mod_autoindex decides whether\nto add a (fixed) charset to the content type:\n\n#if APR_HAS_UNICODE_FS                                                                                                                                                                                                                     \n    ap_set_content_type(r, \"text/html;charset=utf-8\");\n#else                                                                                                                                                                                                                                      \n    ap_set_content_type(r, \"text/html\");\n#endif                                                                                                                                                                                                                                     \n\nThing is, that Linux uses filesystems that encode UTF-8 since ages, and\nsince a system-wide UTF-8 locale is becoming more and more widespread,\nfilenames encoded as such are occurring much more frequently. This\nmeans, that on many servers the content type needs to be set\nappropriately, so the browser can display things correctly.\n\nMy first thought was to define APR_HAS_UNICODE_FS to 1, but that could\nbe just as wrong; it only means that the filesystem is unicode capable\nbut not that the actual filenames happen to be encoded like that.\nInstead, it only depends on site specific needs.\n\nThus, I think the right way is to make the character set configurable.\nI am attaching a patch which adds a \"AddDirectoryIndexCharset\" directive\nto the mod_autoindex configuration.\n\nThe patch actually removes the dependency on APR_HAS_UNICODE_FS. My\ntrain of thought here is that utf-8 can (and should) be the default,\nunless configured otherwise. This fits Windows (it has always been like\nthat), and it (largely) fits Linux. But I don't know about other\nplatforms.\n\nOn Thu, Feb 01, 2007 at 11:13:38AM -0600, William A. Rowe, Jr. wrote:\n> Dr. Peter Poeml wrote:                                                                                                                                                                                                                   \n> > On Thu, Feb 01, 2007 at 10:59:46 +0000, Joe Orton wrote:                                                                                                                                                                               \n> >> On Wed, Jan 31, 2007 at 09:45:12PM +0100, Dr. Peter Poeml wrote:                                                                                                                                                                      \n> >>> Users have a problem with directory listings generated by mod_autoindex:                                                                                                                                                             \n> >>> It is not possible to control the character setting which which the                                                                                                                                                                  \n> >>> response is marked.                                                                                                                                                                                                                  \n> >> AddDefaultCharset does allow this already as you mention in the bug.                                                                                                                                                                  \n> >> Can't users who insist on using filenames using one encoding and file                                                                                                                                                                 \n> >> content using another simply use:                                                                                                                                                                                                     \n> >>                                                                                                                                                                                                                                       \n> >> AddDefaultCharset UTF-8                                                                                                                                                                                                               \n> >> AddCharset ISO-8859-1 .html                                                                                                                                                                                                           \n> >>                                                                                                                                                                                                                                       \n> >> or similar?                                                                                                                                                                                                                           \n> >                                                                                                                                                                                                                                        \n> > I don't think so, because it means                                                                                                                                                                                                     \n> >  1) that all .html files would need to be ISO-8859-1                                                                                                                                                                                   \n> >  2) you cannot have files with charset=somethingelse anymore                                                                                                                                                                           \n> >  3) all non-html files would need to be UTF-8 then, unless you add                                                                                                                                                                     \n> >     AddCharset directives for all of them...                                                                                                                                                                                           \n>                                                                                                                                                                                                                                          \n> And you can't match by name.  I'm reviewing the patch, but I'll already                                                                                                                                                                  \n> offer a +1 on the concept.                                                                                                                                                                                                               \n\nOn Thu, Feb 01, 2007 at 10:01:52PM +0100, Ruediger Pluem wrote:\n> In the general case I agree with Joe that if things can be done with existing                                                                                                                                                            \n> directives / code, no new directives / code should be added, but this case here                                                                                                                                                          \n> is different.                                                                                                                                                                                                                            \n>                                                                                                                                                                                                                                          \n> I think it is the ultimate duty of the content generator to set the correct                                                                                                                                                              \n> content type / encoding. So in this case this would be mod_autoindex. Whether                                                                                                                                                            \n> mod_autoindex detects this automatically or has a directive to set this is another                                                                                                                                                       \n> story. Currently I would be in favour of a directive provided that there is                                                                                                                                                              \n> no reliable and performant autodetection mechanism.                                                                                                                                                                                      \n>                                                                                                                                                                                                                                          \n> From my point of view AddDefaultCharset and AddCharset should be used to                                                                                                                                                                 \n>                                                                                                                                                                                                                                          \n> - configure the \"core content generator\" of httpd (serving static files)                                                                                                                                                                 \n> - help fixing broken content generators who cannot set the encoding correctly                                                                                                                                                            \n>   by themselves                                                                                                                                                                                                                          \n>                                                                                                                                                                                                                                          \n> So +1 on the general concept.                                                                                                                                                                                                            \n\nCool.\n\nHere is the patch against trunk, with documentation added.\n\nI hope I got the way of patching the documentation right. A review would\nbe very much appreciated.\n\nThanks,\nPeter", "id": 101628, "time": "2007-04-12T10:12:55Z", "creator": "peter@poeml.de", "creation_time": "2007-04-12T10:12:55Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": 19938, "creator": "peter@poeml.de", "text": "Created attachment 19938\nPatch for trunk adding AddDirectoryIndexCharset directive", "id": 101629, "time": "2007-04-12T10:15:13Z", "bug_id": 42105, "creation_time": "2007-04-12T10:15:13Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 42105, "text": "Something similar was created to add IndexOptions Type=content/type Charset=foo\n\nand will be available in the next 2.0 and 2.2 releases of httpd.\n\nWe are a bit premature to presume a utf-8 on unix-ish systems, because by\ndefinition they are bytestreams.  But that said, OS/X made it explicit that\nfilenames are UTF-8, so we follow your suggestion on at least one 'unix' :)\n\nThank you for your report!", "id": 107498, "time": "2007-08-30T14:45:50Z", "creator": "wrowe@apache.org", "creation_time": "2007-08-30T14:45:50Z", "is_private": false, "attachment_id": null}]