[{"attachment_id": null, "tags": [], "bug_id": 42163, "text": "This had me stumped for a few hours today...\n\nIn server.xml, when a Host has deployOnStartup=\"true\" or autoDeploy=\"true\", it\nseems that Tomcat is taking all folders within the appBase to be separate\napplications, whether or not they have a WEB-INF/web.xml.  This problem happened\nfor me when there was only one Context - the application within appBase.  I'm\nnot sure if it happens when multiple contexts are defined.\n\nSo, for example, lets say you have an application with the following in the root\ndirectory:\n\nindex.jsp\n/subdir\n/subdir/index.jsp\n/WEB-INF\n/WEB-INF/web.xml\n\nThere's no problem accessing http://mydomain.com/index.jsp (or any other page\nwithin the main directory).  However, if you try to access\nhttp://mydomain.com/subdir/ or anything within that subdirectory, the request\nwon't get to your application code, as Tomcat will assume that the request is\nfor an application deployed in /subdir (an application which doesn't exist). \nI've found one of two things happening:\n\n1.  If the URL doesn't map to a real file e.g. /subdir/madeupURL: Tomcat just\nreturns a 404 error.\n2.  If the URL does map to a real file e.g. /subdir/index.jsp: Tomcat will log a\nWARN \"Internal Error: File /WEB-INF/web.xml not found\", and try to execute the\nfile at /subdir/index.jsp (in my case failing with a misleading error because\nthe index.jsp file relies on stuff in the application classpath...).\n\nBasically the problem seems to be that the check for a WEB-INF/web.xml isn't\nhappening properly.  So subdirectories are getting labelled as applications even\nif they don't have a WEB-INF/web.xml.\n\nThe workaround is easy: set the Host attributes deployOnStartup=\"false\" and\nautoDeploy=\"false\" in server.xml.\n\nCheers,\nMartin", "count": 0, "id": 101891, "time": "2007-04-18T12:28:48Z", "creator": "martin@silvermetric.com", "creation_time": "2007-04-18T12:28:48Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "This is as required by the 2.5 spec and by design. The automatic deployment docs\nhave been updated to reflect that a WEB-INF/web.xml file is no longer required\nby the spec.", "id": 101900, "time": "2007-04-18T15:50:21Z", "bug_id": 42163, "creation_time": "2007-04-18T15:50:21Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 42163, "text": "It should be obvious that there's something wrong if you map somehow harcode\nmapping of the host's appBase as the root webapp, and leave autodeployment\nenabled. What do you expect to be autodeployed exactly ?\n\nThe actual workaround is to not use webapp deployment hacks (Context elements\nare still allowed in server.xml due to certain use cases; however I have the\nfeeling an empty - or equivalent - docBase should be forbidden or at least cause\na very visible warning).", "count": 2, "id": 101904, "time": "2007-04-18T16:05:07Z", "creator": "remm@apache.org", "creation_time": "2007-04-18T16:05:07Z", "is_private": false}, {"count": 3, "tags": [], "text": "Mark, my apologies, I hadn't realized that this was in the 2.5 spec.  Updated\ndocs will make it clearer for anyone else that might be confused by this - thanks.", "is_private": false, "id": 101925, "creator": "martin@silvermetric.com", "time": "2007-04-19T01:59:20Z", "bug_id": 42163, "creation_time": "2007-04-19T01:59:20Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 42163, "attachment_id": null, "is_private": false, "id": 101926, "time": "2007-04-19T02:39:11Z", "creator": "martin@silvermetric.com", "creation_time": "2007-04-19T02:39:11Z", "text": "Remy, you're basically right about the configuration that I was aiming for.  I'm\nafraid I don't have a great understanding of the ways in which contexts and\nhosts are best configured so most likely I was going about it all the wrong way.\n\nWhat I was trying to do was to configure contexts outside of server.xml (with\nXML files in $CATALINA_HOME/conf/[engine_name]/[host_name]).  The directory\nstructure on my server doesn't have all the tomcat applications arranged inside\none directory: for this reason all my contexts are defined with an\nabsolute-pathname docBase, so essentially I didn't want appBase to be used at\nall.  But appBase is a required attribute of Host, so I figured that setting it\nthe same as the docBase of the root context made sense.\n\nSo I wanted auto-deployment at startup time to find the context xml files in\n$CATALINA_HOME/conf/[engine_name]/[host_name], but *not* to take subdirectories\nof appBase as applications.  This worked OK in Tomcat 5, because WEB-INF/web.xml\nwas actually required for Tomcat 5 to consider a subdirectory of appBase to be\nan application.  But, as Mark explained, in Tomcat 6, any directory within\nappBase gets defined as an application, meaning that any subdirectory would get\ntaken as an application.\n\nI guess this might be one of the use-cases that you mention where contexts need\nto be defined in server.xml.  Or more likely I'm just a bit confused :s\n\nAnyway, I don't want you to think that I'm treating this bug as a personal\ntomcat-configuration tutorial, so please don't feel obliged to correct me!"}, {"count": 5, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Your fine with one minor correction. Host appBase should never be set to the\nsame as an apps docBase. Simplest solution - create an empty dir for it.", "id": 101930, "time": "2007-04-19T04:33:50Z", "bug_id": 42163, "creation_time": "2007-04-19T04:33:50Z", "is_private": false}, {"count": 6, "tags": [], "text": "Ah, that makes sense - thanks Mark :)", "attachment_id": null, "id": 101931, "creator": "martin@silvermetric.com", "time": "2007-04-19T04:39:54Z", "bug_id": 42163, "creation_time": "2007-04-19T04:39:54Z", "is_private": false}]