[{"count": 0, "tags": [], "bug_id": 42184, "attachment_id": null, "id": 102016, "time": "2007-04-22T05:15:04Z", "creator": "alf@i100.no", "creation_time": "2007-04-22T05:15:04Z", "is_private": false, "text": "When using HTTP Request sampler, for example, and ticking on the \"Download\nimages\" checkbox, the sample for the web page will get the images and other\nresources downloaded for the page as subsamples.\nThe time elapsed for the sample for the web page includes the time it takes to\ndownload the subsamples.\nBut the number of bytes downloaded for each subsample is not added to the\n\"parent\" sample. Therefore the \"number of bytes per second\" in the \"Summary\nreport\" is incorrect.\n\nI think the number of bytes for a sample should be updated to include the number\nof bytes for subsamples added to the sample."}, {"count": 1, "tags": [], "creator": "alf@i100.no", "attachment_id": 20008, "is_private": false, "id": 102017, "time": "2007-04-22T05:20:43Z", "bug_id": 42184, "creation_time": "2007-04-22T05:20:43Z", "text": "Created attachment 20008\nSuggested patch\n\nThe suggested patch updates the number of bytes for the sample who receives\nsubsamples, so that the number of bytes is equal to the sum of bytes for its'\nsubsamples, plus the number of bytes for the sample itself.\n\nI also think that it would be useful to show the number of bytes for the sample\nin the \"ViewResultsFullVisualizer\" GUI, so I've included that in the patch.\n\nAnd I have added some unit tests to TestSampleResults."}, {"count": 2, "tags": [], "bug_id": 42184, "text": "Thanks, fixed in r531175.\n\nBy the way, I had to change\n\nassertEquals(1d / (totalTime / 1000d), calculator.getRate());\nto\nassertEquals(1d / (totalTime / 1000d), calculator.getRate(),0d);\n\nas assertEquals(double,double) does not exist in the version of JUnit used by \nJMeter.", "id": 102023, "time": "2007-04-22T06:35:41Z", "creator": "sebb@apache.org", "creation_time": "2007-04-22T06:35:41Z", "is_private": false, "attachment_id": null}]