[{"count": 0, "tags": [], "creator": "ralikwen@hotmail.com", "is_private": false, "text": "It would be nice if I could add to the output of a Summary Report or log the \ncurrent value of a parameter as a column.\n\nWhen driving JMeter from some external app it would be very good to see the \nvalues of the parameter it was called with in the logfile - withouth that it \nis difficult to separate them.\n\nOn the GUI:\nI did some loadtesting and currently the only way I could comfortably do that \nwas to create several thread groups with different number of users and the \nsame rampup time, specify that one threadgroup must finish before the other \nstarts and put a Summary Report page in each threadgroup.\nI than copy/pasted the results from each threadgroup to a table and made a \nchart from that.\n\nThis would have been much easier if I could just place a Summary Report on the \ntest level. The problem is that now it would summarise results from all \nthreadgroups. I could of course add the name of the thread group to all labels \nunder that group, but that would be too much work.\nInstead how nice it would be if I could just say to output the threadgroup \nname as well and so generate a separate summary on that page.", "id": 102163, "time": "2007-04-23T14:42:19Z", "bug_id": 42204, "creation_time": "2007-04-23T14:42:19Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "The code in SVN has been updated to allow a list of variables to be specified;\nthe variables and their values are saved in JTL files. \n\nSee the \"sample_variables\" entry in jmeter.properties\n\nAs to adding the thread group name to the Summary (and Aggregate?) reports, this\nsounds like a good idea.", "attachment_id": null, "id": 113307, "creator": "sebb@apache.org", "time": "2008-01-30T16:48:24Z", "bug_id": 42204, "creation_time": "2008-01-30T16:48:24Z", "is_private": false}, {"count": 2, "tags": [], "text": "Group name box added to Aggregate and Summary reports.\n\nSVN r642732 ", "attachment_id": null, "id": 115103, "creator": "sebb@apache.org", "time": "2008-03-30T06:18:20Z", "bug_id": 42204, "creation_time": "2008-03-30T06:18:20Z", "is_private": false}]