[{"count": 0, "tags": [], "bug_id": 42207, "text": "I think I've found an annoying little feature in apache2ctl where it completely\nignores my directive -D SSL or SSL (set in /etc/sysconfig/apache2 which I\nchecked that apache2ctl is looking at).\n\nWhen I type apache2ctl start I cannot get it to listen on 443 and run a secure\nserver.  If I type apache2ctl startssl it says \"Please edit httpd.conf to\ninclude the SSL configuration settings\" but this is far too vague or just plain\nincorrect, I think it should say \"please check /etc/sysconfig/apache2\" or\nsomething specific as this was totally unhelpful to me.\n\nIt all works fine when running this:\n\nlcn2:/etc/apache2 # rcapache2 extreme-configtest\nSyntax: OK\n\nlcn2:/etc/apache2 # rcapache2 startssl\nStarting httpd2 (prefork)                                             done\n\nWorks great and ssl works without changing anything.  Using rcapache2 start\nworks the same.  However it uses a different binary /usr/sbin/httpd2-prefork\n\nBut, running just httpd -D SSL works as well so it doesn't seem to matter which\nbinary is used.\n\nThis is a Suse 10.2 compiled package but I think the issue is with apache2ctl\nscript.\n\nNick", "id": 102178, "time": "2007-04-23T16:27:17Z", "creator": "nicholas-jones@uiowa.edu", "creation_time": "2007-04-23T16:27:17Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 42207, "attachment_id": null, "text": "Perhaps a Suse 10.2 specific problem.  Suse 10.2 uses rcapache2 instead of\napachectl (it is named apache2ctl under Suse 10.2).  From the Suse documentation\n\nEven if it is a Suse specific problem that Suse has caused and needs to know\nabout, I still think better error output is needed.  Such as \"Could not start an\nssl httpd2 on port 443 because of XX\".  I'm nearly certain the syntax is correct\nbecause it works when calling the init.d process directly with -D SSL.\n\n---\n Tried to review doc on apache.org for the start script and not sure how to start.\n\nOn apache.org, you will find 'apachectl' referenced as the standard tool to\nstart apache2. Although this tool is available on SuSE Linux (named\n\"apache2ctl\"), using our slightly more powerful (and better integrated) tool\nnamed \"rcapache2\" is recommended. (That's actually the shell script\n/etc/init.d/apache2.) Enter \"rcapache2 help\" as user root to see what it can do.\nTo start apache2, either enter \"rcapache2 start\" as root or use the YaST\nRunlevel Editor to activate the starting of apache2 at boot time. As a command\nline alternative to the Runlevel Editor, you could run the command \"chkconfig -a\napache2\" to make sure that apache2 is started at system boot time. \n---", "id": 102244, "time": "2007-04-24T08:21:05Z", "creator": "nicholas-jones@uiowa.edu", "creation_time": "2007-04-24T08:21:05Z", "is_private": false}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 102246, "time": "2007-04-24T08:35:49Z", "bug_id": 42207, "creation_time": "2007-04-24T08:35:49Z", "is_private": false, "text": "The startssl option to apachectl was deprecated in 2.0 and removed in 2.2 as\ndiscussed here:\nhttp://httpd.apache.org/docs/2.2/upgrading.html\n\nBut in general, this is an issue you should address with SuSE. They do not use\nthe standard apache.org config, so they are responsible for supporting their\nchanges."}]