[{"count": 0, "tags": [], "text": "Meta collection configuration is hard-coded and any changes to it are never\nsaved. What happens instead, when meta information is requested or updated,\ndatabase attempts to create new corresponding meta collection. If that\ncollection has been created in a previous run, its existing file will be used,\nif not, new file will be created. \n\nThis changes configuration at a runtime, so next request will find existing\ncollection, but after server is restarted all the configuration changes are\nlost. It is not a big deal normally, but in some cases it causes incorrect\nbehavior. For example, meta collection will not be deleted with its\ncorresponding collection if there were no requests to it after server has been\nrestarted. If that collection is recreated, metadata for previously existed\ncollection with the same name will be used. \n\nThis issue was described here:\nhttp://marc.info/?l=xindice-users&m=117737647221091&w=2", "is_private": false, "bug_id": 42273, "id": 102529, "time": "2007-04-26T20:19:18Z", "creator": "nshilenkova@gmail.com", "creation_time": "2007-04-26T20:19:18Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 42273, "is_private": false, "text": "Created attachment 20057\nmeta.patch\n\nPatch has a suggestion on how issue could be fixed. This would allow metadata\ncollection to remember its configuration, similarly to database configuration.", "id": 102530, "time": "2007-04-26T20:23:32Z", "creator": "nshilenkova@gmail.com", "creation_time": "2007-04-26T20:23:32Z", "attachment_id": 20057}, {"count": 2, "tags": [], "creator": "vgritsenko@apache.org", "attachment_id": null, "text": "applied, thanks.\n\nit probably makes sense to move 'meta.xml' file management into the meta\ncollection itself. but it also makes sense to actually implement open()\nseparately from setConfig() in the Database and Collection - but all this should\nwait till after release.", "id": 102583, "time": "2007-04-27T17:53:22Z", "bug_id": 42273, "creation_time": "2007-04-27T17:53:22Z", "is_private": false}]