[{"count": 0, "tags": [], "creator": "info@fluffles.net", "attachment_id": null, "id": 102572, "time": "2007-04-27T13:47:33Z", "bug_id": 42284, "creation_time": "2007-04-27T13:47:33Z", "is_private": false, "text": "I recently built Apache 2.2.4 on FreeBSD with some module categories disabled.\nAfter installation, apachectl -t gave the following error:\n\nSyntax error on line 149 of /usr/local/etc/apache22/httpd.conf:\nInvalid command 'Order', perhaps misspelled or defined by a module not included\nin the server configuration\n\nWhen searching for \"order\" i found the following two URLs, which implied that\norder is in fact part of the \"core\" and that no module is required.\n\nURL #1: here limit is defined as being the directive that controls the host\naccess with Allow, Deny and Order directives:\nhttp://httpd.apache.org/docs/2.2/mod/core.html#allowoverride\n\nURL #2: this is the limit directive, it is said to be part of the core and not\nany module:\nhttp://httpd.apache.org/docs/2.2/mod/core.html#limit\n\nURL #3: Here, however, \"order\" is defined as being part of the mod_authz_host\nmodule, which is correct:\nhttp://httpd.apache.org/docs/2.2/mod/mod_authz_host.html#order\n\nDocumentation exists to simply people's lives, so if documentation is unclear to\nsome it should be clarified. I think that URL #2 need a message indicating Order\nis (apparantly?) not part of Limit and therefore still requires a module to be\nbuilt (not in \"core\"). A link to URL #3 would be nice. This way it is clear to\nthe reader that the \"order\" directive is not part of limit or AllowOverride but\nin fact part of the authz_host module, with a link the the 3th URL."}, {"count": 1, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 102658, "time": "2007-04-30T06:38:46Z", "bug_id": 42284, "creation_time": "2007-04-30T06:38:46Z", "is_private": false, "text": "I can't say I understand your confusion.\n\nYou don't describe how you \"searched for 'order'\". A good place to start would\nhave been\nhttp://httpd.apache.org/docs/2.2/mod/directives.html\n\nI don't see anywhere in those first two URLs that in any way implies that Order\nis part of the Core. You reference the docs for two other directives. The\nAllowOverride directive mentions a bunch of other directives that it controls in\n.htaccess files, including Order (and clicking on Order there would have taken\nyou to the documention describing Order). The <Limit> directive doesn't mention\nOrder at all as far as I can tell.\n\nSo perhaps you can be more specific about exactly what text confused you and\nexactly how you think it should be improved."}, {"count": 2, "tags": [], "creator": "slive@apache.org", "text": "No response from submitter.", "id": 106104, "time": "2007-07-31T12:02:39Z", "bug_id": 42284, "creation_time": "2007-07-31T12:02:39Z", "is_private": false, "attachment_id": null}]