[{"count": 0, "tags": [], "creator": "csad3962@uibk.ac.at", "text": "This patch adds support for chroot. It includes a new configuration directive \nnamed ChangeServerRoot (the name can be changed of course) which accepts On or \nOff whether or not to chroot to the directory specified in ServerRoot. chroot \nis called directly before changing to the non-privileged user.\nI succeeded to use subversion and php5 (including loading shared php \nextensions) with this patch. Everything happened as expected.\nI had to remove the check for an existing DocumentRoot as the DocumentRoot may \nnot exist before chrooting. Additionally the patch will slightly change the \nway paths may be specified. It is necessary to distinguish between files that \nare opened within the child processes (e.g. files to be served to the client) \nand those the root process opens (log files...). The first type of files need \nto be specified as absolute paths.\n\nI am personally not sure why apache supports chroot only by using external \nmodules and I think that chroot is a security feature that is worth to be \nincluded in the core of apache. Using the configuration directive people may \nchoose to use this feature or not. By default, chroot will not used.", "id": 102877, "time": "2007-05-04T18:29:20Z", "bug_id": 42341, "creation_time": "2007-05-04T18:29:20Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "csad3962@uibk.ac.at", "attachment_id": 20134, "id": 102878, "creation_time": "2007-05-04T18:31:27Z", "time": "2007-05-04T18:31:27Z", "bug_id": 42341, "text": "Created attachment 20134\nthe patch", "is_private": false}, {"count": 2, "tags": [], "bug_id": 42341, "attachment_id": null, "id": 109226, "time": "2007-10-11T02:58:06Z", "creator": "mitko@banksoft-bg.com", "creation_time": "2007-10-11T02:58:06Z", "is_private": false, "text": "I use similar patch from version 2.0.50 to 2.2.6 and have no problems.\n"}, {"count": 3, "tags": [], "creator": "nick@webthing.com", "attachment_id": null, "is_private": false, "id": 120460, "time": "2008-09-08T07:53:54Z", "bug_id": 42341, "creation_time": "2008-09-08T07:53:54Z", "text": "\n\n*** This bug has been marked as a duplicate of bug 43596 ***"}]