[{"count": 0, "attachment_id": null, "creator": "artistzz@hotmail.com", "is_private": false, "id": 102874, "time": "2007-05-04T15:38:26Z", "bug_id": 42340, "creation_time": "2007-05-04T15:38:26Z", "tags": [], "text": "Release: Apache HTTP Server 2.2.2-1.2\nOS: Linux 2.6.19 FC5 (Fedora Core 5)\n\nServer to client processing (file serving) fails when accessing files on \nnetwork mounted device files, CIFS or SMBFS.\n\nWhenever a web directory or virtual host is mounted via CIFS (Common Internet \nFile System) Apache fails to serve the files (network transfer) to the client. \n\nUpon accessing standard pages the html apparently transfers but all other file \ntypes fail. Images come up blank. Documents and other binary file \ntypes “appear” to download on index listing access but there is no actual \ntransfer and the files are completely empty with zero size. \n\nThe error log records: (75)Value too large for defined data type: \ncore_output_filter: writing data to the network\n\nApache Server 2.0 (and below) was able to fully access network file shares, \nboth CIFS and SMBFS, and transfer all file type without problems.\n\nThis issue was also submitted by Tim Garton in the mail archives Feb, 14 2006 \n\nhttp://mail-archives.apache.org/mod_mbox/httpd-users/200602.mbox/%\n3C43F24EF0.1080507@hightechhigh.org%3E"}, {"count": 1, "attachment_id": null, "creator": "rpluem@apache.org", "is_private": false, "id": 102875, "time": "2007-05-04T15:56:47Z", "bug_id": 42340, "creation_time": "2007-05-04T15:56:47Z", "tags": [], "text": "This could be a problem with sendfile / mmap on a network filesystem. Please try\nto use\n\nEnableMMAP Off\nEnableSendfile Off\n\nSee also: http://httpd.apache.org/docs/2.2/en/mod/core.html#enablesendfile\nIf this does not solve your problem my next guess is that the LFS support of\nyour CIFS / SMBFS filesystems is broken on your Linux installation since httpd\n2.2.x is compiled with LFS support by default whereas 2.0 is not (and in fact\ncannot).\nIn order to disable LFS support in httpd 2.2 you need to recompile it and add\n--disable-lfs to your configure options. I assume that you run a 32 bit Linux\nand not 64 bit one."}]