[{"count": 0, "tags": [], "creator": "gary.weaver@duke.edu", "text": "Environment:\n\nLinux 2.6.9-42.0.10.ELsmp\nJava 1.5.0_10\nApache Tomcat 5.5.23\nConfluence-2.4.5 (from ear/war distribution w/out source-confluence-2.4.5.tar.gz)\n\nIssue:\n\nIn the directory defined by confluence.home, after running and setting up\nconfluence, there is a directory created on confluence.home called bundled-plugins.\n\nWe accidentally started up tomcat as root instead of the regular user that\ntomcat runs under in our environment. After doing this, we shutdown tomcat,\ncleared the work directory, and reset permissions recursively throughout Tomcat,\nbut we failed to reset permissions recursively in confluence.home, and\nconfluence's <confluence.home>/bundled-plugins directory was set with only read\naccess for the user that runs the tomcat application (basically it was\nincorrectly set as owned by root). When this is the case, it seems to lock up\nthe confluence and tomcat startup process, which is apparent because the AJP13\nport 8009 is not listening and the shutdown port 8005 is not listening after\nstartup. We turned on full debug logging (after trying ajp and coyote debug\nlogging) in tomcat but there was nothing about AJP or any coyote connectors\ntrying to start when this occurs. I imagine that any web application that locks\nup in whatever manner confluence is getting locked up in this particular\nsituation (sorry for the lack of detail) will keep the AJP13 and control ports\nfrom opening in tomcat.\n\nAfter removing all files and directories in confluence.home and restarting\ntomcat, all is fine. Probably resetting permissions on that directory would have\nworked just as well, but we didn't test that.\n\nWe requested to atlassian that they consider adding code to potentially keep\nthis from happening.\n\nSince I found no documentation of this rare situation anywhere, I thought I'd\nlog it as it would appear that a webapp can keep tomcat from starting up\nnormally, and I would think potentially there could be a better way that tomcat\n could insulate itself from similar lock-ups.\n\n(Note: I logged this issue to confluence's support as well, and yes I know that\napps typically don't like having non-standard permissions set in critical\nplaces; just hoping that this info may help make tomcat better or may help\nsomeone else.)\n\n\nThanks!", "id": 103202, "attachment_id": null, "bug_id": 42416, "creation_time": "2007-05-14T12:58:32Z", "time": "2007-05-14T12:58:32Z", "is_private": false}, {"text": "The current code just iterates through the contexts, starting each in turn. If a\ncontext hangs during start, so will Tomcat.\n\nIt is possible to add code to address this but I am not convinced that the cost,\nboth in time to develop and eventual complexity, will be worth it. I am\ntherefore marking this as an enhancement request. If any one fancies developing\na patch for this feature, please attach it to this entry.", "tags": [], "bug_id": 42416, "attachment_id": null, "count": 1, "id": 103208, "time": "2007-05-14T17:37:33Z", "creator": "markt@apache.org", "creation_time": "2007-05-14T17:37:33Z", "is_private": false}, {"count": 2, "tags": [], "text": "No-one was interested.", "attachment_id": null, "id": 144416, "creator": "markt@apache.org", "time": "2011-02-18T12:19:10Z", "bug_id": 42416, "creation_time": "2011-02-18T12:19:10Z", "is_private": false}]