[{"count": 0, "tags": [], "bug_id": 4241, "attachment_id": null, "text": "I used ant to compile an application that needed several jars.\nThe build.xml contained several tasks, but with the same classpath.\nFor a clear code i used a path id:\n  \n<path id=\"libclasspath\" >\n      <pathelement location = \"${lib}/junit.jar\"/>\n      <pathelement location = \"${lib}/xml/jaxp.jar\"/>\n      <pathelement location = \"${lib}/xml/parser.jar\"/>\n      <pathelement location = \"${lib}/mail.jar\"/>\n      <pathelement location = \"${lib}/activation.jar\"/>\n</path>\n\nAll the tasks look like this:\n\n    <javac srcdir=\"${src}\" destdir=\"${build.classes}\" >\n        <exclude name=\"**/CVS/*\"/>\n        <classpath>\n            <path refid=\"libclasspath\"/>\n        </classpath>\n    </javac>\n\nAfterwards, i wanted to use macrame to take the jars directly from cvs\nAll the jars are taken and placed with full path in the contrib directory and\nthen taken from there\n\nEverything looked ok, but then i noticed that when i was deleting the contrib\ndirectory, the build faild. It faild before executing any task because the paths\nfrom the path id did not exist. \n\nI modified the build.xml so that it did not use path  id and it worked.\n\n It seems that before executing any tasks, ant first verifies that all paths\nwith id exist, and fails if they dont exist already. i can write a task that\ncreates the contrib directory, but the path verification is done before all\ntasks.\n\n This is a problem with macrame. The macrame is supposed to create the contrib\ndir and place all the modules there, but i can not write the tasks classpath\nwith path id, because directories are verified to exist before macrame creates\nde contrib directory.\n\n Is it possible to solve the problem? Is it a good solution for paths with id to\nbe verified when used?", "id": 6803, "time": "2001-10-17T12:19:51Z", "creator": "rodica_balasa@yahoo.com", "creation_time": "2001-10-17T12:19:51Z", "is_private": false}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "text": "Ant will check the directories as soon as the <path> gets defined.  If you place\nit outside of any targets, that means it will happen before any tasks get\nexecuted.\nStarting with Ant 1.4 you can define a <path> inside a <target> - just place the\ndefinition after the JARs have been placed into the contrib directory and it\nshould work.", "id": 6832, "time": "2001-10-18T07:53:50Z", "bug_id": 4241, "creation_time": "2001-10-18T07:53:50Z", "is_private": false, "attachment_id": null}]