[{"count": 0, "tags": [], "bug_id": 42425, "attachment_id": null, "is_private": false, "id": 103235, "time": "2007-05-15T09:25:43Z", "creator": "sridhar.basam@gmail.com", "creation_time": "2007-05-15T09:25:43Z", "text": "Here is the relevant output from diff of the 2.2.3 from the 2.2.4 version of\nmod_cache.c\n\ndiff httpd-2.2.3/modules/cache/mod_cache.c httpd-2.2.4/modules/cache/mod_cache.c\n\n428a431,435\n>     else if (exp != APR_DATE_BAD && exp < r->request_time)\n>     {\n>         /* if a Expires header is in the past, don't cache it */\n>         reason = \"Expires header already expired, not cacheable\";\n>     }\n\nThe above check is comparing the the expires time from the server (in second\ngranularity) to the request_time from the client ( upto micro second\ngranularity). Even though we have all of our hosts running NTP, it is possible\nto get a very small skew which is enough to cause this check to pass and the\nobject ends up not getting put into local cache.\n\nWe have a workaround by commenting out the above code, but i don't believe this\ncheck is needed when you have an explicit expires or Cache-Control header from\nthe server.\n\nregards,\n         Sridhar"}, {"count": 1, "tags": [], "bug_id": 42425, "attachment_id": null, "is_private": false, "id": 103241, "time": "2007-05-15T13:08:54Z", "creator": "rpluem@apache.org", "creation_time": "2007-05-15T13:08:54Z", "text": "I do not get your problem here. Caching is only denied if there is an Expires\nheader and if the time mentioned in the Expires header is earlier then the\nrequest time. If this comparison becomes true only due to the different\ngranularity of the times measured (which can happen) this means that the\ndifference between the time in the Expires header and the request time is less\nthan a second. So there is a very short period of time (less than a second)\nduring which this entity (if it is cached) would be regarded as fresh and thus\ndeliverable to the client from the cache without further revalidation. So what\nis the point in having cached objects that are that short lived?"}, {"count": 2, "attachment_id": null, "bug_id": 42425, "text": "\nSome of the content we server is required to have an expires \"now\" or max-age=0\nor must-revalidate to guarantee freshness.\n\nWithout this check, the origin sees IMS requests from the cache a vast majority\nof the time so isn't being taxed that much. \n\nWith the additional check, the edge does a lot more unconditional GET requests\nto the origin taxing the origin resources a lot more.\n\nregards,\n          Sridhar", "id": 103244, "time": "2007-05-15T13:47:45Z", "creator": "sridhar.basam@gmail.com", "creation_time": "2007-05-15T13:47:45Z", "tags": [], "is_private": false}]