[{"count": 0, "tags": [], "bug_id": 42449, "text": "We have found in production that the JNDIRealm can get to a point where\nNullPointerExeception's are thrown by Sun's LDAP provider for JNDI, and no user\ncan log in. It seems that Sun's LDAP provider holds onto its SSL connection to\nour Novell LDAP server, even after it throws a NullPointerException. \n\nThe JNDIRealm does not catch NullPointerExceptions, so it does not close the\nJNDI context or retry. However, we have found that if we change the two catch\nclauses in the \"authenticate(String username, String credentials)\" method to\ncatch Exception (which includes NullPointerException), then the problem goes away.\n\nTomcat 6.0.13:\n811:            } catch (CommunicationException e) {\n835:        } catch (NamingException e) {\n\nOur hack:\n811:            } catch (Exception e) {\n835:        } catch (Exception e) {\n\nThe only drawback we have found in changing the first catch clause to Exception\nis that all exceptions cause a retry, including incorrect username/password\nattempts. It might be possible to avoid these unnecessary retries by checking\nfor AuthenticationException. Another approach might be to add an option to\nalways the close JNDI context before authenticating, if the performance is\nacceptable. \n\nAt the very least, changing the outer catch clause to Exception means that after\nthe LDAP connection goes bad, only the first user to try logging in will see an\nerror. Subsequent login attempt should succeed because the outer catch clause\nwill catch the NullPointerException from the first failed login attempt and\nclose the JNDI context.\n\nNOTE: we use the \"Bind mode\" option of JNDIRealm, and we have been using JDK\n1.5.0_06 on Red Hat Enterprise Linux 4.", "id": 103316, "time": "2007-05-17T13:52:04Z", "creator": "nvick@capcollege.bc.ca", "creation_time": "2007-05-17T13:52:04Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 42449, "is_private": false, "text": "fixed with\nCommitted revision 539907.\n\nthanks!", "id": 103387, "time": "2007-05-20T11:33:43Z", "creator": "funkman@joedog.org", "creation_time": "2007-05-20T11:33:43Z", "attachment_id": null}]