[{"count": 0, "tags": [], "bug_id": 42487, "attachment_id": null, "text": "Using the Batik-Animation-Support I found a strange behaviour with some \nanimations. Let them animate a more or less great time, the animation stops and \nthen restarts again after a few minutes.\nI use animations that trigger themselves in a circle, so that there is an \ninfinite loop of (two or three different) animations. Let this animation after \n20 to 60 Minutes the animation will stop. Waiting further about 5 to 10 Minutes \nthe animation will start again.\n\nPerhaps this behaviour has something to do with rounding-operations, so that \nthe calculation-results run out of limits from time to time. However, this is \nonly a suggestion. I don't now, if it's the real cause.\n\nThe URL references a message in the batik-users-list (2007-04-25), where I \nposted a small test-application that shows this behaviour. Perhaps you can use \nthis, to find a solution for this problem.", "id": 103473, "time": "2007-05-22T00:39:41Z", "creator": "florian.pepping@wincor-nixdorf.com", "creation_time": "2007-05-22T00:39:41Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 42487, "text": "Created attachment 20238\nTest-Application to reproduce this bug", "id": 103474, "time": "2007-05-22T00:40:54Z", "creator": "florian.pepping@wincor-nixdorf.com", "creation_time": "2007-05-22T00:40:54Z", "is_private": false, "attachment_id": 20238}, {"count": 2, "tags": [], "bug_id": 42487, "attachment_id": 22908, "id": 122689, "time": "2008-11-21T03:26:17Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-11-21T03:26:17Z", "is_private": false, "text": "Created attachment 22908\nStripped down test case\n\nI've analyzed the application and didn't found any relevant stuff in the programmatic part, so I'm attaching the SVG file only. One is now able to open directly using Squiggle. ;-)"}, {"count": 3, "tags": [], "creator": "helder.magalhaes@gmail.com", "attachment_id": null, "id": 122691, "creation_time": "2008-11-21T04:00:57Z", "time": "2008-11-21T04:00:57Z", "bug_id": 42487, "text": "(In reply to comment #0)\n> Let this animation after 20 to 60 Minutes the animation will stop.\n> Waiting further about 5 to 10 Minutes the animation will start again.\n\nIn my particular environment, I'm not being able to reproduce. I recall a couple of recent animation-related fixes which may have helped fixing this one. Are you still able to reproduce it (using the trunk version [1]) or can this be marked fixed?\n\n\n> Perhaps this behaviour has something to do with rounding-operations, so that \n> the calculation-results run out of limits from time to time. However, this is \n> only a suggestion.\n\nThis sounds reasonable. Perhaps this could be a platform-specific issue possibly caused by a JVM bug (which may have been fixed in recent Java versions)?\n\n\nVersion details:\nBatik (Squiggle) - 1.8pre (revision 719560)\nJava - Sun JRE 1.6.0_10\nOperating system - Windows XP SP3\n\n\n[1] http://xmlgraphics.apache.org/batik/download.cgi#Subversion+repository", "is_private": false}, {"count": 4, "tags": [], "bug_id": 42487, "text": "Currently, I'm not able to reproduce this bug, too.\nI've tested it with several different environments; however the animations are always correct.\nFurthermore, the problem with animations leaving fragments seems to be solved too. (I've had a discussion with Andreas Neumann and Thomas DeWeese in January this year)\n\nSo from my point of view you can mark this bug as fixed.\n\nThanks for the investigation you took in this bug.\n", "id": 122708, "time": "2008-11-21T06:56:28Z", "creator": "florian.pepping@wincor-nixdorf.com", "creation_time": "2008-11-21T06:56:28Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 42487, "text": "(In reply to comment #4)\n> Furthermore, the problem with animations leaving fragments seems to be solved\n> too. (I've had a discussion with Andreas Neumann and Thomas DeWeese in January\n> this year)\n\nYeah, some fixes were recently made in trunk version (recent changes which seem relevant within this scope: revision 711768, revision 711768 and possibly revision 713617). :-)\n\n\n> So from my point of view you can mark this bug as fixed.\n\nCool, marking as fixed until proved otherwise.\n\n\n> Thanks for the investigation you took in this bug.\n\nCredit goes to Cameron and Thomas who fixed or help fixing the issue(s). ;-)", "id": 122709, "time": "2008-11-21T07:29:30Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-11-21T07:29:30Z", "is_private": false, "attachment_id": null}]