[{"count": 0, "tags": [], "bug_id": 42498, "text": "Found 2 cases that cause internal server errors to be returned and the error in \nthe log file\n[LDAP: ldap_simple_bind_s() failed][Unavailable]\n\nIf you do a refresh in either case all is well for awhile.\n\nCase 1:  If the user is idle for 10 minutes, the next page request results in \nthe error.  Do a page refresh, all is well until the next idle time exceeds 10 \nminutes.\n\nCase 2:  Most if not all new users to this application get the error upon first \nlogin.  Do a refresh it is fine.  And most logins in after that are fine.\n\nClarification:  I am actually using mod_authnz_ldap [not available in the \ncomponent pulldown]\n\nI am specifying the directives in a location tag in http.conf.  I did not \nspecify any mod_ldap directives for cache, left to the defaults.\n\nUsing Basic Authentication with the browser providing the login challenge.\n\nMost of the time having to do a refresh is confusing and just a nusiance.  But \nif the form takes longer than 10 minutes to fill out because of interruptions, \nit fails.  Less than happy campers at that point.\n\nI would like to stay with 2.2.x and not back down to 2.0.x and switch to muquit \nldap like they have done on other apps here.", "id": 103561, "time": "2007-05-23T09:39:49Z", "creator": "ron.cozad@toro.com", "creation_time": "2007-05-23T09:39:49Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 42498, "is_private": false, "text": "I found additional information from our infrastructure team.  I was not going \ndirectly against the Sun One Directories.  I was going against an F5 load \nbalancer.  Further it was configured as \"observer-member\", which means it was \nnot supporting persistent connections.\n\nFor now I am by-passing the F5 and going directly to the Sun Ones and mod_ldap \nis working very well.\n\nWe will be putting a persistence profile into the F5 for LDAP connections and \ncheck if mod_ldap is fine.\n\nI will leave it to you whether it is a bug that mod_ldap connection pool \nmisbehaved with a F5 load balancer without persistence.  If you say no, then \nclose.  If you say yes I will be glad to help you test a solution.", "id": 103628, "time": "2007-05-24T07:59:13Z", "creator": "ron.cozad@toro.com", "creation_time": "2007-05-24T07:59:13Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "trawick@apache.org", "text": "sounds like a defect independent of your specific configuration; if an ldap\noperation is attempted on an old connection and we find that the connection is\nbroken, we must clean it up and try a new connection; only if the new connection\nfailed would the user receive an error", "id": 103645, "time": "2007-05-24T10:57:12Z", "bug_id": 42498, "creation_time": "2007-05-24T10:57:12Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 42498, "text": "Yes, bug 39095 is also about this very issue.", "id": 103687, "attachment_id": null, "creator": "moz@liebesgedichte.siteware.ch", "creation_time": "2007-05-25T11:07:06Z", "time": "2007-05-25T11:07:06Z", "is_private": false}, {"count": 4, "tags": [], "text": "39095 (apparently the same problem) has been fixed in 2.2.8, can this bug be closed?", "is_private": false, "bug_id": 42498, "id": 121644, "time": "2008-10-16T13:14:26Z", "creator": "poirier@pobox.com", "creation_time": "2008-10-16T13:14:26Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 42498, "attachment_id": null, "text": "no feedback, assuming it was a dup as identified\n\n*** This bug has been marked as a duplicate of bug 39095 ***", "id": 127338, "time": "2009-05-23T14:56:19Z", "creator": "covener@gmail.com", "creation_time": "2009-05-23T14:56:19Z", "is_private": false}]