[{"count": 0, "tags": [], "creator": "ladadadada@hotmail.com", "is_private": false, "id": 103612, "attachment_id": null, "bug_id": 42508, "creation_time": "2007-05-24T05:25:06Z", "time": "2007-05-24T05:25:06Z", "text": "While developing a new site we had a Location directive similar to the one below:\n  <Location />\n        Order deny,allow\n        Deny from all\n\n        Allow from 10.20.30.\n        Allow from 140.211.11.4/32\n        Allow from 140.211.11.130/32\n\n        # Allow from the W3C validator\n        Allow from 128.30.52.13/32\n  </Location>\n\nDuring this time we saw that most requests in the log files for IP addresses not\non that list were returning 403 errors but occasionally Apache would return a 200.\nWe verified that it was actually returning the requested page and not a logging\nerror by using anonymous web proxies.  Most received 403 errors but some\ndisplayed the page.\n\nThe problem isn't consistent for a particular IP address.  We saw the Google bot\ncrawling the site from a single IP address.  Most of the time it would receive\n403 errors but occasionally it would receive the page it was requesting.\n\nIt's also not consistent for a particular file.  Of the 117 requests for\nrobots.txt that the Google bot has made over the last two months, only three\nwere returned as 200, the rest were 403.\n\nReturn codes and their counts for all files and all IP addresses apart from the\nIP addresses in the Location directive are:\n  139 304\n 1172 302\n 1193 200\n20142 403\n\nLet me know if you would like any more information to help find this bug."}, {"count": 1, "attachment_id": null, "bug_id": 42508, "is_private": false, "id": 103618, "time": "2007-05-24T05:53:46Z", "creator": "nick@webthing.com", "creation_time": "2007-05-24T05:53:46Z", "tags": [], "text": "Use of <Location> for local contents is NOT recommended, because it WILL confuse\nyou.  The problem you describe is likely to be due to it interacting with\nanother container in a manner you don't expect.\n\nThe other possible explanation is that you're using mod_cache, which is known\nnot to work with host-based access restrictions."}, {"count": 2, "attachment_id": null, "bug_id": 42508, "is_private": false, "id": 103625, "time": "2007-05-24T07:15:39Z", "creator": "ladadadada@hotmail.com", "creation_time": "2007-05-24T07:15:39Z", "tags": [], "text": "Thanks for the info, I hadn't noticed that in the Apache2 documentation before.\n\nIt still seems like a bug but it's a bug in mod_cache rather than the Apache Core.\nI have changed the component to be mod_cache and I'll have a look around again\nto make sure it's not a duplicate of another bug.\n\nIn case someone with the same problem finds this bug we are planning on working\naround this bug using mod_rewrite for whole sites that shouldn't be accessed and\nCacheDisable for paths that shouldn't be accessed."}, {"count": 3, "tags": [], "text": "hello,\n\nI had the same problem, but it seems to be the behavior of mod_cache, as\ndescribe in http://issues.apache.org/bugzilla/show_bug.cgi?id=36937\n\n\"Content is stored in and retrieved from the cache using URI based keys. Content\nwith access protection is not cached.\"\ntaken from apache documentation: http://httpd.apache.org/docs/2.2/mod/mod_cache.html", "is_private": false, "id": 103897, "creator": "wfelipe@gmail.com", "time": "2007-05-31T14:06:58Z", "bug_id": 42508, "creation_time": "2007-05-31T14:06:58Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of 36937 ***", "id": 108767, "time": "2007-09-28T10:21:57Z", "bug_id": 42508, "creation_time": "2007-09-28T10:21:57Z", "is_private": false}]