[{"count": 0, "tags": [], "bug_id": 42555, "text": "Hi !\n\nI've taken some minutes to collect the different\ntranslation/internationalization errors for the french language in the GUI.\n\nHere is a list of those I've found and some times, there is even a proposed\ncorrection:\n - On the HTTP proxy server component's page, the \"grouper\" listbox contains and\nentry with the word \"spérateurs\" instead of \"séparateurs\"\n - On the same page, the \"Set Keep-Alive\" checkbox is untranslated. It can be\n\"Connexion persistante\" and even in english, for non techies, it may become\n\"Persistent connection\"\n - The HTTP Request Defaults page's title is \"Requête HTTP Request par défaut\"\n(which is wrong) and should be \"Paramètres de requête HTTP par défaut\" or at\nleast \"Paramètres HTTP par défaut\"\n - On the same page, the checkbox in the bottom called \"Récupérer toutes les\nresources incluses dans les fichiers HTML\", the word \"resources\" has not been\ntranslated and should be \"ressources\" (notice the number of 's')\n - All the listeners's pages contain the \"Erreurs log seulement\" checkbox which\nshould be \"Journaliser les erreurs uniquement\" or, shorter, \"Journaliser erreurs\nuniquement\"\n - On the ThreadGroup page, called \"Groupe de Thread\" should be translated into\n\"Groupe de fils d'exécution\" or, please, at least, add an 's' to Thread ! ;-)\n - The word Thread is used in the french translation in a lot of places but\nshould be translated as \"fil d'exécution\" in singular or \"fils d'exécution\" in\nplural form.\n - On the TestPlan page, the area for classpath management contains\n   - an untranslated label \"Add directory or jar to classpath\" which should\nbecome \"Ajouter un répertoire ou un fichier 'jar' au 'classpath'\". The quotes\nshould remain as thoses word shouldn't be translated.\n   - the \"library\" listbox should be called \"Bibliothèques\"\n - On the page \"Voir l'arbre des Résultats\" (\"View results tree\" in english) in\nthe \"response data\" tab, the following errors are present:\n   - the tab's title should be \"Données réponse\" instead of \"Donnée réponse\"\n   - the radio button in the bottom should be translated which would become:\n     - \"Show text\" -> \"Afficher comme texte brut\"\n     - \"Render HTML\" -> \"Afficher comme page web\"\n     - \"Render XML\" -> \"Afficher comme XML\"\n     - \"Download embedded resources\" -> \"Télécharger toutes les ressources\nincluses\" (but this one is a checkbox not a radio button)\n - In the \"Options\" menu\n     - \"Language\" submenu:\n        - the title is translated as \"Langage\" which is a subtile mistake and\nshould be \"Langue\" instead\n        - \"Chinese (simplified)\" -> \"Chinois (simplifié)\"\n        - \"Chinese (traditional)\" -> \"Chinois (traditionel)\"\n        - \"Spanish\" -> \"Espagnol\"\n - In the \"Lancer\"/\"Run\" menu:\n     - Inconsistency between the noun and the verb forms : \"Démarrer\" and\n\"Démarrage Distant\", the verbal form should be used as recommended by standard\nHuman Computer Interface guidelines (KDE, Gnome, Apple, Microsoft).\n     - Entry \"Démarrage Distante\" is mispelled as it should be \"Démarrage\nDistant\" (note the missing 'e'), idem for \"Démarrage Distante de tous\"\n\n \nThe use of camel case (first letter in upper case) for french nouns is\nincorrect. It is a german syntactic rule, not a french one. The GUI is full of\nthis kind of error, so I don't report each occurence here. Remember: only the\nvery first letter may be in upper case.\n\nLots of thanks for improving the application !", "id": 103865, "time": "2007-05-31T02:57:37Z", "creator": "michel.nolard@gmail.com", "creation_time": "2007-05-31T02:57:37Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "sebb@apache.org", "text": "Thanks.\n\nCould you perhaps update the properties file (or provide a patch)?\n\nThe existing file is the file messages_fr.properties which can be found in:\n\nhttp://svn.apache.org/repos/asf/jakarta/jmeter/branches/rel-2-\n2/src/core/org/apache/jmeter/resources/", "id": 103905, "time": "2007-05-31T15:18:54Z", "bug_id": 42555, "creation_time": "2007-05-31T15:18:54Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 42555, "text": "Ok, I'll try to look at this file.\n\nWhat's the tool to you use to generate those translation files ? I hope this is\nnot full hand work as the work would become _very_ error prone.\n", "id": 103948, "time": "2007-06-01T01:23:35Z", "creator": "michel.nolard@gmail.com", "creation_time": "2007-06-01T01:23:35Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 42555, "text": "I'm afraid it is largely manual work. \nJava demands that the file must be in ASCII, so accents are represented by \nunicode escapes - but it's not too difficult to work out which is which.\n\nThere is a tool that may help, see:\nhttp://jakarta.apache.org/jmeter/localising/index.html\n(Ignore the bits about CVS - they are out of date)\n\nIf you get completely stuck with the accents, just leave the accents in the \nfile, and I can fix those later.", "id": 103950, "time": "2007-06-01T02:35:30Z", "creator": "sebb@apache.org", "creation_time": "2007-06-01T02:35:30Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 42555, "text": "Ok, I have it.\n\nNow, what I need is some free time to actually do it :) I'll try this when my\ncurrent task will be completed.\n\nHave a great week-end !\n", "id": 103961, "time": "2007-06-01T05:49:33Z", "creator": "michel.nolard@gmail.com", "creation_time": "2007-06-01T05:49:33Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "text": "Fixed in SVN r588392", "is_private": false, "bug_id": 42555, "id": 109756, "time": "2007-10-25T16:40:17Z", "creator": "sebb@apache.org", "creation_time": "2007-10-25T16:40:17Z", "attachment_id": null}]