[{"count": 0, "tags": [], "bug_id": 42593, "attachment_id": null, "text": "This has to be a major problem, mod-jk appears severely-broken on win32.\n\nI installed apache 2.2, configured modjk, setup AJP13 to forward to\ntomcat5.5.23/20 to say the /docs app on tomcat, so http://myhost/docs goes to\ntomcat.\n\nIdeally, the content would server and the cpu usage would drop to zero-ish. \nWhat I noticed is that the content serves up ok but then the TOMCAT process\nsails up to 100%.  Kill the apache process and tomcat returns to normal. \nRestart apache and repeat with same results.\n\nI found this on the 5.5.23 release, and verified on 5.5.20.  I tried to fiddle\nwith modjk but couldn't figure out how to load the modules in dll form.\n\nAnyhow, I loaded up Tomcat6 and lo, the bug is gone.\n\nThis has taken me half a day to figure out, hopefully there is enough for y'all\nto go on!", "id": 104097, "time": "2007-06-05T13:37:36Z", "creator": "javahollic@gmail.com", "creation_time": "2007-06-05T13:37:36Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 42593, "attachment_id": null, "id": 104419, "time": "2007-06-14T16:48:51Z", "creator": "markt@apache.org", "creation_time": "2007-06-14T16:48:51Z", "is_private": false, "text": "Unfortunately not. This works for me on WinXP SP2, httpd 2.2.4, mod_jk built a\nfew days ago from svn and the latest 5.5.x from svn.\n\nIs there something in your set-up you didn't mention? Did you use the native\nconnector for Tomcat? If so, did you use the same version for TC5 and TC6?"}, {"attachment_id": null, "tags": [], "creator": "diperis@mail.fujitsu.es", "is_private": false, "count": 2, "id": 110486, "time": "2007-11-13T08:40:40Z", "bug_id": 42593, "creation_time": "2007-11-13T08:40:40Z", "text": "Hi we have a similar problem,\nOur configuration is Tomcat 5.5.20 Apache 2.2.3 open ssl compiled and Windows\n2003 enterprise edition. The jvm is 1.5.0_10 \n\nThe tomcat5.exe proccess cpu usage grows up to 100% into a few days from its start.\n\nIt happens using -server java option or whitout it. with tc-native 1.1.10 or\nwhitout it. on w2k3 with sp1 and sp2\n\n\nWe have the same configuration on several Windows XP and is workng alright "}]