[{"attachment_id": null, "tags": [], "bug_id": 42615, "text": "The default apache index page is installed in the current location:\n\n/var/www/apache2-default/index.html\n\nOn my system the content of this file is:\n\n<html><body><h1>It works!</h1></body></html>\n\nAlso, this file has no trailing newline which is malformed.\n\nThe default apache site should be informative with pointers to documentation,\nnot a childish one line statement such as this. It looks highly unprofessional.\n\nI appreciate why the original page was removed - because too many people were\ncontacting Apache about sites which had nothing to do with them, but there has\nto be an alternative to this. Even a 404 message would be better than this.\n\nSee https://bugs.launchpad.net/ubuntu/+source/apache2/+bug/89364", "count": 0, "id": 104188, "time": "2007-06-08T04:11:16Z", "creator": "nslater@gmail.com", "creation_time": "2007-06-08T04:11:16Z", "is_private": false}, {"count": 1, "tags": [], "creator": "slive@apache.org", "text": "I don't agree with \"unprofessional\". I certainly agree it is \"uninformative\",\nbut the site administrator can get the information they need from other\nlocations in the distribution. And anyone seeing this page who is not a site\nadministrator will not be helped by any amount of information we put there.\n\nI'm curious about the \"malformed\" bit. Is there a spec saying that there needs\nto be a trailing newline on html files? In any case, I don't see how it is\nnegatively affecting anybody.\n\nAs far as the content, we have tried every reasonable alternative for the\ncontent of this page, including having text written by professional tech\nwriters. We still get more confused (and often abusive) messages than we care to\ndeal with. If you have suggestions, I'd be pleased to hear them.\n\nI don't believe that omitting the page entirely is an improvement, since that\ngives even less information to admins, gets hidden by MSIE's \"friendly\" error\nmessages, and doesn't provide an example of a page that can be easily replaced\nwith real content.\n\nFinally, since this was originally a Ubuntu bug, I should point out that Ubuntu\nis free to put whatever they want in the default index.html. Many third-party\ndistributors replace that page with their own info. But we'd request that any\ncontact information point towards the distributor, and not apache.", "id": 104300, "time": "2007-06-11T10:57:24Z", "bug_id": 42615, "creation_time": "2007-06-11T10:57:24Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "nslater@gmail.com", "is_private": false, "text": "How about:\n\n<h1>Your website has not been configured yet.</h1>\n\n<p>Contact the site administrator who will tell you how to start adding content\nto your website.</p>\n\nAs for the newline issue - this is required by POSIX standards.\n\nGoogle for \"end with newline\" for examples...", "id": 104302, "time": "2007-06-11T11:15:37Z", "bug_id": 42615, "creation_time": "2007-06-11T11:15:37Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 42615, "is_private": false, "count": 3, "id": 104304, "time": "2007-06-11T11:53:56Z", "creator": "slive@apache.org", "creation_time": "2007-06-11T11:53:56Z", "text": "I can imagine three types of people who may be reading this message:\n\n1. Person installing apache.\n2. Person responsible for a website after its installation.\n3. Random web surfer stumbling on unconfigured server.\n\nYour text helps only number 2, and the amount of help it really provides is\nminimal (approaching zero). Minimal may be better than nothing. Except that I\nbelieve this text will hurt person number 3. They will be more confused by this\nmessage than they would be by the simple \"it worked\" (which can't confuse very\nmuch because it is completely undecipherable for number 3). Some of the more\nclueless ones will start yelling in every direction that they never asked for\nany d*mn website.\n\n(Another problem with putting some text there just to look more \"professional\"\nis that we will soon have people wanting to translate it to their native\nlanguage. We wound up spending way too much time dealing with translations of\nthe old page, especially considering this is something that, in an ideal world,\nwill only be seen once.)\n\nBelieve it or not, a lot of thought has gone into this over the years.\n\nFinally, on the newline issue, it appears to me that newlines are required for\nseveral specific file formats (including plain text) but not for html. But I\nguess we could consider them a \"best practice\". I'll go add one to trunk."}, {"count": 4, "tags": [], "creator": "basant.kukreja@sun.com", "attachment_id": null, "id": 104317, "time": "2007-06-11T14:35:16Z", "bug_id": 42615, "creation_time": "2007-06-11T14:35:16Z", "is_private": false, "text": "Adding new line character will certainly help some developers like me. When I\nuse curl to get the index.html (using curl --dump-header - -o - http://host/),\nI get the \"Shell Prompt\" in the same line (after it works). It was annoying so\nI keep adding new line in my index.html.\n\nThanks for considering it to add a new line character in default index.html.\n"}]