[{"count": 0, "tags": [], "bug_id": 42623, "attachment_id": null, "id": 104241, "time": "2007-06-08T17:13:13Z", "creator": "john.cameron@orcsoftware.com", "creation_time": "2007-06-08T17:13:13Z", "is_private": false, "text": "We cannot use log4j in applications where XML namespaces need to be enabled.\n\nThe exception as shown below is thrown.\n\nWhile there may be ways of changing the application to code around this (eg by\nhaving multiple DocumentBuilderFactory's) this is very inconvenient.\n\nThe problem is the use of the colon (:) in the name \"log4j:configuration\" in the\n log4j.dtd file. It would be preferable to use underscore or some other character.\n\nSample exception:\n\nERROR configuration.ConfigurationInXml: load() Exceptionjava.lang.Exception:\nProblem parsing XML: org.xml.sax.SAXParseException: A colon is not allowed in\nthe name 'log4j:configuration' when namespaces are enabled.\njava.lang.Exception: Problem parsing XML: org.xml.sax.SAXParseException: A colon\nis not allowed in the name 'log4j:configuration' when namespaces are enabled."}, {"count": 1, "tags": [], "bug_id": 42623, "attachment_id": null, "id": 104246, "time": "2007-06-08T18:00:16Z", "creator": "carnold@apache.org", "creation_time": "2007-06-08T18:00:16Z", "is_private": false, "text": "Quite a few things seem a little odd.  First, I'll acknowledge that the use of namespaces in the log4j \nconfiguration is atypical, but that predates my involvement with log4j.  At this point in the lifecycle of \nlog4j 1.2, changing the configuration file format is not an option.\n\nYou mention than an exception is thrown.  Any non-fatal errors detected by the XML parser on a call to \nDOMConfigure.configure() should result in a message to the console but would not stop processing \n(see org.apache.log4j.xml.SAXErrorHandler and the catch block in \no.a.l.xml.DOMConfigurator.doConfigure(ParseAction...).  If the parser was either correctly or incorrectly \nidentifying a validation error, log4j should ignore it and continues processing.\n\nYour sample output suggests that it is coming from some code other than log4j reading a log4j \nconfiguration file.  I see no place in the log4j code where \"ConfigurationInXml\" appears.\n\nThere are several XML parsers that could be used and they can slightly vary in their interpretation of the \nXML recommendations, particularly in atypical cases.  If you could identify the parser in use that would \nbe very helpful if it is a parser bug.  The value returned by DocumentBuilderFactory.newInstance\n().getClass().toString() would probably be enough to at least identify the parser family.\n\nTo take this further, I think we need to see an sample app including your configuration file, a \ndescription of your expected and actual behavior, and the JVM (vendor, version and platform).  Please \nbe clear whether the log4j method is raising an exception to the caller or if an exception is raised and \ncaught within log4j."}, {"count": 2, "tags": [], "bug_id": 42623, "attachment_id": null, "id": 104250, "time": "2007-06-08T18:53:22Z", "creator": "john.cameron@orcsoftware.com", "creation_time": "2007-06-08T18:53:22Z", "is_private": false, "text": "Thanks for the quick response.\n\nWe have our own configuration XML for our product, which can optionally contain\nLog4J configuration information. We validate all configuration using DTD files,\nand include the log4j.dtd for validating the log4j part of the configuration.\nIf configuration does not validate, we abort processing (with an appropriate\nerror message).\n\nIf it is not an option to change configuration file format (which I understand)\nI don't think that there is anything that can be done. So I am happy to close\nthe issue.\nI thought it was worth raising because some time in the future it would\nobviously make a lot of sense to adopt the standard way of doing namespaces in XML.\n\nBy the way, the parser was xalan-j_2_7_0 and Java 1.4, running on Windows XP.\nHowever, I suspect the same error would be generated using later versions of\nJava under different OS's.\n\nThanks again for your quick response.\n\n"}]