[{"count": 0, "tags": [], "creator": "sergeyfd@gmail.com", "text": "Core Apache module provides LimitRequestBody option to limit request body. \nThat works well with HTTP protocol but doesn't work with HTTPS. That happens \nbecause mod_ssl does not support this option and instead has it's own hard \ncoded limit. The limit is set to 128K in ssl_engine_io.c:\n\n/* 128K maximum buffer size by default. */\n#ifndef SSL_MAX_IO_BUFFER\n#define SSL_MAX_IO_BUFFER (128 * 1024)\n#endif\n\n....\n\n       /* Fail if this exceeds the maximum buffer size. */\n        if (total > SSL_MAX_IO_BUFFER) {\n            ap_log_rerror(APLOG_MARK, APLOG_ERR, 0, r,\n                          \"request body exceeds maximum size for SSL buffer\");\n            return HTTP_REQUEST_ENTITY_TOO_LARGE;\n        }\n\nThat leads to two problems:\n\n1. Inability to submit POST requests bigger than 128K\n2. Inability to lower that limit to something smaller than 128K\n\nIdeal solution for this problem would implementing suport for LimitRequestBody \nin mod_ssl or providing an alternative SSLLimitRequestBody option.", "id": 104268, "attachment_id": null, "bug_id": 42625, "creation_time": "2007-06-09T18:00:52Z", "time": "2007-06-09T18:00:52Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 42625, "text": "\n\n*** This bug has been marked as a duplicate of 12355 ***", "id": 104273, "time": "2007-06-10T03:02:22Z", "creator": "rpluem@apache.org", "creation_time": "2007-06-10T03:02:22Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "sergeyfd@gmail.com", "text": "I'm absolutely disagree that this is a duplicate for 12355. In fact it has\nnothing to do with this problem, besides that they both related to mod_ssl of\ncourse.\n\nThe code that I quoted is still in 2.2.4 version of Apache and it's still\nimpossible to control limits for HTTPS requests body. If I'm wrong please tell\nme how I can submit posts greater than 128K using Apache 2.2.4 or how I can\nlimit such requests to 64K.", "id": 104276, "time": "2007-06-10T06:04:55Z", "bug_id": 42625, "creation_time": "2007-06-10T06:04:55Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 42625, "attachment_id": null, "is_private": false, "id": 104277, "time": "2007-06-10T10:30:23Z", "creator": "rpluem@apache.org", "creation_time": "2007-06-10T10:30:23Z", "text": "You can do this with LimitRequestBody as long as no SSL renegotiation is needed\nfor your request (e.g. due to SSLrequire used in a Directory / Location context)\nand even then you can use LimitRequestBody to limit what is being sent to your\napplication (cgi script, whatever). If the request body is larger than what you\nset via LimitRequestBody but smaller than 128k, mod_ssl will consume the whole\nbody and the error checking for LimitRequestBody will bail out later. If the\nrequest body is larger than 128k then mod_ssl will bail out regardless what is\nset for LimitRequestBody. As said this is only true in the case that a SSL\nrenegotiation is needed. So the only limit that remains is that you cannot have\nrequest bodies larger than 128k if an SSL renegotiation is needed for your\nrequest and this is what is left from the original PR12355. Before the patch for\nPR12355 was applied no request body at all was possible with such renegotiated\nrequests and now it can be up to 128k. Nevertheless many people complained\nafterwards that this size is not configurable and that 128k is not enough for\ntheir application. Please see PR12355 for further details. As far as I remember\nthere were some proposals how to avoid renegotiation in such cases.\nTo cut a long story short:\nIf your request needs SSL renegotiation, then you are affected from what is left\nof PR12355 and if not it is highly likely that it is a misconfiguration on your\nside since the LimitRequestBody check in the HTTP_INPUT filter knows nothing\nabout SSL. In this case please try using exactly the same configuration for SSL\nand non SSL and post both (SSL/non SSL) configurations here if it still does not\nwork. "}, {"count": 4, "tags": [], "bug_id": 42625, "attachment_id": null, "is_private": false, "id": 104281, "time": "2007-06-10T18:47:26Z", "creator": "sergeyfd@gmail.com", "creation_time": "2007-06-10T18:47:26Z", "text": "Thank you very much for a such detailed explanation.\n\n*** This bug has been marked as a duplicate of 12355 ***"}]