[{"text": "After restarting Apache Tomcat Windows service in Windows 2000, it can serve \nfirst html page. But after serving first servlet or jsp by clicking any link in sample \npage, Apache Tomcat service hangs and cannot do anything further. All I have to \ndo is to restart it.\n\nUnlike NT/2000 service, The standalone application works fine.", "tags": [], "bug_id": 4263, "attachment_id": null, "count": 0, "id": 6819, "time": "2001-10-18T02:13:11Z", "creator": "paramai@paramai.com", "creation_time": "2001-10-18T02:13:11Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 4263, "attachment_id": null, "text": "Are you sure the first page you see wasn't served by your browser's cache ?\nI use the Tomcat as a sys service (installed through the installer) with Win2k \n(SP2) / JDK 1.3.1, and it works ok.\nPlease check the stdout.log. If it's empty then it's bad. If Tomcat did indeed \nstart, some of the other log files should contain some kind of error message.", "id": 6837, "time": "2001-10-18T09:13:51Z", "creator": "remm@apache.org", "creation_time": "2001-10-18T09:13:51Z", "is_private": false}, {"count": 2, "tags": [], "creator": "paramai@paramai.com", "text": "Dear Remy,\nI follow your step. Clear cache on my browser. I think you may right, the first page \nmay come from browser cache. So, this time... I cannot call even first page... \nhttp://localhost:8080 I change port to ensure that other application may not \noccupy port 8080. But it still does not work. To make sure that it is not my \nmachine problem. I install Tomcat on Windows XP build 2600 Professional. This \ntime it shows the message\n\"Microsoft Visual C++ Runtime Library\nRuntime Error!\nProgram: C:\\Program Files\\Apache Tomcat 4.0\\bin\\tomcat.exe\nThis application has requested the Runtime to terminate it in an unusual way.\nPlease contact the application's support team for more information.\"\nSo, I think it has the same problem with Windows 2000 Advanced Server.\nThe stderr.log is completely empty, the other log seems to have normal message.\nIs there any steps should I try?", "id": 6868, "time": "2001-10-18T21:06:48Z", "bug_id": 4263, "creation_time": "2001-10-18T21:06:48Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 4263, "attachment_id": null, "text": "I don't know if the XP error means anything interesting. Probably not.\n\nThe problem seems to be that for some reason the JVM doesn't start.\nI'm afraid the only way to guarantee that the service setup would succeed all \nthe time would to do a lot of checks on the detected VM (and allow the user to \nmanually select one), which isn't easy to do with the current installer.\nIt's still easier than installing it manually, but your mileage may vary\nThe installer depends on the registry keys set by the installer of the Sun JDK. \nSo if you move the JDK around, it won't work. I wish the JDK/JRE would behave a \nbit more like a Windows program ... (or that NSIS would allow accessing \nsomething other than the registry easily).\n\nYou can try to check in the registry that the service registration info is \ncorrect (and modify it if it isn't).\nHKLM/SYSTEM/CurrentControlSet/Services/Apache Tomcat/Parameters\nThe value of 'JVM Library' must be something meaningful on your system.\n\nLike all the other installer bugs, this looks like a non-fixable JDK/JRE \nconfiguration problem. So WONTFIX in this current installer.", "id": 6870, "time": "2001-10-18T22:05:59Z", "creator": "remm@apache.org", "creation_time": "2001-10-18T22:05:59Z", "is_private": false}]