[{"count": 0, "tags": [], "creator": "christian.schneider@hrz.uni-dortmund.de", "text": "I run a multi-config installation of the apache-2.2.4 in one place, meaning:\nFor our installation I build several httpds with different settings \nfor the suexec-wrapper and place them in one base directory.\n \nThe first installation is a very complex one involving php as fast-cgi and other\nspecial features. This installation is a complete one, using \"configure\",\n\"make\", \"make install\" and it is put into the following base directory:\n/sw/rs_aix52/httpd-2.2.4 .\n\nFor the second installation I also use the typical \"configure\" and \"make\" \nafter removing the old build-files with \"make clean\" and \"rm config.cache\".\nExcept from the suexec-parameters and the name of the httpd-binary the \nconfigure-command is the same as the first one. \nThe installation step of the second run only consists of installing the \nhttpd-binary the suexec-binary and the mod_suexec-module under the base \ndirectory: /sw/rs_aix52/httpd-2.2.4 (in sbin and libexec).\n\nA third installation is done similar to the second one, giving other \nsuexec-parameters.\n\nRunning the new installation and calling the server-info page on the second \nhttpd I was totally confused as the output said that the suexec-wrapper run \nfor the second installation is similar to the suexec-wrapper for the first\ninstallation I built.\n\nAfter several compile sessions I took a look at the mod_suexec source-directory.\nGrepping for the suexec-binary I found out that the mod_info-output for the \nsuexec-parameters is hard-coded during build-time.\n\nThe httpd -V output of the second httpd is correct - it shows the right suexec-bin. \nSo I presume the second httpd uses the right (wanted) suexec-wrapper,\nbut the hard-coded output of the mod_info-module is wrong.\nPlease, can you acknowledge my presumption...\n\nAnd as an enhancement, would it be possible to use the \"live\" httpd -V output\nfor the suexec-parameters to avoid confusion?\n\nRegards \n\n\n    Christian", "id": 104293, "time": "2007-06-11T06:27:57Z", "bug_id": 42633, "creation_time": "2007-06-11T06:27:57Z", "is_private": false, "attachment_id": null}]