[{"count": 0, "tags": [], "bug_id": 42659, "text": "If I make a programming error in the script in the BeanShellAssertion, then I\nsee a message like this in the Assertion listener :\nBeanShell Assertion : org.apache.jorphan.util.JMeterException: Error invoking\nbsh method: eval\n\nIt would be nice if I could get the message from the beanshell interpreter, like\nthis :\nBeanShell Assertion : org.apache.jorphan.util.JMeterException: Error invoking\nbsh method: eval\tParse error at line 1, column 10.  Encountered: ==\n\nI see in the BeanShellInterpreter code that the message from the interpreter is\nincluded in the log file, but it would be nice to have in the GUI too.", "id": 104394, "time": "2007-06-14T05:11:19Z", "creator": "alf@i100.no", "creation_time": "2007-06-14T05:11:19Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "alf@i100.no", "text": "Created attachment 20346\nSuggested patch\n\nSuggested patch to use the same message for the exception thrown as is sent to\nthe log file. The GUI will display the exception text, at least for beanshell\nassertions. I haven't found any listener or anything that will show exceptions\nfrom BeanShellPreProcessor or BeanShellPostProcessor.\n\nThe patch also restructures the code slightly, to avoid duplicating the code\nfor calling and handling errors from the beanshell interpreter.\nNote that I have only tested this code minimally, but it looks correct to me.", "id": 104395, "time": "2007-06-14T05:16:40Z", "bug_id": 42659, "creation_time": "2007-06-14T05:16:40Z", "is_private": false, "attachment_id": 20346}, {"count": 2, "tags": [], "bug_id": 42659, "text": "Good catch - I've applied the patch in SVN r547286.\n\nI made a few more changes - I removed all the intermediate bshinvoke() calls \nso the public methods now call bshinvoke() directly.", "id": 104407, "time": "2007-06-14T08:43:03Z", "creator": "sebb@apache.org", "creation_time": "2007-06-14T08:43:03Z", "is_private": false, "attachment_id": null}]