[{"count": 0, "tags": [], "bug_id": 42660, "attachment_id": null, "id": 104396, "time": "2007-06-14T05:45:31Z", "creator": "alf@i100.no", "creation_time": "2007-06-14T05:45:31Z", "is_private": false, "text": "Currently, the BeanShellPreProcessor, BeanShellPostProcessor, BeanShellSampler\nand BeanShellAssertion all try to call the \"testStarted\", \"testEnded\",\n\"threadStarted\", and \"threadFinished\" beanshell methods.\n\nI think that by default, most people will not implement these methods, and if\nthey do, it will be in files that they include using the properties in the\njmeter properties file, for example the\nbeanshell.sampler.init=BeanShellSampler.bshrc property.\n\nTo avoid filling the debug log with messages about missing beanshell methods,\nand to avoid an exception always being thrown in those four classes whenever\n\"testStarted\", \"testEnded\", \"threadStarted\", and \"threadFinished\" occurs, I\nsuggest to add another property to the jmeter properties file, to control\nwhether those four classes should try to call the \"testStarted\" etc methods.\n\nSo I suggest a property a'la beanshell.call_event_methods= true or false, and\nfalse in the default jmeter properties file, and that the four BeanShell*\nclasses are changed to use that property wisely.\n\nI was also wondering if the four BeanShell* classes in their \"init\" methods\ncould figure out which of the \"testEnded\", \"testStarted\" etc method are\nimplemented in the file being sent to the BeanShellInterpreter. Then the classes\ncould call only those methods it knows are present. But I guess that will be\nquite difficult to do, therefore I suggest just using a property."}, {"count": 1, "text": "Created attachment 20367\nSuggested patch\n\nFrom what I understand, the methods called by the \"testStarted\", \"testEnded\"\netc in the various BeanShellAssertion, BeanShellPreProcessor etc have to be\ndefined in the init file specified for the class in the jmeter.properties file.\nThis means that if the corresponding property for the class is not specified,\nthere is no need to try to call the beanshell \"testStarted\" method.\n\nThe suggested patch adds a check to see if the init file property is defined\nfor the class, and if it is not, then no attempt is made to try to call methods\non testStarted, testEnded etc.", "bug_id": 42660, "is_private": false, "id": 104515, "time": "2007-06-18T23:20:00Z", "creator": "alf@i100.no", "creation_time": "2007-06-18T23:20:00Z", "tags": [], "attachment_id": 20367}, {"count": 2, "text": "Created attachment 20368\nSuggestd patch with larger changes\n\nThis suggested patch also uses the init file setting to decide if there is any\nneed to try to call the \"testStarted\" beanshell methods.\n\nBut this patch makes an abstract class BeanShellTestElement, where all the\ncommon code is put. I think that makes sense, so the code does not have to be\nduplicated in 6 different classes.\n\nThis patch also changes the BeanShellTimer and BeanShellListener, which was not\nchanged in the minimal suggested patch above.", "bug_id": 42660, "is_private": false, "id": 104516, "time": "2007-06-19T00:47:53Z", "creator": "alf@i100.no", "creation_time": "2007-06-19T00:47:53Z", "tags": [], "attachment_id": 20368}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 104642, "time": "2007-06-22T11:19:44Z", "bug_id": 42660, "creation_time": "2007-06-22T11:19:44Z", "is_private": false, "text": "Thanks for the patches.\n\nApplied the 2nd patch (20368) with some minor changes to reduce the number of \ndifferences.\n\nAlso there seemed to be no need to overload the clone() method in the \nBeanShellTestElement class, so I removed it from the subclasses.\n\nThe patch is in SVN r549919.\n\nClosing the bug."}]