[{"count": 0, "tags": [], "text": "This patch includes most of the changes provided in the patch for #42687 and\nadditionally guarantees a unique openssl context per process.\n\n[Disclosure: This patch was produced under contract for nCipher PLC]\n\nThe \"Applications and processes\" rules set out in the pkcs11 standard  [p 17\nPKCS #11 v2.2 6.6.1] require that each process holds a distinct context to the\npkcs11 implementation. mod_ssl has partial support for openssl's ENGINE api and\nthis, in turn, (almost) enables things like opensc's engine_pkcs11[1] to be\nused with apache. The problem is mod_ssl shares a single openssl context across\nall processes and engine_pkcs11 makes no attempt to deal with the fact that it\nis accessed concurrently from different processes. I think it's debatable\nwhether the \"pkc11 multi-process\" issue should be explicitly dealt with in\nmod_ssl or whether the ENGINE implementation should be expected to cope:\nExactly who is \"the application\": mod_ssl, the ENGINE plugin, the vendor\nspecific integration of the two with some hardware/software product ?\n\nI propose that its a \"good thing tm\" if apache can provide an answer. Ideally\none that integrators can choose to enable or disable depending on what else is\nin the software stack. For fully compliant pkcs11 use I think there are two\nways mod_ssl could chose to manage it:\n\nA.) Support a mod of operation where a distinct openssl context is setup for\neach process (bad news for pre-fork).\n\nB.) Find some means to reliably re-load (and reconfigure) the engine instance\nbound to openssl.\n\nThis bug report provides a patch that makes the least changes I could manage in\norder to implement A.) and have it work with the worker mpm. It has been tested\na slightly modified version of engine_pkcs11[2] and forms the basis of apache\nintegration with an HSM enabled product from nCipher PLC[3].\n\nI'll be posting a more general discussion of this patch and the, related, #42687\nto a recent HSM/mod_ssl thread on http-dev. \"Apache2 mod_ssl with HSM support\"\n(started on Tue, 29 May 2007)\n\n[1] https://www.opensc-project.org/engine_pkcs11/\n\n[2] Patches I have applied locally to opensc's engine_pkcs11\n\nhttps://www.opensc-project.org/opensc/ticket/138\nhttps://www.opensc-project.org/opensc/ticket/139\n\n\n[3] http://www.ncipher.com/key_management/9/keyauthority", "attachment_id": null, "id": 104493, "creator": "rbryce@ncipher.com", "time": "2007-06-18T04:53:02Z", "bug_id": 42688, "creation_time": "2007-06-18T04:53:02Z", "is_private": false}, {"count": 1, "text": "Created attachment 20365\nengine managed keys: per process openssl context\n\nOption A.) as described in OP. Applies unconditionally to ANY SSLCryptoDevice.\nNo attempt is made to support IP based vhosts.", "bug_id": 42688, "is_private": false, "id": 104494, "time": "2007-06-18T04:55:35Z", "creator": "rbryce@ncipher.com", "creation_time": "2007-06-18T04:55:35Z", "tags": [], "attachment_id": 20365}]