[{"count": 0, "tags": [], "bug_id": 4279, "attachment_id": null, "id": 6852, "time": "2001-10-18T14:59:33Z", "creator": "greg@visualmining.com", "creation_time": "2001-10-18T14:59:33Z", "is_private": false, "text": "I don't know if I'm duplicating a bug here.  Can't say that I'm understanding\nhow to search on the bug tracker....\n\nThese are the steps I went through to get Tomcat 4.0.1 installed and running on\nmy system:\n\nI installed JDK 2 v1.3.1_01 on my system at c:\\java\\jdk1.3.1_01.  The JRE\nautomatically installed at c:\\program files\\javasoft\\jre\\1.3.1_01.\n\nI then ran the Tomcat 4.0.1 installation package.  It refused to run, telling me\nthat it couldn't find any JDK installed on my system.\n\nI uninstalled 1.3.1, thinking there might be some sort of incompatibility there.\n I installed 1.3.0_04 (c:\\java\\jdk1.3.0_04).  Ran the Tomcat install.  Same\nresult.  Okay.  Weird.\n\nI uninstalled 1.3.0_04 and reinstalled it under c:\\java\\jdk1.3.0.  It still\nautomatically installed the the JRE under c:\\program\nfiles\\javasoft\\jre\\1.3.0_04.  Ran Tomcat installer--success!  It installed\ncompletely.  Now, I tried to run the service.  No success.  Tried to run \"Tomcat\nstart\" program.  No success.  Hmm.\n\nOkay.  I changed the target java executable from the JRE directory to\nc:\\java\\jdk1.3.0\\bin\\java.  Ran \"Tomcat start\".  Hey!  It works!\n\nSo, it appears there is some sort of problem with an underscore in the path. \nSeems kinda bizarre to me, but that's all I could figure out."}, {"count": 1, "tags": [], "bug_id": 4279, "attachment_id": null, "id": 6857, "time": "2001-10-18T16:30:16Z", "creator": "remm@apache.org", "creation_time": "2001-10-18T16:30:16Z", "is_private": false, "text": "With the current installer, all that matters are the registry keys.\n\nNote: I tried to use env variables, but it works even worse, as NSIS doesn't \nhandle that well at all. OTOH, it's very good for manipulating the registry \n(which is ok, since Windows itself encourages registry use, esp on Win9x, where \nenv variables are a nightmare).\n\nSpecifically, these keys must be set (and have a meaningful value):\nHKLM/JavaSoft/Java Runtime Enivronment/CurrentVersion\n.../version_number/RuntimeLib\nHKLM/JavaSoft/Java Development Kit/CurrentVersion\n../version_number/JavaHome\n\nYou can access the registry by running 'regedt32'."}]