[{"count": 0, "tags": [], "creator": "paul@paulgalbraith.net", "is_private": false, "text": "For the WinNT platform, if a batch script is called from the <exec> task\nnormally any batch error codes aren't propagated back to ant from the command\nshell.  This causes a lot of headaches for those who expect or want an \"exit /b\n1\" command to cause ant to fail the build process.  \n\nI've been getting around this by using a very simple batch wrapper when I exec a\nbatch file.  It simply takes the return code from the wrapped batch file and\nexits the shell with the same code.  \n\nI'm thinking that it's not too big of a job to hack the exec task to\nautomatically use a wrapper such as this anytime a \"*.cmd\" or \"*.bat\" is set as\nthe executable on a winnt platform.  \n\nIn the interests of backwards compatibility this would be an option that\ndefaults off, but in the interests of saving traffic on the mail lists, and\nmaking ant do what most people expect out of the box, I'd vote to have this on\nby default...", "id": 105148, "time": "2007-07-06T11:50:50Z", "bug_id": 42828, "creation_time": "2007-07-06T11:50:50Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 42828, "attachment_id": 20469, "id": 105149, "time": "2007-07-06T11:52:59Z", "creator": "paul@paulgalbraith.net", "creation_time": "2007-07-06T11:52:59Z", "is_private": false, "text": "Created attachment 20469\nthis is the wrapper I'm using"}, {"count": 2, "tags": [], "text": "Execution is one of the most troublesome spots of Ant; very brittle against java\nversion changes, and then there are platform issues. Even on the winnt platform,\nyou have 2000, xp, 2003 and vista to deal with, each of whom have subtle\ndifferences in their batch language. \n\nI'd be reluctant to make any changes to how we exec ant stuff, and at the same\ntime, have always found that batch files seem to work right for me (e.g. if you\nexec ant itself, it can pass its error code back)\n\nleaving as open.", "is_private": false, "id": 105201, "creator": "stevel@apache.org", "time": "2007-07-09T03:28:52Z", "bug_id": 42828, "creation_time": "2007-07-09T03:28:52Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "My experience with this is certainly limited to winxp, I don't even know if \nthe \"/b\" option of the exit command is present on any other platform, but the \nwinxp test case is simple.  <exec> a batch file with \"exit /b 1\" (w/ \nfailonerror=true) should, imo, fail the ant build, but in my case it does not.", "is_private": false, "id": 105283, "creator": "paul@paulgalbraith.net", "time": "2007-07-11T04:51:36Z", "bug_id": 42828, "creation_time": "2007-07-11T04:51:36Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "peterreilly@apache.org", "is_private": false, "text": "I am not too sure that I understand this request.\nShould the .cmd or .bat files have this exit /b\ncommand in them if they want to return the status ?\nI do not think that ant should automatically add\nthis (in any case how should one do this?).\nIt may be possible to write an ant task to\nexecute dos/windows batch file (by extending the\n<exec> task).\n", "id": 105659, "time": "2007-07-16T04:09:13Z", "bug_id": 42828, "creation_time": "2007-07-16T04:09:13Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "william.darby@tybrin.com", "attachment_id": null, "text": "In addition to the exit code from the ant.bat file, it appears that the Java invocation of Ant is not always returning non-zero when it reports BUILD FAILED. I have printed the %ERRORLEVEL% immediately after the call to %_JAVACMD% and the result is always 0. I believe this needs to be addressed as part of the fix to this larger issue.", "id": 126028, "time": "2009-04-06T12:40:19Z", "bug_id": 42828, "creation_time": "2009-04-06T12:40:19Z", "is_private": false}]