[{"count": 0, "tags": [], "bug_id": 42841, "is_private": false, "id": 105206, "attachment_id": null, "creator": "Tom.Donovan@acm.org", "creation_time": "2007-07-09T06:44:50Z", "time": "2007-07-09T06:44:50Z", "text": "When a reslist is used to manage a pool of database connections and the database\nserver closes inactive connections after a period of time, apr_reslist_acquire()\nwill return unusable connections which cause an error.\n\nThis is because the database server timeout is a \"hard\" timeout.  Connections\nwhich have been expired by the server cannot be used.  Susceptible databases\ninclude MySQL (per system variable 'wait_timeout'), Oracle (per profile variable\n'IDLE_TIME'), and DB2 (per DB_CONNECTIVITY  parameter 'IDLE_TIMEOUT').\n\nThe APR reslist algorithm presumes that resources (connections) have an\nunlimited lifetime, even if ttl is specified.\n\n\nA proposed patch is attached to change the meaning of two arguments to\napr_reslist_create().  There is no change to the API.  The patch just changes\nthe timeout behavior.  \n\nWith this patch:\n\nttl is now the maximum lifetime of a resource instead of a timer to reduce idle\nconnections to smax.\n\nsmax is now the maximum number of idle resources (including both expired and\nun-expired) instead of the minimum.\n\nThe patch changes the behavior of apr_reslist_acquire():\n\nIt will never return an expired resource.\n\nIf there are one or more idle expired resources - the oldest one is destroyed\nand a new (replacement) resource is returned instead.\n    \nThe patch also changes the behavior of reslist_maint() which is called by\napr_reslist_release()\n\nThe number of idle resources in the list is always reduced to smax.  Excess idle\nresources no longer linger for ttl.\n    \nThe definitions of hmax and min remain unchanged:\n\nhmax is still the maximum number of resources, including all idle and in-use\nresources.\n\nmin is still the minimum number of idle resources - unless creating a new\nresource will cause hmax to be exceeded, which can happen when the number of\nin-use resources + min > hmax."}, {"count": 1, "tags": [], "bug_id": 42841, "attachment_id": 20479, "is_private": false, "id": 105207, "time": "2007-07-09T06:48:44Z", "creator": "Tom.Donovan@acm.org", "creation_time": "2007-07-09T06:48:44Z", "text": "Created attachment 20479\nPatch to apr_reslist.h/apr_reslist.c\n\nPatch to apr-util trunk for apr_reslist timeout behavior.\nChanges the interpretation of the 'ttl' and 'smax' arguments to\napr_reslist_create()"}, {"count": 2, "tags": [], "bug_id": 42841, "is_private": false, "id": 116447, "attachment_id": null, "creator": "nick@webthing.com", "creation_time": "2008-05-10T12:52:33Z", "time": "2008-05-10T12:52:33Z", "text": "I like the idea of this, but changing the semantics of it may screw up existing apps.  What's really needed is a new API.  But we could also paper over that by using an environment variable to switch between the different semantics (and patching apachectl to set it for HTTPD)."}, {"count": 3, "tags": [], "bug_id": 42841, "attachment_id": null, "is_private": false, "id": 116471, "time": "2008-05-10T21:15:07Z", "creator": "Tom.Donovan@acm.org", "creation_time": "2008-05-10T21:15:07Z", "text": "(In reply to comment #2)\n> I like the idea of this, but changing the semantics of it may screw up existing\n> apps. \n\nAgree, a behavior change like this is appropriate in a major release.  A major APR release (1.3) in an httpd point release (2.2.9) muddies it up a bit.  \n\nAPR 1.3 requires DBD users to change their SQL statements from database-specific parameter markers to the new APR-specified parameter markers - so that might make it a more opportune time to consider additional DBD-related configuration changes.\n"}, {"count": 4, "tags": [], "bug_id": 42841, "attachment_id": null, "text": "fixed r659802", "id": 117178, "time": "2008-05-30T06:54:23Z", "creator": "Tom.Donovan@acm.org", "creation_time": "2008-05-30T06:54:23Z", "is_private": false}]