[{"count": 0, "tags": [], "creator": "shirasaya1@wp.pl", "text": "We have generated pdf files using fop 0.20.5 from xml file given some xsl\nstylesheet, that is pretty complicated(conditions, foreach's). Pdf looks good,\nhas an average 80k. \nProblem is printing. You can see that size of printed pdfs increase to 3 even 7\nmb! Meanwhile we took another document, made by acrobat writer - full of images\ninside, some formatting - and it had only 300k when printing. Why?\nIt had something to do with compression?\nAre there any posiible options to set while transforming fo to pdf?\nthanks,\nPaul", "id": 105281, "time": "2007-07-11T04:32:00Z", "bug_id": 42857, "creation_time": "2007-07-11T04:32:00Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 42857, "text": "This does not appear to be a bug / problem report but a question. Please ask\nquestions on the fop-user mailing list and don't use BugZilla for that purpose.\n\nI also don't understand the question in the first place. Printing doesn't change\nthe size of the PDF. The PDF file still has the same size all the time. Do you\nmean your printer driver when sending the file to the printer sends a large\namount of data to the printer? A printer driver won't send the PDF to the\nprinter but does whatever it needs to do to convert PDF to a format your printer\nunderstands (PCL, Postscript, ...). All this is outside of FOP because as you\nreport the PDF generated by FOP is small and displays fine.\n\nPlease note also that 0.20.5 is obsolete and not supported anymore. Although\nupgrading may not address your printing problem at all.\n", "id": 105282, "time": "2007-07-11T04:45:09Z", "creator": "manuel@apache.org", "creation_time": "2007-07-11T04:45:09Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "(In reply to comment #1)\nThank you for reply.\nIt was a question, indeed, im sorry. But potentially, thing could be caused by\nfop bug, my apologies though.\n \nI meant Acrobat/printer driver sends a large amount of data to the printer. \n>A printer driver won't send the PDF to the\n> printer but does whatever it needs to do to convert PDF to a format your printer\n> understands (PCL, Postscript, ...).\nAgree, but problem is that the thing which is sent to printer has different \nsize, depending on if it is made by fop or not.\nFop's pdf has huge size while other dont. Thats why i think its fop-thing that\nmatters.\nPaul \n \n\n", "is_private": false, "id": 105289, "creator": "shirasaya1@wp.pl", "time": "2007-07-11T05:32:59Z", "bug_id": 42857, "creation_time": "2007-07-11T05:32:59Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 42857, "attachment_id": null, "is_private": false, "id": 156673, "time": "2012-04-01T13:51:11Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:51:11Z", "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs"}]