[{"count": 0, "attachment_id": null, "bug_id": 42897, "text": "We run Apache under modsecurity (and chroot patch before that) in a\nhigher-than-usual security environment, and use mod_ssl with client certificates\nto limit access.\n\nSo the CRL becomes of paramount importance to ensure only valid users can access\nthe area...\n\nAnyway, as it's in a jail, HUPs and USR1 signals don't work as usual - Apache\nfinds all the libraries have disappeared, along with modules, etc. I could move\nthose whole lot into the jail - but it sort of reduces the point of using\nmodsecurity/etc to do the job. So currently I have to do a full restart to get\nApache to notice the CRL has been updated - which breaks existing downloads/etc.\n\nGoogle'ing for \"apache crl reload\" finds there's a few others experiencing the\nsame issue.\n\n\nSo I was wondering about a compromise. Having copies of the updated CRL files in\nthe jail wouldn't be a big problem, so what about putting some form of\nauto-reloading of the CRLs when the files change - like Samba does with it's\nconfig files? Even if it isn't instantaneous it would be a vast improvement.\ne.g. Apache starts, loads the CRL along with a timestamp of when it did it. Then\nif (say) 20 minutes later someone connects with a cert, Apache could decide the\nCRL has timed out, reopens and reloads the CRL files (which in my case will be\ncopies in the jail) and resets the timestamp. That way the CRL stays \"almost\" up\nto date  - and doesn't need any signaling to Apache.", "id": 105428, "time": "2007-07-14T19:57:53Z", "creator": "jhaar@trimble.co.nz", "creation_time": "2007-07-14T19:57:53Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "jorton@redhat.com", "is_private": false, "text": "Working out how to reload CRLs periodically adds a significant amount of\ncomplexity, and also a number of policy issues (what to do if CRL unreadable\netc); for little gain - if you want a \"live\" revocation decision you need\nsomething like OCSP anyway (covered by other bugs).  \n\nGraceful restarts are a sufficient solution for many users; the fact that chroot\njails break that doesn't really make the alternative more compelling.", "id": 110236, "time": "2007-11-05T02:25:50Z", "bug_id": 42897, "creation_time": "2007-11-05T02:25:50Z", "attachment_id": null}]