[{"count": 0, "attachment_id": null, "creator": "nettings@apache.org", "text": "i just found out the hard way that our authorizers are by no means interchangeable.\nthe PolicyAuthorizer has the side effect of storing the list of roles of the\nrequesting identity in the Request object.\nthe UsecaseAuthorizer depends on that list being there. that means not only that\nwe can't easily chuck out the policy authorizer, it also implies that the\nauthorizers have to be configured in a specific order.\n\nthis is wrong imho. the roles saving should be factored out somewhere.", "id": 106401, "time": "2007-08-06T10:51:02Z", "bug_id": 43049, "creation_time": "2007-08-06T10:51:02Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": null, "creator": "andreas@apache.org", "text": "I don't know how this could be changed - the roles depend on the policies, and\nthe usecase authorization depends on the roles. I guess this order has to be\npreserved unless we fundamentally change the authorization concept.", "id": 106472, "time": "2007-08-08T02:23:22Z", "bug_id": 43049, "creation_time": "2007-08-08T02:23:22Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "creator": "nettings@apache.org", "is_private": false, "id": 106477, "time": "2007-08-08T03:43:30Z", "bug_id": 43049, "creation_time": "2007-08-08T03:43:30Z", "tags": [], "text": "(In reply to comment #1)\n> I don't know how this could be changed - the roles depend on the policies, and\n> the usecase authorization depends on the roles. I guess this order has to be\n> preserved unless we fundamentally change the authorization concept.\n\nthe dependency is not what i'm haggling about. if two components implement the\nsame service and they are even user-configurable, they should be totally\ninterchangeable and not have any side-effects or rely on other components' side\neffects. but your suggestiong regarding bug 42952 covers this well, i think.\ni'm marking this as a duplicate for now...\n\n*** This bug has been marked as a duplicate of 42952 ***"}]