[{"count": 0, "tags": [], "bug_id": 43068, "is_private": false, "text": "Chainsaw currently doesn't maintain the selected line in the log panel when\napplying a filter, even if the selected line passes the filter expression. It\nselects some other line which is not relevant. Fixing this will help the user to\nsee whether the selected line is in the filtered output or not.", "id": 106513, "time": "2007-08-08T20:14:35Z", "creator": "isurues@gmail.com", "creation_time": "2007-08-08T20:14:35Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "isurues@gmail.com", "attachment_id": 20619, "is_private": false, "id": 106514, "time": "2007-08-08T20:16:29Z", "bug_id": 43068, "creation_time": "2007-08-08T20:16:29Z", "text": "Created attachment 20619\nFixing line selection at filtering\n\nIn this patch I have fixed the bug and now it maintains the selected line in\nthe log panel if the selected line passes the filter expression. And also if\nthe selected line is not included in the new filtered set of log events (in\ncase of it is not passed), the last event is selected every time and it's\ndetails are displayed in the 'event detail' panel."}, {"count": 2, "tags": [], "bug_id": 43068, "is_private": false, "text": "I applied this patch locally and tested it, but it didn't quite work.\n\nI ran the 'generator' from the tutorial and would occasionally get multiple rows\nselected, and attempts to select a different row jumped back to the\npreviously-selected row.\n\nAlso, it'd be nice if the selection didn't 'jump' back to the last selected row.\n\nI'll look into it and see if I can give some suggestions code-wise.", "id": 106566, "time": "2007-08-09T21:30:17Z", "creator": "sdeboy@iname.com", "creation_time": "2007-08-09T21:30:17Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 43068, "text": "Created attachment 20654\nImproving the line selection fix\n\nI reviewed this fix again and made some adjustments. Previous patch had a bug\nwhen the user completely removes the filter after applying a filter (This mean\nthe filter text == \"\" situation). It was not selecting the event which was\nselected with the filter on. I have fixed it in this patch.\nI checked the fix with the generators in the tutorial. But it generates events\ncontinuously and even if we select a particular event, it selects the last\nevent as new events come in. Because of that, we can't see the results even if\nthe fix works fine. So to check the fix I think we have to stop the generator\nfor a while and select a particular event and then play with it by applying\ndifferent filters. When I checked it that way, the fix works fine and it\nmaintains the selected line. I didn't come to a situation where it selects\nmultiple lines.\nActually the bug was due to only remembering the index in the table between\nfilters. So if the selected line is the index 5 in the table, it was\nmaintaining this index even if the filters are applied. As this index is not\nrelated to the events, different event IDs was fitting to that index in the\ntable. That's why it was selecting rows without any relevance. In my fix I have\nremembered the event ID of the selected event and that ID is selected after the\nfilter, if that ID is in the filtered result. If not the last event is\nselected.\nSo that behavior of coming to the previously selected event even after 2 or 3\nfilters was due to above mentioned behavior and now it is fixed. I had missed\nthe scenario of coming back to the empty filter situation after a filter, in\nthe previous patch and it is fixed in this new patch.\nCheck it again and please comment if it doesn't behave as expected or if there\nare more modifications to be done.", "id": 106686, "time": "2007-08-13T02:26:44Z", "creator": "isurues@gmail.com", "creation_time": "2007-08-13T02:26:44Z", "is_private": false, "attachment_id": 20654}, {"count": 4, "text": "(In reply to comment #2)\n\n> Also, it'd be nice if the selection didn't 'jump' back to the last selected row.\n> \n\nThis is an existing bug though, it's been broken for a while, but honestly I\ncan't work out why.  If Isuru did work it out I'd love it if it was fixed, but I\nthink it's separate to this specific issue.", "bug_id": 43068, "is_private": false, "id": 106952, "time": "2007-08-20T18:14:39Z", "creator": "psmith@apache.org", "creation_time": "2007-08-20T18:14:39Z", "tags": [], "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 43068, "is_private": false, "text": "It seems like there is already logic to deal with the temporary bypass of scroll\nto bottom being disabled because the bottom line is not selected: via the\nbypassScrollFind field.\n\nIdeally, if the 'scroll to bottom' feature was enabled, a find would\n-temporarily- disable it, as would a selection of a row other than the bottom row.\n\nThen, if the bottom row was again selected (for example, via ctrl-end), scroll\nto bottom would again behave as expected.\n\nI experimented with updating the bypassscrollfind field and it worked relatively\nwell, but we'd need to update the bypass flag on the swing event dispatch thread\nand make sure we check it before we programmatically scroll.\n", "id": 106955, "time": "2007-08-20T21:26:41Z", "creator": "sdeboy@iname.com", "creation_time": "2007-08-20T21:26:41Z", "attachment_id": null}, {"count": 6, "tags": [], "creator": "thorbjoern@gmail.com", "attachment_id": null, "text": "I noticed in the source that some changes regarding the \"scroll to bottom\" issue had been commited.\n\nIs this still an issue in ChainSaw or has it been fixed?  Does the patch attached fix the issue, or does it have problems?", "id": 118211, "time": "2008-07-02T17:10:37Z", "bug_id": 43068, "creation_time": "2008-07-02T17:10:37Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 43068, "text": "The scroll to bottom logic is improved on trunk (not yet released).", "id": 118217, "time": "2008-07-02T18:12:48Z", "creator": "sdeboy@iname.com", "creation_time": "2008-07-02T18:12:48Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "creator": "psmith@apache.org", "attachment_id": null, "text": "I've been using the latest trunk version of Chainsaw, and the scroll to bottom seems to work well for me, so marking this as fixed.\n\nScott, if there's any other objection or noted problems, then we can reopen this one.", "id": 118219, "time": "2008-07-02T18:31:05Z", "bug_id": 43068, "creation_time": "2008-07-02T18:31:05Z", "is_private": false}]