[{"count": 0, "tags": [], "creator": "bjoern@syltonline.de", "text": "The ocumentation sais that the newer jks recognize changes in the config-files \nand reload theyr configuration automatically. On our jk1.2.21, this works fine \nfor uriworkermap.properties, but not for workers.properties.\nIn the jk-manager, there is also no option to reload them manually as it was \nin JK2.\nThis was our only way to drain a aqpplication worker from all webserver-farms.", "id": 106529, "time": "2007-08-09T06:37:11Z", "bug_id": 43072, "creation_time": "2007-08-09T06:37:11Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "Could you please point out the exact documentation page and text you refer to,\nso we can clarify?\n\nCorrect would be: it does automatically detect changes to the uriworker map, but\nit does not detect changes to workers.properties.\n\nYou can change many config items dynamically in the status worker, but you\ncannot persist the changes without editing the config files in parallel.", "bug_id": 43072, "attachment_id": null, "id": 106532, "time": "2007-08-09T06:59:58Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2007-08-09T06:59:58Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "I read it in the Changelogs. But you are right, only uriworkermap.properties \nis mentioned. In JK2, they were in the same file as the workers.properties, so \nwe assumed both file-autoreloads had been ported from JK2 to 1. I think it was \nmentioned that all major funktions of JK2 would be backported.\n\nThere is no way to change settings like disableing a worker in the jk-manager \nfor big IIS farms. We got 30 Webs on a 3 node cluster, and 3 likewise \nclusters. All run in different application pools, so no shared mem there to \ntransport changes. That would mean, we would have to configure nearly 300 jk-\nmanager - just to drain one node. And not even that is possible because the jk-\nmanager shouldn't be enabled on unsecured webs with IIS (Anonymous, non-https).\n\nA global deployment of workers.properties on the other hand is verry simple.\n\nBut I understand now that this is no bug but a feature request, right?", "attachment_id": null, "bug_id": 43072, "id": 106536, "time": "2007-08-09T08:13:04Z", "creator": "bjoern@syltonline.de", "creation_time": "2007-08-09T08:13:04Z", "is_private": false}, {"count": 3, "text": "Yes, not a bug, and I'm pretty sure this will not come in 1.2.x.\n\nI changed to \"Later\", so we might consider at least partial solutions for JK3,\nwhich is the project name for the next development branch, which is in a *very*\nearly stage.\n", "bug_id": 43072, "attachment_id": null, "id": 106538, "time": "2007-08-09T08:46:17Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2007-08-09T08:46:17Z", "tags": [], "is_private": false}]