[{"count": 0, "tags": [], "bug_id": 43128, "text": "I have a problem with using mod_rewrite and mod_vhost_alias working together.\n\nmod_rewrite is using some code to get document root. Obviously it get proper \nroot from mod_alias or mod_userdir but from mod_vhost_alias it does not. When \nyou use mod_rewrite and mod_vhost_alias together mod_rewrite gets the document \nroot as the global document root for the server which is not correct\n\nThis is the comment from mod_rewrite where it expects to get document root.\n/*\n             * Hack because of underpowered API: passing the current\n             * rewritten filename through to other URL-to-filename handlers\n             * just as it were the requested URL. This is to enable\n             * post-processing by mod_alias, etc.  which always act on\n             * r->uri! The difference here is: We do not try to\n             * add the document root\n             */\n\nI think mod_vhost_alias should return the correct document root here.", "id": 106779, "time": "2007-08-14T23:58:22Z", "creator": "marko.hrastovec@hal.si", "creation_time": "2007-08-14T23:58:22Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 43128, "is_private": false, "id": 106781, "time": "2007-08-15T05:03:20Z", "creator": "rbowen@apache.org", "creation_time": "2007-08-15T05:03:20Z", "tags": [], "text": "This is the same issue as mentioned in 26052.\n\n*** This bug has been marked as a duplicate of 26052 ***"}, {"count": 2, "tags": [], "text": "I actually doubt this person is reporting the same thing as bug 26052. But he\nhasn't showed us at all what he is trying to do with mod_rewrite and\nmod_vhost_alias and exactly what isn't working. Perhaps he isn't using the PT\nflag for mod_rewrite.\n\nBut in any case:\n1. Using mod_vhost_alias and mod_rewrite together is not generally recommended.\nmod_vhost_alias is essentially just a simplified, restricted version of\nmod_rewrite. If you need mod_rewrite anyway, you should just do all your\nrewriting there.\n2. You should address your question to a user-support forum like the\nusers@httpd.apache.org mailing list, being sure to provide details on your\nconfiguration and exactly what isn't working.", "is_private": false, "bug_id": 43128, "id": 106791, "time": "2007-08-15T07:44:51Z", "creator": "slive@apache.org", "creation_time": "2007-08-15T07:44:51Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 43128, "text": "I can not agree that I shouldn't use mod_vhost_alias and mod_rewrite together.\n\nI will try to explain why I would like both features in the same VirtualHost \nand why I think they should be used together.\n\nWe are using rewrite rules on PHP sites to simulate user friendly urls. We \nhave many developers who are programming the same site maintained by \nsubversion. Every programmer checks out the site to her/his home directory. If \nwe put \"*.hostname IN A x.x.x.x\" in the DNS server, every programmer could \nhave accessed his copy of the site via http://<username>.hostname.local/ just \nby following the rule to check out the site to proper directoy. \nVirtualDocumentRoot would enable every programmer to see his own copy. Rewrite \nrules would enable every programmer to simulate exactly the same behavior for \nuser friendly URLs as on the main site.\n\nSince mod_vhost_alias and mod_rewrite don't work together I have to invent \nsome additional rules to simulate VirtualDocumentRoot along with rewrite rules \nwhich are already present. That way I have to have some very special rewrite \nrules applicable only for development copies and have to take special care \nthat rules on the production server will work to. If I could use directives \nfrom both modules it would be much easier. That does not provide the \nfunctionality to have the same configuration on development and production \nservers. This is always potential problem for compatibility.\n\nHere is the example of the VirtualHost I was trying to setup. It is IP based \nvirtual hosting:\n<VirtualHost x.x.x.x>\n        VirtualDocumentRoot /home/%1/phpprojects/hostname/\n        ServerName hostname\n        CookieTracking on\n\n        AddType application/x-httpd-php .php\n        CustomLog logs/hostname.local.hal.si-combined_log combined\n\n        RewriteEngine on\n        RewriteRule  ^/attachment/ /attachment.php [NC,L]\n\n        RewriteCond %{REQUEST_URI} ^(?!/images/).*               [NC]\n        RewriteCond %{REQUEST_URI} ^(?!/img/).*                  [NC]\n        RewriteCond %{REQUEST_URI} ^(?!/script/).*               [NC]\n        RewriteCond %{REQUEST_URI} ^(?!/rss/).*                  [NC]\n        RewriteCond %{QUERY_STRING} (.*)                         [NC]\n\n        RewriteRule ^/(.*?)(/(\\d+))?$ /index.php?ID=$3&url=$1&%1 [NC,L]\n<VirtualHost>\n\nI also don't think that the bug is the same as bug 26052. The bug 26052 says \nthat DOCUMENT_ROOT environment variable was not set. In the case I am talking \nabout not just the environment variable but also the document root itself is \nnot set properly.\n\nPossible workarounds I see now are to make a VirtualHost for every developer \non the site with fixed DocumentRoot and rewrite rules as they will be on the \nproduction site. The second option is to make additional rewrite rules which \nare not going to be applied on the production server. The third option is my \nfavorite and that is to use mod_vhost_alias and mod_rewrite together.\n\nI will not change the status to \"Reopen bug\" because I am not the expert on \nApache source code and design. I am just the user. After you consider my \narguments do what ever you are pleased. I know I would be very pleased if I \ncould use both modules together and in my case I can't see any reason why they \nshouldn't be. If you discard this bug I will probably take a look at the \nsource and change it myself. It will take me much longer as would someone who \nis familiar with the code.", "id": 106799, "time": "2007-08-15T13:22:48Z", "creator": "marko.hrastovec@hal.si", "creation_time": "2007-08-15T13:22:48Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "I am very sorry I have bothered you with my problems. I thought I knew \nmod_rewrite pretty well. Well it has obviously been a while since I was \nfamiliar enough with this module. PT options on RewriteRule seems to be the \nright solution.\n\nI am sorry again.", "is_private": false, "bug_id": 43128, "id": 106806, "time": "2007-08-15T14:11:37Z", "creator": "marko.hrastovec@hal.si", "creation_time": "2007-08-15T14:11:37Z", "attachment_id": null}]