[{"count": 0, "tags": [], "bug_id": 43339, "attachment_id": null, "text": "A comment placed in the section\n<Service name=\"Tomcat-Standalone\">\nof the server.xml config file contained a german Umlaut (like in \"Diese\nÄnderungen können\"). This caused the server to refuse to start up - the service\nwas stopped as soon as it was started, reporting \"The Java Virtual Machine has\nexited with a code of 1, the service is being stopped.\" to the Windows event\nlog. The comment was inserted just before\n<Connector className=\"org.apache.catalina.connector.http.HttpConnector\"\n\nWorkaround: Dont use umlauts.\n\nFix: Inside comments, everything should be ignored except --> (dash dash greater\nthan)\n\nThis bug is very annoying, as the user gets no information about what causes the\n error, not even something like \"error in config\".", "id": 107961, "time": "2007-09-10T06:08:31Z", "creator": "jan.schejbal@peiker.de", "creation_time": "2007-09-10T06:08:31Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 43339, "text": "server.xml is an XML file. If you break it by adding characters to it not\nencoded in the default UTF-8 encoding without declaring the encoding used, every\nstandards-compliant XML-parser will refuse to process it. So does Tomcat's XML\nparser.\nIf there's any error on Tomcat's side, it's the missing XML-declaration at the\nstart of server.xml. But that isn't of relevance here (and I didn't bother to\ncheck whether this has changed with the current version of the 4.1.x branch).\n\nSo, the \"fix\" is to have an UTF-8-encoded server.xml or to declare the encoding\nused if it's different from UTF-8 (the default for an XML file without an\nexplicit declaration of the encoding).", "count": 1, "id": 107964, "time": "2007-09-10T07:13:37Z", "creator": "bugzilla@schoenhaber.de", "creation_time": "2007-09-10T07:13:37Z", "is_private": false}, {"count": 2, "tags": [], "text": "OK, I thought that inside comments ANYTHING (including binary garbage) is to be\nignored until the comment end tag. This seems not to be the case, so it is ok\nthat the config was not accepted (although it would probably be more\nuser-friendly to just skip wrong comment content even if it is not required).\n\nBut there is still the problem that no senseful error message is given to the\nuser (at least I did not find any). I am leaving this bug at \"resolved invalid\"\nbecause I am not sure if this is considered a bug and if it is, probably a new\nbug report should be opened. ", "is_private": false, "id": 107968, "creation_time": "2007-09-10T07:51:47Z", "time": "2007-09-10T07:51:47Z", "creator": "jan.schejbal@peiker.de", "bug_id": 43339, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 43339, "is_private": false, "text": "> OK, I thought that inside comments ANYTHING (including binary garbage) is to\n> be\n> ignored until the comment end tag. This seems not to be the case, so it is ok\n> that the config was not accepted (although it would probably be more\n> user-friendly to just skip wrong comment content even if it is not required).\n\nYou still didn't get the point: it's a *requirement* for a XML-parser to abort\nprocessing when an error (including what you call \"binary garbage\") is\nencountered. Whether or not the error is inside a comment or not is completely\nirrelevant. The fact that you added non-UTF-8 characters without declaring the\nencoding used, broke server.xml. In fact, it isn't even an XML file anymore,\nafter that change.\nAgain: this is a matter of how XML and XML-parsers work, not a matter of a\nchoice made by Tomcat. If you want to find out more, read the XML specs.\n\n> But there is still the problem that no senseful error message is given to the\n> user (at least I did not find any). I am leaving this bug at \"resolved\n> invalid\" because I am not sure if this is considered a bug and if it is,\n> probably a new bug report should be opened.\n\nI do get a senseful error message right on the console if I start Tomcat by\ncatalina.bat run\nChances are, you'll also find a message if you look into Tomcat's logs.", "id": 107969, "time": "2007-09-10T08:25:40Z", "creator": "bugzilla@schoenhaber.de", "creation_time": "2007-09-10T08:25:40Z", "attachment_id": null}]