[{"count": 0, "tags": [], "text": "use case:\nthe dependency graph is fairly long and consumes quite some time to execute all\nsteps.\nespecially when testing it occurs that not all tasks in the chain need to be run.\n\nit seems that others the same problem solving it with rather clumsy workarounds.\n\nhttp://mail-archives.apache.org/mod_mbox/ant-user/200703.mbox/%3C00a501c76ac6$34e043d0$3a20a8c0@isabelteam.be%3E\n\ncommand line options to handle this would be great, like:\n--skip <target list>\nRESULT: execution is normal except for those targets in the list. these are\nskipped, meaning that their tasks arent executed, but their dependencies are\nstilled honored and followed up.\n\n--stopat <target list>\nRESULT: when the dependency graph is created it wont follow any dependencies of\nthe named targets.\n\n--nodepends <target list>\nRESULT: only the given targets would be executed in the given order\n\n--newtarget <target list>\nRESULT: creates a new empty target with the given targets as the depends value.\nthe idea be hind this is: although you can execute several targets from the\ncommand line in one go, the dependency graph is fully executed for each, causing\nunneeded duplicate execution due to overlap\n\ni realize that with a good build file design this options are not needed as\nmuch, but you are not always in control of the build file or dont have the time\nto rewrite/change it.", "attachment_id": null, "id": 108246, "creator": "dev.tom.menzel@gmx.net", "time": "2007-09-16T16:17:24Z", "bug_id": 43404, "creation_time": "2007-09-16T16:17:24Z", "is_private": false}, {"count": 1, "tags": [], "creator": "dev.tom.menzel@gmx.net", "attachment_id": null, "text": "fixed bug props", "id": 108247, "time": "2007-09-16T16:18:35Z", "bug_id": 43404, "creation_time": "2007-09-16T16:18:35Z", "is_private": false}, {"count": 2, "tags": [], "text": "You'd probably want to do this by implementing a custom Executor (defined in package \norg.apache.tools.ant .  You could use Ant properties to drive the various settings you've suggested.  In fact  \nyour --nodepends suggestion is already provided in the form of the IgnoreDependenciesExecutor, and -\nnewtarget in the SingleCheckExecutor.  These are provided in org.apache.tools.ant.helper .  Use the \nant.executor.class property to specify the executor to use.", "attachment_id": null, "id": 108574, "creator": "mbenson@apache.org", "time": "2007-09-25T07:21:15Z", "bug_id": 43404, "creation_time": "2007-09-25T07:21:15Z", "is_private": false}]