[{"count": 0, "tags": [], "text": "When there is a servlet with mapping \"/*\", as well as error pages with an error\nlocation pointing to an HTML file, the error locations are despatched to the\nservlet. This is not correct, because when the error location doesn't refer to a\nservlet or JSP it denotes a path in the WAR file. The fact that this path also\nhappens to match the pattern of a servlet is not relevant.", "attachment_id": null, "id": 108275, "creator": "werner.donne@re.be", "time": "2007-09-17T08:36:13Z", "bug_id": 43409, "creation_time": "2007-09-17T08:36:13Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 43409, "attachment_id": null, "id": 108731, "time": "2007-09-27T23:00:04Z", "creator": "markt@apache.org", "creation_time": "2007-09-27T23:00:04Z", "is_private": false, "text": "Please read SRV.9.9. It refers to location as specifying a 'resource', not a\npath in a WAR.\n\nLocation can't refer to a path in a WAR as as there is no requirement to deploy\napps in WARs."}, {"count": 2, "tags": [], "bug_id": 43409, "attachment_id": null, "id": 108736, "time": "2007-09-28T00:19:33Z", "creator": "werner.donne@re.be", "creation_time": "2007-09-28T00:19:33Z", "is_private": false, "text": "Indeed, it doesn't have to be a path in a WAR, but that is not the main point.\nIf the application contains a resource that is a perfect match for the error\nlocation, that resource should be selected and not a servlet with the pattern\n\"/*\", because it is less precise."}, {"count": 3, "tags": [], "bug_id": 43409, "attachment_id": null, "text": "And now read SRV.11. I can't emphasis enough the importance of being familiar\nwith the spec before you start to design / implement web apps.\n\nIn your case, your error page is a static file so it does not have a mapping in\nweb.xml. Therefore (SRV.11.1):\n- no exact match\n- longest path prefix matches your /* mapping (since this overrides the default\nservlet that would normally serve static resources\n\nYou need to fix your configuration. Options include:\n- add explicit mappings to your static resources that map them to the DefaultServlet\n- put them all in a error directory and map /error/* to the DefaultServlet\n\nPlease use the users mailing list for further help.", "id": 108785, "time": "2007-09-28T23:32:53Z", "creator": "markt@apache.org", "creation_time": "2007-09-28T23:32:53Z", "is_private": false}, {"count": 4, "tags": [], "text": "Of course a static file has no mapping in the deployment descriptor, but it is\npart of the web application. It is a web resource. SRV.9.9.2 says:\n\n\"If the sendError method is called on the response, the container consults the\nlist of error page declarations for the Web application that use the status-code\nsyntax and attempts a match. If there is a match, the container returns the\nresource as indicated by the location entry.\"\n\nIf the error page exists as a static resource it must be returned. The above\nparagraph doesn't say the resource should be dynamic.", "is_private": false, "id": 108790, "creator": "werner.donne@re.be", "time": "2007-09-29T02:20:34Z", "bug_id": 43409, "creation_time": "2007-09-29T02:20:34Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "(In reply to comment #4)\n> If the error page exists as a static resource it must be returned.\n\nThe spec does not say this. It says that if the error matches one of your error\npage declarations, then the corresponding resource should be returned. Resources\nare always provided by servlets, even static content. The mapping of resources\nto servlets is defined by SRV.11.\n\n> The above paragraph doesn't say the resource should be dynamic.\n\nNo it doesn't, but it *can* be dynamic - hence SRV.11 applies (which also\napplies to static resources which are normally served by the default servlet.\n\nBugzilla is not the place to have discussions like this. Please use the users list.", "attachment_id": null, "id": 108810, "creator": "markt@apache.org", "time": "2007-09-29T10:09:54Z", "bug_id": 43409, "creation_time": "2007-09-29T10:09:54Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 43409, "attachment_id": null, "id": 108843, "time": "2007-10-01T00:17:02Z", "creator": "werner.donne@re.be", "creation_time": "2007-10-01T00:17:02Z", "is_private": false, "text": "It is not true that resources are always provided by servlets. According to\nSRV.9.13 a web application doesn't even have to contain a servlet. You are\nconfusing the \"default\" servlet, as defined in the spec, with\norg.apache.catalina.servlets.DefaultServlet, which is nothing more than an\nimplementation element.\n\nFor any request, when there is a perfect match with a static resource in the web\napplication SRV.11 does not apply. You just return the resource. It is possible\nthat the implementation of the container uses its internal servlet gear to do\nthat, but that is not relevant.\n\nThis is a bug and the only place to discuss it is here."}, {"count": 7, "tags": [], "text": "(In reply to comment #6)\n> For any request, when there is a perfect match with a static resource in the web\n> application SRV.11 does not apply. You just return the resource.\n\nI can not find any such statement in the Servlet spec. Please provide the\nrelevant  section or quote from the spec if you re-open this bug.", "attachment_id": null, "id": 111029, "creator": "markt@apache.org", "time": "2007-11-23T11:23:30Z", "bug_id": 43409, "creation_time": "2007-11-23T11:23:30Z", "is_private": false}, {"count": 8, "tags": [], "creator": "werner.donne@re.be", "text": "Of course there is no such literal statement. You just have to combine two things:\n\n1. A web application may have several kinds of resources.\n2. The best match is served.\n\nYou are suggesting that there can be a situation where a less than perfect match\n(a servlet in this case) is preferred over a perfect match (a static resource in\nthis case). What is the logic behind that?", "id": 111036, "time": "2007-11-23T13:31:54Z", "bug_id": 43409, "creation_time": "2007-11-23T13:31:54Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 111037, "time": "2007-11-23T14:13:29Z", "bug_id": 43409, "creation_time": "2007-11-23T14:13:29Z", "is_private": false, "text": "(In reply to comment #8)\n> Of course there is no such literal statement. You just have to combine two things:\n> 1. A web application may have several kinds of resources.\nAgreed. Further, I think we also agree that locations specified for error\nhandlers can refer to any valid resource in the web app. \n\n> 2. The best match is served.\nThe spec doesn't say this. SRV.9.9 mentions JSPs and Servlets as possible\nlocations for error handlers and indirectly mentions static files when it refers\nto resources. The only place the spec defines how to work out which resource to\nuse when a location could be referring to a static or a dynamic resource is\nSRV.11. This is no 'if the request matches a static resource that that always\ntakes precedence' rule. The spec isn't always as clear cut as I would like but I\ncan't find anywhere that even hints at static resources taking precedence.\n\n> You are suggesting that there can be a situation where a less than perfect match\n> (a servlet in this case) is preferred over a perfect match (a static resource in\n> this case). What is the logic behind that?\n\nThis is exactly what can, and frequently does, happen as a result of applying\nthe rules in SRV.11\n"}, {"count": 10, "tags": [], "bug_id": 43409, "attachment_id": null, "text": "I am not implying a static resource should always take precedence as such, but\nthat the best matching resource should be taken. In order for a static resource\nto be selected there would have to be a perfect match, because its path is fully\nspecified.\n\nIt is indeed step 4 in SRV.11.1 that puts static resources behind servlets\n(keeping in mind that in the case in point there is no \"default\" servlet in the\ndeployment descriptor). So I yield, but this choice still doesn't make any sense\nto me. The treatment of welcome files, for example, isn't consistent with it.\nThere static resources are considered first.", "id": 111043, "time": "2007-11-23T15:05:26Z", "creator": "werner.donne@re.be", "creation_time": "2007-11-23T15:05:26Z", "is_private": false}]