[{"count": 0, "tags": [], "bug_id": 43440, "attachment_id": null, "id": 108459, "time": "2007-09-20T13:20:07Z", "creator": "mtischler@alcatel-lucent.com", "creation_time": "2007-09-20T13:20:07Z", "is_private": false, "text": "I haven't found anywhere that talks about this, so I hope this is the right\nplace to request an enhancement.\n\nIn one's .htaccess file, is it possible to put different fonts on different\nparts of the argument to the 'AuthName' directive?  Specifically, I would like\nto emphasize something to the person authenticating by emboldening a few words\nthat are shown to them in the authentication pop-up box.  If it's not currently\npossible, is this something that could be added?"}, {"attachment_id": null, "tags": [], "bug_id": 43440, "text": "1. Authentication boxes are a browser function.  The server has no say in it.\n2. Apache 1.3 is the 1998 release.  Noone is enhancing it.", "count": 1, "id": 108462, "time": "2007-09-20T15:59:13Z", "creator": "nick@webthing.com", "creation_time": "2007-09-20T15:59:13Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 43440, "attachment_id": null, "id": 108633, "time": "2007-09-26T07:59:50Z", "creator": "mtischler@alcatel-lucent.com", "creation_time": "2007-09-26T07:59:50Z", "is_private": false, "text": "Nick,\n   Thanks for the speedy response.  How would a browser (e.g., Firefox)\nbe able to affect how the text in an authentication box looks?  Is this\nsome user preference that you're referring to?  Wouldn't there have to\nbe some indication in the .htaccess file to say \"I want this displayed\nas bold\", but then it might be up to the individual browser to interpret\nthat?  In other words, without anything but plain text in the .htaccess\nfile, how would a browser be able to show one or two words in bold,\ne.g.?  I'm confused.  Any pointers you have would be welcome.\n   Also, I didn't really think nor was I requesting that this be\nchanged/enhanced in Apache 1.3.  I was simply indicating that this is\nthe version of Apache that I'm running.\n\nMark"}, {"count": 3, "tags": [], "bug_id": 43440, "attachment_id": null, "id": 109212, "time": "2007-10-10T14:58:28Z", "creator": "mtischler@alcatel-lucent.com", "creation_time": "2007-10-10T14:58:28Z", "is_private": false, "text": "I realize this is not a bug, but I sent a followup query, both via email and as\na comment on this bug report, and I have not heard back, so I thought maybe I\nshould reopen this to see if I can get more information."}, {"count": 4, "tags": [], "creator": "slive@apache.org", "text": "If it's not a bug, then it doesn't belong in the bug database. Feel free to discuss on a user-support forum.\n\n(But, if you read the HTTP auth spec, you'll see that what you want is not possible given the current \nprotocol.)", "id": 109214, "time": "2007-10-10T15:45:00Z", "bug_id": 43440, "creation_time": "2007-10-10T15:45:00Z", "is_private": false, "attachment_id": null}, {"text": "I listed the severity as an 'enhancement'.  Is this not the appropriate way to\nrequest an enhancement?   As I mentioned previously, I would not request the\nenhancement for Apache 1.3, but rather for Apache 2.x.  I understand that the\ncurrent protocol would have to be modified.  Is someone willing to reopen this\nand treat it as an enhancement request?", "tags": [], "bug_id": 43440, "attachment_id": null, "count": 5, "id": 109361, "time": "2007-10-15T12:30:43Z", "creator": "mtischler@alcatel-lucent.com", "creation_time": "2007-10-15T12:30:43Z", "is_private": false}, {"count": 6, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "is_private": false, "id": 109438, "time": "2007-10-17T12:39:32Z", "bug_id": 43440, "creation_time": "2007-10-17T12:39:32Z", "text": "For the protocol modification to have any effect, you'd need to get browsers to\nplay along. So reopening this bug would not do any good.\n\nIf you really think this is important, head over to the w3c and see if you can\nget the spec rewritten. Then convince the browser vendors to implement the new\nspec. Then if there is anything that needs to be changed in apache to make it\nwork, feel free to reopen this bug.\n"}]