[{"count": 0, "tags": [], "creator": "aitidirmustapha@hotmail.com", "is_private": false, "text": "In the package \"org.apache.catalina.authenticator\", someone made modification \nin the abstact class \"AuthenticatorBase\" to keep the SSO cookie secure if it \nwas previously secure \n\nSee the snapshot of the code\nregister(Request request, \n         Response response,\n         Principal principal, \n         String authType,\n         String username, \n         String password)\n{\n\n       ...\n\n       // Bugzilla 41217\n       cookie.setSecure(request.isSecure());\n\n       ...\n}\n\nSo in this case you force all applications to run under ssl if the sso cookie \nwas created under ssl.\n\nSee this scenario:\n\n1- I have a web application \"myapp\" with 2 simples jsp pages\n   - one page contains 5 links to 5 applications (so I have 6 applications)\n   - other jsp is a login page (FORM based authentication j-security-check)\n\n2- All my applications are secured and running in the same tomcat under SSO\n\n3- I logon in to my application \"myapp\" using SSL to protect my password and the\n   jsp with a list of 5 applications is displayed and all is OK\n\n4- In this case the sso cookie isSecure() and is transmitted only in SSL request\n5- I click one link in the list and if the link uses https it works fine,\n   but if i want to use a link in http the authentication fails\n\nSo to work fine, I have to make all my applications in SSL mode otherwise the \nsso fails because the cookie was created in ssl mode. I think it's a bad \nrestriction.\n\nWhat do you think?\n\nthanks\n\nMustapha AIT-IDIR", "id": 108591, "time": "2007-09-25T13:28:57Z", "bug_id": 43477, "creation_time": "2007-09-25T13:28:57Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "funkman@joedog.org", "is_private": false, "text": "The cookie needs to be secure - otherwise session hijacking via sniffing would \nbe able to be done. (And it would not be secure)", "id": 108617, "time": "2007-09-26T03:34:46Z", "bug_id": 43477, "creation_time": "2007-09-26T03:34:46Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 43477, "is_private": false, "id": 108648, "attachment_id": null, "creator": "aitidirmustapha@hotmail.com", "creation_time": "2007-09-26T09:52:07Z", "time": "2007-09-26T09:52:07Z", "text": "Reply to funkman@joedog.org\nfunkman said: \"The cookie needs to be secure - otherwise session hijacking via \nsniffing would be able to be done. (And it would not be secure)\"\n\n\nSo in this case do you mean that I have to keep all my applications under SSL \neven if I dont need that. The login page must be under ssl but the others \napplication not automatically.\n\nMustapha.\n"}]