[{"count": 0, "attachment_id": null, "creator": "scottr@innoventsolutions.com", "is_private": false, "id": 108654, "time": "2007-09-26T10:53:40Z", "bug_id": 43493, "creation_time": "2007-09-26T10:53:40Z", "tags": [], "text": "Using POI-3.0.1-FINAL\n\nI have Excel files that are created by a third party utility (Actuate iServer).\n Most files open as HSSFWorkbook without problem.  Some files are reporting a\nRecordFormatException.\n\nIf I open the problem files with Microsoft Office Excel 2003, the files open\ncorrectly.  If I save the file (no changes) using same, then they open with\nHSSFWorkbook just fine.  \n\nI have attached a small Eclipse project with one Java program that demonstrates\nthe problem.  Just run the OpenFileError program and you should get the error.\n\nthanks"}, {"count": 1, "tags": [], "bug_id": 43493, "text": "Created attachment 20886\nEclipse Project that shows problem behavior.  Includes problem Excel File.\n\nEclipse Project that shows problem behavior.  Includes problem Excel File.", "id": 108656, "time": "2007-09-26T10:55:18Z", "creator": "scottr@innoventsolutions.com", "creation_time": "2007-09-26T10:55:18Z", "is_private": false, "attachment_id": 20886}, {"count": 2, "tags": [], "text": "That file is really quite messed up :(\n\nIt's no good trying to catch the AIOOB exception and skip on, as by then the\nwhole input stream is messed up, and the next record to try to read some data\nblows up with something else. No idea where the original problem is occuring,\nonly that when we try to read one particular sub-record we're out of data, and\nprobably should've stopped long long ago\n\nI can't see us being able to handle these files, sorry, they're just too\ncryptically broken. Probably your best bet is to script excel to open and\nre-save them, as that has a workaround for whatever corruption these files have.", "is_private": false, "bug_id": 43493, "id": 112645, "time": "2008-01-08T11:04:39Z", "creator": "apache@gagravarr.org", "creation_time": "2008-01-08T11:04:39Z", "attachment_id": null}]