[{"count": 0, "tags": [], "creator": "trejkaz@trypticon.org", "attachment_id": null, "id": 109221, "time": "2007-10-11T00:13:26Z", "bug_id": 43595, "creation_time": "2007-10-11T00:13:26Z", "is_private": false, "text": "I have a WMF file which has an APM header and a size of 1266 x 766.\n\nI chopped off the APM header, expecting the resulting file to have the same\nsize.  However, what I end up with is an image with size 1793 x 657.\n\nScaling wouldn't have bothered me... it's a vector format and if the height and\nwidth are missing it's okay to pick sensible values IMO.  But in this situation\nthe width has increased but the height has decreased, which is a bit unusual."}, {"count": 1, "text": "Created attachment 20955\nWMF file with APM header", "bug_id": 43595, "attachment_id": 20955, "id": 109222, "time": "2007-10-11T00:14:03Z", "creator": "trejkaz@trypticon.org", "creation_time": "2007-10-11T00:14:03Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 43595, "text": "Created attachment 20956\nSame WMF file but without the APM header", "id": 109223, "time": "2007-10-11T00:14:24Z", "creator": "trejkaz@trypticon.org", "creation_time": "2007-10-11T00:14:24Z", "is_private": false, "attachment_id": 20956}, {"count": 3, "tags": [], "bug_id": 43595, "attachment_id": null, "id": 163438, "time": "2012-11-14T05:28:18Z", "creator": "trejkaz@trypticon.org", "creation_time": "2012-11-14T05:28:18Z", "is_private": false, "text": "Files *with* an APM header have similar bizarre behaviour.\n\nI have a unit test for a 950 unit x 575 unit WMF which asserts the width and height. The test for the version with the APM header still passes, but the non-APM one started failing after updating to 1.7 from 1.7-beta1. The failure was the width being scaled up too high somehow.\n\nI tracked the problem down to these lines in WMFRecordStore:\n\n        if (! isotropic) scaleXY = (float)vpW / (float)vpH;\n        vpW = (int)(vpW * scaleXY);\n\nNo matter how I look at it, this will multiply the width by the width. Removing these lines fixes the only failing unit test and doesn't cause any other failures (at least inside our own tests. Batik might have some of its own to contradict this, but I haven't seen them.)\n\nSo I will be commenting these lines out in my copy...\n\nThe files I was testing this with were the exact same two files already attached to this ticket."}]