[{"count": 0, "text": "My web application runs in Tomcat 5.0.30 and uses FORM Authentication \n(configured in web.xml).\n\nRecently, I downloaded JMeter 3.1 and used Http Proxy Server (Non-test \nelement) to record a transaction under Thread Group.  When I ran the Thread \nGroup, I noticed that all the HTTP Requests were directed back to the login \npage. The http../j_security_check is set with right user name and password and \nreturned with the status of 400.\n\nAfter reading through the forums, I added the Cookie Manager to the Thread \nGroup and ran the test. It still failed\n\nWhile, the same test scenario works fine with JMeter 1.9.1. The Cookie Manager \nhandles the JSESSIONID and all HTTP requests returned correct response data.", "creator": "kamalasekar.r@gmail.com", "attachment_id": null, "id": 109803, "time": "2007-10-26T08:36:21Z", "bug_id": 43707, "creation_time": "2007-10-26T08:36:21Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "is_private": false, "id": 109812, "time": "2007-10-26T10:29:27Z", "bug_id": 43707, "creation_time": "2007-10-26T10:29:27Z", "text": "What happens if you run the test plan created in JMeter 1.9.1 in JMeter 2.3?\nDoes that work OK?\n\nThere must be something else missing from the test plan recorded in 2.3.\nAdd a Tree View Listener and check the responses carefully.\nAlso check jmeter.log just in case there are any errors.\n\nYou could compare them with the responses you get in 1.9.1."}, {"count": 2, "tags": [], "creator": "kamalasekar.r@gmail.com", "attachment_id": null, "id": 109814, "time": "2007-10-26T11:02:56Z", "bug_id": 43707, "creation_time": "2007-10-26T11:02:56Z", "is_private": false, "text": "The test plan created in JMeter 1.9.1 works with JMeter 2.3 and I recorded \nanother script under the same test plan with JMeter 2.3, it worked fine.\n\nI probably made the mistake of not adding HTTP Cookie Manager while creating \nthe test plan in JMeter 2.3 and when performed the following actions in \nsequence, it worked in JMeter 2.3.\n\n1) Create a Http Proxy Sever (Non-test element), configure inclusion/exclusion \nfilters\n2) Created a New Thread Group\n3) Added Cookie Manager\n4) Added Listeners\n5) Ran the web application and it created the test plan under Thread Group\n\nFinally, stop the Http Proxy server and run the test plan.\n\nThanks Sebb. "}, {"count": 3, "tags": [], "bug_id": 43707, "attachment_id": null, "id": 109817, "time": "2007-10-26T11:41:18Z", "creator": "sebb@apache.org", "creation_time": "2007-10-26T11:41:18Z", "is_private": false, "text": "OK, thanks for confirming that the problem has been resolved.\n\nThe Cookie Manager only applies when running a test plan. It is not used when \ndoing a proxy recording - the browser does its own cookie management.\nSo it's only necessary to add it after recording the plan."}]