[{"count": 0, "tags": [], "creator": "nettings@apache.org", "attachment_id": null, "id": 109926, "time": "2007-10-29T15:15:27Z", "bug_id": 43729, "creation_time": "2007-10-29T15:15:27Z", "is_private": false, "text": "when jetty is used with an apache httpd in front and the ajp connector, apache\nhas problems with the data from jetty:\n[Mon Oct 29 23:08:28 2007] [error] ajp_parse_data: Wrong chunk length. Length of\nchunk is 8185, expected length is 8184.\n[Mon Oct 29 23:08:28 2007] [error] (120007)APR does not understand this error\ncode: proxy: send body failed to (null) (*)\n\na bugzilla entry in apache httpd suggests that this might be jetty's fault (an\noff-by-one error due to a terminating \\0 that should not be counted as\npayload...): http://issues.apache.org/bugzilla/show_bug.cgi?id=39528\n\nthis prevents jetty from being used in proxied environments with ajp. plain http\nproxy does not work, because it breaks https requests, because jetty does not\nget to see if a user originally requested a page through ssl, hence it produces\nhttp links instead of https. \n\nmaybe we need to upgrade our jetty eventually..."}, {"count": 1, "tags": [], "bug_id": 43729, "is_private": false, "text": "looks like it's a slightly different issue that has been fixed already:\nhttp://jira.codehaus.org/browse/JETTY-407\ntime to upgrade jetty i think...\n\ni'm setting this on the agenda for 2.0. the goal is to have a proxied testing\nenvironment using jetty and to provide apache httpd vhost configs that will\nenable users and developers to easily test in a proxy setting and to serve as\nexample configs. currently, people are using wildly different proxy setups,\nthere are no established best practices yet and thus it's very hard to compare\nsymptoms and make sense of bug reports regarding proxying...", "id": 109928, "time": "2007-10-29T17:03:03Z", "creator": "nettings@apache.org", "creation_time": "2007-10-29T17:03:03Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 43729, "is_private": false, "text": "confirmed. the ajp connector works with jetty 6.1.\ni've committed tools/proxytest, see jetty6.xml on how to run lenya with the new\nversion. so far, everything seems to work, except the jetty6 configuration could\nuse some polish.\nthere is now a preliminary proxy testing scaffold, but it's quite broken atm.\n\nit would be great if some people could do some testing on jetty6. maybe we can\nup it before we go into code freeze? wdyt?", "id": 109959, "time": "2007-10-30T09:14:34Z", "creator": "nettings@apache.org", "creation_time": "2007-10-30T09:14:34Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "rfrovarp@apache.org", "attachment_id": null, "id": 109962, "time": "2007-10-30T09:43:51Z", "bug_id": 43729, "creation_time": "2007-10-30T09:43:51Z", "is_private": false, "text": "I think it would be good to get it up and going with Jetty 6.1. In fact\nyesterday I was starting to weigh the pros and cons of Jetty vs Tomcat due to\nthe fact I want to move to mod_proxy_ajp, and was going to test Jetty out today.\nLooks like I'll be testing with a new version when I get back from lunch.\n"}, {"count": 4, "attachment_id": null, "creator": "rfrovarp@apache.org", "text": "I've done some testing but am having issues. I get a bunch of redirects all over\nthe place that eventually cause it to not work. I don't have Apache 2.2 on my\nmachine, so I'm using different machine with different domains. So my test setup\nis a bit different from the reference. \n\nI can however tell you that Jetty 6.1 will listen via IPV6, and Apache will send\nit requests via V6.", "id": 109968, "time": "2007-10-30T13:18:26Z", "bug_id": 43729, "creation_time": "2007-10-30T13:18:26Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "nettings@apache.org", "text": "yeah, the proxy test setup is not working for me, either. still very much work\nin progress. the redirects is where i'm stuck, too.\n\nbut did you test jetty6 w/o proxying? that works for me, flawlessly. i'd like to\nhear more about that. you don't need to change anything, jetty6 is configured\nboth for ajp on port 8009 and for http on 8888, so you can pretty much drop it\nin for the current jetty.\n", "count": 5, "id": 110003, "time": "2007-10-31T01:25:32Z", "bug_id": 43729, "creation_time": "2007-10-31T01:25:32Z", "is_private": false}, {"count": 6, "tags": [], "creator": "rfrovarp@apache.org", "attachment_id": null, "id": 110036, "time": "2007-10-31T07:37:05Z", "bug_id": 43729, "creation_time": "2007-10-31T07:37:05Z", "is_private": false, "text": "(In reply to comment #5)\n\n> but did you test jetty6 w/o proxying? that works for me, flawlessly. i'd like to\n> hear more about that. you don't need to change anything, jetty6 is configured\n> both for ajp on port 8009 and for http on 8888, so you can pretty much drop it\n> in for the current jetty.\n> \n\nI just did some testing there. I haven't had any issues with jetty6 in\nparticular. Since it isn't in the root context, I've been having trouble there.\nI don't have a tomcat install so I'm not sure if this is a problem with jetty6\nor a generic problem with not having lenya under the root context.\n"}, {"count": 7, "attachment_id": null, "bug_id": 43729, "is_private": false, "id": 110247, "time": "2007-11-05T11:25:15Z", "creator": "nettings@apache.org", "creation_time": "2007-11-05T11:25:15Z", "tags": [], "text": "i'd say let's try and release 2.0.1 with jetty6 included, but given the current\ncode freeze for 2.0, it's probably better to postpone further work on it until\nafter the release."}, {"count": 8, "tags": [], "bug_id": 43729, "is_private": false, "text": "just a quick summary: there have been some success reports with jetty6 in\ngeneral, and using it as an ajp proxy in particular.\nproxy- and context-related bugs have mostly been fixed.\n\none tricky issue remains: bug 43864 seems to be jetty-specific. at least jann\nand andreas can't reproduce it on tomcat.\n\nadditionally, we need to provide a robust start script that will work on both\nlinux and windows and ideally takes its configuration from\nlocal.build.properties, and then it should be ready for 2.0.1", "id": 110649, "time": "2007-11-16T11:55:17Z", "creator": "nettings@apache.org", "creation_time": "2007-11-16T11:55:17Z", "attachment_id": null}]