[{"count": 0, "tags": [], "creator": "sonam.chauhan@ce.com.au", "is_private": false, "id": 109937, "attachment_id": null, "bug_id": 43730, "creation_time": "2007-10-29T23:28:59Z", "time": "2007-10-29T23:28:59Z", "text": "I understand that the JVM caches successfull DNS name lookups forever by \ndefault. This is confirmed by this document (see note on \nnetworkaddress.cache.ttl property):\n  http://java.sun.com/j2se/1.4.2/docs/guide/net/properties.html\n\nThe Java DNS cache ignores the DNS TTL property. This can cause issues, for \ninstance with a long-running test when an IP address changes on a server farm, \nor when DNS round-robin load balancing is used during a load test (a JMeter \ninstance will only ever test one node in a cluster). \n\nCan JMeter be enhanced to allow the user to override Java's default DNS-\ncaching behaviour in a user-setting at the beginning of the test?  This will \nenable it to work properly (i.e. as a browser would) in these scenarios. The \nsetting would allow the user to set a time limit on networkaddress.cache.ttl  -\nit could be set to emulate IE (30 minutes, according to some reports) or \nFirefox (1 minute). \n\nThis issue was discussed on the JMeter users list towards end-October 2007:\nhttp://mail-archives.apache.org/mod_mbox/jakarta-jmeter-user/200710.mbox/%\n3cE5D178BFB0356B48A48B8330B2903721035E76B2@syd1exc04.CE.CORP%3e\n\nThis could be implemented as part of a more generic control to set the Java \nNetwork properties (see the first link above.)"}, {"count": 1, "text": "As a work-round for Sun JVMs, the property sun.net.inetaddr.ttl can be set on \nthe command-line using -D or in the JMeter file system.properties.\n\nOther Java networking properties can be set on the command-line or in \nsystem.properties.\n\nIt is only networkaddress.cache.ttl that cannot be set this way; it would need \nto be set by:\n\njava.security.Security.setProperty(\"networkaddress.cache.ttl\" , \"0\");\n\nThis can be done with the current JMeter by using the JMeter property\n\nbeanshell.init.file\n\nwhich names a BeanShell script to be run at startup. Of course this requires \nthat the BeanShell jar has been put on the classpath (e.g. in lib/).", "bug_id": 43730, "is_private": false, "id": 109946, "time": "2007-10-30T05:13:00Z", "creator": "sebb@apache.org", "creation_time": "2007-10-30T05:13:00Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 43730, "text": "   Sebb, a question: can it be, for instance, config element, say, something like \"DNS Cache Manager\", with its own cache and ability to set up DNS server for particular sampler? Using such approach we can bypass JVM & OS cache and it could solve problem.", "id": 176826, "time": "2014-08-01T12:06:09Z", "creator": "dzmitry.kashlach@blazemeter.com", "creation_time": "2014-08-01T12:06:09Z", "is_private": false, "attachment_id": null}, {"count": 3, "text": "\n\n*** This bug has been marked as a duplicate of bug 56841 ***", "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "id": 188652, "time": "2016-02-21T21:34:18Z", "bug_id": 43730, "creation_time": "2016-02-21T21:34:18Z", "tags": [], "attachment_id": null}]