[{"count": 0, "tags": [], "bug_id": 43848, "text": "Hello,\n\nI have discovered a behavior which I consider as a bug and would request it to\nbe reviewed.\n\nLet me start by the source of the problem I had. We have English / Turkish\nenabled web site that uses UTF-8 charset. I have a Filter that sets the encoding\nto UTF-8 for all the request coming to tomcat to correctly handle not ascii\nstandard Turkish characters. However I saw that the\nrequest.setCharachterEncoding(encoding) would not changed anything. It used to\nwork before and I suspected of a bug in my code.\n\nHaving spent 4 hours and trying different encodings, (UTF-8, ISO-8859-9,\nISO-8859-1) my forms with the Turkish characters stayed as corrupted.\n\nThen to investigate it further, I dived into tomcat codes.\n\nThen I discovered the following behavior:   \nAt any stage when the request's parameters is first accessed, all the parameters\nparsed and cached.  There is nothing wrong with that. However, having accessed a\nparameter at least once, if you try to set/change character encoding, encoding\nis set without any warning/error/exception but is not effective as it directly\nused at the time of parsing the parameters.\n\nIn my specific case, I have a filter that dumps all the properties of the\nrequest (URL, headers, cookies, parameters and session attributes of the request\n) for ease of development and this is the very first filter that a request\nencounters, which accesses parameters of the request thus triggers caching of\nthe parameters.\n\nThen the second filter sets the UTF-8 encoding to the request which has NO EFFECT.\n\nHaving searched the bug database, I have seen a lot of \"encoding ignored\" bugs.\nI think a considerable amount of them might be related. I think the correct\nbehavior should be either expiration of the parsed parameter information cache\non encoding changes, or an exception needs to be thrown to indicate \"it is too\nlate to change the encoding\"\n\nUnfortunately I haven't got the time check the servlet spec. So I may be\nconflicting with the spec in my recommendations and if so my apologies for\nmisleading recommendations.\n\nBy the way I have tested this against 5.5.25 which is not listed in bugzilla!! \n\nRegards,\nHasan Ceylan", "id": 110449, "time": "2007-11-12T12:18:13Z", "creator": "hceylan@batoo.org", "creation_time": "2007-11-12T12:18:13Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "This behaviour is as per the spec (SRV.4.9 for Sevlet 2.4).\n\nThe spec does not permit an exception to be thrown if trying to change the\nencoding when it is too late.", "attachment_id": null, "bug_id": 43848, "id": 111034, "time": "2007-11-23T13:20:34Z", "creator": "markt@apache.org", "creation_time": "2007-11-23T13:20:34Z", "is_private": false}]