[{"count": 0, "attachment_id": null, "bug_id": 43878, "text": "If you use the same tag (defined in a JSP 2.0 tag file) on two different JSPs,\nthe tag-class will get loaded from two different classloaders resulting in two\nloaded classes in the perm gen space. You can trace this behaviour when starting\nthe VM with the arguments \"-XX:+TraceClassLoading -XX:+TraceClassUnloading\". The\nclasses get loaded multiple times even when development/reloading is disabled.\n\nThis behaviour gets a problem if you have a huge number of JSPs (in our case\n>10.000) and a few tags used on every single JSP.\n\nI traced down the problem in the source code:\n\nFor each JSP to compile, a new instance of a JspCompilationContext is used. The\nJspCompilationContext holds a reference to a JasperLoader (a ClassLoader), which\ninitially is null (a new JasperLoader will be created when it is first used).\nThe JspCompilationContext will not only load the JSP class, but also compiles\nand loads tag-files referenced within the JSP. As the JasperLoader loads all\nclasses starting with \"org.apache.jsp\" by itself and does not delegate to it's\nparent, the tag class (which lies underneath this package) will get loaded via\nmultiple JasperLoader instances.\n\nI perfectly understand that loading each JSP via a different classloader may be\nnecessary, when reloading is enabled, but if reloading/development is disabled,\nthe same JasperLoader instance could be used. This would prevent the tag class\nto get loaded multiple times. (I.e. a previously used JasperLoader instance\ncould be passed to the JspCompilationContext, if running in production mode).\n\nBy the way I think that loading the tag file via the same classloader as the JSP\nin a reloading-enviornmane may result in some strange behaviour: If two JSPs use\nthe same tag and you change the tag as well as one JSP, you'll see the new\nversion of the tag on the reloaded JSP, but the previous version of the same tag\n(but loaded via a different class-instance) on the unchanged JSP. But to solve\nthis issue, some greater refactoring would be necessary, I think....", "id": 110624, "time": "2007-11-16T01:20:37Z", "creator": "c.korn@codekultur.de", "creation_time": "2007-11-16T01:20:37Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "I have committed the following fix for this to trunk.\nhttp://svn.apache.org/viewvc?rev=607464&view=rev\n\nFeedback from any testing you could do would be much appreciated.", "is_private": false, "id": 112292, "creator": "markt@apache.org", "time": "2007-12-29T11:31:52Z", "bug_id": 43878, "creation_time": "2007-12-29T11:31:52Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 43878, "attachment_id": null, "id": 112298, "time": "2007-12-30T04:32:10Z", "creator": "philipp@hitchhackers.net", "creation_time": "2007-12-30T04:32:10Z", "is_private": false, "text": "Hi Mark,\n\nthank you very much!\n\nWe'll test the new version first thing in the new year and let you know the results.\n\nHave a good start into 2008,\nPhilipp"}, {"count": 3, "attachment_id": null, "bug_id": 43878, "text": "Looking at it, my patch is clearly nonsense. I'm working on one that actually\nworks...", "id": 113160, "time": "2008-01-26T11:30:47Z", "creator": "markt@apache.org", "creation_time": "2008-01-26T11:30:47Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "text": "Hi Mark,\n\nthanks for the heads-up - I´ll forward it to my colleagues to let them know that\nthey don't need to start testing.\n\nPhilipp\n", "attachment_id": null, "id": 113161, "creator": "philipp@hitchhackers.net", "time": "2008-01-26T14:53:16Z", "bug_id": 43878, "creation_time": "2008-01-26T14:53:16Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 43878, "attachment_id": null, "id": 113278, "time": "2008-01-29T15:39:26Z", "creator": "markt@apache.org", "creation_time": "2008-01-29T15:39:26Z", "is_private": false, "text": "I have committed a better fix for this to trunk. Any testing results you can\nprovide would be much appreciated.\n\nThe fix has also been proposed for 6.0.x."}, {"count": 6, "tags": [], "bug_id": 43878, "attachment_id": null, "is_private": false, "id": 113982, "time": "2008-02-21T14:00:09Z", "creator": "markt@apache.org", "creation_time": "2008-02-21T14:00:09Z", "text": "This patch has been sat in the proposals list for a few weeks and hasn't\ngathered much interest.\n\nRemy commented that the use case is very close to the pre-compilation one which\nlikely explains why there isn't much support for the patch.\n\nOn this basis I marking this bug as WONTFIX on the grounds pre-compilation\nachieves pretty much the same result.\n\nYou are of course, free to use the patch in your own environment if it is useful\nto you. I have included a link to my improved patch for this below:\nhttp://svn.apache.org/viewvc?rev=616563&view=rev"}, {"count": 7, "tags": [], "text": "*** Bug 55150 has been marked as a duplicate of this bug. ***", "attachment_id": null, "bug_id": 43878, "id": 168103, "time": "2013-06-27T20:05:15Z", "creator": "markt@apache.org", "creation_time": "2013-06-27T20:05:15Z", "is_private": false}]