[{"count": 0, "tags": [], "bug_id": 43989, "text": "currently, each module that operates on documents has it's own way of addressing\nthem - some use context information from the page envelope, some have\nparameterized matchers, but they are often inconsistent.\n\ni propose the following contract between modules that operate on documents and\nthe rest of the world:\n\nany such module must provide\n\n* a context-insensitive (fully parameterized) entry point that operates on the\ndocument path\n* a context-insensitive entry point that operates on a UUID plus optional\nlanguage and revision.\n\na module can provide\n* a context-sensitive entry point that operates on the current document via the\npage-envelope.\n\nall those entry points should be accessible via standardized matcher patterns.\n\nandreas points out that the matching of document path to UUID can be factored\nout and handled by the global sitemap, where /modules/** requests are matched.", "id": 111245, "time": "2007-11-29T02:37:33Z", "creator": "nettings@apache.org", "creation_time": "2007-11-29T02:37:33Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 43989, "is_private": false, "id": 111251, "creation_time": "2007-11-29T03:37:11Z", "time": "2007-11-29T03:37:11Z", "creator": "solprovider@gmail.com", "text": "See 1.3 Help:\nhttp://svn.apache.org/viewvc/lenya/branches/revolution/1.3.x/13HELP.txt?view=markup\n\nThe second half of this file defines the content: protocol used in Lenya 1.3. \nThis protocol does everything anybody could possibly desire for retrieving\ndocuments.  Lenya 1.3's content resources:\n- include all types of data: text, xml, and binary files/records.\n- are accessible by uuid/unid or path.\n- can specify language.\n- can specify revision.\n\nThese specifications should be able to replace all local data access methods.\n\nThe protocol is implemented by the o.a.l.cms.content packages.  The current\npackages handle 1.2's hierarchical data structure and 1.3's flat data structure.\n Can this code be ported to 2.0 with a new package for 2.0's structure?", "attachment_id": null}]