[{"count": 0, "tags": [], "text": "\"HTTP Request Defaults\" Config Element accepts space ending \"Port Number\" and \ncauses \"HTTP Request\" Sampler run into \"Connection refused: connect\".\n\nMaybe \"HTTP Request\" Sampler can trim space before connecting.\n\nCopy/Paste very easily leaves a space at the end of \"HTTP Request Defaults\" \nConfig Element \"Port Number\" input. \"HTTP Request\" Sampler runs \ninto \"Connection refused: connect\" without logging any hint wrt the space.\n\nInternet search led to NAT support limitation. Wasted many time struggling w/ \nfirewall, proxy & tunnelling.\n\nThanks.", "is_private": false, "bug_id": 43984, "id": 111225, "time": "2007-11-28T16:04:57Z", "creator": "ZhongY@US.IBM.com", "creation_time": "2007-11-28T16:04:57Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "\"HTTP Request\" Sampler parameter \"Value\" also accepts (ending) space and \ndirectly puts it into HTTP request w/o URL-encoding.\n\nMaybe \"HTTP Request\" Sampler can either trim space or URL-encoding at least.\n\nThanks.", "is_private": false, "bug_id": 43984, "id": 111227, "time": "2007-11-28T17:04:47Z", "creator": "ZhongY@US.IBM.com", "creation_time": "2007-11-28T17:04:47Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 43984, "text": "I don't consider these to be bugs as JMeter behaves correctly when correct \ndata is provided.\n\nIn the case of spaces in parameter values, they are encoded if encoding is \nselected. No change is needed there.\n\nHowever, I agree it would be useful to ignore trailing spaces for the port \nfield. At present the port is ignored if it is not a valid number. This is a \nbit confusing - but not a bug - so I'm changing this report to an enhancement.", "id": 111228, "time": "2007-11-28T18:16:59Z", "creator": "sebb@apache.org", "creation_time": "2007-11-28T18:16:59Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 43984, "text": "Trailing port spaces have been fixed in SVN r600547.", "id": 111362, "time": "2007-12-03T06:42:06Z", "creator": "sebb@apache.org", "creation_time": "2007-12-03T06:42:06Z", "is_private": false, "attachment_id": null}]