[{"count": 0, "attachment_id": null, "bug_id": 43983, "is_private": false, "id": 111209, "time": "2007-11-28T09:07:46Z", "creator": "mail@markus-kiss.de", "creation_time": "2007-11-28T09:07:46Z", "tags": [], "text": "I'm using Tomcat 6.0.14 with the \"security\" option in order to assign different\npermissions to several webapps running within the Tomcat security sandbox.\nHowever, I've encountered the following effect when I activate the\nantiResourceLocking flag in the context.xml file of my webapp:\n\nAs this flag causes the server to copy all the files of my webapp to the temp\ndirectory at runtime, the codeBase for the webapp also changes - but the\nSecurityManager doesn't recognise that it has changed. Consequently, the\npermissions for the specific webapp that I defined in catalina.policy actually\ndon't apply and I get an \"access denied\" exception. I have searched the web, the\nsecurity FAQ and newsgroups for a hint or a workaround, but with no success.\nNeither the Tomcat Users Mailing List could help. With the help of the\njava.security.debug=all option I came to the workaround to simply set the\ncodeBase in the catalina.policy file to the new location within the temp directory:\n\ngrant codeBase \"file:${catalina.home}/temp/1-foo/-\" {\n        /* list of assigned permissions */\n};\n\nWith this workaround everything works fine. However, the numeric prefix (e.g.\n\"1-\") of the webapp copied to the temp folder eventually changes, for instance\nwhen I redeploy the webapp or when I clear the temp directory. As a result, I\nalways have to keep the catalina.policy file up-to-date with the current prefix\nof the webapp, otherwise the permissions fail.\n\nI ask myself if there is a more elegant way to fix this problem, maybe by an\ninternal mapping of the original codeBase of the webapp in\n${catalina.home}/webapps/ to the ${catalina.home}/temp/ directory which then\nwould be transparent for the SecurityManager? \n\nIf there's no easy way to fix it, at least a hint should be placed in the Tomcat\nSecurity FAQ that if antiResourceLocking is active, the codeBase of the webapp\nhas to be adapted within the catalina.policy file."}, {"count": 1, "tags": [], "text": "I can't see a way to map to the new code base without a custom security manager.\nI think an FAQ entry is the best option.\n\nThe FAQ is now on the wiki (http://wiki.apache.org/tomcat/FAQ/Security) so I'll\nleave it to you to add what you consider to the appropriate text.", "is_private": false, "bug_id": 43983, "id": 112165, "time": "2007-12-24T07:35:39Z", "creator": "markt@apache.org", "creation_time": "2007-12-24T07:35:39Z", "attachment_id": null}]