[{"count": 0, "tags": [], "text": "When i want to send  HTTP request via HTTP Request Sampler, i saw that;\nHTTP Request Sample does not close the sockets. in the length of the time i saw \na lot of socket that are hang on TIME_WAIT sate. whereas they should be CLOSED. \n\nI saw this error when  i use HTTP Request object to send http request. I think \nthis issue may be related with this object. when I use Apache HTTP Client \nobject to send HTTP request, i've naver seen a error like this. all sockets \nclosed as expected...", "is_private": false, "bug_id": 44012, "id": 111352, "time": "2007-12-03T05:24:27Z", "creator": "vedat.demir@gmail.com", "creation_time": "2007-12-03T05:24:27Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 44012, "attachment_id": null, "id": 111353, "time": "2007-12-03T05:29:49Z", "creator": "sebb@apache.org", "creation_time": "2007-12-03T05:29:49Z", "is_private": false, "text": "TIME_WAIT state is normal after a socket is closed.\n\nTCP has to wait for any stray packets before releasing the socket entirely."}, {"count": 2, "tags": [], "bug_id": 44012, "is_private": false, "text": "bu it is not normal to hang at this state durung OS tcp_time_wait duration. \nwhen http sampler does not close this socket, this TIME_WAIT socket incrases \ntill OS max allowed count an then apllication does not reply any request because\nof it can not open any new socket for new incomming requests. \n\nso, i think HTTP Sampler object should close the sockect as expected. we should \nnot see incrasing TIME_WAIT sockets. \n", "id": 111355, "time": "2007-12-03T05:38:05Z", "creator": "vedat.demir@gmail.com", "creation_time": "2007-12-03T05:38:05Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 44012, "attachment_id": null, "is_private": false, "id": 111360, "time": "2007-12-03T06:40:30Z", "creator": "sebb@apache.org", "creation_time": "2007-12-03T06:40:30Z", "text": "The Java HTTP implementation does not give access to the socket, but the HTTP \nSampler *does* call disconnect() - unless you specify KeepAlive.\n\nHowever, even with KeepAlive set I cannot reproduce the error with the HTTP \nSampler.\n\nCan you provide a test-case (using a public server) ?"}, {"count": 4, "attachment_id": 21223, "bug_id": 44012, "text": "Created attachment 21223\ntest plan example for http request sampler\n\ncould u please run this test plan. sorry if i m wrong. \nbut when i try to run a test plan like this. i see a lot of open socket that\nare hang on TIME_WAIT state. \n\nplease run this test plan and meanwhile look your connections with \"netstat\n-an\" command with your command promt. u will see increasing TIME_WAIT socket\nconnections. \n\nas i said before i encountered this problem when i use the java HTTP client\nobject. just for this reason i use apache HTTP Client. when i use apache HTTP\nClient object to send http requests, i have never seen a problem like this.\n\nthanks & regards", "id": 111375, "time": "2007-12-03T10:21:11Z", "creator": "vedat.demir@gmail.com", "creation_time": "2007-12-03T10:21:11Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "text": "Not sure what is happening here.\n\nI can see the problem when using www.google.com, but I don't see it when using \nnews.bbc.co.uk.", "is_private": false, "bug_id": 44012, "id": 111376, "time": "2007-12-03T11:13:51Z", "creator": "sebb@apache.org", "creation_time": "2007-12-03T11:13:51Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 44012, "is_private": false, "count": 6, "id": 111379, "time": "2007-12-03T12:59:44Z", "creator": "vedat.demir@gmail.com", "creation_time": "2007-12-03T12:59:44Z", "text": "i see this error when i use my own server, and i examine it carefully to close\nthe sockets appropriately. when i use WAST (microsoft's stress tool\n[news.bbc.co.uk could be developed on ASP???]) for my tests. i don't see an\nerror like this. \n\nas i said before, most probably it may be related with java http client object.\nwhen i use this object to realize my own stress test, i see this error again. \n\njust because of this reason i use apache http client object in my projects to\ngenerate http requests \n\n "}, {"count": 7, "tags": [], "creator": "sebb@apache.org", "text": "Whether or not you see connections in TIME_WAIT state depends on which end of \nthe connection initiates the shutdown. The end that initiates the shutdown \nwill see the TIME_WAIT.\n\nI've run some separate tests with Java http, and TIME_WAIT is seen if the keep-\nalive flag is set. If you don't use keep-alive, then you won't see TIME_WAIT - \nthe server will.\n\nHttpClient behaves differently - I'm not sure why, I would have thought it \nought to behave the same.\n\nThere is nothing that can be done to change the Java http behaviour.\nAs far as I can tell it is working as designed.", "id": 111457, "time": "2007-12-05T11:38:44Z", "bug_id": 44012, "creation_time": "2007-12-05T11:38:44Z", "is_private": false, "attachment_id": null}]