[{"count": 0, "tags": [], "bug_id": 44046, "text": "Under Vista 64bit (Business) edition I started installation of\napache_2.2.6-win32-x86-openssl-0.9.8e.msi by running it as Administrator,\neverything goes well, Apache service is started, Monitor is started but no menu\nitem is created in start menu for Monitor. While not restarted yet, Monitor is\nusable, stopping and starting service works. After Vista 64 is manually\nrestarted Apache service is started with the system but not the Monitor, and\nwhen Monitor is started manually one can not Stop service using it - clicking on\nit results in simply nothing. Some solutions I've found on web recommended\nrunning Monitor in Windows XP SP2 compatibility mode, but it didn't work for my\nVista 64-bit.", "id": 111603, "time": "2007-12-10T07:29:33Z", "creator": "sslavic@yahoo.com", "creation_time": "2007-12-10T07:29:33Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 44046, "text": "This is twofold;\n\nthere was an installation error that failed to create the icon, this is now\nresolved for the future 2.2.7 package.\n\nyou must have stop/start/restart rights as a user to control apache services,\nwhich I'm suspecting your account does not have.\n\nSo half fixed/half not an issue.", "id": 112133, "time": "2007-12-23T10:24:47Z", "creator": "wrowe@apache.org", "creation_time": "2007-12-23T10:24:47Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 44046, "text": "If I understood well, issue of Apache Monitor shortcut not being available in\nStart menu under Vista is fixed and will be available in 2.2.7 - thank you for\nresolving this.\n\nWhen Apache installer is run under Vista it would be nice to have Apache Monitor\nadded to Start Up folder by the Apache installer. It would be even nicer to have\nthis as option in installer so user can choose whether one does or doesn't want\nApache installer to configure Apache Monitor to be started up together with\nVista. Currently, one has to add Apache Monitor manually to Start Up folder,\nwhich isn't that bad but isn't nice either. I think it is an issue that should\nbe fixed in installer.\n\nComparing Vista to previous Windows operating systems, as I see it,\n\"Administrator\" user has gained status similar to one that \"root\" user has under\nLinux distributions - if this was in Windows before now it is more tangible.\nUnder Vista non \"Administrator\" user can have administrator rights but, with\nUser Access Control (UAC) enabled, for actions like (un)installing application\nor stop/start/restart service \"Administrator\" has to give permission to that\naction - in such situation under Linux user is asked to enter \"root\" user\npassword, while in Vista user just has to click on Continue button on UAC screen.\n\nCurrently to have Apache Monitor functional under Vista, one has to start Apache\nMonitor as \"Administrator\". Unless Apache Monitor is started as \"Administrator\"\none can not stop/start/restart Apache service under Vista. It can be set\nmanually that Apache Monitor has to be started as \"Administrator\" but it is not\ngood solution - if one also adds Apache Monitor to Start Up folder, each time\nVista is run one will be presented with UAC screen even though Apache Monitor is\nnot used to stop/start/restart Apache service. This issue should be resolved by\nmaking Apache Monitor compatible with new security features in Vista. To\naccomplish this maybe \"Windows Vista Application Development Requirements for\nUser Access Control Compatibility\" document provided by Microsoft and currently\navailable at\nhttp://download.microsoft.com/download/5/6/a/56a0ed11-e073-42f9-932b-38acd478f46d/WindowsVistaUACDevReqs.doc\nmight be useful - many blogs and similar web sites cover this topic too, just\nsearch for e.g. Vista manifest file.\n\nIn my opinion Apache Monitor GUI shouldn't require \"Administrator\" permission to\nbe started (like it doesn't do now), but clicking on \"Start\", \"Stop\", \"Restart\",\nand \"Services\" buttons within Apache Monitor GUI, which to be functional require\n\"Administrator\" permission, should signal this to Vista so it can activate UAC\nscreen (and not just silently ignore privileges requirement like it does now).", "id": 112142, "time": "2007-12-23T14:03:55Z", "creator": "sslavic@yahoo.com", "creation_time": "2007-12-23T14:03:55Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "wrowe@apache.org", "is_private": false, "count": 3, "id": 112319, "time": "2007-12-30T22:18:39Z", "bug_id": 44046, "creation_time": "2007-12-30T22:18:39Z", "text": "\"When Apache installer is run under Vista it would be nice to have Apache Monitor\nadded to Start Up folder by the Apache installer.\"\n\nCorrected for 2.2.7, yes.\n\n\"It would be even nicer to have this as option in installer so user can choose\nwhether one does or doesn't want Apache installer to configure Apache Monitor to\nbe started up together with Vista.\"\n\nCorrected - in that the ApacheMonitor app is now entirely optional, \"custom\"\ninstall allows the user to refuse it, and therefore neither a Startup group nor\nApache HTTP Server group shortcut are added.\n\n\"This issue should be resolved by making Apache Monitor compatible with new\nsecurity features in Vista. To accomplish this maybe \"Windows Vista Application\nDevelopment Requirements for User Access Control Compatibility\" document ...\"\n\nPatches to present the UAC dialog are welcomed.  Retitling this as such.\n"}, {"count": 4, "tags": [], "bug_id": 44046, "text": "In the next release, it does.", "id": 117414, "time": "2008-06-05T14:09:31Z", "creator": "wrowe@apache.org", "creation_time": "2008-06-05T14:09:31Z", "is_private": false, "attachment_id": null}]