[{"count": 0, "tags": [], "bug_id": 44093, "attachment_id": null, "text": "We have installed Apache/Tomcat 5.0.27 that is packaged with Business Objects \nXI R2.  We have authentication setup with Windows Active Directory within \nBusiness Objects and modified the Tomcat configuration to point to 2 files in \nthe C:\\WINNT directory:\n1. bscLogin.conf\n2. krb5.ini\n\nUsers were able to login to Business Objects using Apache/Tomcat as the web \nserver and then a couple of months ago, some users were getting the following \nerror in the Business Objects portal:\n\"Account Information Not Recoginzed: Active Directory Authentication failed to \nlog you on.  Please contact your system administrator to make sure you are a \nmember of a valid mapped group and try again\"\n\nThe std.out file reveals the following entry\"\nprincipal is X00505@PROD.AD.MERC.CHICAGO.CME.COM\n\t\t[Krb5LoginModule] authentication failed \nKDC has no support for encryption type (14)\n2138765 [TP-Processor1] ERROR \ncom.crystaldecisions.sdk.plugin.authentication.ldap.internal.SecWinADAuthenticat\nion  - Authentication failed. KDC has no support for encryption type (14)\nDebug is  true storeKey false useTicketCache false useKeyTab false doNotPrompt \nfalse ticketCache is null KeyTab is null refreshKrb5Config is false principal \nis null tryFirstPass is false useFirstPass is false storePass is false \nclearPass is false\n\t\t[Krb5LoginModule] user entered username: \nx00505@PROD.AD.MERC.CHICAGO.CME.COM\n\nThis issue has been open for a couple of months now with Business Objects and \nthey are starting to say that its a problem with Apache/Tomcat.  \n\nAny advice?\nThanks,\nCarole", "id": 111859, "time": "2007-12-18T08:34:41Z", "creator": "cwittemann@analytics8.com", "creation_time": "2007-12-18T08:34:41Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 44093, "attachment_id": null, "text": "There is little information to go on but there is nothing that suggests a Tomcat\nissue. The class reporting the error\n(com.crystaldecisions.sdk.plugin.authentication.ldap.internal.SecWinADAuthenticat\nion) is not one that is distributed with Tomcat.\n\nThis one belongs firmly with Business Objects and if they are trying to suggest\ndifferently I suggest you escalate this issue with your account manager (or\nwhatever the escalation process is for Business Objects when you feel the\nsupport people aren't providing the service you have paid for).\n\nA quick Google suggests a couple of possible causes and solutions but I assume\nyou have tried these.\n", "id": 111863, "time": "2007-12-18T12:31:52Z", "creator": "markt@apache.org", "creation_time": "2007-12-18T12:31:52Z", "is_private": false}]