[{"count": 0, "tags": [], "creator": "nicolaou@netinfo.com.cy", "text": "I have a tomcat 5.5.23 running on linux machine communicating with EJBs on a\nJboss server on another linux machine.\n\nI have lots of users connecting on the system and I get lots of errors in the\njboss authentication module saying that the principal received from tomcat is\nnull. This occurs after the user has logged in and after he/she successfully\nmanaged to call the server multiple times without any problems. It seems that\nsometimes the tomcat JAAS module loses the principal of the LoginContext. I have\nnot managed to figure out when this happens but when this occurs the user has to\nlogout and login again.\n\nI have also noticed something else that is weird. When the above scenario occurs\nthe next user that tries to login is picking up the invalid LoginContext that\nhas a null principal. I managed to reproduce this by doing a LoginContext.login\nwith invalid credentials and tried to access a server function in order to\nreceive an authentication exception from the server. When this happens I do not\nlogout the context. I then try opening a new session with a new browser and\naccessing a function with @PermitAll only to find out that tomcat picked up the\ninvalid loginContext of the other session and tries to validate the user using\nthe invalid credentials.\n\nAny help will be appreciated.", "id": 112764, "time": "2008-01-11T06:07:49Z", "bug_id": 44209, "creation_time": "2008-01-11T06:07:49Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 44209, "attachment_id": null, "id": 112792, "time": "2008-01-13T09:26:48Z", "creator": "markt@apache.org", "creation_time": "2008-01-13T09:26:48Z", "is_private": false, "text": "Without the steps to reproduce this there isn't much we can do.\n\nIf you have multiple, clustered Tomcats with replicated sessions then the null\nPrincipal may be caused by bug 43840 (assuming it also applies to 5.5.x - I\nhaven't checked).\n\nYou might also want to check with your JBoss support. This issue could be\nrelated to the JBoss/Tomcat integration.\n\nI am closing this as INVALID since there are no steps to reproduce the issue and\nit isn't clear if this is a Tomcat or JBoss issue. Please feel free to re-open\nthis issue if you are able to generate a test case or if a fix for 43840 in\nTomcat 5.5. is required."}]