[{"count": 0, "tags": [], "bug_id": 44225, "attachment_id": null, "is_private": false, "id": 112808, "time": "2008-01-14T04:53:06Z", "creator": "grnch@gmx.net", "creation_time": "2008-01-14T04:53:06Z", "text": "The keystore file containing the private server key should be kept in a secure \nlocation readable only by root. But if you run Tomcat under a less privileged \nuser, this prevents you from using this key for the Tomcat SSL Connector.\n\nYou are left with two choices: either make the keystore readable to the Tomcat \nuser, or run Tomcat permanently as root, neither of which is appealing from \nsecurity point of view.\n\nNow, Tomcat supports Commons Daemon (JSVC), which allows it to be started on \nprivileged ports (such as 80 or 443) while not having to run as root all the \ntime. It does it by splitting initialization into \"load\" and \"start\" phases, \nwhere the \"load\" phase runs as root in order to acquire the privileged \nresources, while the \"start\" phase runs after dropping privileges.\n\nUnfortunately, the privileged \"load\" phase currently only binds the privileged \nports. I propose to also move the loading of keystore files to this privileged \n\"load\" phase, so that private keystore files can be kept in a secure location, \nwhile Tomcat runs as non-privileged user."}, {"count": 1, "attachment_id": null, "bug_id": 44225, "text": "This sounds like an enhancement some users would want. Of course, it only works\nif the key is read once and kept in memory - which I assume it is but haven't\nchecked.\n\nAs always, patches are welcome. I don't know this part of the code well enough\nto know how big the patch is likely to be.", "id": 112839, "time": "2008-01-14T12:51:13Z", "creator": "markt@apache.org", "creation_time": "2008-01-14T12:51:13Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "It doesn't appear as if anyone is interested in writing a patch for this.\n\nAlso, limiting the key file to root doesn't offer any additional security. The Tomcat process will have the key in memory and hence the OS user tomcat is running as will always be able to access it.\n\nTherefore, closing this as WONTFIX.", "is_private": false, "bug_id": 44225, "id": 198760, "time": "2017-05-11T10:20:16Z", "creator": "markt@apache.org", "creation_time": "2017-05-11T10:20:16Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 44225, "is_private": false, "count": 3, "id": 198762, "time": "2017-05-11T17:03:18Z", "creator": "chris@christopherschultz.net", "creation_time": "2017-05-11T17:03:18Z", "text": "(In reply to Mark Thomas from comment #2)\n> Therefore, closing this as WONTFIX.\n\n+1\n\nIt also prevents the keystore file from being re-read if the <Connector> is re-initialized or if the keystore is intentionally changed for some reason (e.g. new certificate issued)."}]