[{"count": 0, "attachment_id": null, "bug_id": 44257, "text": "Hi,\nWe are experiencing issues where about 10% of the total user sessions get timed out in 20 mins, \ninspite of the setup of 120 mins for the web-based app. This issue seems to be random and across all \nuser bases.\nThe tomcat webservers are installed in different flavors ( AIX, OSX servers ) and the timeout seems to \nhappen randomly in both these enviornments.\nThe Webserver seems to have the session id value of the user null, because of which, the session id of \nuser ( coming via the request object )  is not matching with the session id stored in the server ( that has \nbecome null ), during authentication of the validity of the user session.\n\nAverage time out period of idle session seems to be around 20 mins for all the affected users. \nwe are using Apache 4.1.31\nAny help on this would be greatly appreciated.", "id": 112940, "time": "2008-01-16T23:35:37Z", "creator": "mail_vikki_here1@yahoo.com", "creation_time": "2008-01-16T23:35:37Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 44257, "attachment_id": null, "id": 113154, "time": "2008-01-26T03:50:53Z", "creator": "markt@apache.org", "creation_time": "2008-01-26T03:50:53Z", "is_private": false, "text": "This looks like it could be similar to bug 25792. This part of the code changed\nquite a bit in TC5 so I'll have to do some digging."}, {"count": 2, "attachment_id": null, "bug_id": 44257, "text": "Having looked at bug 25792 and tested it on the latest TC4 code, it appears to\nhave been caused by some early TC5 refactoring and so is not an issue for TC4.\n\nThe obvious thing for you to try is to upgrade to 4.1.36. I checked the release\nnotes and I don't see any obvious changes that might be a fix for this issue but\nthere are plenty of other fixes worth having.\n\nYour deduction that the user's session ID is being set to null is not consistent\nwith the way sessions are managed by Tomcat. For whatever reason, the session\nthe user requests does not exist. It could be that the session has expired\n(rightly or wrongly) or the client could be requesting an invalid session ID.\n\nAt the minute, this looks more like an application or configuration issue rather\nthan a Tomcat bug. My recommendation is that you implement a combination of\nsession listener, request logging and some application logging to confirm:\n- when sessions are created and destroyed\n- the session requested in each request\n- the session being used in each request\n\nThis should help get to the root of this issue.\n\nBugzilla is not meant to be used as a support forum. Therefore, I suggest you\nuse the users list to seek help in tracking down the source of this issue. For\nnow, I am closing this as invalid. If the users list discussion concludes there\nis a bug here then the issue can be re-opened and the steps to reproduce the\nissue added.", "id": 113156, "time": "2008-01-26T07:54:19Z", "creator": "markt@apache.org", "creation_time": "2008-01-26T07:54:19Z", "tags": [], "is_private": false}]