[{"count": 0, "tags": [], "bug_id": 44299, "text": "A log out button would enable users to log out of the manager application and\nend the associated session without having to close the browser window.", "id": 113157, "time": "2008-01-26T08:01:54Z", "creator": "markt@apache.org", "creation_time": "2008-01-26T08:01:54Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "william.barker@wilshire.com", "attachment_id": null, "text": "Only because this is Mark, i won't mark as WONTFIX.  Patches are always \nwelcome :).\n\nThis can't really be done cleanly, since the Manager webapp uses BASIC auth.  \nThere is no way that I know of to tell the browser to stop sending the \ncredentials with each request.  As a result, there is no way for the webapp to \nknow that the user hasn't logged back in.  This is largely why the \"logoff\" \nfeature was dropped from the servlet spec.\n\nI haven't tested it, but a really dirty hack might be to send a 401 response \nto the logoff, and count on the user to hit the cancel button.\n\n", "id": 113172, "time": "2008-01-27T18:21:56Z", "bug_id": 44299, "creation_time": "2008-01-27T18:21:56Z", "is_private": false}, {"count": 2, "attachment_id": null, "creator": "markt@apache.org", "is_private": false, "id": 114064, "time": "2008-02-27T08:59:23Z", "bug_id": 44299, "creation_time": "2008-02-27T08:59:23Z", "tags": [], "text": "A couple of options are:\n1) Display a page that tells the user to close the browser.\n2) Close the browser\n3) A variation of http://trac-hacks.org/wiki/TrueHttpLogoutPatch\n4) Display a page that tells the user to close the browser to be 100% but tries the ideas in 3 anyway.\n\nI like 2 along with a short warning near the ogout button the closing the browser is the only guaranteed way to logoff. Simple and known to work.\n\nI might look at this in the next several weeks."}, {"count": 3, "tags": [], "bug_id": 44299, "attachment_id": null, "text": "If memory serves me correctly, CSRF was the driver behind this and Tomcat 7 now has CSRF protection built in to the manager app. Given that: I was the one requesting this; no one else has requested it; and the CSRF protection makes it unnecessary, I am closing this as won't fix.", "id": 145731, "time": "2011-04-12T17:41:17Z", "creator": "markt@apache.org", "creation_time": "2011-04-12T17:41:17Z", "is_private": false}]