[{"count": 0, "tags": [], "bug_id": 44383, "text": "First of all, my excuses is this happens not to be an actual bug. And excuses\nfor my language too, as I am not a native english speaker.\n\nI have found that the live heap size of one of my developed web applications\nvaries a lot after the JSPs have been compiled on Tomcat 5.5.25 compared with\nusing precompiled pages. I mean, if I restart Tomcat without deleting \"work\" and\nrequest the same pages, the live heap is a lot smaller.\n\nUsing jhat on a dump of live objects after the compilation, I have found a LOT\nof live instances of classes contained in the package org.apache.jasper.compiler:\n\n44902 instances of class org.apache.jasper.compiler.Mark\n27437 instances of class org.apache.jasper.compiler.Node$TemplateText\n27342 instances of class org.apache.jasper.compiler.ELNode$ELText\n18206 instances of class org.apache.jasper.compiler.Node$Nodes\n16780 instances of class org.apache.jasper.compiler.ELNode$Nodes\n13080 instances of class org.apache.jasper.compiler.Node$JspAttribute\n11040 instances of class javax.servlet.jsp.tagext.TagData\n\nAfter inspection of the references, I believe that the majority of those\ninstances are being indirectly referenced from instances of:\n\norg.apache.jasper.compiler.JspRuntimeContext\norg.apache.jasper.JspCompilationContext\n\nThe live heap of Tomcat + Application with precompiled pages show no instances\nof those classes (the first ones), so those instances must be related to JSP\ncompilation-time and not to the runtime.\n\nMaybe Tomcat is not releasing some this compilation-time information of Jasper?\n\nI do not know the internals of Tomcat and Jasper integration, and I think this\ncould be a major source of resource consumption. I cannot believe being the\nfirst to notice such a thing, and maybe it is the expected behaviour after all...\n\nThanks a lot for your attention.", "id": 113582, "time": "2008-02-08T15:30:40Z", "creator": "diosnoes@hotmail.com", "creation_time": "2008-02-08T15:30:40Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 44383, "attachment_id": null, "text": "I forgot to mention that I have disabled tag pooling in the web.xml.\n", "id": 113583, "time": "2008-02-08T15:35:02Z", "creator": "diosnoes@hotmail.com", "creation_time": "2008-02-08T15:35:02Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 44383, "attachment_id": null, "text": "Lots of objects does not mean you have a memory leak. I have checked compilation\nand execution for jsps and tags with and without re-loads and can't find any\nmemory leaks.", "id": 113587, "time": "2008-02-09T10:09:01Z", "creator": "markt@apache.org", "creation_time": "2008-02-09T10:09:01Z", "is_private": false}, {"count": 3, "tags": [], "creator": "diosnoes@hotmail.com", "attachment_id": null, "id": 113589, "time": "2008-02-09T18:46:29Z", "bug_id": 44383, "creation_time": "2008-02-09T18:46:29Z", "is_private": false, "text": "Maybe it is not a leak in the sense of unlimited growth because they are -maybe-\nunreferenced -and substituted- in the next compilation of the JSP (I don't\nknow). Let's say it could be a big bunch of unneeded objects.\n\nDo you mean that you have not found the class of objects I mention? If not, I\nunderstand that I must provide a verifiable test case. But if you have found\nthose objects, do you think it is ok, provided they are only needed to compile\nJSPs??"}, {"count": 4, "tags": [], "text": "I think I understand the issue now. If the JspServlet (Jasper) is in development\nmode (the default) the compiler (JDTCompiler) keeps the Node information of the\npage after the compilation to provide the source line in case of an error.\n\nOn our production server, this mode of operation more than doubles the needed\nmemory to run the applications.\n\nI think this should be clarified in the documentation as it only relates the\noption \"development\" to the behaviour with respect to modifications and not to\nthe extra memory cost of this information.\n\nThanks Mark for your response.", "attachment_id": null, "bug_id": 44383, "id": 113594, "time": "2008-02-10T13:38:29Z", "creator": "diosnoes@hotmail.com", "creation_time": "2008-02-10T13:38:29Z", "is_private": false}]