[{"count": 0, "tags": [], "creator": "ted@w3.org", "is_private": false, "id": 113771, "attachment_id": null, "bug_id": 44426, "creation_time": "2008-02-14T17:51:12Z", "time": "2008-02-14T17:51:12Z", "text": "W3C gets an immense amount of DTD traffic with user-agent often only identifying\nitself as Python or Java.  \n\nhttp://www.w3.org/blog/systeam/2008/02/08/w3c_s_excessive_dtd_traffic\n\nIn a number of cases we have heard back from people affected by our automated\nblocking indicating they are running Xalan and/or Xerces doing such things as\nvalidating XML or doing XSL transforms.  We have directed some we have been in\ncorrespondence with to your catalog instructions.\n\nhttp://xerces.apache.org/xerces2-j/faq-xcatalogs.html\n\nThe vast majority of Xalan/Xerces installations most likely do not implement\ncatalogs nor caching of external DTDs and other schemata. It would seem the\nresolver does not care about HTTP response codes nor caching directives.\n\nhttp://www.ietf.org/rfc/rfc2616.txt\n\nBetter than a default catalog would be a caching XML Catalog resolver as I\nunderstand is part of Glassfish\n\nhttp://norman.walsh.name/2007/09/07/treadLightly\n\nThere are other Java libraries contributing to this traffic as well. Xalan and\nXerces are widely used, important libraries.  Your assistance in reducing this\nexcessive traffic to W3C and others hosting standards schemata would be greatly\nappreciated."}, {"count": 1, "tags": [], "bug_id": 44426, "is_private": false, "id": 135148, "attachment_id": null, "creator": "mrglavas@ca.ibm.com", "creation_time": "2010-03-07T16:06:53Z", "time": "2010-03-07T16:06:53Z", "text": "Ted, I'm not sure what you're suggesting we do. Changing default behaviours has the potential to break many applications. We simply cannot do that.\n\nThere are well documented ways for applications to avoid or reduce network access, including the use of XML Catalogs, custom entity resolvers and the grammar caching facilities supported by Xerces and also the JAXP standard. The tools are there. People should be using them.\n\nI believe improving the situation is a matter of education. The more folks you block with a 503 response the more they'll realize that they need to do something and will have to change their application for it to work again."}]