[{"count": 0, "tags": [], "creator": "adamlego20@hotmail.com", "text": "I have found what I think is a serious bug in the Batik SMIL animation engine.\nWhen an animation's begin and end times are controlled by the user (such as an\nanimation that starts when the user presses a key and ends when the key is\nreleased), starting and stopping the animation in quick succession, in a way\nsuch as tapping the key repeatedly, will cause Batik to hang.\n\nThis bug is easily reproduceable. Open the following SVG file in Squiggle:\n---\n<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n<svg xmlns=\"http://www.w3.org/2000/svg\" width=\"400\" height=\"400\" id=\"svg1\">\n  <rect x=\"0\" y=\"0\" height=\"400\" width=\"400\" fill=\"#0000ff\" id=\"rect2\">\n  <animateColor attributeName=\"fill\" values=\"#0000ff;#000088;#0000ff\" dur=\"3s\"\nrepeatCount=\"indefinite\"/>\n  </rect>\n  <rect x=\"180\" y=\"180\" height=\"40\" width=\"40\" fill=\"green\" id=\"rect1\">\n  <animateTransform attributeName=\"transform\" type=\"translate\" to=\"100,0\"\nfrom=\"0,0\" dur=\"1s\" begin=\"svg1.mousedown\" end=\"svg1.mouseup\"/> \n  </rect>\n</svg>\n---\nThe animateColor on the background rect is needed to make user-triggered\nanimations appear, another bug that deserves its own entry. Copy-and-paste the\nSVG code above into a file, open that file in Batik, and then click the SVG file\nrepeatedly as fast as you can. Eventually, it will hang.\n\nEven if you don't start and stop the animation fast enough to cause the hang,\nthe hang may still occur if there is another animation running that happens to\nstart or end at the exact same time that the user-triggered animation starts or\nends.", "id": 113826, "time": "2008-02-16T05:39:22Z", "bug_id": 44439, "creation_time": "2008-02-16T05:39:22Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "helder.magalhaes@gmail.com", "text": "(In reply to comment #0)\n> Copy-and-paste the SVG code above into a file,\n> open that file in Batik, and then click the SVG file\n> repeatedly as fast as you can. Eventually, it will hang.\n\nBy analyzing the code, this seems to be quite the same as issue 46124 (fixed in revision 711765), so marking this one as a duplicate. I guess the summary was somehow obfuscating the real problem, reason why the other issue wasn't marked as a duplicate of this one... :-|\n\nNevertheless, I tried to reproduce just to make sure. No hang nor exception ever happened using the trunk version (1.8 revision 733247) and JDK 1.6u11. - and I've clicked the canvas pretty fast! ;-) I also tried a combination of more slower clicks (mousedown made longer) just to make sure. :-)\n\nPlease reopen if any of my assumptions was wrong! ;-)\n\n*** This bug has been marked as a duplicate of bug 46124 ***", "id": 123917, "time": "2009-01-10T04:26:59Z", "bug_id": 44439, "creation_time": "2009-01-10T04:26:59Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "helder.magalhaes@gmail.com", "text": "Created attachment 23102\nTestcase for bug 44439\n\nAttached testcase from comment 0 to ease reproducibility: an URL is much more convenient than copy+pasting+saving+opening. ;-)", "id": 123919, "time": "2009-01-10T04:29:37Z", "bug_id": 44439, "creation_time": "2009-01-10T04:29:37Z", "is_private": false, "attachment_id": 23102}]