[{"count": 0, "tags": [], "creator": "cyaugin@yahoo.com", "attachment_id": null, "id": 114005, "time": "2008-02-22T01:20:54Z", "bug_id": 44470, "creation_time": "2008-02-22T01:20:54Z", "is_private": false, "text": "When a MIME type is changed, Apache does not indicate the file as having changed\n(the HTTP 304 response), which leads to problems with browsers loading from\ntheir caches and handling files incorrectly. This was reported to Firefox's\nbugzilla but they've basically shifted the issue to Apache (but I didn't find a\nreference to it in this database). If you guys agree that it is Apache's\nresponsibility, well, here it is. Otherwise, maybe get in contact with Mozilla\nand see if you can come to a mutual understanding. Some technical details can be\nfound at the original report: https://bugzilla.mozilla.org/show_bug.cgi?id=198072"}, {"count": 1, "tags": [], "bug_id": 44470, "attachment_id": null, "text": "A 304 response means the entity hasn't changed, which it hasn't.  Everything is\nworking correctly, just as the Mozilla folks figured out in their bug report.", "id": 114007, "time": "2008-02-22T01:59:47Z", "creator": "nick@webthing.com", "creation_time": "2008-02-22T01:59:47Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 44470, "attachment_id": null, "text": "Except that it isn't working correctly; the issue still exists. Some of the\ncommentators at Mozilla argued that Apache was working correctly; but the actual\nclosing of the bug (marked invalid) was because the closer believed it was a\n\"web server configuration problem\". Sigh, oh well, it looks like everyone is\nhappy with ignoring this.", "id": 114016, "time": "2008-02-22T04:28:40Z", "creator": "cyaugin@yahoo.com", "creation_time": "2008-02-22T04:28:40Z", "is_private": false}, {"count": 3, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "id": 114025, "time": "2008-02-22T08:29:48Z", "bug_id": 44470, "creation_time": "2008-02-22T08:29:48Z", "is_private": false, "text": "See the last paragraph of the summary here:\nhttp://httpd.apache.org/docs/2.2/mod/mod_mime.html\n\nIt would be essentially impossible for apache to determine when the last\nconfiguration change affecting the file's meta-data was made, which is why the\nresponsibility is explicitly on the administrator to touch files that have been\nupdated."}]