[{"count": 0, "tags": [], "text": "[Note that the case (ie UPPER- or lowercase) of text in \"double quotes\" should\nbe paid attention to in this ticket.]\n\nApache's directory redirection engine accepts lowercase input.\n\nTo reproduce behavior (confirmed by one other person):\n\n#1. Create the folder \"/foo\" (or whatever, the directory name doesn't matter) on\nany server.\n#2. Telnet or use \"nc\" to connect to your server. Be sure to specify port 80.\n#3. Send \"get /foo\" and Apache will return the standard 301 \"this is located at\n/foo/\" (note the trailing slash).\n#4. Now send \"get /foo/\" and notice how Apache sends a 501 - \"Not Implemented.\"\n#5. Finally, send \"GET /foo/\" and you will recieve the correct response.\n\nTo expound/recap/emphasize, the bug appears in #3, where Apache returns 301 -\n\"Moved Permanently\" after a lowercase command was sent, instead of returning\n501, which it should to be standards conformant.\n\nNote that Apache will send a 501 if you send \"get /thisdirdoesntexist\", where\n'thisdirdoesntexist' is a directory on the server that, well, doesn't exist.\nThis has only been tested on my system, and not tested elsewhere.\n\n-dav7", "attachment_id": null, "id": 108147, "creation_time": "2008-02-24T04:11:42Z", "time": "2008-02-24T04:11:42Z", "creator": "dav7@dav7.net", "bug_id": 44477, "is_private": false}, {"count": 1, "tags": [], "text": "What standard exactly is being violated here?\n\nSome of your assumptions are wrong. When apache sees \"get /foo\" it treats it\nexactly like \"BAR /foo\". In other words, it treats it as an unknown method\nacting on an improperly-canonicalized directory. It is not doing a\ncase-insensitive match on GET.\n\nSo what is happening is that apache ignores the method entirely when it receives\na request for an improperly-canonicalized directory and simply sends the\nredirect. In the case of \"BAR /foo\", apache doesn't even try to determine\nwhether the resource /foo will actually deal with the method BAR. Trying to\ncheck this would add considerable complexity for very little gain.\n\nAnd by the way, \"get /foo\" and even \"GET /foo/\" are not correct requests in any\nrecent version of http. If you are testing protocol compliance, you should start\nwith a reasonable request.", "is_private": false, "bug_id": 44477, "id": 106796, "time": "2008-02-24T13:48:14Z", "creator": "slive@apache.org", "creation_time": "2008-02-24T13:48:14Z", "attachment_id": null}]