[{"count": 0, "tags": [], "bug_id": 44479, "is_private": false, "text": "Currently have a bug submitted with Mozilla.Org (Bug 347934) referring to an\ninability to connect to Port 0 using Mozilla.\n\nI decided on my Mac (OS X 10.4.11) to use Apache (1.3.33) and configure it to\nbind port 0 in order to test it, and do some probing.\n\nI was unable to bind Apache to Port 0. The error message I receive is:\n\n*snip*\nThe port number \"0\" is outside the appropriate range (i.e., 1..65535)\n*end snip*\n\nThe manual says the number for the port directive is a number from 0 to 65535.\nThe source in http_core.c (line 2100 in apache-1.3_20080224231903.tar.gz) has:\n\n*snip*\nif (port <= 0 || port >= 65536) { /* 65536 == 1<<16 */\n*end snip*\n\nI would like to suggest \"port <=0\" be changed to \"port < 0\".\n\nTo preempt the argument, \"You shouldn't be using Port 0 anyways!\" I will snip a\nbit from my Mozilla Bug:\n\n*snip\nAfter reading the source cited among others, I concede that there really SHOULD\nNOT be a server listening on Port 0, per IANA. (BTW, Windows is not the only OS\nthat handles Port 0 weirdly.)\n\nSHOULD NOT in a RFC being defined as:\n\n4. SHOULD NOT   This phrase, or the phrase \"NOT RECOMMENDED\" mean that\n   there _may exist valid reasons_ in particular circumstances when the\n   particular behavior is acceptable or even useful, but the full\n   implications should be understood and the case carefully weighed\n   before implementing any behavior described with this label.\n\nPlease note the IANA Assigned Numbers document (which evolved from RFC 1700 and\n3232) does not say \"MUST NOT\" is says \"SHOULD NOT\".\n\nNow Mozilla/Firefox/Lynx/IE/Opera/etc... are used on both public and PRIVATE\nnetworks. The instance I named my problem with was on a PRIVATE government\nnetwork.\n\nI would offer the opinion, that using the \"SHOULD NOT\" definition, that someone\non both a private and public network COULD setup a HTTP server on Port 0 or\n21/22 (FTP), 25 (SMTP), etc..  if they wanted to. They SHOULD NOT, but they\ncan.\n*end snip*\n\nA Web Admin SHOULD NOT, but that does not mean they SHOULD NOT be able to.\n\nAs I am a first time poster to the Bugzilla Database, I will attempt to get a\ndiff file tested and posted within the week.\n\nI am interested in anyone's opinion on the Port 0 matter.\n\nThank you for your time.\n\n~Warren", "id": 106794, "time": "2008-02-24T21:38:30Z", "creator": "halsteaw@yahoo.com", "creation_time": "2008-02-24T21:38:30Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 44479, "attachment_id": null, "text": "It is not possible to bind to port zero using the BSD sockets interface; a value\nof zero means \"pick any port\".", "id": 106329, "time": "2008-02-25T03:41:26Z", "creator": "jorton@redhat.com", "creation_time": "2008-02-25T03:41:26Z", "is_private": false}]