[{"count": 0, "tags": [], "bug_id": 4450, "attachment_id": null, "is_private": false, "id": 7196, "time": "2001-10-26T07:13:21Z", "creator": "simon_g_brown@yahoo.com", "creation_time": "2001-10-26T07:13:21Z", "text": "Specifying an incorrect DTD in the webapp descriptor file (WEB-INF/web.xml) \ndoesn't seem to affect the use of the webapp. A good example of an incorrect \nDTD is:\n\n<!DOCTYPE web-app\n    PUBLIC \"-//Sun Microsystems, Inc.//DTD Web Application 2.3//EN\"\n    \"http://java.sun.com/j2ee/dtds/web-app_2_3.dtd\">\n\nOther JSP 1.2 servers refuse to startup webapps that don't specify the DTD as:\n\n<!DOCTYPE web-app\n    PUBLIC \"-//Sun Microsystems, Inc.//DTD Web Application 2.3//EN\"\n    \"http://java.sun.com/dtd/web-app_2_3.dtd\">\n\nThis isn't a big issue, but can cause confusion when porting from Tomcat to \nother servers. Is it possible that a warning could be displayed in the console \nwhen an incorrect DTD is referenced? This would be similar to the way that \nerrors in the web.xml file are shown.\n\nCheers\nSimon"}, {"count": 1, "tags": [], "text": "This behavior is actually an artifact of how XML parsers process DOCTYPE\nentities.\n\nBasically, the parser calls resolveEntity() on the PUBLIC identifier (the part\nthat starts \"-//Sun ...\").  If a local copy of the DTD cannot be found, then and\nonly then does it try to use the SYSTEM identifier (the http://... part) to look\nup the DTD.\n\nTomcat registers a local copy of all the DTDs it uses, so it will always find\nthe internal copy -- among other things, this means that you can run Tomcat on a\nmachine disconnected from the Internet.  It also makes things start up faster,\neven on a network-connected machine, because no retrieval of the DTD is\nrequired.\n\nRight now, Tomcat doesn't ever read the web.xml file itself -- it simply asks\nthe XML parser to read it.  Adding a warning message as you suggest would\nrequire an extra pass through the file at startup time to produce the message --\nis it really worth slowing down application startup for this?  I'm inclined to\nsay no, so I'm marking this as a \"WONTFIX\".  Feel free to reopen it if you feel\nstrongly that Tomcat should be able to do this for you.\n", "attachment_id": null, "bug_id": 4450, "id": 7268, "time": "2001-10-29T10:30:31Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-10-29T10:30:31Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 4450, "text": "Forgot to actually change the status...", "id": 7269, "time": "2001-10-29T10:30:57Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-10-29T10:30:57Z", "is_private": false, "attachment_id": null}]