[{"count": 0, "tags": [], "bug_id": 44519, "text": "Created attachment 21609\nTestcase for 2.0.1 with working property expansion\n\nThis bug is a spin-off of #40934\n\nSince JDBC has been split in configuration and sampler, no properties can be used in JDBC configuration dialog, i.e. using \"jdbc:oracle:thin:@${dbHost}:1521:${db}\" as DB-URL doesn't replace dbHost and db with their values from user parameters element. This was not the case with 2.0.1's JDBC sampler.\n\nAttached are two files. First one is the working version from 2.0.1, which includes two JDBC sampler which use either expanded configuration from user properties or verbatim data. Both work as expected producing equal results. Second file is a test case for JMeter 2.3.1, using two JDBC configuration elements and corresponding samplers, again one with properties expansion and one with verbatim parameters. In this case, first sampler tries to connect to (verbatim) host \"${dbHost}, which fails, second sampler works as expected.", "id": 114183, "time": "2008-03-03T00:12:10Z", "creator": "nikolai@prokoschenko.de", "creation_time": "2008-03-03T00:12:10Z", "is_private": false, "attachment_id": 21609}, {"count": 1, "tags": [], "creator": "nikolai@prokoschenko.de", "attachment_id": 21610, "is_private": false, "id": 114184, "time": "2008-03-03T00:12:48Z", "bug_id": 44519, "creation_time": "2008-03-03T00:12:48Z", "text": "Created attachment 21610\nTestcase for 2.3.1 with non-functional property expansion"}, {"count": 2, "attachment_id": null, "bug_id": 44519, "text": "I don't mean to nag anyone with this comment, but I would really appreciate a fix for this bug or at least some kind of hint, so I'd know where to look for the problem -- I'm unfortunately completely ignorant of JMeter code structure. Thanks.", "id": 114666, "time": "2008-03-16T15:53:33Z", "creator": "nikolai@prokoschenko.de", "creation_time": "2008-03-16T15:53:33Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 44519, "attachment_id": null, "is_private": false, "id": 114747, "time": "2008-03-19T08:06:50Z", "creator": "nikolai@prokoschenko.de", "creation_time": "2008-03-19T08:06:50Z", "text": "So, I've done some research and I think I've got the problem nailed down.\n\nDataSourceElement (JDBC's configuration element) doesn't make any use of properties. At the same time, PreCompiler uses ValueReplacer to replace parameters in all properties of each traversed TestElement, which DataSourceElement is too (Relevant method: PreCompiler.addNode()).\n\nEvery other configuration element I've seen uses setProperty() and getPropertyAs*() for all of its getters and setters, but DataSourceElement is a bean (don't know whether this is relevant), which uses fields instead of properties to store data.\n\nI hope this helps in fixing the bug."}, {"count": 4, "tags": [], "bug_id": 44519, "is_private": false, "text": "The test case for 2.3.1 is invalid.\n\nThe variables are defined in a pre-processor, which is invoked AFTER the JDBC config.\n\nIf the variables are defined using the User Defined Variables Config item instead, then the test plan will work.\n\nPlease try as above and re-open with a new test case if that does not solve the problem.", "id": 114798, "time": "2008-03-19T19:09:28Z", "creator": "sebb@apache.org", "creation_time": "2008-03-19T19:09:28Z", "attachment_id": null}]