[{"count": 0, "tags": [], "creator": "lance@lancehendrix.com", "attachment_id": null, "id": 114452, "time": "2008-03-09T20:19:27Z", "bug_id": 44569, "creation_time": "2008-03-09T20:19:27Z", "is_private": false, "text": "There are a number of items with regard to Tomcat integration that should be updated.\n\nThe Tomcat \"Class Loader\" howto link in the documentation is broken.  \n\nThe documentation does not mention adding the -Djava.endorsed.dirs= setting that must be added to the Tomcat configuration (for correctly telling the JVM to use the endorsed libraries, thus you get a class not found error)\n\nThere are a few other nits in the documentation that should be addressed or more documentation should be added.\n\nThis is all pretty fresh in my mind since I have just wrestled through this myself so I don't mind checking out the documentation from SVN, applying the changes and posting those changes back to this issue, if that is ok?\n\nLet me know if this has already been addressed or if I have a green light to work on the documentation as I don't want to duplicate someone else's efforts."}, {"count": 1, "tags": [], "text": "(In reply to comment #0)\n\n> This is all pretty fresh in my mind since I have just wrestled through this\n> myself so I don't mind checking out the documentation from SVN, applying the\n> changes and posting those changes back to this issue, if that is ok?\n\nWe're currently migrating the documentation from Forrest to Lenya, so it's kind-of freezed. Unfortunately the migration is blocked due to an open task of the infrastructure team. You can take a look at the new docs here:\n\nhttp://lenya.zones.apache.org:8080/lenya/docu/live/index.html\n\nWe haven't discussed yet how we will handle contributions. Maybe we'll just give you an account for the authoring environment.\n\nThanks a lot for reporting and offering your help,\nAndreas\n\n", "is_private": false, "id": 114454, "creator": "andreas@apache.org", "time": "2008-03-10T03:30:40Z", "bug_id": 44569, "creation_time": "2008-03-10T03:30:40Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 44569, "is_private": false, "id": 114455, "time": "2008-03-10T03:33:07Z", "creator": "andreas@apache.org", "creation_time": "2008-03-10T03:33:07Z", "tags": [], "text": "(In reply to comment #1)\n\n> so it's kind-of freezed.\n\nUh-oh. Frozen. Sorry :)\n"}]