[{"count": 0, "tags": [], "bug_id": 44585, "text": "Hi,\n\nI have issue with sticky session and the way the mod_jk tries to resolve jvmRoute! \nImagine this example: we have two tomcat with two applications A and B deployed on both tomcat. The application A is deployed within root context (context path /) and B is within context /b. \nUser makes request to the application B. The application B makes new http session, and redirects the browser to the application A. If this request is served by first tomcat; browser will receive: Cookie: jsessionid=xxx.jvmRoute_1 (path /b) and HTTP Response: code 302, Location=http://host/a.\nBrowser will make request: GET http://host/a (there is no cookie because the cookie jsessionid=xxx.jvmRoute_1 have context path /b).\nMod_jk decide to send this request to second tomcat. The application A makes new http session and redirect the browser to the application A (request.encodeURL is used). The browser receives: Cookie: jsessionid=yyy.jvmRoute_2 (path /) and HTTP Response: code 302, Location=http://host/b/toto;jsessionid=yyy.jvmRoute_2. \nIn this case browser will send HTTP Get: http://host/b/toto;jsessionid=yyy.jvmRoute_2 with cookies: jsessionid=xxx.jvmRoute_1,jsessionid=yyy.jvmRoute_2. When mod_jk resolves jvmRoute it will find that this request have to be sent to the second tomcat, and the session made in the first request to the application B will be lost (imagine if this session is about authentication). \nIs it normal that mod_jk when try to resolve jvmRoute check firs the jsession id in the url path instead in the cookies?", "id": 114507, "time": "2008-03-11T13:51:49Z", "creator": "jjureta@videotron.ca", "creation_time": "2008-03-11T13:51:49Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "markt@apache.org", "text": "Use of the emptySessionPath configuration option looks like it might help here. If you need more assistance, please use the users list in the first instance.", "id": 114931, "time": "2008-03-24T15:34:45Z", "bug_id": 44585, "creation_time": "2008-03-24T15:34:45Z", "tags": [], "is_private": false}]