[{"count": 0, "tags": [], "bug_id": 44602, "attachment_id": null, "id": 114612, "time": "2008-03-13T15:13:10Z", "creator": "aleksandersen+issues.apache.org@runbox.com", "creation_time": "2008-03-13T15:13:10Z", "is_private": false, "text": "mod_negotiate sets an Content-Location header that cannot be modified. This is reasoned because it is “protocol critical”.\n\nI would still like to be able to choose whether to include a relative URI or an absolute URI that is sent from the header.\n\nI fully understand that the server thinks it knows best. But as the protocol supports both ways and it really would not make anything break by having the option of including the absolute URI … Well, I do not see the reason not to let users have that option.\n\nThe scenario for including an absolute URI being that I would like a way to inform users and search engines of the absolute/preferred URI for a resource. Say I have two domain names—or just a www. and a www.-less version of one domain—the idea being that I would prefer having users and indexes include the absolutely preferred URI with the www. prefix or from the most preferred domain name. Instead of pushing the users/spiders trough a painful 301 redirect, I think it would be a much better practise to simply include an absolute URI to the resource instead. If a user accesses the resource from the preferred host, then serving the relative URI seams to be the best option.\n\n  SetEnvIfNoCase Host \"^!www.preferred.com$\" header/content-location=absolute-uri\n\nIn today’s releases I cannot even unset and manually set the Content-Location header when it is genereated by mod_negotiation. (Or maybe it is mod_dir that makes the header. I am not absolutely sure.)\n\nNOTE! I do not know whether this should be filled for the mod_headers component in stead. Someone who knows are encouraged to modify the bug if it is better suited there."}, {"count": 1, "tags": [], "bug_id": 44602, "is_private": false, "text": "Also Server header cannot be modified:\n\nHeader unset Server\nHeader set Server \"serv\"\n\ndoes not works.", "id": 114883, "time": "2008-03-22T16:11:11Z", "creator": "bugzilla@netspider.kiev.ua", "creation_time": "2008-03-22T16:11:11Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "aleksandersen+issues.apache.org@runbox.com", "text": "(In reply to comment #1)\n> Also Server header cannot be modified:\n> \n> Header unset Server\n> Header set Server \"serv\"\n> \n> does not works.\n\nThat is not related to this bug.", "id": 114886, "time": "2008-03-22T17:12:46Z", "bug_id": 44602, "creation_time": "2008-03-22T17:12:46Z", "tags": [], "is_private": false}]