[{"count": 0, "tags": [], "bug_id": 44634, "attachment_id": null, "text": "Hi \nPlease help on this,\n\nI would really like to insert a hyperlink to pdf output, I wish this link will be opened in a new browser window?\n\nI knew that show-destination attribute of <fo:basic-link> tag was not supported jet. Could you please tell me another workaround to satisfy\n\nI'm using Adobe 8 and IE 7\nThanks\nLuong To", "id": 114751, "time": "2008-03-19T08:44:40Z", "creator": "lto@fcg.com", "creation_time": "2008-03-19T08:44:40Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 44634, "attachment_id": null, "is_private": false, "id": 114759, "time": "2008-03-19T09:41:38Z", "creator": "jeremias@apache.org", "creation_time": "2008-03-19T09:41:38Z", "text": "I don't think there is a work-around. \"show-destination\" on basic-link simply has to be implemented. In PDFGoToRemote, the \"NewWindow\" entry has to be implemented, too, and the two things have to be connected via the PDFRenderer. Patches are welcome."}, {"count": 2, "tags": [], "creator": "lto@fcg.com", "text": "How can I hard-code for links will be opened in new window?\n\nThanks much", "id": 114906, "time": "2008-03-23T18:45:17Z", "bug_id": 44634, "creation_time": "2008-03-23T18:45:17Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "jeremias@apache.org", "text": "(In reply to comment #2)\n> How can I hard-code for links will be opened in new window?\n> \n> Thanks much\n\nYou're still looking for a work-around. I told you, there's none. Someone needs to implement this properly. There's no way around that. If you absolutely want a work-around, you can try inserting that \"NewWindow\" flag using a third-party PDF library (like PDFBox or iText). No guarantees that it'll work.\n\n\n", "id": 114940, "time": "2008-03-25T01:09:18Z", "bug_id": 44634, "creation_time": "2008-03-25T01:09:18Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 44634, "is_private": false, "id": 115109, "attachment_id": null, "creator": "adelmelle@apache.org", "creation_time": "2008-03-30T07:59:07Z", "time": "2008-03-30T07:59:07Z", "text": "\nBeen looking into this, and I think I got it working (see patch in attach)\n\nThe only thing that's keeping me from committing ATM is that I'm unsure how to test for it...\n"}, {"count": 5, "tags": [], "bug_id": 44634, "attachment_id": 21738, "text": "Created attachment 21738\npatch for the implementation", "id": 115110, "time": "2008-03-30T08:00:34Z", "creator": "adelmelle@apache.org", "creation_time": "2008-03-30T08:00:34Z", "is_private": false}, {"count": 6, "attachment_id": null, "bug_id": 44634, "is_private": false, "id": 115121, "time": "2008-03-30T23:25:54Z", "creator": "adelmelle@apache.org", "creation_time": "2008-03-30T23:25:54Z", "tags": [], "text": "\nAdditional reservations:\nThe patch only adds show-destination functionality for links with an external-destination. Internal links are converted to destinations or local /GoTo actions, and there does not seem to be a way of forcing these to open in a new window.\nI have checked the behavior of Adobe Reader standalone and the web-browser plugin. \nThe /NewWindow flag works as expected in standalone mode, but the plugin seems to happily ignore it.\nFor external-links to non-PDF content (PDF: /URI action), the target obviously opens in a new web-browser window when clicked from Adobe Reader standalone. When viewed with the browser-plugin, the link always seems to target the current tab/window.\n\nUnless I'm missing something, implementing this in a way that is 100% compliant with the XSL-FO Rec, is not possible...?"}, {"count": 7, "tags": [], "bug_id": 44634, "attachment_id": null, "text": "Good stuff, Andreas (only a quick glance taken). The only thing that is probably missing is a parse method for the intermediate format.\n\nI guess if the Acrobat plug-in does not handle the \"NewWindow\" flag properly, there's not much we can do. It probably needs to be considered a bug in Adobe's code.", "id": 115122, "time": "2008-03-30T23:35:58Z", "creator": "jeremias@apache.org", "creation_time": "2008-03-30T23:35:58Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 44634, "attachment_id": null, "is_private": false, "id": 115126, "time": "2008-03-31T00:26:27Z", "creator": "bowditch_chris@hotmail.com", "creation_time": "2008-03-31T00:26:27Z", "text": "<quote>\nI guess if the Acrobat plug-in does not handle the \"NewWindow\" flag properly,\nthere's not much we can do. It probably needs to be considered a bug in Adobe's\ncode.\n</quote>\n\nI'm not sure that behaviour is a bug. Undesirable maybe. My understanding is that Adobe Reader plugin uses the option \"Display PDF in Browser\" under Edit\\Preferences menu (Internet Tab) to decide whether to open a separate window for PDF links or not."}, {"count": 9, "tags": [], "creator": "adelmelle@apache.org", "text": "(In reply to comment #7)\n> Good stuff, Andreas (only a quick glance taken). The only thing that is\n> probably missing is a parse method for the intermediate format.\n\nRight. I'll have to adapt AreaTreeParser.setTraits() as well, since the external-link Trait is no longer a simple String.\n\n> \n> I guess if the Acrobat plug-in does not handle the \"NewWindow\" flag properly,\n> there's not much we can do. It probably needs to be considered a bug in Adobe's\n> code.\n> \n\nA bug or a missing feature, indeed. It is also not possible, AFAICT, to open a different destination in the same document in a new window. Still, if I interpret correctly, this is the expected behavior for show-destination=\"new\", no matter whether the destination is internal or external.\n\n[Chris:]\n> I'm not sure that behaviour is a bug. Undesirable maybe. My understanding is\n> that Adobe Reader plugin uses the option \"Display PDF in Browser\" under\n> Edit\\Preferences menu (Internet Tab) to decide whether to open a separate\n> window for PDF links or not.\n\nNot exactly. The above option controls whether the plugin is used altogether if you enter a PDF address in the browser's address bar or click a hyperlink targeting a PDF. If you disable it, then Adobe Reader or Acrobat is always used standalone to view PDFs. There is another option that also relates to the /NewWindow flag. On the General Tab, I have the possibility to disable \"Open cross-document links in the same window\". This determines what happens if no explicit value for the /NewWindow flag is specified. Only, this option does not influence the behavior in the plugin; only relevant for standalone mode.", "id": 115129, "time": "2008-03-31T03:35:17Z", "bug_id": 44634, "creation_time": "2008-03-31T03:35:17Z", "is_private": false, "attachment_id": null}, {"count": 10, "tags": [], "creator": "adelmelle@apache.org", "text": "\nChanges applied to FOP Trunk.\n\nsee http://svn.apache.org/viewvc?rev=651575&view=rev\n\nFor the moment, I'm leaving the bug open, given the limitations of the added implementation...", "id": 115866, "time": "2008-04-25T04:29:32Z", "bug_id": 44634, "creation_time": "2008-04-25T04:29:32Z", "is_private": false, "attachment_id": null}, {"count": 11, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "id": 157578, "time": "2012-04-07T01:44:49Z", "bug_id": 44634, "creation_time": "2012-04-07T01:44:49Z", "is_private": false, "text": "resetting P2 open bugs to P3 pending further review"}, {"count": 12, "tags": [], "bug_id": 44634, "attachment_id": null, "text": "change status from ASSIGNED to NEW for consistency", "id": 157889, "time": "2012-04-11T06:15:50Z", "creator": "gadams@apache.org", "creation_time": "2012-04-11T06:15:50Z", "is_private": false}]