[{"count": 0, "attachment_id": 21690, "bug_id": 44637, "is_private": false, "id": 114762, "time": "2008-03-19T10:36:21Z", "creator": "mhe@ordix.de", "creation_time": "2008-03-19T10:36:21Z", "tags": [], "text": "Created attachment 21690\nEclipse Project that shows the problem.\n\nProblem manifests when using converter-for-class strategy within a JSF application.\n\nI tested JSF RI 1.2.0 as well as My Faces 1.2.2.\n\nA converter is mapped for a BackingBean class. The first symptom I noticed was the converters getAsObject() method not being called. I investigated further, and tracked it down to a call to JspValueExpression that both RI and MyFaces make:\n\n(_SharedRendererUtils: Line 58)\nClass valueType = expression.getType(facesContext.getELContext());\n\nIn my case this call always returns Object.class as valueType, leading to the converter not being called.\n\nI have attached an eclipse workspace that includes a simple demo of the problem. I have left out the MyFaces Libs, so to make the example work please grab a copy of the libs on the myfaces site."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 114905, "time": "2008-03-23T18:11:29Z", "bug_id": 44637, "creation_time": "2008-03-23T18:11:29Z", "text": "My build environment isn't compatible with the Eclipse project you have attached. Please can you build the war and attached that. Note: you can leave out the MyFaces libs if necessary and I can add them manually."}, {"count": 2, "tags": [], "text": "Sorry for the delay, I was on vacation last week.\n\nI'll attach the war as requested. Let me know if you need further infos or having further problems recreating the behaviour.", "attachment_id": null, "id": 115131, "creator": "mhe@ordix.de", "time": "2008-03-31T04:14:15Z", "bug_id": 44637, "creation_time": "2008-03-31T04:14:15Z", "is_private": false}, {"count": 3, "tags": [], "text": "Created attachment 21740\nWAR File with blank JARs\n\nI left the JARs as 0-byte files in WEB-INF/lib. Just replace them with the corresponding files.", "is_private": false, "id": 115132, "creator": "mhe@ordix.de", "time": "2008-03-31T04:17:56Z", "bug_id": 44637, "creation_time": "2008-03-31T04:17:56Z", "attachment_id": 21740}, {"count": 4, "tags": [], "text": "I have traced this call and, as far as I can tell, the Tomcat code is just a thin veneer around some more MyFaces code - specifcialy org.apache.myfaces.el.unified.resolver.FacesCompositeELResolver.getType()\n\nI can't see anything obviously wrong with what Tomcat is passing back so at the moment this looks like a MyFaces issue.\n\nI am no JSF expert so if the MyFaces folks say this is a Tomcat issue I am more than prepared to believe them but I am going to need some clear pointers to where Tomcat isn't behaving in order to look into any fix.\n\nI am marking this as invalid whilst the my faces folks look at it. Feel free to re-open this it it is found to be a Tomcat bug.", "is_private": false, "id": 115211, "creator": "markt@apache.org", "time": "2008-04-01T16:28:18Z", "bug_id": 44637, "creation_time": "2008-04-01T16:28:18Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "I don't know the inner workings between EL and JSF that well. But it least it gives me a hint where to look next. I'm closing this bug.\n\nThanks for looking into this for me, Mark.", "is_private": false, "bug_id": 44637, "id": 115237, "time": "2008-04-02T03:11:25Z", "creator": "mhe@ordix.de", "creation_time": "2008-04-02T03:11:25Z", "attachment_id": null}]