[{"count": 0, "tags": [], "bug_id": 44654, "attachment_id": null, "id": 114856, "time": "2008-03-21T16:35:27Z", "creator": "cam@apache.org", "creation_time": "2008-03-21T16:35:27Z", "is_private": false, "text": "It would be good if the rasterizer application could output multiple raster images corresponding to different document times.  Ruud suggests having -snapshotStartTime, -snapshotFrameRate and -snapShotEndTime command line arguments."}, {"count": 1, "tags": [], "bug_id": 44654, "text": "If it helps, I fully agree. The rasterizer should be able to render the frames of an animation. This should be done by a start and end time. I'm having a very difficult time finding a way to get the frames rendered from any SVG program, so it would make Batik unique. Frame rate should be an additional option as well. It would be useful to get an SVG based animation past the 10 fps mark and into the 24-30 mark. I'm dying for a tool like it, as I'm sure other people have or are right now. :)", "id": 119849, "time": "2008-08-14T21:29:09Z", "creator": "adorablelostpuppy@gmail.com", "creation_time": "2008-08-14T21:29:09Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 44654, "attachment_id": null, "text": "(In reply to comment #0)\n> It would be good if the rasterizer application could output multiple raster\n> images corresponding to different document times.  Ruud suggests having\n> -snapshotStartTime, -snapshotFrameRate and -snapShotEndTime command line\n> arguments.\n\nThis sounds like a great extension! :-) A great helper for cases (not Batik, of course!) when no SMIL animation is available (Firefox, for example) or no SVG support at all (Internet Explorer, as usual).\n\nInstead of outputting several images, it would be even greater if direct (A)PNG or animated GIF support was directly embedded - although, AFAIK, Internet Explorer also doesn't support (A)PNG so sticking with animated GIF would be a good (though ugly) option taking the current browser environment...", "id": 122590, "time": "2008-11-18T03:42:25Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-11-18T03:42:25Z", "is_private": false}]