[{"count": 0, "text": "Task 'get' should allow alternative paths (or sources of download):\nRight now there's only a 'src' attribute, but the most useed case of this task is to download jar libraries from remote servers. If the jar is not available from one server(or the server is down), it might be available from another, but this is very complicated to make right now with ANT (and makes the build.xml complicated and ugly).\nThe simplest solution would to support \"alternative\" download paths, so that when one download fails (for a specific jar) than to use next from the list of alternatives.", "bug_id": 44661, "is_private": false, "id": 114893, "time": "2008-03-23T06:08:48Z", "creator": "gustav_weber75@yahoo.com", "creation_time": "2008-03-23T06:08:48Z", "tags": [], "attachment_id": null}, {"count": 1, "text": "I dont know what the most popular use of <get> is; certainly in my projects its probing webapps I've just deployed.\n\n\nLooking at this and your other list of requirements, I can see you are trying to use <get> for library management. Can I point you at our affiliate project, Ivy, that handles all this for you? ", "bug_id": 44661, "is_private": false, "id": 114941, "time": "2008-03-25T03:50:32Z", "creator": "stevel@apache.org", "creation_time": "2008-03-25T03:50:32Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 44661, "attachment_id": null, "is_private": false, "id": 115667, "time": "2008-04-17T05:50:02Z", "creator": "gustav_weber75@yahoo.com", "creation_time": "2008-04-17T05:50:02Z", "text": "> Looking at this and your other list of requirements, I can see you are trying\n> to use <get> for library management. \nYes, but a very very simple management, like it's done in many open source projects like:\nFreeMarker:\nhttp://freemarker.svn.sourceforge.net/viewvc/freemarker/trunk/freemarker/build.xml\nor even better\nClick Frameowrk:\nhttp://click.sourceforge.net/docs/building.html#ant-targets\n(see get-deps task)\n\n\n> Can I point you at our affiliate project,\n> Ivy, that handles all this for you? \nI'm aware of Ivy(and used it) but I think it's an overkill for most simple projects(and one could have used Maven as well), and for that very simple reason ANT would just do it.\n\nI also don't think this would be any duplication with IVY since Ivy would handle complex situations. \n\nFor very simple projects however were only a few jars are present, the tasks I descibed would solve the problems and would pose no learning barrier to the (new)users (exactly the main argument of ANT over maven).\n\nThank you,\n\nGustav."}]