[{"count": 0, "tags": [], "text": "I would like to suggest that JMeter should make the username and password entered in the Login Config Element available to other elements as user variables.  This should be available as an option.\n\nWhen I recently used JMeter to test a web application that involved form-based athentication, I needed to specify the username and password form fields as parameters in the HTTP Request element.  The field used for the password had no protection at all, so it was readily visible.  Later, I noticed the Login Config Element that can be used to supply login information to other elements that require it (the LDAP element and perhaps others).  I see that it does obscure passwords.\n\nI think the option I am suggesting could be implemented in this way:  The Login Config Element could have a checkbox that says \"store username and password in user variables\".  If that checkbox is checked, two text fields would become active that would let the user enter the names of variables to store each of the username and password.  Default values for those variable names could be already entered in the fields as \"USER\" and \"PASS\".  Then, when a user wants to create an HTTP Request with username and password parameters, they can use ${USER} and ${PASS} instead of providing actual plain-text values in the request element.\n\nI realize that the Login Config Element stores the password as plain text in .jmx files, and that should probably change as well.  But those changes should be the subject of separate suggestions, and I think this will help make users feel a little better about entering passwords in JMeter.", "is_private": false, "id": 115026, "creation_time": "2008-03-27T07:53:30Z", "time": "2008-03-27T07:53:30Z", "creator": "lsloan-issues.apache.org@umich.edu", "bug_id": 44690, "attachment_id": null}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 115028, "time": "2008-03-27T07:58:21Z", "bug_id": 44690, "creation_time": "2008-03-27T07:58:21Z", "is_private": false, "text": "You can provide the password on the command line:\n\njmeter -Jpassword=secret\n\nand refer to it as ${__P(password)}\n\nThis avoids storing the password in the JMX file."}, {"count": 2, "tags": [], "text": "This is already possible as described by sebb.", "attachment_id": null, "bug_id": 44690, "id": 155073, "time": "2012-03-19T20:27:47Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-03-19T20:27:47Z", "is_private": false}]