[{"count": 0, "tags": [], "text": "In the ooxml branch, I have converted HSSFFormulaEvaluator to work with the new generic interfaces. All of the HSSF formula tests still pass. Many simple formulas for XSSF can be evaluated just fine\n\nNext up, I've taken a copy of the TestFormulasFromSpreadsheet test, and saved the test spreadsheet as .xlsx. This xssf version is in svn as org.apache.poi.xssf.usermodel.TestFormulaEvaluatorOnXSSF\n\nUnfortunately, when running for xssf, lots of the formulas fail to evaluate properly, so I've had to disable the test (it's called DISABLEDtestFunctionsFromTestSpreadsheet)\n\nI suspect the issue is that XSSFWorkbook doesn't have a model.Workbook, which model.FormulaParser expects, as possibly do some of the eval bits. XSSF doesn't have anything equivalent. Probably, we'll need to tweak various bits to not use the low level model.Workbook, but use the higher level stuff instead (since both xssf and hssf have high level stuff). Otherwise, we'll have to try and bodge up a fake model.Workbook for xssf", "is_private": false, "bug_id": 44708, "id": 115112, "time": "2008-03-30T08:31:27Z", "creator": "apache@gagravarr.org", "creation_time": "2008-03-30T08:31:27Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 44708, "text": "fixed in svn r645298.  Most of the failures were due to xssf classifying empty cells as type 'numeric'.  XSSF internally uses *numeric* cells with no value to represent 'blank' cells.  However, it is useful to distinguish 'blank' cell type for evaluating formulas.  The rest of POI seems to rely on this.\n\nAfter the fix, the far majority of function test evaluations work:\n\"There were 862 successful evaluation(s) and 93 function(s) without error\"\nSo I decided to enable the whole test, but specifically skip the 3 remaining failing evaluation cases.\n\nThe first bug is related to parsing of full column references.  This is a bug in trunk too, and should probably be fixed there (I think there is already a bugzilla for this).\n\nThe second remaining bug (just one(?!)) is related to the missing Workbook object.  \nI have opened the a new bugzilla bug 44762 to track the work for this second bug.\n\n\nNote - there is a minor TODOs left in XSSFCell.getNumericCellValue() requesting the spec to be settled.", "id": 115351, "time": "2008-04-06T13:57:39Z", "creator": "josh@apache.org", "creation_time": "2008-04-06T13:57:39Z", "is_private": false, "attachment_id": null}]