[{"count": 0, "tags": [], "bug_id": 44722, "attachment_id": 21747, "text": "Created attachment 21747\nThis attachment contains a WMF witha viewport width of 0 and the resulting svg images after it has been processed by a modified & unmodifed WMFTranscoder\n\nLine 118 on WMFPainter.java resets the scale based on a calculation of scale * the width in pixels / the viewport width.  In the event that the viewport width is zero, division by zero occurs and a the scale is set as \"Infinity.\"  This causes lots of issues downstream and eventually the SVG file is written out with \"?\" in place of numbers in the <path> tags, and the SVG renders completely blank.  If this line is commented out, then the SVG resembles the original WMF, except that only about half of the original content is rendered in the view port.  See the attachment for the original WMF image and the resulting two SVG files.", "id": 115170, "time": "2008-03-31T16:07:24Z", "creator": "brent.pacheco@cerner.com", "creation_time": "2008-03-31T16:07:24Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 44722, "text": "The problem is in the big readRecords method, with the META_SETWINDOWEXT switch. A variable _bext is used to be sure that the viewPort is set only the first time. In this example, the first META_SETWINDOWEXT records all have 0 width and height. The solution is to allow to reset the viewPort after it has been set before. It is wise to also not allow to set viewPort if width or height are 0, as this is an error in the WMF File.\n\nI have applied this solution in my working copy of Batik, and it works. I will propose the (small) patch soon.", "id": 128498, "time": "2009-07-04T10:17:30Z", "creator": "herve.girod@club-internet.fr", "creation_time": "2009-07-04T10:17:30Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "herve.girod@club-internet.fr", "text": "I will send a patch as soon as I can, but these lines in WMFRecordStore:\n\nif (_bext && functionId == WMFConstants.META_SETWINDOWEXT) {\n   vpW = width;\n   vpH = height;\n   if (! isotropic) scaleXY = (float)vpW / (float)vpH;\n   vpW = (int)(vpW * scaleXY);                      \n   _bext = false;\n}\n\nshould be changed to:\n\nif (functionId == WMFConstants.META_SETWINDOWEXT) {\n   if ((width > 0) && (height > 0)) {\n       vpW = width;\n       vpH = height;\n       if (! isotropic) scaleXY = (float)vpW / (float)vpH;\n       vpW = (int)(vpW * scaleXY);  \n   }                    \n}\n\nOf course, _bext is not useful anymore. The check for width and height being\ngreater than 0 is \"just in case\". There are so many faulty WMF files in the\nwild ;)", "id": 128502, "time": "2009-07-05T02:19:39Z", "bug_id": 44722, "creation_time": "2009-07-05T02:19:39Z", "is_private": false, "attachment_id": null}]