[{"count": 0, "tags": [], "text": "Created attachment 21754\nEnforce Redirect argument types / Consistent args / Better error messages.\n\n#1\n\nGiven three arguments to mod_alias/Redirect, the first one should be a HTTP status code, followed by the old and the new, target URL. However, Redirect silently accepts arguments like\n\nRedirect bla / http://anywhere\n\ntakes bla as a URL and redirects it to / (and in turn ignores http://anywhere), instead of complaining that \"bla\" is not a valid HTTP status code.\n\nWhile this is a minor violation of the docs, it frequently bugs the user (read: me) whenever he (me) gets tricked by remembering \"Redirect permanent\" into entering \"Redirect temporary\" instead of the correct \"Redirect temp\", thus adding useless Redirects, causing chaos and doom in the Web.\n\nSince the bug on the user-side has been sitting there for years, won't get fixed soon and might already be considered a feature, I've appended a workaround patch to mod_alias to enforce the words as they've been written in the docs.\n\n\n#2\n\nThe patch furthermore extends the argument list with perm (following the existing temp) and, more important, temporary (following the existing permanent). Makes usage more straight-forward and consistent.\n\n\n#3\n\nAdded brackets to the if-blocks according to the Apache C style.\n\n\n#4\n\nWhile at it, I've prepended \"mod_alias/Redirect: \" to add_redirect_internal()'s error messages. You might know that the line \"Regular expression could not be compiled.\" in error_log comes from a Redirect statement (at least as long as you just modified one), however \"mod_alias/Redirect: Regular expression could not be compiled.\" makes it 100% clear where to look.\nError messages should not be riddles, the error itself is enough.", "is_private": false, "id": 115192, "creator": "st@kino-fahrplan.de", "time": "2008-04-01T10:31:36Z", "bug_id": 44729, "creation_time": "2008-04-01T10:31:36Z", "attachment_id": 21754}, {"count": 1, "tags": [], "bug_id": 44729, "attachment_id": null, "id": 127432, "time": "2009-05-26T17:59:11Z", "creator": "nick@webthing.com", "creation_time": "2009-05-26T17:59:11Z", "is_private": false, "text": "I've committed the arguments checking part of your patch to trunk r778942 .  Don't agree with the error message changes: yours are out-of-line with other startup errors, and will tend to confuse (\"why is this message different?\")."}, {"count": 2, "tags": [], "bug_id": 44729, "attachment_id": null, "text": "Backported to 2.2 in r792917", "id": 128811, "time": "2009-07-13T15:26:00Z", "creator": "nick@webthing.com", "creation_time": "2009-07-13T15:26:00Z", "is_private": false}]