[{"count": 0, "tags": [], "creator": "alexanderdiedler@gmx.de", "attachment_id": null, "id": 115181, "time": "2008-04-01T04:22:49Z", "bug_id": 44725, "creation_time": "2008-04-01T04:22:49Z", "is_private": false, "text": "Hello,\nVery critical things happens in Tomcat.\nIf anybody rename a Appliaction Website Folder (e.g./conf/www.testsite.de -> /conf/www.testsite2.com) in [tomcat_home]/conf and try again to open the Site on a Browser (you see a blank site without Errormessages), Tomcat delete automatically the web.xml and context.xml.\nI found this in Version 6.0.14 and 6.0.16\n\nGreetings\nAlexander Diedler"}, {"count": 1, "tags": [], "bug_id": 44725, "attachment_id": null, "text": "Only if you do this whilst Tomcat is running and only if Tomcat is configured to monitor those configuration files for changes. It will probably (I haven't tested it) be perceived as the removal of every webapp. This would certainly explain what you see.\n\nTomcat does not support changing the name of a host in this way.\n\nFor a range of alternative approaches to achieve what you want to do, please ask on the users list.", "id": 115198, "time": "2008-04-01T11:47:52Z", "creator": "markt@apache.org", "creation_time": "2008-04-01T11:47:52Z", "is_private": false}, {"count": 2, "tags": [], "creator": "andreas.sahlbach@gmail.com", "is_private": false, "id": 116892, "attachment_id": null, "bug_id": 44725, "creation_time": "2008-05-22T03:37:01Z", "time": "2008-05-22T03:37:01Z", "text": "IMHO this is still a bug. \n\nA server should _never_ever_ delete any kind of configuration file. Disable it somehow, move it somewhere else, rename it, whatever. But don't dare to delete it. This configuration file can contain very valuable configurations, even secrets that can be hard to recover. Deleting it is simply wrong.\n\nAnd please point me to the part of the documentation that describes this dreaded behaviour so that I can turn it off.Thank you."}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "The effects aren't documented for the simple reason that editing the configuration directory structure (ie the engine name and host name) whilst Tomcat is running isn't documented since it isn't supported.\n\nI can't see any viable way of supporting such configuration changes whilst Tomcat is running.\n\nThe docs you want are the host doc and the context docs. If you need more help, please use the users list.", "id": 116906, "time": "2008-05-22T10:40:54Z", "bug_id": 44725, "creation_time": "2008-05-22T10:40:54Z", "is_private": false}, {"count": 4, "tags": [], "creator": "godmar@gmail.com", "text": "I just got bitten by this as well.\n\nI wondered why Tomcat (even after restarting the entire server!!!) didn't pick up changes I had made to my /webappname/META-INF/context.xml file, until I discovered via grep -r the cached version of that file in conf/Catalina/localhost/webappname.xml.  I deleted webappname.xml in an attempt to force Tomcat to pick up the updated version of context.xml.\n\nIn retaliation, Tomcat deletes my web.xml file. Fortunately, we were able to restore from CVS.\n\nFiling this as INVALID shows a disturbing attitude on the part of the Tomcat developers. Please understand that we don't have the time to analyze the Tomcat code base for whatever behavior you've programmed into it. We rely on the documentation, and we rely on the assumption that Tomcat shows sensible behavior if in doubt.", "id": 136379, "time": "2010-04-24T13:25:47Z", "bug_id": 44725, "creation_time": "2010-04-24T13:25:47Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "bugzilla@pidster.com", "attachment_id": null, "id": 136385, "time": "2010-04-24T15:38:49Z", "bug_id": 44725, "creation_time": "2010-04-24T15:38:49Z", "is_private": false, "text": "The original bug refers to a situation where a user renamed a critical directory location while the server was running. Tomcat interpreted this as an instruction to undeploy all of the webapps for that host.\n\nAn exploded webapp directory can be completely deleted during undeployment, config files included.\n\nI think the second complaint misunderstands the nature of a Servlet based web application, some configuration is completely self contained and must be replaced - renaming & leaving files in place would prevent the directory being deleted.  Renaming the directory would cause another deployment under the new name.\n\nGodmar:\nAsk on the Users list if you are having problems updating your application, I'll assist."}, {"count": 6, "tags": [], "bug_id": 44725, "is_private": false, "text": "The behaviour if you delete a context.xml is documented here:\n\nhttp://tomcat.apache.org/tomcat-6.0-doc/config/host.html#Automatic%20Application%20Deployment\n\nThe docs seem clear on this to me but if you think there is room for improvement, patches are always welcome (please open a new issue & mark it as an enhancement).", "id": 136389, "time": "2010-04-24T19:19:50Z", "creator": "markt@apache.org", "creation_time": "2010-04-24T19:19:50Z", "attachment_id": null}]