[{"count": 0, "tags": [], "creator": "brobinson@hp.com", "text": "The DoInit1Test servlet tests that an HTTP 500 error code is sent back when a \nrequest is made for it.  When the UnavailableException is thrown out, our \ncontainer does not put the servlet in our servlet pool, and requests for it \nresult in an HTTP 404.  This is legitimate behavior as far as I can tell, as \nthe servlet's servie() method is never called, which is what the test is \ntesting for.\n\nI would suggest modifying GTest so that multiple error codes can be accepted as \nlegitimate results.", "id": 7229, "time": "2001-10-27T21:47:00Z", "bug_id": 4474, "creation_time": "2001-10-27T21:47:00Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "gregw@mortbay.org", "attachment_id": null, "text": "The Jetty WWW server handles an UnavailableException by returning\na 503 Service Unavailable exception, which is perfectly valid\nresponse.", "id": 9203, "time": "2001-12-29T03:26:04Z", "bug_id": 4474, "creation_time": "2001-12-29T03:26:04Z", "is_private": false}, {"count": 2, "tags": [], "creator": "Ryan.Lubke@Sun.COM", "attachment_id": null, "text": "Tomcat also returns a 503.  \n\nIn regards to a 404 being returned to denote permanent unavailablity of a\nservlet.  503 would seem to make more sense in this case.\n\n   \"The server is currently unable to handle the request due to a\n    temporary overloading or maintenance of the server. The implication\n    is that this is a temporary condition which will be alleviated after\n    some delay. If known, the length of the delay may be indicated in a\n    Retry-After header.  If no Retry-After is given, the client SHOULD\n    handle the response as it would for a 500 response.\"\n\nHowever, since the spec doesn't explicitly state that a 503 should be returned\nin the case of permanent unavailablity, the test should probably be excluded\nuntil the spec is clarified at a later date.", "id": 9215, "time": "2001-12-29T20:27:01Z", "bug_id": 4474, "creation_time": "2001-12-29T20:27:01Z", "is_private": false}]