[{"count": 0, "tags": [], "bug_id": 44772, "is_private": false, "text": "Created attachment 21787\nA patch that always fails when the patch command fails.\n\nThe <patch> task does not fail if the invocation of the patch command fails.\n\nAttached are two patches for <patch>:\n\n1. A patch that simply fails the build when the patch command returns a failure result code. This patch changes the default behavior of patch to fail when the patch command fails, which I think is a good thing but may not be the prevailing wisdom of the Ant project since nearly nothing fails on error by default.\n\n2. A patch that adds a \"failOnError\" attribute to the <patch> task which defaults to false, but when set to true fails the build when the patch command returns a failure result code.\n\nActually, it seems that I can only add a single attachment. I will add the first attachment and then hopefully there will be a way to add additional attachments once I file this report.", "id": 115392, "time": "2008-04-07T17:24:58Z", "creator": "mdb@threerings.net", "creation_time": "2008-04-07T17:24:58Z", "attachment_id": 21787}, {"count": 1, "tags": [], "bug_id": 44772, "text": "Created attachment 21788\nA patch that introduces a failOnError attribute to <patch>.\n\nThis and the previous patch are against the 20080407 nightly code snapshot.", "id": 115393, "time": "2008-04-07T17:25:38Z", "creator": "mdb@threerings.net", "creation_time": "2008-04-07T17:25:38Z", "is_private": false, "attachment_id": 21788}, {"count": 2, "attachment_id": null, "creator": "bodewig@apache.org", "text": "svn revision 695779 contains your second patch since backwards compatibility sometimes is more important than having the correct defaults.", "id": 120658, "time": "2008-09-16T02:02:06Z", "bug_id": 44772, "creation_time": "2008-09-16T02:02:06Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 44772, "text": "*** Bug 23540 has been marked as a duplicate of this bug. ***", "id": 129730, "time": "2009-08-17T01:51:38Z", "creator": "bodewig@apache.org", "creation_time": "2009-08-17T01:51:38Z", "is_private": false, "attachment_id": null}]