[{"count": 0, "tags": [], "bug_id": 44771, "attachment_id": null, "text": "ok so far i've checked it on:\napache 2.2.6, 2.2.8\nphp: 5.2.3, 5.2.5,5.2.4\nplatform: win32,linux-debian\nbrowsers: opera/ie/safari/firefox\n\nand i know this bug is present everywhere but on some of the combinations of the given platforms the bug occurs randomly, so here is the description:\ntry to make a form:\n<form method=\"post\">\n<input type=\"password\" name=\"password\" />\n<input type=\"text\" name=\"sometextfield\" />\n<input type=\"submit\" />\n</form>\n\nand for now if you submit the form, the post data will be empty ;/\nbut if you change the name of the field with type password to anything that is different from the name \"password\" everything is working again, \nthe second thing is that even if you leave it but change only the method from post to get, then everything will be working again, \ni dunno what is a problem i tried to find people on the network but as always everyone has it in the ass so i'm posting here this bug with hope that finally someone will help me to do something with it", "id": 115383, "time": "2008-04-07T13:32:38Z", "creator": "mad_man123@o2.pl", "creation_time": "2008-04-07T13:32:38Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 44771, "attachment_id": null, "text": "Trying a PHP users forum might be the best bet; this is highly unlikely to be a bug in httpd.\n\nhttp://www.php.net/mailing-lists.php", "id": 115401, "time": "2008-04-08T01:28:08Z", "creator": "jorton@redhat.com", "creation_time": "2008-04-08T01:28:08Z", "is_private": false}, {"count": 2, "text": "As Joe mentions - not an HTTP Server bug.\n\nBut I have a crazy thought - are you certain that you aren't running into\nsome web filtering or anonmizing app which is stripping these from the\nresulting post in an attempt to \"protect\" you from yourself?", "bug_id": 44771, "attachment_id": null, "id": 115407, "time": "2008-04-08T03:11:25Z", "creator": "wrowe@apache.org", "creation_time": "2008-04-08T03:11:25Z", "tags": [], "is_private": false}]