[{"count": 0, "tags": [], "creator": "aleksandersen+issues.apache.org@runbox.com", "attachment_id": null, "text": "Hi,\n\nurn:ietf:rfc:3986 says to use commas and semicolons instead of dots when dealing with things such as content negotiation. (Actually, it does not say that at all; but it is the point of that RFC.)\n\nLook at this example where all bits of information used in the negotiation process for ../resource is separated with dots.\n\n../resource.en.utf-8.xhtml.gz\n\nThen look at this example where all the keys but the actuall file extension---though note that the example has two extensions---are separated with commas instead.\n\n../resource,en,utf-8.xhtml.gz\n\nAnother approch form urn:ietf:rfc:398 is to use semicolon and value--key pairs. Again, note that the file has two extensions realted to format.\n\n../resource;lang=en;encoding;utf-8.xhtml.gz\n\nBoth methods allow for negotiation matching a file path AND for negotiation that does not match the file path exactly. For example would both the below example still match the correct file because the information is properly separated from the both the file name and file extension.\n\n../resource;encoding;utf-8;lang=en.xhtml.gz\n../resource,utf-8,en.xhtml.gz\n\n...I really hope this will be implemented soon. Ths would clean up all the messy URIs of the world in an instance. (Well, at least it would prevent new URIs from being dirty.)", "id": 115419, "time": "2008-04-08T07:00:32Z", "bug_id": 44779, "creation_time": "2008-04-08T07:00:32Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 44779, "text": "I am intending this for the MultiViews negotiation method. In shorthand, what I want is for the multiviews method to support periods, commas, and semicolons.\n\n../resource,en.htm\n../resource,en.xht\n../resource,de.htm\n../resource,de.xht", "id": 115456, "time": "2008-04-09T05:07:33Z", "creator": "aleksandersen+issues.apache.org@runbox.com", "creation_time": "2008-04-09T05:07:33Z", "is_private": false, "attachment_id": null}]