[{"count": 0, "tags": [], "bug_id": 44791, "text": "Created attachment 21802\nScreen shot showing MailerVisualizer as 3rd pane on Monitor Results\n\nI have created the enhancement suggested in the Comment above the MonitorHealthVisualizer.java source file. The comment suggests to implement the MailerVisualizer.java source file as the 3rd pane on the MonitorHealthVisualizer class. I have done as the Comment suggests and visually it appears to be the same as the original component available under Add Listeners to add the MailerVisualizer. I have done no testing. There are early indications there may be problems if a MailerVisualizer Listener is added after a Monitor Results Listener is added. Please find attached a .PNG of the JMeter gui screen shot of the MonitorHealthVisualizer panel with the newly added MailerVisualizer third pane added to the Monitor Results panel. If the screen-shot is acceptable please reply with criticisms as needed such that I can begin looking into how I should start testing. I have studied build.xml for the various targets: compile-junit and the like but I am not at all sure how to proceed with the testing. For now I can just do so-called unit-testing to see if the pane works as the original Listener. I would very much like to move forward with this work such that the finished source can be contributed to the JMeter project. To implement the third pane I have created a source: MonitorMailerPanel.java that extends JSplitPane and implements the interfaces: TreeSelectionListener, MonitorListener and Clearable. And, the new source file is doing the same dirty work as the MailerVisualizer class. I updated the MonitorHealthVisualizer panel to accommodate the new source file with a private variable: MAILERPANE and one new method: createMonitorMailerPane(). Please advise.", "id": 115479, "time": "2008-04-09T19:34:30Z", "creator": "david@davidwbrown.name", "creation_time": "2008-04-09T19:34:30Z", "is_private": false, "attachment_id": 21802}, {"count": 1, "tags": [], "bug_id": 44791, "text": "\n\n*** This bug has been marked as a duplicate of bug 44802 ***", "id": 115517, "time": "2008-04-10T13:08:18Z", "creator": "sebb@apache.org", "creation_time": "2008-04-10T13:08:18Z", "is_private": false, "attachment_id": null}]