[{"count": 0, "tags": [], "creator": "Tom.Donovan@acm.org", "attachment_id": 21808, "text": "Created attachment 21808\nbranches/2.2.x patch\n\nStarting with Apache 2.2.8, Windows console signal handlers no longer work and the Apache console window has no message loop (i.e. it is never repainted when uncovered). This is due to a change to mpm_winnt.c which creates a \"NUL\" stdout handle for both parent & child processes.  This change was SVN /trunk rev 609354 and /branches/2.2.x rev 609712.\n\nAfter change 609354, console signals are no longer delivered to the parent process.  Specifically: CTRL_BREAK_EVENT which triggers an Apache restart; and CTRL_C_EVENT, CTRL_CLOSE_EVENT, CTRL_LOGOFF_EVENT, and CTRL_SHUTDOWN_EVENT which trigger an Apache shutdown.\n\nThe attached patch creates all Apache child processes with a \"NUL\" stdout at their inception, but leaves the parent process with its original stdout intact when Apache is not started as a service.  \n\nNote that there is pre-existing code to supply a \"NUL\" stdout for the parent process when Apache runs as a service without console handles, and the parent process has no need to catch console signals when running as a Windows service - so Apache behavior as a service remains unchanged.\n\nThis patch causes the parent to re-declare its console signal handler after every restart.  Some libraries used by modules (like perl5xx.dll) declare a signal handler which terminates the process on CTRL_BREAK_EVENT or CTRL_C_EVENT.  This is the reason Apache could only perform one graceful restart when mod_perl was used on Windows.  By re-declaring Apache's parent signal handler after each (re-)configuration, the Apache parent process can catch, handle, and dismiss these signals before any other library's handler can cause the parent process to exit and leave an orphaned Apache child process.\n\nThis patch creates a new copy of the _environ array to pass to apr_proc_create instead of trying to re-use a static copy for subsequent child creations. The comment in mpm_winnt.c that \"it won't change for the lifetime of this parent process\" is not always true.  If a module adds or changes any Windows environment variable during configuration, the _environ array might be realloc'd causing the static copy to have invalid pointers.\n\nThis patch works with Apache 2.2.8 and mod_perl 2.0.3/AS_Perl 5.8.8 and mod_perl 2.0.4rc1/AS_Perl 5.10.0 on Win2k, WinXP, and Vista.  rotatelogs (for both error and access logs) is observed to work correctly through restarts and to terminate completely on shutdown.  Builds with VC6, VS2005 and VS2008 were tested.", "id": 115506, "time": "2008-04-10T08:44:08Z", "bug_id": 44800, "creation_time": "2008-04-10T08:44:08Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 44800, "attachment_id": 21809, "id": 115507, "time": "2008-04-10T08:44:48Z", "creator": "Tom.Donovan@acm.org", "creation_time": "2008-04-10T08:44:48Z", "is_private": false, "text": "Created attachment 21809\ntrunk patch"}, {"count": 2, "tags": [], "creator": "Tom.Donovan@acm.org", "attachment_id": 21812, "id": 115534, "creation_time": "2008-04-10T19:58:22Z", "time": "2008-04-10T19:58:22Z", "bug_id": 44800, "text": "Created attachment 21812\nbranches/2.2.x patch\n\ndo not enable signals if service", "is_private": false}, {"count": 3, "attachment_id": 21813, "bug_id": 44800, "is_private": false, "id": 115535, "time": "2008-04-10T20:00:33Z", "creator": "Tom.Donovan@acm.org", "creation_time": "2008-04-10T20:00:33Z", "tags": [], "text": "Created attachment 21813\ntrunk patch\n\ndo not enable signals if service\n\nAlthough setting the console signal handler appears to be benign on most systems, it is probably safer to never call mpm_start_console_handler() when running as a service."}, {"count": 4, "tags": [], "creator": "wrowe@apache.org", "is_private": false, "id": 116310, "creation_time": "2008-05-06T13:38:08Z", "time": "2008-05-06T13:38:08Z", "bug_id": 44800, "text": "Of course each time this behavior is changed, some use cases win, others will\nbe broken.  So I'm giving this patch all due consideration.\n\nNote that the third stanza of this patch should be committed independently\nof the remainder of this patch, as the unconditional correction of the env array\nhas nothing to do with the rest of this patches purpose.\n\nIf nobody beats me to committing that third stanza I'll get to it once I have\nreliable connectivity, and finish reviewing the implications of the rest of\nthis patch.  I'm especially interested in how it impacts the httpd test framework\nwhich applies this sort of use case.\n\nGiven that -X is already defined and correctly handles this case, I'm still not\nin agreement yet with committing the remainder of this patch, however it's hard\nto argue that apache -k stop simply does not work in console mode, so some fix\nis demanded.  I'm tempted to agree with applying this patch on the 2.2 branch\nbut migrate to the proper behavior as of the trunk/2.4 branch, following the\nprincipal of least astonishment.\n\n", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 44800, "attachment_id": null, "id": 117397, "time": "2008-06-05T12:18:58Z", "creator": "wrowe@apache.org", "creation_time": "2008-06-05T12:18:58Z", "is_private": false, "text": "This is committed as submitted in 3 parts to 2.0 and 2.2.  The third part was\nnot committed to trunk, these first common commits were...\n\nURL: http://svn.apache.org/viewvc?rev=663669&view=rev\nFor winnt_mpm console mode, always reset our console handler to be the first,\neven on a restart, because some modules (e.g. mod_perl) might have set a console\nhandler to terminate the process.\n\nURL: http://svn.apache.org/viewvc?rev=663699&view=rev\nThe environment may be manipulated by modules such as mod_perl, so regenerate\nthe passed env argument on each CreateProcess call.\n\nThe third commit to 2.2 and 2.0 reverts the \"regression\" you observed for those\nusers of 2.0 and 2.2 who have observed breakage in their anticipated use case;\n\nURL: http://svn.apache.org/viewvc?rev=663704&view=rev\nhttpd-2.2 and -2.0 specific patch to revert to 2.0.55/2.2.0 handling of the\nstdout channel; do not close stdout in the parent process or reassign it to\n\\\\Device\\Null, but keep it open so that the console signal handler continues\nto interact with the running \"daemonized\" httpd process.\n\nNot committed to httpd-2.x; there is disagreement as to whether this is good\nbehavior for a daemon, and the proper 2.4(3.0) behavior on Win32 may be to\ndaemonize but properly handle -k stop by the PID file contents.  Many have\nasked for this feature who run a minimal httpd.exe, especially from some\nremoveable media such as CD, and wish to be able to halt it as a console. \n\n---------\n\nSo closing this incident; there is already the report\n\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=25484\n\nfor tracking how to close the \"console mode\" httpd.exe with -k stop.\n\nAnd for continued dialog on what ^C does to a detached daemon, we can carry\non that discussion, if necessary, on the dev@ list."}]