[{"count": 0, "tags": [], "text": "I am using HSSF to read 14000+ line xls file and save it into a copy, with one modification: stripping RTF control chars from one column.  When I tried to open this output xls, I get \"Excel found unreadable content in [filename].\"  If I allow Excel (v 2003 SP3) to repair the file, it changes my date and currency columns to general cell format.\n\nCode:\n\nIterator rit = sheet.rowIterator();\nrit.next();\nfor(int i = 1; rit.hasNext(); i++) {\n  row = (HSSFRow)rit.next();\n  HSSFCell commentsCell = row.getCell(commentsIdx);\n  if(commentsCell != null) {\n    rtfComments = commentsCell.getRichStringCellValue().getString();\n\n    RTFEditorKit kit = new RTFEditorKit();\n    Document doc = kit.createDefaultDocument();\n    kit.read(new StringReader(rtfComments), doc, 0);\n    txtComments = doc.getText(0, doc.getLength());\n\n    commentsCell.setCellValue(new HSSFRichTextString(txtComments));\n  }\n}\n\n// write converted workbook to file\nFileOutputStream fileOut = new FileOutputStream(outfile);\nwb.write(fileOut);\nfileOut.close();", "is_private": false, "id": 115616, "creator": "john.rodriguez@gmail.com", "time": "2008-04-15T13:13:59Z", "bug_id": 44827, "creation_time": "2008-04-15T13:13:59Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 44827, "is_private": false, "text": "You'll probably need to upload an example XLS file to help diagnose this bug.  Please cut down the XLS file as much as possible, while still reproducing the error.\n\nBTW does the code you have below still cause a corrupt file if you exit the loop after modifying only one cell?", "id": 115617, "time": "2008-04-15T14:57:11Z", "creator": "josh@apache.org", "creation_time": "2008-04-15T14:57:11Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "john.rodriguez@gmail.com", "attachment_id": null, "id": 115647, "time": "2008-04-16T11:44:56Z", "bug_id": 44827, "creation_time": "2008-04-16T11:44:56Z", "is_private": false, "text": "I debugged the problem a little further.  When I run the program and break the loop after a given number of iterations, I noticed that the output file was valid for all rows until the row in which txtComments is \"\", i.e.,  \n\ncommentsCell.setCellValue(new HSSFRichTextString(\"\"));\n\nI tried to trim the file to a few thousand rows where this case occurs, but I couldn't duplicate the problem.  Perhaps the large file size contributes to the problem.\n\nActually, I tried another solution.  I saved the original file under a different name in Excel, same content, and the file size decreased significantly.  I think the export tool we use bloats the Excel file and HSSF has trouble resaving it?\n\nThe original excel file is here: http://www.columbia.edu/~jr534/dbo_contractproducts.original.zip\n"}, {"count": 3, "tags": [], "bug_id": 44827, "text": "I took a look at the example.  Same behaviour as you pointed out.  When excel saves the original file it goes from 24M down to 12M.  POI can manipulate the second file OK.\n\nSo there is still the problem with the original file.  POI is taking a file that Excel can read, and transforming it into one that excel can't read.  In the example code, if you stop iteration at row 611 everything is OK. Row 612 is the first row where the cell F text does not begin with \"{\\rtf\". The code you provided probably has a small bug because it transforms this non-rtf string into empty string.\n\nSo, an easy fix to your specific problem might be to handle that situation properly.\n\nI re-wrote the test code to just replace one cell (F3) text with empty string.  The output file has the same problem.  This is the simplest way I have found to reproduce the bug.  If I replace the cell text with \"a\", everything works fine.\n\nI'm not sure what's so special about empty string.  I took a look at the various files (24M before + after, 12M before + after) using BiffView, and could not see anything weird that POI is doing.  My suspicion is that there is something wrong with the rest of the file (that POI doesn't touch) that only causes Excel to fail when the SST record gets an extra entry of empty string.  Perhaps it has something to do with (not) purging unused values from the shared string table.\n\n\nFor the record, which utility are you using to create this original Excel file?\n\nPlease post back if you still need resolution to this bug.  If you are OK with not replacing the cell text with empty string, this bug may be of much lower priority.\n", "id": 115705, "time": "2008-04-18T10:39:06Z", "creator": "josh@apache.org", "creation_time": "2008-04-18T10:39:06Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 44827, "attachment_id": null, "is_private": false, "id": 123602, "time": "2008-12-29T16:51:24Z", "creator": "dfisher@jmlafferty.com", "creation_time": "2008-12-29T16:51:24Z", "text": "Hard to know how important this is until the OP replies to Josh."}, {"count": 5, "tags": [], "bug_id": 44827, "is_private": false, "text": "no response in a long time => resolving for now, please reopen with more information ifnthis is still an issue", "id": 169104, "time": "2013-08-05T09:08:21Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2013-08-05T09:08:21Z", "attachment_id": null}]