[{"count": 0, "tags": [], "bug_id": 44820, "attachment_id": null, "is_private": false, "id": 115584, "time": "2008-04-14T05:30:59Z", "creator": "jergendutch@gmail.com", "creation_time": "2008-04-14T05:30:59Z", "text": "http://httpd.apache.org/docs/2.2/mod/mod_proxy.html states:\n\"timeout 0 Balancer timeout in seconds. If set this will be the maximum time to wait for a free worker. Default is not to wait.\"\n\nHowever the behaviour is different. We have found that the timeout value here is the time allowed for a reply to be received. Anything that takes longer than this value gets a 502 invalid response from upstream server error.\n\nOn all other servers in the chain the request is logged as a 200 status successful error.\n\nExtract from config file:\n <Proxy balancer://name>\n BalancerMember http://cache1.local:80 min=100 retry=60 timeout=30"}, {"count": 1, "tags": [], "bug_id": 44820, "attachment_id": null, "is_private": false, "id": 115595, "time": "2008-04-14T12:31:58Z", "creator": "rpluem@apache.org", "creation_time": "2008-04-14T12:31:58Z", "text": "(In reply to comment #0)\n> http://httpd.apache.org/docs/2.2/mod/mod_proxy.html states:\n> \"timeout 0 Balancer timeout in seconds. If set this will be the maximum time to\n> wait for a free worker. Default is not to wait.\"\n> \n> However the behaviour is different. We have found that the timeout value here\n> is the time allowed for a reply to be received. Anything that takes longer than\n> this value gets a 502 invalid response from upstream server error.\n\nThe documentation is correct, but you read it wrong.\n\n> \n> On all other servers in the chain the request is logged as a 200 status\n> successful error.\n> \n> Extract from config file:\n>  <Proxy balancer://name>\n>  BalancerMember http://cache1.local:80 min=100 retry=60 timeout=30\n\nHere you did *not* use timeout in a balancer context but in a worker context, so it behaves as described by you and as documented in the parameters for the workers a few lines above the timeout documentation for balancers.\nTo use timeout in the balancer context you need to do the following:\n\n <Proxy balancer://name>\n  BalancerMember http://cache1.local:80 min=100 retry=60\n  ProxySet timeout=30\n </proxy>\n\n\n\n\n"}]