[{"count": 0, "tags": [], "bug_id": 44838, "text": "mod_rewrite is fed different things depending on the context of the rules and the official documentation is not explicit about this. Compare:\n\nhttp://httpd.apache.org/docs/2.0/mod/mod_rewrite.html:\n\n\"Never forget that Pattern is applied to a complete URL in per-server configuration files. However, in per-directory configuration files, the per-directory prefix (which always is the same for a specific directory) is automatically removed for the pattern matching and automatically added after the substitution has been done. This feature is essential for many sorts of rewriting - without this, you would always have to match the parent directory which is not always possible.\"\n\nhttp://wiki.apache.org/httpd/RewriteContext:\n\n\"The Apache HTTPD Server deals with requests in discrete phases. While this is usually transparent to the user and administrator it does have an effect on the behaviour of mod_rewrite when rulesets are placed in different contexts. To oversimplify a little, when rules are placed in VirtualHost blocks (or in the main server context) they get evaluated before the server has yet mapped the requested URI to a filesystem path. Conversely, when rules are placed in .htaccess files, or in Directory blocks in the main server config, they are evaluated after this phase has occured.\"\n\nI think that the first URI should mention explicitly (or at least be as clear as the Wiki is) that the RewriteRule directive is fed either the request URI or the mapped filename depending on context.", "id": 115695, "time": "2008-04-17T15:56:24Z", "creator": "nslater@bytesexual.org", "creation_time": "2008-04-17T15:56:24Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "id": 141207, "time": "2010-10-29T11:06:47Z", "bug_id": 44838, "creation_time": "2010-10-29T11:06:47Z", "is_private": false, "text": "Moving docs bugs to docs@httpd.a.o ownership."}, {"count": 2, "attachment_id": null, "bug_id": 44838, "text": "no sense in throwing more text at it, and the quoted manual paragraph already is correct.", "id": 141456, "time": "2010-11-05T00:16:27Z", "creator": "covener@gmail.com", "creation_time": "2010-11-05T00:16:27Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 44838, "attachment_id": null, "text": "More text should be added to the official docs if that text explicitly covers a behaviour of the software which is not covered anywhere else. The quoted paragraph is correct, but not sufficient. It does not properly describe the whole situation like the wiki does. It does, however, properly describe a part of the situation. I think it should be updated to to include all the relevant details.", "id": 141471, "time": "2010-11-05T09:16:11Z", "creator": "nslater@apache.org", "creation_time": "2010-11-05T09:16:11Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 44838, "text": "I am re-opening this per my last comment.", "count": 4, "id": 141472, "time": "2010-11-05T09:16:56Z", "creator": "nslater@apache.org", "creation_time": "2010-11-05T09:16:56Z", "is_private": false}, {"count": 5, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "id": 141477, "time": "2010-11-05T10:04:10Z", "bug_id": 44838, "creation_time": "2010-11-05T10:04:10Z", "is_private": false, "text": "What behavior exactly?  I don't agree with your summary of the quoted section of the wiki, specifically that per-directory rewrites receive something resembling a filesystem path instead of a URL-path sans-base."}, {"count": 6, "tags": [], "bug_id": 44838, "text": "The wiki paragraph I quoted explains how the behaviour of mod_rewrite changes before and after per-directory processing has happened. Before that stage, the mod_rewrite rules are working with URLS, and after that stage, they are working with filesystem paths. This is never explicitly mentioned in the official docs, and it has been a source of great confusion for me on a number of occasions — as I always end up forgetting about it! If this is not the case, then it would seem that the wiki is wrong, and the official docs are STILL lacking a proper explanation of what *exactly* mod_rewrite is being fed at the pre-per-directory stage and post-per-directory stage.", "id": 141481, "time": "2010-11-05T10:27:00Z", "creator": "nslater@apache.org", "creation_time": "2010-11-05T10:27:00Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 44838, "text": "> official docs are STILL lacking a proper\n> explanation of what *exactly* mod_rewrite is being fed at \n> the pre-per-directory stage and post-per-directory stage.\n\nThere are two <notes> already that describe it in detail.  It's a URI in vhost scope and a URI, minus the RewriteBase, in per-dir scope.", "id": 142380, "time": "2010-12-04T17:43:28Z", "creator": "covener@gmail.com", "creation_time": "2010-12-04T17:43:28Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 44838, "text": "I do not believe it is as simple as that. It's not only a case of removing the RewriteBase from the string that is being matched against. In one instance, it is matching against a portion of the URL. And in another, it is matching against the filesystem path. AFAIK there is no necessary correspondence between these two strings. They may, in fact, share nothing in common! The explanation on the wiki is a very clear one, and I think it should be moved to the official documentation.", "count": 8, "id": 143105, "time": "2011-01-05T15:34:33Z", "creator": "nslater@apache.org", "creation_time": "2011-01-05T15:34:33Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 44838, "text": "fixed in trunk and 2.2.x:\nhttp://svn.apache.org/viewvc?view=revision&revision=1055671\n\nI've moved/enhanced the text that was already there:\n\nWhen using the rewrite engine in .htaccess files the per-directory prefix (which always is the same for a specific directory) is automatically removed for the pattern matching and automatically added after the substitution has been done. This feature is essential for many sorts of rewriting; without this, you would always have to match the parent directory, which is not always possible. There is one exception: If a substitution string starts with http://, then the directory prefix will not be added, and an external redirect (or proxy throughput, if using flag P) is forced. See the RewriteBase directive for more information.\n\nIf there's some specific concern unadressed, reproduce the section of the updated doc in a new bugzilla report and provide your specific recommendation.", "id": 143107, "time": "2011-01-05T17:44:19Z", "creator": "covener@gmail.com", "creation_time": "2011-01-05T17:44:19Z", "is_private": false, "attachment_id": null}]