[{"count": 0, "tags": [], "text": "Log4j is not functioning properly across different tomcat servers as it logs data intermittently. We are using DailyRollingFileAppender and rollover is hourly. When the file rolls to the next hour data seems to be logged to the previous hour at times. I have checked logger.properties and it doesn't seem like anything is out of place.\n\nThe logs are missing data as there are several hours where no logs were captured across all servers.\n\nPlease let us know if this is fixed in any release branch.", "attachment_id": null, "id": 115835, "creator": "sachingurjar@yahoo.com", "time": "2008-04-24T05:10:16Z", "bug_id": 44867, "creation_time": "2008-04-24T05:10:16Z", "is_private": false}, {"count": 1, "tags": [], "text": "I think it is likely that you are having multiple instances of log4j attempt to write to the same log file.  That is not supported and strongly discouraged, however there is no platform-independent way for log4j to detect or prevent that type of misconfiguration.  The behavior that you are observing is commonly observed under those conditions.", "attachment_id": null, "id": 115841, "creator": "carnold@apache.org", "time": "2008-04-24T08:48:22Z", "bug_id": 44867, "creation_time": "2008-04-24T08:48:22Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 44867, "attachment_id": null, "text": "hi there,\n\ni've looked through and seems that this issue same as mine. I would like to submit my information regarding this for your workings. As preload information, i'm using  1 apache load balance 2 tomcat; but both pointing to one web application reside in other directory. Thus, the log4j.properties only reside in that webapp's WEB-INF/classes directory. \n\nThese settings somehow came up identical to what Sachin elaborated. the file rolls to the next hour, data seems to be logged to the previous hour at times.\n\nbased on your comment is this scenario created multiple log4j instances writing to the same file? is there any work around for the architecture described above? i hope i can give you as much info as possible for you to identify this problems.", "id": 116125, "time": "2008-05-02T01:16:07Z", "creator": "wesleywj2@yahoo.co.uk", "creation_time": "2008-05-02T01:16:07Z", "is_private": false}, {"count": 3, "tags": [], "creator": "thorbjoern@gmail.com", "attachment_id": null, "id": 118125, "time": "2008-06-30T13:02:50Z", "bug_id": 44867, "creation_time": "2008-06-30T13:02:50Z", "is_private": false, "text": "I believe there is no generic Java way of ensuring that only one instance can write to a given file at one time.  Having two different processes writing simultaneously is almost certainly guaranteeing dataloss.  Is there any particular reason why you do not have a log file per instance?\n\nThey can always be merged at a later time if such a need arises.  Be certain however to have sufficiently high resolution in the timestamps to do so.\n\nHence, I would suggest that this is a WONTFIX."}]