[{"count": 0, "tags": [], "bug_id": 44879, "attachment_id": null, "text": "When a war is deployed in webapps directory, Tomcat 5 overwrites any context xml in conf/engine/host directory with the one in META-INF in the war.\n\nThis behavior is undesirable. We normally put a customized context fragment to overwrite what's delivered in WAR. Can this behavior be modified so the context fragment in host directory is kept intact if its docBase points to the same war?\n\nThanks!\n\nZhihong", "id": 115906, "time": "2008-04-25T17:35:42Z", "creator": "zhihong@gmail.com", "creation_time": "2008-04-25T17:35:42Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 44879, "attachment_id": null, "text": "The behaviour you describe is not the intended behaviour. I have checked the code and performed my own test and cannot repeat this problem.\n\nIf you still see this issue please provide the smallest, simplest series of steps to reproduce this issue with a clean install of the latest stable 5.5.x release.", "id": 115919, "time": "2008-04-27T08:48:49Z", "creator": "markt@apache.org", "creation_time": "2008-04-27T08:48:49Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 44879, "text": "(In reply to comment #1)\n> The behaviour you describe is not the intended behaviour. I have checked the\n> code and performed my own test and cannot repeat this problem.\n> \n> If you still see this issue please provide the smallest, simplest series of\n> steps to reproduce this issue with a clean install of the latest stable 5.5.x\n> release.\n> \n\nMark,\n\nThan you for looking into this issue. You are right. I couldn't reproduce this problem on a straight startup either. But I know this happens because my context file got overwritten several times and our QA reported the same issue. It probably has something to do with redeploying the app.\n\nI will try to find the exact steps to reproduce and let you know.\n\nZhihong", "id": 115930, "attachment_id": null, "creator": "zhihong@gmail.com", "creation_time": "2008-04-27T14:39:53Z", "time": "2008-04-27T14:39:53Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "You are probably undeploying first which, as designed, will remove the old context fragment.", "id": 115945, "time": "2008-04-27T23:47:47Z", "bug_id": 44879, "creation_time": "2008-04-27T23:47:47Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 44879, "text": "(In reply to comment #3)\n> You are probably undeploying first which, as designed, will remove the old\n> context fragment.\n> \n\nYou are correct. Looks like the undeploying process removes the context. \n\nHowever, I wonder if this is the right behavior. Should Tomcat only remove the context if the app is deployed from WAR?\n\nZhihong", "id": 116377, "attachment_id": null, "creator": "zhihong@gmail.com", "creation_time": "2008-05-08T08:17:21Z", "time": "2008-05-08T08:17:21Z", "is_private": false}]