[{"count": 0, "tags": [], "bug_id": 44935, "attachment_id": null, "is_private": false, "id": 116246, "time": "2008-05-05T08:00:29Z", "creator": "dewayne.hafenstein@columbiaultimate.com", "creation_time": "2008-05-05T08:00:29Z", "text": "When a document is created using a table specified with margin-left of any value, the contents of the table are also offset in the cells by the same amount.  It appears that the margin-left trait of the table is being inherited by the table cells as well, when it should not be.\n\nI was able to recreate this problem with any margin value, but it is especially noticeable with a large left margin, such as 2.5in or 3in.  The specific application we were trying to perform was a letter with a form section displaced to the right on the page.  \n\nWhen the left margin is set to zero, the problem disappears.  I also noticed that all of the test cases do not use left margins for the tables, so it is possible that this has existed for a long time.\n\nI have attached the actual letter document that I was trying to render to this bug report.  It was created from a Word document, converted using Open-Office and XSLT transforms to convert it to XSL-FO.  I have also been able to reproduce the problem with a hand-coded document."}, {"count": 1, "tags": [], "bug_id": 44935, "is_private": false, "id": 116247, "creation_time": "2008-05-05T08:01:20Z", "time": "2008-05-05T08:01:20Z", "creator": "dewayne.hafenstein@columbiaultimate.com", "text": "Created attachment 21921\nThis is an actual letter that we are using to test our application with", "attachment_id": 21921}, {"count": 2, "tags": [], "bug_id": 44935, "attachment_id": null, "id": 116248, "time": "2008-05-05T08:10:13Z", "creator": "adelmelle@apache.org", "creation_time": "2008-05-05T08:10:13Z", "is_private": false, "text": "This is not a bug, but a known peculiarity in the XSL-FO Recommendation.\n\nWe have dedicated an entire Wiki page to it:\nhttp://wiki.apache.org/xmlgraphics-fop/IndentInheritance\n\nIn short:\n- margin-left indeed is not inherited, but the corresponding property start-indent is\n- the value of margin-left is used to compute start-indent on the table (lr-tb writing mode)\n- the descendants inherit the computed value for start-indent\n\nYou can sidestep the problem, either by resetting start-indent to \"0pt\" on the table-body, or by using a configuration file that sets the 'break-indent-inheritance' configuration option to true."}, {"count": 3, "tags": [], "bug_id": 44935, "attachment_id": null, "is_private": false, "id": 156732, "time": "2012-04-01T13:51:58Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:51:58Z", "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs"}]