[{"count": 0, "tags": [], "bug_id": 44941, "attachment_id": null, "id": 116289, "time": "2008-05-06T03:47:04Z", "creator": "elliott_jones@hotmail.com", "creation_time": "2008-05-06T03:47:04Z", "is_private": false, "text": "Setup the following: \n\nThread Group: 2 thread, RU 1, Loop 1 \n        -Java sampler logon \n        -Throughput Controller set at 1 for total executions (NOT per user) \n                -Java sampler Browse to folderA \n        -Throughput Controller set at 1 for total executions (NOT per user) \n                -Java sampler Browse to folderB \n        -Aggregate Report \n\n\nI would expect to see the samplers for Browse to folderA and folderB to both execute just the once for which ever of the two threads executed it first. \n\nHowever, only the second Browse sampler occurs - Browse folder B . \n\nNOTE:\n1) OS is virtualised Windows Server 2003 R2\n2) If I set both Throughput Controllers to be per user. I get each Browse completed twice in total, once per user, as expected."}, {"count": 1, "attachment_id": null, "creator": "milamber@apache.org", "is_private": false, "id": 120414, "time": "2008-09-06T12:55:55Z", "bug_id": 44941, "creation_time": "2008-09-06T12:55:55Z", "tags": [], "text": "After analysis, the problem is the element Throughput Controller when there are several in same Thread Group with the option \"Per User\" unchecked.\n==> The problem doesn't exist when option \"Per User\" is checked.\n\nThe analysis of source code indicates that scope of variable globalNumExecutions in class org.apache.jmeter.control.ThroughputController which is the cause of problem.\nIndeed, variable globalNumExecutions is compared to getMaxThroughputAsInt() (in method decide() of the same class), but unfortunately, value of globalNumExecutions is shared by all Throughput Controller of Thread Group. When comparing the number of execution is wrong in relation to the current Throughput Controller.\n\nFor example, in Test Plan attached, the request \"21 HTTP Request\" isn't success because the comparison of value of globalNumExecutions is already 1 (because request \"11 HTTP Request\" is before) and value of Max Throughput is 1 for the current Throughput Controller (1 < 1 = false).\n\nThe solution should be (I think):\nA variable globalNumExecutions by Throughput Controller and shared by Thread Group.\n\nBy cons, I have not (yet) succeeded to correct in the source code Jmeter ... Perhaps this is not possible?"}, {"count": 2, "tags": [], "bug_id": 44941, "text": "Created attachment 22534\nTest Plan to show bug 44941", "id": 120415, "time": "2008-09-06T12:57:53Z", "creator": "milamber@apache.org", "creation_time": "2008-09-06T12:57:53Z", "is_private": false, "attachment_id": 22534}, {"count": 3, "text": "URL: http://svn.apache.org/viewvc?rev=712458&view=rev\nLog:\nBug 44941 - Throughput controllers should not share global counters", "creator": "sebb@apache.org", "attachment_id": null, "id": 122310, "time": "2008-11-08T17:25:45Z", "bug_id": 44941, "creation_time": "2008-11-08T17:25:45Z", "tags": [], "is_private": false}]