[{"count": 0, "tags": [], "bug_id": 44953, "text": "Created attachment 21934\nvalidation fault across sheets\n\nData validation list using another sheet fails\n\nsetting the data validation formula to: \n\nString strFormula = \"sheet1!$B$6:$B$9\"\n\nThe program runs fine but on opening the xls file Excel says\n\nFile error: data may have been lost\n\n\nIf I change the formula to use defined range the the library throws an exception\n\nValidation of data list on the same sheet work\n\nattached java test source formula used on line 118\n\nNote: source write file to root of drive c on windows\n\npoi library 3.1 - beta 1", "id": 116378, "time": "2008-05-08T11:27:15Z", "creator": "graham@clippersoftware.co.uk", "creation_time": "2008-05-08T11:27:15Z", "is_private": false, "attachment_id": 21934}, {"count": 1, "tags": [], "text": "It is a limitation in Excel (I have version 2002).", "attachment_id": null, "bug_id": 44953, "id": 117804, "time": "2008-06-19T01:14:49Z", "creator": "bernhard.schwager@komaxgroup.com", "creation_time": "2008-06-19T01:14:49Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 44953, "text": "I have validated this bug.  The other comment is incorrect.  It is supported in Excel.  Any ideas about how this can be fixed?", "id": 118881, "time": "2008-07-21T16:06:52Z", "creator": "scrollpane@yahoo.com", "creation_time": "2008-07-21T16:06:52Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "Fixed in svn r682225/r682227.\n\nThis turned out to be way more work than expected.  There were several bugs/deficiencies found in the original HSSFDataValidation API:\n - RVA settings for list formulas were NQR (probably the cause of this bug)\n - Lists with explicit values did not work\n - Formulas and simple values were not distinguished (Note that the Excel UI handles expressions starting with '=' different to those without the equals prefix).\n\nThere were also problems with the java object model in that too many things were crammed into HSSFDataValidation. Extensive changes were made to resolve these issues. \nA new class DVConstraint was created to hold just the validation type, operator and value expressions.  CellRangeAddressList was renamed and raised in the API.\nHSSFDataValidation was moved to org.apache.poi.hssf.usermodel (where classes like HSSFWorkbook, HSSFConditionalFormatting, etc are found).\n\n\nThe attached test code (id=21934) is just an extract from the original TestDataValidation.  TestDataValidation has been updated to cover the 'cross sheet validation' case, as well as the fixed functionality mentioned above.  You can tweak the 'isSame' boolean variable to output the new version of the test spreadsheet.\n\n", "is_private": false, "id": 119329, "creator": "josh@apache.org", "time": "2008-08-03T15:48:27Z", "bug_id": 44953, "creation_time": "2008-08-03T15:48:27Z", "attachment_id": null}]