[{"text": "I'm not sure if my problem is identical to 39998, but here goes:\n\nIn the description of the class HSSFCell is says ” String cells cannot conatin numbers and numeric cells cannot contain strings (at least according to our model).”\nThis model causes some problems that are hard to work around when dealing with users input:\n\n1. A string cell, that is a cell for which the format in Excel has explicitly been specified as “Text”, should be allowed to contain anything. But if the cell happens to contain only characters in the range ‘0’-‘9’ getCellType() returns NUMERIC and getRichStringCellValue() throws an exception.\n\n2. A date cell, again explicitly formatted as such in Excel, is also treated as numeric cell when it contains a date like “01.07.2008”\n\n\nIf possible I would like HSSFCell to either quit the guessing and the assuming, or implement something like getRawCellType() and getRawStringCellValue() that would return the data the user entered and not a processed result.", "tags": [], "bug_id": 44996, "attachment_id": null, "count": 0, "id": 116604, "time": "2008-05-14T04:29:34Z", "creator": "mbp@back-bone.dk", "creation_time": "2008-05-14T04:29:34Z", "is_private": false}, {"count": 1, "tags": [], "creator": "martin.schoeffler+asfbugzilla@gmail.com", "attachment_id": null, "id": 116607, "time": "2008-05-14T06:14:58Z", "bug_id": 44996, "creation_time": "2008-05-14T06:14:58Z", "is_private": false, "text": "(In reply to comment #0)\n> If possible I would like HSSFCell to either quit the guessing and the assuming,\n> or implement something like getRawCellType() and getRawStringCellValue() that\n> would return the data the user entered and not a processed result.\n\nAs I understand it POI is already doing what you propose, as it does no guessing but only reads what excel wrote to the xls file.\nFormatting a cell as text does not mean it is stored as text internally in the xls-file. Excel automatically stores text that contains only digits as a NUMERIC.\nI had some success in forcing excel to store the value as a string by changing the value again after I set format to text. The workflow is as follows: entring value, changing format, changing value. \n\nBut that is not a good workaround. It is best to retrieve the format as pointed out in bug 39998 and try to format the value accordingly.\n\n"}, {"count": 2, "tags": [], "creator": "mbp@back-bone.dk", "attachment_id": null, "id": 116635, "time": "2008-05-15T05:46:35Z", "bug_id": 44996, "creation_time": "2008-05-15T05:46:35Z", "is_private": false, "text": "I don't know the internals of xls-file, but I do not doubt they are tricky.\n\nThe reason I submitted this report is that the behaviour has changed from earlier POI version, leading me to think it was a bug.\n\nI have made it work by making my program know what to expect in from each column thus making it easier to handle exceptions correct.\n\n"}, {"count": 3, "attachment_id": null, "bug_id": 44996, "is_private": false, "id": 116858, "time": "2008-05-20T09:52:21Z", "creator": "apache@gagravarr.org", "creation_time": "2008-05-20T09:52:21Z", "tags": [], "text": "Could you please upload a little unit test showing the problem you're having?\n\nI've just had a try (see commit r658336), and everything behaves as I'd expect it to"}, {"count": 4, "tags": [], "bug_id": 44996, "attachment_id": null, "text": "Without a response to Nick's test this will be marked INVALID.", "id": 124951, "time": "2009-02-18T12:29:08Z", "creator": "dfisher@jmlafferty.com", "creation_time": "2009-02-18T12:29:08Z", "is_private": false}]