[{"count": 0, "tags": [], "bug_id": 45005, "is_private": false, "id": 116641, "creation_time": "2008-05-15T06:38:24Z", "time": "2008-05-15T06:38:24Z", "creator": "michael.tschannen@zhaw.ch", "text": "Created attachment 21970\nMailReaderSampler as .tar\n\nHello everybody\n\nFor a project, we have enhanced JMeter's MailReaderSampler with the following features: \n- POP3: SSL-Support\n- IMAP: SSL- and StartTLS-Support\n\nWe now would like to submit these changes to the community, if possible to be included in a future release. Attached, you find the corresponding sources. For building a test plan with the sampler, please note the following: \n- To ensure that SSL / StartTLS don't end up in exceptions, the server certificate has to be known to JMeter. You can do this by a) installing the certificate on-the-fly (\"Install truststore\") or b) use a local truststore (\"Use local truststore\", needs path-to-truststore) with the certificate in. \n- \"Check for failure\" means that the test is treated as successful if it failed. This can e.g. be used to check for some unwanted features. \n\nPlease note that the current SizeAssertions isn't able to correctly determine the mail-size including a possible attachment (this would certainly be a reasonable enhancement).", "attachment_id": 21970}, {"count": 1, "tags": [], "creator": "hauser@acm.org", "text": "this superseeds rfe bug 38384 \n\nsee also Bug 45006 for an approach how to easily cope with the SizeAssertion.java issue.", "id": 116644, "time": "2008-05-15T06:54:01Z", "bug_id": 45005, "creation_time": "2008-05-15T06:54:01Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45005, "is_private": false, "id": 134847, "creation_time": "2010-02-24T00:05:38Z", "time": "2010-02-24T00:05:38Z", "creator": "sebb@apache.org", "text": "The current version of JMeter supports POP3S and IMAPS.\n\nAs far as I can tell, this enhancement is no longer needed.\n\nPlease re-open with details if this is not correct.", "attachment_id": null}]