[{"count": 0, "tags": [], "creator": "john.plattiv@cerner.com", "text": "I am working to get row spanning tables to render correctly through fop.  I have ran the attached example through fop 0.20.5 as well as the 0.95beta and still get the same problem.  My problem is that I have a 3 row table with the following set up\n\nrow 1\n     column 1              column 2                     column 3\n    single cell, single cell with row span of 3, single cell with row span of 2\n\nrow 2\n            column 1\n    single cell with row span of 2\n\nrow 3\n        column 3\n    single cell\n\nThe bug is that my single cell on row 3 column 3 when rendered shows up in row 2 column 3.\n\nThrough some trial and error, I believe the issue has to due with the fact that row 3 started with two row span participants.  To test this I took the row spanning off of the row spanning cell in row 2.  This allowed my row 3 cell to render in row 3 column 1, which is expected by taking off the row spanning in the fo.  Further, I reset my test and I did the same type of test by changing the row spanning or row 1 column 2 to 2.  This would leave it off of row 3.   This resulted in the row 2 column 1 spanning into row 3 as expected and row 3 column 3 rendering in column 2 as it should with the change row 1 column 2 row span.  This is how I came to my conclusion that the bug deals with a row that starts with 2 row span participants.", "id": 116854, "time": "2008-05-20T09:12:35Z", "bug_id": 45047, "creation_time": "2008-05-20T09:12:35Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": 21985, "bug_id": 45047, "is_private": false, "id": 116855, "time": "2008-05-20T09:14:44Z", "creator": "john.plattiv@cerner.com", "creation_time": "2008-05-20T09:14:44Z", "tags": [], "text": "Created attachment 21985\nfo example of the issue\n\ndid not originally at the attachment"}, {"count": 2, "tags": [], "creator": "vhennebert@gmail.com", "text": "Hi,\n\nThere is indeed a bug regarding the second row's fixed height, which is not taken into account. This bug will occur only when the row doesn't have any cell that starts and ends on it (i.e., spans only one row).\n\nBut apart from that, what you're seeing accurately reflects the content of the FO file, which is, if I may say, a bit particular. The border you see in row 3 cell 3 has been specified on the only cell of an /inner/ table defined inside cell 3.3. This table doesn't have any fixed height, so it takes its natural height, which appears to not fill the space available in cell 3.3. If you instead specify the border on cell 3.3, then you have a normal-looking result.\n\nIt appears that on this example row 2 has zero height, because all the content of cell 1.3 fits on row 1. And since all of the other cells of row 2 also span row 3, they put all of their contents on row 3. (The spec doesn't say how content should be allocated among the spanned rows.)\n\nVincent\n\n", "id": 116894, "time": "2008-05-22T04:16:34Z", "bug_id": 45047, "creation_time": "2008-05-22T04:16:34Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "id": 157343, "time": "2012-04-07T01:41:42Z", "bug_id": 45047, "creation_time": "2012-04-07T01:41:42Z", "is_private": false, "text": "resetting P2 open bugs to P3 pending further review"}, {"count": 4, "attachment_id": null, "bug_id": 45047, "is_private": false, "id": 157917, "time": "2012-04-11T06:17:56Z", "creator": "gadams@apache.org", "creation_time": "2012-04-11T06:17:56Z", "tags": [], "text": "change status from ASSIGNED to NEW for consistency"}]