[{"count": 0, "tags": [], "creator": "emmanuel.fuste@laposte.net", "text": "Even when using \"SSLVerifyClient require\" directive,\nAUTH_TYPE is not set.\nAs standard env variable could not be modified by SetEnv or RewriteRule directive, I could not set AUTH_TYPE to Certificate to pass it to an application using AJP.\n(It is to migrate an application from Iplanet To Apache without modifications).", "id": 116885, "time": "2008-05-21T08:43:31Z", "bug_id": 45058, "creation_time": "2008-05-21T08:43:31Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 45058, "is_private": false, "id": 116897, "time": "2008-05-22T05:02:15Z", "creator": "emmanuel.fuste@laposte.net", "creation_time": "2008-05-22T05:02:15Z", "tags": [], "text": "(In reply to comment #0)\n> Even when using \"SSLVerifyClient require\" directive,\n> AUTH_TYPE is not set.\n> As standard env variable could not be modified by SetEnv or RewriteRule\n> directive, I could not set AUTH_TYPE to Certificate to pass it to an\n> application using AJP.\nAUTH_TYPE is SSL with Iplanet"}, {"count": 2, "tags": [], "bug_id": 45058, "text": "AFAIU it's not exactly defined at which level AUTH_TYPE specifies the type...\n\nRFC 3875 says:\n4.1.1.  AUTH_TYPE\n\n   The AUTH_TYPE variable identifies any mechanism used by the server to\n   authenticate the user.  It contains a case-insensitive value defined\n   by the client protocol or server implementation.\n\n   For HTTP, if the client request required authentication for external\n   access, then the server MUST set the value of this variable from the\n   'auth-scheme' token in the request Authorization header field.\n\n      AUTH_TYPE      = \"\" | auth-scheme\n      auth-scheme    = \"Basic\" | \"Digest\" | extension-auth\n      extension-auth = token\n\n   HTTP access authentication schemes are described in RFC 2617 [5].\n\n\n\nOne might take the HTTP literally i.e. \"not HTTPS\"... but again... this is just one possible interpretation.\n\nThe problem is that more than one authentication types could have taken place, e.g. first SSL client certificate login ... and afterwards HTTP Basic Auth....\nand there's currently no way to specify a list of authentication types that have taken place.", "id": 165979, "time": "2013-03-18T22:36:24Z", "creator": "calestyo@scientia.net", "creation_time": "2013-03-18T22:36:24Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "I've reported an request to the editors of the CGI specification, where I present two possible solution to deal with the problem from the standard side:\nhttp://www.rfc-editor.org/errata_search.php?eid=3556\n\n\n\nTo comment on Emmanuel's original idea of having AUTH_TYPE set to e.g. \"Certificate\"... IMHO that's a bad idea, especially using a non standardised type-name will sooner or later cause troubles.\n\n\n\n\nFurther I increased the severity to \"normal\". IMHO this is not only an enhancement... in the real world, many CGI programs depend on AUTH_TYPE... and it's very common to e.g. use SSL/TLS client auth + fakeBasicAuth with them... but now those programs won't realise... that BasicAuth information is present and fail.\n\n\nFor that reason, may I ask the mod_ssl maintainers to think about intermediate solutions (until the standard might be updated).\n\nOne possibility would be to simply set the AUTH_TYPE, as if SSL wasn't used...\nThis is surely not a clean solution, but will probably work in all scenarios, as noone expects AUTH_TYPE to contain SSL/TLS related info (it never did).\n\nAnother way would be adding a new directive, that allows to specify the behaviour of AUTH_TYPE when it was used with SSL.\n\n\nCheers,\nChris.", "is_private": false, "id": 165980, "creator": "calestyo@scientia.net", "time": "2013-03-18T23:07:30Z", "bug_id": 45058, "creation_time": "2013-03-18T23:07:30Z", "attachment_id": null}]