[{"count": 0, "tags": [], "creator": "filippoweb@gmail.com", "is_private": false, "text": "Created attachment 22010\nIt's an invoice, basically composed by 3  tables, one for the header, one for the footer and one for the body. if the document body is bigger than  2 pages the error occurs \n\nUsing a marker to draw a table as a footnote, the marker retrieving code returns a non-clean table object for the pages other than the first.", "id": 117004, "time": "2008-05-27T06:28:51Z", "bug_id": 45079, "creation_time": "2008-05-27T06:28:51Z", "attachment_id": 22010}, {"count": 1, "tags": [], "creator": "adelmelle@apache.org", "attachment_id": null, "is_private": false, "id": 117219, "time": "2008-06-01T04:28:43Z", "bug_id": 45079, "creation_time": "2008-06-01T04:28:43Z", "text": "\nAdditional info from the related thread on fop-dev@:\n---\n[Vincent: ]\nWhen the document needs 3 pages, the table in the first marker (for the\nfooter area) must be laid out twice, on the first two pages. And there\nseems to be a bug in the marker retrieving code that returns a non-clean\ntable object (I suspect the columns aren’t properly set). But after\na quick look I haven’t managed to track down the bug.\n\n[Me: ]\nAt first glance, the problem seems to be the fact that the ColumnNumberManager is not cloned with the table. This means that, the second time the table is retrieved, it will use the same one as that for the first retrieval.\n\nIf I change that little detail (Table.clone()), the example renders to three pages without an error in FOP Trunk.\n\nHowever:\n- enabling assertions does throw an error (could point to that one bug that has been fixed in 0.95 head, but has not been merged back into the trunk yet).\n- looking at the result, somehow I get two retrieved markers for the footer in the second page...\n---\n\nIn the meantime, I've also corrected the second issue locally. This was caused by the TableBody.rowGroups member which was not reset in the clone.\n\nThis leaves only the AssertionError.\n\nBTW: for FOP 0.95 (or later) you probably want to remove keep-together=\"always\" from the table-rows in the header/footer. The content cannot be broken over multiple pages anyway, and using the keep-together also forces keep-together.within-line=\"always\" for the content of the table-cells."}, {"count": 2, "attachment_id": 22046, "bug_id": 45079, "text": "Created attachment 22046\npreliminary patch fixing the issue", "id": 117220, "time": "2008-06-01T04:36:07Z", "creator": "adelmelle@apache.org", "creation_time": "2008-06-01T04:36:07Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "is_private": false, "text": "resetting P2 open bugs to P3 pending further review", "id": 157584, "time": "2012-04-07T01:44:53Z", "bug_id": 45079, "creation_time": "2012-04-07T01:44:53Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "change status from ASSIGNED to NEW for consistency", "is_private": false, "id": 157894, "creation_time": "2012-04-11T06:16:32Z", "time": "2012-04-11T06:16:32Z", "creator": "gadams@apache.org", "bug_id": 45079, "attachment_id": null}]