[{"count": 0, "tags": [], "bug_id": 45070, "text": "When I transform the attached file to XSL-FO and process the resulting FO with FOP, I get this warning:\n\nWARNING: span=\"inherit\" on fo:block, but no explicit value found on the parent FO.\n\nI'm using the 1.73.2 DocBook XSL.\n\nI get this problem with both FOP 0.94 and FOP 0.95beta.", "id": 116926, "time": "2008-05-23T05:43:17Z", "creator": "aamcfarland@gmail.com", "creation_time": "2008-05-23T05:43:17Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "aamcfarland@gmail.com", "attachment_id": 21991, "text": "Created attachment 21991\nsimple docbook file that demonstrates the problem", "id": 116927, "time": "2008-05-23T05:44:40Z", "bug_id": 45070, "creation_time": "2008-05-23T05:44:40Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 45070, "attachment_id": null, "id": 116929, "time": "2008-05-23T07:02:19Z", "creator": "vhennebert@gmail.com", "creation_time": "2008-05-23T07:02:19Z", "is_private": false, "text": "(This issue came up on the docbook-apps mailing list.) There are two problems IMO:\n- I don't see why FOP should issue a warning while such a construct is perfectly legal. I realize that this may help debugging stylesheets, but this will also annoy most users.\n- The code in PropertyMaker.make(PropertyList, String, FObj) looks suspicious. It tries to get the explicit value set on the parent, whereas it should get its /computed/ value. Granted, the end result is probably the same, still.\n\nLeaving it over to property specialists...\n\nVincent\n\n"}, {"count": 3, "tags": [], "bug_id": 45070, "text": "(In reply to comment #2)\n> (This issue came up on the docbook-apps mailing list.) \n> There are two problems IMO:\n> - I don't see why FOP should issue a warning while such a construct is\n> perfectly legal. I realize that this may help debugging stylesheets, but this\n> will also annoy most users.\n\nGranted...\nQuestion in this particular case, however, is what the stylesheet authors hope to achieve by adding  'span=\"inherit\"' anyway. The property only has effect for areas returned by a flow-child. Although the property is not inherited, further descendants automatically take on the characteristics of their parent (see: http://www.w3.org/TR/xsl/#span)\n\n> - The code in PropertyMaker.make(PropertyList, String, FObj) looks suspicious.\n> It tries to get the explicit value set on the parent, whereas it should get its\n> /computed/ value. Granted, the end result is probably the same, still.\n\nI think the reason behind the warning is indeed stylesheet debugging, in the sense that one would expect a value on the parent for a specified value of 'inherit' on the child (?)\n\nThe keyword is permitted as a value for inherited properties, but hardly useful there...\nIf used for non-inherited properties, then it should indeed evaluate to the computed value.\n\nThe explicit value obtained in PropertyMaker is used /only/ to check whether there was a value specified on the parent. If this is not the case, then the computed value will evaluate to the initial value, and so could just as well have been omitted...\n\nAll the same for me to have FOP shut up in those cases, or reduce it to debug-level.", "id": 116931, "time": "2008-05-23T08:08:32Z", "creator": "adelmelle@apache.org", "creation_time": "2008-05-23T08:08:32Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 45070, "text": "resetting P2 open bugs to P3 pending further review", "id": 157562, "time": "2012-04-07T01:44:40Z", "creator": "gadams@apache.org", "creation_time": "2012-04-07T01:44:40Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 45070, "text": "change status from ASSIGNED to NEW for consistency", "id": 157908, "time": "2012-04-11T06:17:29Z", "creator": "gadams@apache.org", "creation_time": "2012-04-11T06:17:29Z", "is_private": false, "attachment_id": null}]