[{"count": 0, "tags": [], "text": "Created attachment 22033\nzip file which contains the required documents mentioned in the description\n\nWhen we are trying to load an image file from an external source or present in an server, it is not able to load it. \nWe are using a stylesheet to create a pdf document and an xml file that generates the pdf document. \n\n\nThis is the error message found in the log files.\n\n1) First we tried with \"//\", the error message\n29.05.2008 17:35:41 org.apache.fop.fo.flow.ExternalGraphic bind\nSCHWERWIEGEND: Image not found: file:\\\\Dimari-server4\\variobill\\shared\\images\\KEVAG_Briefkopf2005_08.PNG\n\n\n2) Then we tried with \"////\"\n29.05.2008 17:43:01 org.apache.fop.fo.flow.ExternalGraphic bind\nSCHWERWIEGEND: Image not found: file:////Dimari-server4\\variobill\\shared\\images\\KEVAG_Briefkopf2005_08.PNG\n\nThe question is, what should we write in the command line of the stylesheet, that it will load the image in the particular place in the pdf document?\n\nWe have already tested this with FOP-0.95 and Java RE 6 update 5\n\nAttached you can find\n- the used stylesheet -containing the command for the graphics file- and \n- the graphics file that should appear on the pdf and \n- a pdf file created with the stylesheet and \n- the xml that served for the pdf generation.", "attachment_id": 22033, "bug_id": 45100, "id": 117136, "time": "2008-05-29T09:13:07Z", "creator": "sudesna.pati@dimari.de", "creation_time": "2008-05-29T09:13:07Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 45100, "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of bug 44902 ***", "id": 117141, "time": "2008-05-29T10:16:36Z", "creator": "adelmelle@apache.org", "creation_time": "2008-05-29T10:16:36Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "sudesna.pati@dimari.de", "text": "yes this, bug is duplicate. But the resolution that has been given, does not work. PLease try to solve the problem. PLease let me know what should I write in th command line that it is able to load the image. This time I have loaded the all the required files again.", "id": 117175, "time": "2008-05-30T03:22:20Z", "bug_id": 45100, "creation_time": "2008-05-30T03:22:20Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 45100, "is_private": false, "text": "(In reply to comment #2)\n> yes this, bug is duplicate. But the resolution that has been given, does not\n> work. PLease try to solve the problem. PLease let me know what should I write\n> in th command line that it is able to load the image. This time I have loaded\n> the all the required files again.\n\nIf the intention was to simply ask a question, then Bugzilla is definitely not the appropriate medium.\n\nAnyway, the cause is the same one as the original bug #44902. Surely it should be pretty obvious that opening a second issue for the same problem serves no purpose at all, hence why I closed this one.\n\nAs indicated in Bugzilla #44902, this can only be solved if someone takes the time to implement support for UNC paths. No magic command-line option exists to make this work all of a sudden. Unless someone decides to dive into the code and do what is necessary, you are out of luck, I'm afraid.\n\n\n\n*** This bug has been marked as a duplicate of bug 44902 ***", "id": 117201, "time": "2008-05-31T03:11:11Z", "creator": "adelmelle@apache.org", "creation_time": "2008-05-31T03:11:11Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 45100, "attachment_id": null, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156619, "time": "2012-04-01T13:50:36Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:50:36Z", "is_private": false}]