[{"count": 0, "tags": [], "creator": "chris@die-schneider.net", "attachment_id": null, "text": "SMTPAppender always sends to localhost as it seems to set the wrong property in the session. \n\nIn the createSession method SMTPAppender sets the property \"mail.smtp.host\"\nif (smtpHost != null) {\n      props.put(\"mail.smtp.host\", smtpHost);\n}\n\nThen it calls Transport.send which tries to read the protocol from the url\nin the class Service\nif (url != null) {\n                host = url.getHost();\n                // it is possible that this could return null (rare).  If it does, try to get a\n                // value from a protocol specific session variable.\n                if (host == null) {\n                    host = session.getProperty(\"mail.\" + protocol + \".host\");\n                }\n            }\n\nBut as url is null the mail.smtp.host is not read correctly. So host stays null and the appender connects to localhost.", "id": 117215, "time": "2008-05-31T14:14:57Z", "bug_id": 45109, "creation_time": "2008-05-31T14:14:57Z", "is_private": false}, {"count": 1, "tags": [], "text": "As described, it would seem to imply that SMTPAppender should never work except for SMTP servers on the same machine.  That isn't consistent with my experience and it seems unlikely that if the problem was that universal, it would not have been reported previously.\n\nI am successfully and sending email messages using SSL to smtp.google.com and if I turn off SSL, I get an exception message that specifies \"Could not connect to SMTP host: smtp.google.com, port 25\" which indicates that the JavaMail implementation is not ignoring the specified SMTPHost.\n\nYou did not identify the source for your snippet of Transport.send().  If you are using an atypical implementation, it would be good if you would identify it.  If SMTPAppender works with more common JDK libraries and not with yours, then it would likely be a problem with your JDK's implementation of Transport.send().\n\n\n", "attachment_id": null, "id": 121563, "creator": "carnold@apache.org", "time": "2008-10-15T12:55:21Z", "bug_id": 45109, "creation_time": "2008-10-15T12:55:21Z", "is_private": false}]