[{"count": 0, "tags": [], "bug_id": 45139, "attachment_id": null, "id": 117377, "time": "2008-06-05T07:36:02Z", "creator": "thomas.schwanhaeuser@solvians.com", "creation_time": "2008-06-05T07:36:02Z", "is_private": false, "text": "Hi,\n\nin order to save memory, I tried to strip down a default installation of Apache 2.2.3 by commenting out all the default \"LoadModules\" in httpd.conf. By eliminating the one which my application doesn't need I was able to reduce the memory foot print by 50%.\n\nAnyhow, I found this rather complicated, because if you for example remove the cgi-module (because nowadays you don't need CGI anymore), you'll get an error because of this default setting far lower in the config file.\n\nScriptAlias /cgi-bin/ \"/var/www/cgi-bin/\"\n\n\nAnother example would be that if you drop mod_autoindex, this parameter here makes trouble IndexOptions FancyIndexing VersionSort NameWidth=* HTMLTable\n\n\nBecause of the so many modules, Apache offers today, I suggest to clean this up and make it more maintainable:\n\nAll parameters, which require a module to be loaded, should be wrapped in their appropriate <IfModule foo.c> statements.\n\n\nIMHO even better would be to move all module specific options into conf.d/foo.conf files.\n\nE.g. their would be a file called cgi.conf, it starts with the LoadModule statement and all options relevant to CGI. If one doesn't want CGI, one just has to remove the entire cgi.conf file.\n\nFor sanity, it could be better to introduce a subfolder with in conf.d, e.g. the location for the default CGI settings would than be /conf.d/modules/cgi.conf \n\n\nWould love your feedback,\n\n\nThomas"}, {"count": 1, "attachment_id": null, "bug_id": 45139, "is_private": false, "id": 117381, "time": "2008-06-05T07:51:57Z", "creator": "nick@webthing.com", "creation_time": "2008-06-05T07:51:57Z", "tags": [], "text": "<IfModule> is a support nightmare: the lusers use it when a module isn't loaded, then spend forever wondering why the module's directives don't work, no matter what new variants they try.\n\nFar better to have a simple, obvious and easy-to-fix one-off error."}, {"count": 2, "tags": [], "text": "Hi Nick,\n\nI understand your concern with higher support efforts for variant 1 and I'm on your side that it might not be the perfect solution to exchange that in order to lower configuration efforts.\n\nBut what do you think about variant 2? \n\nPacking all options relating to one LoadModule in one file within conf.d or even conf.d/modules?\n\n", "attachment_id": null, "id": 117392, "creator": "thomas.schwanhaeuser@solvians.com", "time": "2008-06-05T09:37:35Z", "bug_id": 45139, "creation_time": "2008-06-05T09:37:35Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 45139, "attachment_id": null, "id": 117419, "time": "2008-06-05T17:13:49Z", "creator": "slive@apache.org", "creation_time": "2008-06-05T17:13:49Z", "is_private": false, "text": "I think this discussion is irrelevant, because I believe the original poster isn't even using the config file that comes with apache httpd 2.2. For example, IndexOptions isn't even in the default config file.\n\nIf you look at the config file we distribute, you'll see that it does limit the directives used in httpd.conf to a few core modules, and uses <IfModule> around many of them. (Although I personally would rather see all the <IfModule> lines removed for the reason Nick mentions.)\n\nYou're probably using a config file created by a third-party distributor.\n\nAnd in general, if you want a \"lean-and-mean\" apache, the best thing to do is start from an empty config file and build up from there."}]