[{"count": 0, "tags": [], "creator": "enjoyaol@gmail.Com", "text": "Hello,\n\nThere is a problem in Tomcat (all versions as far as i have tested, up to the 4.X versions) regarding the realm-based authentication on tomcat's side, with Windows XP clients.\n\nAfter several weeks trying to find how to solve this problem, here it is on the bug list..\n\nBasically the problem is that the authentication provided by Tomcat is not working with the Windows XP clients using the windows xp 'Webclient' service as known as Webdav Mini-redirector.\n\nI won't explain in details how windows XP works with this Webclient service but here are the two things that are important:\n\n1) In your 'Network Places' folder, try to add a folder with an HTTP url pointing to your favorite webdav servlet protected with BASIC authentication. Configure your tomcat server to provide this servlet on something like : http://host/davservlet\nIt won't work at all because windows tries to authenticate with NTLM. The thing is that windows can't recognize the realm you are using and its type (BASIC). Windows thinks it's NTLM and provides your username like DOMAIN\\username (which, obviously, is not your login at all...).\n\n2) Configure your tomcat to provide SSL on port 443. Do the same as before : add your network folder httpS://host/davservlet : it works because another DLL file (the good one ! from microsoft office) is used to connect to it (because HTTPS is not supported by the real mini-redirector).\n\n3) Configure your tomcat to provide HTTP (not HTTPS) acccess on port XXX other than 80. Do the same as before : it works again ! Because this is the same good DLL which is used.\n\n\nYou'll say : change the port 80 to something else ! Or juste provide HTTPS which is even better ! I reply : yep, but what if i want to map my webdav access to a network drive ? Windows can handle that.... but not if your port is other than 80, and not if it's HTTPS !! So no solution so far ;((((\n\nThis is a well known bug of Tomcat since many versions. Please don't put this bug report INVALID or DECLINED as it affects many people.. I alreay saw this bug being INVALIDATED by a developper around here juste because it worked properly for him. Please try these things about the ports and the HTTPS things and you'll see by yourself that there is a problem. And as you can't change the windows DLL, perhaps on Tomcat's side, something can be done ?\n\n\nThank you !\n\nHenri", "id": 117451, "time": "2008-06-06T17:38:05Z", "bug_id": 45155, "creation_time": "2008-06-06T17:38:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 117461, "time": "2008-06-07T04:34:16Z", "bug_id": 45155, "creation_time": "2008-06-07T04:34:16Z", "is_private": false, "text": "This doesn't surprise me at all. The Webdav Mini-redirector is a complete pain. There was a fix in 6.0.15 that helped a lot for webdav on port 80 for ms clients. I'll take a look at this and see what, if anything, we can do for BASIC authentication."}, {"count": 2, "tags": [], "creator": "enjoyaol@gmail.Com", "text": "Hi Mark\n\nWhat happened to this 6.0.15 release ? huge security stuff inside ?\nAs yo u talked about this version, i got the 6.014/6.015/6.016 tags from the SVN and trying to diff all them... From the bug database i can't find the bug fix you are speaking about. Do you have a small idea in which package it was fixed ?\n\nDo you think it has been lost in 6.016 ?\n\nThanks\nHenri", "id": 117462, "time": "2008-06-07T05:28:17Z", "bug_id": 45155, "creation_time": "2008-06-07T05:28:17Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 45155, "attachment_id": null, "id": 117463, "time": "2008-06-07T05:49:55Z", "creator": "markt@apache.org", "creation_time": "2008-06-07T05:49:55Z", "is_private": false, "text": "6.0.15 was never voted stable due to issues with cookie parsing.\n\nThe fix wasn't as a result of a bug. As I recall, there were some issues on the users list and I took a look as a result of that.\n\nThe webdav fix was in the webdav servlet:\nhttp://svn.apache.org/viewvc?view=rev&revision=561186\n\nThe fix has not been lost."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 117464, "time": "2008-06-07T06:32:01Z", "bug_id": 45155, "creation_time": "2008-06-07T06:32:01Z", "is_private": false, "text": "I have taken a look at what is going on and there is nothing we can do on the Tomcat side. However, there does appear to be a workaround.\n\nWhy we can't do anything\n========================\nI have been using TCPMon to monitor the requests and responses going back and forth. With the MiniRedir the sequence is:\n1. PROPFIND -> 401 Unauthorized (as expected)\n2. PROPFIND -> 401 Unauthorized (as expected - I don't know why it tries again)\n3. OPTIONS ->200\n4. PROPFIND -> 401 Unauthorized (as expected) and it prompts for a password\nNote the password box at this point does not have a \"Remember my password\" tick box\nAfter entering a password, no request is sent to Tomcat. I don't know what MiniRedir is doing at this point but since there is no request to Tomcat, there is nothing we can do.\n\nThe workarounds\n===============\n1. If at this first password prompt you click cancel, then OK to the error message, then click next to try and connect again (this needs to be done quickly for some reason) it tries to connect again but this time using the DAV provider (the one that works) and all is well.\n2. Alternatively if you specify the port (even if it is 80) when providing the URL the DAV provider is used first time around.\n\nThe MS client is clearly broken and I am tempted to mark this as INVALID. However, I have an idea I want to try first to see if I can force the use of the DAV provider in all cases."}, {"count": 5, "tags": [], "creator": "enjoyaol@gmail.Com", "attachment_id": 22093, "text": "Created attachment 22093\nscreenshot of mapping a dav folder\n\nHello Mark\n\nI tried your workaround and it works for me also.\nBtw whenyou try to map a webdav folder in Windows, you can't use any other port than 80 in the URL. You can't even specify a port.", "id": 117466, "time": "2008-06-07T07:05:02Z", "bug_id": 45155, "creation_time": "2008-06-07T07:05:02Z", "is_private": false}, {"count": 6, "tags": [], "text": "I've created a new Valve that does a redirect with an explicit port if it detects the MiniRedir WebDAV client. The fixes the problem for me and I can use web folders on port 80 without any of the workarounds described above.\n\nThe Valve has been added to trunk and proposed for 6.0.x.\n\nIf you want to try it yourself, the commit is:\nhttp://svn.apache.org/viewvc?rev=664345&view=rev", "attachment_id": null, "bug_id": 45155, "id": 117467, "time": "2008-06-07T07:39:13Z", "creator": "markt@apache.org", "creation_time": "2008-06-07T07:39:13Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 45155, "text": "I tried the Valve and it's working nice in the webfolder. Thanks!\n\nAny idea regarding the drive mapping in windows XP ? Perhaps there is something to do in this way on that.. \n\n", "id": 117470, "time": "2008-06-07T08:57:00Z", "creator": "enjoyaol@gmail.Com", "creation_time": "2008-06-07T08:57:00Z", "is_private": false, "attachment_id": null}, {"count": 8, "attachment_id": null, "bug_id": 45155, "text": "I've tried a similar trick with mapping drives but this process insists on using the Webdav Mini-redirector. If you can find a way to trick drive mapping into using the other DLL I can probably extend the valve to get the clients to work.\n\nI can't see anything else I can do now to work-around this MS bug. MS hosts a regular (annual?) 'How can we help Apache products work better in MS environments' workshop. Hopefully I'll be able to go to the next one and see if we can find a way around this. The down side is that it is about a year away.", "id": 117550, "time": "2008-06-10T11:06:04Z", "creator": "markt@apache.org", "creation_time": "2008-06-10T11:06:04Z", "tags": [], "is_private": false}, {"count": 9, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 118082, "creation_time": "2008-06-27T14:53:33Z", "time": "2008-06-27T14:53:33Z", "bug_id": 45155, "text": "This has been applied to 6.0.x and the valve will be in 6.0.17 onwards.", "is_private": false}]