[{"count": 0, "tags": [], "bug_id": 45157, "attachment_id": null, "id": 117454, "time": "2008-06-06T23:10:02Z", "creator": "sxie@reachlocal.com", "creation_time": "2008-06-06T23:10:02Z", "is_private": false, "text": "After I updated apache server from 2.0 to 2.2, I noticed that reverse proxy does not work as in older version of apache (2.0). In older version the backend socket will be reused for http keepalive connection. In the newer version 2.2.8, I noticed that the mod_proxy is creating a new socket each time a proxied request is sent to the backend server. Is this a known bug in v2.2.8, or I need special configuration to make it reuse the existing socket?"}, {"count": 1, "tags": [], "text": "Bugzilla is no user support forum. Please post your question to the user mailinglist (users@httpd.apache.org).", "attachment_id": null, "bug_id": 45157, "id": 117457, "time": "2008-06-07T00:49:49Z", "creator": "rpluem@apache.org", "creation_time": "2008-06-07T00:49:49Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 45157, "attachment_id": null, "id": 117473, "time": "2008-06-07T16:11:53Z", "creator": "sxie@reachlocal.com", "creation_time": "2008-06-07T16:11:53Z", "is_private": false, "text": "I am re-submitting the bug report as follows:\n\nAfter I updated apache server from 2.0 to 2.2, I noticed that reverse proxy\ndoes not work as in older version of apache (2.0). In older version the backend\nsocket will be reused for http keepalive connection. In the newer version\n2.2.8, I noticed that the mod_proxy is creating a new socket each time a\nproxied request is sent to the backend server. mod_proxy need to scan through the open sockets and re-use them if possible. "}, {"count": 3, "tags": [], "bug_id": 45157, "attachment_id": null, "text": "mod_proxy DOES reuse existing connections if configured properly. As said Bugzilla is no user support forum. Please post your question to the user\nmailinglist (users@httpd.apache.org).", "id": 117477, "time": "2008-06-08T03:42:18Z", "creator": "rpluem@apache.org", "creation_time": "2008-06-08T03:42:18Z", "is_private": false}]