[{"count": 0, "tags": [], "bug_id": 45202, "attachment_id": null, "text": "I am using context.xml as my form based autentication source.  The file lives in mywar.war/META-INF/context.xml.  When I put the war in the webapps directory it is exploded and the context.xml is also copied into tc_home/conf/Catalina/localhost/ and renamed to mywar.xml.\n\nThere are several issues with this.  When developing an application I expect that the exploded files are the ones being used so in this case modifications to mywar/META-INF fail to have any effect.\n\nThe second issue with this for me is that I have two wars.  The first is the authentication source that context.xml tells the second to connect to.  When the context.xml file exists in conf/Catalina it is loaded before the web app that is the authentication source has been started and the authentication server connection is therefor not established.  My workaround it to always delete the conf/Catalina directory before starting the server.  Kind of a pain but seems to work.\n\nWhy is the file moved to the conf directory and then access from there as opposed to the deployed webapp?  \n\nThank You", "id": 117670, "time": "2008-06-13T11:39:55Z", "creator": "futung.cheng@yahoo.com", "creation_time": "2008-06-13T11:39:55Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Copying to conf is an intentional design decision. There are a few things that need cleaning up in this area (see bug 42747) but I don't think changes for that bug are going to help you. If you want to discuss the reasons behind the design decision, please use the dev list.\n\nI'm not clear how you are using context.xml for authentication but it looks like you are using context.xml for a purpose other than that for which it was intended. There is probably a better solution to the problem you are trying to solve. The users list is the place to get help with that.", "id": 117671, "time": "2008-06-13T11:59:06Z", "bug_id": 45202, "creation_time": "2008-06-13T11:59:06Z", "is_private": false}]