[{"count": 0, "tags": [], "bug_id": 45210, "attachment_id": 22130, "id": 117706, "time": "2008-06-15T11:39:49Z", "creator": "earl@earlhood.com", "creation_time": "2008-06-15T11:39:49Z", "is_private": false, "text": "Created attachment 22130\nPatch to specify systemId for catalog intput source\n\nThe systemId of the XML input source of a catalog file\nis not set when calling SAX parser.  This causes any\nrelative external references in the file to resolve\nagainst the incorrect base (current working dir) versus the\ncorrect base (location of catalog file).\n\nThis problem normally leads to a fatal exception by\nthe SAX parser since the external entity cannot be found.\n\nAttached is a patch that supports setting the systemId of\nthe catalog input source so relative external entities\nwill be resolved against the proper base.\n\nNOTE: The classes DOMCatalogReader and TextCatalogReader\ncurrently have stubs for systemId support: they just call\nbase readCatalog() method w/o systemId support.  Unsure\nif these classes are even used in practice."}, {"count": 1, "tags": [], "creator": "crossley@apache.org", "text": "Have you considered the effect of the \"relative-catalogs\" property?\nhttp://xml.apache.org/commons/components/resolver/tips.html\nhttp://xml.apache.org/commons/components/resolver/resolver-article.html", "id": 117956, "time": "2008-06-24T22:07:23Z", "bug_id": 45210, "creation_time": "2008-06-24T22:07:23Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45210, "attachment_id": null, "text": "(Woops, accidently closed this when Bz skipped to the next issue.)", "id": 117961, "time": "2008-06-25T01:23:20Z", "creator": "crossley@apache.org", "creation_time": "2008-06-25T01:23:20Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 45210, "attachment_id": null, "text": "Are you stating the patch breaks some existing behavior?\nThis fixes a problem with the actual parsing of catalog\nfiles via the SAX parser.\n\nIn the project I'm working on, the resolver errors out\non XML catalog files that have doctype declarations.  For example:\n\n  <!DOCTYPE catalog SYSTEM \"../../../dtd/catalog.dtd>\n  <catalog>...\n\nThe problem is the resolver does not set the initial base\nURI when calling SAX.  Therefore, the *SAX parser* will\nresolve all (XML) entities with a base URI of the current working\ndirectory, and NOT the location of the catalog file.\n\nTherefore, in the above, the URI \"../../../dtd/catalog.dtd\"\nwill be looked up by the SAX parser based on the current\nworking directory.  But, the URI should be resolved based\non the location of the catalog file.\n\nThe patch basically sets the systemId setting when SAX is\ninvoked when parsing the file so any relative URI *entity*\nreferences in the catalog itself will be resolved against\nthe correct base.\n\nNone of this affects how catalog paths are resolved via\nthings like <nextCatalog> entries since that is an\napplication-specific processing task and not something the\nSAX parser resolves itself.", "id": 118007, "time": "2008-06-26T07:51:05Z", "creator": "earl@earlhood.com", "creation_time": "2008-06-26T07:51:05Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 45210, "text": "I have not tried the patch yet, and now away for another week.\n\nWhen you talked about relative references, i thought that you were referring to entries within the catalog. See one of our examples at:\n[1] http://svn.apache.org/repos/asf/forrest/trunk/main/webapp/resources/schema/catalog.forrest.xcat\nThe \"uri\" attributes of the \"public\" elements do get resolved relative to the catalog.forrest.xcat file.\n\nAnyway, now i see that you mean the DTD for the catalog itself.\n\nBy the way, i think that i am still a bit confused by that \"relative-catalogs\" property and will attempt again to understand the docs.\n\nNote that we use a PublicIdentifier for our catalogs (e.g. [1] above). IIRC the Resolver handles this internally when we do it that way. We don't need the catalog.dtd to be present, and it doesn't bang on the net to try to get it from that SystemIdentifier URL.\n\nI will still investigate your patch and do some testing.", "id": 118800, "time": "2008-07-18T02:44:27Z", "creator": "crossley@apache.org", "creation_time": "2008-07-18T02:44:27Z", "is_private": false, "attachment_id": null}]