[{"count": 0, "tags": [], "creator": "nagireddy9@gmail.com", "text": "While writing log to a file, it's writing to an out-dated file. Please find the attachment.", "id": 117812, "time": "2008-06-19T04:52:45Z", "bug_id": 45236, "creation_time": "2008-06-19T04:52:45Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "nagireddy9@gmail.com", "text": "Created attachment 22144\nThe bug result", "id": 117816, "time": "2008-06-19T06:00:11Z", "bug_id": 45236, "creation_time": "2008-06-19T06:00:11Z", "is_private": false, "attachment_id": 22144}, {"count": 2, "tags": [], "creator": "thorbjoern@gmail.com", "text": "Can you see in the lines what was logged at that time?\n\nIs it just a single line or many lines?", "id": 118140, "time": "2008-06-30T14:32:07Z", "bug_id": 45236, "creation_time": "2008-06-30T14:32:07Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 45236, "attachment_id": null, "text": "A bulk of output lines have been written to an out-dated log. It's not once, frequently happening. As I know, writing one line or multiple lines to an \nout-dated log file is not important. Please try to fix this as soon as possible,as some times we are unable to find out the correct log statements. Some times it's writing to multiple files(Out-dated).", "id": 118185, "time": "2008-07-02T01:40:37Z", "creator": "nagireddy9@gmail.com", "creation_time": "2008-07-02T01:40:37Z", "is_private": false}, {"count": 4, "tags": [], "creator": "carnold@apache.org", "is_private": false, "text": "Created attachment 22209\nPDF version of original Microsoft Word template\n\nThe original attachment is a Microsoft Word template file (.dot) which suggests the presences of a Word Macro virus.", "id": 118191, "time": "2008-07-02T06:32:31Z", "bug_id": 45236, "creation_time": "2008-07-02T06:32:31Z", "attachment_id": 22209}, {"count": 5, "tags": [], "bug_id": 45236, "is_private": false, "id": 118192, "attachment_id": null, "creator": "carnold@apache.org", "creation_time": "2008-07-02T06:41:22Z", "time": "2008-07-02T06:41:22Z", "text": "The behavior mentioned is consistent with configuring multiple instances of log4j writing to the same DailyRollingFileAppender.  The behavior and attachment suggests that the platform is a Unix and not Windows XP as reported.  Having multiple instances of any file appender write to the same path name is known to be error-prone and is strongly discouraged and unsupported.\n\nIf multiple instances are writing to the same file names, one instance may rename a file while another instance continues to write to it.  When the second instance attempts to roll over its working file, it fails since the target file already exists.\n\nUnless the problem is not related to multiple instances and additional information is provided, the report should be marked INVALID."}, {"count": 6, "tags": [], "creator": "nagireddy9@gmail.com", "is_private": false, "text": "We are not using multiple instances of log4j. See here the problem is only one instance that exists in the system is trying to write the log statements to an out-dated file. For example, today is 02/07/2008. So the log4j is supposed to write the log statements to a file called smmt.log. But some times it is trying to write to a file smmt.log.2008-06-29. \n\nWe have the following properties as part of log4j.propertis file.\n\nlog4j.appender.R=org.apache.log4j.DailyRollingFileAppender\nlog4j.appender.R.File=smmt.log\nlog4j.appender.R.layout=org.apache.log4j.PatternLayout\nlog4j.appender.R.layout.ConversionPattern=%d{dd MMM yyyy HH:mm:ss,SSS} [%-5p] %c - %m\\n\nlog4j.appender.R.Threshold=DEBUG\n\n here R is the logger name.", "id": 118194, "time": "2008-07-02T07:15:51Z", "bug_id": 45236, "creation_time": "2008-07-02T07:15:51Z", "attachment_id": null}, {"count": 7, "tags": [], "creator": "thorbjoern@gmail.com", "text": "(In reply to comment #5)\n> The behavior mentioned is consistent with configuring multiple instances of\n> log4j writing to the same DailyRollingFileAppender.  The behavior and\n> attachment suggests that the platform is a Unix and not Windows XP as reported.\n\nThe screen dump in the PDF strongly suggest to come from a Unix machine.  The naming is consistent with the \"Configuring Linux for the Installation of Oracle Database 10g\" document from Oracle\n\nhttp://www.oracle.com/technology/obe/obe10gdb/install/linuxpreinst/linuxpreinst.htm\n\nIt is known that the DailyRollingFileAppender is not rolling over until an event is logged which then triggers a check.  It would be consistent with known behaviour if there were multiple log4j instances writing to the same files, so one instance has rolled over but with others not having checked yet. I agree with your findings.\n\nAs OC4J is mentioned in the screen dump it would be reasonable to expect that we are dealing with the Oracle web container OC4J, and that the multiple loggers could happen from two or more web applications with their own log4j copy, but with the same log4j configuration.\n\n", "id": 118206, "time": "2008-07-02T16:47:17Z", "bug_id": 45236, "creation_time": "2008-07-02T16:47:17Z", "is_private": false, "attachment_id": null}, {"text": "(In reply to comment #6)\n> We are not using multiple instances of log4j. See here the problem is only one\n> instance that exists in the system is trying to write the log statements to an\n> out-dated file. For example, today is 02/07/2008. So the log4j is supposed to\n> write the log statements to a file called smmt.log. But some times it is trying\n> to write to a file smmt.log.2008-06-29. \n> \n> We have the following properties as part of log4j.propertis file.\n> \n> log4j.appender.R=org.apache.log4j.DailyRollingFileAppender\n> log4j.appender.R.File=smmt.log\n> log4j.appender.R.layout=org.apache.log4j.PatternLayout\n> log4j.appender.R.layout.ConversionPattern=%d{dd MMM yyyy HH:mm:ss,SSS} [%-5p]\n> %c - %m\\n\n> log4j.appender.R.Threshold=DEBUG\n> \n>  here R is the logger name.\n\nI believe that this may be caused by several web applications configured identically even if it is in the same web container.  If you need common logging for all web applications you need to move log4j.jar out of the individual web applications and into the area providing common jars for all web application.\n\nCan you please create a small example reproducing the behaviour you see, and give \"uname -a\" on the host having the problems?\n", "tags": [], "creator": "thorbjoern@gmail.com", "is_private": false, "count": 8, "id": 118207, "time": "2008-07-02T16:51:48Z", "bug_id": 45236, "creation_time": "2008-07-02T16:51:48Z", "attachment_id": null}, {"text": "Awaiting information from original reporter.\n\nThis might be yet another \"cannot roll over in RollingFileAppender\" but I find it suspicious that there are two different files which have been written to and they have only one inode count each.  Hence the need to clarify the configuration in this problem.", "tags": [], "creator": "thorbjoern@gmail.com", "is_private": false, "count": 9, "id": 119245, "time": "2008-08-02T09:04:19Z", "bug_id": 45236, "creation_time": "2008-08-02T09:04:19Z", "attachment_id": null}]