[{"count": 0, "tags": [], "text": "We test a system with the mail reader, which doesn't cache the headers and sign the message 2 times. First time the header which is taken with top and the second time when the MailReader retieves the whole message.This is a problem because,  the boundary of the header is different from the message body. In this case it ends in a Boundary-Exception.\n\nthis propleme can resolved with the mail properties:\n\nmail.pop3.disabletop=true\nmail.pop3.forgettopheaders=true \n\n\nI have patched the MailReader with adding a checkbox called \"Enable header caching\". The source based on the MailReader from BUG 45005.\nThe default value is false, which means the properties on top will be set for starting the session and the pop session forget the header which is taken with top.\n\nWith this patch it's not possible to enable and disable the header caching for all samplers with one option. \n\nThis could be resolved with java properties for example:\n\nstarting jmeter with java properties like :mailReader.mail.pop3.disabletop=true\nand the MailReader could check if any java property is set for him. When the MailReader finds a property it can now do something with it. In this case set the properties for the pop session to forget the top headers.", "is_private": false, "bug_id": 45244, "id": 117858, "time": "2008-06-20T04:55:21Z", "creator": "boli@zhaw.ch", "creation_time": "2008-06-20T04:55:21Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Created attachment 22152\n MailReaderSampler as .tar", "attachment_id": 22152, "id": 117859, "creator": "boli@zhaw.ch", "time": "2008-06-20T04:56:11Z", "bug_id": 45244, "creation_time": "2008-06-20T04:56:11Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 45244, "attachment_id": null, "id": 117860, "time": "2008-06-20T05:12:14Z", "creator": "sebb@apache.org", "creation_time": "2008-06-20T05:12:14Z", "is_private": false, "text": "It took me a while to realise that this enhancement relates to code that is not part of any JMeter versions.\n\nIf you want to add to existing enhancement requests, please either update the original request, or make it very clear at the start that the enhancement relates to proposed code.\n\nIn this case, the easiest would be to provide a new patch for bug 45005.\n\nClosing accordingly."}]