[{"count": 0, "tags": [], "creator": "ccox@cincom.com", "attachment_id": null, "is_private": false, "id": 7318, "time": "2001-10-30T12:19:15Z", "bug_id": 4524, "creation_time": "2001-10-30T12:19:15Z", "text": "I have tried using the tomcat.exe to install tomcat 4.0.1 as a service, but\nit hangs after the 2nd or 3rd request(sometimes the first also). This is a\nplain install and I try to access the documentation or the examples. I have\nnot changed anything. \n\nOn one install of W2k Pro, I got a 'runtime exception'(sorry, no more detail\nis provided) and the service would die every time this happened. No other\ninstalls gave this error. \n\nOnce it hangs, there are no messages in any of the error logs. Up until then\nthe messages in the log are normal logging. I have tried increasing the\ndebug level to \"99\" for most components and there are no new messages. \n\nWhen I try to stop the service, I usually get a message that it did not\nrespond and has to be killed.\n\nI have tried this on several machines, W2k and NT4, all with the same\nresult.\n\nstarting tomcat with catalina.bat works as it should with no problems."}, {"count": 1, "tags": [], "text": "I'm constantly using the tomcat service running on my laptop, and didn't\nexperience any crashes (except with the VM crash bug that has been reported a\nfew days ago). So I'll close the bug as a WORKSFORME unless you can provide some\nideas information about what is specific in your configuration(s) that would\nmake Catalina crash (esp since apparently you can do it reliably on a large\nnumber of computers).\n\nI don't understand the 'runtime exception' part. Is it a VM crash ? Is it a Java\nstack trace (in that case, can you add it to the bug report ?).\n\nI'm using JDK 1.3 or 1.4b2 with Win2k SP 2.", "attachment_id": null, "bug_id": 4524, "id": 7334, "time": "2001-10-30T14:03:16Z", "creator": "remm@apache.org", "creation_time": "2001-10-30T14:03:16Z", "is_private": false}, {"count": 2, "tags": [], "creator": "ccox@cincom.com", "attachment_id": null, "id": 7367, "time": "2001-10-31T08:14:30Z", "bug_id": 4524, "creation_time": "2001-10-31T08:14:30Z", "is_private": false, "text": "The message I got on the one install of Win2K(unfortunately was reinstalled to \nNT4) was \"Visual C++ runtime error\" - no error number,description, or anything. \nThen the process dies after hitting 'Ok' on the message box.\n\nI am using jdk 1.2.2, but have upgraded to 1.3.1 and had the same problem. \nThe -Xrs option didn't have any effect either.\n\nI think the problem is in the tomcat.exe as opposed to the java classes. There \nis nothing in any of the logs once it stops responding. Nor is there anything \nuseful in the Event Log(it does log that service manager has to kill the \nprocess when I click 'stop').\n\nI hacked the jk_nt_service.exe/wrapper.properties from tc 3.2.3 to run tc 4.0 \nas a service and it works fine so far. I found this explaination in the \narchives:\nhttp://www.mail-archive.com/tomcat-user@jakarta.apache.org/msg35196.html\n\nI do have Office 2k on all the machines. They also have netshield/virusscan on \nthem. I have disabled the netshield service and it didn't change the results. \n\nThe only machine that I have it running with no problems is my development \nmachine which has visual studio 6(c++/vb/interdev) installed. Another developer \nwith visual studio (only vb/interdev) still has the problem. I don't know if \nthis is related to the problem(or coincidence) or if you are running Visual \nStudio. The error above would lead me to believe that tomcat.exe was built with \nVS, but I can not find the source/makefile for this executable. CVS contains a \nservice directory, but it appears to be a unix service. Do you know where the \nsource for tomcat.exe is? I can play with it to better isolate the problem.\n"}, {"count": 3, "tags": [], "text": "I don't have Visual Studio installed on either my desktop or my laptop, but it \nmay be that there is some problems with some versions of the MS C/C++ runtime. \nI installed a lot of other programs which may have updated it, including many \nnewer versions of IE.\n\nIf tomcat.exe segfaults by itself on startup, then it's normal that the \ncatalina logs are empty. stdout.log and stderr.log may contain some information.\n\nThe service the installer installs is JavaService:\nhttp://www.alexandriasc.com/software/JavaService/index.html\n\nYou may want to report the problem to them to see if they have an idea.", "is_private": false, "bug_id": 4524, "id": 7397, "time": "2001-10-31T12:10:12Z", "creator": "remm@apache.org", "creation_time": "2001-10-31T12:10:12Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 7795, "time": "2001-11-12T13:34:23Z", "bug_id": 4524, "creation_time": "2001-11-12T13:34:23Z", "text": "I'll mark the bug as worksforme. If there is an incompatibility between \nJavaService and a particular version of MS C runtime, then there is nothing \nthat Tomcat can do to get around it."}, {"count": 5, "tags": [], "creator": "kevin@plop.org", "attachment_id": null, "is_private": false, "id": 8580, "time": "2001-12-04T15:07:53Z", "bug_id": 4524, "creation_time": "2001-12-04T15:07:53Z", "text": "I was also having this problem, and I may have a workaround.\nI am using JDK 1.3 on WinXP, when tomcat was installed it was using the classic \njvm.dll, when I changed the JVM Library used by JavaService to the hotspot \njvm.dll, everything started working perfectly"}, {"count": 6, "text": "I've now tried this on two seperate systems I have that were having trouble, \nsame result (using classic jvm.dll tomcat hangs, with hotspot it works fine)", "bug_id": 4524, "is_private": false, "id": 8931, "time": "2001-12-14T13:41:34Z", "creator": "kevin@plop.org", "creation_time": "2001-12-14T13:41:34Z", "tags": [], "attachment_id": null}, {"count": 7, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 9884, "time": "2002-01-24T19:55:38Z", "bug_id": 4524, "creation_time": "2002-01-24T19:55:38Z", "text": "According to all the comments, it looks like a VM problem, or an incompatibility\nwith the VM and JavaService. In any case, it is not a Tomcat bug."}]