[{"count": 0, "tags": [], "bug_id": 45255, "text": "please see wikipedia\nhttp://en.wikipedia.org/wiki/Session_fixation", "id": 117892, "time": "2008-06-23T01:33:05Z", "creator": "zhouyanming@gmail.com", "creation_time": "2008-06-23T01:33:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 45255, "attachment_id": null, "id": 117893, "time": "2008-06-23T01:43:25Z", "creator": "markt@apache.org", "creation_time": "2008-06-23T01:43:25Z", "is_private": false, "text": "Please read SRV.7.1 of the servlet spec.\n\nAn option could be adding to disable URL-rewriting (noting that this would be non-spec compliant).\n\nRequests for enahncements that are accompanied by patches tend to get looked at sooner that those without."}, {"count": 2, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "is_private": false, "id": 117894, "time": "2008-06-23T01:58:29Z", "bug_id": 45255, "creation_time": "2008-06-23T01:58:29Z", "text": "Hi Mark,\n\nSpec 7.1 seems to say:\n\n- a compliant container may support URL encoded sessions (\"may be used\")\n- if it does support them, it has to use the path parameter \"jsessionid\"\n\nSo if a site decides to only use cookies because of security, it could be an interesting option to allow not even accepting session IDs which were URL encoded.\n\nWhat do you think?"}, {"count": 3, "tags": [], "bug_id": 45255, "attachment_id": null, "id": 117895, "time": "2008-06-23T02:32:36Z", "creator": "markt@apache.org", "creation_time": "2008-06-23T02:32:36Z", "is_private": false, "text": "SRV.7.1.4 is the important bit for us. If we disable URL-rewriting we break the spec. That said, I am not against it as an option (probably at the context level) providing it defaults to off."}, {"count": 4, "attachment_id": null, "bug_id": 45255, "is_private": false, "id": 117899, "time": "2008-06-23T02:40:39Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2008-06-23T02:40:39Z", "tags": [], "text": "Ahh, of course you are right. I'll see how easy an option is (I guess the incoming session path parameter and cookie is handled in the connector, and the context later doesn't know, where the id in the request came from ...).\n"}, {"count": 5, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "id": 117901, "time": "2008-06-23T02:46:58Z", "bug_id": 45255, "creation_time": "2008-06-23T02:46:58Z", "is_private": false, "text": "Sorry, again I wrote partial nonsense: there is a request.isRequestedSessionIdFromURL() in the servlet API. So it is easy for us to know, but also for the webapp. One could thus prevent session fixation via the jsessionid path parameter by a simple filter, that invalidates the session, if request.isRequestedSessionIdFromURL() is true."}, {"count": 6, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 117902, "time": "2008-06-23T02:56:29Z", "bug_id": 45255, "creation_time": "2008-06-23T02:56:29Z", "text": "That would work. If we wanted to make this a Tomcat option the code around the context configuration option cookies is where I would start."}, {"count": 7, "tags": [], "bug_id": 45255, "attachment_id": 23284, "id": 125005, "time": "2009-02-19T18:45:27Z", "creator": "dill.sellars@gmail.com", "creation_time": "2009-02-19T18:45:27Z", "is_private": false, "text": "Created attachment 23284\nPatch to allow URL rewriting to be disabled\n\nAttaching a proposed patch for review."}, {"attachment_id": null, "tags": [], "bug_id": 45255, "is_private": false, "count": 8, "id": 125701, "time": "2009-03-23T07:34:47Z", "creator": "dill.sellars@gmail.com", "creation_time": "2009-03-23T07:34:47Z", "text": "It's worth mentioning that checking request.isRequestedSessionIdFromURL() won't stop session fixation attacks. The first request to Tomcat where a session is created will put the JSESSIONID in both the cookie and querystring. An attacker can shoulder-surf and read the JSESSIONID from the URL and craft their own JSESSIONID cookie."}, {"count": 9, "tags": [], "text": "(In reply to comment #7)\n> Created an attachment (id=23284) [details]\n> Patch to allow URL rewriting to be disabled\n> \n> Attaching a proposed patch for review.\n\nWe also need to make sure that \"jsessionid\" isn't accepted anymore if present.\n\nPlease take a look at CoyoteAdapter.parseSessionCookieId() and make the patch apply the same checks to parseSessionId() with context.getUrlRewriting().\n\nThanks!", "is_private": false, "id": 126510, "creator": "fb@toxis.com", "time": "2009-04-24T16:38:05Z", "bug_id": 45255, "creation_time": "2009-04-24T16:38:05Z", "attachment_id": null}, {"count": 10, "tags": [], "bug_id": 45255, "attachment_id": 23544, "id": 126522, "time": "2009-04-26T10:26:29Z", "creator": "dill.sellars@gmail.com", "creation_time": "2009-04-26T10:26:29Z", "is_private": false, "text": "Created attachment 23544\nUpdated patch\n\nGood catch, patch updated. \n\nAdded the check to CoyoteAdapter.parseSessionId() - had to move the mapping of the context up before parseSessionId() and had to move URI decoding before mapping the context. \n\nPatches without conflict with the httpOnly changes. \n\nChanged param in comment / interface from cookies to urlRewriting in Context & StandardContext."}, {"text": "The Servlet 3.0 spec (ie Tomcat 7 / trunk) includes this as part of the spec. Look for javax.servlet.SessionTrackingMode\n\nI think this will do everything you are looking for, although it does mean waiting for Tomcat 7.", "tags": [], "creator": "markt@apache.org", "is_private": false, "count": 11, "id": 126523, "time": "2009-04-26T14:01:36Z", "bug_id": 45255, "creation_time": "2009-04-26T14:01:36Z", "attachment_id": null}, {"count": 12, "tags": [], "bug_id": 45255, "attachment_id": null, "id": 126550, "time": "2009-04-27T09:08:54Z", "creator": "fb@toxis.com", "creation_time": "2009-04-27T09:08:54Z", "is_private": false, "text": "(In reply to comment #11)\n> The Servlet 3.0 spec (ie Tomcat 7 / trunk) includes this as part of the spec.\n> Look for javax.servlet.SessionTrackingMode\n> \n> I think this will do everything you are looking for, although it does mean\n> waiting for Tomcat 7.\n\nSadly, Tomcat 7 may not be an option for many of us for a long time. I had to fight really hard for the switch to Tomcat 6. Please reconsider applying this small patch to Tomcat 6 because session fixation is a real threat. \n\nThough it's reassuring to have Tomcat abide by the rules by default, it wouldn't hurt to give users more options, even spec breaking options, especially when it comes to security. I'd rather have Tomcat warn me that the webapp is deployed into a non-compliant context than putting my client's data at risk."}, {"attachment_id": null, "tags": [], "bug_id": 45255, "is_private": false, "count": 13, "id": 126563, "time": "2009-04-27T13:36:42Z", "creator": "dill.sellars@gmail.com", "creation_time": "2009-04-27T13:36:42Z", "text": "At least where I work this is on a security checklist - having this in Tomcat 6 will lead to more adoption. This is something that ops / admins will look for in SpringSource tc Server as it is already configurable in Jetty, Weblogic, Resin, Glassfish, and WebSphere. It's a case where it is better to break the spec (not by default) for security purposes. I'd love to see it in 6.0.19 if possible. Running patched makes one second guess everything - I'd like to be running the same binaries as everyone else."}, {"attachment_id": null, "tags": [], "bug_id": 45255, "is_private": false, "count": 14, "id": 128384, "time": "2009-06-29T03:35:12Z", "creator": "kalpesh.p@directi.com", "creation_time": "2009-06-29T03:35:12Z", "text": "I think this option will be realy usefull to fight against session fixation problem. Looking forward to have this patched in tomcat 6."}, {"count": 15, "tags": [], "text": "I would urge to put Sellars' patch into the next Tomcat 6 version. It may not be the final weapon against session fixation (also a cookie-based attack seems possibile to me), but it is definitely good in fixing plenty of problems with search engines and ugly URLs...", "attachment_id": null, "id": 130065, "creator": "giampaolo@tomassoni.biz", "time": "2009-08-31T06:10:36Z", "bug_id": 45255, "creation_time": "2009-08-31T06:10:36Z", "is_private": false}, {"count": 16, "tags": [], "bug_id": 45255, "is_private": false, "id": 130619, "attachment_id": null, "creator": "rejeev@gmail.com", "creation_time": "2009-09-23T09:47:24Z", "time": "2009-09-23T09:47:24Z", "text": "I think we have mis-understood Session fixation. disabling URL re-write will not solve session fixation. \nPlease refer to http://www.owasp.org/index.php/Session_Fixation \nand http://rejeev.blogspot.com/2009/09/session-fixation_08.html \nThe correct solution for Session fixation is to create new Session cookie each time an authentication happens (discard old cookie and send new cookie to client after authentication)."}, {"count": 17, "tags": [], "bug_id": 45255, "text": "Actually, preventing the use of the session ID in the URL goes a long way to preventing session fixation as it blocks the most easily exploited attack vectors. There would remain an issue with cookies but that should be limited to 3rd party cookies which may not be an issue for many situations.\n\nYou are correct that changing the session ID on authentication will resolve all session fixation attacks. However, changing the session ID may also cause application breakage. It may also cause internal breakage for things like session replication. There would need to be some very careful testing.\n\nWhilst each of these techniques can be achieved by web applications (some more easily than others), there is clearly some scope for adding options to Tomcat so the container handles this transparently.", "id": 130625, "time": "2009-09-23T10:20:36Z", "creator": "markt@apache.org", "creation_time": "2009-09-23T10:20:36Z", "is_private": false, "attachment_id": null}, {"count": 18, "tags": [], "text": "A good document describing session fixation can be found here:\n\nhttp://www.acros.si/papers/session_fixation.pdf\n\nJust disabling the usage of jsessionid=.... in the URL does not solve the problem, it just closes one of many open doors.", "attachment_id": null, "bug_id": 45255, "id": 132052, "time": "2009-11-17T11:48:35Z", "creator": "a.schild@aarboard.ch", "creation_time": "2009-11-17T11:48:35Z", "is_private": false}, {"count": 19, "tags": [], "text": "At the risk of sounding like a troll, this is a pretty major security issue. Why is it only now being dealt with?\n\nTrue, it's not going prevent all session fixation, but as Mark Thomas mentioned, it goes a /long/ way, and makes it /much/ more difficult to pull off. You can no longer shoot a simple link to a user, and immediately have access to their session  \n\nRegardless, it does prevent Session Hijacking  - http://en.wikipedia.org/wiki/Session_hijacking - (esp. in applications that don't expire the session on the server). \n\nImagine you visit an application at a public PC, and a session ID is written to the URL. When that page is saved to the browser's cache, the URL is saved with the JSESSIONID parameter. A user could simply browse this cache, looking for valid session ids. \n\nSimilarly, the session id can be cached in a proxy cache, or be sniffed along the path. \n\nUntil this is fixed, i'm recommending the following:\n\nPrevent SessionID from being written in the URL. There’s not an easy configuration option for this with Tomcat, unfortunately:\n   http://forum.springsource.org/archive/index.php/t-27259.html\n\nEnsure a new SessionID is set when the user successfully logs into the application. This will prevent an attack called Session Fixation: http://www.acros.si/papers/session_fixation.pdf \n\nImplement relatively quick expiring sessions on the server (30 mins or less)\n\nImplement HTTPS w/ secure cookies (to prevent sidejacking - and issue that will persist regardless of session id's in the url)\n\nMore info here: \n\nhttp://blog.0x0e.org/post/277275694/tomcats-jsessionid-in-the-url", "is_private": false, "id": 132706, "creation_time": "2009-12-09T23:57:11Z", "time": "2009-12-09T23:57:11Z", "creator": "jcran@0x0e.org", "bug_id": 45255, "attachment_id": null}, {"count": 20, "tags": [], "bug_id": 45255, "attachment_id": null, "id": 132707, "time": "2009-12-09T23:59:01Z", "creator": "jcran@0x0e.org", "creation_time": "2009-12-09T23:59:01Z", "is_private": false, "text": "i should be careful. it doesn't prevent all session hijacking. just certain use-cases. see comments above. \n\njcran"}, {"attachment_id": null, "tags": [], "creator": "markt@apache.org", "is_private": false, "count": 21, "id": 132775, "time": "2009-12-11T09:45:21Z", "bug_id": 45255, "creation_time": "2009-12-11T09:45:21Z", "text": "I have patched Tomcat 7 to change the session ID on authentication by default. The same patch has been proposed for 6.0.x and 5.5.x although the default may be not to change the session ID.\n\nWith this patch applied the situation is:\nTomcat 7\n- Not vulnerable by default since session ID changes on authentication\n- If this default is changed by the user (eg because the application can't handle a changing session ID) then the risks may be minimised by disabling session tracking via URL (a new feature in Servlet 3)\n\nTomcat 5 & 6\n- Can be prevented by enabling changing the session ID on authentication (if there is insufficient support for this to be enabled by default)\n- If the application can't handle a changing session ID then the risks may be minimised by writing a custom filter that checks request.isRequestedSessionIdFromURL() and responds accordingly (eg rejecting the request)\n\nWith these changes in place, although there will not be an option to disabled URL re-writing, I believe that there will be sufficient options to prevent session fixation which is, after all, the reason behind the request to be able to disable URL rewriting."}, {"count": 22, "tags": [], "text": "The patch has been applied to 6.0.x and will be included in 6.0.21 onwards.", "attachment_id": null, "id": 132961, "creation_time": "2009-12-19T17:05:23Z", "time": "2009-12-19T17:05:23Z", "creator": "markt@apache.org", "bug_id": 45255, "is_private": false}, {"count": 23, "text": "Really pleased to see this integrated. Thank you Mark / Dillon. \n\nJust to be clear, we're waiting until Tomcat 7 to be able to remove the JSessionID from the url?", "creator": "jcran@0x0e.org", "attachment_id": null, "id": 133220, "time": "2009-12-30T07:36:31Z", "bug_id": 45255, "creation_time": "2009-12-30T07:36:31Z", "tags": [], "is_private": false}, {"count": 24, "tags": [], "bug_id": 45255, "is_private": false, "id": 133221, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2009-12-30T07:50:25Z", "time": "2009-12-30T07:50:25Z", "text": "(In reply to comment #23)\n> Really pleased to see this integrated. Thank you Mark / Dillon. \n> \n> Just to be clear, we're waiting until Tomcat 7 to be able to remove the\n> JSessionID from the url?\n\nYes, but Tomcat 5 & 6 will change the session ID on authentication which addresses the root cause of the session fixation. With that fixed whether or not the session ID is in the URL is moot."}, {"count": 25, "tags": [], "creator": "jcran@0x0e.org", "attachment_id": null, "is_private": false, "id": 133222, "time": "2009-12-30T08:14:01Z", "bug_id": 45255, "creation_time": "2009-12-30T08:14:01Z", "text": "(In reply to comment #24)\n> ...\n> Yes, but Tomcat 5 & 6 will change the session ID on authentication which\n> addresses the root cause of the session fixation. With that fixed whether or\n> not the session ID is in the URL is moot.\n\nSo it appears that the session ID in the URL will be encrypted. I had to do some sniffing / digging myself - http://answers.google.com/answers/threadview/id/758002.html - but it's still bad practice, and introduces vulnerability. \n\nConsider the case of a proxy server, or of your own browser history. If you take a look, you'll see that jsessionid's are getting cached in the history, regardless of whether they were handed out after authentication or not. \n\nThat aside, there's no reason that the browser couldn't cache the entire response, thus making this whole point moot -- it just doesn't out of the box. Removing the session ID from the URL would prevent browser history caching of a Session ID."}, {"count": 26, "tags": [], "text": "(In reply to comment #25)\n> So it appears that the session ID in the URL will be encrypted. I had to do\n> some sniffing / digging myself -\n> http://answers.google.com/answers/threadview/id/758002.html - but it's still\n> bad practice, and introduces vulnerability. \n\nThis is FUD. There is no vulnerability here.\n\n> Consider the case of a proxy server, or of your own browser history. If you\n> take a look, you'll see that jsessionid's are getting cached in the history,\n> regardless of whether they were handed out after authentication or not. \n> \n> That aside, there's no reason that the browser couldn't cache the entire\n> response, thus making this whole point moot -- it just doesn't out of the box.\n> Removing the session ID from the URL would prevent browser history caching of a\n> Session ID.\n\nMore FUD.\n\nThe situations you describe are not vulnerabilities. Since Bugzilla is neither a support forum nor a discussion forum, if you wish to continue this discussion further, please do so on the users list.", "is_private": false, "id": 133225, "creator": "markt@apache.org", "time": "2009-12-30T08:37:02Z", "bug_id": 45255, "creation_time": "2009-12-30T08:37:02Z", "attachment_id": null}, {"count": 27, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 135029, "time": "2010-03-03T23:12:24Z", "bug_id": 45255, "creation_time": "2010-03-03T23:12:24Z", "is_private": false, "text": "The ability to change the session ID on authentication has been added to 5.5.x and will be included in 5.5.29 onwards."}, {"count": 28, "tags": [], "bug_id": 45255, "text": "Should changing the session id of an existing session object be treated the same as creating a new session i.e. should the session creation listeners be triggered?\n\nhttp://svn.apache.org/viewvc/tomcat/tc5.5.x/trunk/container/catalina/src/share/org/apache/catalina/session/ManagerBase.java?r1=903083&r2=918761 invokes setId() which in turn invokes the session creation listeners in tellNew().", "id": 137353, "time": "2010-06-04T08:51:33Z", "creator": "yoarvi@gmail.com", "creation_time": "2010-06-04T08:51:33Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 45255, "is_private": false, "count": 29, "id": 139466, "time": "2010-08-25T15:01:59Z", "creator": "markt@apache.org", "creation_time": "2010-08-25T15:01:59Z", "text": "*** Bug 40222 has been marked as a duplicate of this bug. ***"}]