[{"count": 0, "tags": [], "bug_id": 45262, "text": "Could Ant be enhanced to support a viewpath? \n\nFor example if VPATH=/NodeA:/NodeB:/NodeC and a developer's current working directory is under /NodeA, viewpathing would mean all files required by the build.xml would not have to exist under /NodeA. Such files could be in /NodeB or /NodeC as well. Each node of the viewpath would be checked from left to right for each required file, and the first found instance of the file would be used. \n\nThe advantage of viewpathing is that the developer doesn't have to maintain a full set of the project source in their node, rather only those source files that changed. All other source could be in a shared area or an \"official\" build environment. This can facilitate collaboration among multiple developers on large applications.\n\nThe viewpathing feature described above exists in Alcatel-Lucent (and AT&T) nmake for various UNIX platforms and is quite useful. It would be great to have it in Ant as well.\n\nThank you.\n\nHenning Vahlenkamp", "id": 117924, "time": "2008-06-23T16:57:28Z", "creator": "vahlenkamp@att.com", "creation_time": "2008-06-23T16:57:28Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 45262, "text": "It seems like the least-intrusive way to do this would be to build it as a special resource collection, simply a preference-based fileset.  vfileset maybe?  It might look like:\n\n<vfileset includes=\"**/*.java\">\n  <basepath>\n    <file file=\"${local.srcdir}\" />\n    <file file=\"${shared.srcdir}\" />\n  </basepath>\n</vfileset>\n\nvfileset would also support a basepathref attribute, the excludes|defaultexcludes|casesensitive|followsymlinks attributes, and the include|exclude|includefile|excludefile nested elements.\n\nMy only concern is that this might be too specific a use-case to live in Ant core.  Opinions from other devs?", "id": 117972, "time": "2008-06-25T08:10:03Z", "creator": "mbenson@apache.org", "creation_time": "2008-06-25T08:10:03Z", "is_private": false, "attachment_id": null}]