[{"count": 0, "tags": [], "creator": "krzysieq@gazeta.pl", "attachment_id": null, "is_private": false, "id": 117933, "time": "2008-06-24T05:47:36Z", "bug_id": 45267, "creation_time": "2008-06-24T05:47:36Z", "text": "Not sure this is the right place to report such issue, as it is not really a bug, although in my project we tend to think of it this way...\n\nIt would be really nice, if it was possible to load a bunch of properties from a file after the application is started. It is a real pain in the neck to switch the app on and off just because we need to test another machine or environment. \n\nThe way I would see this handled would be to add to the \"User Defined Variables\" configuration element a possibility to feed it from a file, as well as delete and sort the variables listed there. \n\nThe other possible solution is to be able to switch, also during runtime, the file that is loaded as user.properties. But I imagine this would be more difficult."}, {"count": 1, "attachment_id": null, "creator": "sebb@apache.org", "text": "Changing to enhancement.\n\nThe property dispay:\n\nhttp://jakarta.apache.org/jmeter/usermanual/component_reference.html#Property_Display\n\ncan be used to change/add/delete properties.\n\nWould this be sufficient?", "id": 117934, "time": "2008-06-24T05:54:34Z", "bug_id": 45267, "creation_time": "2008-06-24T05:54:34Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "krzysieq@gazeta.pl", "attachment_id": null, "is_private": false, "id": 117935, "time": "2008-06-24T06:16:31Z", "bug_id": 45267, "creation_time": "2008-06-24T06:16:31Z", "text": "I see what You mean now, but I don't think this solves our problem. I can change the system or jmeter properties, but I cannot reload the additional property file - even changing the value of the user.properties property doesn't trigger the reload. If it would, this would be the best possible solution I think of. \n\nA little bit bigger picture:\n\nWhat we have in our project is a property file per environment. Each of these has exactly the same keys, they only differ by the values. So we use the property names in all tests, and our automated testing campaigns supply the tests with different property files. This is easy and efficient when done commandline, but on the GUI we loose this, and what we're left with is an amazing pain in the neck of having to restart the GUI with another property file each time. Does this shed some light on the problem?"}, {"count": 3, "tags": [], "bug_id": 45267, "text": "You can provide the initial property file on the GUI command line using the -q flag.\n\nWhat you cannot do is reload an entire property file after starting the GUI.\n\nHowever, nor can one run more than 1 test file using JMeter in non-GUI mode, so in that sense, the GUI is no different.\n\nAs a temporary work-round, you could use a beanshell function as the value of a dummy variable on the Test plan. This will be executed at the start of the test.\n\nSomething like:\n\nDUMMY     ${__BeanShell(loadProperties(\"file.props\"))}\n\nwhere the method loadProperties is defined in a beanshell function init file.\n\nThe example .bshrc file already shows how to set JMeter properties so you would just need to load the new ones.", "id": 117937, "time": "2008-06-24T06:42:06Z", "creator": "sebb@apache.org", "creation_time": "2008-06-24T06:42:06Z", "is_private": false, "attachment_id": null}]