[{"count": 0, "tags": [], "bug_id": 45274, "text": "I'm working on a billing project where I create a CDR record for each successful transaction the user do.\n\nThis CDR record is used to deduct from the user credit.\n\nI'm using log4j to do this logging, but when I was trying a demo to ensure the success of using log4j, I faced this problem:\n\nI'm using two different machines to log in the same file at the same time trying to simulate the billing process. and each machine should log 1000 record, so finally I should have in the logging file 2000 records, but I didn't find the 2000 records instead I found 1980 record.\n\nThis is a disaster to me... I'm working on a very critical part of the project which is the billing part if anything is missed up I will be out for sure.\n\nSo please can anyone help me with that?\n\nI tried to sync the writing function of my application but even if I did a static sync, I'm working in two different machines two different JVMs.", "id": 117969, "time": "2008-06-25T05:23:31Z", "creator": "vooodooo50@hotmail.com", "creation_time": "2008-06-25T05:23:31Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Logging to the same file from two VMs at the same time is simply not supported.  This is not a Log4j issue, but a JVM issue.  You need to log to separate files from two different VMs.  There is no way around this.  If this is not a satisfying answer, please file a bug with Sun.  Marking Invalid.  ", "is_private": false, "bug_id": 45274, "id": 118050, "time": "2008-06-26T20:26:35Z", "creator": "hoju@visi.com", "creation_time": "2008-06-26T20:26:35Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "writing to a file from two JVMs is indeed supported by Java. The problem is that in order to do so the file must be locked while the writes are taking place. Java does support file locking, which is what would be required. However, this was introduced in Java 1.4 with the java.nio package. Since the released versions of log4j must run in Java 1.3 there really isn't a good way to add this support until log4j 2.0 is available. I would also note that locking the file while writing can cause serious performance bottlenecks.\n\nThis issue will be added to Jira for consideration in log4j 2.0.", "is_private": false, "bug_id": 45274, "id": 118051, "time": "2008-06-26T21:26:22Z", "creator": "Ralph.Goers@dslextreme.com", "creation_time": "2008-06-26T21:26:22Z", "attachment_id": null}]