[{"attachment_id": null, "tags": [], "creator": "vooodooo50@hotmail.com", "text": "Dear All,\n\nI'm using log4j to log the events that accure in a certain application under Oracle Application Server. this application includes sub-application but all are sharing the same log4j properties file. for some reasone the logging in all sub-applications stops and i don't know why.\nFYI each sub-application loggs in a diffrient file, and there are some sub-applications connects to other platform throw http.\n\nMy assumtion is: if one of the sub-applications that connects to other platform throw http faces a problem connecting to this platform; this connectivity problem causes the log4j classes to stop working or something like that.\n\nand to make the logging work again i have to restart the OC4J in which this application is deployed in the OAS.", "count": 0, "id": 118098, "time": "2008-06-29T04:04:12Z", "bug_id": 45305, "creation_time": "2008-06-29T04:04:12Z", "is_private": false}, {"count": 1, "tags": [], "creator": "hoju@visi.com", "text": "This is a question you should be sending to the list.  Unless there's truly some suspicion that Log4j is doing something wrong here, you should not be reporting a bug in Log4j.  There could be all kinds of reasons, the most likely one being that a library in one of the apps is improperly reconfiguring Log4j, causing the unexpected behavior.\n\nBTW, I can't make heads nor tails of this statement...\n\n\"My assumtion is: if one of the sub-applications that connects to other platform\nthrow http faces a problem connecting to this platform; this connectivity\nproblem causes the log4j classes to stop working or something like that.\"\n\n\nI'll leave this report open for now and wait for further explanation, but please send this kind of stuff to the log4j-user list next time.\n\n\nJake", "id": 118104, "time": "2008-06-29T07:40:00Z", "bug_id": 45305, "creation_time": "2008-06-29T07:40:00Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "thorbjoern@gmail.com", "text": "If the application hangs, please request a thread dump from your JVM.", "count": 2, "id": 119303, "time": "2008-08-02T15:35:56Z", "bug_id": 45305, "creation_time": "2008-08-02T15:35:56Z", "is_private": false}]