[{"count": 0, "tags": [], "bug_id": 45313, "attachment_id": null, "id": 118114, "time": "2008-06-30T07:46:04Z", "creator": "andreas.schubert@mathema.de", "creation_time": "2008-06-30T07:46:04Z", "is_private": false, "text": "I tried a static compile of mod_jk 1.2.26 and apache 2.2.9 on solaris 8,9 and 10 (sparc) and solaris 10 (intel).\n\nCompilation worked perfect, mod_jk worked in all cases when tomcat (or other servlet container) was on the same host. It did not work, when tomcat was on an other host on the same network on all sparc versions of solaris, but it worked for the intel version.\n\nSome investigation showed, that nb_connect() in jk_connect.c fails when statically compiled into apache. Modular compilation works fine.\n\nCompiler was gcc version 3.2.4, tried with sun \"ld\" and gnu \"ld\", no difference."}, {"count": 1, "tags": [], "bug_id": 45313, "text": "Could you please provide the exact configure options for httpd and mod_jk you were using for the static build on Solaris 10 Sparc? This will help us minimalize efforts to reproduce.\n\nCould there be any relation to IPV6 in your environment?\n", "id": 118594, "time": "2008-07-12T05:30:41Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2008-07-12T05:30:41Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45313, "attachment_id": null, "text": "Hi,\n\nconfigure option where as follows:\n\nfor mod_jk: --with-apache=<dir of apache source>\nfor apache: --with-mpm=worker --disable-so --disable-authn-file --disable-authn-default  --disable-authz-groupfile --disable-authz-user --disable-authz-default --disable-auth-basic --disable-include --disable-filter --disable-charset-lite  --disable-autoindex --disable-asis --disable-cgid --disable-cgi --disable-negotiation --disable-dir --disable-actions --disable-userdir  --enable-vhost-alias --enable-rewrite --with-mod_jk\n\nI also tried different apache configure options (enabled all modules, even those, I don't intend to use) but that didn't work. What seems to work is using the Sun Studio C compiler.", "id": 118614, "time": "2008-07-14T01:25:44Z", "creator": "andreas.schubert@mathema.de", "creation_time": "2008-07-14T01:25:44Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 45313, "attachment_id": null, "id": 202622, "time": "2017-12-07T12:49:30Z", "creator": "markt@apache.org", "creation_time": "2017-12-07T12:49:30Z", "is_private": false, "text": "Looks to be a compiler issue on Solaris."}]