[{"count": 0, "tags": [], "bug_id": 45342, "text": "Created attachment 22215\nchanged AFPFontReader.java\n\nI've tried to use AFP renderer along with AFP fonts with relative metrics, which results in wrong alignment of text. For both Outline fonts (scalable) and Raster fonts.\n\nAfter some debugging I've updated the org.apache.fop.render.afp.fonts.AFPFontReader.java file to process these fonts correctly, I attach the updated Java file below. (the main problem is, that AFP fonts have two measurement unit setting, which should be both considered for fonts with relative metric - metric resolution and shape resolution; and the factor to be applied to measurement values depends on the pointsize in some cases)\n\nIn the source file there is also repaired one other problem - there was bug, that the font reader did not process the last font orientation, it is repaired in the method processFontPosition().\n\nThe changes were made on the source file from FOP version 0.95.beta.", "id": 118292, "time": "2008-07-04T05:20:46Z", "creator": "styryx@seznam.cz", "creation_time": "2008-07-04T05:20:46Z", "is_private": false, "attachment_id": 22215}, {"count": 1, "tags": [], "creator": "styryx@seznam.cz", "attachment_id": 22958, "text": "Created attachment 22958\nPatch against current trunk\n\nI've created patch against current trunk. I tested it to work correctly with fonts with absolute and relative metrics, outline and raster AFP fonts.", "id": 122905, "time": "2008-11-28T03:15:43Z", "bug_id": 45342, "creation_time": "2008-11-28T03:15:43Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "jeremias@apache.org", "is_private": false, "count": 2, "id": 124734, "time": "2009-02-09T07:37:03Z", "bug_id": 45342, "creation_time": "2009-02-09T07:37:03Z", "text": "Emil, thanks a lot for your patch. Apologies for not processing it earlier. I've only noticed it recently. I've applied it with modifications:\nhttp://svn.apache.org/viewvc?rev=742564&view=rev\n\nThe values your patch produced were too big by factors of more than 1000. I've had to change some of that code. I've tested now with various fonts (with fixed and relative metrics) and I'm happy with the results. Please verify also on your side. Maybe you have different fonts that behave differently. If that is so, we may have to take a closer look. Let me know if there are any remaining problems."}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "is_private": false, "text": "batch transition pre-FOP1.0 resolved+fixed bugs to closed+fixed", "id": 155740, "time": "2012-04-01T06:38:13Z", "bug_id": 45342, "creation_time": "2012-04-01T06:38:13Z", "attachment_id": null}]