[{"attachment_id": null, "tags": [], "creator": "francois.laupretre@ratp.fr", "text": "Happens on AIX but could happen anywhere an environment variable (CPPFLAGS, LDFLAGS,...) contains a ':' character.\n\nThe case : On AIX, the LDFLAGS variable I use contains '-Wl,-blibpath:/build/common'. Apache compiles OK and sets the value correctly in config_vars.mk. But, when getting the value back from apxs ('apxs -q LDFLAGS'), it returns '-Wl,-blibpath /build/common', replacing the first ':' with a space.\n\nSo, when trying to link with this string (as when linking mod_jk), the linker crashes with a message 'ld: 0706-015 The -b libpath option needs a parameter', which is correct as the linker uses ':' as a separator, and does not understand the space.\n\nTracing the problem into apxs, it comes from a substitution at the end of sub get_vars, which says :\n\n$result =~ s|:| |;\n\nCommenting this line out, everything works fine for me. The problem is that, if the code contains this substitution, there must be a reason...", "count": 0, "id": 118293, "time": "2008-07-04T05:38:49Z", "bug_id": 45343, "creation_time": "2008-07-04T05:38:49Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 45343, "text": "This bug is fully cross-platform, and persists in 2.2.15.  It also causes builds that use apxs (including mod_jk) to fail on FreeBSD whenever the LDFLAGS include a multi-element rpath argument, because those elements are colon-delimited. \n\nAs originally reported, the cause of this breakage is one undocumented line in apxs substituting space for colon with no obvious justification. The value being mangled is ultimately read from config_vars.mk, which is entirely  variable assignments in 'make' syntax. I see nowhere in apxs that a colon would be added to the string parsed out of that file, and such a substitution does not make any sense from the perspective of make's assignment syntax. \n\nThe bug can be fixed with this patch:\n\n --- support/apxs.in.orig\t2006-07-11 20:38:44.000000000 -0700\n+++ support/apxs.in.fixed\t2010-05-07 11:39:18.768583424 -0700\n@@ -253,7 +253,6 @@\n         }\n     }\n     $result =~ s|;;$||;\n-    $result =~ s|:| |;\n     return $result;\n }", "id": 136735, "time": "2010-05-07T15:11:17Z", "creator": "billcole@apache.org", "creation_time": "2010-05-07T15:11:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "trawick@apache.org", "attachment_id": null, "is_private": false, "id": 136866, "time": "2010-05-14T14:45:26Z", "bug_id": 45343, "creation_time": "2010-05-14T14:45:26Z", "text": "fixed in trunk r944383"}]