[{"count": 0, "tags": [], "bug_id": 4536, "attachment_id": null, "id": 7357, "time": "2001-10-31T01:05:25Z", "creator": "v_ignatius@yahoo.com", "creation_time": "2001-10-31T01:05:25Z", "is_private": false, "text": "Hi,\n  Am using tomcat 3.2.2 and am running in to problems when i bootstrap a sevlet \nwhich creates couple of thread in the same VM as tomcat.\n  The exact problem is this.I have a servlet which creates a couple of threads \nwhich will be alive until the VM exits.The thread creation is done in the init \nmethod if the servlet.I've bootstrapped the servlet and am starting the \nserver.The init method is called and the threads are being created and the \nserver is started at the default port.Now when i start the server again without \nshutting down the server it calls the init method of the servlet creates the \nthread in a new VM and eventually when it tries to bind the server to the \ndefault port it throws a BindException(Obviously b'cos the server is already \nrunning in the default port)but does not the kill the VM ie it does not call \nthe System.exit and hence the a new java process is created and this can only \nbe killed using kill command.If i attempt to start the server without shutting \nthe server n times ,n times it throws bind exception and it created n java \nprocesses.I even decomplied the tomcat source and found that when a bind \nexception occurs System.exit is not called.Tomcat first loads the bootstrapped \nservlets and then only binds the service.Is there any fix or workaround for \nthis.\n\nRegards,\nVijay"}, {"count": 1, "tags": [], "bug_id": 4536, "text": "If I understand correctly, your servlet starts a couple new threads in its init\n() method.  Then you attempt to shutdown Tomcat, but the VM doesn't terminate.  \nYou then get a socket bind error when you try to start Tomcat again.\n\nThe problem is most likely that your threads are not flagged as deamon \nthreads.  The Java VM will remain alive as long as there is at least one non-\ndaemon thread so the Tomcat VM will never terminate unless you either \nexplicitly terminate these threads or set setDeamon(true) when you create them.", "id": 7369, "time": "2001-10-31T08:34:25Z", "creator": "marc.saegesser@apropos.com", "creation_time": "2001-10-31T08:34:25Z", "is_private": false, "attachment_id": null}]