[{"count": 0, "tags": [], "bug_id": 45397, "attachment_id": null, "is_private": false, "id": 118668, "time": "2008-07-15T02:16:27Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-07-15T02:16:27Z", "text": "Although version 2.0 is already displayed in version list, no target milestones are available to point issues/improvements at.\n\nAs of (SVN) revision 676833, current target seems to be 1.8 (\"batik-1.8pre\" is internally used) so I believe that (at least) target milestone 1.8 should be created. This would allow attaching patches for things which can be committed when this milestone is made available (for example, I can think of the Java 1.3 support removed somewhere after 1.7 was released and to which documentation changes can start being harvested).\n\nAlso, should a \"bugzilla\" or \"bug tracker\" component be created for this sort of issues? I've attached this one to \"Web Site\" which, being somehow related, is a bit off-topic..."}, {"count": 1, "tags": [], "bug_id": 45397, "text": "(In reply to comment #0)\n[...]\n> (for example, I can think of the Java 1.3\n> support removed somewhere after 1.7 was released and to which documentation\n> changes can start being harvested).\n\nApparently this was already made effective (revision 701292, revision 713578). Nevertheless, this still makes sense in the scope of, for example:\n * Schedule future Java version drops (Java 1.4, Java 1.5, etc.)\n * Target major features which may need lots of work but are interesting to have before a conceptual release 2.0 (for example, an interesting feature which will not make it before releasing 1.8 but that would be interesting to have in 1.9).\n\nAs no comment was made on this issue, I ask if this is hard to accomplish and/or not relevant. If so, I might try to create bugs such as \"Drop Java 1.4 support\", \"Drop Java 1.5 support\" (to use as blockers) whenever possible and defer the version scheduling for the future...", "id": 123395, "time": "2008-12-18T03:30:25Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-12-18T03:30:25Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45397, "text": "Hi Helder.\n\nI think making a bug for dropping 1.4 support, and adding it as a dependency for other bugs that have patches for actual removal of 1.4 support is a good idea.\n\nI've just asked infrastructure to give me access to edit the components and versions in the Batik product here.  My feeling is that we could have a 1.8 release before 2.0.\n", "id": 123464, "time": "2008-12-21T13:34:59Z", "creator": "cam@apache.org", "creation_time": "2008-12-21T13:34:59Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 45397, "text": "(In reply to comment #2)\n> I think making a bug for dropping 1.4 support, and adding it as a dependency\n> for other bugs that have patches for actual removal of 1.4 support is a good\n> idea.\n> \n> I've just asked infrastructure to give me access to edit the components and\n> versions in the Batik product here.  My feeling is that we could have a 1.8\n> release before 2.0.\n\nI've changed the 2.0 version to 1.8, and added an additional component for animation support.  I'm not adding any milestones for now, and suggest doing the above if Java version support drop tracking is needed.\n\nThanks,\n\nCameron", "id": 123472, "time": "2008-12-22T01:51:01Z", "creator": "cam@apache.org", "creation_time": "2008-12-22T01:51:01Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 45397, "text": "(In reply to comment #2)\n> I think making a bug for dropping 1.4 support, and adding it as a dependency\n> for other bugs that have patches for actual removal of 1.4 support is a good\n> idea.\n\nThanks for your feedback, Cameron. :-) I've just created bug 46434 [1].\n\n\n> My feeling is that we could have a 1.8 release before 2.0.\n\nAgreed. There is a (small) number of quite interesting bug fixes and/or features since 1.7 which surely should make it to the masses before such a conceptual release (\"2.0\"). ;-)\n\n\n(In reply to comment #3)\n> I've changed the 2.0 version to 1.8, and added an additional component for\n> animation support.  I'm not adding any milestones for now, and suggest doing\n> the above if Java version support drop tracking is needed.\n\nGreat - the newly created issue makes use of this new version, although I've suggested [1] milestones to allow scheduling of bugs to specific targets versions.\n\n\n[1] https://issues.apache.org/bugzilla/show_bug.cgi?id=46434", "id": 123480, "time": "2008-12-22T07:38:48Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-12-22T07:38:48Z", "is_private": false, "attachment_id": null}]