[{"count": 0, "tags": [], "bug_id": 45439, "attachment_id": null, "text": "When a <Copy> is performed with the use of <FilterChain>/<FilterReader>, a separate instance of the filter reader is created, under its own classloader, for every file copied. Every one of these classloaders is registered with the Project as a BuildListener, and not unregistered until the copy completes. This leads to potentially huge memory growth during the copy.\n\nI've addressed the situation in my own environment in my FilterReader, with the following hack:\n\npublic int read() {\n   ... perform filtering ...\n\n   if (eof_detected) {\n      getProject().removeBuildListener((AntClassLoader)getClass().getClassLoader());\n   }\n}\n\nIt's a risky hack, but doesn't seem to have broken anything.\n\nMy project uses Ant 1.6.1, but I have verified the memory growth with 1.7.1.", "id": 118842, "time": "2008-07-20T05:27:09Z", "creator": "nmeyers@javalinux.net", "creation_time": "2008-07-20T05:27:09Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 45439, "attachment_id": null, "text": "I think svn revision 810080 fixes the memory leak in a clean way - except when something prior to returning the reader in ChainReaderHelper throws an exception, that is.\n\nIf you <typedef> or <componentdef> your filterreader and don't use the <filterreader classname=\"...\"> syntax only a single instance will be used to copy all files, which should avoid the problem in 1.7.x altogether.\n\nRegarding your hack: it would be safer to perform your action in an overridden close method (which basically is what my patch does at the chain level).", "id": 130102, "time": "2009-09-01T07:56:29Z", "creator": "bodewig@apache.org", "creation_time": "2009-09-01T07:56:29Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 45439, "text": "svn revision 810790 should have plugged the \"except when\nsomething prior to returning the reader in ChainReaderHelper throws an\nexception\" hole.", "id": 130125, "time": "2009-09-03T01:48:17Z", "creator": "bodewig@apache.org", "creation_time": "2009-09-03T01:48:17Z", "is_private": false, "attachment_id": null}]