[{"count": 0, "attachment_id": 22313, "bug_id": 45474, "is_private": false, "id": 118967, "time": "2008-07-24T03:34:46Z", "creator": "rob.rstuff@googlemail.com", "creation_time": "2008-07-24T03:34:46Z", "tags": [], "text": "Created attachment 22313\nhttpd and tomcat config files.\n\nWhen using Apache httpd as a reverse proxy for two Tomcats that use FORM authentication the first authentication (and only the first) after restart of the servers always fails with an 'Invalid direct reference to form login page' error.\n\nI can reliably repeat the error and it occurs on Firefox, IE and even using WGET. However the weird bit is that doing the exact same steps again never causes the error again unless the servers are shut down and restarted.\n\nI had one moment of wonder when the problem didn't occur on a completely fresh install, but the problem reoccurred again after I stopped and started the servers to confirm.\n\nThe steps to reproduce are simple...\n\nStop all servers.\nRestart Tomcat 1.\nRestart Tomcat 2.\nRestart Apache.\nMake request to a resource that requires authentication - in my case to 'http://127.0.0.1/FakeServer/'.\nServer responds with authentication request. (FORM based)\nClient Authenticates.\nServer responds with error 'Invalid direct reference...'\n\nAt any other time the last step is 'Server responds with resource initially requested'. Also if you bypass the httpd side of things (go directly to the Tomcat ports) you do not get the error even after a complete restart.\n\nI do use simpleTcpCluster for session replication across the Tomcats and for your info I've attached a version of the various configuration files. The Tomcat configuration files are identical bar the required port number changes.\n\nAnd yes I have commented out the JSP stuff - I don't use it. Maybe that's wrong?!\n\nAll the servers are running on a single machine and this is to be its 'production' set up, but it should also be able to cope with running on different machines.\n\nApache httpd version = 2.2.8\ntcnative-1.dll version = 1.1.12-win32\nApache tomcat version = 6.0.16\n\nAny help much appreciated.\n\n-- \nRob Stewart (rob.rstuff@googlemail.com)"}, {"count": 1, "tags": [], "text": "This sounds like a configuration problem. Bugzilla is no user support forum, but a bug tracking tool. Please use either the httpd or tomcat users mailing list.", "is_private": false, "bug_id": 45474, "id": 118973, "time": "2008-07-24T06:50:27Z", "creator": "rpluem@apache.org", "creation_time": "2008-07-24T06:50:27Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45474, "attachment_id": null, "is_private": false, "id": 118975, "time": "2008-07-24T07:12:19Z", "creator": "rob.rstuff@googlemail.com", "creation_time": "2008-07-24T07:12:19Z", "text": "'Sounds like' - hmmm.\n\nI've logged the details in the user forum already and I'm more than willing to take any suggestions on board for how I fix this, but I've tweaked configurations and I've checked many documents and followed several. I've spent the better part of a week trying to fix this issue with no luck.\n\nThe question thus becomes how could a configuration issue fail only once after the server starts up and never again? What part of configuration would do that?\n\nTo me it 'sounds like' the HTTPD server is passing on the initial request to the Tomcat servers incorrectly. I believe I've ruled out the issue being caused by any browser, client and the Tomcat servers themselves, that leaves the HTTPD server. (perhaps it's the proxy/proxy balancing module?)\n\nThere's only six modifications made in the attached httpd.conf file - and only ONE relates to a reverse proxy...\n\n<Proxy balancer://mycluster>\n  BalancerMember ajp://127.0.0.1:18009\n  BalancerMember ajp://127.0.0.1:28009\n</Proxy>\nProxyPass /FakeServer   balancer://mycluster/FakeServer   lbmethod=bytraffic stickysession=JSESSIONID|jsessionid\nProxyPass /FakeNAServer balancer://mycluster/FakeNAServer lbmethod=bytraffic stickysession=JSESSIONID|jsessionid\n\n6 lines - You can even take out the last line as that one doesn't have authentication, NA = No Authentication.\n\nI understand this isn't support, but I can't see where I've gone wrong, so I've logged a bug. As I've said above, if it is a configuration problem why does it only fail with the first request?"}, {"text": "It only took two weeks - indeed this is a configuration issue.\n\nThe issue was resolved by adding 'jvmRoute' parameters to the Tomcat nodes in the cluster and 'route' parameters to the BalanceMember elements in the Proxy section of the Apache server.\n\nWhich is fair enough, however, the documentation...\n\nhttp://tomcat.apache.org/tomcat-6.0-doc/cluster-howto.html\n\nStates quite clearly...\n\n\"If you are using mod_jk, make sure that jvmRoute attribute is set at your Engine <Engine name=\"Catalina\" jvmRoute=\"node01\" >  and that the jvmRoute attribute value matches your worker name in workers.properties\"\n\nBut I'm using NOT using mod_jk or workers.properties!!\n\nI'm moving this bug to 'invalid' but thought future bug hunters would like to know the issue and solution.", "tags": [], "bug_id": 45474, "attachment_id": null, "count": 3, "id": 119172, "time": "2008-07-31T03:51:57Z", "creator": "rob.rstuff@googlemail.com", "creation_time": "2008-07-31T03:51:57Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 45474, "is_private": false, "text": "Oops - Mis-spoke, problem STILL happening.\n\nAbove does *NOT* fix the issue.\n\nI'm leaving the statis INVALID anyhow.", "id": 119175, "time": "2008-07-31T04:29:53Z", "creator": "rob.rstuff@googlemail.com", "creation_time": "2008-07-31T04:29:53Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 45474, "text": "Double Oops - Turned out I had fixed the problem (config issue).\n\n  When specifying jvmRoute in the Tomcat server.xml it looks like this...\n\njvmRoute=\"tc1\"\n\n  and in the httpd.conf it needs to look like this...\n\nroute=tc1\n\n  Doing a copy/paste of the value from the server.xml to the httpd.conf was a major mistake as this...\n\nroute=\"tc1\"\n\n  is taken literally, including the quotes which makes it different from the server.xml value!\n\nARGH!\n\n  PLEASE update the documentation to notify that this is required even when using just an AJP reverse proxy/simpleTCPCluster and not just mod_jk.", "id": 119222, "time": "2008-08-01T02:39:32Z", "creator": "rob.rstuff@googlemail.com", "creation_time": "2008-08-01T02:39:32Z", "is_private": false, "attachment_id": null}]