[{"count": 0, "tags": [], "bug_id": 45482, "attachment_id": null, "is_private": false, "id": 119012, "time": "2008-07-25T03:07:28Z", "creator": "thorbjoern@gmail.com", "creation_time": "2008-07-25T03:07:28Z", "text": "There are several places where there are unused variables flagged by the eclipse compiler.\n\nThe attached patch removes these with their assignments (except where I was unable to determine if there was subtle side effects)."}, {"count": 1, "tags": [], "creator": "carnold@apache.org", "attachment_id": null, "id": 119091, "time": "2008-07-28T23:44:03Z", "bug_id": 45482, "creation_time": "2008-07-28T23:44:03Z", "is_private": false, "text": "The patch touches a lot of files that did not have extra imports.  Quite a few files only differed in whitespace or import order.  Would prefer that only files with extra imports were touched by patches for this bug.  Unclear which files actually did have extra imports."}, {"count": 2, "tags": [], "creator": "thorbjoern@gmail.com", "attachment_id": null, "id": 119096, "time": "2008-07-29T06:01:23Z", "bug_id": 45482, "creation_time": "2008-07-29T06:01:23Z", "is_private": false, "text": "(In reply to comment #1)\n> The patch touches a lot of files that did not have extra imports.  Quite a few\n> files only differed in whitespace or import order.  Would prefer that only\n> files with extra imports were touched by patches for this bug.  Unclear which\n> files actually did have extra imports.\n\nThis bug is about unused variables, not imports.\n\n"}, {"count": 3, "tags": [], "creator": "carnold@apache.org", "attachment_id": null, "id": 119097, "time": "2008-07-29T06:30:14Z", "bug_id": 45482, "creation_time": "2008-07-29T06:30:14Z", "is_private": false, "text": "Are the variable method scope or private?  If the unused variables are protected, package or public they can't be removed with potentially breaking compatibilty. "}, {"attachment_id": null, "tags": [], "bug_id": 45482, "text": "(In reply to comment #3)\n> Are the variable method scope or private?  If the unused variables are\n> protected, package or public they can't be removed with potentially breaking\n> compatibilty. \n\nI have only looked at those that Eclipse 3.4 gave a warning for as being unused, which usually is only private or locals.  If the value assigned to it, looked to have side effects I kept those.\n\n(I got the source in Eclipse by checking it out in Eclipse with the subclipse plugin, close the project, run \"mvn eclipse:eclipse\", and reopen the project).", "count": 4, "id": 119098, "time": "2008-07-29T06:45:25Z", "creator": "thorbjoern@gmail.com", "creation_time": "2008-07-29T06:45:25Z", "is_private": false}, {"count": 5, "tags": [], "text": "Comment #1 was intended for bug 45481.  I was traveling and confused the two similarly titled bugs. \n\nI'm marking this as NEEDINFO since there is no patch attached and the unused variables are not identified.  Even if a variable is unused, it can not be removed unless it is either a private member variable or within a method.", "is_private": false, "id": 119416, "creator": "carnold@apache.org", "time": "2008-08-05T10:57:03Z", "bug_id": 45482, "creation_time": "2008-08-05T10:57:03Z", "attachment_id": null}]