[{"count": 0, "tags": [], "creator": "thorbjoern@gmail.com", "text": "Log4j 1.2.16 is a maintenance release corresponding with the official release of version 1.0 of Chainsaw.\n\nChainsaw is an application implementing SocketReceiver so log4j can use the SocketAppender appender to forward logging events to Chainsaw for visualization and analysis.\n\nIt is intended that all issues which must be fixed before this release, should block this issue in order to keep an up-to-date overview.", "id": 119273, "attachment_id": null, "bug_id": 45527, "creation_time": "2008-08-02T13:39:52Z", "time": "2008-08-02T13:39:52Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 45527, "attachment_id": null, "text": "There was already a bug (43313) for the 1.2.16 release.  Typically a bug is created for the next release just after the preceding release is cut.  Since there are already SVN commits against that bug, I'm expecting that this bug will either be closed as a duplicate or marked as invalid.\n\nThe list of \"blocking\" bugs for this bug is not appropriate.  It doesn't seem all that different from a list of all open bugs.  The list of blocking bugs should be just those that the community deems as essential to be resolved before that particular release.\n\nFor example, bug 25747 is an enhancement request to improve the diagnostic message that is output when no configuration file could be found and the app does not perform an explicit configuration.  The bug was initially filed almost 5 years ago, so for every release since then the community did not feel that that particular issue was so critical that no release could be made until it was fixed.  \n\nFor it to go on the blocking list now, there either needs to be some rationale or an available fix or something to explain why it must be addressed before this particular release.\n\nI'd hate to mark it WONTFIX.  I don't see it as a priority and likely won't come up to the top of my list, but I don't want to stop anybody else from coming up with a reasonable solution and would be willing to review it.  However, I don't want somebody else saying that it must go on my TO-DO list unless there is some critical need.\n\nIf there are true blocking issues (or issues that may be blocking issues), I'd suggest adding them to 43313.  However, limit yourself to one or two of the most critical open bugs until you get a feel for our process and we are able to provide feedback.\n\nI could not find a readily accessible definition for blocking issue, so here is mine:\n\nA blocking issue for a release is an issue that prevents a release from occurring until the issue is resolved.\n\n\n\n", "id": 119451, "time": "2008-08-05T16:36:33Z", "creator": "carnold@apache.org", "creation_time": "2008-08-05T16:36:33Z", "is_private": false}, {"count": 2, "tags": [], "creator": "thorbjoern@gmail.com", "attachment_id": null, "is_private": false, "id": 119470, "time": "2008-08-05T23:12:50Z", "bug_id": 45527, "creation_time": "2008-08-05T23:12:50Z", "text": "(In reply to comment #1)\n\n> If there are true blocking issues (or issues that may be blocking issues), I'd\n> suggest adding them to 43313.  However, limit yourself to one or two of the\n> most critical open bugs until you get a feel for our process and we are able to\n> provide feedback.\n> \n> I could not find a readily accessible definition for blocking issue, so here is\n> mine:\n> \n> A blocking issue for a release is an issue that prevents a release from\n> occurring until the issue is resolved.\n\nA few weeks ago there was 130 open issues on log4j most of which were NEW.  The blockers to this issue that I put in are those I think should go in 1.2.16 to warrant a new release, and left the rest outside.\n\nSo, this is in my eyes a simple way to determine if the goal has been reached or not."}, {"count": 3, "tags": [], "creator": "carnold@apache.org", "attachment_id": null, "id": 119733, "time": "2008-08-12T10:04:59Z", "bug_id": 45527, "creation_time": "2008-08-12T10:04:59Z", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of bug 43313 ***"}]