[{"count": 0, "tags": [], "creator": "kyle.gibson@frozenonline.com", "attachment_id": null, "text": "Per server configuration only one VirtualDocumentRoot setting is permitted or used as far as I could tell from the mod_vhost_alias.c code and the documentation provided.\n\nThis means theoretical configurations such as\n\nVirtualDocumentRoot /usr/local/apache/vhosts/%2.0.%3.0\nVirtualDocumentRoot /usr/local/apache/backwards/%3.0.%2.0\n\nmay not be possible, or at least difficult to setup correctly. What really seems to happen is that the second call to VDR will overwrite the first call.\n\nThe above configuration could probably be solved if VDR worked within Directory blocks, and VDR allowed relative paths.\n\n<Directory /usr/local/apache/vhosts/>\nVirtualDocumentRoot %2.0.%3.0\n</Directory>\n\n<Directory /usr/local/apache/backwards/>\nVirtualDocumentRoot %3.0.%2.0\n</Directory>\n\nHere's what I've patched into the apache source:\n\nAddVirtualDocumentRoot /home/www/%0/www\nAddVirtualDocumentRoot /home/www/%-2.0.%-1/%-3+/\n\nThe mappings are saved in a list, and each one is tested in the order it was given until a match is found.\n\nThis can easily be extrapolated to provide a fall-back solution in case none of the mappings match. Simply make the last VDR guaranteed to match.\n\nMy apache code is hackish at best. As a result I am not including the patch just yet. I wanted to post this now that I've got it working and to let those who may be interested know that it is on the way. I'll probably upload the patch tonight or tomorrow.\n\nAlso I want to ensure that it integrates well with the DOCUMENT_ROOT patch.\n\nAny questions, comments, suggestions please contact me. Send flames and insults to /dev/null.", "id": 119231, "time": "2008-08-01T10:50:26Z", "bug_id": 45524, "creation_time": "2008-08-01T10:50:26Z", "is_private": false}, {"count": 1, "tags": [], "creator": "kyle.gibson@frozenonline.com", "attachment_id": 22347, "id": 119276, "time": "2008-08-02T13:53:53Z", "bug_id": 45524, "creation_time": "2008-08-02T13:53:53Z", "is_private": false, "text": "Created attachment 22347\nAdd support for multiple virtual host aliases\n\nThis patch includes a patch submitted to issue 26052. I may submit another patch without that patch included if someone wants it."}]