[{"count": 0, "tags": [], "text": "Created attachment 22395\npatch\n\nfor a project i needed some missing functionality that i added:\n\n* Implemented 2 Functions Today and Now\n* Added some logic for rewriting formulas with AreaPtgs when shifting Rows\n* Added 2 functions in HSSFConditionalFormatingRule to make 2 properties visible to the world\n\nthe patch is made against current svn-trunk ...", "attachment_id": 22395, "bug_id": 45577, "id": 119481, "time": "2008-08-06T03:29:38Z", "creator": "frank.taffelt@interface-business.de", "creation_time": "2008-08-06T03:29:38Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "josh@apache.org", "is_private": false, "count": 1, "id": 119585, "time": "2008-08-08T01:08:24Z", "bug_id": 45577, "creation_time": "2008-08-08T01:08:24Z", "text": "Applied changes to Now, Today and HSSFConditionalFormatingRule in svn r683901\n\n\nCould you please re-do the patch for HSSFSheet (it has changed since r683166)? Can you also add a junit for this new functionality?"}, {"count": 2, "tags": [], "bug_id": 45577, "attachment_id": null, "is_private": false, "id": 139127, "time": "2010-08-16T18:37:27Z", "creator": "willpower1024@gmail.com", "creation_time": "2010-08-16T18:37:27Z", "text": "Is this under progress or fixed?  I ask because it's listed as being included in VERSION 3.2-FINAL.\n\nHowever, an issue I see with this feature is that it does not get the correct date.  The date returned is the date when the spreadsheet was last saved."}, {"count": 3, "tags": [], "text": "I think some parts of the patch are applied, the rest is very hard to apply as it contains lots of whitespace changes and does not apply cleanly any more. \n\nTherefore I am closing this FIXED for now, if the rest of the changes is still relevant then please re-patch it for the latest version of POI and report it in a new bug-entry so we can apply it cleanly.", "attachment_id": null, "bug_id": 45577, "id": 182799, "time": "2015-05-01T21:11:21Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-05-01T21:11:21Z", "is_private": false}]