[{"attachment_id": null, "tags": [], "bug_id": 45574, "text": "open uri,\ndisable images, is this possible in batik?\n\nimages should disappear, they dont\ndesc and perhaps title content should be displayed as text\n\napologies if this seems counterintuitive.\nhowever authors wont provide title or desc content unless there is a perceived use case.\n\nif batik is to be an svg accessibility tool this is a necessary first step...", "count": 0, "id": 119474, "time": "2008-08-06T01:18:06Z", "creator": "j.chetwynd@btinternet.com", "creation_time": "2008-08-06T01:18:06Z", "is_private": false}, {"count": 1, "tags": [], "creator": "helder.magalhaes@gmail.com", "attachment_id": null, "id": 122545, "time": "2008-11-17T03:15:18Z", "bug_id": 45574, "creation_time": "2008-11-17T03:15:18Z", "is_private": false, "text": "This sound interesting but quite off topic. \"SVG is a language for describing two-dimensional graphics\" [1], so requiring it to have a functionality to disable image rendering would be both counter intuitive and hard to understand: what is an \"image\" in SVG? a basic shape or a path? all that is not text? what if basic shapes/paths are used to draw text? many more questions like these can be posed...\n\nIn Batik's context, I'd personally label this as \"wontfix\" or \"invalid\" as this is a somehow transcendental question which seems to largely surpass the scope of Batik, but this is not enough clear to me to mark this myself - I'd prefer that either the reported or a project leader would recognize this and close this issue and/or post more information supporting this within Batik's context.\n\nThis may also slightly relate to bug 45486 [2], although in that scope what is being recommended is to show alternate content when a given resource is not available (but the specification points towards the use of a checkerboard in those cases).\n\n[1] http://www.w3.org/TR/SVG/intro.html#AboutSVG\n[2] https://issues.apache.org/bugzilla/show_bug.cgi?id=45486"}, {"count": 2, "tags": [], "bug_id": 45574, "attachment_id": null, "text": "#1 Helder, fixing this bug is part of the specification.\n\nNB: parity Opera, already provides this facility\n\nwhilst it may be true that \"SVG is a language for describing\ntwo-dimensional graphics\" that is only a small part of the story, and one that is taken out of context. SVG is text, may have text embedded, and certainly should have text metadata such as title content.\n\nBlind users may not wish to have images renedered, unless to aid someone with them...\n\nplease read:\n\nhttp://www.w3.org/TR/SVG/struct.html#DescriptionAndTitleElements\n\neg:\n\n\"User agents may, however, for example, display the 'title' element as a tooltip, as the pointing device moves over particular elements. Alternate presentations are possible, both visual and aural, which display the 'desc' and 'title' elements but do not display 'path' elements or other graphics elements.\"\n\n\"Authors should always provide a 'title' child element to the outermost 'svg' element within a stand-alone SVG document. The 'title' child element to an 'svg' element serves the purposes of identifying the content of the given SVG document fragment. Since users often consult documents out of context, authors should provide context-rich titles.\"\n\nGoogle currently does not provide search by graphic, so relies on the text. and one easy historical way for the author to check on their alt content is to use lynx browser, or switch off images in other browsers. this applies equally to SVG files. \n\nthis is my opinion, and of course I welcome further input, leaving as needinfo", "id": 122546, "time": "2008-11-17T03:44:58Z", "creator": "j.chetwynd@btinternet.com", "creation_time": "2008-11-17T03:44:58Z", "is_private": false}, {"count": 3, "tags": [], "text": "it may be of interest that when using minefield/mozilla to view html pages, with images switched off, gifs and jpgs are not displayed, but svgs are, which is at best confusing.\nI recognise that batik does not display html pages currently, however users expect consistency, and it is possible to embed many types of other content in svg, such as html, audio, video, etc....", "attachment_id": null, "id": 122547, "creator": "j.chetwynd@btinternet.com", "time": "2008-11-17T03:54:10Z", "bug_id": 45574, "creation_time": "2008-11-17T03:54:10Z", "is_private": false}, {"count": 4, "tags": [], "text": "(In reply to comment #2)\n> #1 Helder, fixing this bug is part of the specification.\n\n   Where does the SVG specification say that user agents\nmust allow images to be turned off and replaced with any\navailable title/desc element?\n\n   I should say that it's not at all clear to me how you\nwould 'replace the image' with title and desc.  In a\ntool tip you are free to overflow, but I wouldn't think\nthat would be a good option for an image.\n\n> please read:\n> http://www.w3.org/TR/SVG/struct.html#DescriptionAndTitleElements\n> eg:\n> \"User agents may, however, for example, display the 'title' element as a\n> tooltip, as the pointing device moves over particular elements.\n\n   Batik already does this of course.\n\n> Alternate presentations are possible, both visual and aural, which \n> display the 'desc' and title' elements but do not display 'path' \n> elements or other graphics elements.\"\n\n   Also I should mention that these lines use the words 'may' and \n'possible' rather than 'must' or 'required'.\n\n> \"Authors should always provide a 'title' child element to the outermost 'svg'\n> element within a stand-alone SVG document. The 'title' child element to an\n> 'svg' element serves the purposes of identifying the content of the given SVG\n> document fragment. Since users often consult documents out of context, authors\n> should provide context-rich titles.\"\n\n   Sure I agree that authors should provide title and desc elements.\nBatik will display them (in fact quite a bit of work has gone into\ndisplaying them in the face of dynamic modifications etc).\n\n> Google currently does not provide search by graphic, so relies on the text. \n> and one easy historical way for the author to check on their alt content \n> is to use lynx browser, or switch off images in other browsers. this \n> applies equally to SVG files. \n\n> this is my opinion, and of course I welcome further input, leaving as \n> needinfo\n\n   If there is really a spec requirment please provide it.\n", "attachment_id": null, "id": 122554, "creator": "deweese@apache.org", "time": "2008-11-17T05:01:41Z", "bug_id": 45574, "creation_time": "2008-11-17T05:01:41Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 45574, "is_private": false, "text": "#4\n\nThomas,\n\nit is the resaponsibility of developers to be aware and implelement the user agent guidelines, not bug filers to point to those W3C specification files.\n\n I have already stopped responding to, or filing mozilla bugs because of the unacceptable - to me - tone of responses.\n\nI have also dramatically reduced my contributions to Opera, and Safari development, because of lack of progress.\n\nthe fact you do not know where to find the evidence, puts you in a weak not a strong position, however in this instance, you prefaced your request with a 'please'.\n\nhttp://www.w3.org/TR/SVGMobile12/access.html#SVGUAAccessibilityGuidelines\n\n\"Provide a text-only view\nSVG user Agents should provide mechanisms that allow assistive technologies to achieve a useful text-only view. Examples include a DOM explorer, a synchronized text only view, or an XSLT style sheet to convert the textual content to XHTML.\"\n\nfor SVG1.1 the UA guidelines were less developed:\n\nhttp://www.w3.org/TR/SVG/access.html\n\n\" To conform to the SVG specification, an SVG user agent should conform to UAAG. \"\n\nuaag: http://www.w3.org/TR/UAAG10/guidelines.html#gl-feature-on-off\n\n\"Guideline 3. Allow configuration not to render some content that may reduce accessibility\"\n\n\nI'm frequently wrong, but do have over 10 years bug filing experience.\nI'm unlikely to file further bugs, if I am expected to provide all the supporting evidence, as I already have literally hundreds of bugs filed across many applications, and simply don't have the time.\n\nregards\n", "id": 122556, "time": "2008-11-17T06:46:26Z", "creator": "j.chetwynd@btinternet.com", "creation_time": "2008-11-17T06:46:26Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 45574, "text": "(In reply to comment #5)\n>  I have already stopped responding to, or filing mozilla bugs because\n> of the unacceptable - to me - tone of responses.\n\nIMHO your tone is pretty acerbic too, generally much more than the tone used to (usually constructively) criticize some of your out-of-topic or offending statements. Nevertheless, this is way off topic - I seriously believe that tone should be neutral and would prefer not to turn this thread into an opinion war. Please don't. :-|\n\n\n\n> http://www.w3.org/TR/SVGMobile12/access.html#SVGUAAccessibilityGuidelines\n> \n> \"Provide a text-only view\n> SVG user Agents should provide mechanisms that allow assistive technologies to\n> achieve a useful text-only view. Examples include a DOM explorer, a\n> synchronized text only view, or an XSLT style sheet to convert the textual\n> content to XHTML.\"\n> \n> for SVG1.1 the UA guidelines were less developed:\n> \n> http://www.w3.org/TR/SVG/access.html\n> \n> \" To conform to the SVG specification, an SVG user agent should conform to\n> UAAG. \"\n> \n> uaag: http://www.w3.org/TR/UAAG10/guidelines.html#gl-feature-on-off\n> \n> \"Guideline 3. Allow configuration not to render some content that may reduce\n> accessibility\"\n\n\nThere, wasn't too hard, was it? ;-p\n\nIt seems that there is now enough information to work with. :-)\n\n\n\n> I'm frequently wrong, but do have over 10 years bug filing experience.\n> I'm unlikely to file further bugs, if I am expected to provide all the\n> supporting evidence, as I already have literally hundreds of bugs filed across\n> many applications, and simply don't have the time.\n\nI do believe that one should always invest time providing links to relevant parts of specifications. It's worth the effort, specially if it helps towards the issue being fixed (which is usually the case).\n\nOften developers are more focused into solving problems than into reading the specs (although, in this particular case, Thomas is IMO one of the persons I know which have a better knowledge of the SVG specification, what can and cannot be done and how, as well as on its relation with the Batik implementation - not at all meant to sound flattering).\n\n\n\nHope you continue to contribute (not only within Batik but in general) with your accessibility background and knowledge, although I'd personally suggest a small amount of moderation. ;-)", "count": 6, "id": 122562, "time": "2008-11-17T08:06:17Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-11-17T08:06:17Z", "is_private": false}, {"count": 7, "tags": [], "creator": "helder.magalhaes@gmail.com", "attachment_id": 22882, "id": 122572, "time": "2008-11-17T08:13:19Z", "bug_id": 45574, "creation_time": "2008-11-17T08:13:19Z", "is_private": false, "text": "Created attachment 22882\nTest case\n\nInstead of using an URL to a test case, which can be broken at anytime, it is (generally) a good practice creating a reduced test case and attaching it into the issue. I took the liberty of using the one available in the provided URL, although I recognize it much simpler - just a few shapes, text and title/desc elements."}, {"count": 8, "tags": [], "bug_id": 45574, "attachment_id": null, "is_private": false, "id": 122574, "time": "2008-11-17T08:29:30Z", "creator": "deweese@apache.org", "creation_time": "2008-11-17T08:29:30Z", "text": "(In reply to comment #5)\n> #4\n> it is the resaponsibility of developers to be aware and implelement the user\n> agent guidelines, not bug filers to point to those W3C specification files.\n\n   I'm sorry but I 100% disagree with this point.  If you claim that fixing\na bug is a requirement of a specification then I think that you have a\nresponability to point to the part of the specification you think requires\nit.  At the very least you will be able to find that section\nfaster than the developer, since you are the one referencing it.\n\n  If you are not willing to do this then what is the developer to do?\nHow long does a developer search (for SVG there are quite a number of \nmulti-hundred page specs involved) before giving up?   How does a developer\n'prove a negative'?  As you say you are sometime wrong...\n\n> http://www.w3.org/TR/SVGMobile12/access.html#SVGUAAccessibilityGuidelines\n\n   Thanks a lot!\n\n> \"Provide a text-only view\n> SVG user Agents should provide mechanisms that allow assistive technologies to\n> achieve a useful text-only view. Examples include a DOM explorer, a\n> synchronized text only view, or an XSLT style sheet to convert the textual\n> content to XHTML.\"\n\n   So Batik includes a DOM explorer which honestly I would think would\nbe more useful for this.   Batik also supports (IIRC) XSLT style sheets\n(I forget the details) although one to do the above transformation isn't \nbuilt in.\n\n   Finally, I want to comment that I never would have connected that \nspec section with \"block images and display desc (and title?) as text.\" \nSo it's very good that you provided the specification reference.\n\n   Given we provide a DOM viewer do you think we meet this Accessibility\nguideline?\n\n> for SVG1.1 the UA guidelines were less developed:\n> http://www.w3.org/TR/SVG/access.html\n> \" To conform to the SVG specification, an SVG user agent should conform to\n> UAAG. \"\n> uaag: http://www.w3.org/TR/UAAG10/guidelines.html#gl-feature-on-off\n> \"Guideline 3. Allow configuration not to render some content that may reduce\n> accessibility\"\n\n   This I think we are a bit sketchier on, but reading the Toggle images\npoint which is much closer to your request, it occurs to me that we\ndo support User Style sheets so turning off all images is pretty easy.\nWe can't easily replace the images with title/desc text, although the \ntool tips would still be active as long as you only set 'visiblity' to \nhidden (instead of 'display' to 'none').\n\n   I can't promise when it might get implemented as right now none\nof the comitters has much time to do new development on Batik. \n\n> I'm frequently wrong, but do have over 10 years bug filing experience.\n> I'm unlikely to file further bugs, if I am expected to provide all the\n> supporting evidence, as I already have literally hundreds of bugs filed \n> across many applications, and simply don't have the time.\n\n   That is of course your perogative.  Might I suggest that simply \nproviding the links and moving on would save you a lot of time over \nindulging in belittling the developers?  In the long run you might\neven feel better.\n\n   Thanks.\n"}, {"count": 9, "tags": [], "bug_id": 45574, "attachment_id": null, "is_private": false, "id": 122577, "time": "2008-11-17T09:13:47Z", "creator": "j.chetwynd@btinternet.com", "creation_time": "2008-11-17T09:13:47Z", "text": "#678,\n\nThomas & Helder,\n\nI am unlikely to respond to further bug requests.\n\nyou may feel it is simple and easier for me to find evidence in the spec. It isn't.\n\nand when the response is generally \"oh yes, accessibility, we wont be impleementing that any time soon.\" or similarly\n\n\" I can't promise when it might get implemented as right now none\nof the comitters has much time to do new development on Batik.\"\n\nThis is generally known as 'taking the piss' in English.\n\nhence I am relinquishing my interest in contributing further.\n\nregards\n "}]