[{"count": 0, "tags": [], "creator": "huckleberry@catcha.com", "attachment_id": null, "id": 7427, "time": "2001-11-01T05:40:57Z", "bug_id": 4561, "creation_time": "2001-11-01T05:40:57Z", "is_private": false, "text": "Background information\n\nLog4J 1.1.3 on Sun Solaris v 5.8, being used in conjunction with IBM JDK 1.3\n(the one that ships with WebSphere v4). The application in question is a stand \nalone java program that uses log4j for logging...the program uses the \nCategories the usual way, the application makes use of the \nDailyRollingFileAppender in conjunction with the AysncAppender\n\nScenario\n\nIf an user A invokes the program(first invocation of the program) and the log \nfiles get created with the default permissions of the user A, now when user B \ninvokes the same program and he does not have rights to write to the log file \ncreated by the earlier run of the program, now log4j generates a message to \ninform the user of the inability to write to the file because it lacks the \npermissions...and in the due course the program terminates...but log4j threads \nwont terminate even though the program calls the shutdown() function on the \nCategory.\n\nOne way is to ensure that the permissions are set in the right fashion...was \nwondering if a sucessful termination in any event would be more desirable.\n\nIf I got it all wrong or if I am barking against the wrong tree...my apologies!\n\nPlease feel free to contact me if you need any information or if you need me to \ndo some more testing. Thanks."}, {"count": 1, "tags": [], "bug_id": 4561, "attachment_id": null, "id": 15799, "time": "2002-05-09T13:56:36Z", "creator": "ceki@apache.org", "creation_time": "2002-05-09T13:56:36Z", "is_private": false, "text": "\nCan you please supply a test case for this bug?"}, {"count": 2, "tags": [], "bug_id": 4561, "attachment_id": null, "is_private": false, "id": 68403, "time": "2004-12-13T18:02:15Z", "creator": "yoavs@computer.org", "creation_time": "2004-12-13T18:02:15Z", "text": "No test case, log4j 1.1.3 --> irrelevant."}]