[{"count": 0, "tags": [], "creator": "gscokart@gmail.com", "attachment_id": null, "id": 119983, "time": "2008-08-21T05:38:37Z", "bug_id": 45665, "creation_time": "2008-08-21T05:38:37Z", "is_private": false, "text": "When profiling a build, I notice that an important part of the time is spent in SelectorUtils.matchPath (6% in a build that do mostly ivy tasks).\n\nThis method obviously do an heavy work because it is used when checking that a file name match an include/exclude pattern.  \nBut I think it do one thing too much.\nAt each invocation it executes :\n  String[] patDirs = tokenizePathAsArray(pattern);\n\nThe same patterns are parsed again and again for each file that are scanned by the DirectoryScanner.  This should be avoided."}, {"count": 1, "tags": [], "bug_id": 45665, "attachment_id": null, "text": "already fixed in trunk, isn't it?", "id": 120212, "time": "2008-08-29T08:30:01Z", "creator": "bodewig@apache.org", "creation_time": "2008-08-29T08:30:01Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 45665, "attachment_id": null, "text": "Yes, the problem described is fixed.  The patterns are now parsed only once per scanning.\n\nI have also seen some further possible enhancements, but I'm not sure they will bring a noticeable enhancement :\n1. When multiple include/exclude patterns are used, the filename is also tokenized multiple times (once per pattern)\n2. The tokenizePathAsArray implementation loop twice on the String (pattern or filename) using charAt method.  Maybe using indexOf, and/or using a Tokenizer class instead of an array could provide faster results.\n\nBut the major thing is now fixed.  If the 2 previous point give noticebale enhancement, then I will re-open this issue.\n\nI gain +/- 2% of my total build time which is at 80% an ivy build (not using the directory Scanner).  A build that do a lot of directory scanning could gain up to 10% of processing time.\n", "id": 120253, "time": "2008-09-01T01:38:01Z", "creator": "gscokart@gmail.com", "creation_time": "2008-09-01T01:38:01Z", "is_private": false}]