[{"count": 0, "tags": [], "bug_id": 45671, "attachment_id": null, "text": "I am new to POI, trying to develop a extractor program using POI(converting MS Documents into text). Everything is working fine, if i have extract whole documents. But if i want to extract some page, range of pages or one single page. I found no method. If there is any method please let me know.... If its nt there wht shall i do........\nhelp Urgent!!!", "id": 120018, "time": "2008-08-22T04:37:17Z", "creator": "thakurakhil2006@gmail.com", "creation_time": "2008-08-22T04:37:17Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 45671, "text": "Please use the users mailing list for use questions.\n\nYou might also find http://poi.apache.org/hwpf/quick-guide.html useful", "id": 120424, "time": "2008-09-07T12:55:34Z", "creator": "apache@gagravarr.org", "creation_time": "2008-09-07T12:55:34Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45671, "attachment_id": null, "text": "Just to save you asking this question on any other list, it is not possible to get at a specific page or range of pages usinf POI. Word does not store page information in the file at all - unless the creator of the document has used hard page breaks throughout. Word - or some other package such as OpenOffice, AbiWord, etc - must be used to render the document into a human readable form before it is possible to get, for example, the contents of page ten.\n\nYou are faced with two options; one is to write your own parser so that you can render the document into a human readable, in memory, form and, therefore, get at a specific page. Option two is to use either OLE/COM to open and manipulate the document using Word - which will work only on a Windows platform - or to take advantage of OpenOffice's UNO interface. This works a little like COM but allows you to write code in Java to control an instance of OpenOffice which is pretty much platform independent.", "id": 166181, "time": "2013-03-27T17:21:49Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2013-03-27T17:21:49Z", "is_private": false}]