[{"count": 0, "attachment_id": null, "bug_id": 45678, "text": "When reading values from number cells, for some type of formatted numbers, HSSFDataFormatter returns incorrect values:\n\n1. Simple numbers: adds an underscore after the number in the formatted string, using default number format, eg. a cell with the number 4455667788 is formatted as a string like '4455667788_'.\n\n2. Account numbers are formatted with different precision than in Excel, eg. the number 0,896665 in excel, with 2 digits precision, is shown as 0,90. HSSFDataFormatter returns 0,896665. The same number, as currency or number is formatted as it appears in Excel (number, as reported above, adds an underscore in the end of the string, it returns '0,90_'.\n\n3. Fraction numbers always returns the string '1 ??/??'.\n\nThe XLS document was generated using Excel 2007 / portuguese, in Excel 97/2003 format.\n\nOther kind of number formats work fine, like currency, date, hour, percentage, scientific and phone numbers. \n\nBrazilian zip codes (ddddd-ddd) are formatted as dddddddd- and taxpayer registry numbers (ddddddddd-dd) as ddddddddddd-", "id": 120045, "time": "2008-08-23T05:24:03Z", "creator": "pablo@pixeltree.com.br", "creation_time": "2008-08-23T05:24:03Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 45678, "attachment_id": null, "text": "Brazilian zip codes (ddddd-ddd) and taxpayer registry numbers (ddddddddd-dd) will require custom formats which you can easily add via addFormat(String, java.text.Format). See docs and source for examples of SSN, phone-number, etc. \n\nAs far as the other problems, can you attach a sample xls that demonstrates the behavior?\n\n(In reply to comment #0)\n> When reading values from number cells, for some type of formatted numbers,\n> HSSFDataFormatter returns incorrect values:\n> 1. Simple numbers: adds an underscore after the number in the formatted string,\n> using default number format, eg. a cell with the number 4455667788 is formatted\n> as a string like '4455667788_'.\n> 2. Account numbers are formatted with different precision than in Excel, eg.\n> the number 0,896665 in excel, with 2 digits precision, is shown as 0,90.\n> HSSFDataFormatter returns 0,896665. The same number, as currency or number is\n> formatted as it appears in Excel (number, as reported above, adds an underscore\n> in the end of the string, it returns '0,90_'.\n> 3. Fraction numbers always returns the string '1 ??/??'.\n> The XLS document was generated using Excel 2007 / portuguese, in Excel 97/2003\n> format.\n> Other kind of number formats work fine, like currency, date, hour, percentage,\n> scientific and phone numbers. \n> Brazilian zip codes (ddddd-ddd) are formatted as dddddddd- and taxpayer\n> registry numbers (ddddddddd-dd) as ddddddddddd-\n\n", "id": 120078, "time": "2008-08-25T09:29:58Z", "creator": "james.may@fmr.com", "creation_time": "2008-08-25T09:29:58Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 45678, "attachment_id": 22825, "text": "Created attachment 22825\nRepro xls file for issue #3\n\nAttaching repro xls file for Issue no:3 for fractions. This is reproduced in 3.1 and 3.5 as well.", "id": 122166, "time": "2008-11-03T21:22:14Z", "creator": "vinu.kumar@gmail.com", "creation_time": "2008-11-03T21:22:14Z", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 45678, "text": "Internally this class uses java.text.DecimalFormat and java.text.SimpleDateFormat. Fraction formatting support was not included in HSSFDataFormatter because it would require a dependency on org.apache.commons.math.fraction.FractionFormat or a similar custom Format class. Does the POI development team have a recommendation for this matter?", "id": 122178, "time": "2008-11-04T08:18:24Z", "creator": "james.may@fmr.com", "creation_time": "2008-11-04T08:18:24Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "id": 122336, "time": "2008-11-10T04:45:55Z", "bug_id": 45678, "creation_time": "2008-11-10T04:45:55Z", "is_private": false, "text": "Could we dynamically load commons-math at runtime if it's there? If it is, you get fractions, if not, you don't (but also don't need another jar as a dependency)"}, {"count": 5, "tags": [], "creator": "james.may@fmr.com", "attachment_id": null, "id": 122342, "time": "2008-11-10T08:54:16Z", "bug_id": 45678, "creation_time": "2008-11-10T08:54:16Z", "is_private": false, "text": "Nick, your suggestion to dynamically load commons-math at runtime sounds like a good compromise. Unfortunately with my current project load, I have no bandwidth to devote to this right now. I can look at this when my schedule lightens up if a patch is not submitted in the meantime."}, {"count": 6, "tags": [], "creator": "apache@gagravarr.org", "text": "I'd suggest we leave the bug open for now then. If someone else fancies adding this new code, they can do and attach the patch to the bug. If not, please do work on it yourself once you have a spare moment :)", "id": 122343, "time": "2008-11-10T09:05:09Z", "bug_id": 45678, "creation_time": "2008-11-10T09:05:09Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 45678, "attachment_id": null, "text": "I have been implementing some code in Apache Tika (part of the Lucene community) to improve our number format support as part of a JIRA Ticket.\n\nAs part of this is related to fractions I would like to progress the support of fractions with POI, therefore I have made changes to support dynamic usage of Commons Math.\n\nStill have a few tweaks to make and then will attach.\n\nCheers,\nDave", "id": 133354, "time": "2010-01-05T13:17:55Z", "creator": "dmeikle@apache.org", "creation_time": "2010-01-05T13:17:55Z", "is_private": false}, {"count": 8, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "id": 133376, "time": "2010-01-06T03:03:37Z", "bug_id": 45678, "creation_time": "2010-01-06T03:03:37Z", "is_private": false, "text": "Great news, we'll look forward to seeing the patch :)"}, {"count": 9, "tags": [], "bug_id": 45678, "attachment_id": null, "text": "I've just made some improvements to how POI handles excel formatting, in relation to bug #48872. I think this will help with a few of your problems. Fractions still remains as a todo though.\n\nI feel I've a better handle on how it all works now, which should make reviewing and applying a patch easier, so if we could get a patch for fractions that'd be great!", "id": 137248, "time": "2010-06-01T11:37:36Z", "creator": "apache@gagravarr.org", "creation_time": "2010-06-01T11:37:36Z", "is_private": false}, {"count": 10, "tags": [], "creator": "apache@gagravarr.org", "text": "As of r1231144, fractions (including the one in this file) are correctly formatted by DataFormatter, as part of the merging of the code from TEXT", "id": 152755, "time": "2012-01-13T16:04:04Z", "bug_id": 45678, "creation_time": "2012-01-13T16:04:04Z", "is_private": false, "attachment_id": null}]