[{"count": 0, "tags": [], "bug_id": 45697, "attachment_id": null, "id": 120152, "time": "2008-08-27T14:00:07Z", "creator": "oznelg@yahoo.com", "creation_time": "2008-08-27T14:00:07Z", "is_private": false, "text": "When you use the LoadModule command in the config file to load a module whose sharedlibrary is not compatible with the loading version of httpd it produces a misleading error message that looks like:\n\n     httpd.exe: Syntax error on line 129 of C:/Apache2/conf/httpd.conf: Cannot load C:/Apache2/modules/mod_auth_sspi.so into server: The specified module could not be found.\n\nFurthermore this error never appears in the error.log file.  If you are launching httpd via the windows Services application then you never see the error message:(.\n\nI consider myself an advanced technologist and I'm usually pretty quick to work out problems like this.  However, when a program as solid as httpd tells me a file can not be found i _start_ by beleiving it.  I kept thinking that maybe I had the slashes backwords (apache reports with forward slashes when I run on Win32 which uses back slashes), or there was a permission problem or some attribute on the file that made it impossible for httpd to see the file.\n\nIn the end I found it was simply a matter of the module share library being built to run with an older version of httpd.\n\nI understand that Apache uses a magic number scheme to identify module compatibility. Does it have to be a fatal error, then, if a module is not compatible?  Can the error messag indicate the file was incompatible with this version of http?"}, {"count": 1, "tags": [], "bug_id": 45697, "text": "Modules compiled for 2.0 are not compatible with 2.2 and visa versa, and\nthis module isn't distributed by the httpd project so issues with it do\nnot belong in this tracker.", "id": 120153, "time": "2008-08-27T16:04:16Z", "creator": "wrowe@apache.org", "creation_time": "2008-08-27T16:04:16Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45697, "is_private": false, "text": "This is Wondows System Error Code 126. It is returned by the Windows loader and httpd tells you that loading failed and adds the original OS message to it's own error message. Unfortunately windows also includes the word \"module\" in the error message, although at this stage it's just a shared lib.\n\nIf the OS loader loaded the module, and there were only a problem of the module being compiled for another httpd version, httpd itself would present you with the message\n\nAPI module structure '...' in file ... is garbled - expected signature ... but saw ... - perhaps this is not an Apache module DSO, or was compiled for a different Apache version?\n", "id": 120167, "time": "2008-08-28T03:31:30Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2008-08-28T03:31:30Z", "attachment_id": null}]