[{"count": 0, "tags": [], "bug_id": 45693, "attachment_id": null, "is_private": false, "id": 120108, "time": "2008-08-26T08:10:15Z", "creator": "alexkrystek@gmx.de", "creation_time": "2008-08-26T08:10:15Z", "text": "Hi,\n\nwe run on a solaris 10 machine an apache web server 2.2 (sorry, I don't know the last version, I've just an extract of the conf files).\n\nWe have a portal and use the proxy module to pass and passreverse communication to other application servers. Also we are using a Single Sign On product, which forces a cookie refresh every 10 minutes.\nThe refresh is very simple, the loaded sso module just calls the cookie provider, gets the cookie and redirects back to the origin URL. And here is the problem, the cookie provider URL is called with a very long session string. The URL is a little bit longer then 1400 chars. In the redirect back to the origin URL the referer contains this long URL. Now the browser presents an HTTP 502 error. The origin URL is a proxy URL, which is passing to one of the application servers.\n\nHere is our config:\n...\nSSLProxyEngine on\n...\nProxyRequests Off\n<Proxy *>\n\tOrder\tdeny,allow\n\tAllow\tfrom all\n</Proxy>\nProxyPass        /folder/ http://server.test.net:8080/folder/\nProxyPassReverse /folder/ http://server.test.net:8080/folder/\n...\n\nYou can rebuild the problem very easy, just set up an apache with proxy pass und pass reverse to e.g. www.google.de. Then use the firefox plugin \"modify headers\" and add a header named \"Referer\" with a long URL e.g. www.google.de/test1234567.......... If you try to access the proxy URL, a 502 will be produced.\nIn our tests we have found a max. supported Referer length of 1060 chars. All longer URLs will produce the error.\n\nWe have tried to use badheader directive, but without luck. Then we have used mod_headers and it worked. But this is just a workaround:\n# if referer contain www.google.de set variable\nSetEnvIf Referer \"www\\.google\\.de\" rewrite_true\n# if variable true, set new header with content https://www.google.de\nRequestHeader set Referer \"https://www.google.de\" env=rewrite_true\n\nbye,\nAlex"}, {"count": 1, "attachment_id": null, "creator": "rpluem@apache.org", "is_private": false, "id": 120109, "time": "2008-08-26T09:31:36Z", "bug_id": 45693, "creation_time": "2008-08-26T09:31:36Z", "tags": [], "text": "Please set the loglevel to debug and attach the output of the error log for a request resulting in a 502."}, {"count": 2, "tags": [], "creator": "alexkrystek@gmx.de", "is_private": false, "id": 120134, "attachment_id": null, "bug_id": 45693, "creation_time": "2008-08-27T01:55:46Z", "time": "2008-08-27T01:55:46Z", "text": "We have tested a little bit more and I don't think you need the error logs. It is not specially the referer header, it is the entity of all headers.\n\nThere seems to be a max request header length for the proxy, which can be exceeded with the entity of all request headers. Unfortunatly our referer is very long and increase the number of chars of all headers, which is causing the proxy error. The referer is just the trigger, the problem is the max length limitation.\nI don't know what the max length of request headers is exactly, because I haven't found anything in the web. Perhaps you can tell me the supported length? Or a way to prevent the error?"}, {"count": 3, "tags": [], "text": "I've just tested this with a 1500-character Referer header, and am unable to reproduce the problem.  If you still have the problem and believe it's apache (as opposed to your SSO system, or other third-party component), please post a test case with sufficient detail to reproduce it.", "is_private": false, "id": 123710, "creator": "nick@webthing.com", "time": "2009-01-02T10:17:17Z", "bug_id": 45693, "creation_time": "2009-01-02T10:17:17Z", "attachment_id": null}]