[{"count": 0, "tags": [], "bug_id": 45705, "text": "Created attachment 22493\ntest source and example pdfs\n\nthe margins of blocks are displayed different, whether the block has a border or not. Additionaly it isn´t displayed as expected compared to xep 4.11. Just see attached example.", "id": 120171, "time": "2008-08-28T05:55:58Z", "creator": "sam@4tek.de", "creation_time": "2008-08-28T05:55:58Z", "is_private": false, "attachment_id": 22493}, {"count": 1, "tags": [], "bug_id": 45705, "attachment_id": null, "id": 120214, "time": "2008-08-29T10:47:36Z", "creator": "adelmelle@apache.org", "creation_time": "2008-08-29T10:47:36Z", "is_private": false, "text": "(In reply to comment #0)\n> Created an attachment (id=22493) [details]\n> test source and example pdfs\n> \n> the margins of blocks are displayed different, whether the block has a border\n> or not. Additionaly it isn´t displayed as expected compared to xep 4.11. Just\n> see attached example.\n\nVery unexpected result indeed, but also entirely wrong? There is definitely something 'off', but I'm wondering whether FOP gets it half right, and XEP is actually more at fault for not collapsing the space-before and space-after with the margins of the nested blocks.\n\nAs for the difference between the cases with and without additional borders, I'm still looking for the reference, but I seem to remember that borders act as a fence for space-resolution, so I guess there should at least be /some/ difference between the two. XEP seems to miss the ball there (and, of course, FOP's dashed borders are much nicer ;-))\n\nA workaround, if you want to guarantee that all spaces are preserved under all conditions, would be to  abandon the \"margin\" shorthand, and use the more verbose native XSL-FO properties, like so:\n\n<block space-after.optimum=\"5mm\" \n        space-after.conditionality=\"retain\"\n        space-after.precedence=\"force\" ...>\n  <block space-before.optimum=\"2mm\"\n            space-before.conditionality=\"retain\" \n            space-before.precedence=\"force\" ...>\n\nYou can still use the margin shorthand to set space-start and space-end, but if you want control over precedence and conditionality, you also have to set the length component through the native property.\n\nPrecedence explains why the margin-bottom of the first nested block seems to disappear. It is collapsed, because the 5mm space-after wins ( 5 > 2 ). Conditionality may explain why the margin-top for that very same block is dropped (?)"}, {"count": 2, "tags": [], "creator": "adelmelle@apache.org", "attachment_id": null, "text": "Reference found: http://www.w3.org/TR/xsl/#spacecond (a bit esoteric, but if you read closely, you'll see that FOP actually tries to be compliant, where XEP doesn't seem to care that much :-))\n\nAs to answer my own question-mark: yes, .conditionality does explain why the margin-top is dropped, since the block in question has no borders/padding (= no fence preceding) and leads in a reference area.\n\nTo conclude: definitely not a bug in FOP. The behavior, as unexpected as it may be, is entirely correct.", "id": 120215, "time": "2008-08-29T11:02:04Z", "bug_id": 45705, "creation_time": "2008-08-29T11:02:04Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 45705, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156487, "time": "2012-04-01T13:48:50Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:48:50Z", "is_private": false, "attachment_id": null}]