[{"count": 0, "tags": [], "text": "Created attachment 22505\nexcel and sourcecode to reproduce bug\n\nExcel Autofilter does not survive through cloneSheet. Autofilter on original sheet does work, but on cloned sheet there is UI-component visible but it does not respond anymore.\n\nSame behaviour on latest SVN (r690837) as well as all 3.0.2-FINAL and 3.1-FINAL.\n\nExcel file + source for reproducing attached.\n\nP.S. how badly does this relate to bug 35125... ???", "is_private": false, "bug_id": 45720, "id": 120252, "time": "2008-09-01T01:19:35Z", "creator": "antti.koskimaki@joinex.com", "creation_time": "2008-09-01T01:19:35Z", "attachment_id": 22505}, {"count": 1, "tags": [], "creator": "josh@apache.org", "attachment_id": null, "id": 120322, "creation_time": "2008-09-03T12:58:00Z", "time": "2008-09-03T12:58:00Z", "bug_id": 45720, "text": "I could reproduce this bug fairly easily.  One slight difference however, was that my Excel(2007) completely crashes when I try to sort using the autofilter in the newly copied sheet.\n\nTo help diagnose, I cloned the sheet in the input spreadsheet using Excel and ran BiffViewer on that file, and the POI generated file.\n\nThe first problem I noticed was a missing NameRecord (of the 'built-in' kind).  Another cosmetic problem was POI's choice of name for the new sheet.  Excel adds a space before the bracket e.g. \"Test Clone (2)\", which upsets the file offsets and causes false deltas when comparing the BiffViewer files.  If fixed both these problems in svn r691740. No junit for the built-in name record yet.\n\nAfter that fix the next difference I tried working on was within the MSODRAWING record (in the second, copied sheet).  Unfortunately, POI does not interpret that record when reading from and existing file (BiffViewer does though), so I had to resort to hex-editing the POI generated XLS file.  After changing a few bytes (to make the POI generated second MSODRAWING record the same as the Excel generated one), the file loaded OK in Excel, and the autofilters worked fine.\n\nI will attach the BiffViewer dump of the MSODRAWING records before and after manual hex editing.\n\n", "is_private": false}, {"count": 2, "tags": [], "text": "Created attachment 22522\nBiff dump of MSODRAWING before and after manual hex editing\n\nbiff45720-msoDrawing-bad.txt is a BiffViewer dump of the cloned drawing record (in the second sheet) as generated by POI with the example code of this bugzilla\nbiff45720-msoDrawing-good.txt is a BiffViewer dump of the same record after manual hex editing to make it the same as the one Excel produces.\n\nThese changes alone are enough to fix the POI generated XLS file so that the autofilters work OK in Excel.", "attachment_id": 22522, "id": 120323, "creator": "josh@apache.org", "time": "2008-09-03T13:08:07Z", "bug_id": 45720, "creation_time": "2008-09-03T13:08:07Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 45720, "text": "By comparing the BiffViewer dumps, I can see that some internal IDs need adjusting, as well as an options flag.\n\nThere are probably a few steps required to complete this fix:\n 1 - Make POI always interpret MSODRAWING records\n 2 - Understand the the rules for updating the drawing IDs (do they just have to be  globally unique, or do they have to coordinate with other records?)\n 3 - Implement those rules within HSSFWorkbook.cloneSheet()\n\nStep 3 might be trivial, but Steps 1 and 2 definitely are not. Can someone who knows a bit about drawing records take a look at this?\n", "count": 3, "id": 120324, "time": "2008-09-03T13:18:03Z", "creator": "josh@apache.org", "creation_time": "2008-09-03T13:18:03Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 45720, "text": "> \n> Step 3 might be trivial, but Steps 1 and 2 definitely are not. Can someone who\n> knows a bit about drawing records take a look at this?\n> \n\nI'm not sure if (1) is possible. Probably (2) would be enough. We can just traverse drawing records and update IDs when cloning sheets.\n\nI will look into it and keep you informed about the status.\n\nYegor\n\n", "count": 4, "id": 120331, "time": "2008-09-03T22:33:04Z", "creator": "yegor@dinom.ru", "creation_time": "2008-09-03T22:33:04Z", "is_private": false}, {"count": 5, "tags": [], "text": "Fixed\n\nIf the cloned sheet has drawings, a new drawing group ID must be allocated. It was a crucial part of the bug.\n\nSee Workbook.cloneDrawings(Sheet sheet) for details.\n\nYegor", "attachment_id": null, "id": 120420, "creation_time": "2008-09-07T09:28:19Z", "time": "2008-09-07T09:28:19Z", "creator": "yegor@dinom.ru", "bug_id": 45720, "is_private": false}, {"count": 6, "tags": [], "text": "(In reply to comment #5)\n> Fixed\n> \n> If the cloned sheet has drawings, a new drawing group ID must be allocated. It\n> was a crucial part of the bug.\n\nThanks for quick responses.\n\nI'll verify that you are getting closer, bug seemed to be fixed when tested with that simple example.\n\nBut, something is still wrong when there exists sheet(s) before the cloned one. ", "is_private": false, "bug_id": 45720, "id": 120433, "time": "2008-09-07T22:49:51Z", "creator": "antti.koskimaki@joinex.com", "creation_time": "2008-09-07T22:49:51Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 45720, "text": "Created attachment 22537\n excel with two sheets and source to reproduce the bug\n\n> But, something is still wrong when there exists sheet(s) before the cloned one. \n\nexcel with two sheets and source to reproduce the bug", "id": 120435, "time": "2008-09-07T22:51:56Z", "creator": "antti.koskimaki@joinex.com", "creation_time": "2008-09-07T22:51:56Z", "is_private": false, "attachment_id": 22537}, {"attachment_id": null, "tags": [], "bug_id": 45720, "is_private": false, "count": 8, "id": 120453, "time": "2008-09-08T06:33:57Z", "creator": "yegor@dinom.ru", "creation_time": "2008-09-08T06:33:57Z", "text": "Josh,\n\nHSSFWorkbook.findExistingBuiltinNameRecordIdx does not find NameRecord if there is a sheet before the cloned one.\nAs result, the NameRecord is missing in the output. \n\nRun the code from the second attachment. The following \"if\" clause is not executed: \n\nint filterDbNameIndex = findExistingBuiltinNameRecordIdx(sheetIndex, NameRecord.BUILTIN_FILTER_DB);\nif (filterDbNameIndex >=0) {\n  ...\n}\n\nYegor"}, {"count": 9, "tags": [], "bug_id": 45720, "text": "(In reply to comment #8)\n\n> HSSFWorkbook.findExistingBuiltinNameRecordIdx does not find NameRecord if there\n> is a sheet before the cloned one.\n\nSeemed to be a wrong interpretation of NamedRecord.getSheetNumber().  This bug would also have affected HSSFWorkbook.setRepeatingRowsAndColumns.  Fixed and junit added in svn r693221. Attachment (id=22537) seems to work OK now. \n\nPlease re-open this bug if you find any other special case (of cloning sheets with autofilters) that is not handled.", "id": 120473, "time": "2008-09-08T13:00:23Z", "creator": "josh@apache.org", "creation_time": "2008-09-08T13:00:23Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 45720, "text": "> Please re-open this bug if you find any other special case (of cloning sheets\n> with autofilters) that is not handled.\n\nThanks. Got my real-world case functioning, so everything seems ok for me.\n", "count": 10, "id": 120491, "time": "2008-09-09T02:10:14Z", "creator": "antti.koskimaki@joinex.com", "creation_time": "2008-09-09T02:10:14Z", "is_private": false}]