[{"count": 0, "tags": [], "text": "We redistribute Apache httpd as part of our application so the installation directory is never the same as the directory httpd is compiled for. Additionally the functionality we provide requires that we can configure the library search path at install time.\nWe just ran into a problem with several of our customers who installed our software and found that they couldn't use the implemented database functionality. After researching the issue we found that they had installed the RedHat ODBC RPMs on their system and /usr/lib64 contained a library named libodbc.so. We normally provide the DataDirect ODBC libraries as part of our installation and set the LD_LIBRARY_PATH environment variable appropriately to point to them. This has worked well with previous versions of httpd and seemed to work when we did our testing, but we didn't have the RedHat ODBC libraries installed on our test machines.\nWhen we straced the server we found that it was always looking in the install path /tmp/install/httpd-2.2.4/lib, then /usr/lib64 for everything first.\nLooking at the strings in httpd we discovered the string \"/tmp/install/httpd-2.2.4/lib:/usr/lib64\"\nI spent about a day and a half fiddling with the config/libtool files to finally get the hardcoded rpaths out of the compiled code, after compiling the code without hardcoded rpaths everything seemed to work just fine and we could again access the database functionality that was broken by them.\nWould it be possible to either remove the hard coded rpath stuff from libtool or at least provide a configuration option to turn it off? --disable-rpath\nHacking libtool is not very user friendly and there are a lot of places where the hardcode_libdir_flag_spec shows up.\n\nThanks", "attachment_id": null, "id": 120368, "creator": "thelvey@accelrys.com", "time": "2008-09-04T14:06:54Z", "bug_id": 45748, "creation_time": "2008-09-04T14:06:54Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 45748, "is_private": false, "id": 120645, "time": "2008-09-15T19:35:02Z", "creator": "wrowe@apache.org", "creation_time": "2008-09-15T19:35:02Z", "tags": [], "text": "Note that the hardcode lib and search path mechanics are all a byproduct of\nthe libtool package, we'd suggest you look at that package and either offer\nyour feedback to the libtool developers for improvement or offer a patch to\nlibtool, itself.\n\nWe do pick up new libtool versions as they mature, for the packaging of the\nhttpd and apr tarballs."}, {"count": 2, "tags": [], "bug_id": 45748, "attachment_id": null, "is_private": false, "id": 120686, "time": "2008-09-16T09:34:55Z", "creator": "thelvey@accelrys.com", "creation_time": "2008-09-16T09:34:55Z", "text": "I'll try to submit a patch if I can find some time to figure out how to do it cleanly. Currently I have a few fugly sed commands in our Apache build script, definitely not production quality. If I come up with something workable, it's probably going to need to be supported by configure, how do I get a patch to you?"}, {"id": 120689, "tags": [], "creator": "rpluem@apache.org", "is_private": false, "count": 3, "text": "(In reply to comment #2)\n> probably going to need to be supported by configure, how do I get a patch to\n> you?\n> \n\nEither attach it here or sent it to dev@httpd.apache.org. If it is a libtool patch it makes sense to send it to the libtool guys of course.\n", "time": "2008-09-16T12:05:19Z", "bug_id": 45748, "creation_time": "2008-09-16T12:05:19Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "\"If I come up with something workable, it's probably going to need to be supported by configure, how do I get a patch to you?\"\n\nI think you missed my point.  The correct solution is to teach libtool to\nignore [/usr]/lib64 in constructing the rpath, submit the patch to the libtool\nproject (see gnu.org) and when they roll it out as a libtool release, it will \nbe incorporated in httpd's ./buildconf.sh results (configure, etc).", "attachment_id": null, "id": 120690, "creator": "wrowe@apache.org", "time": "2008-09-16T12:57:33Z", "bug_id": 45748, "creation_time": "2008-09-16T12:57:33Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 45748, "attachment_id": null, "id": 120699, "time": "2008-09-17T01:53:20Z", "creator": "jorton@redhat.com", "creation_time": "2008-09-17T01:53:20Z", "is_private": false, "text": "The problem is that e.g. Debian don't use the same filesystem layout on 64-bit platforms as the RPM-based distros (no /usr/lib64), so a general solution for libtool is yet to be integrated.  Running buildconf to pick up distro-patched libtool is the simplest solution in the mean time."}, {"count": 6, "attachment_id": null, "bug_id": 45748, "is_private": false, "id": 120716, "time": "2008-09-17T09:48:07Z", "creator": "thelvey@accelrys.com", "creation_time": "2008-09-17T09:48:07Z", "tags": [], "text": "Actually it would be nice to be able to eliminate the setting of rpath completely. Since we don't run from where we build and stage from (tmp), it's a potential security issue having the loader look there first. It's different when you're delivering binaries and letting the user choose where to install them.\nThanks for all the help. I'm swamped with a release right now but we'll be updating Apache for the next release so this is still on my plate."}]