[{"count": 0, "tags": [], "creator": "joekislos@gmail.com", "text": "setCellFormula produces incorrect result for FREQUENCY function\n\nIf you set this formula using HSSFCell.setCellFormula:\nSUM(IF(FREQUENCY($A1:$A5,$A1:$A5)>0,1))\n\nThe result in excel will be *incorrect* (it does evaluate without error, but the result is wrong).  If you look at generated excel file, the result will be 1.  If you click on the formula text, then hit enter, the correct result will appear.  If you enter the formula in excel manually, the result is correct.\n\nI have attached a testcase which produces this issue.\n\nattached file:poi-formula-issue.xls\ncontains the input excel sheet\nIf you run attached file: POISetFormulaIssue.java\nit will produce attached file: poi-formula-issue-output.xls\n\nIf you look at the output in excel, you can see that C1 and C2 differ.  C1 is the one written by POI, and C2 was the one I entered in excel in the initial template.\n\nIf you click on C1, and goto Formula Auditing->Evaluate Formula, you can see how excel evaluates the formula.  It will evaluate the formula differently for C1 and C2.  It appears the evaluation of FREQUENCY appears to be the issue.  For C2 it returns an array, and in C1 it just returns 1.\n\nI know this formula looks harebrained, but I need to count the distinct items in a list.  This is the \"microsoft approved\" way of doing this:\nhttp://office.microsoft.com/en-us/excel/HP030561181033.aspx\n\nIf anybody has any other ways of doing this, I would certainly change my ways :)\n\nI've looked through bugzilla and there is only one reference to frequency and it is in bug #21334.  They said their issue was resolved in a previous build, however I wonder if it simply *stopped crashing*, yet was yielding an invalid result nonetheless.  \n\nI have reproduced this issue with POI-3.0.2-FINAL and POI-3.1-FINAL.  For some reason 3.1 is not in the version list in bugzilla, but I have reproduced it with both.", "id": 120408, "time": "2008-09-05T15:47:46Z", "bug_id": 45752, "creation_time": "2008-09-05T15:47:46Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Created attachment 22530\nThis is the input to my testcase.  It has the excel formula already in it", "attachment_id": 22530, "bug_id": 45752, "id": 120409, "time": "2008-09-05T15:48:59Z", "creator": "joekislos@gmail.com", "creation_time": "2008-09-05T15:48:59Z", "is_private": false}, {"count": 2, "text": "Created attachment 22531\nThis is the output from my test case.  POI has written in it's version of the formula", "bug_id": 45752, "attachment_id": 22531, "id": 120410, "time": "2008-09-05T15:49:20Z", "creator": "joekislos@gmail.com", "creation_time": "2008-09-05T15:49:20Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 45752, "attachment_id": 22532, "text": "Created attachment 22532\nThis is the POI code that writes in the formula to C1", "id": 120411, "time": "2008-09-05T15:50:42Z", "creator": "joekislos@gmail.com", "creation_time": "2008-09-05T15:50:42Z", "is_private": false}, {"count": 4, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "is_private": false, "id": 182793, "time": "2015-05-01T20:26:32Z", "bug_id": 45752, "creation_time": "2015-05-01T20:26:32Z", "text": "I opened the sample documents that you provided and the output-xls displays correctly with \"4\" in both cells when I open the document with LibreOffice (no Excel on the current machine), whereas I believe you reported that it is \"1\". So I am not sure how I can reproduce this and thus will close this quite old bug entry as WORKSFORME for now. \n\nIf this is still an issue for you with the latest version of POI then please reopen it with a short explanation of with which version of Excel you see the problem."}]