[{"count": 0, "tags": [], "bug_id": 45764, "attachment_id": null, "id": 120470, "time": "2008-09-08T12:21:29Z", "creator": "mhuffman@cadrc.calpoly.edu", "creation_time": "2008-09-08T12:21:29Z", "is_private": false, "text": "I admit that I am new to Tomcat, but the following seems like a bug. \n\nWhen attempting to launch Tomcat embedded, hosts (specifically StandardHosts) created are not configured with a HostConfig. Consequently, all deployment flags for WAR deployment like autoDeploy and deployOnStartup are ignored. I recommend adding the following to the implementation of createHost(..) in the Embedded class:\n\n    public Host createHost(String name, String appBase) {\n\n        ... // logging code\n\n        StandardHost host = new StandardHost();\n\n        host.setAppBase(appBase);\n        host.setName(name);\n\n       +// Host config should listen for lifecycle changes in host (notably the start event)\n       +HostConfig deployer = new HostConfig();\n       +host.addLifecycleListener(deployer);  \n\n        return (host);\n    }\n\nThe implementation of createContext() is similarly designed to use the ContextConfig, so I assume this was omitted on accident. Otherwise, those wanting the auto deployment capabilities when running embedded must override the createHost() method or create a HostConfig listener manually. This change seems well in line with the API documentation, which details that this function should \"Create, configure, and return a Host...\".\n\nIf however, this was purposefully omitted, please let me know why.\n\nThanks,\nMike Huffman"}, {"count": 1, "text": "The short version is that a Context requires a ContextConfig to operate correctly (read web.xml etc) whereas a Host does not require a HostConfig to operate correctly. Forcing the use of a HostConfig seems like a bad idea to me.", "creator": "markt@apache.org", "attachment_id": null, "id": 120521, "time": "2008-09-10T09:26:57Z", "bug_id": 45764, "creation_time": "2008-09-10T09:26:57Z", "tags": [], "is_private": false}, {"count": 2, "text": "The term \"operate correctly\" depends on what \"correct\" means. I assumed that when I created a Host it would automatically support operations like auto deployment (by called setAutoDeploy()). Although a Host can operate without a HostConfig, it doesn't accomplish functionality implied by flags and values set in the Host. I didn't see anywhere in the documentation which mentioned this caveat. To me, this seems different than the ContextConfig, and would likely be useful in all cases. \n\nIt seems this behavior was as designed, however, it would be helpful to add documentation to the Host which describes this issue when running Embedded. Specifically, that some flags set into the Host (like autoDeploy) are ignored unless a HostConfig is attached.\n\nThanks,\nMike", "creator": "mhuffman@cadrc.calpoly.edu", "attachment_id": null, "id": 120526, "time": "2008-09-10T11:59:51Z", "bug_id": 45764, "creation_time": "2008-09-10T11:59:51Z", "tags": [], "is_private": false}, {"count": 3, "text": "I disagree. Configuring the host means deploying the applications, and in embedded it seems odd to use the auto deployer (which allows direct manipulation by the user). Configuring a context means something more essential, obviously.", "creator": "remm@apache.org", "attachment_id": null, "id": 120527, "time": "2008-09-10T12:36:15Z", "bug_id": 45764, "creation_time": "2008-09-10T12:36:15Z", "tags": [], "is_private": false}]