[{"count": 0, "tags": [], "text": "my PATH includes %APACHE2_HOME%\\bin\nthe OpenSSL version displayed is :  0.9.8h\n\ntrying to run the here under command :\nOpenSSL> req -inform DER  -outform DER -out C:\\CSR.der -pubkey -new -newkey rsa:1024 -verbose\n\nI get this :\nUnable to load config info from /usr/local/ssl/openssl.cnf\nerror in req\n\nIndeed it seems that by default no openssl.cnf is created when installing Apache 2.2.9 on windows, I only see C:\\ApacheGroup\\Apache2.2\\bin\\openssl.exe\n\n(By the way why the path is a unix style one /usr/local/ and not a windows style ?)\n\nsee related issue at http://rt.openssl.org/Ticket/Display.html?id=1187\nand one sample cfg file at http://www.neilstuff.com/apache/apache2-ssl-windows.htm\n\nsee http://www.openssl.org/docs/apps/req.html\n-config filename\n    this allows an alternative configuration file to be specified, this overrides the compile time filename or any specified in the OPENSSL_CONF environment variable.\n\n\nI have seen C:\\ApacheGroup\\Apache2.2\\conf\\openssl.cnf, so I tried :\n\nOpenSSL> req -inform DER  -outform DER -out C:\\CSR.der -pubkey -new -newkey rsa:1024 -verbose -config C:\\ApacheGroup\\Apache2.2\\conf\\openssl.cnf\n\nUsing configuration from C:\\ApacheGroup\\Apache2.2\\conf\\openssl.cnf\nLoading 'screen' into random state - done\nGenerating a 1024 bit RSA private key\n..............++++++\n...................++++++\nwriting new private key to 'privkey.pem'\nEnter PEM pass phrase:\n\nSo the Apache doc should mentionn where to find openssl.cnf and how to use the variable OPENSSL_CONF or better configure OpenSSL and apache in a such way that \nthe req  command runs fine at first try", "is_private": false, "bug_id": 45763, "id": 120452, "time": "2008-09-08T05:54:34Z", "creator": "JavaCK@gmail.com", "creation_time": "2008-09-08T05:54:34Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 45763, "attachment_id": null, "is_private": false, "id": 130083, "time": "2009-08-31T12:09:02Z", "creator": "gls@gknw.net", "creation_time": "2009-08-31T12:09:02Z", "text": "Wow, this is one year old next week. I can answer this one in two parts for you.\n\n1. This is a simple fix as you point, but it has to be done at compile time and therefore is *set in stone*, which leads to #2\n\n2. The .msi installer from Apache.org allows you to put Apache anywhere your heart desires (last time I gave it a try), or just accept it's default. For most the default is fine, but I'd imagine, like me, people get tired of the super long path when working with configuration files and over time have come to put Apache in another place. Well, the developers cannot read your, mine or everyone elses mind to know exactly where that file is going to land on the file system once installed, thus the problem.\n\nIf they compile Openssl to look in C:/Program Files/Apache Software Foundation/Apache2.2/conf (which wouldn't be a bad idea) but you install Apache in C:/Apache2.2, you are right back to the same problem again.\n\nAs far as /usr/local/ssl/, that is where the OpenSSL people decided was the default location, if not change during compile, that is where it looks. \n\nBoth of these software packages are first and foremost Unix, that is where it all started. Over time they have been ported to Windows, so most likely that is why the default path is just that, a unix path."}]