[{"count": 0, "tags": [], "text": "Why does the batik transcoder explicitly require the crimson xml parser?  Why is it not using the JAXP APIs?", "is_private": false, "id": 120536, "creator": "jeffheigl@gmail.com", "time": "2008-09-11T06:37:59Z", "bug_id": 45779, "creation_time": "2008-09-11T06:37:59Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 45779, "attachment_id": null, "text": "I am having a problem with Batik in Tomcat on Windows XP and CentOS, but not in Jetty, or Tomcat on Mac.\n\nIssue is here: http://stackoverflow.com/questions/714243/sax2-driver-class-org-apache-crimson-parser-xmlreaderimpl-not-found-when-using-ba\n\nThe error \"SAX2 driver class org.apache.crimson.parser.XMLReaderImpl not found\" seems odd to me, because of your question.\n\nAny insight?  Is this a bug?", "id": 125977, "time": "2009-04-03T08:02:47Z", "creator": "mafisher2@gmail.com", "creation_time": "2009-04-03T08:02:47Z", "is_private": false}, {"count": 2, "tags": [], "text": "First of all, I'd generally suggest placing questions into the mailing lists [1] first (searching for related threads prior to the post, of course)... One may prefer using an alternative interface, such as Nabble [2], a bit more user friendly (specially for searches and such).\n\n\n\n(In reply to comment #0)\n> Why does the batik transcoder explicitly require the crimson xml parser?  Why\n> is it not using the JAXP APIs?\n\nAs far as I know (please correct me if I'm wrong), this is due to the fact that Batik targeted Java 1.3 as of Batik release version 1.7. Currently, Java 1.4 is the target for the trunk version [3].\n\nApparently, Java 1.3 didn't contain the JAXP features and Java 1.4 had them with few bugs [4] so I'd say that, until Batik targets Java 1.5, this may be a requirement...\n\n\n\n(In reply to comment #1)\n> I am having a problem with Batik in Tomcat on Windows XP and CentOS, but not in\n> Jetty, or Tomcat on Mac.\n> Any insight?  Is this a bug?\n\n(Read above first.)\n\nI'd say that this is just a coincidence. Probably, in the environments that work as expected, either:\n * Are using Java 1.4 (which apparently uses the same namespaces for the embedded JAXP functionality [4] as crimson);\n * Crimson is available in the default classpath.\n\n\n\n@Matt Fisher\nThe \"need info\" status for bug reports is more targeted at when more information is required from the reporter [5], which doesn't seem to be the case here (I understand the underlying idea, though). ;-)\n\n\n\nHope this helps,\n Helder Magalhães\n\n\n\n[1] http://xmlgraphics.apache.org/batik/mailing-lists.html\n[2] http://www.nabble.com/Batik-f308.html\n[3] http://xmlgraphics.apache.org/batik/download.cgi#Subversion+repository\n[4] http://java.sun.com/j2se/1.5.0/docs/guide/xml/jaxp/JAXP-Compatibility_150.html#packageNamesWhy\n[5] https://issues.apache.org/bugzilla/page.cgi?id=fields.html#status", "is_private": false, "id": 125979, "creator": "helder.magalhaes@gmail.com", "time": "2009-04-03T09:09:50Z", "bug_id": 45779, "creation_time": "2009-04-03T09:09:50Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 45779, "attachment_id": null, "id": 125984, "time": "2009-04-03T11:13:49Z", "creator": "mafisher2@gmail.com", "creation_time": "2009-04-03T11:13:49Z", "is_private": false, "text": "Thanks for your response and references.  My apologies for commenting at the wrong place.\n\nIt seems that FOP was referencing Crimson, and being loaded first, before the transcoder referenced it.  I resolved the classpath error by excluding FOP in the project POM.\n\nObviously, my knowledge of the architecture of Batik and FOP requiring Crimson is minimal, so I suppose it is possible that this issue may in fact be a defect related to my issue, or may not.\n\nThanks again!"}, {"count": 4, "tags": [], "creator": "helder.magalhaes@gmail.com", "is_private": false, "id": 127518, "attachment_id": null, "bug_id": 45779, "creation_time": "2009-05-31T02:18:46Z", "time": "2009-05-31T02:18:46Z", "text": "(In reply to comment #3)\n> Obviously, my knowledge of the architecture of Batik and FOP requiring Crimson\n> is minimal, so I suppose it is possible that this issue may in fact be a defect\n> related to my issue, or may not.\n\nI'm marking this fixed (invalid) as the cause and underlying \"issue\" seem to have little to do with Batik itself. Please comment and/or reopen if you feel like there's something missing/wrong about this. ;-)"}]