[{"count": 0, "tags": [], "bug_id": 45770, "attachment_id": null, "id": 120490, "time": "2008-09-09T01:52:28Z", "creator": "mhilpert@gmx.de", "creation_time": "2008-09-09T01:52:28Z", "is_private": false, "text": "I tested FOP 0.95 after migrating the XSL files from 0.20.5 and all went very well when tested with the fop.bat included with FOP 0.95 - including the SVG and GIF images.\n\nThen I started migrating the Java application from FOP 0.20.5 to FOP 0.95 and now all the images are missing. The baseUrl is set up correctly in the used fopUserAgent (I tried both \"file:///\" + oldFopBaseDir and \"file:/\" + oldFopBaseDir leading to \"file:///C:\\temp\", \"file:/C:\\temp\"). As the reports also include other XSL files with relative URLs, the userAgents baseURL seems basically to work. So I wonder why FOP 0.95 can't find the images:\n\nImage not found: images/top.svg\nImage not found: images/singlearr.gif\n\nAgain: the same baseDir used to create the report with fop.bat works including all the images. So, it's not a bug with the XSL/image files but with the Java embedding config."}, {"count": 1, "tags": [], "bug_id": 45770, "attachment_id": null, "id": 120709, "time": "2008-09-17T08:14:33Z", "creator": "jeremias@apache.org", "creation_time": "2008-09-17T08:14:33Z", "is_private": false, "text": "I'm not sure what the problem could be. Relative URIs work just fine for me. Can you try the following:\n- Set the Base URL on the FopFactory rather than on the FOUserAgent. That shouldn't make any difference for images, though, as they use the base URL from the FOUserAgent.\n- Remove any base URL from the configuration file if you use one. Shouldn't really make a difference, either. But redundance can sometimes make for nasty surprises.\n\nIf this doesn't help (and it probably won't), the only thing that comes to my mind is setting a break point in FOUserAgent.resolveURI(String, String) and check what exactly is going on. Please reopen this issue if you doesn't lead you to the problem."}, {"count": 2, "tags": [], "bug_id": 45770, "attachment_id": null, "id": 120717, "time": "2008-09-17T11:07:39Z", "creator": "mhilpert@gmx.de", "creation_time": "2008-09-17T11:07:39Z", "is_private": false, "text": "I found the cause: the problem is, that the new FOP doesn't accept relative URLs anymore ... at least when using with Java embedding - with the fop.batr command line command, it works. After writing my own URIResolver to workaround this probem (by appending a fixed URL string as a prefix) I got it to work again. However, this is a rather bad workaround."}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156918, "time": "2012-04-01T13:54:56Z", "bug_id": 45770, "creation_time": "2012-04-01T13:54:56Z", "is_private": false}]