[{"attachment_id": 22559, "tags": [], "creator": "asbund@gmx.de", "text": "Created attachment 22559\nPatch against trunk revision 694374\n\nThis patch implements HTML imagemap support. It is based on an implementation by Thomas Knodt from 2002.\n\nThis implementation does correctly support transformations. Thanks to thomas.deweese@kodak.com for very important tips on how batik works. Without his help, this patch would not have been possible.\n\nThis patch adds an ImageMapTranscoder and extends the svgrasterizer application to map the 'text/xml' output format to this transcoder.", "count": 0, "id": 120543, "time": "2008-09-11T10:45:40Z", "bug_id": 45783, "creation_time": "2008-09-11T10:45:40Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 45783, "text": "This sounds like a really cool feature to include into Batik! ;-)\n\nAccording to what I have understood, it could be used to convert a static SVG containing links into a raster image (PNG/JPEG) plus an image map. It could be used to ease the pain of supporting existing (HTML-based) browser implementations until all browsers properly can handle SVG in a more interoperable way (lack of IE support and some minor incoherence within existing implementations such as Firefox, Opera and Webkit).\n\nIf there are any plans for integrating this into the framework, I'd be glad to help with further testing. :-)", "id": 122544, "time": "2008-11-17T02:40:46Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2008-11-17T02:40:46Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "helder.magalhaes@gmail.com", "attachment_id": 22559, "text": "Comment on attachment 22559\nPatch against trunk revision 694374\n\n>+    public static final String IMGMAP_STR = \"text/xml\";\n\nShould this be \"text/html\"? Original is more XHTML oriented, proposed is HTML compatible [1]. A recent FAQ [2] points out to \"application/xml\" or \"application/xhtml+xml\" for XHTML...\n\n\n>+    public static final String IMGMAP_EXTENSION = \".xml\";\n\nSame for \".html\" or \".xhtml\", if the HTML compatibility argumentation above makes sense...\n\n\n>+        mimeTypeMap.put(\"text/xml\", DestinationType.IMGMAP);\n\nSee above.\n\n\n>+ * @author <a href=\"mailto:[EMAIL PROTECTED]\";>Torsten Knodt</a>\n\nThis \"[EMAIL PROTECTED]\" suggests this was copied from a mailing list Web frontend (Nabble or such). Probably it would make sense to use the real email address in the final patch version or use some other kind of protection (person at domain dot suffix).\n\n\n>+    private final String XHTML_URI = \"http://www.w3.org/1999/xhtml\";;\n[...]\n>+    private final String XHTML_SYSID = \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\";;\n\nTypos: semicolon twice.\n\n\n>+        // FIXME: ID/ name attribute must be added to map element to make output valid\n\nFew comments like this one... Is this really a problem?\n\n\n>+        // We could also use xlink:title, but I think svg:desc is better.\n\nIt might make sense to use a combination of both. An accessibility page (see \"Assumptions\" section [3]) describes the expected behavior.\n\n\n>+        // Here svg:title should be used instead of svg:desc, I think. Perhaps xlink:title would also be an idea.\n\nSee above.\n\n\n>+\t\t\tthrow new TranscoderException (\"Line segment not allowed at begin of path\");\n\nFor simplification or by any known limitation? Couldn't this line segment simply be part of the \"coords\" attribute?\n\n\n>+\t\t\tthrow new TranscoderException (\"Move segment only allowed at begin of path\");\n\nI guess this could be added a TODO item as I quickly thought of a possible workaround: for each \"move to\" path command, an additional shape needed to be produced. I'm not sure if this is a good idea though (much more mark up being generated, while throwing an exception makes sure the user is aware of this limitation. Does this make sense to address?\n\nFinally, I'm not sure if anything relevant could or should be made in order to make the output HTML5-compliant [4]... ;-)\n\nThanks for sharing, I hope this can be further reviewed/updated so this neat feature can make it to the trunk. :-)\n\nCheers,\n\n Helder Magalhães\n\n\n[1] http://www.w3.org/TR/xhtml-media-types/\n[2] http://wiki.whatwg.org/wiki/HTML_vs._XHTML#MIME_Types\n[3] http://www.w3.org/Graphics/SVG/IG/wiki/Accessibility_Activity#Title_As_Tooltip\n[4] http://www.w3.org/TR/html5/the-canvas.html#shape", "id": 124371, "time": "2009-01-26T08:59:17Z", "bug_id": 45783, "creation_time": "2009-01-26T08:59:17Z", "is_private": false}]