[{"count": 0, "tags": [], "creator": "webmaster@korten-privat.de", "text": "I would like to achieve the following behavior:\n\nOn a http server, a subdirectory should only be accessible via https\nIf http is tried, the user should be automatically redirected to the https page\n\nFrom the intranet the subtree is accessible without authentication\nFrom the internet the subtree needs authentication\n\nMy config:\n<Location /opendb>\n#   Network Access Control\n       Order Deny,Allow\n       Deny from all\n       Allow from 192.168.0\n       Allow from 127.0.0.1\n\n#   Authentication\n        AuthType Basic\n        AuthName \"Open Media Database\"\n        AuthUserFile /var/svn/conf/svnbackupusers\n        Require valid-user\n\n#   Allow Network Access and/or Basic Auth\n       Satisfy Any\n\n#   Require HTTPS and redirect if HTTP is used\n        SSLRequireSSL\n        SSLOptions +StrictRequire\n        ErrorDocument 403 /bin/httpsredirect.php\n</Location>\n\nThe behavior i get is the following:\nfrom the intranet (192.168.0.x) the page behaves as expected, redirecting the user to the https page without authentication\n\nhowever from the internet, the user is asked to authenticate, but is not redirected to the https page (resulting in plain text transfer of username and password)", "id": 120581, "attachment_id": null, "bug_id": 45801, "creation_time": "2008-09-13T13:39:35Z", "time": "2008-09-13T13:39:35Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 45801, "text": "This cannot work due to the order how both access checks are processed. The IP address check comes first and if it fails the SSL requirements will not be checked anymore. Thus no redirect happens.\nTry the following:\n\nRewriteCond %{HTTPS} =Off\nRewriteRule ^/opendb($|/.*) https://yourserver.com/opendb$1\n\n<Location /opendb>\n#   Network Access Control\n       Order Deny,Allow\n       Deny from all\n       Allow from 192.168.0\n       Allow from 127.0.0.1\n\n#   Authentication\n        AuthType Basic\n        AuthName \"Open Media Database\"\n        AuthUserFile /var/svn/conf/svnbackupusers\n        Require valid-user\n\n#   Allow Network Access and/or Basic Auth\n       Satisfy Any\n\n</Location>", "id": 120582, "time": "2008-09-13T14:08:17Z", "creator": "rpluem@apache.org", "creation_time": "2008-09-13T14:08:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45801, "text": "(In reply to comment #1)\n> This cannot work due to the order how both access checks are processed. The IP\n> address check comes first and if it fails the SSL requirements will not be\n> checked anymore. Thus no redirect happens.\n> Try the following:\n> \n> RewriteCond %{HTTPS} =Off\n> RewriteRule ^/opendb($|/.*) https://yourserver.com/opendb$1\n\nMy fault. It needs to be\n\nRewriteRule ^/opendb($|/.*) https://yourserver.com/opendb$1 [R,L]\n\nof course.\n\n\n", "id": 120583, "time": "2008-09-13T14:11:34Z", "creator": "rpluem@apache.org", "creation_time": "2008-09-13T14:11:34Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "webmaster@korten-privat.de", "is_private": false, "id": 120589, "time": "2008-09-14T05:27:20Z", "bug_id": 45801, "creation_time": "2008-09-14T05:27:20Z", "tags": [], "text": "I do not agree that this is a simple misconfiguration. Therefore I disagree with having this bug assigned the status resolved.\n\nReasons:\n1. If I use the suggested configuration, I get double log ins one to the http page and one to the https page. This is absolutely inacceptible because the reason for using https in the first place was to have the authentication transmitted ssl encrypted.\n2. I use Satisfy Any, so if the check for the ip address fails, apache should still check for SSL and authentication.\n3. The description of SSLOption  StrictRequire says:\n\"This forces forbidden access when SSLRequireSSL or SSLRequire successfully decided that access should be forbidden. Usually the default is that in the case where a ``Satisfy any'' directive is used, and other access restrictions are passed, denial of access due to SSLRequireSSL or SSLRequire is overridden (because that's how the Apache Satisfy mechanism should work.) But for strict access restriction you can use SSLRequireSSL and/or SSLRequire in combination with an ``SSLOptions +StrictRequire''. Then an additional ``Satisfy Any'' has no chance once mod_ssl has decided to deny access.\"\n\nWhich, to my understanding, means that if StrictRequire is on, it should not be possible to access the page without ssl at all, period. This is a feature which is security sensitive and should not fail to work!\n\nEspecially point 3 is, in my opinion a strong argument to reopen the bug."}, {"count": 4, "tags": [], "creator": "Liam@Morland.ca", "text": "The desire to redirect from http to https is a common one. Getting it right is important for security. One can use mod_rewrite to do this, but not if SSLRequireSSL is specified. One of the reasons for SSLRequireSSL is \"for defending against configuration errors that expose stuff that should be protected\". It's handy to have a simple, one-line configuration which provides that security.\n\nMy suggestion: create an optional parameter so that one could put in a config file \"SSLRequireSSL Redirect\". This would issue a redirect to non-SSL connections before any other access controls or authentication would be tested.", "id": 127681, "attachment_id": null, "bug_id": 45801, "creation_time": "2009-06-05T10:53:22Z", "time": "2009-06-05T10:53:22Z", "is_private": false}, {"count": 5, "tags": [], "creator": "sf@sfritsch.de", "attachment_id": null, "is_private": false, "id": 153395, "time": "2012-02-03T09:55:53Z", "bug_id": 45801, "creation_time": "2012-02-03T09:55:53Z", "text": "I think the bug here is that ssl_hook_Access runs as APR_HOOK_MIDDLE while it should run at APR_HOOK_FIRST (or even REALLYFIRST). ssl_hook_Access provides information (in the ssl-access-forbidden request note) that is used later by other hooks if StrictRequire is set. Therefore it is important that ssl_hook_Access is always run.\n\nAnother example: With this test config:\n\nSSLOptions +StrictRequire\n<Directory /opt/apache22/htdocs/test/strictrequire>\n    AuthBasicProvider       file\n    AuthName                \"strict require test\"\n    AuthType                basic\n    AuthUserFile            conf/users\n    Require user admin\n    Satisfy any\n    Deny from all\n    allow from 10.56.51.0/24\n    SSLRequire %{HTTP_REFERER} == \"foo\"\n</Directory>\n\nIf I make a request where neither SSLRequire nor the ip restriction is fulfilled, it depends on the load order of mod_ssl and mod_authz_host if I get a \"Forbidden\" or a \"Authorization Required\". Different behavior depending on the load order is always a bug, IMHO.\n\nSSLRequire and SSLRequireSSL are equivalent with respect to this bug because they are both checked in ssl_hook_Access."}]