[{"count": 0, "tags": [], "bug_id": 45826, "attachment_id": null, "is_private": false, "id": 120711, "time": "2008-09-17T08:33:18Z", "creator": "sac@cse.unl.edu", "creation_time": "2008-09-17T08:33:18Z", "text": "I've recently been experiencing apache crashes when a system-wide per-user process limit is reached.  I have confirmed that if a per-user limit is set and the parent apache process spawns as many children as this limit, one of the child processes will die and the parent will then exit.\n\nHere is a pertinent section of my log files:\n\n[Wed Sep 17 09:35:47 2008] [alert] (11)Resource temporarily unavailable: setuid:\n unable to change to uid: 33\n[Wed Sep 17 09:35:47 2008] [alert] (11)Resource temporarily unavailable: setuid:\n unable to change to uid: 33\n[Wed Sep 17 09:35:47 2008] [alert] (11)Resource temporarily unavailable: setuid:\n unable to change to uid: 33\n[Wed Sep 17 09:35:47 2008] [alert] Child 7038 returned a Fatal error... Apache i\ns exiting!\n\n\nI have duplicated this behavior by setting the per-user process limit to 64 in two different versions of Open SuSE Linux (10.3 and 11.0) x86_64 and Debian on Power PC and with apache versions 2.2.3, 2.2.4 and 2.2.8.  Under Debian, this behavior will not manifest itself unless a \"ulimit -u 64\" is inserted into the apache2ctl script.\n\nOnce started with a process limit, I can then access a simple \"Hello World\" cgi script repeatedly using ab2 (e.g. \"ab2 -n 512 -c 512 http://server.com/~user/index.cgi\") and the errors above will show up in the logs.\n\nAt that point, all of the orphaned apache processes are inherited by init and it is necessary to kill them manually before I can restart apache.\n\nIt is necessary to have per-user process limits in our environment.\n\nI have not attempted to duplicate this behavior on a non-Linux OS."}, {"count": 1, "tags": [], "bug_id": 45826, "attachment_id": null, "is_private": false, "id": 120714, "time": "2008-09-17T09:14:16Z", "creator": "nick@webthing.com", "creation_time": "2008-09-17T09:14:16Z", "text": "Crash?  What crash?  Are you saying it segfaults or something?\n\nThe log entries posted look like apache exiting in an orderly manner, on being unable to start due to resource limitations!"}, {"count": 2, "tags": [], "text": "(In reply to comment #1)\n> Crash?  What crash?  Are you saying it segfaults or something?\n> \n> The log entries posted look like apache exiting in an orderly manner, on being\n> unable to start due to resource limitations!\n> \n\nWell, our web server stops running when it gets a large number of requests and can't be stopped or restarted through normal init scripts.   This seems like a crash to me.\n\nThanks for the reply, I appreciate the time and thought that you put into helping out.\n", "is_private": false, "bug_id": 45826, "id": 120718, "time": "2008-09-17T12:02:31Z", "creator": "sac@cse.unl.edu", "creation_time": "2008-09-17T12:02:31Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "System limits you configure apply to Apache.", "is_private": false, "bug_id": 45826, "id": 149420, "time": "2011-09-17T19:43:27Z", "creator": "covener@gmail.com", "creation_time": "2011-09-17T19:43:27Z", "attachment_id": null}]