[{"attachment_id": null, "tags": [], "creator": "langel@redhat.com", "is_private": false, "count": 0, "id": 120749, "time": "2008-09-18T09:39:21Z", "bug_id": 45835, "creation_time": "2008-09-18T09:39:21Z", "text": "Description of problem:\n\nWhen using fop to create a PDF document from DocBook XML, some (but not most)\nJPEG images are scaled up instead of being shown at 100%. In this test case,\nthis results in only a small part of the image being shown on the page.\n\nThis image was created from a .png (which had transparency, I think, in case\nthat is interesting), with imagemagick's convert command, and then scaled down\nwith imagemagick's \"mogrify --resize 450x450\" command. It seems to be that\nresizing that made an image that causes problems for fop, though fop has no\nproblem with other images that were processed in the same way.\n\nOther applications, such as eog, have no problem with this file.\n\n(I did the conversion to JPEG because of bug #461740, and I did the resizing\nbecause I see no other way to tell fop, or the DocBook XSL, to fit the images\non the page without cropping.)\n\n\nSteps to Reproduce:\n\n1. Unpack this tarball:\nhttp://www.murrayc.com/temp/docbook_fop_jpeg_test.tar.gz\n(I would attach it but that does not work in this bugzilla for tarballs.)\n\n2. cd into the directory\n\n3. Do:\nxsltproc -o flumotion.fo -xinclude --catalogs\nhttp://docbook.sourceforge.net/release/xsl/current/fo/docbook.xsl flumotion.xml \n\n4: Do:\nfop -fo flumotion.fo -pdf flumotion.pdf\n\nThe tarballs contains the generated PDF so you can see the result without even\ndoing that."}, {"count": 1, "tags": [], "text": "\nIt's always helpful (or: more convenient for us) to simply attach the FO-result. From that, even when we don't have the images, most fop-devs can immediately see possible causes for your issue.\n\nI suggest you look at any content-height/content-width properties specified on the external-graphics. If they are set to 'scale-to-fit', then a smaller JPEG will always be blown up until it fits exactly in the viewport (determined by width/height specified on the fo:external-graphic)\n\nHow to customize Docbook to make sure content-height/content-width are set to 'scale-down-to-fit' (XSL 1.1; should work with FOP Trunk, maybe not yet in 0.95), is something I personally cannot help you with, unfortunately. In your description, it seems like that is exactly what you need: if the image is larger, then shrink it, otherwise maintain its intrinsic dimensions.\n\nIf you only need the larger images to be clipped, then setting overflow=\"hidden\" on the external-graphic would be enough (no scaling needed).\n\nCan you let us know if this helped? Seems like it's not a bug, but simply compliant behavior.", "attachment_id": null, "bug_id": 45835, "id": 120751, "time": "2008-09-18T10:01:22Z", "creator": "adelmelle@apache.org", "creation_time": "2008-09-18T10:01:22Z", "is_private": false}, {"count": 2, "tags": [], "creator": "langel@redhat.com", "attachment_id": 22602, "id": 120753, "time": "2008-09-18T10:38:04Z", "bug_id": 45835, "creation_time": "2008-09-18T10:38:04Z", "is_private": false, "text": "Created attachment 22602\nfo-result"}, {"count": 3, "tags": [], "text": "Created attachment 22603\npdf created", "attachment_id": 22603, "id": 120754, "creator": "langel@redhat.com", "time": "2008-09-18T10:38:15Z", "bug_id": 45835, "creation_time": "2008-09-18T10:38:15Z", "is_private": false}, {"count": 4, "tags": [], "text": "I attached the fo-result. Is there a problem with it?\n\nthanks for the description. I will pass this on to the reporter.", "attachment_id": null, "bug_id": 45835, "id": 120755, "time": "2008-09-18T10:41:15Z", "creator": "langel@redhat.com", "creation_time": "2008-09-18T10:41:15Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "adelmelle@apache.org", "is_private": false, "count": 5, "id": 120762, "time": "2008-09-18T13:44:35Z", "bug_id": 45835, "creation_time": "2008-09-18T13:44:35Z", "text": "\nThanks for the attachments. This seems a bit weird indeed. With all values set to \"auto\", FOP has no reason to scale the image at all...\n\nJust confirmed with FOP Trunk on Mac. The JPEG reports a size of 198x450 pixels at 88,9 dots-per-inch in Preview. A quick debug session shows that XML Graphics' ImageInfo also reports this height/width in pixels, but... with an apparent resolution of 13.7795dpi (misread somehow?), which makes the image about 14.37in high (= 1034.578pt = (198px/13.7795dpi) * 72dpi).\n\nFOP itself is not at fault here... Seems like an issue in XMLGraphics Commons. Anyone?"}, {"count": 6, "tags": [], "bug_id": 45835, "attachment_id": null, "is_private": false, "id": 120772, "time": "2008-09-19T00:09:20Z", "creator": "jeremias@apache.org", "creation_time": "2008-09-19T00:09:20Z", "text": "This is indeed a problem in XML Graphics Commons but it was transported over from FOP when the image loading framework was extracted from the old image loading code in FOP. I already have a fix. Will commit shortly."}, {"count": 7, "tags": [], "text": "Looks like I introduced that bug back in 2005 when I added support for reading the resolution in a JPEG file:\nhttps://svn.apache.org/viewvc?view=rev&revision=198294\n\nAnd then, this migrated over into the new image loading framework. But it is fixed now:\nhttp://svn.apache.org/viewvc?rev=696949&view=rev\n\nThanks for the detailed error report!", "attachment_id": null, "id": 120773, "creator": "jeremias@apache.org", "time": "2008-09-19T00:17:01Z", "bug_id": 45835, "creation_time": "2008-09-19T00:17:01Z", "is_private": false}]