[{"count": 0, "tags": [], "bug_id": 45839, "attachment_id": null, "text": "It might be useful to be able to exit a loop prematurely.", "id": 120766, "time": "2008-09-18T15:30:02Z", "creator": "sebb@apache.org", "creation_time": "2008-09-18T15:30:02Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 45839, "is_private": false, "id": 120848, "time": "2008-09-22T05:41:01Z", "creator": "rob.say@fineos.com", "creation_time": "2008-09-22T05:41:01Z", "tags": [], "text": "More than 'might be useful'(!)\n\nIn load testing of complex web applications with multiple scenarios consisting of multiple steps, the inability to terminate a loop is a big issue.\n\nIn order to end a loop based on a response (i.e. as part of the test design), a complex arrangement of controllers can sometimes be arranged (While, If etc).\n\nTerminating a iteration loop in the event of error is next to impossible. Failure of a single test step frequently leads to a cascade failure of remaing steps in the loop. The problem is that this skews the results. What is in fact 1 error gets reported as many problems.\n\nThe ability to exit a loop (but maintain the thread) should be accessible programatically (beanshell?) and embedded within controllers (terminate loop on error)"}, {"count": 2, "tags": [], "text": "Looks like this could be related to: #30563\n\n(Although the fix attached to that issue appears to be doing something slightly different to the functionality described in the request)", "attachment_id": null, "id": 120849, "creator": "rob.say@fineos.com", "time": "2008-09-22T05:46:54Z", "bug_id": 45839, "creation_time": "2008-09-22T05:46:54Z", "is_private": false}, {"count": 3, "tags": [], "text": "Yes, Bug 30563 is slightly different in that it skips to the next iteration of the enclosing loop, rather than exitting the loop entirely.\n\nIt would be useful to have both NEXT and LAST functionality.\n\nMaybe the NEXT patch can be extended.\n\nAs to BeanShell access, that should be fairly trivial to arrange once the functionality has been added.", "attachment_id": null, "id": 120853, "creator": "sebb@apache.org", "time": "2008-09-22T06:32:36Z", "bug_id": 45839, "creation_time": "2008-09-22T06:32:36Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 45839, "attachment_id": null, "is_private": false, "id": 120871, "time": "2008-09-23T04:03:38Z", "creator": "sebb@apache.org", "creation_time": "2008-09-23T04:03:38Z", "text": "Unfortunately, the patch provided in bug 30563 does not work properly."}, {"count": 5, "tags": [], "bug_id": 45839, "attachment_id": null, "id": 151405, "time": "2011-11-11T15:49:52Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-11-11T15:49:52Z", "is_private": false, "text": "Start next loop option has now been fixed.\n\n*** This bug has been marked as a duplicate of bug 30563 ***"}, {"count": 6, "tags": [], "bug_id": 45839, "attachment_id": null, "id": 152366, "time": "2011-12-22T11:21:04Z", "creator": "tedam@mail.ru", "creation_time": "2011-12-22T11:21:04Z", "is_private": false, "text": "\"Start next loop\" - good, but it is not the same as \"exit from loop\"\nIn some cases it is needed to exit loop.\nNow we can use \"While\" controller with condition, and inside this controller we can set some flag so at next time condition of \"while\" controller will become false and loop will interrupt.\nBut it would be more clear and more comfortable to use \"loop controller\", and exit from loop by condition inside loop...\nIs it planned to do it?"}, {"count": 7, "tags": [], "text": "I would like to see this reopened to cover starting the next thread loop without registering a sample error.  Per comment 3 this is different from what's offered by bug 30563.\n\nIn my test plan I have a login fragment that chooses a random user from all possible users in my test data.  A few of these users are setup with no data, which is a valid scenario in production for brand new users.  In this case they are given a no-data page in response to logging in as there is no functionality yet available for them.  I then have thread groups for each of my test scenarios that include the login fragment.\n\nIf I use an assertion to fail the login fragment when the no data page is returned, and the Start Next Thread option on the thread group from bug #30563, the issue is the Summary Report and View Results Tree listeners show the no data cases as errors, which they are not.\n\nThe only other option I can think of is to capture the no-data state with a post-processor, and use an If controller in every single thread group that uses my login fragment to test for the no data scenario before proceeding.  This is a lot of duplication in my test plan.\n\nIf I could place that If controller in the fragment, and use a \"Start Next Thread Loop\" Test Action that might do the trick.  If I could flag a given assertion to not register as a sample error, but still trigger the thread group's \"Start Next Loop\" functionality that might also do.\n\nReferring to comment 3 I can also see a use for a \"Start Next Loop\" Test Action that would apply to the closest loop controller, or the thread loop as applicable (basically the equivalent of the \"continue\" keyword in Java).", "is_private": false, "id": 153202, "creator": "ian@ianbrandt.com", "time": "2012-01-26T22:53:25Z", "bug_id": 45839, "creation_time": "2012-01-26T22:53:25Z", "attachment_id": null}, {"count": 8, "tags": [], "text": "I have a fix for this one, will commit it once 2.6 vote is done.", "attachment_id": null, "id": 153261, "creator": "p.mouawad@ubik-ingenierie.com", "time": "2012-01-29T18:12:47Z", "bug_id": 45839, "creation_time": "2012-01-29T18:12:47Z", "is_private": false}, {"count": 9, "tags": [], "text": "Date: Thu Feb  2 12:50:53 2012\nNew Revision: 1239590\n\nURL: http://svn.apache.org/viewvc?rev=1239590&view=rev\nLog:\nBug 45839 - Test Action : Allow premature exit from a loop\n\nModified:\n   jmeter/trunk/src/components/org/apache/jmeter/sampler/TestAction.java\n   jmeter/trunk/src/components/org/apache/jmeter/sampler/gui/TestActionGui.java\n   jmeter/trunk/src/core/org/apache/jmeter/resources/messages.properties\n   jmeter/trunk/src/core/org/apache/jmeter/resources/messages_fr.properties\n   jmeter/trunk/src/core/org/apache/jmeter/threads/JMeterContext.java\n   jmeter/trunk/src/core/org/apache/jmeter/threads/JMeterThread.java\n   jmeter/trunk/xdocs/changes.xml", "attachment_id": null, "id": 153367, "creator": "p.mouawad@ubik-ingenierie.com", "time": "2012-02-02T12:53:33Z", "bug_id": 45839, "creation_time": "2012-02-02T12:53:33Z", "is_private": false}]