[{"count": 0, "tags": [], "bug_id": 45865, "attachment_id": null, "id": 120880, "time": "2008-09-23T05:59:32Z", "creator": "pierre.lavignotte@gmail.com", "creation_time": "2008-09-23T05:59:32Z", "is_private": false, "text": "When a formula contains a reference to an external file/sheet/cell, the parser ignores the external file reference and only parses the sheet/cell reference.\n\nIf the index of the original sheet is greater than the maximum index of the sheets of the current workbook, an IndexOutOfBoundException occurs.\n\nExemple :\nWorkbookA has two sheets named Sheet1 & Sheet2\nWorkbookB has only one sheet named Sheet1\n\nIn workbook B :\nThe formula '[WorkbookA]Sheet1!$A$1' will be correctly parsed but will point to cell A1 in WorkbookB.\nthe formula '[WorkbookA]Sheet2!$A$1' will fail to parse because it will point to the second sheet of WorkbookB, wich doesn't exist.\n\nIf WorkbookB contains 2 formulas :\nA2 = '[WorkbookA]Sheet1!$A$1'\nA3 = '[WorkbookA]Sheet2!$A$1'\n\nDebuging the A2 cell record shows :\nPtg(0)=org.apache.poi.hssf.record.formula.Ref3DPtg [sheetIx=2 ! $A$1]\nSo it makes evaluation to fail also.\n\nThe attached sample shows a formula that evaluate in the wrong workbook."}, {"count": 1, "tags": [], "creator": "pierre.lavignotte@gmail.com", "attachment_id": 22625, "text": "Created attachment 22625\nSample code and workbook to reproduce bug", "id": 120881, "time": "2008-09-23T06:00:30Z", "bug_id": 45865, "creation_time": "2008-09-23T06:00:30Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 45865, "text": "Fixed in svn r699761.\n\nQuite a lot of stuff needed to be done to get your test code working.  \n\nFormula rendering was fixed so that external references get rendered with workbook name (as Excel does)\n\nThe formula parser can now parse external references properly (as long as the same workbook+sheet combination already exists in the LinkTable). HSSFWorkbook probably still needs modifying to allow creation of new external references.\n\nThe formula evaluator was extended to allow evaluation of formulas across multiple workbooks (see TestWorkbookEvaluator.testEvaluateMultipleWorkbooks()).  We probably need to add examples for this functionality to the POI documentation.\n\njunits added", "id": 121041, "time": "2008-09-27T19:13:20Z", "creator": "josh@apache.org", "creation_time": "2008-09-27T19:13:20Z", "is_private": false, "attachment_id": null}]