[{"count": 0, "tags": [], "bug_id": 45866, "attachment_id": 22626, "id": 120890, "time": "2008-09-23T08:43:49Z", "creator": "dmadole@iodalliance.com", "creation_time": "2008-09-23T08:43:49Z", "is_private": false, "text": "Created attachment 22626\nMulti-sheet Excel Workbook with TextObject that seems to break parser\n\nThis refers to the thread \"Unable to construct record instance: compressByte in continue records must be 1 while reading unicode LE string\" on the user mailing list.\n\nUsing 3.2 alpha1 0922 build, this file throws an exception when, I\nbelieve, it gets to the big TextObject in the \"Home\" sheet--although it \ncould be the object with the big text, using the XLS2CSVmra \neventmodel example app.\n\nFile was created on a PC, parsing fails on Unbuntu Linux box.\n\nSee user list posting with same subject for more details.\n\nSubmitted at the request of Nick Burch.\n\nDave Madole"}, {"count": 1, "text": "I have another excel file that provokes this bug. (Unfortunately, I can't attach it here since it contains confidential data of one of our customers.)\nBoth the file posted here and my example file also cause problems with the windows  indexing service: The service process apparantly tries to index these files, but never again releases the file handles - once this happens, you can't move or delete these files anymore unless you stop the indexing service. (Both files don't show any problems when you open them in Excel or OpenOffice.org.)", "creator": "H.Uhr@Ceyoniq.com", "attachment_id": null, "id": 121333, "time": "2008-10-09T02:39:13Z", "bug_id": 45866, "creation_time": "2008-10-09T02:39:13Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "Fixed in svn r703620.\n\nJunit added\n\nThe OOO documentation also mentions that the unicode compression can change across Continue records.\n\n", "attachment_id": null, "id": 121432, "creator": "josh@apache.org", "time": "2008-10-10T18:17:20Z", "bug_id": 45866, "creation_time": "2008-10-10T18:17:20Z", "is_private": false}]