[{"count": 0, "tags": [], "creator": "domenico.napoletano@exprivia.it", "attachment_id": 22629, "is_private": false, "id": 120920, "time": "2008-09-24T07:11:44Z", "bug_id": 45877, "creation_time": "2008-09-24T07:11:44Z", "text": "Created attachment 22629\nWord document causing NullPointerException\n\nAttached document, scanning its parts with QuickTest, results in a java.lang.NullPointerException\n\tat org.apache.poi.hwpf.sprm.ParagraphSprmUncompressor.uncompressPAP(ParagraphSprmUncompressor.java:50)\n\tat org.apache.poi.hwpf.model.PAPX.getParagraphProperties(PAPX.java:135)\n\tat org.apache.poi.hwpf.usermodel.Range.getParagraph(Range.java:822)\n\tat org.apache.poi.hwpf.QuickTest.main(QuickTest.java:45)\n\nAfter some debugging, I found that\n\n1) the istd value for problematic paragraph style is 10\n2) in getParagraphProperties method, baseStyle is null, and then in uncompressPAP method, the null variable causing the exception is \"parent\"\n3) During StyleSheet constructor execution (the istd of problematic style is 10), _parahraphDescriptions[10] is not null, but _parahraphDescriptions[10]getPap() returns null\n4) in createPAP(10) (called by the second loop in constructor), \"pap\" and \"papx\" local variables are *both* null, then createPAP does not create the PAP for istd=10\n\nA more weird thing is that, deleting or changing other document parts, for example removing other paragraphs, the crash disappears..."}, {"count": 1, "tags": [], "creator": "cwalter@docfinity.com", "attachment_id": 23783, "id": 127772, "time": "2009-06-09T13:58:00Z", "bug_id": 45877, "creation_time": "2009-06-09T13:58:00Z", "is_private": false, "text": "Created attachment 23783\nPatch that modifies stylesheets.\n\nDuring the initialization of \"org.apache.poi.hwpf.model.StyleSheet\" POI runs through all the style descriptions and adds them to the StyleDescription array in the createPAP method. If a description has an improperly set parent (ie it's parent is null) it still tries to run the ParagraphSprmUncompressor. Doing so attempts to clone the parent and throws a Null Pointer exception. The attached patch simply blocks the running of the uncompressor if the parent is null. I've tested this and it passes all tests and fixes the previously attached document as well as some of my own.\n\nIf this fixed in deemed inappropriate, please do not fix with a Runtime error. The documents contents have still been loaded correctly and should still be useable in certain contexts."}, {"count": 2, "tags": [], "bug_id": 45877, "is_private": false, "id": 129384, "creation_time": "2009-08-02T12:07:16Z", "time": "2009-08-02T12:07:16Z", "creator": "aduffy@simiolus.com", "text": "Created attachment 24082\nPatches PAPX.java to avoid NPE when a paragraph's PAPX is based upon a character style\n\nI've encountered this error while decoding .doc files saved by OpenOffice Writer. Some paragraphs have a PAPX with an istd that is a character style, and PAPX.getParagraphProperties throws an NPE as a result.\n\nI've attached a patch to PAPX.java to work around this. I don't think Chris Walter's patch to StyleSheet.java is necessary.", "attachment_id": 24082}, {"text": "I've just tried opening your document with POI on svn head, and it was loaded fine, and we could get the text without error. Looks like the bug was fixed at some point between when you reported this and today.", "tags": [], "bug_id": 45877, "attachment_id": null, "count": 3, "id": 139956, "time": "2010-09-19T07:53:03Z", "creator": "apache@gagravarr.org", "creation_time": "2010-09-19T07:53:03Z", "is_private": false}]