[{"count": 0, "tags": [], "text": "Created attachment 22627\nPatch for DataSourceRealm (trunk)\n\nSimple hashing of passwords stored in databases is no longer sufficient security for passwords. The root of the issue is that users are bad at remembering strong passwords, so they choose weak ones. Weak passwords when hashed can be reversed using available rainbow tables and cracking software. To combat this, passwords should be uniquely \"salted\" before being hashed and stored in the database. \n\nThe attached patch enhances DataSourceRealm to allow it to authenticate against a salted digested password. If configured to use salt, the user's salt is queried from the database and then combined with the user's provided credentials using a configurable MessageFormat before digesting. Authentication proceeds otherwise unchanged.\n\nA similar patch could, and arguably should, be applied to JDBCRealm, but based on some discussion on the list about deprecating JDBCRealm (and because I don't use JDBCRealm personally), I did not work on JDBCRealm. I would be happy to port this patch to JDBCRealm if that's desired.\n\nLimitation(s):\n\nThis patch does not impact the behavior of the RFC 2069 authentication method in RealmBase.\n\nIf/when this patch is accepted, the documentation for DataSourceRealm will need to be updated. I'll gladly volunteer to do those updates as well.\n\nhttp://en.wikipedia.org/wiki/Salt_(cryptography)\nhttp://en.wikipedia.org/wiki/Rainbow_table", "attachment_id": 22627, "bug_id": 45871, "id": 120905, "time": "2008-09-23T21:46:21Z", "creator": "brandond@alum.mit.edu", "creation_time": "2008-09-23T21:46:21Z", "is_private": false}, {"count": 1, "tags": [], "text": "I'd love to see the salt feature applied.", "attachment_id": null, "bug_id": 45871, "id": 139522, "time": "2010-08-27T14:00:42Z", "creator": "wesley.acheson@gmail.com", "creation_time": "2010-08-27T14:00:42Z", "is_private": false}, {"count": 2, "tags": [], "text": "The duplicate has a more complete (covers more realms) and less invasive (doesn't require an additional column) patch.\n\n*** This bug has been marked as a duplicate of bug 51966 ***", "attachment_id": null, "bug_id": 45871, "id": 151020, "time": "2011-10-28T22:14:06Z", "creator": "markt@apache.org", "creation_time": "2011-10-28T22:14:06Z", "is_private": false}]