[{"count": 0, "tags": [], "bug_id": 45909, "is_private": false, "text": "When opening a spreadsheet that contains formulas which use ';' as argument delimiter, I get a FormulaParseException.\n\nFor example:\n\norg.apache.poi.hssf.model.FormulaParser$FormulaParseException: Parse error near char 19 ';' in specified formula 'ROUND((K1171/X1171);1)'. Expected ',' or ')'\n\tat org.apache.poi.hssf.model.FormulaParser.expected(FormulaParser.java:139)\n\tat org.apache.poi.hssf.model.FormulaParser.Arguments(FormulaParser.java:410)\n\tat org.apache.poi.hssf.model.FormulaParser.function(FormulaParser.java:308)\n\n\nThis was not the case in version 2.5 of POI. Is there a particular reason that \"isArgumentDelimiter\" does not accept \";\"?\n\n    private static boolean isArgumentDelimiter(char ch) {\n        return ch ==  ',' || ch == ')';\n    }\n\nIt is quite a big task if we have to run through all our template XLS-files to check for formulas and update the delimiters...\n\nKind regards\nTorben", "id": 121060, "time": "2008-09-29T04:26:59Z", "creator": "torben.wolm@LEGO.com", "creation_time": "2008-09-29T04:26:59Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "POI consistently treats formula argument delimiters as commas. Depending on internationalisation settings Excel will use ',' or ';' (but never both).  In other words, you can enter a formula with POI using commas, and it *may* display in Excel with semicolons. Conversely, a formula entered in Excel with semi-colons will render with commas in POI.\n\nThe choice of comma or semi-colon is not encoded in the excel files at all.  On windows systems, it is found in the 'Regional and Language Options' of Control Panel.  (So you don't need to worry about converting any XLS files).\n\nThe only way this exception can occur is if you supply a formula to POI using semicolons.  An easy work around is to make sure you use commas as argument delimiters in any formulas you manipulate with java code.  Were you doing something else?  If so, can you re-open and supply more details (full POI stack trace, sample code, sample files)?\n\nUse of semicolons in formulas was already mentioned in bug 45025.  Adding an internationalision feature to POI is possible, but probably not worth the effort.\n", "is_private": false, "id": 121065, "creator": "josh@apache.org", "time": "2008-09-29T14:25:55Z", "bug_id": 45909, "creation_time": "2008-09-29T14:25:55Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45909, "is_private": false, "text": "*** Bug 49457 has been marked as a duplicate of this bug. ***", "id": 137723, "time": "2010-06-17T13:50:53Z", "creator": "josh@apache.org", "creation_time": "2010-06-17T13:50:53Z", "attachment_id": null}]