[{"attachment_id": null, "tags": [], "bug_id": 45922, "is_private": false, "count": 0, "id": 121102, "time": "2008-09-30T11:06:18Z", "creator": "cantor.2@osu.edu", "creation_time": "2008-09-30T11:06:18Z", "text": "The various processing steps that take place when mod_ssl evaluates a client certificate are rather unclear when optional_no_ca is used. In particular, certain conditions that shouldn't cause a problem still fail the request, such as limitations on \"depth\" of the chain, an expired certificate, or an inability to find an intermediate CA that issued the client's certificate.\n\n(Various versions of Apache/mod_ssl have different behavior, so some of those limitations may be corrected now.)\n\nBut in most cases, what's desired by \"no_ca\" is for mod_ssl to get out of the way. We have applications that need to make their own rules, and may not be relying on any kind of traditional certificate evaluation at all.\n\nMy suggestion is that instead of treating only a limited number of \"error\" conditions as \"ignorable\", using the ssl_verify_error_is_optional() macro, that this be removed as a criteria.\n\nOther changes may also be needed to eliminate other non-error conditions from stopping the connection.\n\nThe only real requirement mod_ssl should have is that OpenSSL knows the peer used the private key corresponding to the certificate, which I believe is implicit in the API. All of the certificate content should be ignorable.\n\nBasically, no_ca should mean no_ca, not \"some things are ok, but not others\". If this is deemed a change to the behavior, then adding a new value for SSLVerifyClient would also be a reasonable way to address it, perhaps something called \"optional_accept\".\n\nBut I think as it stands that the no_ca option is a bit ill-defined, and my project (Shibboleth) has been seeing a lot of anomalous results using it."}, {"count": 1, "tags": [], "text": "*** Bug 46897 has been marked as a duplicate of this bug. ***", "is_private": false, "id": 136101, "creator": "apache-bugzilla@PaulSD.com", "time": "2010-04-13T15:39:22Z", "bug_id": 45922, "creation_time": "2010-04-13T15:39:22Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "I concur.  I have an application that does it's own independent validation and trust checking of the client's certificate, and there are cases where Apache's validation fails and disconnects the client even though I actually want it to ignore the error and let my application deal with it.  I still believe the optional_no_ca option is valuable (I think the intent there is to accept valid but untrusted certificates, which is different from accepting invalid certificates), so this should probably be implemented as a new option.\n\nI'm attaching two patches (one that applies against 2.2.x and one that applies against trunk) to address this.  These patches add a new SSLVerifyClient option ('optional_no_verify') which will accept the certificate regardless of the validation result.  These patches include updated documentation which better describes the various SSLVerifyClient options and also corrects the ambiguities in the SSLProxyVerify documentation (which looks like it was copied and pasted from the SSLVerifyClient documentation).  These patches also correct the SSL_CLIENT_VERIFY variable so that it actually contains GENEROUS when verification fails but is accepted anyway (as per the existing documentation, see bug #45054), and so that it contains the verification error message if verification failed but was accepted anyway.", "is_private": false, "id": 136148, "creator": "apache-bugzilla@PaulSD.com", "time": "2010-04-14T11:25:28Z", "bug_id": 45922, "creation_time": "2010-04-14T11:25:28Z", "attachment_id": null}, {"count": 3, "attachment_id": 25297, "bug_id": 45922, "is_private": false, "id": 136149, "time": "2010-04-14T11:27:56Z", "creator": "apache-bugzilla@PaulSD.com", "creation_time": "2010-04-14T11:27:56Z", "tags": [], "text": "Created attachment 25297\nPatch for trunk"}, {"count": 4, "tags": [], "bug_id": 45922, "attachment_id": 25298, "text": "Created attachment 25298\nPatch for 2.2.x", "id": 136150, "time": "2010-04-14T11:28:30Z", "creator": "apache-bugzilla@PaulSD.com", "creation_time": "2010-04-14T11:28:30Z", "is_private": false}, {"count": 5, "tags": [], "creator": "apache-bugzilla@PaulSD.com", "text": "Note that if verification fails for multiple reasons and optional_no_ca or optional_no_verify is used, only the first verification error message is provided in the SSL_VERIFY_CLIENT message produced by this patch.  I wasn't sure how to fit this detail into the documentation, so I left it out.", "id": 136151, "time": "2010-04-14T11:33:49Z", "bug_id": 45922, "creation_time": "2010-04-14T11:33:49Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "text": "Created attachment 25303\nPatch for trunk\n\nAdded an additional update to the documentation ... SSLProxyVerify and SSLProxyVerifyDepth are only valid in server/vhost config, not directory config.\n\nThey were originally defined in mod_ssl.c as valid only in the server/vhost config, but the documentation said they were also valid in directory config.  I don't think directory-level configuration makes much sense for these options, so I updated the documentation, but kept the existing definition in mod_ssl.c.", "is_private": false, "id": 136185, "creator": "apache-bugzilla@PaulSD.com", "time": "2010-04-15T10:03:51Z", "bug_id": 45922, "creation_time": "2010-04-15T10:03:51Z", "attachment_id": 25303}, {"count": 7, "tags": [], "creator": "apache-bugzilla@PaulSD.com", "text": "Created attachment 25304\nPatch for 2.2.x", "id": 136186, "time": "2010-04-15T10:04:36Z", "bug_id": 45922, "creation_time": "2010-04-15T10:04:36Z", "is_private": false, "attachment_id": 25304}, {"count": 8, "tags": [], "text": "Created attachment 25313\nPatch for trunk\n\nAdded some additional clarification to the documentation after consulting the TLS and SSLv2/v3 RFCs.", "is_private": false, "id": 136213, "creator": "apache-bugzilla@PaulSD.com", "time": "2010-04-16T18:06:17Z", "bug_id": 45922, "creation_time": "2010-04-16T18:06:17Z", "attachment_id": 25313}, {"count": 9, "tags": [], "creator": "apache-bugzilla@PaulSD.com", "text": "Created attachment 25314\nPatch for 2.2.x", "id": 136214, "time": "2010-04-16T18:08:31Z", "bug_id": 45922, "creation_time": "2010-04-16T18:08:31Z", "is_private": false, "attachment_id": 25314}, {"count": 10, "tags": [], "creator": "apache-bugzilla@PaulSD.com", "is_private": false, "text": "Created attachment 25539\nPatch for trunk\n\nUpdated patch that applies cleanly to the current trunk.", "id": 137413, "time": "2010-06-07T12:25:38Z", "bug_id": 45922, "creation_time": "2010-06-07T12:25:38Z", "attachment_id": 25539}, {"count": 11, "tags": [], "creator": "marc.stern@approach.be", "text": "We should also add the error code on top of the string message, this is much easier and safer to check in other places (other module, RewriteRule, etc.).", "id": 151365, "time": "2011-11-10T12:58:42Z", "bug_id": 45922, "creation_time": "2011-11-10T12:58:42Z", "is_private": false, "attachment_id": null}]