[{"count": 0, "tags": [], "bug_id": 45979, "attachment_id": null, "id": 121362, "time": "2008-10-09T12:39:32Z", "creator": "daniel.armbrust.list@gmail.com", "creation_time": "2008-10-09T12:39:32Z", "is_private": false, "text": "I just discovered that if you update your META-INF/context.xml, create a war file, put it into a stopped tomcat container, and delete the old expanded war file contents - when tomcat starts - it does not replace the Catalina/[hostname]/[appname].xml file when the war file is deployed.  It remains the file from the previous (now replaced) war file.\n\nI see this has come up before, and it was commented that that was a design decision.  https://issues.apache.org/bugzilla/show_bug.cgi?id=32284#c8\n\nI think that is wrong.  \n\nNow, rather than having a self-contained application - if I need to specify something in the context.xml file - I can't just put it there, and allow my installer programs to just put the war file in the correct place in tomcat.\n\nNow, my installer utilities must be smart enough to go find and delete the  Catalina/[hostname]/[appname].xml file every single time I make an update.\n\nWhy should the onus be on my installers to do that job?  I didn't even ask tomcat to put that file there in the first place.  I put it in META-INF/context.xml.  Tomcat copied it to the conf subfolder.  And now Tomcat neglects to copy the updated file there.  \n\nAdditionally, the documentation http://tomcat.apache.org/tomcat-5.5-doc/config/context.html for this context.xml feature makes no mention of the fact that it simply copies the file once (and only once - never noting future changes) into the server conf folder."}, {"count": 1, "tags": [], "bug_id": 45979, "is_private": false, "id": 121363, "creation_time": "2008-10-09T12:46:56Z", "time": "2008-10-09T12:46:56Z", "creator": "remm@apache.org", "text": "Too bad, I don't care ...", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45979, "text": "There is no need to add a committer as a cc to a bug. Doing this is considered extremely rude. We are all subscribed to the dev list and we all see every comment on every bug.\n\nThe design decision isn't going to change but we can make the documentation clearer.", "id": 121370, "time": "2008-10-09T15:00:19Z", "creator": "markt@apache.org", "creation_time": "2008-10-09T15:00:19Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "daniel.armbrust.list@gmail.com", "text": "Well, that explains his response, which I thought was rude :)\n\nI had no intention on being rude.  I only added him because he specifically said that he made the design decision in the other bug report, and I thought he might have some useful input as to why this should or shouldn't be changed.\n\nAnd I know that I certainly don't have time to pay attention to ever e-mail that comes into my bulk e-mail bins....\n\n\n\n\n", "id": 121373, "time": "2008-10-09T15:31:48Z", "bug_id": 45979, "creation_time": "2008-10-09T15:31:48Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 45979, "is_private": false, "text": "WRT the design, I do not know all of the other use cases.  I expect that this decision was arrived at to simplify complexity, or other reasonable reasons.\n\nBut from my use case, the behaviour certainly violates the Principals of Least Surprises.  \n\nIt seems that if Tomcat had a way to know that it placed a copy of the context.xml file into the conf subfolder, then it would be trivial to have it automatically replace it again, whenever it re-expands the war file.  Yes?\n\nAll that follows is based on what may be faulty guesses about how things currently work:\n\nSo the real issue becomes knowing if config file was placed in the conf subfolder by tomcat, or by an administrator?\n\nCouldn't Tomcat just place a flag (even just a comment - rather hackish but effective) into the xml file when it copies it?  Then later, check for the presence of that flag to determine if it should overwrite it when redeploying a war file?  No flag - current behaviour.  Flag - overwrite the file with the one from the war.\n\nIf the behaviour stays as it - is seems like tomcat should be throwing out a warning when it will be ignoring a context.xml file found in a war file, because one already existed in the conf subfolder.  Otherwise, users can run into all sorts of hard to track when the file they think is being used, isn't.\n", "id": 121374, "time": "2008-10-09T15:44:25Z", "creator": "daniel.armbrust.list@gmail.com", "creation_time": "2008-10-09T15:44:25Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 45979, "attachment_id": null, "id": 121397, "time": "2008-10-10T04:47:06Z", "creator": "markt@apache.org", "creation_time": "2008-10-10T04:47:06Z", "is_private": false, "text": "I have updated the 5.5.x, 6.0.x and trunk docs to clarify when the context.xml file is copied and when it isn't. \n\n*** This bug has been marked as a duplicate of bug 32284 ***"}]