[{"count": 0, "attachment_id": null, "bug_id": 45981, "is_private": false, "id": 121368, "time": "2008-10-09T14:38:49Z", "creator": "skillcoyne@systemsbiology.org", "creation_time": "2008-10-09T14:38:49Z", "tags": [], "text": "It has been necessary when using some web applications in tomcat to remove everything in the work/ and temp/ directories before restarting.  However, if the temp directory itself is removed it is not recreated causing web applications to throw java.io.IOExceptions when a user attempts to download a file.\n\njava.io.IOException: No such file or directory\n\tjava.io.UnixFileSystem.createFileExclusively(Native Method)\n\tjava.io.File.checkAndCreate(File.java:1704)\n\tjava.io.File.createTempFile(File.java:1793)\n\tjava.io.File.createTempFile(File.java:1830)\n\t....\n\nTomcat should be checking and recreating the temp directory if it is not there at start up."}, {"count": 1, "attachment_id": null, "creator": "markt@apache.org", "text": "You can't delete part of an installed application (in the case the temp directory) and expect it to continue to work.", "id": 121369, "time": "2008-10-09T14:56:44Z", "bug_id": 45981, "creation_time": "2008-10-09T14:56:44Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "skillcoyne@systemsbiology.org", "attachment_id": null, "text": "Then either 1) the temp directory needs to clear itself out when tomcat is stopped/started.  There are applications that do not work properly if this is not done (especially when dealing with jsp's). Or 2) Tomcat needs to check that all of it's directories are in place and fail to startup with an error if they aren't.  There were no errors in the logs after restarting several times.  \n\nThis cost me nearly a day in debugging an issue that does not exist in my code but was caused by someone messing up the distribution and tomcat not noticing.", "id": 121371, "time": "2008-10-09T15:02:06Z", "bug_id": 45981, "creation_time": "2008-10-09T15:02:06Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "re 1) The application that creates the files should be responsible for any necessary housekeeping. Tomcat can't make assumptions about what housekeeping is required.\n\nre 2) It isn't practical to test for every required file and library on startup. If Tomcat tried to use the temp directory and failed to log an error then if you provide enough details to reproduce the problem then an appropriate error message can be added. If it was web app code that tried to use temp and failed then the error handling needs to be added there.", "id": 121372, "time": "2008-10-09T15:25:59Z", "bug_id": 45981, "creation_time": "2008-10-09T15:25:59Z", "is_private": false}, {"text": "Closing assuming that it was the web applciation that failed to log that the temp diretcory was missing.", "tags": [], "bug_id": 45981, "is_private": false, "count": 4, "id": 122117, "time": "2008-11-01T17:56:49Z", "creator": "markt@apache.org", "creation_time": "2008-11-01T17:56:49Z", "attachment_id": null}]