[{"attachment_id": null, "tags": [], "bug_id": 45995, "is_private": false, "count": 0, "id": 121464, "time": "2008-10-13T04:32:38Z", "creator": "vitor.swaid@embraer.com.br", "creation_time": "2008-10-13T04:32:38Z", "text": "Hi,\n\nOn the dev-tomcat list I described in the topic \"Byte Serving and PDFs with the DefaultServlet\" an issue that I had with Tomcat to serve PDFs.\n\nAnalysing the answers I could find that the matter was related to the case of the file extension. Today Tomcat is case sensitive for MIME type extensions.\n\nSo the solution for me was enter two MIME specifications on the web.xml file. One is for \"pdf\" and another one for \"PDF\".\n\nThis way I would like to ask for and request for enhancement to make Tomcat be able to, due a setup on configuration file, consider or not case for MIME type extensions.\n\nRegards,\n\nVitor"}, {"count": 1, "tags": [], "bug_id": 45995, "text": "For reference:\nIn Apache HTTPD as of current 1.3 and 2.2 versions, the mime mappings are case-insensitive.\n\nSee:\nhttp://httpd.apache.org/docs/2.2/en/mod/mod_mime.html\nhttp://httpd.apache.org/docs/1.3/mod/mod_mime.html\n\nesp. see the AddType and TypesConfig directives", "id": 123706, "time": "2009-01-02T08:59:04Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2009-01-02T08:59:04Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 45995, "attachment_id": null, "id": 160393, "time": "2012-07-02T09:44:06Z", "creator": "markt@apache.org", "creation_time": "2012-07-02T09:44:06Z", "is_private": false, "text": "Fixed in trunk for Tomcat 8 onwards. From Tomcat 8, Tomcat will align with httpd and use a case-insensitive comparison.\n\nThere hasn't been much demand for this feature in the current Tomcat releases so I do not propose to back-port it since:\n- changing behaviour for stable releases may cause problems for existing applications\n- making it configurable adds unnecessary complexity\n\nIf demand does appear, then this can be back-ported but it would need to be configurable."}]