[{"count": 0, "tags": [], "bug_id": 46030, "attachment_id": 22749, "text": "Created attachment 22749\nCode to implement enhancement\n\nWe have a requirement to test a TCP service where data is exchanged in length-prefixed binary format.\n\nTo meet this need we have implemented the attached classes which we wish to submit for a future release of JMeter.  A brief description of the classes follows:\n\nBinaryTCPClientImpl\nConcrete class which implements TCPClient Interface and converts hex-encoded strings to byte array in \nwrite(OutputStream, String) and from byte array to hex-encoded string in read(InputStream). \nwrite(OutputStream, InputStream) is unsupported.\nContains utility method hexStringToByteArray(String s) which is a mirror of the JOrphanUtils.baToHexString(byte[]) method.  \n\nTCPClientDecorator\t\t\t\nAbstract class implementing TCPClient Interface. This is to allow wrapping of TCPClientImpl/BinaryTCPClientImpl above with length prefixing methods.\nContains two utility methods intToByteArray(int value, int len) and byteArrayToInt(byte[] b).  Methods support 2 and 4 and byte lengths only and throw an IllegalArgumentException in other cases.\n\nLengthPrefixedBinaryTCPClientImpl\nExtends TCPClientDecorator and instantiates decorator with BinaryTCPClientImpl.\nThe length to use in the prefix is taken from the properties file and defaults to 2.\nFor write(OutputStream os, String s) the length is calculated and written to the output stream then the method delegates to the BinaryTCPClientImpl write() method.\nread(InputStream is) is overridden.\nwrite(OutputStream os, InputStream is) is not supported.\n\nHave created JUnit tests for the three utility methods but not for the read/write implementations themselves.  These are in two test classes, BinaryTCPClientImplTest and TCPClientDecoratorTest.\n\nHave left the utility methods bundled with the client implementations to avoid modifying existing utility classes.", "id": 121650, "time": "2008-10-16T23:59:25Z", "creator": "osheehy@fexcodcc.com", "creation_time": "2008-10-16T23:59:25Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 46030, "attachment_id": null, "text": "Code has been added to SVN.\n\nThanks very much for the contribution.", "id": 122251, "time": "2008-11-06T10:53:30Z", "creator": "sebb@apache.org", "creation_time": "2008-11-06T10:53:30Z", "is_private": false}]