[{"count": 0, "tags": [], "bug_id": 46058, "attachment_id": null, "is_private": false, "id": 121758, "time": "2008-10-21T21:05:00Z", "creator": "bodewig@apache.org", "creation_time": "2008-10-21T21:05:00Z", "text": "This is an enhancement request, but a very important one, thus I've decided to mark it \"major\" instead of enhancement.\n\nThe number of bug reports on OutOfMemoryExceptions caused by XmlLogger is pretty big and the root cause always is that XmlLogger builds up the DOM tree in memory and only writes the log at the end of the build process.\n\nIt has been suggested that a different implementation of XmlLogger that writes the XML file incrementally could be done, but I'm not convinced this could work in the presence of <parallel> or even a custom TargetExecutor that runs different targets in parallel.  I don't think we'd be able to write the log in more granular steps than \"write once per target of the top level build file\", which may be enough to already cause OOM conditions if the target contains <ant> tasks that call big subbuilds.\n\nInstead I think we should create an alternative output format for Ant's log (and probably do something similar for JUnit) that preserves the benefits of the XML log but can be streamed at the same time.\n\nRequirements would be:\n\n* be aware that multiple different threads may be logging at the same time\n\n* be aware that mutliple targets and even multiple projects may be executing in parallel\n\n* machine readable\n\n* preserve hierarchies, i.e. for a single log entry it must be possible to know to which task, target and project it belongs (where project may belong to a task that in turn ...)\n\n* logentries are written as soon as possible\n\n* the logfile is always well formed and doesn't need any closing \"tag\"\n\n* optionally: human readable - we could provide a tool that transforms a log to XmlLogger's format\n\nThis probably means that timing informations become log entires on their own right that act as an addendum to a \"finished\" event.\n\nI have a few ideas how to omplement this, but would prefer to collect more feedback first."}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 121761, "time": "2008-10-21T21:11:29Z", "bug_id": 46058, "creation_time": "2008-10-21T21:11:29Z", "is_private": false, "text": "*** Bug 35476 has been marked as a duplicate of this bug. ***"}]