[{"attachment_id": null, "tags": [], "creator": "robert.flaherty@oracle.com", "text": "This task doesn't have any additional library dependencies, and is misleading as to its' use.  Seems like it should be moved to core in its' package and the manual docs.", "count": 0, "id": 121756, "time": "2008-10-21T21:00:29Z", "bug_id": 46056, "creation_time": "2008-10-21T21:00:29Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "bodewig@apache.org", "is_private": false, "count": 1, "id": 121822, "time": "2008-10-23T05:20:51Z", "bug_id": 46056, "creation_time": "2008-10-23T05:20:51Z", "text": "there isn't really any difference between an optional task without dependencies and a core task.  Ant releases always contain either.\n\nThe same argument would apply to a couple of other optional tasks as well.\n\nUnless we restructure the complete manual, I don't see why this task would be different from others."}, {"count": 2, "tags": [], "bug_id": 46056, "text": "Stefan, what do you mean my restructure the complete manual.  All that would be needed is to move that one html file and its' entry in the list.  In my experience, people tend to shy away from the optional tasks b/c they require 3rd party installs, config, etc.  They like out-of-the-box, no other dependencies.  This should qualify as that as its' built into Java, otherwise why have core and optional breakouts.", "id": 121829, "time": "2008-10-23T07:02:06Z", "creator": "robert.flaherty@oracle.com", "creation_time": "2008-10-23T07:02:06Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 46056, "is_private": false, "text": "the same is true for most option SCM tasks, all Unix and Windows specific tasks, most EJB tasks, echoproperties, the jarlib tasks, javah, native2ascii, renameextensions, replaceregexp (if running on Java 1.4), rpm, schemavalidate, setproxy, translate and xmlvalidate\n\nwhy should we move propertyfile but not the others?", "id": 121830, "time": "2008-10-23T08:44:05Z", "creator": "bodewig@apache.org", "creation_time": "2008-10-23T08:44:05Z", "attachment_id": null}]