[{"count": 0, "tags": [], "creator": "seidel@aeb.de", "attachment_id": null, "id": 121733, "time": "2008-10-21T08:32:36Z", "bug_id": 46050, "creation_time": "2008-10-21T08:32:36Z", "is_private": false, "text": "The copy task already uses the flag preservelastmodified, but the sync task doesn't. It would be great if the sync task could use the flag too."}, {"count": 1, "tags": [], "text": "<sync> uses <copy> internally and explicitly sets preserveLastModified to true.\n\nAre you saying you need a way to set ot to false?", "attachment_id": null, "bug_id": 46050, "id": 121754, "time": "2008-10-21T20:40:22Z", "creator": "bodewig@apache.org", "creation_time": "2008-10-21T20:40:22Z", "is_private": false}, {"count": 2, "tags": [], "creator": "seidel@aeb.de", "attachment_id": null, "is_private": false, "id": 121764, "time": "2008-10-21T23:10:11Z", "bug_id": 46050, "creation_time": "2008-10-21T23:10:11Z", "text": "No, I don't need the flag set to false. I've tested the <sync> task and opened a target file with SHARED READ and by doing so, sync modifies the lastmodified to the current time. So I guess thats the bug.\nI've checked the file and it was change, so sync is working, but it doesn't preserve the lastmodified if the target file is open with SHARED READ."}, {"count": 3, "tags": [], "bug_id": 46050, "attachment_id": null, "text": "while I do have a vague idea of what you mean with SHARED_READ, I don't think this anything Ant does by intention (in fact, I don't think Ant could even influence that).\n\n<sync> really isn't anything more than <copy> followed by <delete> and some logic to populate the filesets of those tasks appropriately.\n\nWhen you say \"you\" opened the file with SHARED_READ and the sync did something, I don't know what that means.  How do <sync> and \"you\" interact here?\n", "id": 121827, "time": "2008-10-23T06:29:55Z", "creator": "bodewig@apache.org", "creation_time": "2008-10-23T06:29:55Z", "is_private": false}, {"count": 4, "tags": [], "text": "Ok, let me tell you a little bit more about what is going on.\n\nI have two directories production and development. If the development is tested and everything is ok, then the two directories will be <sync>hed.\nBut some of the files in the production system are opened by some users (with 3rd party tools). Thats not really a problem, because the file handles are Shared/Read (that means\nFile.Open (http://msdn.microsoft.com/de-de/library/y973b725(VS.80).aspx)\nFileAccess.Read (http://msdn.microsoft.com/en-us/library/4z36sx0f(VS.80).aspx)\nFileShare.ReadWrite (http://msdn.microsoft.com/en-us/library/system.io.fileshare)\nother requests can read/write the file). If I copy the directory with the Windows Explorer, then the files are all overwritten and the target files have the same lastmodified time stamp as the source files.\n\nBut when I use <sync> (maybe the same would happen with <copy>) the lastmodified timestamp gets resfreshed for the files, the users have handles on.", "is_private": false, "bug_id": 46050, "id": 121828, "time": "2008-10-23T06:54:19Z", "creator": "seidel@aeb.de", "creation_time": "2008-10-23T06:54:19Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "Robert, <sync> uses <copy> under the cover, as Stefan already mentioned, and already does this: myCopy.setPreserveLastModified(true); and <copy> itself just uses Java's File.setLastModified to implement setPreserveLastModified.\n\nSo if this is not happening in your particular situation, there's nothing the Ant team can do. You could try raising a bug on the JDK to have SUN fix it maybe?", "is_private": false, "bug_id": 46050, "id": 121834, "time": "2008-10-23T09:23:22Z", "creator": "ddevienne@gmail.com", "creation_time": "2008-10-23T09:23:22Z", "attachment_id": null}, {"count": 6, "text": "Ok, so it's an sun issue... thank you guys for finding the cause of this problem.", "bug_id": 46050, "attachment_id": null, "id": 121835, "time": "2008-10-23T11:57:51Z", "creator": "seidel@aeb.de", "creation_time": "2008-10-23T11:57:51Z", "tags": [], "is_private": false}]