[{"count": 0, "tags": [], "bug_id": 46062, "attachment_id": null, "id": 121773, "time": "2008-10-22T06:05:29Z", "creator": "norman@opaquemultimedia.com", "creation_time": "2008-10-22T06:05:29Z", "is_private": false, "text": "Following the development of applications such as XAMPP and sites like apachefriends.org, it has come to my attention that Apache has minimal support for the Chinese users.\n\nThe official document is avaliable in German, English, Spanish, French, Japanese, Korean, Portugese and Turkish. The Chinese localization for XAMPP has been quite successful and attracted a solid user base, seeing as there are in excess of 12 million domain name registered in the .cn region, I think it's quite reasonable to provide a Chinese version of the official documentation.\n\nFor some time, novice users had to rely on a 3rd party translation (http://lamp.linux.gov.cn/Apache/ApacheMenu/) to provide them with the necessary technical information. This website is a direct translation of the official Apache documentation (http://httpd.apache.org/docs/2.2/) but is loosely maintained.\n\nIf this documentation can be merged with the official documentation and receive the same rigiorous regulations that are enforced on the official documentation, I believe it will greatly inprove the usability of Apache to the Chinese users.\n\n-Norman"}, {"count": 1, "tags": [], "creator": "nick@webthing.com", "attachment_id": null, "text": "This is not something we - the existing apache team - can do anything about.  To make a new translation, we need someone to step forward and volunteer to contribute and maintain it.\n\nThe Turkish translation is a recent example of such a contribution.  Check the mailinglist archives for its history.\n\nIf you are in a position to contribute a new translation - perhaps working with the authors of the third-party translation you mentioned - please post to the docs@httpd list.", "id": 121775, "time": "2008-10-22T06:43:33Z", "bug_id": 46062, "creation_time": "2008-10-22T06:43:33Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 46062, "text": "(In reply to comment #1)\n> This is not something we - the existing apache team - can do anything about. \n> To make a new translation, we need someone to step forward and volunteer to\n> contribute and maintain it.\n> \n> The Turkish translation is a recent example of such a contribution.  Check the\n> mailinglist archives for its history.\n> \n> If you are in a position to contribute a new translation - perhaps working with\n> the authors of the third-party translation you mentioned - please post to the\n> docs@httpd list.\n> \n\nThank you Nick, I'll try to get in touch with the translation team leader and see waht I can do", "id": 121781, "time": "2008-10-22T07:49:59Z", "creator": "norman@opaquemultimedia.com", "creation_time": "2008-10-22T07:49:59Z", "is_private": false, "attachment_id": null}]