[{"count": 0, "tags": [], "bug_id": 46112, "attachment_id": null, "is_private": false, "id": 121975, "time": "2008-10-28T13:53:53Z", "creator": "brian@planetoberman.com", "creation_time": "2008-10-28T13:53:53Z", "text": "In 2.3.2, new functionality was added to support multi-part form with post.\n\nThis functionality does not work in 2.3.2 with a multi-part form file upload.\n\nBoth recording with the http proxy, and the actual test plan does not work with this configuration.\n\nIt appears that the 8bit encoding is the issue.\n\nThat is each form field posting gets these 2 lines\n\nContent-Type: text/plain; charset=iso-8859-1 \nContent-Transfer-Encoding: 8bit \n\nWhen I test with a browser, and sniff the traffic, and my app works, these 2 attributes are not present.\n\nI have not found a workaround using jmeter.properties.\n\nI took my 2.3.2 test plan, and ran in 2.2 and my plan works.  In 2.2, only 1 file could be uploaded, and the new multi-part form post option did not exist, but the plan works with 2.2 and not in 2.3.2.  \n\nIt appears either the content type and/or content-transfer-encoding is causing the test plan to not work in 2.3.2.\n\nInterestingly enough, in 2.3.2, the tree results viewer considers the call a success, but that is only because of a 200 return code, but no result shows up in the response part, and the files uploaded are not received on the server end.\n\nI found this issue on other web posts...here is one that shows the same type of encoding I am seeing.\n\nhttp://www.nabble.com/Problem-with-the-JMeter-HTTP-Proxy-td19435675.html"}, {"attachment_id": null, "tags": [], "bug_id": 46112, "is_private": false, "count": 1, "id": 121976, "time": "2008-10-28T13:55:09Z", "creator": "brian@planetoberman.com", "creation_time": "2008-10-28T13:55:09Z", "text": "This is my first bug report.  Please let me know if there is anything I should have included.  Thanks for any assistance!"}, {"count": 2, "tags": [], "text": "We'll need a bit more information to try and determine what is going on here.\n\nCan you attach the test plan (JMX) file to this bug report - after redacting any sensitive information?\n\nIf you can attach a sample that can be used with a public server, so much the better.\n\nAlso useful is the jmeter log file.\n\nAlso, it might be worth trying the HttpClient version of the HTTP Sampler if you are currently using the default.", "is_private": false, "id": 122261, "creator": "sebb@apache.org", "time": "2008-11-06T15:07:57Z", "bug_id": 46112, "creation_time": "2008-11-06T15:07:57Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 46112, "attachment_id": 22839, "text": "Created attachment 22839\nHTTPReqeust being sent in..", "id": 122285, "time": "2008-11-07T09:28:37Z", "creator": "brian@planetoberman.com", "creation_time": "2008-11-07T09:28:37Z", "is_private": false}, {"attachment_id": 22840, "tags": [], "bug_id": 46112, "text": "Created attachment 22840\njmeter 2.3.2 log file", "count": 4, "id": 122286, "time": "2008-11-07T09:29:38Z", "creator": "brian@planetoberman.com", "creation_time": "2008-11-07T09:29:38Z", "is_private": false}, {"count": 5, "tags": [], "creator": "brian@planetoberman.com", "text": "Created attachment 22841\nJMX Test Plan\n\nname of jmx plan doesn't match the jmeter.log file plan name due to saving test plan under separate name to redact sensitive information", "id": 122287, "time": "2008-11-07T09:34:19Z", "bug_id": 46112, "creation_time": "2008-11-07T09:34:19Z", "is_private": false, "attachment_id": 22841}, {"count": 6, "tags": [], "text": "I have submitted the requested/needed additional information.\n\n1. JMX test plan (with sensitive data redacted)\n2. input from the problem http request\n3. the jmeter log file\n\nPlease note I have tested with both HTTP samples (HTTPClient and the default one) and both suffer from the same problem from my testing.\n\nIf I can be of further assistance, please let me know.\n\nThank you for everything!", "is_private": false, "id": 122288, "creator": "brian@planetoberman.com", "time": "2008-11-07T09:36:03Z", "bug_id": 46112, "creation_time": "2008-11-07T09:36:03Z", "attachment_id": null}, {"count": 7, "tags": [], "text": "There are rather a lot of samplers in the JMX file; I assume it is the CreateEvent one that is causing the problem, as that is the one with two files.\n\nAs far as I can tell, the body generated by JMeter is perfectly valid - see for example http://www.ietf.org/rfc/rfc2388.txt section 4.5.\n\nThe Content-Type and Content-Transfer-Encoding headers are optional, but are allowed in form-data.\n\nIt looks like the server application is not handling these optional headers correctly.\n\nAre there any error messages in the server log file?\nDoes the response page from the server give any indication that the request has not been accepted? If not, then ISTM that the server application is broken.\n\nCan you provide the HTML for the form that generates the request?\nThis would make it easier to try things out.", "is_private": false, "id": 122297, "creator": "sebb@apache.org", "time": "2008-11-08T08:41:43Z", "bug_id": 46112, "creation_time": "2008-11-08T08:41:43Z", "attachment_id": null}, {"count": 8, "tags": [], "creator": "brian@planetoberman.com", "text": "Yes, you are correct.  CreateEvent is the one I am having issues with.\n\nThere is no indication of a problem on the server logs.  In fact it responds with a HTTP status 200.....\n\nWhen I get on my work laptop again, I will send the HTML page to you.\n\nI also am starting to think that this is a server side problem with handling the multipart-form post as when I look at the way the sample submits to the server in jmeter 2.2 vs. 2.3.2 it is different.\n\nAnd maybe, just maybe, the server side is not handling properly and also swallowing down all indications of a problem (no logs) silently (ugh).\n\nI have since re-written the file upload code to use Apache Commons File Upload component...and will re-test 2.3.2 with that on the server side.  \n\nI will post those results, but that probably will not be til Wed.\n\nThanks again for your assistance and interest.  ", "id": 122298, "time": "2008-11-08T08:55:53Z", "bug_id": 46112, "creation_time": "2008-11-08T08:55:53Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "creator": "sebb@apache.org", "is_private": false, "text": "(In reply to comment #8)\n> Yes, you are correct.  CreateEvent is the one I am having issues with.\n> \n> There is no indication of a problem on the server logs.  In fact it responds\n> with a HTTP status 200.....\n\nYes, that is to be expected, but does the response page give any indication that the request failed? \n\nFor example a failed login would normally return status 200 and the only indication of failure is the text on the page.\n\n> When I get on my work laptop again, I will send the HTML page to you.\n\nThanks.\n \n> I also am starting to think that this is a server side problem with handling\n> the multipart-form post as when I look at the way the sample submits to the\n> server in jmeter 2.2 vs. 2.3.2 it is different.\n>\n> And maybe, just maybe, the server side is not handling properly and also\n> swallowing down all indications of a problem (no logs) silently (ugh).\n\nSo long as the response page reports the error to the user in some way, there's no need to log it as well.\n\nThough it might help the server admin people to determine the cause if users call in about problem.\n\n> I have since re-written the file upload code to use Apache Commons File Upload\n> component...and will re-test 2.3.2 with that on the server side.  \n> \n> I will post those results, but that probably will not be til Wed.\n\nOK.", "id": 122299, "time": "2008-11-08T09:17:42Z", "bug_id": 46112, "creation_time": "2008-11-08T09:17:42Z", "attachment_id": null}, {"count": 10, "tags": [], "bug_id": 46112, "text": "Okay, I must apologize.\n\nI changed the server side from proprietary file upload code to Apache Commons File Upload component.  \n\nAnd now jmeter 2.3.2 works with the exact same test plan.\n\nSo it does appear, that the old file upload code was flawed when it came to multi-part form posts.\n\nI apologize for not figuring this out sooner.\n\nThanks for all your attention to detail and assistance.\n\nYou may close this bug.\n\nBrian", "id": 122430, "attachment_id": null, "creator": "brian@planetoberman.com", "creation_time": "2008-11-13T08:00:24Z", "time": "2008-11-13T08:00:24Z", "is_private": false}]