[{"attachment_id": null, "tags": [], "bug_id": 46139, "text": "Fresh Apache 2.2.10 installed on Windows XP machine with default config files, httpd.exe service can be started and working without problem, default page \"It works!\" can display. However, restarted Apache by selecting \"Restart\" from Windows Start Menu (-k restart) or click Restart in Apache Service Monitor, Apache Server no longer replying request to the client bowser. To make the Apache work again, \"Stop\" & \"Start\" procedures is needed.\n\nI tried on a Windows 2003 Server with Dual Xeon CPU also has same problem.\n\nThis error log is right after click Restart, seems ok but client bowser receive no respond from Apache and waiting forever.....\n\n[Mon Nov 03 14:26:39 2008] [notice] Apache/2.2.10 (Win32) configured -- resuming normal operations\n[Mon Nov 03 14:26:39 2008] [notice] Server built: Oct 10 2008 12:39:04\n[Mon Nov 03 14:26:39 2008] [notice] Parent: Created child process 7108\nhttpd.exe: Could not reliably determine the server's fully qualified domain name, using 192.168.1.102 for ServerName\nhttpd.exe: Could not reliably determine the server's fully qualified domain name, using 192.168.1.102 for ServerName\n[Mon Nov 03 14:26:39 2008] [notice] Child 7108: Child process is running\n[Mon Nov 03 14:26:40 2008] [notice] Child 7108: Acquired the start mutex.\n[Mon Nov 03 14:26:40 2008] [notice] Child 7108: Starting 64 worker threads.\n[Mon Nov 03 14:26:40 2008] [notice] Child 7108: Starting thread to listen on port 80.", "count": 0, "id": 122126, "time": "2008-11-02T22:33:34Z", "creator": "pauliu@ateamsys.com", "creation_time": "2008-11-02T22:33:34Z", "is_private": false}, {"count": 1, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "id": 126364, "time": "2009-04-19T11:35:37Z", "bug_id": 46139, "creation_time": "2009-04-19T11:35:37Z", "is_private": false, "text": "I can reproduce the problem.\n\nI tried with 2.2.8 and 2.2.11 (ASF build) and also with my own 2.2.11 build. ProcessExplorer shows, that directly after the start, the parent owns the listen, but the child owns the TCP connection for any new request. After restart, the parent owns request connections. The requests are not answered."}, {"count": 2, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "id": 126365, "time": "2009-04-19T12:00:06Z", "bug_id": 46139, "creation_time": "2009-04-19T12:00:06Z", "is_private": false, "text": "I tried additionally with\n\n- 2.2.3 nod SSL ASF build\n- 2.0.63 SSL ASF build\n- 2.0.53 no SSL ASF build\n\nAll of them show the above described problem.\n\nVersion 1.3.41 does restart correctly."}, {"count": 3, "tags": [], "bug_id": 46139, "attachment_id": null, "text": "Things get more confusing now:\n\nI have two systems running Windows XP Professional Version 2002 SP 3. The problem does occur on one of them, but not on the other one.\n\nThe systems are not identical, like one is German (the broken one), and one English. The broken one most likely has more up-to-date MS patches and uses DHCP, the working one is more static and runs as a VMware guest.", "id": 126368, "time": "2009-04-19T13:31:55Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2009-04-19T13:31:55Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 46139, "text": "The information we need to reproduce this is the network stack of the problem\nsystems.  E.g. settings, Network Connections, particular connection -> Properties\n\nWe are looking for any 'suspect' components, particularly non-MS elements.\n\nWe are also looking for the use of EnableSendfile and DisableWin32AcceptEx.\n\nFinally, it will be very interesting to look at the WinNT MPM in 2.3 trunk.\nI'll likely post a backport of this for the 2.2.11 release to compare notes.", "count": 4, "id": 126371, "time": "2009-04-19T16:18:40Z", "creator": "wrowe@apache.org", "creation_time": "2009-04-19T16:18:40Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 46139, "attachment_id": null, "text": "Win32DisableAcceptEx fixes the problem on my test system. Disabling Sendfile and MMap don't fix it.\n\nI also played a bit with various interfaces and disabling drivers. I used a normal LAN interface and disabled all drivers except for TCP/IP and also disabled the Windows firewall. Even when configuring httpd Listen fixed on the system address, the problem was reproducible. Then I disabled all interfaces and used Listen to listen on localhost only. Still I got the problem. Disabling AcceptEx fixed it in all those cases.\n\nWhen disabling all interfaces and using localhost, the windows routing table says they are usoing the \"MS TCP loopback interface\". I didn't find a good way to retrieve configuration or network stack details for this interface.\n\nThere is a lot of additional network related software installed on the system like VPN software, a VMware player, wireshark etc. So it could well be, that parts of that influences the accept behaviour, even when I try to disable as much of it as I'm able to.", "id": 126533, "time": "2009-04-27T01:39:40Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2009-04-27T01:39:40Z", "is_private": false}, {"count": 6, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "id": 126537, "time": "2009-04-27T04:12:41Z", "bug_id": 46139, "creation_time": "2009-04-27T04:12:41Z", "is_private": false, "text": "Actually AcceptEx() returns with 997 (IO_PENDING) after the initial start as well as after restart. Then the WaitForSingleObject() loop after AcceptEx() loops with the 1 second timeout until the new connection is accepted and then passed along to the thread doing the get_connection after start. After restart the WaitForSingleObject() loop does only return with the timeout all the time although from the point of view of the client and also of netstat, the connection is accepted.\n\nAs noted before, netstat and ProcessExplorer indicate, that the accepted connection is related to the parent process, not to the child."}, {"count": 7, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "id": 129553, "time": "2009-08-06T20:00:37Z", "bug_id": 46139, "creation_time": "2009-08-06T20:00:37Z", "is_private": false, "text": "It would be good to compare this broken tcp/ip stack with the behavior of httpd\ntrunk, which is significantly refactored already."}]