[{"count": 0, "tags": [], "creator": "maco@parasoft.com", "attachment_id": null, "id": 122024, "time": "2008-10-30T05:09:08Z", "bug_id": 46130, "creation_time": "2008-10-30T05:09:08Z", "is_private": false, "text": "I would need feature: Ability to use adobe (japanese) fonts without embedding them.\n\nCurrently to create asian PDF one has to embed the font into PDF or know TTF font name installed on system (detected by autodetect).\n\nI want to use fop in a distributed package - and I don't think there is font I can freely redistribute. I also don't know the fonts used on end user system.\n\nAnyway iText Lowagie PDF creation Library can create a PDF using HeiseiMin-W3 and PDF it creates when viewed by adober reader without asian fonts triggers dialog to install adobe font pack. After this PDF is perfectly viewable.\n\nIt actually uses only properties (similar to font-metrics xml?) of HeiseiMin-W3 font and probably CMap files.\n\nI see 2 problems:\n- no way of generation font metrics from adobe OTF fonts?\n- creating PDF in a way that reader will know which font it should use and download if necessary\n\n\nI would be willing to do the required changes although I would need some \nguidance. I am pretty new to the PDF and fonts so I might even not see some obvious things. I need this in about 1 week.\n\nI am currently setting up FOP trunk project and I will try to familiarize myself with the source code."}, {"count": 1, "tags": [], "bug_id": 46130, "attachment_id": null, "text": "I'm happy to read that you're willing to jump in. So I'm happy to offer some pointers in the hope that they help you.\n\nFor specifying which fonts should be referenced rather than referenced, see:\nhttp://xmlgraphics.apache.org/fop/trunk/fonts.html#embedding\nIn the case of TrueType fonts, the referenced font is currently defaulting to WinAnsi encoding (8-bit). You can see that in TTFFontLoader. A SingleByteFont instance is created rather than a MultiByteFont instance. The TTFFontLoader is responsible to load the font and make it available (metrics, glyph widths, kerning pairs etc.). MultiByteFont is currently always in \"font subset\" mode. It doesn't know anything else. I suspect that you might need to subclass MultiByteFont into two implementations: one for subsetting and one for a fixed CID set. Maybe you can also reuse MultiByteFont's parent class CIDFont to a certain degree. You will, of course, also need CMaps. We can probably use the same files as PDFBox (incubating, see [1]). Legal recently approved their use inside the ASF. One problem is to select the right CMap. I'm not sure but maybe that information could be in the TrueType file itself.\n\nYou won't get around looking into the PDF 1.4 specification (chapter 5) [2] and the OpenType/TrueType specification [3].\n\nJust a few hints on the procedural side: Please don't use tab characters in the Java sources and try to mimic the original code style. We will need you to submit a signed ICLa (and a CCLA if necessary) [4] before we can apply any non-trivial patches from you. Please don't forget to update the documentation (src/documentation directory) if you add any noteworthy functionality (other users will be grateful). More information on the FOP and ASF websites. Don't hesitate to ask for help if anything's unclear. Development-related discussions preferably on the fop-dev mailing list.\n\n[1] https://svn.eu.apache.org/viewvc/incubator/pdfbox/trunk/src/main/resources/Resources/cmap/\n[2] http://www.adobe.com/devnet/pdf/pdf_reference_archive.html\n[3] http://www.microsoft.com/typography/otspec/\n[4] http://www.apache.org/licenses/#clas\n\nHTH", "id": 122032, "time": "2008-10-30T11:05:46Z", "creator": "jeremias@apache.org", "creation_time": "2008-10-30T11:05:46Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 46130, "text": "I am very sorry but I won't be able to handle this, the issue was reassigned from me and solved in a different way (font was acquired). ", "id": 122127, "time": "2008-11-03T00:04:17Z", "creator": "maco@parasoft.com", "creation_time": "2008-11-03T00:04:17Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "id": 157299, "time": "2012-04-07T01:39:44Z", "bug_id": 46130, "creation_time": "2012-04-07T01:39:44Z", "is_private": false, "text": "resetting P1 open bugs to P3 pending further review"}]