[{"count": 0, "tags": [], "text": "Scenario:\n\nI have an ant file with three input tasks.  When run interactively, they prompt me, I input whatever values, and all is well.\n\nBut now I want to automate running this ant file, so I generate a response file and feed it into ant as stdin:\n\nant ... < response.txt\n\nThe first input task sucks in the whole response file and the other input tasks get nothing.  The reason is that DefaultInputHandler.handleInput uses a BufferedReader on the stdin stream, reads one line (which effectively causes the buffered reader to read everything it sees), and then the buffered reader goes out of scope.\n\nPossible solutions:\n1. Somehow push back the extra bytes that were read so that the next input task can read the next line, or\n2. Store that BufferedReader somewhere and have the next input task use it instead of creating a new one, or\n3. Don't use a BufferedReader at all; but then you'd lose the ability to do a readLine.\n\nPleas for forgiveness:\n* This is a problem that one of my customers has, not me, so I don't have the full context in which they're doing this.  Essentially, they're using my company's product to automate something that they normally do by hand / interactively.  That's all I know.\n* I'm not an ANT expert or even novice by any stretch of the imagination, so forgive me if I'm not using the right terminology in this bug report.\n* Even if there's a better way to set up an ANT file to handle interactive and non-interactive use, I don't know if the customer is willing to make dramatic changes.  This is a bug.\n* The current work-around I've given them is to have a Perl script that prints a line, sleeps, prints the next line, sleeps, etc.  Not the best solution in the world, but effective for the time being.", "attachment_id": null, "bug_id": 46203, "id": 122438, "time": "2008-11-13T10:48:34Z", "creator": "sandman@electric-cloud.com", "creation_time": "2008-11-13T10:48:34Z", "is_private": false}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "text": "actually, things are a lot worse - and a lot more difficult to fix.  Throw in an <exec> task and all bets are off http://ant.apache.org/faq.html#input-makes-exec-hang\n\nThere is a recommended way for reading an input's tasks input from a file and that is to use a different InputHandler.  Your customer shouldn't use stdin redirects at all, this is not a supported use-case for input (and thus I could simply claim it is a bug).\n\nWhat you should use is a properties file with the answers to your different input tasks (the keys of that property files are the input's prompts) and a PropertyFileInputHandler.\n\nI know you said you may not be able to change things on your side, but this is at least as much a \"you are using ant in a way that it doesn't support\" as a bug.", "id": 122463, "time": "2008-11-14T03:57:31Z", "bug_id": 46203, "creation_time": "2008-11-14T03:57:31Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 46203, "attachment_id": null, "text": "I just had a quick look at the code and I'm afraid the problem isn't fixable.\n\nWhile we may be able to remove the BufferedReader and implement out our end-of-line detection, we really really want the Java classlib to do the byte-to-character conversion for us.\n\nInputStreamReader performs buffering itself, the javadocs state it might read more bytes than are strictly required for a given read(), so even without the BufferedReader we could (and probably) would end up reading too far.", "id": 122467, "time": "2008-11-14T05:47:49Z", "creator": "bodewig@apache.org", "creation_time": "2008-11-14T05:47:49Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jkf@apache.org", "text": "I'd suggest to do use one of the following methods:\n\n1) Use an input file per exec task\n2) Use inputstring in combination with properties\n\nAs there may be tasks, unknown to us, using standard in, there is nothing \nwe can do to fix this issue. (If this were not the case we could have wrapped standard in somehow and used that everywhere instead, this does not seem to be a viable path.)", "id": 124707, "time": "2009-02-07T11:12:44Z", "bug_id": 46203, "creation_time": "2009-02-07T11:12:44Z", "is_private": false, "attachment_id": null}]