[{"count": 0, "tags": [], "bug_id": 46251, "attachment_id": null, "is_private": false, "id": 122681, "time": "2008-11-20T10:26:51Z", "creator": "pilcme@yahoo.com", "creation_time": "2008-11-20T10:26:51Z", "text": "When a block begins with an <inline> and the <inline> has a space-end attribute, the first line of the block is badly formatted in pdf. \n\nThe first line is longer than it should be by the amount of the space-end.\n\nI have not tried any other output besides pdf.\n\nThis also happened on 0.94. I have not tried it on any older version and I have not tried in on the current trunk.\n\nI am attaching an FO file. If you generate a pdf from this FO you should see the problem.\n\nNote that my block has text-align=\"justify\". This makes the problem easier to see but the problem remains without the text-align."}, {"count": 1, "tags": [], "creator": "adelmelle@apache.org", "text": "\nPreliminary check of the code in InlineLM shows that space-end for fo:inlines is only taken into account when adding the areas, not yet when the element-list is generated, hence why the line-layout algorithm is tricked into believing that that break is OK.\n\nI already have the beginnings of a patch ready here, which fixes the issue by adding the necessary boxes to the element-list, but it's still too rough to apply. It only takes into account the .optimum component, and besides that, I'm going to see if at the same time, I can implement space-resolution in that context...\n\nTBC", "id": 122733, "time": "2008-11-21T11:07:14Z", "bug_id": 46251, "creation_time": "2008-11-21T11:07:14Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "eric.amick@mail.house.gov", "text": "Created attachment 23276\nFO File that also has formatting problems; no-break spaces also involved", "id": 124922, "time": "2009-02-18T05:09:40Z", "bug_id": 46251, "creation_time": "2009-02-18T05:09:40Z", "is_private": false, "attachment_id": 23276}, {"text": "resetting P2 open bugs to P3 pending further review", "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "count": 3, "id": 157587, "time": "2012-04-07T01:44:56Z", "bug_id": 46251, "creation_time": "2012-04-07T01:44:56Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 46251, "attachment_id": null, "is_private": false, "id": 157899, "time": "2012-04-11T06:17:01Z", "creator": "gadams@apache.org", "creation_time": "2012-04-11T06:17:01Z", "text": "change status from ASSIGNED to NEW for consistency"}]