[{"count": 0, "tags": [], "bug_id": 46270, "attachment_id": 22917, "is_private": false, "id": 122750, "time": "2008-11-23T05:48:50Z", "creator": "steve@openssl.org", "creation_time": "2008-11-23T05:48:50Z", "text": "Created attachment 22917\nAdd SSLFIPS option.\n\nThis patch adds FIPS 140-2 support for mod_ssl when used with the newly validated 1.2 OpenSSL FIPS module.\n\nA single boolean option SSLFIPS is added. When set FIPS 140-2 mode is enabled. Note that this option by itself does not guarantee FIPS 140-2 compliance, the security policy must also be adhered to.\n\nThis option is only available if Apache is compiled against an appropriate version of OpenSSL which has been linked to the validated module. Currently only OpenSSL 0.9.8-stable snapshots include the necessary functionality. OpenSSL 0.9.8j will be the first official release.\n\nTypically compiling against appropriate headers and linking to an FIPS capable shared library will be required.\n\nThis option disables generation of temporary keys smaller than 1024 bits because keys smaller than 1024 bits are prohibited in FIPS mode.\n\nIf compiled against a non-FIPS capable OpenSSL or when the SSLFIPS option is not set it will have no effect."}, {"attachment_id": null, "tags": [], "bug_id": 46270, "text": "Steve...\n\nwhen Ben and I each worked on this initially, we came to the conclusion that\nhttpd+mod_ssl should either be compiled to fips-140 binaries, with all of the\nencumberances that places on the implementation, or compiled to the flexibility\nthat non-fips offers.\n\nDo you object if this became a compile-time flag?\n\np.s. I plan to spend a bit of my holiday weekends over this next 6 weeks getting\nall of these patches into trunk.\n", "count": 1, "id": 122751, "time": "2008-11-23T13:23:25Z", "creator": "wrowe@apache.org", "creation_time": "2008-11-23T13:23:25Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 46270, "text": "(In reply to comment #1)\n> \n> Do you object if this became a compile-time flag?\n> \n\nNo don't mind at all. There have been a few changes in the latest validation. The PRNG reseeding is no longer necessary. You can also link to FIPS capable shared libraries and it all works OK. \n\nStatic libraries need modifications to the build procedure.\n\nThe 1024 bit key restriction is a new requirement though.\n\n\n", "count": 2, "id": 122755, "time": "2008-11-23T15:24:08Z", "creator": "steve@openssl.org", "creation_time": "2008-11-23T15:24:08Z", "is_private": false}, {"count": 3, "tags": [], "creator": "steve@openssl.org", "is_private": false, "text": "(In reply to comment #1)\n> Steve...\n> \n> when Ben and I each worked on this initially, we came to the conclusion that\n> httpd+mod_ssl should either be compiled to fips-140 binaries, with all of the\n> encumberances that places on the implementation, or compiled to the flexibility\n> that non-fips offers.\n> \n> Do you object if this became a compile-time flag?\n> \n\nHad a bit of feedback on this. \n\nAdding a compile-time flag is OK. \n\nHowever making it always-on is likely to cause problems with distros needing to have two binaries. I'd prefer the configuration option is kept too so the same binary can work as FIPS and non-FIPS.\n\nThe encumberances in the 1.2 FIPS module are rather less than those in the original. Now an application can just link against shared libraries, which otherwise behave in exactly the same way as OpenSSL 0.9.8. \n\nIn 1.0 and 1.1 shared libraries were not supported and you had to use a special static only link procedure.\n\n", "id": 122798, "time": "2008-11-24T10:55:43Z", "bug_id": 46270, "creation_time": "2008-11-24T10:55:43Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 46270, "text": "After further study, a run time flag made sense.  Committed to trunk, proposed\nfor backport, one issue remains;\n\nI'd further modified this patch to indicate when fips mode is or is not in\noperation, some people have complained about the volume of this log message.\n\nI'm considering making this loglevel Info, but suppress the log message when\nthe user explicitly configures SSLFIPS off.  Does this make sense?", "count": 4, "id": 136761, "time": "2010-05-10T14:11:23Z", "creator": "wrowe@apache.org", "creation_time": "2010-05-10T14:11:23Z", "is_private": false}]