[{"count": 0, "tags": [], "bug_id": 46301, "attachment_id": null, "id": 122874, "time": "2008-11-26T09:03:08Z", "creator": "patrickyccheng@gmail.com", "creation_time": "2008-11-26T09:03:08Z", "is_private": false, "text": "created StreamID, ViewSource, PageItem, ViewDefinition, ViewFields, DataItem, ExtendedPivotTableViewFields.\n\nAdded reference to RecordFactory and BiffViewer, removed references in UnknownRecord.\n\nHad to add new functions in StringUtils to read/write unicode string with length not located immediately before the string."}, {"count": 1, "tags": [], "text": "Created attachment 22952\ndiff", "attachment_id": 22952, "bug_id": 46301, "id": 122875, "time": "2008-11-26T09:11:20Z", "creator": "patrickyccheng@gmail.com", "creation_time": "2008-11-26T09:11:20Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 46301, "text": "Created attachment 22953\nnew files", "id": 122876, "time": "2008-11-26T09:11:34Z", "creator": "patrickyccheng@gmail.com", "creation_time": "2008-11-26T09:11:34Z", "is_private": false, "attachment_id": 22953}, {"count": 3, "tags": [], "creator": "patrickyccheng@gmail.com", "text": "forgot to prefix [PATCH]", "id": 122877, "time": "2008-11-26T09:12:46Z", "bug_id": 46301, "creation_time": "2008-11-26T09:12:46Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "josh@apache.org", "attachment_id": null, "id": 122884, "time": "2008-11-26T15:16:36Z", "bug_id": 46301, "creation_time": "2008-11-26T15:16:36Z", "is_private": false, "text": "Applied in svn r721007\n\nThanks for the recent patches (bug 46189 too).  So far these changes don't add any functionality (POI can't do anything with charts or pivot tables yet).  What level of support are you aiming for (e.g. 'read-only access', 'modify existing', or 'create from scratch')?\n\nBTW - some comments on the code you've been submitting:\n(1) - add the standard apache header in all new files\n(2) - add (at least brief) class comments on new classes\n(3) - use java int for 16 bit values instead of short and byte.  In BIFF records, most 16 bit ints are really unsigned, and using java short can cause big trouble.  Another annoying problem is that java demands casts on integer constants assigned to short variables even when they are clearly within the range of a short.  In most places (fields, local variables, parameters) there is no JVM memory savings. Primitive bytes, shorts, chars, and ints all take 4 bytes (an exception is in primitive arrays, which seem to be stored compactly in most JVMs).\n(4) -  Please write junits for the new classes - at the very least for the complex parts.  As they stand, these recent patches actually make POI less reliable because data which was previously read and written by UnknownRecord (using one very simple implementation) is now handled by many different classes, none of which have tests cases.  Classes like PageItemRecord are perhaps so simple that they don't need unit tests, but ViewDefinitionRecord definitely should.  As a matter of fact, I found a bug in ViewFieldsRecord.serialize(LittleEndianOutput), concerning writing the string length twice.\n\n"}]