[{"count": 0, "tags": [], "creator": "mhilpert@gmx.de", "attachment_id": null, "is_private": false, "id": 123209, "time": "2008-12-10T02:02:48Z", "bug_id": 46371, "creation_time": "2008-12-10T02:02:48Z", "text": "I configured FOP to use custom fonts with their TTF files being in a custom directory - and not C:\\WINNT\\Fonts (reason: license restrictions only allows usage of some fonts in the FOP application and not in any other Windows applications, like e.g. Word). This works flawlessly for FOP texts.\n\nHowever, SVGs are also included (referenced/linked) in the XSLs. And for texts in these SVGs, the fonts are only used/found if they are stored in C:\\WINNT\\Fonts! It seems that FOP doesn't tell its SVG engine (Batik) where to find the fonts, as FOP itself knows it from its configuration XML. Is Batik using the font configuartion of FOP at all or is there some additional configuration possible to tell FOP to set its font configuration also for Batik?"}, {"count": 1, "tags": [], "bug_id": 46371, "text": "This is a known issue and it's not primarily a FOP issue, but a Batik issue. I've recently documented that particularity although I still haven't re-published the updated website. For your convenience here's an excerpt:\n\nhttps://svn.eu.apache.org/viewvc/xmlgraphics/fop/trunk/src/documentation/content/xdocs/trunk/graphics.xml?view=markup\n\n-------------------------------\n<section id=\"svg-font-selection\">\n          <title>Font selection notes</title>\n          <p>\n            Apache Batik uses the AWT/Java2D subsystem as font source while FOP has its on font\n            subsystem. Great care has been taken that font selection does the best possible choices.\n            But it must be noted when creating PDF or PostScript that a font used in SVG graphics\n            needs to be registered with the operating system as well as in FOP's configuration.\n            By using FOP's font auto-detection, you simply have to install the font in the operating\n            system and not care about anything else. This is less of an issue if you create\n            formats like TIFFs, PNGs or PCL because in these cases SVG graphics are usually rendered\n            to bitmaps which means that on both sides (Batik and FOP), AWT/Java2D is used as the\n            single font source.\n          </p>\n          <p>\n            Whenever an SVG is converted into a PDF or PostScript file, the font that has been used\n            inside Batik has to be mapped to a font used by the actual output format. Features like\n            font substitution in FOP may need to be taken into account but can also be an advantage\n            when working around font mapping issues. Like for XSL-FO content, you'll get a warning\n            if a particular font could not be found and had to be substituted, or if a particular\n            glyph is missing in a font.\n          </p> \n        </section>\n-------------------------------\n\nAnyway, Batik would need to be changed to allow plugging in an external font source like FOP's font configuration. There's no easy solution to this. It would mean working with the Batik developers and quite a bit of work. Don't expect anyone to do that for you in the near future. I don't see a work-around other than installing the necessary font in your operating system to make them available to Batik.\n\nI know there is a code section in Batik that can load a TrueType font from an external file (not installed in the operating system), so it might be possible to specify the location of a font somehow. But I don't know how that works and if it's really possible. You will have to ask on batik-users.\n\nI guess we can keep this issue around as a reminder. But given the amount of work expected compared to the expected gain it is realistic to assume this won't be implemented soon.", "id": 123214, "time": "2008-12-10T02:53:53Z", "creator": "jeremias@apache.org", "creation_time": "2008-12-10T02:53:53Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 46371, "text": "I tried to set the custom TTF fonts in a custom fontconfig.properties for the Java application.\n\njava ... -Dsun.awt.fontconfig=C:/test/fontconfig.properties\n\nThis works in a test Java application (i.e.: I can uses the TTF font which is not in C:\\WINNT\\Fonts in Java by creating a Font object with the correct font family name and sub name). UNfortunately, Batik seems to ignore this.\n\nSo, this seems to be an issue of Batik not offering an API (for FOP) to set custom font sources?", "id": 123215, "time": "2008-12-10T03:07:52Z", "creator": "mhilpert@gmx.de", "creation_time": "2008-12-10T03:07:52Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "text": "Basically, yes. If I remember correctly, there are hints in the code that something like this could be added. But when I looked into it, it looked like too much work for my time budget at that time.\n\nI don't think Batik would willingly ignore additional fonts made available through -Dsun.awt.fontconfig since this is an AWT facility. If that property makes sure that the fonts are integrated into the AWT font subsystem the fonts should really be available to Batik. But again, maybe the people on batik-users@xmlgraphics.apache.org know more.", "id": 123217, "time": "2008-12-10T03:15:38Z", "bug_id": 46371, "creation_time": "2008-12-10T03:15:38Z", "is_private": false}, {"count": 4, "tags": [], "creator": "mhilpert@gmx.de", "attachment_id": null, "is_private": false, "id": 123219, "time": "2008-12-10T03:29:28Z", "bug_id": 46371, "creation_time": "2008-12-10T03:29:28Z", "text": "OKay, I opened a new bug for Batik: https://issues.apache.org/bugzilla/show_bug.cgi?id=46374"}, {"count": 5, "text": "I've committed a small change to Batik that allows non-AWT-toolkit-provided fonts to be embedded in SVG.", "bug_id": 46371, "is_private": false, "id": 127030, "time": "2009-05-14T18:42:49Z", "creator": "cam@apache.org", "creation_time": "2009-05-14T18:42:49Z", "tags": [], "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 46371, "is_private": false, "text": "resetting P2 open bugs to P3 pending further review", "id": 157537, "time": "2012-04-07T01:44:21Z", "creator": "gadams@apache.org", "creation_time": "2012-04-07T01:44:21Z", "attachment_id": null}]