[{"count": 0, "tags": [], "bug_id": 46526, "attachment_id": null, "id": 124022, "time": "2009-01-14T02:03:17Z", "creator": "davidcorley@gmail.com", "creation_time": "2009-01-14T02:03:17Z", "is_private": false, "text": "Having inherited a legacy build system, I came across strange behavior with an antcall task. I found that properties set in the target called by the antcall task were not available at later points in the build. I couldn't understand this as the documentation states that properties are immutable.\nIt was only after coming across the antcall ant-contrib task that I understood the antcall task behavior when it comes to properties set in the called target.\n\nhttp://ant-contrib.sourceforge.net/tasks/tasks/antcallback_task.html\n\nThe current documentation for <antcall> in the Ant manual makes no reference to the fact that:\n\na) A new Ant project is created\nb) Any properties set in the target called by <antcall> are cleared after the target has run.\n\nCan someone please update the <antcall> manual page to reflect this information?"}, {"count": 1, "tags": [], "bug_id": 46526, "attachment_id": null, "id": 124031, "time": "2009-01-14T07:24:12Z", "creator": "mbenson@apache.org", "creation_time": "2009-01-14T07:24:12Z", "is_private": false, "text": "! /Users/mbenson/oss/asf/ant/docs/manual> grep -ci \"new project\" CoreTasks/antcall.html \n10\n! /Users/mbenson/oss/asf/ant/docs/manual> \n\n--------\n\nI will concede that the manual could be more explicit:  \"The called target(s) are run in a new project; be aware that this means properties, references, etc. set by called targets will not persist back to the calling project.\"\n\nFinally, you should be aware that for probably going on five years now macros, rather than <antcall>ed targets, are the preferred way to perform compartmentalized tasks within your build.  I don't believe I've run into a situation where a macro wouldn't suffice for what I was trying to accomplish."}, {"id": 124033, "tags": [], "bug_id": 46526, "is_private": false, "count": 2, "text": "(In reply to comment #1)\n> ! /Users/mbenson/oss/asf/ant/docs/manual> grep -ci \"new project\"\n> CoreTasks/antcall.html \n> 10\n> ! /Users/mbenson/oss/asf/ant/docs/manual> \n> \n> --------\n> \n> I will concede that the manual could be more explicit:  \"The called target(s)\n> are run in a new project; be aware that this means properties, references, etc.\n> set by called targets will not persist back to the calling project.\"\n> \n> Finally, you should be aware that for probably going on five years now macros,\n> rather than <antcall>ed targets, are the preferred way to perform\n> compartmentalized tasks within your build.  I don't believe I've run into a\n> situation where a macro wouldn't suffice for what I was trying to accomplish.\n> \n\nI agree about macros and I use them wherever possible. In fact this was part of the reason I came across this issue. I was not used to using antcall (inherited old build code) and didn't understand its behavior.\nAnyway, thanks for the update.", "time": "2009-01-14T07:29:29Z", "creator": "davidcorley@gmail.com", "creation_time": "2009-01-14T07:29:29Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "svn revision 738005", "attachment_id": null, "bug_id": 46526, "id": 124383, "time": "2009-01-26T21:25:44Z", "creator": "bodewig@apache.org", "creation_time": "2009-01-26T21:25:44Z", "is_private": false}]