[{"count": 0, "tags": [], "creator": "bnocera@redhat.com", "attachment_id": null, "id": 123993, "time": "2009-01-13T06:05:50Z", "bug_id": 46521, "creation_time": "2009-01-13T06:05:50Z", "is_private": false, "text": "If I were to create symbolic links to a large file, to be shared via WebDAV, the file will not show up on the client.\n\nIn httpd/modules/dav/fs/repos.c\n        /* ### for now, only process regular files (e.g. skip symlinks) */\n        if (fsctx->info1.finfo.filetype == APR_REG) {\n\nIt should follow the options FollowSymlinks and SymLinksIfOwnerMatch instead.\n\nThis is a problem for users that want to share large files using gnome-user-share (see http://bugzilla.gnome.org/show_bug.cgi?id=326702 )"}, {"count": 1, "tags": [], "bug_id": 46521, "is_private": false, "id": 124029, "creation_time": "2009-01-14T05:20:35Z", "time": "2009-01-14T05:20:35Z", "creator": "jorton@redhat.com", "text": "The traditional attitude to this type of issue has been that \"the DAV repository\" includes content which can be managed by mod_dav, and that does not include symlinks, so symlinks should not be exposed in PROPFIND results.  (nor sockets, named pipes, etc)\n\nSimply saying \"respect FollowSymlinks\" is not really the whole story; we'd still have to decide e.g. how to handle symlinks which point outside the DAV repository, if turned off, for example.\n\nAlso note that SymlinksIfOwnersMatch is not a security feature.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 46521, "attachment_id": null, "id": 187080, "time": "2015-12-21T23:13:04Z", "creator": "ben.rubson@gmail.com", "creation_time": "2015-12-21T23:13:04Z", "is_private": false, "text": "Hello,\n\nCould we think about adding such feature to mod_dav please ?\nModule could keep its current behavior by default, and we could have an option : ShowSymLinks <yes|no>\n\nFor security reasons, links would not have to be followed by server itself.\nSo no risk to give a out-of repository file to the client.\nSymbolic links would simply have to be presented to the client, so that for example client would be able to duplicate them (duplicate these symbolic links as symbolic links on its local storage).\n\nI found a patch proposal which is unfortunately quite outdated today (2003 !) :\nhttp://marc.info/?l=dav-dev&m=105691033506577&w=3\n\nThank you very much !\n\nBen"}]