[{"count": 0, "tags": [], "text": "Created attachment 23129\napr_thread_pool.h updates\n\nThe apr_thread_pool support does not currently allow for any customization of the apr_threads created in the thread pool.  This causes problems on hosts where the default pthread stack size is not large enough to support the execution of the submitted thread pool function.\n\nThe proposed fix, contained in the attachments, introduces a thread pool create attributes handle.  The thread pool create attributes handle has setters for the current apr_thread_pool_create() init_threads and max_threads parameters as well as stacksize and guardsize settings (equivalent to the apr_threadattr_t setters).\n\nThe thread pool attribute does not include a setter for a apr_threadattr_t instance since some of the apr_threadattr_t settings could conflict with the thread pool needs.\n\nA new thread pool create function, apr_thread_pool_create2(), was created to avoid backwards compatibility issues.", "is_private": false, "id": 124092, "creator": "Joe.Mudd@sas.com", "time": "2009-01-15T07:56:32Z", "bug_id": 46540, "creation_time": "2009-01-15T07:56:32Z", "attachment_id": 23129}, {"count": 1, "text": "Created attachment 23130\napr_thread_pool.c updates", "bug_id": 46540, "is_private": false, "id": 124093, "time": "2009-01-15T07:56:53Z", "creator": "Joe.Mudd@sas.com", "creation_time": "2009-01-15T07:56:53Z", "tags": [], "attachment_id": 23130}, {"count": 2, "tags": [], "bug_id": 46540, "attachment_id": null, "is_private": false, "id": 140227, "time": "2010-09-27T11:46:57Z", "creator": "trawick@apache.org", "creation_time": "2010-09-27T11:46:57Z", "text": "Why not just allow an apr_threadattr_t to be provided?  Then, any capabilities added there will be reflected in apr_thread_pool with no extra effort.\n\nAny new APIs can be added only in the unreleased 1.4.x branch or later.  The new threadpool-create function should have \"_ex\" instead of \"2\" appended to the name.\n\nIf you're still interested in this, I suggest posting to the dev@apr mailing list asking for feedback on which direction to go for the new feature (assuming no other devs follow up here)."}]