[{"count": 0, "tags": [], "bug_id": 46561, "attachment_id": null, "is_private": false, "id": 124186, "time": "2009-01-19T08:10:54Z", "creator": "mark.melvin@gmail.com", "creation_time": "2009-01-19T08:10:54Z", "text": "If I run the following command line (on Windows XP and Windows Server 2003):\n\nant.bat -Da.property=1,2,3\n\nThis fails with the message:\n\nTarget \"2\" does not exist in the project \"test\".\n\nIf I run Java with a similar command line, the property \"a.property\" is set to the expected value of \"1,2,3\".\n\nNote that I can get Ant to succeed by double-quoting the entire argument as follows:\n\nant.bat \"-Da.property=1,2,3\"\n\nHowever, this should not be necessary.  And in fact, it is not always practical.   I am running into an insurmountable issue where Ant is being called from my build server, and the build server constructs the command line.  I need a property set on the command line that contains a comma and I have no control over command line argument creation.  \n\nIs there another way I can work around this?"}, {"attachment_id": null, "tags": [], "bug_id": 46561, "is_private": false, "count": 1, "id": 124188, "time": "2009-01-19T09:29:05Z", "creator": "ddevienne@gmail.com", "creation_time": "2009-01-19T09:29:05Z", "text": "Sorry, but this is not a bug. The command shell (DOS) in this case is the one interpreting the command line before Ant sees it, and the quoting to be done is Shell dependent.\n\nWe can't do anything about this. --DD"}, {"count": 2, "text": "Well, I think things could be worked around in Ant.bat as you are exposing the shell's argument weaknesses by rebuilding all the args using SHIFT.  This forces you to accept the result - which is that the DOS prompt splits arguments on all delimiters.  If you didn't use SHIFT you would not have the problem.  \n", "creator": "mark.melvin@gmail.com", "is_private": false, "id": 124191, "time": "2009-01-19T11:03:38Z", "bug_id": 46561, "creation_time": "2009-01-19T11:03:38Z", "tags": [], "attachment_id": null}, {"count": 3, "tags": [], "creator": "ddevienne@gmail.com", "attachment_id": null, "text": "If you can provide a functionally equivalent ant.bat which does not exhibit the issue you reported regarding comma handling, we'd gladly take it, although the Ant team is quite reticent to ant.bat changes in general since they tend to be so brittle, as you probably well know since you mention DOS' weakness in the domain.\n\nMaybe you can substitute ant.bat for a .bat of your own doing?", "id": 124195, "time": "2009-01-19T15:59:48Z", "bug_id": 46561, "creation_time": "2009-01-19T15:59:48Z", "is_private": false}]