[{"count": 0, "tags": [], "bug_id": 46576, "is_private": false, "text": "It would be useful to be able to control extracted text by type of cell.\ne.g. omit numeric/boolean etc.\n\nThe idea would be for ExcelExtractor class(es) to have methods such as:\n\npublic void setInclude( int cellType, boolean incl );\npublic boolean isIncluded( int cellType );\n\nwhere cellType comes from: org.apache.poi.ss.usermodel.Cell.CELL_TYPE_*\n\nnumeric and boolean are my primary concern (as they are not important in my use case), but each cell type would be more generic.\nA named method per type is also sufficient if that is more of the coding standard being employed.", "id": 124240, "time": "2009-01-21T11:42:01Z", "creator": "woody@xoopit.com", "creation_time": "2009-01-21T11:42:01Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 46576, "is_private": false, "count": 1, "id": 124266, "time": "2009-01-22T01:40:49Z", "creator": "apache@gagravarr.org", "creation_time": "2009-01-22T01:40:49Z", "text": "If you want that degree of fine grained control, you'll be much better off just writing your own HSSF Usermodel code to loop over the workbook, pulling out and formatting things as you see fit.\n\nSee the documentation on the site for starters, and maybe also take a look at how the current extractor does it"}, {"count": 2, "tags": [], "creator": "woody@xoopit.com", "is_private": false, "text": "due to the fact that there are multiple implementers of ExcelExtractor and duplicating them and the factory logic makes it difficult to incorporate subsequent bug fixes and/or enhancements in the extractor code lines, it's not a great move to dupe them simply to get this minor addition, at least from my perspective (focused as it is).\n\ni wrote the logic into the extractors, and augmented the EventBasedExtractor to implement the ExcelExtractor interface as well. Cleaned up some stringbuffer code and aligned some constants that were (somewhat) dangerously defined. This is in the following patch.\n\ni would appreciate your review:\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=46581\n\n\n(In reply to comment #1)\n> If you want that degree of fine grained control, you'll be much better off just\n> writing your own HSSF Usermodel code to loop over the workbook, pulling out and\n> formatting things as you see fit.\n> \n> See the documentation on the site for starters, and maybe also take a look at\n> how the current extractor does it\n> \n\n", "id": 124299, "time": "2009-01-22T10:33:09Z", "bug_id": 46576, "creation_time": "2009-01-22T10:33:09Z", "attachment_id": null}]