[{"count": 0, "tags": [], "bug_id": 46583, "text": "Created attachment 23157\ntiling patterns patch\n\nThis patch allows to make and use postscript tiling patterns. Tiling patterns consist of a small graphical figure (called a pattern cell) that is replicated at fixed horizontal and vertical intervals to fill the area to be painted. \n\nNotice that a image (a texture) must not be a too large, otherwise the postscript error 'limitcheck' will be generated (on ps printer or in ps viewer).", "id": 124263, "time": "2009-01-22T00:45:50Z", "creator": "kunhart@kadel.cz", "creation_time": "2009-01-22T00:45:50Z", "is_private": false, "attachment_id": 23157}, {"text": "Sorry for not responding earlier. Thank you for your patch. This is a nice addition. However, before I can process your patch, can I ask you to do the following:\n\n- Since your patch includes new files, please fill out and send an ICLA (Individual Contributor License Agreement, see [1] for details). Depending on your work contract you may also need to ask your employer to consider sending in a CCLA.\n\n[1] http://apache.org/licenses/#clas\n\n- Please put the same license header you find in our other source files on top of the new files you create to clearly indicate that you are donating this to the ASF.\n\n- And finally, please rework the patch to make it Java 1.4 compatible. (this point I can handle for you if you want but it would be great if you could do it while you add the license headers)\n\n- One note on the code while taking a quick look: You used an ArrayList for the bounding box. Please consider using a java.awt.Rectangle instead.\n\nI hope you understand. Thank you very much!", "tags": [], "bug_id": 46583, "is_private": false, "count": 1, "id": 124705, "time": "2009-02-07T03:31:24Z", "creator": "jeremias@apache.org", "creation_time": "2009-02-07T03:31:24Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "kunhart@kadel.cz", "attachment_id": 23267, "is_private": false, "id": 124886, "time": "2009-02-17T01:43:05Z", "bug_id": 46583, "creation_time": "2009-02-17T01:43:05Z", "text": "Created attachment 23267\njava 1.4 compatible patch"}, {"count": 3, "tags": [], "bug_id": 46583, "text": "Jeremias, it should be ok now.\nI have sent ICLA and CCLA licenses, the patch is now java 1.4 compatible, headers are included and Rectangle instead of Array is used.", "id": 124887, "time": "2009-02-17T01:54:52Z", "creator": "kunhart@kadel.cz", "creation_time": "2009-02-17T01:54:52Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 46583, "is_private": false, "id": 124918, "time": "2009-02-18T00:46:20Z", "creator": "jeremias@apache.org", "creation_time": "2009-02-18T00:46:20Z", "tags": [], "text": "Thank you, Jiri. I'll process your patch as soon as your ICLA is recorded. That could take a few days, though."}, {"count": 5, "tags": [], "bug_id": 46583, "text": "Jiri, your CLA still hasn't shown up. :-( How did you submit it? In the meantime, there have been a number of batches with CLAs but yours was not among them.", "id": 125236, "time": "2009-03-02T00:41:55Z", "creator": "jeremias@apache.org", "creation_time": "2009-03-02T00:41:55Z", "is_private": false, "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 46583, "is_private": false, "id": 125237, "time": "2009-03-02T01:00:02Z", "creator": "kunhart@kadel.cz", "creation_time": "2009-03-02T01:00:02Z", "tags": [], "text": "Jeremias,\n\nI sent it via email to secretary@apache.org, 14 days ago (17.2.2009), the subject was \"FOP ICLA and CCLA\". Should I send it again?"}, {"count": 7, "tags": [], "bug_id": 46583, "text": "If it's no trouble for you, yes, please do. I'll talk to the secretary directly if it doesn't appear by next week. Thanks for your patience.", "id": 125238, "time": "2009-03-02T01:03:19Z", "creator": "jeremias@apache.org", "creation_time": "2009-03-02T01:03:19Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 46583, "text": "No problem Jeremias. I have sent it again.", "id": 125240, "time": "2009-03-02T01:10:20Z", "creator": "kunhart@kadel.cz", "creation_time": "2009-03-02T01:10:20Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 46583, "text": "Jiri, your ICLA (and the CCLA) has finally been recorded. I've also already taken the time to process the patch and applied it with modifications:\nhttp://svn.apache.org/viewvc?rev=752822&view=rev\n\nAs you can see in the commit message, I found a bug concerning the anchor rectangle. I found that using the example I've just committed:\nhttp://svn.apache.org/viewvc?rev=752824&view=rev\n\nAnother problem which I didn't realize earlier is that your changes violate the DSC specification. Here's the scenario:\nCreate a PostScript document with two pages and use the same TexturePaint on both pages. Then extract the second page according to DSC rules and you get an invalid PostScript file (because it misses the pattern that is part of the first page).\nThe example above demonstrates this. This is not catastrophic but it should be fixed at some point. This is why I'll leave this issue open for the time being.\n\nI think there are two approaches:\n1. limit the reuse of tiling patterns to one page and ignore DSC for pattern resources.\n2. Tie pattern resources into resource tracking. This will require changes in PSDocumentGraphics2D similar to what we do in Apache FOP: we create the PostScript file as a temporary file and create common resources in the setup part in a second pass. See: http://svn.eu.apache.org/viewvc/xmlgraphics/fop/trunk/src/java/org/apache/fop/render/ps/ResourceHandler.java?view=markup\n\nThanks for your patience, Jiri.", "id": 125513, "time": "2009-03-12T03:14:56Z", "creator": "jeremias@apache.org", "creation_time": "2009-03-12T03:14:56Z", "is_private": false, "attachment_id": null}, {"count": 10, "tags": [], "text": "Hi Jeremias,\n\nI checked your changes about anchor rectangle in the code and I think you did it very well. But now I think, there is no reason to define the patterns in the ResourceHandler, because now every pattern is unique - because of the line \n\"x y translate\" in PaintProc - x and y will be always different (there is no reason to draw the same pattern (if I say the same pattern I mean the same binary data of pattern) on the same position (I mean the position which is specified by \"x y translate\") several times). So I decided to delete class PSPatternStorage, don't use the ResourceHandler and the pattern define directly on a page where is used.", "is_private": false, "id": 127406, "creator": "kunhart@kadel.cz", "time": "2009-05-26T06:05:08Z", "bug_id": 46583, "creation_time": "2009-05-26T06:05:08Z", "attachment_id": null}, {"count": 11, "tags": [], "creator": "kunhart@kadel.cz", "text": "Created attachment 23720\nPatterns will not violate DSC rules after using this patch\n\nThis patch remove the class PSPaternStorage and all references to it. Patterns will not violate DSC rules, but now the same pattern can be defined more than one time on the page (document) => the size of the output file can be a bigger than it is necessary. The right solution would be to define pattern resources in the begin of the ps document, similarly how it is done for fonts and images.", "id": 127443, "time": "2009-05-27T07:08:39Z", "bug_id": 46583, "creation_time": "2009-05-27T07:08:39Z", "is_private": false, "attachment_id": 23720}, {"count": 12, "tags": [], "text": "Latest patch applied: http://svn.apache.org/viewvc?rev=804444&view=rev\n\nThanks a lot, Jiří and sorry for the slow reaction time! Pattern generation now looks fine to me. I think that means we can close this issue here.", "is_private": false, "id": 129699, "creator": "jeremias@apache.org", "time": "2009-08-15T02:15:05Z", "bug_id": 46583, "creation_time": "2009-08-15T02:15:05Z", "attachment_id": null}]