[{"count": 0, "text": "Created attachment 23158\nwebapp with example\n\nOnly on a linux installation of tomcat I have this problem (fedora core 8 and fedora core 10 updated to last software versions).\n\nUsing the webapp in attach on a tomcat 6.0.18 and only with the tomcat-native library, it's impossible to download the jar to download this url:\nhttp://ip:port/test/a.jar\nwhile is possibile to downlaod this:\nhttp://ip:port/test/b.jar\n\nif you remove the unique jar in WEB-INF/lib or remove the tomcat-native library, the problem is not present.\n\nThank you\nmassimo", "bug_id": 46586, "attachment_id": 23158, "id": 124272, "time": "2009-01-22T04:06:49Z", "creator": "massimo.dellandrea@katamail.com", "creation_time": "2009-01-22T04:06:49Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "flavio.crispim@gmail.com", "attachment_id": null, "is_private": false, "id": 124281, "time": "2009-01-22T04:56:19Z", "bug_id": 46586, "creation_time": "2009-01-22T04:56:19Z", "text": "I found that on:\nWinXP SP3, TC5.5 without native - OK\nWinXP SP3, TC5.5 with native - OK\nWinXP SP3, TC Trunk without native - OK\nWinXP SP3, TC Trunk with native - response start after 17 seconds"}, {"count": 2, "tags": [], "bug_id": 46586, "attachment_id": null, "text": "(In reply to comment #1)\n> I found that on:\n> WinXP SP3, TC5.5 without native - OK\n> WinXP SP3, TC5.5 with native - OK\n> WinXP SP3, TC Trunk without native - OK\n> WinXP SP3, TC Trunk with native - response start after 17 seconds\n> \n\nin case:\nWinXP SP3, TC Trunk with native - response start after 17 seconds\nbut is the file empty?\n\nIn linux with native, after 15-20 seconds I retrieve the file, but empty.", "id": 124286, "time": "2009-01-22T06:15:58Z", "creator": "massimo.dellandrea@katamail.com", "creation_time": "2009-01-22T06:15:58Z", "is_private": false}, {"count": 3, "tags": [], "creator": "flavio.crispim@gmail.com", "text": "Yes, the downloaded file is empty.", "id": 124287, "time": "2009-01-22T06:46:24Z", "bug_id": 46586, "creation_time": "2009-01-22T06:46:24Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 46586, "attachment_id": null, "id": 124296, "time": "2009-01-22T09:33:58Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2009-01-22T09:33:58Z", "is_private": false, "text": "Do you know where to get sources for that appbase-1.0.jar ? It is c.s.rave.web.ui.appbase.servlet.LifecycleListener class in it that triggers the issue.\n\nMy analysis, wrt TC 6.0 is the following:\n\n1. WEB-INF/lib/appbase-1.0.jar file contains META-INF/taglib.tld Tag Library Descriptor file, that registers LifecycleListener class as a listener.\n\n2. I won't dig into details of LifecycleListener class, but the essence is that its implementation of ServletRequestListener#requestDestroyed( ) method does remove _all_ attributes from the ServletRequest.\n\nMaybe it should resort to removing only the ones that implement those *Bean interfaces, but, oh well, I do not see anything in its behavior to be against the spec. Though it is certainly a trick.\n\n3. o.a.c.servlets.DefaultServlet (the servlet that serves the static files) uses request attributes to deliver file name and other information to sendfile support in Apr/Nio - see method of DefaultServlet#checkSendfile() for details.\n\nNote, that sendfile support is only used if the file size is greater than some threshold that can be specified when configuring DefaultServlet (by default in TC 6.0: 48 Kb). That is the only substantial difference between a.jar and b.jar.\n\n4. requestDestroyed( ) event is sent by o.a.c.core.StandardContextValve#invoke()\n\n5. All the following is a theory. I have not tested it on a running Tomcat instance:\n\nI suspect that the removal of the request attributes occurs before the file is served by the sendfile support in Http11(Apr/Nio)Processor. That is, the following events happen:\n\n1) DefaultServlet#checkSendfile() checks that sendfile support should be used, sets the request attributes and skips further processing.\n2) StandardContextValve calls requestDestroyed( ) and LifecycleListener class removes all attributes from the request\n3) Http11(Apr/Nio)Processor does not receive information about the file that it has to send.\n\nMaybe this can be fixed by triggering Http11(Apr/Nio)Processor#prepareResponse() before the requestDestroyed( ) event occurs. That is, by invoking o.a.coyote.Response#sendHeaders() through a call to javax.servlet.ServletResponse#flushBuffer().\n\nNote: you can disable sendfile support in DefaultServlet by configuring it with negative value for sendfileSize. See\nhttp://tomcat.apache.org/tomcat-6.0-doc/default-servlet.html\n\n(In reply to comment #1):\n> WinXP SP3, TC5.5 without native - OK\n> WinXP SP3, TC5.5 with native - OK\n\nI suspect that the Listener in appbase-1.0.jar was ignored by TC5.5 (see bug 40809, esp. comment #8 there), thus not triggering the issue. Note, that web.xml should be changed to follow the Servlet 2.4 spec to properly deploy the app in TC5.5."}, {"count": 5, "tags": [], "bug_id": 46586, "text": "This is a bit of a grey area but given that:\n - attributes may be set by the container (SRV.3.2)\n - there is generally no need to remove attributes (ServletRequest.removeAttribute javadoc)\n - some attributes are explicitly reserved for use by Sun\nit is clear that request attributes may be set outside of the application's control. Therefore, removing all request attributes is likely to have unexpected side effects as seen here.\n\nGiven the above, it is good practise for components to only attempt to manipulate the request attributes that they own. On this basis I am marking the bug as WONTFIX.\n\nAs Konstatin notes, disabling sendfile support should fix this as would changing the listener not to remove all request attributes. If neither of these is possible, then using a custom default servlet with an added call to flushBuffer() should work. If you need assistance writing or configuring your own version of Tomcat's default servlet please ask on the users list.", "id": 124641, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2009-02-03T22:47:57Z", "time": "2009-02-03T22:47:57Z", "is_private": false}]