[{"count": 0, "text": "When there is any CGI scripts, or modules loaded, Apache's current behaviour of returning 501 on an unknown method goes against the definition of the status code in RFC2616. This is because the server might support the method on some resource which is accessed by the CGI/module.\n\nTo quote the 501 status code definition:\n\n\"The server does not support the functionality required to fulfill the request. This is the appropriate response when the server does not recognize the request method and is not capable of supporting it for any resource.\"\n\nWhile none of this is normative, the latter sentence makes this behaviour incorrect for Apache. I might have a CGI/module accessed resource which can support the method, even if Apache itself, serving static files, cannot.\n\nI would suggest using \"405 Method Not Allowed\", but I realize that this requires sending an Allow header, which may not be possible.\n\nTo re-create: access any resource served by Apache directly (and not via a module or CGI script) using the method \"foo\" and view the status code.", "bug_id": 46615, "attachment_id": null, "id": 124409, "time": "2009-01-27T15:16:47Z", "creator": "geoffers+asfbug@gmail.com", "creation_time": "2009-01-27T15:16:47Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "I just noticed it already sends an Allow header, so it is certainly possible to return 405.", "is_private": false, "bug_id": 46615, "id": 124410, "time": "2009-01-27T15:19:03Z", "creator": "geoffers+asfbug@gmail.com", "creation_time": "2009-01-27T15:19:03Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "nick@webthing.com", "attachment_id": null, "id": 130051, "time": "2009-08-29T22:33:50Z", "bug_id": 46615, "creation_time": "2009-08-29T22:33:50Z", "is_private": false, "text": "This is a configuration issue.  It's the default handler that returns 501, and it only reaches the default handler if no module or script has handled the request - which means that nothing handles the method.  501 is correct at this point.\n\nYou could of course work around it, either with an ErrorDocument or in your module/script."}]