[{"count": 0, "attachment_id": null, "creator": "bburette@noos.fr", "text": "When using \"rotatelogs\" with \"-l\" option and a \"%\" in filename (triggering calling strftime to get actual file name), the exploded time information passed to strftime is in UTC (because apr_time_exp_gmt() is called?)\n\nSo using the following line \"rotatelogs -l log/%Y-%m-%d 3600\" creates log files properly following DST changes but the names of those files follow UTC values. \n\nFor instance in time zone \"Europe/Paris\" (GMT+1 with DST) the files end in localtime at 0:59:59 in winter and 1:59:59 in summer: thus starting today (in winter) httpd at 0:30:00 will output 30 minutes in a log named \"yesterday\" then switch at 1:00:00 to \"today's\" date.\n\nSince using the \"-l\" option means something like \"use localtime not GMT+offset\" it would be neat to have the log name in localtime as well.\n\n***** rotatelogs.c\n  246:\n  247:                  apr_time_exp_gmt(&e, tNow);\n  248:                  apr_strftime(buf2, &rs, sizeof(buf2), szLogRoot, &e);\n***** rotatelogs.new.c\n  246:\n  247:                  if (use_localtime)\n  248:                      apr_time_exp_lt(&e, tNow);\n  249:                  else\n  250:                      apr_time_exp_gmt(&e, tNow);\n  251:                  apr_strftime(buf2, &rs, sizeof(buf2), szLogRoot, &e);\n*****", "id": 124412, "time": "2009-01-27T17:08:37Z", "bug_id": 46616, "creation_time": "2009-01-27T17:08:37Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "In the configuration used there \"rotatelogs\" was running in a chrooted environment and could not access the files for timezone information so it was in fact using GMT time instead of localtime in all date/time related stuff.\n\nAdding the proper timezone files to the chrooted environment solved the bug.\n\nStill, the documentation improperly states (and led me to think there was a bug)\n\n-l\n    Causes the use of local time rather than GMT as the base for the interval or for strftime(3) formatting with size-based rotation. Note that using -l in an environment which changes the GMT offset (such as for BST or DST) can lead to unpredictable results!\n\nwhere I would rather read\n\n-l\n    Causes the use of local time rather than GMT as the base for the interval and for strftime(3) formatting. Using -l in an environment which changes the GMT offset (such as for BST or DST) is safe.\n", "is_private": false, "bug_id": 46616, "id": 124703, "time": "2009-02-07T01:15:01Z", "creator": "bburette@noos.fr", "creation_time": "2009-02-07T01:15:01Z", "attachment_id": null}]