[{"count": 0, "tags": [], "bug_id": 46623, "attachment_id": 23189, "text": "Created attachment 23189\nWireShark response description, when connecting directly to JBoss and via IIS\n\nI am using JBoss 4.0.2, which has Tomcat Servlet Container 5.5.\nI also have IIS 6.0 redirected to this JBoss. (via IIS tomcat connector, which is used as ISAPI filter in IIS). All is working OK, configured the workers as described in documentation.\n\nHere is a piece of workers.properties file of the connector:\n\nworker.jboss0_ajp13.port=8009\nworker.jboss0_ajp13.type=ajp13\nworker.jboss0_ajp13.host=localhost\nworker.jboss0_ajp13.socket_keepalive=1\nworker.jboss0_ajp13.socket_timeout=300\n\nBut when connecting to the application via IIS (port 80), for each completed HTTP response for HTTP request, the socket is closed (FIN is sent on the TCP layer and \"Connection: close\" is sent on the HTTP layer). This causes severe slowdowns, since the application is working over WAN. (for each closed socket, another one needed to be established, which takes 500ms).\n\nThis is not happening when connecting to JBoss web server directly, and also not happening when connecting to a different virtual directory on the same WebSite of IIS (i.e. Keep-Alive in IIS is also configured).\n\nThis happens with the latest version of tomcat IIS connector (1.2.27).\n\nAttaching WireShark description of the response w/wo IIS redirection.", "id": 124454, "time": "2009-01-29T01:22:40Z", "creator": "kpectbi@gmail.com", "creation_time": "2009-01-29T01:22:40Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 46623, "text": "Up until 1.2.27 this was the behaviour of the IIS connector (IIS forces all ISAPI extensions to implement their own HTTP keep alive, and the IIS connector didn't do this).\n\nIn 1.2.27 there's experimental, build-time, support for HTTP 1.1 chunked encoding, which should permit persistent connections.\n(I've been using pretty much the same code in production systems for about 4 years, but it should be considered experimental in the JK codebase until it's been stable for a while).\n\nGrab the -chunked binary from one of the download mirrors and read about how to configure chunked encoding in the 1.2.27 release notes (you have to get the right build, and enable it in your config).\nYou can verify that the connector is using chunked encoding with debug logging on, and a TCP/Wireshark trace should show connections being reused.\n\nIf you're still getting closed connections, and the logs show that the connector is attempting (or should be attempting) chunked encoding, then it's probably best to discuss on the users list and then reopen with another Wireshark trace + connector debug log once you're sure there's an issue.\n", "id": 124457, "time": "2009-01-29T02:01:00Z", "creator": "Tim.Whittington@orionhealth.com", "creation_time": "2009-01-29T02:01:00Z", "is_private": false, "attachment_id": null}]