[{"count": 0, "tags": [], "creator": "skeswani12@gmail.com", "attachment_id": null, "text": "Server version: Apache/2.2.6 (Win32)\nCompiled using: APR 1.2.11, APR-Util 1.2.10\nArchitecture:   32-bit\nServer MPM:     WinNT\n\n# httpd.com\nLISTEN myhost:80\n\n#/etc/hosts\n# there are two exact same entries in the host file\n138.42.223.12 myhost\n138.42.223.12 myhost1 \n\n# the reason we use this pattern is to enable us to listen on IPv6 addresses in addtion to Ipv4 address\n\n#Httpd fails to start with following error \nThe Apache service named  reported the following error:\n>>> (OS 10048)Only one usage of each socket address (protocol/network address/port) is normally permitted.  : make_sock: could not bind to address 138.42.218.137:80     .\n\n#expected, httpd should check if it is already listening on IP:port, if so any subsequent attempts to listen on the same IP and port are no-ops", "id": 124492, "time": "2009-01-29T11:38:51Z", "bug_id": 46630, "creation_time": "2009-01-29T11:38:51Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 46630, "text": "sorry error on my part, host file should have exact same entry two or more times\n(the lines should read as follows)\n#/etc/hosts\n# there are two exact same entries in the host file\n138.42.223.12 myhost\n138.42.223.12 myhost", "id": 124493, "time": "2009-01-29T11:41:45Z", "creator": "skeswani12@gmail.com", "creation_time": "2009-01-29T11:41:45Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 46630, "attachment_id": null, "id": 124495, "time": "2009-01-29T11:43:56Z", "creator": "wrowe@apache.org", "creation_time": "2009-01-29T11:43:56Z", "is_private": false, "text": "Refer to the syntax of the Listen directive.\n\nUsing domain names in the Listen directive is a convenience, but not an excuse\nto ignore the rule of having one and only one Listen directive per IP/Port."}, {"count": 3, "tags": [], "bug_id": 46630, "text": "there is a legitimate use case to use hostname\n1. suppose you have machine with nultiple IP address\n2. what if there is Ipv6 and Ipv4\n3. finally for dhcp based systems the IP address may change sometimes, in which case hostname is the only options.\n\nobviously, all of the above have workarounds. but that does not detract from the issue that the http daemon should not attempt to bind to a socket that it has already acquired", "id": 124497, "time": "2009-01-29T11:55:57Z", "creator": "skeswani12@gmail.com", "creation_time": "2009-01-29T11:55:57Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 46630, "text": "It's not httpd's job to fix your config file.  And there are legitimate\nreasons not to cause DNS lookups at startup (and especially while the server\nis processing requests).  You are better off using IP addresses rather than\ndomain names where applicable to ensure the server can start even when DNS\nisn't ready to process lookups.", "id": 124498, "time": "2009-01-29T12:12:26Z", "creator": "wrowe@apache.org", "creation_time": "2009-01-29T12:12:26Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 46630, "text": "1. there is no dns lookup involved here. this is the /etc/host file and the machine is querying its own hostname.\n2. surely i am better off using IP addresses. as i said there are workaround for sure. (in my case that is not a option available to me)\n3. however that does not take away from the fact that httpd is trying to bind to a socket it has already acquired. i have only uncovered one manifestation of this issue - hopefully the only one.\n(think of this as trying to call open on file that you already have opened - obviously that would be a error condition).", "id": 124504, "time": "2009-01-29T15:23:58Z", "creator": "skeswani12@gmail.com", "creation_time": "2009-01-29T15:23:58Z", "is_private": false, "attachment_id": null}]