[{"count": 0, "attachment_id": null, "bug_id": 46658, "text": "Version 2.0.3 of the service starter (version according to file-properties in windows) (version for x64) will read the settings for tomcat startup from the registry key HKEY_LOCAL_MACHINE\\SOFTWARE\\Apache Software Foundation\\Procrun 2.0\\<SERVICE NAME>\n\nThe Version 2.0.4 (also version for x64) will read the settings from the win32 compatibility branch of the registry HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Apache Software Foundation\\Procrun 2.0\\<SERVICE NAME>\n\nThis and should not be that way. When migrating from an x32 environment, the settings are in the same path as the x64 are expected to be. The second path (WOW6432Node) is only to be used by x32 applications running on x64 and accessing the registry (actually windows will realize the 32bitness of the accessor and redirect the access into the Wow6432node hive).\n\nI suppose that someone configured using tomcat5w.exe x32 and then the tomcat5.exe x64 did not find the settings?\nA possible fix might be that both hives are sought, first the x64 standard path and if it is not found there, then the x32 WOW hive is checked.\n\nRemark: \nI tried to give the fix a try for myself, but I was not able to identify the Version 2.0.3 or 2.0.4 in the commons-daemon project. There I only found 1.0.1 or 1.0 versions, this leaves the question: which version is integrated in Tomcat?", "id": 124627, "time": "2009-02-03T05:48:40Z", "creator": "t.strauss@srs-management.de", "creation_time": "2009-02-03T05:48:40Z", "tags": [], "is_private": false}, {"count": 1, "text": "> This and should not be that way.\n\nBut it should, since both 32 and 64 bits are supported\nand can live together.\nThe main reason is the installer which is 32bit and creates\nthe key under Wow6432Node\nAny 64bit would simply fail because of missing registry.\n\nThe solution is to move your existing key to Wow6432Node\nlike you observed. I doubt it's worth to complicate things\nand add extra checking for registry.\n\n", "bug_id": 46658, "is_private": false, "id": 124632, "time": "2009-02-03T09:28:27Z", "creator": "mturk@apache.org", "creation_time": "2009-02-03T09:28:27Z", "tags": [], "attachment_id": null}, {"count": 2, "text": "Fine, I dislike this a lot, since I have setup multiple services using the tomcat5w.exe (x64) V2.0.3 and it wrote it's settings to the \"real place\".\n\nNow I need to do a registry export - edit - import - hope it runs fine cycle :-(\n\nSo, since there are many ways to setup tomcat as a service besides the installer, and version 2.0.3 behaved completely different in this apect, you have complicated things a lot for me.\n\nBTW: The 2.0.3 to 2.0.4 has changed it's behaviour in a way, that could at least have been noted in the docs or in the committers-log somewhere.\n\nBTW2: I still cannot compile my own version, as I cannot find the information on what version the procrun-tomcat is actually running on: Where's the source Luke?", "bug_id": 46658, "is_private": false, "id": 124640, "time": "2009-02-03T13:13:43Z", "creator": "t.strauss@srs-management.de", "creation_time": "2009-02-03T13:13:43Z", "tags": [], "attachment_id": null}]