[{"count": 0, "tags": [], "bug_id": 46668, "attachment_id": null, "is_private": false, "id": 124699, "time": "2009-02-06T13:52:41Z", "creator": "asf-bugzilla@rodneybeede.com", "creation_time": "2009-02-06T13:52:41Z", "text": "When I setup an appender to have a threshold of Level.ALL any log.trace() calls do not get logged.\n\nShould Level.ALL include that level as well.  If not then the api doc should be updated to indicate so."}, {"count": 1, "attachment_id": null, "creator": "asf-bugzilla@rodneybeede.com", "is_private": false, "id": 124700, "time": "2009-02-06T14:04:37Z", "bug_id": 46668, "creation_time": "2009-02-06T14:04:37Z", "tags": [], "text": "Logger.getRootLogger().setLevel(Level.ALL);\n\nThat fixed the issue.  Setting an individual appender to trace doesn't work unless the root logger has that set first.\n\nPerhaps some note in the api doc would be useful."}, {"count": 2, "tags": [], "bug_id": 46668, "attachment_id": null, "id": 124960, "time": "2009-02-18T22:35:05Z", "creator": "hoju@visi.com", "creation_time": "2009-02-18T22:35:05Z", "is_private": false, "text": "Not sure why you resolved this as invalid?  Setting Level.ALL to any individual logger in order to get trace() calls displaying for that logger should work without any manipulation of the root logger.  If it doesn't, then there is a bug, IMO.  I haven't attempted to verify it, but if you attach a testcase showing the bad behavior, it can certainly be fixed.  I leave it up to you as to whether to reopen the bug.\n\nJake"}, {"count": 3, "tags": [], "text": "The reporter wasn't setting the level of a logger, he was setting the threshold of an appender.  Since the trace event never satisfied the effective level of the logger (likely debug by default), it never would have made it to an appender for the threshold to have any effect.  Since setting the threshold did not have the affect he expected, he assumed the defect was in the Level class.\n\nAs long as he set any Logger to Level.ALL or Level.TRACE he would have been ok, he just chose the root.  There was no need to touch the threshold of the Appender.", "is_private": false, "id": 124964, "creator": "carnold@apache.org", "time": "2009-02-19T04:25:48Z", "bug_id": 46668, "creation_time": "2009-02-19T04:25:48Z", "attachment_id": null}]