[{"count": 0, "tags": [], "text": "It would be really great to have a configurable thread to test for the availability of a node in a cluster by the watchdog thread. The ping test is not always enough and in a production environment you don't really want production threads to be used as a way of testing whether a node is available or not. \n\nIn our environment we use the web interface of modjk programatically to stop/start (remove/add to cluster) tomcat nodes in a load balanced cluster while they are upgraded. If the watchdog thread were extended the following additions to the web interface would be handy:\nA function to test a node using the configured request.\nA function to enter a custom url test string to test the node.\n\nFurthermore if the test url could be set dynamically without needing a config reload it would be very handy to do dynamic differentiated testing during the course of a day.\n\nAs a start a url and search string to match on the page would probably be enough.\nEg\nTestUrl='localhost:/myapp/deployinfo.jsp'\nTestString='hello world'\n\n\nMaybe in the future one could extend this even more to submit xml(soap, something else) to a server and have a seperate parser/program to evaluate the result. This is probably beyond the scope of modjk but I thought it good to mention non the less for any interesting other ideas it might provoke.", "attachment_id": null, "id": 124724, "creator": "gerhardus.geldenhuis@gmail.com", "time": "2009-02-09T03:42:15Z", "bug_id": 46676, "creation_time": "2009-02-09T03:42:15Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 46676, "attachment_id": null, "text": "Original email from tomcat-users mailing list that prompted report:\n\nPing tests, whether there is something able to still process AJP on the \nother side of the connection. A configurable request would be able to \ntalk to the application, so one could detect, whether it is still \ndeployed, and if the request would be handled by an intelligent servlet \nit could respond with some sort of application layer health status.\n\nWorth filing an enhancement request, since Mladen put the Watchdog \nthread into 1.2.27, we can easily add more logic of that type.\n\nRegards,\nRainer\n", "id": 124725, "time": "2009-02-09T03:46:47Z", "creator": "gerhardus.geldenhuis@gmail.com", "creation_time": "2009-02-09T03:46:47Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 46676, "text": "Maybe you're not interested in this anymore, but I wrote a patch to do this. See here:\n\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=54621", "id": 165539, "time": "2013-02-28T13:47:10Z", "creator": "alan.fitton@igmarkets.com", "creation_time": "2013-02-28T13:47:10Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "markt@apache.org", "text": "We don't need multiple issues tracking the same request.\n\nI'd normally close the newer issue as a duplciate but since the newer issue has a patch it is better to leave it open. I am therefore closing this request as a duplciate of the new issue that has the patch.\n\n*** This bug has been marked as a duplicate of bug 54621 ***", "count": 3, "id": 165542, "time": "2013-02-28T14:00:50Z", "bug_id": 46676, "creation_time": "2013-02-28T14:00:50Z", "is_private": false}]