[{"count": 0, "tags": [], "creator": "david@multer.com", "attachment_id": null, "id": 124736, "time": "2009-02-09T09:26:39Z", "bug_id": 46682, "creation_time": "2009-02-09T09:26:39Z", "is_private": false, "text": "I have an installation HTTPD running on a Mac OS X 10.5 system that uses mod_proxy to front a Tomcat 6 installation.\n\nHere's my httpd.conf excerpt for the virtual host:\n    ProxyPass /hudson/ ajp://sub.domain.com:8009/app/\n    ProxyPassReverse /hudson/ ajp://sub.domain.com:8009/app/\n\nThe proxy works fine, but after some amount of time (days), I start getting a \"502 GET /app/ error reporting a DNS failure for sub.domain.com\". Once it gets in this state, I must stop and then restart Apache (a restart won't fix it). While in this state, Tomcat is running fine as I can get directly to it with a port 8080 reference.\n\nI inserted log messages directly into the code and have determined that APR is getting an EAI_AGAIN return value from getaddrinfo() after running for a while. I inserted the messages into these files:\n- modules/proxy/proxy_util.c\n- srclib/apr/network_io/unix/sockaddr.c\n\nI've verified that DNS calls are actually still working in other processes via \"host sub.domain.com\", etc. There are no other problems seen on this server when it gets into this state.\n\nNote that I've compiled and run Apache on Mac OS X 10.5.6 (latest). I've been running Apache for many years on this server with no issues until I started using mod_proxy with Tomcat.\n\nMy Apache ./configure is as follows. I built and run Apache on the same Mac system.\n./configure \\\n--prefix=/usr/local/apache2 \\\n--enable-mods-shared=all \\\n--enable-proxy-balancer \\\n--enable-proxy-ajp \\\n--enable-proxy-http \\\n--enable-proxy-ftp \\\n--enable-proxy-connect \\\n--enable-proxy \\\n--enable-ssl \\\n--with-included-apr \\\n--enable-dav \\\n--with-berkeley-db=/usr/local/bdb \\\n--with-dbm=db4 \\\n--enable-so\n\nIt appears to me that Apache/mod_proxy is leaking memory somehow. I have not been able to track down the leak, or identify a test case that will reliably reproduce the problem."}, {"count": 1, "tags": [], "text": "I had the EXACT same issue. Name resolution would completely break for all my virtual hosts every 4 - 10 hours it seemed. It did not matter whether is was a database connection or ProxyPass directive in the virtual host. DNS would break for *all* virtual hosts.\n\nI'm also on the latest Leopard version:  OS X 10.5.6\nWe are running Apache 2.2.11 compiled from source, 32-bit mode (for compatibility with some modules)\n\n./configure --prefix=/usr/local/apache2 --enable-layout=Darwin --enable-mods-shared=all --enable-cache --enable-disk-cache --enable-mem-cache --enable-ssl --enable-proxy --enable-dav --enable-dav-fs --enable-dav-lock --enable-so --enable-rewrite\n\n\nI found a workaround. It appears to be a keepalive issue. I wrote a LaunchDaemon that would curl one of my proxies every couple of minutes. If the http status code was anything but 200, the script would restart apache.\n\nThe funny thing is, apache has not been restarted in days since I launched the daemon. that makes me think it is a keepalive issue.\n\nI have not tried it yet, but adjusting some of the apache environment variables for mod_proxy may help:\n\nforce-proxy-request-1.0, proxy-nokeepalive, proxy-sendchunked, proxy-sendcl, proxy-chain-auth, proxy-interim-response, proxy-initial-not-pooled\n\nWe have had so many issues with Apache on OS X, though, that we are looking to move to Linux in the near future.", "attachment_id": null, "bug_id": 46682, "id": 125654, "time": "2009-03-20T08:38:28Z", "creator": "jon.auman@duke.edu", "creation_time": "2009-03-20T08:38:28Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 46682, "attachment_id": null, "id": 127258, "time": "2009-05-21T18:42:01Z", "creator": "david@multer.com", "creation_time": "2009-05-21T18:42:01Z", "is_private": false, "text": "I too created a cron job to curl one of my virtual host Tomcat apps (via mod_proxy) every 15 minutes and the problem has gone away for me too. Very interesting... I played with the various Apache proxy settings, but wasn't able to avoid the problem through those options. I does appear to only manifest if the site is idle for long periods of time.\n\nMac OS X continues to be a great LAMP platform for me otherwise, and I have a ton of open source packages running with no issue. I hope someone on the Apache dev team takes notice and is able to help on this."}, {"count": 3, "tags": [], "text": "Hi\n\nHave you tried starting apache in system startup context? With that you might be able to avoid ping apache every couple of minutes. \n\n--Satish", "is_private": false, "id": 127441, "creation_time": "2009-05-27T06:48:09Z", "time": "2009-05-27T06:48:09Z", "creator": "iam.kilaru@gmail.com", "bug_id": 46682, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "david@multer.com", "text": "Pinging Apache is only a way to avoid the problem, it's not the root issue. Apache is already started at system startup. If you have more questions, I would suggest email rather than bug comments.", "count": 4, "id": 127442, "time": "2009-05-27T07:02:11Z", "bug_id": 46682, "creation_time": "2009-05-27T07:02:11Z", "is_private": false}]