[{"count": 0, "tags": [], "text": "I'm running vhosts with environment set for easier work.\nSome programs (sendmail, CGIs) need temporary files and they use TMPDIR environment variable (quite default in UN*X world) to decide where to create them.\n\nI provide different TMPDIR for each vhost. However, when running under suexec, processes do not see this variable set, even if I patched suexec to include this variable. Suexec does not see the TMPDIR itself.\nwhen I removed suexec, the variables were available to all executed processes\n(I got error message: Warning: SuexecUserGroup directive requires SUEXEC wrapper.)\nso I think the problem lies somewhere else.\n\nIMHO, setting TMPDIR to any value should not cause any troubles, especially not when programs are running under suexec.\n\nPlease try (help me) to investigate this issue so the TMPDIR wouldn't be cleared off suexec's and environment. Also, please, if you won't find any security issue, add the variable to list of variables that are preserved by suexec.\n\n(asking in apache-users didn't result in any comment/response, please don't close this with advise to start there)", "is_private": false, "id": 124870, "creator": "uhlar@fantomas.sk", "time": "2009-02-16T07:28:43Z", "bug_id": 46716, "creation_time": "2009-02-16T07:28:43Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 46716, "is_private": false, "text": "What's in your configuration file?  How are you setting TMPDIR?  What change did you try to make to suexec?", "id": 125651, "time": "2009-03-20T07:09:12Z", "creator": "poirier@pobox.com", "creation_time": "2009-03-20T07:09:12Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 46716, "attachment_id": null, "id": 129588, "time": "2009-08-09T23:52:09Z", "creator": "uhlar@fantomas.sk", "creation_time": "2009-08-09T23:52:09Z", "is_private": false, "text": "hell, I've missed this. \nI patched suexec to pass two additional environment variables, TMPDIR and HOME. While I can see HOME in my CGI scripts, I couldn't see TMPDIR when running with suexec, without suexec I saw it without problems.\n\nI have added TMPDIR and HOME variables in <VirtualHost> config, different for each virtual host.\n\n<VirtualHost php.nextra.sk>\nServerName php.fantomas.sk\nDocumentRoot /.../\nSuexecUserGroup \"#...\" \"#...\"\nSetEnv TMPDIR \"/.../\"\nSetEnv HOME \"/.../\"\n</VirtualHost>\n\nI apparently should check this with 2.2.12..."}, {"count": 3, "tags": [], "bug_id": 46716, "is_private": false, "text": "It is not safe to allow TMPDIR to be set to arbitrary values. To avoid local privilege escalation vulnerabilities, suexec must ignore it.", "id": 147615, "time": "2011-06-29T18:23:12Z", "creator": "sf@sfritsch.de", "creation_time": "2011-06-29T18:23:12Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 46716, "text": "The need for avoiding privilege escalation vulnerability is exactly the reason why I set TMPDIR to \"arbitrary\" values in virtual hosts (different for each vhost).\nThe only one who can set TMPDIR is the one who configures and/or executes apache process, and that person is able to disrupt security much more than by setting TMPDIR, which is way NOT to disrupt it.", "id": 147629, "time": "2011-06-30T06:56:34Z", "creator": "uhlar@fantomas.sk", "creation_time": "2011-06-30T06:56:34Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "text": "(In reply to comment #4)\n> The only one who can set TMPDIR is the one who configures and/or executes\n> apache process, and that person is able to disrupt security much more than by\n> setting TMPDIR, which is way NOT to disrupt it.\n\nI guess I should have been more verbose. The suexec helper binary (which is setuid root and is responsible for changing the user id) does not read the httpd configuration nor does it have any other trusted channel to httpd where it would get configuration information. It just does what whoever is calling suexec is asking it to do, within the limits that are compiled into suexec. If suexec would allow to set TMPDIR, any user who can call suexec could use it to execute processes as different user with arbitrary values of TMPDIR. At first glance, one could think that this is no problem if suexec is only executable by the runtime group of httpd. But there are many common configurations involving mod_userdir and mod_php or mod_cgi, where any local user can execute arbitrary processes as httpd user. Therefore limiting who can execute the suexec helper does not help in general.\n\nSo, achieving what you want would require suexec to read a configuration before every request. There are some third-party suexec-type wrappers available which can do this but suexec does not and there is little chance that this will be changed.", "attachment_id": null, "bug_id": 46716, "id": 147659, "time": "2011-06-30T19:58:06Z", "creator": "sf@sfritsch.de", "creation_time": "2011-06-30T19:58:06Z", "is_private": false}]