[{"count": 0, "tags": [], "bug_id": 46749, "text": "util_ald_cache_purge() is only called when the max number of entries as defined by LDAPCacheEntries/ LDAPOpCacheEntries is reached. If LDAPSharedCacheSize is too small and the max number of entries is never reached, the ldap cache is never purged and the cache hit rate drops rapidly.\n\n\nThe comment \"/* should be safe to add an entry */\" in util_ldap_cache_mgr.c is simply wrong. At the very least, there should be a warning logged when memory allocation fails. Also, a cache purge should be triggered in this case. When the cache is filled less than the 3/4 watermark, it is not possible to do the normal purge. In this case it may make sense to just purge the whole cache. This will still yield a higher cache hit rate than leaving old entries in the cache indefinitely.\n\nMaybe the LDAPCacheEntries/ LDAPOpCacheEntries could also be adjusted automatically, but this may be problematic as (AFAICS) all caches share the same shared memory segment.", "id": 125031, "time": "2009-02-21T03:12:19Z", "creator": "sf@sfritsch.de", "creation_time": "2009-02-21T03:12:19Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "What version of httpd did this first show up in?  I have a Subversion server running httpd 2.2.11 and Subversion 1.6.4 that does authentication against Active Directory LDAP.  The cache settings are below.  As usage increases the cache hits drop to between 80-90% and when this happens sporadically the time for Subversion operations to complete can increase up to 100 fold.  In my testing I have isolated this to the use of LDAP authentication and am suspecting it is some sort of bug in the caching.  Could that possibly be related to this bug?\n\nLDAPSharedCacheSize 200000\nLDAPCacheEntries 1024\nLDAPCacheTTL 600\nLDAPOpCacheEntries 1024\nLDAPOpCacheTTL 600", "is_private": false, "id": 130634, "creator": "justin@honesthacker.com", "time": "2009-09-24T06:10:16Z", "bug_id": 46749, "creation_time": "2009-09-24T06:10:16Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 46749, "text": "(In reply to comment #1)\nI believe the bug was introduced when porting mod_auth_ldap from 1.3 to 2.0. At least 2.0.63 has the same problem.\n\n> Could that possibly be related to this bug?\n\nYes. In my experience, LDAPSharedCacheSize 200000 is too small for LDAPCacheEntries 1024 (of course it depends on the particular mod_authnz_ldap configuration). Try increasing LDAPSharedCacheSize by a factor of 10 while leaving the other settings constant and see if that helps.", "id": 130650, "time": "2009-09-24T08:53:12Z", "creator": "sf@sfritsch.de", "creation_time": "2009-09-24T08:53:12Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "justin@honesthacker.com", "is_private": false, "text": "Thank you for the quick reply!  I'm implementing your suggestions and will add another comment with the results, which will take an hour or so to see.", "id": 130655, "time": "2009-09-24T09:28:28Z", "bug_id": 46749, "creation_time": "2009-09-24T09:28:28Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "justin@honesthacker.com", "attachment_id": null, "id": 130660, "creation_time": "2009-09-24T12:47:04Z", "time": "2009-09-24T12:47:04Z", "bug_id": 46749, "text": "That resolved it!  Woohoo!  Thanks for your help Stefan!", "is_private": false}, {"count": 5, "tags": [], "creator": "sf@sfritsch.de", "is_private": false, "id": 130918, "creation_time": "2009-10-06T12:41:34Z", "time": "2009-10-06T12:41:34Z", "bug_id": 46749, "text": "Fixed in trunk in r822458", "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 46749, "text": "This has been fixed in 2.2.15", "id": 136001, "time": "2010-04-11T07:39:17Z", "creator": "sf@sfritsch.de", "creation_time": "2010-04-11T07:39:17Z", "tags": [], "is_private": false}]