[{"count": 0, "tags": [], "bug_id": 46756, "attachment_id": 23297, "id": 125070, "time": "2009-02-22T12:52:57Z", "creator": "jukka@apache.org", "creation_time": "2009-02-22T12:52:57Z", "is_private": false, "text": "Created attachment 23297\nPatch to update the NOTICE and LICENSE files\n\nAs discussed on the mailing list, I did a quick review of the main components\nincluded in the latest beta release and updated the LICENSE and NOTICE files\naccordingly.\n\nSee the attached patch for the proposed changes. The updated NOTICE file only\ncontains the copyright attributions required by the various included licenses,\nand the LICENSE file embeds the full license texts (or equivalent) of the\nincluded components.\n\nSome notes:\n\n* I'm not sure if the chunks_parse_cmds.tbl was re-licensed under the ALv2 or if the author granted ASF a CLA-style license to distribute the file. In the latter case we wouldn't need to include the entry I've now added in the NOTICE file.\n\n* The DOM4J license has a weak advertising clause that I asked Apache Legal about. See https://issues.apache.org/jira/browse/LEGAL-43. The initial response suggests that the license is fine and that no extra credit beyond what I've already included is needed.\n\n* The JSR 173 API jar is another slightly troublesome case, see https://issues.apache.org/jira/browse/LEGAL-42. Early response from Apache Legal  suggests that we should rather use the ALv2 version available from Apache Geronimo.\n\n* The XMLBeans NOTICE file is a bit complex. I've tried my best to identify which parts of XMLBeans are included in POI and to include only the relevant entries from the XMLBeans NOTICE.\n\n* I only reviewed the licensing of the included jar files (and the chunds_parse_cmds.tbl file). Are there source files (or non-jar binaries) within POI that are not under ALv2 or that have explicit NOTICE requirements?"}, {"count": 1, "tags": [], "text": "Thanks!\n\nI see that Apache Geronimo uses Woodstox 3.2.0.\n\nFrom http://woodstox.codehaus.org/FAQ it says that it is available with an ASL 2.0 license.\n\nIt would be good to switch this out as soon as we can.", "attachment_id": null, "id": 125075, "creator": "dfisher@jmlafferty.com", "time": "2009-02-22T19:09:50Z", "bug_id": 46756, "creation_time": "2009-02-22T19:09:50Z", "is_private": false}, {"count": 2, "attachment_id": null, "creator": "yegor@dinom.ru", "is_private": false, "id": 125117, "time": "2009-02-24T00:32:47Z", "bug_id": 46756, "creation_time": "2009-02-24T00:32:47Z", "tags": [], "text": "Jukka,\n\nThanks a lot. I applied your patch in r747303 along with the fix from Bug 46758. \nSince we don't use BEA's JSR 173 anymore, I removed its entries from LICENSE and NOTICE.\n\n> The XMLBeans NOTICE file is a bit complex. I've tried my best to identify\n>which parts of XMLBeans are included in POI and to include only the relevant\n>entries from the XMLBeans NOTICE.\n\nYou've included the correct entries. POI only uses the main XMLBeans jar (xmlbeans-2.3.0.jar) which contains the code for W3C XML schemas and Piccolo XML Parser. \n\nRegards,\nYegor"}, {"count": 3, "tags": [], "bug_id": 46756, "attachment_id": null, "text": "(In reply to comment #2)\n> Jukka,\n> \n> Thanks a lot. I applied your patch in r747303along with the fix from Bug\n> 46758. \n> Since we don't use BEA's JSR 173 anymore, I removed its entries from LICENSE\n> and NOTICE.\n\nThere is still a reference to BEA in the NOTICE:\n\n> This product contains parts that were originally based on software from BEA.\n> Copyright (c) 2000-2003, BEA Systems, <http://www.bea.com/>.\n\nRegards,\nDave", "id": 125125, "time": "2009-02-24T07:20:34Z", "creator": "dfisher@jmlafferty.com", "creation_time": "2009-02-24T07:20:34Z", "is_private": false}, {"count": 4, "attachment_id": null, "creator": "yegor@dinom.ru", "text": "> \n> There is still a reference to BEA in the NOTICE:\n> \n> > This product contains parts that were originally based on software from BEA.\n> > Copyright (c) 2000-2003, BEA Systems, <http://www.bea.com/>.\n> \n> Regards,\n> Dave\n\nIt's about XmlBeans.  It was submitted to the Apache Incubator and Apache XML projects by BEA Systems in September 2003.", "id": 125126, "time": "2009-02-24T07:27:46Z", "bug_id": 46756, "creation_time": "2009-02-24T07:27:46Z", "tags": [], "is_private": false}]