[{"count": 0, "attachment_id": null, "creator": "dan.cushing@netideasinc.com", "text": "The configuration directives for Directory containers are supposed to be processed in order of shortest to longest, to allow a general configuration to be overridden by more specific subdirectory directives.  In the configuration below I have specified 'SSLClientVerify require' globally.  In the registration directory, where we cannot yet have it protected, I have specified 'SSLClientVerify none'.  I expected that to override the higher level directive and allow this subdirectory to be accessed without a client certificate.  Instead, it still requires a certificate to be presented.\n\n<Directory \"/webapp/root\">\n  Options None\n  AllowOverride None\n  Order Allow,Deny\n  Allow from all\n  SSLVerifyClient require\n  SSLVerifyDepth 5\n  AuthName \"Web App Name\"\n  AuthType Basic\n  AuthBasicProvider ldap\n  AuthLDAPURL ldap://127.0.0.1/o=netideasinc.com?uid?one\n  Require ldap-group cn=RegisteredUsers,ou=Groups,o=netideasinc.com\n</Directory>\n\n<Directory /webapp/root/registration\">\n  Options None\n  Order Allow,Deny\n  Allow from all\n  SSLVerifyClient none\n  AuthName \"Web App Name\"\n  AuthType Basic\n  AuthBasicProvider ldap\n  AuthLDAPURL ldap://127.0.0.1/o=netideasinc.com?uid?one\n  Require ldap-group cn=RegisteredUsers,ou=Groups,o=netideasinc.com\n</Directory>", "id": 125188, "time": "2009-02-26T06:56:49Z", "bug_id": 46773, "creation_time": "2009-02-26T06:56:49Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 46773, "attachment_id": null, "id": 125190, "time": "2009-02-26T07:10:15Z", "creator": "rpluem@apache.org", "creation_time": "2009-02-26T07:10:15Z", "is_private": false, "text": "Your approach cannot work from a logical point of view. If you require client certificates on a global (virtualhost level) then the client certificate needs to be checked before httpd is supplied with the URL which it enables it to know that a check is not needed here. It is a chicken and egg problem."}, {"count": 2, "tags": [], "creator": "dan.cushing@netideasinc.com", "attachment_id": null, "text": "Just to be clear here, I do not have 'SSLClientVerify require' set at the virtual host level.  I would have expected that to cause a problem.  It is only set at the directory level.  In this case I expected it to work.  If you still believe that this in an unsupported configuration I'll accept that and start looking for a workaround, but I did want to make certain we had a common understanding of the configuration.", "id": 125192, "time": "2009-02-26T07:45:02Z", "bug_id": 46773, "creation_time": "2009-02-26T07:45:02Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 46773, "text": "See OptRenegotiate under\n\nhttp://httpd.apache.org/docs/2.2/mod/mod_ssl.html#ssloptions\n\nIt was a misconfiguration, but it is possible, contrary to Rudiger's comment,\nto trigger the renegotiation only for specific accesses.  Note that this may\nhave a negative impact on large POST requests since the entire request body\nmust be cached first, and that's limited in terms of the bytes to set aside.", "id": 125193, "time": "2009-02-26T07:52:55Z", "creator": "wrowe@apache.org", "creation_time": "2009-02-26T07:52:55Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 46773, "attachment_id": null, "id": 125196, "time": "2009-02-26T10:44:02Z", "creator": "dan.cushing@netideasinc.com", "creation_time": "2009-02-26T10:44:02Z", "is_private": false, "text": "Thanks for your time.  I thought I had pinned it down as a bug.  I'll hit the users group and see if anybody knows the answer.\n\nAppreciate the feedback from Will.  The odd thing is that I'm hitting the <Directory \"/webapp/root/registration\"> location first, so the negotiation should not include any client certificate requirements.  I added OptRenegotiate and it doesn't help.\n\nOdd thing is that I curiously tried it with Firefox and it works perfectly.  IE7 is not working correctly.  Strange to me that this is browser dependent.\n\nJust figured I'd post this to you to close things out."}]