[{"text": "Created attachment 23325\nA diff of changes to fix the broken links in the Ant manual.\n\nI downloaded the Ant manual to avoid constantly having to Google for task definitions, especially when traveling with my laptop. During the download (using SiteSucker, http://www.sitesucker.us) I noticed 15 reports of broken links.\n\nI've gone through the HTML files and fixed the broken links, plus a few other minor fixes. The unified diff patch is attached.\n\nHalf of these are for non-existent API links, which I'll discuss in a moment. I also want to suggest a change for the broken API links (in base_task_classes.html and OptionalTasks/script.html). They currently point to manual/api/... and an explanatory pseudo-error page (manual/api/index.html) is provided to explain the problem. However, this it really only useful (online) if a user navigates to http://ant.apache.org/manual/api/ to search for the root of the problem; otherwise, they just get a 404.\n\nThis is fine, but it makes it more difficult to integrate the manual into my local Ant documentation. On OS X Leopard, Ant is installed in /usr/share/ant/, and the API Javadocs are at /usr/share/ant/docs/javadocs/. It would be really nice if users could seamlessly install the Ant manual at /usr/share/ant/docs/manual/ and have the API links \"just work\". (I'm not sure exactly how other Ant installs are structured, but this seems fairly standard.)\n\nThe easy way to fix this is to replace all occurrences of \"api/org/apache\" with \"../javadocs/org/apache\". The file currently at http://ant.apache.org/manual/api/index.html could be moved to http://ant.apache.org/javadocs/index.html to preserve continuity for online users. (Users that download the manual will have to select where to install it anyway, and a simple note on base_task_classes.html about where the Javadocs are assumed to be can solve the bulk of the problem.)", "tags": [], "bug_id": 46797, "attachment_id": 23325, "count": 0, "id": 125291, "time": "2009-03-03T13:58:20Z", "creator": "quinntaylor@mac.com", "creation_time": "2009-03-03T13:58:20Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 46797, "attachment_id": null, "is_private": false, "id": 125294, "time": "2009-03-03T14:20:56Z", "creator": "quinntaylor@mac.com", "creation_time": "2009-03-03T14:20:56Z", "text": "There are also links to api/index.html in toc.html and OptionalTasks/script.html that would have to be changed if the Javadocs links were to be changed."}, {"count": 2, "tags": [], "creator": "bodewig@apache.org", "text": "the broken links should be fixed in svn trunk, I've applied the remianing part of your patch, thanks.\n\nWe consider our own binary downloads the standard layout rather than how Apple ships it 8-)\n\nSeriously, I don't think the Ant packages for Linux (debian or RPMs) follow the same layout you describe for the Mac package, assuming any filesystem hierarchy other than Ant's own would fail on one system or the other.", "id": 126839, "time": "2009-05-07T02:22:33Z", "bug_id": 46797, "creation_time": "2009-05-07T02:22:33Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 46797, "is_private": false, "text": "Glad the bugs finally got patched. The most important things are the broken links, etc. It will be nice to have those fixed online. As for the rest, I'm fairly ignorant of how Ant is structured on arbitrary systems, so thanks for taking my misguided suggestion for what it was.  :-)", "id": 126854, "time": "2009-05-07T06:37:46Z", "creator": "quinntaylor@mac.com", "creation_time": "2009-05-07T06:37:46Z", "attachment_id": null}]