[{"count": 0, "tags": [], "bug_id": 46800, "attachment_id": null, "id": 125320, "time": "2009-03-04T12:47:56Z", "creator": "alnramz@yahoo.com", "creation_time": "2009-03-04T12:47:56Z", "is_private": false, "text": "I hope this is the correct place for this, if it is not, please point me elsewhere.\n\nUsing the POI 3.4 beta 4 build I have created a utility to convert Excel Spreadsheets from Excel 97/HSSF format to the Excel 2007/XSSF format and vice versa.  Its purpose is to automate the conversion of spreadsheets in real timeon on a Linux system. Most of our spreadsheets are pretty basic (no charts, pivot tables, or macros) and this solution works really well.\n\nHowever I ran into one minor \"snag\".  The org.apache.poi.ss.usermodel.Workbook interface, as well as the HSSFWorkbook and XSSFWorkbook classes all provide a setRepeatingRowsAndColumns() method, but there isn't the converse getRepeatingRowsAndColumns() method.\n\nIs there a way, through the SS/HSSF/XSSF usermodels to discover the settings for the repeating rows and columns as found in Excel's File->PageSetup->Sheet ?  \n\nIf not shouldn't this be added to the API?  Typically I would think that if one can implement the \"set\", the \"get\" would be relatively straightforward to implement but I haven't actually looked at the lower level structures to be certain.  Maybe there is something I'm missing.\n\nPlease let me know if I need to provide more information, I would be glad to post my class I wrote that does this Excel version coversion if that would help clarify.\n-alan ramsey"}, {"count": 1, "tags": [], "bug_id": 46800, "attachment_id": null, "id": 183014, "time": "2015-05-18T20:16:50Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-05-18T20:16:50Z", "is_private": false, "text": "This is fixed via Bug 53500 by providing the methods \n\nSheet.getRepeatingRows() and Sheet.getRepeatingColumns(), \n\ni.e. the methods were added to the Sheet and it's implementations.\n\n*** This bug has been marked as a duplicate of bug 53500 ***"}]