[{"count": 0, "tags": [], "creator": "jisl@oksystem.cz", "attachment_id": 23398, "text": "Created attachment 23398\nPatch for adding forceSign property to force signing of already signed jars\n\nFor Java Webstart applications is crucial to sign all jars in package with one certificate to avoid dialog asking user for granting right for included libraries. For each library the certificate can be different or missing and that can cause problems with running Java Webstart application.\n\nFor avoiding this problems, we need to sign all jars in package with provider's certificate including already signed jars.\n\nAttached patch creates new boolean property forceSign, which defaults to false - previous behavior. When is set to true, method isUpToDate returns false and JAR is then signed with provided certificate.", "id": 125704, "time": "2009-03-23T08:07:31Z", "bug_id": 46891, "creation_time": "2009-03-23T08:07:31Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 46891, "attachment_id": null, "text": "I used force instead of forceSign in svn revision 763661\n\nIf you want to expand on the documentation I've added or add a testcase, that would be great.", "id": 126163, "time": "2009-04-09T07:18:14Z", "creator": "bodewig@apache.org", "creation_time": "2009-04-09T07:18:14Z", "is_private": false}, {"count": 2, "attachment_id": null, "creator": "jisl@oksystem.cz", "is_private": false, "id": 126166, "time": "2009-04-09T07:53:31Z", "bug_id": 46891, "creation_time": "2009-04-09T07:53:31Z", "tags": [], "text": "Thanks for resolving and fixing! I think, description is fine.\n\nI have one more question. Is there any date, when the Ant 1.8.0 or some milestone will be released? On Ant wiki and webpage, there is no date specified.\n\nThanks for this information."}, {"count": 3, "tags": [], "bug_id": 46891, "text": "no date set, not even a release plan yet, so it is save to assume Ant 1.8.0 is still a few months away.", "id": 126167, "time": "2009-04-09T08:00:23Z", "creator": "bodewig@apache.org", "creation_time": "2009-04-09T08:00:23Z", "is_private": false, "attachment_id": null}]