[{"count": 0, "tags": [], "creator": "Martin.vGagern@gmx.net", "attachment_id": null, "id": 125715, "time": "2009-03-23T10:19:05Z", "bug_id": 46895, "creation_time": "2009-03-23T10:19:05Z", "is_private": false, "text": "It seems that the HTML files served by ant.apache.org lack headers required for caching, like ETag [1] or Last-Modified [2]. This has the effect that these documents are not cached by most proxies or browsers, so that they have to be requested over and over again, causing unnecessary server load as well as annoying delays for clients.\n\nI have initially observed this with the ivy manual, but later confirmed it for other parts of the ant pages, like the manual. My transfers are usually compressed using gzip, but I could also reproduce this with compression disabled. I could also reproduce it using both HTTP/1.0 and HTTP/1.1.\n\nOnly HTML files seem to be affected, images are delivered with a lot of caching-relevant headers, ETag and Last-Modified among them. I assume that the images are served directly from their files, while the html files undergo some processing, or are generated from a data base. Maybe you could tune this process in such a way as to still provide Last-Modified and/or ETag?\n\nIf I can help with this in some way, like providing some network traffic dump or having a look at server side scripts, please let me know.\n\n[1] http://tools.ietf.org/html/rfc2616#section-14.19\n[2] http://tools.ietf.org/html/rfc2616#section-14.29"}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 126158, "time": "2009-04-09T07:03:17Z", "bug_id": 46895, "creation_time": "2009-04-09T07:03:17Z", "is_private": false, "text": "This is because we use SSI to always contain the ad for the latest and greatest ApacheCon.\n\nWe probably could make the SSI part set proper cache headers to allow caching for a day or so (no idea how, though) - or re-try an iframe approach for the banner now that browsers have evolved a bit."}, {"count": 2, "tags": [], "bug_id": 46895, "attachment_id": null, "text": "(In reply to comment #1)\n> This is because we use SSI to always contain the ad for the latest and greatest\n> ApacheCon.\n\nI see - at least for the start page and ivy docs. The ant manual doesn't seem to contain that kind of banner.\n\n> We probably could make the SSI part set proper cache headers to allow caching\n> for a day or so (no idea how, though) - or re-try an iframe approach for the\n> banner now that browsers have evolved a bit.\n\nI'm in favour of the latter. Should be less work, better results due to longer caching, and reduce the load on the webserver to boot, as you can avoid the SSI processing.\n\nJust a thought for a third, low-tech alternative: How about having some redirect URLs for latest image and latest link target? You could hardcode those URLs into the pages, and simply change image and conference pages they redirect to.", "id": 126164, "time": "2009-04-09T07:18:36Z", "creator": "Martin.vGagern@gmx.net", "creation_time": "2009-04-09T07:18:36Z", "is_private": false}]