[{"count": 0, "tags": [], "text": "It seems that if cell contains valid number then POI always consider it type as NUMERIC - even if the cell carries text format.", "attachment_id": null, "id": 125697, "creation_time": "2009-03-23T06:55:07Z", "time": "2009-03-23T06:55:07Z", "creator": "alesinskyy@googlemail.com", "bug_id": 46890, "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 46890, "is_private": false, "id": 125698, "time": "2009-03-23T07:16:09Z", "creator": "apache@gagravarr.org", "creation_time": "2009-03-23T07:16:09Z", "tags": [], "text": "POI will give you the cell type that excel set for the cell\n\nYou should check the cell formatting rules to see how your numeric cells are formatted"}, {"count": 2, "tags": [], "creator": "alesinskyy@googlemail.com", "text": "Yes, probably it gets, but it causes a lot of problems.\nBTW, older versions of POI (e.g. 2.5.1) used to return string in such cases.\n\nThis change of behavior has broken DBUnit XLSDataSet, for example. \n\nAnd even worse - I have not found any clear reference to this (rather breakin) change neither in the documentation, nor in the changelog. \n\nIt is relatively clear, that if cell is formatted as \"text\", then it contents has to be treated text, not number. That means that cell content may be taken \"as-is\".", "id": 125703, "time": "2009-03-23T07:59:17Z", "bug_id": 46890, "creation_time": "2009-03-23T07:59:17Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "apache@gagravarr.org", "is_private": false, "id": 125707, "attachment_id": null, "bug_id": 46890, "creation_time": "2009-03-23T08:19:03Z", "time": "2009-03-23T08:19:03Z", "text": "Pretty sure that POI has always returned NUMERIC for cells that excel has stored as a floating point number, and only returns STRING for cells where the additional string record is used\n\nIf a cell is really numeric, then excel stores a float. You need to fetch back that float, then apply string formatting rules to make a string. You can't fetch \"a string\", as there isn't one in the file, all there is is the float + a formatting string.\n\nIf you'd care to upload a unit test that shows this differently from poi 2.5 to now, we'll take a look, but I'm fairly sure this is still an INVALID"}, {"count": 4, "attachment_id": null, "bug_id": 46890, "is_private": false, "id": 125753, "time": "2009-03-24T05:51:14Z", "creator": "alesinskyy@googlemail.com", "creation_time": "2009-03-24T05:51:14Z", "tags": [], "text": "Hi,\n\nI was wrong - POI 2.5.1 has behave practically the same. The real problem lies in DBUnit as such, not in POI."}, {"count": 5, "tags": [], "text": "Sorry, but I want to reopen this issue once more - the problem is that Excel (2003 and, likely, other versions as well) exhibits somewhat odd behavior - if cell containing valid numeric value is formated as text Excel still recognizes it as numeric till it would be edited once more, at least with \"change-nothing\" editing (in case if \"Number stored as text\" error checking rule is activated \"Ignore error\" should be confirmed for each affected cell as well).\n\nIt would be very nice to allow obtain string value (exactly as it is shown by Excel) of the such cell (which has numeric type, but text formatting) - now it throws exception. I'm not sure if it is attainable or this restriction comes directly from Excel.\n\nRegards,\nOleksandr", "is_private": false, "id": 125758, "creator": "alesinskyy@googlemail.com", "time": "2009-03-24T07:47:31Z", "bug_id": 46890, "creation_time": "2009-03-24T07:47:31Z", "attachment_id": null}, {"count": 6, "tags": [], "text": "For a numeric cell, the \"text as shown by excel\" isn't stored anywhere. Please follow standard POI practice, get the floating point number + format string, and format it yourself", "is_private": false, "id": 125761, "creator": "apache@gagravarr.org", "time": "2009-03-24T08:35:14Z", "bug_id": 46890, "creation_time": "2009-03-24T08:35:14Z", "attachment_id": null}]