[{"count": 0, "tags": [], "text": "The session for a request is set according to the context in which the request\noriginated.  When a request is passed to a servlet in another context the\nsession object should not be the same as in the original context.\n\nLooking at the code, it appears this boils down to having the context stored in\nthe request reflect the actual context where the request is currently being\nprocessed.  A mechanism also needs to be in place so that any sessions initiated\nin the second (or greater) context in the chain will have the same id as the\nsession in the original context.\n\nThis bug is present in the current CVS and was reported against tomcat and\nservlet 2.2 spec as well.", "is_private": false, "id": 7622, "creator": "jmcnally@apache.org", "time": "2001-11-06T14:22:12Z", "bug_id": 4690, "creation_time": "2001-11-06T14:22:12Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 4690, "is_private": false, "text": "Created attachment 771\nmy attempt to fix the problem, did not work do to use of Facade class", "id": 7623, "time": "2001-11-06T14:41:52Z", "creator": "jmcnally@apache.org", "creation_time": "2001-11-06T14:41:52Z", "attachment_id": 771}, {"count": 2, "tags": [], "bug_id": 4690, "text": "I checked the spec, and it seems you're right. I wouldn't categorize it as high \npriority, as I'm not a big fan of cross context access (for security reasons, \nplus I think that webapps should be as self-contained as possible).\n\nThe patch appears far reaching and high risk, so it's not going in 4.0.x \nanytime soon (and will be documented as a known issue in all Tomcat 4.0.x \nversions which do have this problem).\nWaiting for Craig's opinion on this subject ...", "id": 7626, "time": "2001-11-06T17:33:37Z", "creator": "remm@apache.org", "creation_time": "2001-11-06T17:33:37Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "This bug is complex to fix, and for this reason will probably not be fixed in \nthe 4.0.x branch, but more likely for 4.1. This will be mentioned in the \nrelease notes.", "is_private": false, "bug_id": 4690, "id": 8432, "time": "2001-11-29T10:34:56Z", "creator": "remm@apache.org", "creation_time": "2001-11-29T10:34:56Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "*** Bug 8213 has been marked as a duplicate of this bug. ***", "is_private": false, "id": 13870, "creator": "remm@apache.org", "time": "2002-04-17T16:27:18Z", "bug_id": 4690, "creation_time": "2002-04-17T16:27:18Z", "attachment_id": null}, {"count": 5, "attachment_id": null, "bug_id": 4690, "text": "*** Bug 9116 has been marked as a duplicate of this bug. ***", "id": 16188, "time": "2002-05-15T17:50:28Z", "creator": "remm@apache.org", "creation_time": "2002-05-15T17:50:28Z", "tags": [], "is_private": false}, {"text": "*** Bug 10886 has been marked as a duplicate of this bug. ***", "tags": [], "bug_id": 4690, "is_private": false, "count": 6, "id": 19672, "time": "2002-07-17T09:57:11Z", "creator": "remm@apache.org", "creation_time": "2002-07-17T09:57:11Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 4690, "attachment_id": null, "is_private": false, "id": 21427, "time": "2002-08-21T07:09:45Z", "creator": "remm@apache.org", "creation_time": "2002-08-21T07:09:45Z", "text": "*** Bug 11879 has been marked as a duplicate of this bug. ***"}, {"count": 8, "attachment_id": null, "bug_id": 4690, "text": "*** Bug 13516 has been marked as a duplicate of this bug. ***", "id": 24331, "time": "2002-10-11T05:29:54Z", "creator": "remm@apache.org", "creation_time": "2002-10-11T05:29:54Z", "tags": [], "is_private": false}, {"count": 9, "tags": [], "bug_id": 4690, "is_private": false, "id": 28102, "attachment_id": null, "creator": "louis@allsofts.com", "creation_time": "2002-12-20T10:54:39Z", "time": "2002-12-20T10:54:39Z", "text": "I hope someone can solve this problem, this is a serious problem to me, and I \ncan't think of a solution to solve my problem other than using cross context.\n\nI working on a project which related to goverment policy.  Therefore the \napplication has to change every year (I mean the application calculation engine \nand the jsp page).  Although it change to new year application, but the old \napplication still has to stay alive for users who haven't migrate their data to \nnew year application.  \n\nEvery year I have to deploy a new application and allow old application can \ncross context to talk to new application.  Due to the session problem, the \nwhole things cannot be done unless I change to another application server.\n\nNow is already version 4.1.18, this bug still haven't solve yet.  Hope someone \ncan consider this issue.\n\nMy post in tomcat user mailing list:\nhttp://archives.apache.org/eyebrowse/ReadMsg?listName=tomcat-\nuser@jakarta.apache.org&msgNo=95890\n\n"}, {"count": 10, "tags": [], "creator": "remm@apache.org", "is_private": false, "id": 35755, "attachment_id": null, "bug_id": 4690, "creation_time": "2003-04-22T08:44:30Z", "time": "2003-04-22T08:44:30Z", "text": "This will not get fixed in Tomcat 4.1.x. Spec people will have to assess the\nseverity of the problem."}, {"text": "This should now be fixed. The fix will be included in 5.0.7.", "tags": [], "bug_id": 4690, "is_private": false, "count": 11, "id": 42155, "time": "2003-08-05T13:26:19Z", "creator": "remm@apache.org", "creation_time": "2003-08-05T13:26:19Z", "attachment_id": null}, {"count": 12, "tags": [], "bug_id": 4690, "is_private": false, "id": 62567, "creation_time": "2004-08-27T02:36:56Z", "time": "2004-08-27T02:36:56Z", "creator": "ddewolf@apache.org", "text": "While the new session is now being created and provided to the included\nresource, no cookie is being added to the response to allow the session to be\nretrieved when direct requests to the included context are recieved.  \n\n(Pluto bug PLUTO-53 depends upon a fix to this issue:\nhttp://nagoya.apache.org/jira/browse/PLUTO-53)\n\nI have have attached a patch.\n", "attachment_id": null}, {"count": 13, "tags": [], "creator": "ddewolf@apache.org", "attachment_id": 12542, "is_private": false, "id": 62568, "time": "2004-08-27T02:38:22Z", "bug_id": 4690, "creation_time": "2004-08-27T02:38:22Z", "text": "Created attachment 12542\nCross Context Patch - Add Cookie if able to"}, {"count": 14, "attachment_id": null, "bug_id": 4690, "text": "I tried applying the specified path to 5.0.27 My portlet test still failed. The\nportlet's session ID was different than the servlet's session ID.", "id": 62790, "time": "2004-08-30T17:13:01Z", "creator": "eric.dalquist@doit.wisc.edu", "creation_time": "2004-08-30T17:13:01Z", "tags": [], "is_private": false}, {"count": 15, "tags": [], "bug_id": 4690, "text": "There have been two Servlet Spec versions and many more Tomcat versions since \nthis bug was originally filed.  Does this still matter to anyone, or at least \nto the original poster?\n\nIs the latest Servlet Spec (v2.4) clear on this issue?  How is it handled in \nthe latest stable Tomcat (5.0.28 at the time of this writing)?  Who would \nobject if this issue is closed as WONTFIX, since that's been the effective \nstatus for a year now?", "id": 63904, "time": "2004-09-20T18:56:27Z", "creator": "yoavs@computer.org", "creation_time": "2004-09-20T18:56:27Z", "is_private": false, "attachment_id": null}, {"count": 16, "tags": [], "bug_id": 4690, "is_private": false, "text": "I was the original poster and I obviously haven't been waiting 3 years hoping it\nwill be fixed and I am less dependent on the cross-context behavior now than I\nwas then.  I simply filed the issue as a failure in the reference implementation\nto meet the specification.  \n\nBut there are others who are still suffering from this problem and many dupes\nwere filed as well.  Remy indicates that it should have been fixed, but it\nappears there is still a bug.  The problem in Tomcat 4.x was deep in the\narchitecture, but  it sounds like a solution is closer at hand now, it would\nseem a shame to declare it a WONTFIX, if the current bug turns out to be simple.\n\nResetting this to Tomcat 4 and declaring it WONTFIX while also entering a more\nspecific defect report in Tomcat 5 might be a reasonable route though. ", "id": 63928, "time": "2004-09-20T22:45:27Z", "creator": "jmcnally@apache.org", "creation_time": "2004-09-20T22:45:27Z", "attachment_id": null}, {"count": 17, "tags": [], "bug_id": 4690, "attachment_id": null, "is_private": false, "id": 63932, "time": "2004-09-20T23:37:03Z", "creator": "ddewolf@apache.org", "creation_time": "2004-09-20T23:37:03Z", "text": "I would also object.  The Portlet Specification depends upon cross context\nfunctionality working properly and there have been several complaints on the\nPluto user and dev lists about this.  I'm pretty sure that the underlying\nproblem is in tomcat and not in pluto.  \n\nAs I stated before, the fix seems to be implemented halfway.  The session which\nis passed to the target context is now unique, however, it is not permenantly\nassociated with the context and thus can't be retrieved during future requests."}, {"count": 18, "tags": [], "bug_id": 4690, "text": "I completely disagree with this.\nThe included session is merely a shadow of the including session. As a result,\nit will not be handled as an actual session with an independant cookie. This is\nnot specified, so this is my interpretation, which should stand until\ncrosscontext session lifecycle and behavior is actually fully specified.", "id": 63986, "time": "2004-09-21T16:17:51Z", "creator": "remm@apache.org", "creation_time": "2004-09-21T16:17:51Z", "is_private": false, "attachment_id": null}, {"count": 19, "tags": [], "bug_id": 4690, "text": "Can you provide some insight on why your interpretation is that this session is\na mere shadow?  What use would a session be if it can't be retrieved later on\nfor use by subsequent requests?\n\nCan you provide any ideas on how we can meet the requirements of the portlet\nspecification's Application Scoped attributes (15.3) with your interpretation.\nI'm not necessarily a fan of cross context apps either, however, our issue is\nthat we're trying to implement a specification which *seems* to require a\ndifferent interpretation of the servlet spec than yours.  Any help would be\ngreatly appreciated.", "id": 64728, "time": "2004-10-07T05:17:45Z", "creator": "ddewolf@apache.org", "creation_time": "2004-10-07T05:17:45Z", "is_private": false, "attachment_id": null}, {"count": 20, "tags": [], "bug_id": 4690, "is_private": false, "id": 64770, "creation_time": "2004-10-07T16:30:11Z", "time": "2004-10-07T16:30:11Z", "creator": "eric.dalquist@doit.wisc.edu", "text": "I just voted for this bug and wanted to voice a comment as well. uPortal 2.3 and\nhigher uses the Pluto JSR-168 portlet container in it's framework and is running\ninto this bug as well. This issue is more pronounced in a portal environment\nsince the abaility to share a session in the manner described in the bug is\nessential for a portlet to securly pass session scoped data to a servlet outside\nof the portal to initiate a download or similar action.", "attachment_id": null}, {"count": 21, "tags": [], "bug_id": 4690, "attachment_id": null, "is_private": false, "id": 64772, "time": "2004-10-07T16:32:19Z", "creator": "remm@apache.org", "creation_time": "2004-10-07T16:32:19Z", "text": "It's not my fault if the portal JSR decided to make asumptions about the servlet\nspecification, and then, to be sure that they would piss off people, included\ntheir dubious asumptions in their TCK."}, {"count": 22, "tags": [], "bug_id": 4690, "text": "It seems to me that the only assumption that was made was that sessions would\nwork normally when used from a cross-context dispatcher. Why is this such a\ndubious assumption?", "id": 64793, "time": "2004-10-07T23:29:47Z", "creator": "nlothian@apache.org", "creation_time": "2004-10-07T23:29:47Z", "is_private": false, "attachment_id": null}, {"count": 23, "tags": [], "text": "I think this is an issue to be resolved between the Portlet Spec people and \nthe Servlet Spec people.  Tomcat's implementation is strictly according to the \nServlet Spec, and is valid (passes all TCKs 100%) according to that Spec.  IF \nthe Spec specifies cross-context behavior that we don't support (it doesn't), \nthen you'd have a legit Tomcat bug.  \n\nIf the Portlet Spec relies on behavior that is unspecified or unclear in the \nServlet Spec, contact the JSR 154 team (jsr-154-comments@jcp.org) to address \nthe issue.  The Servlet Spec, like the Portlet Spec, is very much alive.  I \nwould not be surprised to see clarification on this cross-context stuff in \nv2.5 of the Servlet Spec.  And needless to say, the next major Tomcat version \nwill implement the next Servlet Spec version accurately and fully, just as it \ndoes now.  But until such a Spec change is made, this is not a Tomcat bug.", "is_private": false, "id": 64885, "creator": "yoavs@computer.org", "time": "2004-10-10T20:54:32Z", "bug_id": 4690, "creation_time": "2004-10-10T20:54:32Z", "attachment_id": null}, {"count": 24, "tags": [], "bug_id": 4690, "is_private": false, "text": "This bug has been resolved through the patch referenced to below:\n\nhttp://nagoya.apache.org/eyebrowse/ReadMsg?listName=tomcat-dev@jakarta.apache.org&msgNo=80223\n\nAnyone wanting to use this functionality must remember to set the\n\"emptySessionPath\" attribute in their connector configuration.  An example is below.\n\n<Connector port=\"8080\" maxThreads=\"150\" minSpareThreads=\"25\"\n           maxSpareThreads=\"75\" enableLookups=\"false\"\n           redirectPort=\"8443\" acceptCount=\"100\"\n           connectionTimeout=\"20000\" disableUploadTimeout=\"true\"\n           emptySessionPath=\"true\" /> \n\n\nMany thanks to the Tomcat team for working with us to find an acceptable\nsolution to all parties!", "id": 65125, "time": "2004-10-14T13:11:07Z", "creator": "ddewolf@apache.org", "creation_time": "2004-10-14T13:11:07Z", "attachment_id": null}]