[{"count": 0, "attachment_id": null, "creator": "vsuvorov@geolearning.com", "text": "I am using configuration consisting of 'driver' and two remote 'slaves'. The data are captured to the csv file by 'View Results in the Table' listener. The listener is attached directly to the test plan node. The file name is generated from \n${__property(user.dir)}/Results/B00332-${__time(YMDHMS)}.csv\n\nWhen I am running in GUI mode, I am starting 'slaves' manually, and two separate files are generated (which is OK).\n\nWhen I am using non-GUI mode, both slaves start simultaneously, and only one file is formed. Which is also OK. But the file is *corrupted*: there are \\0 chars (quite a few), partial records... \n\nI tried to add __machineName to file name (in hope that it will make a workaround), but the file is generated on 'driver', so it is one file formed again.", "id": 125793, "time": "2009-03-25T14:34:39Z", "bug_id": 46912, "creation_time": "2009-03-25T14:34:39Z", "tags": [], "is_private": false}, {"text": "Just to clarify, this issue doesn't have anything to do with CSV other than the fact that, in the example, the filename's extension is CSV, right?  The \"View Results in Table\" listener writes XML, correct?", "tags": [], "bug_id": 46912, "is_private": false, "count": 1, "id": 128115, "time": "2009-06-19T14:48:15Z", "creator": "kagbusiness@yahoo.com", "creation_time": "2009-06-19T14:48:15Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 46912, "text": "Incorrect.\n\nListeners can write results in CSV or XML formats. We are using CSV, as lighter (less resource consuming).\n\nThere is configure button for most listeners (next to file). The first checkbox is \"Save as XML\". We have it unchecked.", "id": 128125, "attachment_id": null, "creator": "vsuvorov@geolearning.com", "creation_time": "2009-06-20T15:45:00Z", "time": "2009-06-20T15:45:00Z", "is_private": false}, {"count": 3, "attachment_id": null, "creator": "sebb@apache.org", "is_private": false, "id": 134293, "time": "2010-02-07T16:00:56Z", "bug_id": 46912, "creation_time": "2010-02-07T16:00:56Z", "tags": [], "text": "I think this has been fixed in JMeter 2.3.4.\n\nIf not, please re-open with further details (i.e. test case, and sample section of corrupted output file)"}]