[{"count": 0, "tags": [], "creator": "michaelrichardson89@gmail.com", "text": "Created attachment 23450\npatch file\n\n[PATCH]\nI was experiencing an issue where svg graphics would enterpret links of the format:\n<a xlink:href=\"#named_destination\">\n\nas external web-links opening up a web browser.\n\nI have now fixed this issue (given in the attached patch) so that links in the above format now properly go to an internal named destinations.\n\nThe named destination must be specified with the tag:\n<fox:destination internal-destination=\"named_destination\" />\n\nI hope this is helpfull.\n-Michael", "id": 126038, "time": "2009-04-07T07:01:53Z", "bug_id": 46980, "creation_time": "2009-04-07T07:01:53Z", "is_private": false, "attachment_id": 23450}, {"count": 1, "attachment_id": null, "bug_id": 46980, "text": "\nThanks for the patch! Seems like a good starting point.\nOnly some very minor details (code-style) I'd change:\n\n\"if (namedDestination == true) ...\" \n\nNo idea if it's just me, but boolean comparisons almost always seems a bit silly, as you can just write:\n\"if (namedDestination) ...\"\n\nConsequently, I'd also rename that member to something like 'isInternal' or 'hasInternalDestination', yielding the self-explanatory:\n\"if (this.isInternal) ...\"\n\nFor the rest, the small piece of added code in PDFFactory can probably better be added to getGoToPDFAction(), to be executed in case the parameter 'filename' is null. (opportunity to avoid code-duplication)\n\nAnyone with further suggestions before I commit this one, including the above modifications?", "id": 126106, "time": "2009-04-08T11:26:28Z", "creator": "adelmelle@apache.org", "creation_time": "2009-04-08T11:26:28Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 46980, "attachment_id": null, "is_private": false, "id": 126108, "time": "2009-04-08T11:33:50Z", "creator": "adelmelle@apache.org", "creation_time": "2009-04-08T11:33:50Z", "text": "(In reply to comment #1)\n> Consequently, I'd also rename that member to something like 'isInternal' or\n> 'hasInternalDestination', yielding the self-explanatory:\n> \"if (this.isInternal) ...\"\n\nJust noticed that 'hasNamedDestination' is probably better, since PDFGoTos are always internal... :-/"}, {"count": 3, "attachment_id": null, "bug_id": 46980, "is_private": false, "id": 126123, "time": "2009-04-08T15:25:24Z", "creator": "michaelrichardson89@gmail.com", "creation_time": "2009-04-08T15:25:24Z", "tags": [], "text": "I'm glad my changes will be commited so others can benifit from my (small) contribution. :D"}, {"count": 4, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "id": 126130, "creation_time": "2009-04-09T00:37:59Z", "time": "2009-04-09T00:37:59Z", "bug_id": 46980, "text": "+1 to commit the patch with the modifications suggested by Andreas. Ideal would, of course, be a little bit of documentation somewhere.", "is_private": false}, {"count": 5, "tags": [], "bug_id": 46980, "attachment_id": 26466, "is_private": false, "id": 143218, "time": "2011-01-09T08:54:21Z", "creator": "adelmelle@apache.org", "creation_time": "2011-01-09T08:54:21Z", "text": "Created attachment 26466\nupdated patch proposal\n\n\nFound this one still open...\n\nTook a quick look again, and I had applied the changes locally, slightly refined as in the attached patch.\n\nIt can be tested with a fo:basic-link.\nGiven\n<fox:destination internal-destination=\"dest\" />\n\nthen\n<fo:basic-link internal-destination=\"dest\">...\n\nyields behavior similar to\n<fo:basic-link external-destination=\"#dest\">...\n\nSome reservations still: a PDFGoTo can be used to jump to either a page (with or without explicit coordinates) or a named destination.\nAfter the patch, I still have the feeling the implementation somehow is slightly messy. \nIn some contexts, the 'destination' member was already used to pass in a string containing the x/y coordinates. As this was likely done as a shortcut, to avoid creation of unnecessary Point2Ds (only to have to reconstruct the String later in toPDFString()), for now, I have split that into two members positionDestination and namedDestination, to avoid confusion. The latter is made final since I saw no immediate reason to be able to change it after creation.\nThere is still a PDFGoTo constructor that takes one String as a parameter, which leads to some ambiguity. Is the String a page reference or a destination name? If not for the parameter name, that would not always be clear. Given the parameter name, creating a shortcut for a named destination required adding a new constructor, taking a String and a boolean. I have not yet deprecated the existing String-only constructor, but would be inclined in that direction.\nAnother point of concern might be the semantics when compared to external links. \nIn case of 'real' external links, pointing to a named destination would have to happen via \"....pdf#dest=...\", whereas in this case, it is just \"#...\". Would we also have to cater for \"#dest=...\" (and possibly \"#page=...\")? And what about, vice versa, allowing \"....pdf#...\" to point to a named destination? (The latter is enabled with the patch.)\n\nNote also that this behavior only applies to external links with a protocol other than 'file' or 'http'. In those cases, respectively a PDFLaunch or a PDFUri action is created rather than a PDFGoTo or PDFGoToRemote."}, {"count": 6, "tags": [], "creator": "gadams@apache.org", "text": "resetting P2 open bugs to P3 pending further review", "id": 157398, "time": "2012-04-07T01:42:26Z", "bug_id": 46980, "creation_time": "2012-04-07T01:42:26Z", "is_private": false, "attachment_id": null}, {"count": 7, "attachment_id": null, "bug_id": 46980, "is_private": false, "id": 157844, "time": "2012-04-11T03:20:32Z", "creator": "gadams@apache.org", "creation_time": "2012-04-11T03:20:32Z", "tags": [], "text": "increase priority for bugs with a patch"}]