[{"count": 0, "tags": [], "bug_id": 47010, "is_private": false, "text": "Recently was working with some build scripts and found a deficiency in the “Sync” task, namely that it cannot actually compare file content and instead works strictly off file date. This was not usable for us and so I implemented the attached task, that will sync two directory trees based on file contents (a poor man's rsync to be sure). I am submitting for inclusion in core or contrib, or if you’d like to refactor and integrate into the existing Sync task (foolishly, i did not look at the code for Sync at all).", "id": 126173, "time": "2009-04-09T09:48:23Z", "creator": "peger@automotive.com", "creation_time": "2009-04-09T09:48:23Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "peger@automotive.com", "attachment_id": 23475, "text": "Created attachment 23475\nThe code\n\nBugzilla acting funky, rejected initial upload", "id": 126174, "time": "2009-04-09T09:49:25Z", "bug_id": 47010, "creation_time": "2009-04-09T09:49:25Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 47010, "text": "In case you also want to compare the complete file contents, wouldn't it be more efficient / logical to just use copy?", "id": 126519, "time": "2009-04-25T03:28:06Z", "creator": "jkf@apache.org", "creation_time": "2009-04-25T03:28:06Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 47010, "is_private": false, "id": 147185, "creation_time": "2011-06-16T08:18:12Z", "time": "2011-06-16T08:18:12Z", "creator": "parag.doke+techie@gmail.com", "text": "I think the copy task won't delete extra content from the destination, whereas the sync task does this. I agree with peger's request. There needs to be some mechanism to compare files apart from the timestamp.\n\nIn my case, the sync task just dumps everything from the source (a ClearCase dynamic drive folder) to the target, even if a lot of files haven't changed.", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 47010, "attachment_id": null, "id": 147195, "creation_time": "2011-06-16T14:27:11Z", "time": "2011-06-16T14:27:11Z", "creator": "ddevienne@gmail.com", "text": "When I prototyped <sync> I tried comparing files, but it was actually slower than just copying the source files directly on top of existing files. IMHO there's no point of fully reading the source and destination file just to figure out the copy is not necessary. Well at least in my case the source was almost always way slower to read from than to write to the local destination folder.\n\nI guess it's possible comparing the files might be faster in some cases than to just use the overwrite attribute, but I'd like to see actual numbers :)", "is_private": false}]