[{"count": 0, "tags": [], "bug_id": 47020, "is_private": false, "text": "OK, a colleague and I have found several inconsistencies with apache inclusions for conf modifications, post httpd.conf.  The basic problem started when VirtualHost entries were not being recognized by configtest.  I will try to report them as found, individually.  Collectively they don't provide any way of following a route through included config files.  \n\nHere is the tested environment (httpd.conf):\n\n# Virtual hosts\n#Include /private/etc/apache2/extra/httpd-vhosts.conf\nInclude /private/etc/apache2/other/*.conf\nInclude /private/etc/apache2/users/username.conf\nInclude /private/etc/apache2/users/lasso8.conf\n\nI tried parking my VirtualHosts into my username.conf.  That has never worked as configtest indicated *:80 had no VirtualHosts.  \n\nMoved to extra/httpd-vhosts.conf:\n\nIt worked.  But, httpd-vhosts.conf is NEVER included in httpd.conf.  See above.  \n\nThe documentation for 2.2 shows that an example is provided inside extra/httpd-vhost.conf.  Only when the VirtualHosts are placed in there, do they work.  \n\nDocumentation for 2.2 also indicates that the VirtualHosts can be placed at the end of the httpd.conf.  That's a bad idea, as OS upgrades can reset this file back to the default supplied with a new OS.  users/*.conf files remain, which is a good thing.  All mods should be done in user conf files, such as users/username.conf.  They remain safe with OS upgrades.\n\nThird, the nature of the progression through conf files, allows the last iteration of a directive to be superior in priority.  So regardless of the file location of ANY directive, its priority is based upon its linear location.  My situation respected that, but configtest didn't take into consideration my user/username.conf file whatsoever, nor did the apache server.  \n\nConclusions:\n1.  documentation suggests examples which should take actual syntax\n2.  documentation does not indicate restrictions of VirtualHost location\n3.  location does indeed have restrictions\n4.  extra/httpd-vhosts.conf file is included even when commented out\n5.  *.conf files (all files) should be assigning directives priority in a linear fashion, using includes as a method for organizing directives, and not dictating where items must be placed\n\n\nemail beerich@gmail.com", "id": 126209, "time": "2009-04-14T01:22:30Z", "creator": "beerich@gmail.com", "creation_time": "2009-04-14T01:22:30Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 47020, "text": "> 1.  documentation suggests examples which should take actual syntax\n\nidentify the example and open a bug.\n\n> 2.  documentation does not indicate restrictions of VirtualHost location\n\nNone of the ones you've identified are reproducable. Discuss them on a mailing list.\n\n> 3.  location does indeed have restrictions\n\nElaborate, or preferably discuss on the users mailing list.\n\n> 4.  extra/httpd-vhosts.conf file is included even when commented out\n\nNot reproducable.  You're not reading your config carefully.\n\n> 5.  *.conf files (all files) should be assigning directives priority in a\n> linear fashion, using includes as a method for organizing directives, and not\n> dictating where items must be placed\n\nThat's how they work. Your OS may assign special significance to them by convention, but all files are the same to Apache.", "count": 1, "id": 126227, "time": "2009-04-14T04:19:52Z", "creator": "covener@gmail.com", "creation_time": "2009-04-14T04:19:52Z", "is_private": false}]