[{"count": 0, "tags": [], "bug_id": 47063, "text": "Created attachment 23520\nPatch to call the post_request handler in proxy_handler() before trying a new worker\n\nWe're running an environment with Apache 2.2.11 acting as reverse proxy for several Apache Tomcat servers, using mod_proxy_balancer and its \"bybusyness\" method. We've noticed that when one of the backend servers fails during heavy load, it will almost never be used again once it is restored, even though the corresponding worker shows up as \"OK\" in the balancer manager.\n\nInvestigating this a little, I've found that the \"busy\" counter of the affected worker is a lot greater than zero, causing it to be ignored by the \"bybusyness\" algorithm unless the proxy is under really heavy load again. I've finally tracked it down to the while loop in mod_proxy.c which tries to find a suitable worker to handle the current request: It calls ap_proxy_pre_request(), which will increase the \"busy\" counter of the worker returned, but if that worker fails to serve the request, ap_proxy_pre_request() will be called again without calling proxy_run_post_request() for the worker that failed, so that its \"busy\" counter will never be decremented again.\n\nI've created a small patch to fix this, but as I'm not an Apache hacker, I cannot tell whether it is the right way to fix the issue. At least, it succeeded in fixing the problem in our environment, without causing any unwanted side effects up to now.\n\nWhile debugging this issue, I've also added a \"busyness\" column to balancer-handler, which can be found as an attachment to bug #46215.", "id": 126407, "time": "2009-04-21T07:19:40Z", "creator": "binder@arago.de", "creation_time": "2009-04-21T07:19:40Z", "is_private": false, "attachment_id": 23520}, {"count": 1, "tags": [], "bug_id": 47063, "attachment_id": 24189, "text": "Created attachment 24189\nPatch to fix this problem with another approach\n\nBusyness counter should be reset when the worker is returned to be usable.", "id": 130056, "time": "2009-08-31T01:04:32Z", "creator": "uta@rubricks.org", "creation_time": "2009-08-31T01:04:32Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 47063, "text": "Created attachment 24190\nPatch to fix this problem with another approach\n\nBusyness counter should be reset when the worker is down.", "id": 130057, "time": "2009-08-31T02:44:35Z", "creator": "uta@rubricks.org", "creation_time": "2009-08-31T02:44:35Z", "is_private": false, "attachment_id": 24190}]