[{"count": 0, "tags": [], "bug_id": 47065, "attachment_id": null, "id": 126412, "time": "2009-04-21T09:03:23Z", "creator": "th.v.d.gronde@hccnet.nl", "creation_time": "2009-04-21T09:03:23Z", "is_private": false, "text": "I have been experimenting with simulating non-SVG gradients using (among other things) feComposite. For this purpose I'm using values for k1-k4 that can cause intermediate (during the computation of one feComposite) values to go outside the range [0,1]. For non-alpha components this doesn't seem to present a problem (see the second attempt at simulating a conical gradient), for alpha components this goes completely wrong (see the third and last attempt).\n\nI want to stress again that I'm not talking about the values between filter primitives (I'm carefully making sure that they stay within the [0,1] range), I'm talking about the computation k1*i1*i2 + k2*i1 + k3*i2 + k4. If, for example, this would be negative without k4, but k4 IS used to make sure it doesn't, then this works just fine with a non-alpha channel, but it doesn't work with the alpha channel.\n\nThis seems odd and is frustrating because the alpha channel is very suitable for these kinds of computations, as you then don't have to worry about using premultiplied values."}, {"count": 1, "tags": [], "creator": "th.v.d.gronde@hccnet.nl", "text": "Note that the attempts (and images) I talked about can be seen at the URL associated with this bug:\nhttp://wiki.inkscape.org/wiki/index.php/Advanced_Gradients#Conical_gradient", "id": 126413, "time": "2009-04-21T09:05:13Z", "bug_id": 47065, "creation_time": "2009-04-21T09:05:13Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 47065, "attachment_id": null, "id": 126986, "time": "2009-05-13T06:26:46Z", "creator": "th.v.d.gronde@hccnet.nl", "creation_time": "2009-05-13T06:26:46Z", "is_private": false, "text": "I'd like to add that it looks like Batik has a similar problem when it comes to filtering the alpha component using feConvolveMatrix... In the filters-conv test of the W3C SVG test suite, if you set color-interpolation-filters=\"sRGB\" on convolve3 it will be lighter with preserveAlpha=\"false\" than with preserveAlpha=\"true\", while this should make no difference as the alpha channel is (and should remain) constant 1.\n\nI will attach a demonstration image derived from the W3C test."}, {"count": 3, "tags": [], "creator": "th.v.d.gronde@hccnet.nl", "text": "Created attachment 23655\nDemonstration of (likely related) feConvolveMatrix problem", "id": 126988, "time": "2009-05-13T06:28:47Z", "bug_id": 47065, "creation_time": "2009-05-13T06:28:47Z", "is_private": false, "attachment_id": 23655}, {"count": 4, "tags": [], "bug_id": 47065, "attachment_id": 23656, "id": 126990, "time": "2009-05-13T07:17:00Z", "creator": "th.v.d.gronde@hccnet.nl", "creation_time": "2009-05-13T07:17:00Z", "is_private": false, "text": "Created attachment 23656\nReduced test case for the original problem.\n\nIf the last line in the filter in conicalgradientDMRD2-reduced.svg is changed to show any of the results other than pf all is fine, but if pf is shown Batik just sets the left half to 0.5, while the final value of each pixel of the feComposite primitive is quite nicely within the range [0,1]."}, {"count": 5, "tags": [], "bug_id": 47065, "attachment_id": 23657, "id": 126991, "time": "2009-05-13T07:17:38Z", "creator": "th.v.d.gronde@hccnet.nl", "creation_time": "2009-05-13T07:17:38Z", "is_private": false, "text": "Created attachment 23657\nBatik's rendering of the reduced test case."}, {"count": 6, "tags": [], "bug_id": 47065, "attachment_id": 23658, "id": 126992, "time": "2009-05-13T07:18:09Z", "creator": "th.v.d.gronde@hccnet.nl", "creation_time": "2009-05-13T07:18:09Z", "is_private": false, "text": "Created attachment 23658\nInkscape's rendering of the reduced test case (correct)."}]