[{"count": 0, "tags": [], "bug_id": 4706, "attachment_id": null, "id": 7653, "time": "2001-11-07T11:25:56Z", "creator": "zack.lemonik@multex.com", "creation_time": "2001-11-07T11:25:56Z", "is_private": false, "text": "On my a JSP page, I invokes a java class that references ServletRequest and \nServletResponse.  If tomcat\\common\\lib\\servlet.jar is not in the runtime \nclasspath, then a ClassDefNotFound exception is thrown.  However if this path \nis put in the classpath then a \"Violates Loader Constraints\" error is returned \nwhen the page is compiled.  My understanding is that this is because Tomcat 4 \ndoes not allow any of its the classes in its default sub-directories to be \nloaded.  Furthermore, if I make a copy servlet.jar in a directory outside of \nTomcat and include that in the classpath, another \"Violates Loader Constraints\" \nerror is returned because the JVM views these copied classes as imposters.\n\nTherefore the only workaround I could find is to remove servlet.jar from \ntomcat\\common\\lib and place it in a directory outside tomcat, and then to \ninclude a path to the new location in the runtime classpath.  This isn't a big \ndeal, but I seem to remember that in earlier versions of Tomcat, one could \nsimply put tomcat\\lib\\servlet.jar in the classpath and it worked.  Again this \nwould only be an issue when one writes classes that reference servlet.jar and \nthen tries to invoke those classes in a servlet."}, {"count": 1, "tags": [], "bug_id": 4706, "attachment_id": null, "id": 7656, "time": "2001-11-07T11:53:41Z", "creator": "remm@apache.org", "creation_time": "2001-11-07T11:53:41Z", "is_private": false, "text": "I don't quite understand why this happens. Do you have a small test case you \ncould attach to the bug report ?"}, {"count": 2, "tags": [], "bug_id": 4706, "text": "I had the same problem trying to get a .jar file to work which I added to the \ntomcat\\common\\lib\\ directory in Tomcat 4.0.  It was working in my last version, \nTomcat 3.2.2 though.\n\nNevertheless, I was able to make .jar files work under the \ntomcat\\webapps\\applicationName\\WEB-INF\\lib directory for individual \napplications.  ", "id": 7724, "time": "2001-11-09T08:07:54Z", "creator": "dervre@requestfoods.com", "creation_time": "2001-11-09T08:07:54Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 4706, "text": "That does work for me, as that's how all the common libraries are loaded. Could \nyou give details on what jar is causing problems ?", "id": 7731, "attachment_id": null, "creator": "remm@apache.org", "creation_time": "2001-11-09T10:35:02Z", "time": "2001-11-09T10:35:02Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 4706, "text": "This was probably caused by a race condition in the StandardClassLoader which \nwas found and fixed since then. Tomcat 4.0.2 will have the fix.", "id": 8433, "time": "2001-11-29T10:38:07Z", "creator": "remm@apache.org", "creation_time": "2001-11-29T10:38:07Z", "is_private": false, "attachment_id": null}]