[{"count": 0, "tags": [], "creator": "helder.magalhaes@gmail.com", "text": "Created attachment 23545\nFix cursor in text elements\n\nWhile playing with cursors a bit, I noticed a weird behavior with pointer cursors... Further analysis and comparison with release 1.7 lead to the conclusion that this was a regression introduced with revision 761228.\n\nSteps to reproduce:\n1. Load the bug report URL [1] in Batik Squiggle;\n2. Place the mouse pointer over \"Text Cursor\" and move around.\n\nExpected results:\nA text cursor would be shown always.\n\nActual results:\nA pointer cursor is sometimes displayed.\n\nAdditional information:\nAfter digging down a bit, it seems that a necessary coordinate transform was removed during revision 761228. The patch addresses this by restoring it. I've also checked that the example [2] posted into the mailing list -- which somehow triggered the changes -- still works flawlessly with the patch applied.\n\n[1] http://www.w3.org/Graphics/SVG/Test/20061213/svggen/interact-cursor-01-f.svg\n[2] http://www.nabble.com/attachment/22824226/0/Batik-EventsAndZoomIssues.svg", "id": 126529, "time": "2009-04-26T16:45:46Z", "bug_id": 47099, "creation_time": "2009-04-26T16:45:46Z", "is_private": false, "attachment_id": 23545}, {"count": 1, "tags": [], "creator": "deweese@apache.org", "attachment_id": null, "id": 126538, "time": "2009-04-27T04:26:56Z", "bug_id": 47099, "creation_time": "2009-04-27T04:26:56Z", "is_private": false, "text": "I can't reproduce this bug.\n\nIt's hard for me to see how the bug described bug could be\ncaused by this.  The block of code you updated is only used\nto locate tspan's within a text element.  There are no tspans\nin this example.\n\nYour proposed patch will cause problems.  rev 761228 changed\nthe way that block of code works so that 'pt' must already be\nin the elements local coordinate system.  So applying that\ntransform again will cause trouble.\n\nThere actually was/is a bug with version=\"1.2\" documents,\nwhich I will commit shortly, but this document couldn't\ntrigger it (since it's version=\"1.1\"), and it didn't have\nany tspan elements."}, {"count": 2, "tags": [], "creator": "helder.magalhaes@gmail.com", "text": "(In reply to comment #1)\n> I can't reproduce this bug.\n\nWeird, I still can. Just tried with an untouched fresh Batik checkout (revision 768952). made a \"build clean\", \"build squiggle\" and opened the report's URL.\n\nNevertheless, I forgot to mention a couple of things in the original report:\n * This was originally seen in a machine with Windows Vista SP1;\n * Java environment is Sun's JDK 1.6.0 update 13;\n * This reproduces with a Squiggle windows which is not maximized.\n\n\n> It's hard for me to see how the bug described bug could be\n> caused by this.  The block of code you updated is only used\n> to locate tspan's within a text element.  There are no tspans\n> in this example.\n\nMaybe the anchor within the text element will make Batik internally handle that text portion as in a tspan (but then again, I'm just guessing...)?\n\nI was also able to reproduce using different configurations:\n * In a (different) machine with Windows XP SP3 and both Sun's JDK 1.6.0 update 13 and JDK 1.5.0 update 17;\n * In a (yet different) machine using Ubuntu 8.10 and Sun's Java 1.6 with a Batik nightly build [1];\n(This suggest towards something which affects all platforms -- I'm setting it, even though Mac wasn't tried.)\n\nFew more thoughts:\n * Using a windows size of 800x600 makes the issue reproducible (that is, the unexpected pointer cursor appearing on top of the \"Text Cursor\" glyphs);\n * This can also be checked by placing the mouse pointer over the glyphs of \"Pointer Cursor\", which should display a pointer cursor (and most times doesn't);\n * Applying the proposed patch, \"build clean\", \"build squiggle\" and opened the report's URL no longer reproduces the error (attempted with maximized and also with several window sizes for sure).\n\n\n> Your proposed patch will cause problems.  rev 761228 changed\n> the way that block of code works so that 'pt' must already be\n> in the elements local coordinate system.  So applying that\n> transform again will cause trouble.\n\nHumm... But I was still suffering from the issue without the patched code (patching it makes the weird cursor behavior to go away, both with Java 1.5 and Java 1.6). As I'm not able to quite understand the changes in \"StrokingTextPainter.java\", the only things that also occurs to me is that some local changes were not committed...?\n\n\nI'm not sure what kind of additional information can I provide in order to help reducing this... :-|\n\n\n[1] http://arc.mcc.id.au/batik-nightly/webstart/squiggle.pl", "id": 126540, "time": "2009-04-27T06:27:44Z", "bug_id": 47099, "creation_time": "2009-04-27T06:27:44Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "deweese@apache.org", "text": "I fixed the bug.  It took me a while but I finally figured out that you were talking about the title text \"Text Cursor\" not the text cursor test box.\n\nYour patch would actually work since the documentation for getPoint2D()\nwas wrong.  I've made the implementation match the documentation \n(see rev 769733). So your patch isn't needed.", "id": 126610, "time": "2009-04-29T03:24:36Z", "bug_id": 47099, "creation_time": "2009-04-29T03:24:36Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 47099, "attachment_id": null, "text": "(In reply to comment #3)\n> I fixed the bug.\n\nGreat! :-)\n\n\n> It took me a while but I finally figured out that you were\n> talking about the title text \"Text Cursor\" not the text cursor test box.\n\nYeah, I admit that it was somehow tricky, as it was a test specifically testing cursors. Guess I should have made the text a bit more clear regarding that...\n\n\n> Your patch would actually work since the documentation for getPoint2D()\n> was wrong.  I've made the implementation match the documentation \n> (see rev 769733). So your patch isn't needed.\n\nEven better. :-)", "id": 126612, "time": "2009-04-29T05:05:52Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2009-04-29T05:05:52Z", "is_private": false}]