[{"count": 0, "tags": [], "bug_id": 47124, "text": "Created attachment 23565\nPatch running the unit tests as part of the build\n\nThe lack of unit tests is really a shame for a project like Tomcat! A few unit tests are available in the source code but first they are not run as part of the build process and second many of them fail.\n\nI've attached a patch to this issue that:\n- runs the existing unit tests as integral part of the build\n- renames some of the unit tests to have a consistent naming pattern for the unit tests (ie XXXXXTest)\n- makes a minimal cleanup\n\nThe consequence is that the build fails with this patch as 11 of the 51 unit tests fail. My current knowledge of Tomcat doesn't allow me to decide if the failing tests should be simply removed or adapted. With feedback on this, I can provide a modified version of the patch.", "id": 126638, "time": "2009-04-30T00:06:39Z", "creator": "mguillemot@yahoo.fr", "creation_time": "2009-04-30T00:06:39Z", "is_private": false, "attachment_id": 23565}, {"count": 1, "tags": [], "bug_id": 47124, "is_private": false, "text": "I am -1 for this patch as is on the following grounds:\n- The tests take far too long to run by default with every build. This patch increases the rebuild time from 1s to over 5min.\n- The patch doesn't follow the Tomcat convention for defining external libs\n\nI'm also very close to -1 on the renaming. I don't think it adds that much.\n\nGiven this, what I have done is modified the current test/build.xml in trunk to run all the tests. There are currently see a number of errors/failures - mostly in Tribes. How many of those are genuine and how many are faulty tests is TBD. Given the failures and the time taken, the Tribes tests are currently commented out.\n\nThe remaining failures are caused by the use of ServerFactory that doesn't play nicely with o.a.c.startup.Tomcat when multiple Tomcat instance are created.\n\nAs noted in the code ServerFactory needs to be removed.\n\nSeveral resolutions are applicable here, I went for FIXED.", "id": 126726, "time": "2009-05-02T16:20:16Z", "creator": "markt@apache.org", "creation_time": "2009-05-02T16:20:16Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "I'm glad to see that you've committed some changes, nevertheless for me it doesn't really change the situation that unit tests are not considered seriously in Tomcat project.\n\nTests *should* be integral part of the build. It's normal that a build takes (far) longer than 5 minutes if it runs tests (nevertheless these tests should have some sense to be worth this time, what is perhaps not yet the case).\n\nI'm sorry if I didn't followed the convention for external libs. I thought that it was the case. What about using Ivy rather than this self made \"strategy\"?\n\nThis is is far less important that running the tests as part of the build, but I think that the tests should be renamed for consistency and as it just allows to use name patterns to select the tests (currently there is no convention here). In the current state of the test suite, I would prefer to select the tests by name pattern rather than having a TestAll as it doesn't have any advantage and this file needs to be modified each time a test is added (with the risk to have tests that aren't run).\n\nI don't understand either why you don't use Ant's junit task.\n\nAt the end I have the feeling that this issue has been closed as WONTFIX rather than as FIXED :-(", "is_private": false, "bug_id": 47124, "id": 126754, "time": "2009-05-04T05:07:33Z", "creator": "mguillemot@yahoo.fr", "creation_time": "2009-05-04T05:07:33Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "markt@apache.org", "is_private": false, "id": 126761, "time": "2009-05-04T07:58:53Z", "bug_id": 47124, "creation_time": "2009-05-04T07:58:53Z", "tags": [], "text": "(In reply to comment #2)\n> Tests *should* be integral part of the build. It's normal that a build takes\n> (far) longer than 5 minutes if it runs tests (nevertheless these tests should\n> have some sense to be worth this time, what is perhaps not yet the case).\nRunning the tests as part of the Gump build would make sense. Changing the build we use all the time in development from 1s to >5min does not.\n\n> I'm sorry if I didn't followed the convention for external libs. I thought that\n> it was the case. What about using Ivy rather than this self made \"strategy\"?\nChanging this is a separate question for the dev list. As with any change, there would need to sufficient benefit to justify it.\n\n> This is is far less important that running the tests as part of the build, but\n> I think that the tests should be renamed for consistency and as it just allows\n> to use name patterns to select the tests (currently there is no convention\n> here). In the current state of the test suite, I would prefer to select the\n> tests by name pattern rather than having a TestAll as it doesn't have any\n> advantage and this file needs to be modified each time a test is added (with\n> the risk to have tests that aren't run).\nThat is a reasonable argument. Patches tend to get very large when renames are concerned. A set of svn commands to run would be easier to review and to apply.\n\n> I don't understand either why you don't use Ant's junit task.\nNo idea. Merging the test.xml with the main build.xml and using Ant's junit task would make sense."}, {"count": 4, "tags": [], "bug_id": 47124, "text": "(In reply to comment #3)\n>... \n> > This is is far less important that running the tests as part of the build, but\n> > I think that the tests should be renamed for consistency and as it just allows\n> > to use name patterns to select the tests (currently there is no convention\n> > here). In the current state of the test suite, I would prefer to select the\n> > tests by name pattern rather than having a TestAll as it doesn't have any\n> > advantage and this file needs to be modified each time a test is added (with\n> > the risk to have tests that aren't run).\n> That is a reasonable argument. Patches tend to get very large when renames are\n> concerned. A set of svn commands to run would be easier to review and to apply.\n\nIsn't it even more efficient if one committer (you?) just rename the files and commit the changes?\n\n> \n> > I don't understand either why you don't use Ant's junit task.\n> No idea. Merging the test.xml with the main build.xml and using Ant's junit\n> task would make sense.\n\nthis was in the proposed patch. Should I upload an other one?", "id": 126776, "time": "2009-05-05T03:37:21Z", "creator": "mguillemot@yahoo.fr", "creation_time": "2009-05-05T03:37:21Z", "is_private": false, "attachment_id": null}, {"count": 5, "attachment_id": null, "creator": "markt@apache.org", "is_private": false, "id": 126778, "time": "2009-05-05T05:24:24Z", "bug_id": 47124, "creation_time": "2009-05-05T05:24:24Z", "tags": [], "text": "(In reply to comment #4)\n> Isn't it even more efficient if one committer (you?) just rename the files and\n> commit the changes?\n\nDepends how you measure efficiency. It would be less work for me just to review a set of proposed changes.\n\n> this was in the proposed patch. Should I upload an other one?\n\nThere was a lot to the patch. Separating out the junit task (and checking that it still applies to the latest trunk) would be useful.\n\nRe-opening so this doesn't get forgotten."}, {"count": 6, "tags": [], "bug_id": 47124, "text": "(In reply to comment #5)\n> (In reply to comment #4)\n> > Isn't it even more efficient if one committer (you?) just rename the files and\n> > commit the changes?\n> \n> Depends how you measure efficiency. It would be less work for me just to review\n> a set of proposed changes.\n\nif you know an easy way to generate the set of SVN commands, I'm interested. Otherwise. due to the very small number of files impacted, it's better if you do it directly. I've already provided a patch for that but you haven't applied it.\n\n> > this was in the proposed patch. Should I upload an other one?\n> \n> There was a lot to the patch. Separating out the junit task (and checking that\n> it still applies to the latest trunk) would be useful.\n> \n> Re-opening so this doesn't get forgotten.\n\nok, I'll submit an other one just with this features", "id": 126782, "time": "2009-05-05T06:12:03Z", "creator": "mguillemot@yahoo.fr", "creation_time": "2009-05-05T06:12:03Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 47124, "is_private": false, "text": "I found some time to work on this.\n\nTest cases have been renamed and a test task added to build. It will remain optional for now but could be made mandatory in the future if that is deemed useful.\n\nIt hasn't been proposed for backport to 6.0.x, mainly as the one class that will hopefully be really helpful when building tests cases (o.a.c.startup.Tomcat) isn't available and would need a number amount of other patches to be applied before it could be used.\n\nWe can always revisit the back-porting decision at a later date.", "id": 127953, "time": "2009-06-15T12:42:42Z", "creator": "markt@apache.org", "creation_time": "2009-06-15T12:42:42Z", "attachment_id": null}]