[{"count": 0, "attachment_id": null, "bug_id": 47184, "text": "An awful lot of RewriteRules are written to perform an action that might be better done with a new directive: DirectoryHandler DirectoryHandler would cause all (unhandled) requests directed at a particular directory to be handled by a particular URI or file.\n\nFor example:\n\nDirectoryHandler index.php\n\nwould replace\n\nRewriteEngine On\nRewriteCond %{REQUEST_FILENAME} !-f\nRewriteCond %{REQUEST_FILENAME} !-d\nRewriteRule . index.php [PT]\n\n\nThis would replace the rewriterule set that comes with virtually every PHP application out there which maps all requests to an index.php file that examines the requested URI and does something with it.\n\nNote that this behavior can be half-way simulated using a ErrorDocument 404 directive, but ErrorDocument discards POST data, and so doesn't really do what we want.\n\nDirectoryHandler could optionally have a flag of some kind that enables or disables the action performed by those two RewriteCond directives - that is, by default, DirectoryHandler would catch requests that didn't map to a valid resource, but perhaps there are cases where you want it to map to that handler regardless of the presence or absence of files in that location.\n\nThere's no urgency on this, it's just a long-standing pet peeve of mine that I'd like to see handled in 2.4", "id": 126942, "time": "2009-05-11T08:18:40Z", "creator": "rbowen@apache.org", "creation_time": "2009-05-11T08:18:40Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 47184, "is_private": false, "id": 126943, "creation_time": "2009-05-11T08:49:38Z", "time": "2009-05-11T08:49:38Z", "creator": "a_apache@midnightcircus.com", "text": "This is a great idea.  The Front Controller design pattern is pretty commonly accepted for web applications.\n\nhttp://en.wikipedia.org/wiki/Front_controller\n\nIt would be great if httpd could support this directly instead of requiring mod_rewrite.", "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 47184, "text": "You mean something like DefaultHandler + Action?\n(or even DefaultAction, though I think DefaultHandler sounds instinctively good).", "id": 126951, "time": "2009-05-11T23:21:34Z", "creator": "nick@webthing.com", "creation_time": "2009-05-11T23:21:34Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "rbowen@apache.org", "is_private": false, "count": 3, "id": 126954, "time": "2009-05-12T04:32:24Z", "bug_id": 47184, "creation_time": "2009-05-12T04:32:24Z", "text": "(In reply to comment #2)\n> You mean something like DefaultHandler + Action?\n> (or even DefaultAction, though I think DefaultHandler sounds instinctively\n> good).\n\nYeah, that sounds right. I'm not at all stuck on the name."}, {"count": 4, "attachment_id": null, "bug_id": 47184, "text": "It seems to me that this has more to do with mapping than handlers.  So maybe \n\nDefaultMapping index.php\n\nwould be more accurate?", "id": 127950, "time": "2009-06-15T10:09:27Z", "creator": "poirier@pobox.com", "creation_time": "2009-06-15T10:09:27Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "is_private": false, "id": 127951, "time": "2009-06-15T10:21:54Z", "bug_id": 47184, "creation_time": "2009-06-15T10:21:54Z", "text": "Just based on preference, I'd rather do\n\nDefaultMapping index.php\n\nthan have to do\n\nAction front-handler index.php\nDefaultHandler front-handler\n\nYou know, one less line.\n\nAs far as whether this is a handler or a mapping, I don't care a whole lot. If this is a semantic question, I'll let you guys work that out. From a convenience perspective, I'd really rather have one line than two. \n\n(I think that users tend to find Action confusing - although I'm not entirely sure why. I think it has to do with defining an alias and then using that alias later. The same confusion exists for LogFormat and CustomLog.)"}, {"count": 6, "attachment_id": null, "bug_id": 47184, "text": "I'm picturing three new directives (there doesn't appear to be a DefaultHandler directive, and it seems like a useful concept):\n\n\nDefaultHandler handler-name\n\nChange the default request handler from Apache's built-in \"default-handler\"\nto handler-name.\n\n\nDefaultMapping index.php\n\nIf the request would otherwise result in a 404 response, use the file index.php to handle it.  The URI is not changed.  This is equivalent to\n\nAction new-handler-name index.php\nDefaultHandler new-handler-name\n\nexcept that no handler named \"new-handler-name\" is actually defined.\n\nIs \"request would otherwise result in a 404 response\" the best way to specify the behavior here?  Maybe it would be better to just describe it as a shortcut for using Action and DefaultHandler.\n\n\nSetMapping index.php\n\nUse the file index.php to handle all requests.  The URI is not changed.  This is equivalent to\n\nAction new-handler-name index.php\nSetHandler new-handler-name\n\nexcept that no handler named \"new-handler-name\" is actually defined.", "id": 127961, "time": "2009-06-16T06:49:17Z", "creator": "poirier@pobox.com", "creation_time": "2009-06-16T06:49:17Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "is_private": false, "id": 127972, "time": "2009-06-16T09:01:15Z", "bug_id": 47184, "creation_time": "2009-06-16T09:01:15Z", "text": "I *think* that what you're describing does what I want. The only point of confusion is your remark about \"... would otherwise be a 404.\" Requests for existing files (CSS, images, etc) need to end up going to those files, so there's some \"does it exist\" checking implied in the feature request. See the rewriterule implementation in the original ticket. I think that what you're suggesting will handle that, but I'm not 100% sure."}, {"count": 8, "tags": [], "bug_id": 47184, "text": "It occurs to me that replacing the default-handler isn't what we want here, since that's what would serve the static files for us.  Which I think brings us back to mapping.", "id": 127984, "time": "2009-06-16T10:41:49Z", "creator": "poirier@pobox.com", "creation_time": "2009-06-16T10:41:49Z", "is_private": false, "attachment_id": null}, {"count": 9, "attachment_id": null, "bug_id": 47184, "text": "Committed fix in r785425.  It's different to what we discussed yesterday: should be simpler for users to grok.\n\nGiven whose feature request this is, I think I can leave the documentation to you as already discussed :-)", "id": 127995, "time": "2009-06-16T15:00:21Z", "creator": "nick@webthing.com", "creation_time": "2009-06-16T15:00:21Z", "tags": [], "is_private": false}, {"count": 10, "tags": [], "creator": "nick@webthing.com", "attachment_id": null, "is_private": false, "id": 130398, "time": "2009-09-15T01:27:39Z", "bug_id": 47184, "creation_time": "2009-09-15T01:27:39Z", "text": "Backport proposal as it stands has been vetoed, and in the absence of input from the request's originator is getting reversed in trunk."}, {"count": 11, "tags": [], "bug_id": 47184, "text": "Please forgive my lack of response. I have been generally disconnected for the last several months. The fix, as committed, seems like The Right Thing to me. If the disagreement is only about the name, there seem to be many possible names, and I can't say I care a whole lot. FrontController seems to have an accepted meaning in the larger world, and makes a lot of sense, but FallbackHandler also works for me.\n\nOn the one hand, I don't feel like an endless debate over The Right Name benefits our users. On the other hand, we're stuck with it forever. :/", "id": 130414, "time": "2009-09-15T08:19:19Z", "creator": "rbowen@apache.org", "creation_time": "2009-09-15T08:19:19Z", "is_private": false, "attachment_id": null}, {"count": 12, "tags": [], "bug_id": 47184, "is_private": false, "id": 130419, "creation_time": "2009-09-15T09:58:13Z", "time": "2009-09-15T09:58:13Z", "creator": "wrowe@apache.org", "text": "It would be good not to add new grammar to the config (e.g. FrontController).\n\nDefault has the issues raised on the dev@ list discussion thread.  Fallback is \ngood.  But Fallback alone seems awfully general and hard for the administrator \nwho comes across it to predict what it does when they first encounter it.  \n\nIs it a Handler, Action or Mapping?  I found Nick's choice amusing ;-)  Since \nthe syntax and behavior mirror the Action directive (without a first argument, \nof course) and we do not specify a handler name, it seems that FallbackAction \nis the most easy-to-comprehend choice.", "attachment_id": null}, {"count": 13, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "is_private": false, "id": 130443, "time": "2009-09-16T06:06:00Z", "bug_id": 47184, "creation_time": "2009-09-16T06:06:00Z", "text": "So, after further discussion on IRC, I think that we agreed on FallbackResource.\n\nFallbackResource index.php\n\nThe above will handle URIs for which there is not a resource found, and so is ideal for acting as a so-called front controller. This can be set in directory or .htaccess context."}, {"count": 14, "tags": [], "bug_id": 47184, "text": "It's in trunk. I'm happy. Thanks, everyone.", "id": 130489, "time": "2009-09-17T10:38:24Z", "creator": "rbowen@apache.org", "creation_time": "2009-09-17T10:38:24Z", "is_private": false, "attachment_id": null}]