[{"count": 0, "tags": [], "creator": "joekislos@gmail.com", "attachment_id": null, "text": "Hostname and Port Changes from Status Worker do not affect new connections either\n\nI do not know if this is a documentation issue or a software bug.  I am hoping it is a software bug (because I want it to work!), but I'll settle for some clarification in the documentation.\n\nIf you change the hostname or port of an AJP worker from the Status Worker, the change does not appear to always work.  The documentation states:\n---\nhttp://tomcat.apache.org/connectors-doc/reference/status.html:\n\nNote that changing the host name or port will only take effect for new connections. Already established connections to the old address will still be used. \n---\n\nThis is, actually, exactly the behavior I want.  Old connections continue to use the old settings, but new connections use the new settings.  What I am seeing is my change is not affecting new connections either (I am using a non-keep alive new TCP connection... I am using curl).  I believe there must be some sort of worker internal to mod_jk, and that worker is not being updated with the setting.\n\nIf I make TWO new requests in parallel, the first request will get old settings, and the second request will get the new settings.\n\nSo either the internal workers need to be signaled for a graceful shutdown after a port or hostname change (after handling their existing requests) or the existing internal workers need to be notified of the change.", "id": 127192, "time": "2009-05-19T15:39:16Z", "bug_id": 47224, "creation_time": "2009-05-19T15:39:16Z", "is_private": false}, {"count": 1, "tags": [], "text": "FWIW, what I am actually trying to accomplish is an administrative shutdown of an AJP worker at runtime.  I am trying to accomplish this by changing the port to 0.  So I would settle for another way of admin downing a worker... I am going to try building a LB worker with just the single AJP subworker in it and see if I can accomplish it that way, even though I am doing no load balancing.", "attachment_id": null, "id": 127193, "creator": "joekislos@gmail.com", "time": "2009-05-19T15:40:59Z", "bug_id": 47224, "creation_time": "2009-05-19T15:40:59Z", "is_private": false}, {"count": 2, "tags": [], "creator": "rainer.jung@kippdata.de", "is_private": false, "text": "I will investigate.", "id": 127206, "time": "2009-05-20T04:07:47Z", "bug_id": 47224, "creation_time": "2009-05-20T04:07:47Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "mturk@apache.org", "attachment_id": null, "text": "Fixed in the SVN by actually invalidating the endpoint cache, so even\nalready connected sockets in the cache will be disconnected allowing\nnew connections with new address", "id": 133014, "time": "2009-12-21T04:04:06Z", "bug_id": 47224, "creation_time": "2009-12-21T04:04:06Z", "is_private": false}, {"count": 4, "tags": [], "text": "Will be part of 1.2.29.", "attachment_id": null, "id": 134807, "creator": "rainer.jung@kippdata.de", "time": "2010-02-23T02:54:56Z", "bug_id": 47224, "creation_time": "2010-02-23T02:54:56Z", "is_private": false}]