[{"count": 0, "tags": [], "text": "Created attachment 23732\nPatch for protocol.jms.client.ConnectionFactory\n\nI screwed up when I defined the JNDI information for JMS Publisher/Subscriber samplers. When I ran the test script JMeter seemed to hang. I could also hear my disk rattling. I had to kill the process. I went to jmeter.log to see what the problem was an noticed that it was 1GB in size! That lead me to the code in ...protocol.jms.client.ConnectionFactory, where to my amazement there was an infinite loop - the lookup method looped generating error log entries until if found the connection factory. Unfortunately, whoever coded this method originally left no clue as to why there was an infinite loop here.\n\nThe patch that is attached assumes that the original coder had a valid reason for retrying the lookup if it failed the first time. But it also places a limit on the amount of time spent in doing a lookup and pauses between each attempt. Personally, I would rather have aborted after the first lookup failed, but I gave the original coder the benefit of the doubt and thus assumed that the retry was done for a purpose.\n\nNeedless to say, I added comments that explain exactly why the method is now coded the way it. This will help the next poor soul who stumbles across this code and wonders why it does what it does. I wish that all code was commented this way. I know that I demand it of all the people who work on projects with me.", "attachment_id": 23732, "id": 127511, "creator": "cafed00d@gmail.com", "time": "2009-05-30T15:49:19Z", "bug_id": 47290, "creation_time": "2009-05-30T15:49:19Z", "is_private": false}, {"count": 1, "tags": [], "creator": "woolfel@yahoo.com", "attachment_id": null, "id": 127641, "time": "2009-06-04T07:50:58Z", "bug_id": 47290, "creation_time": "2009-06-04T07:50:58Z", "is_private": false, "text": "Thanks for catching that. The patch looks ok. Is there a reason why the retry in the patch was set so high?\n\nI must have spaced when I wrote that back in 2005."}, {"count": 2, "tags": [], "bug_id": 47290, "text": "From my experience in the past with JMS. Some JMS providers fail on the first try on JNDI lookup. clearly, it should have set a limit on retry, but looks like I spaced and never went back and cleaned up the initial implementation. The sad and funny thing is, I've written jms connection factories several times and had a set number of retries. the bug was there purely due to laziness on my part.", "id": 127643, "time": "2009-06-04T07:57:16Z", "creator": "woolfel@yahoo.com", "creation_time": "2009-06-04T07:57:16Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "I've applied the patch and made a note it retries 5 times before giving up.", "is_private": false, "id": 127645, "creation_time": "2009-06-04T08:05:22Z", "time": "2009-06-04T08:05:22Z", "creator": "woolfel@yahoo.com", "bug_id": 47290, "attachment_id": null}, {"count": 4, "tags": [], "creator": "woolfel@yahoo.com", "attachment_id": null, "text": "changing status to fixed using the patch provided by Peter Johnson.", "id": 127647, "time": "2009-06-04T08:11:15Z", "bug_id": 47290, "creation_time": "2009-06-04T08:11:15Z", "is_private": false}, {"count": 5, "tags": [], "text": "SVN details:\n\nURL: http://svn.apache.org/viewvc?rev=781765&view=rev\nLog:\napply patch from Peter Johnson. the retry is set to 5 times.", "attachment_id": null, "id": 127655, "creation_time": "2009-06-04T08:53:40Z", "time": "2009-06-04T08:53:40Z", "creator": "sebb@apache.org", "bug_id": 47290, "is_private": false}, {"count": 6, "tags": [], "text": "A retry limit of five times is fine by me, and is what I though would be reasonable when I wrote the patch. That is one of the reasons why I set the limit, and the pause time, as constants.", "attachment_id": null, "id": 127666, "creation_time": "2009-06-04T17:20:34Z", "time": "2009-06-04T17:20:34Z", "creator": "cafed00d@gmail.com", "bug_id": 47290, "is_private": false}]