[{"count": 0, "tags": [], "creator": "jhannwong@gmail.com", "attachment_id": null, "text": "The docs say that we can stop httpd.exe by \"opening another console window and entering:\"... \"httpd.exe -k shutdown\".\n\nSee http://httpd.apache.org/docs/2.3/platform/windows.html#wincons\n\nThat doesn't work. It seems the -k switch will look for httpd installed as a service.", "id": 127708, "time": "2009-06-06T20:58:50Z", "bug_id": 47325, "creation_time": "2009-06-06T20:58:50Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 47325, "attachment_id": null, "is_private": false, "id": 127715, "time": "2009-06-07T06:45:00Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2009-06-07T06:45:00Z", "text": "Yes, neither shutdown nor restart for a non service httpd work this way under Windows.\n\nI have code making this work, but I'm not sure, whether we should really support it, because any console window from which you will be able to do this must be part of the same login session. So if you use the same login session, you could just as well type Ctrl-C (shutdown) or Ctrl-Break (restart) in the original Console window used for starting httpd.\n\nCan you imagine any use case, where this wouldn't be possible just as well?\n\nOf course, if we decide not to support \"-k\" for commandline httpd on Windows, we need to fix the docs."}, {"count": 2, "tags": [], "bug_id": 47325, "text": "> Can you imagine any use case, where this wouldn't be possible just\n> as well?\n\nYes. Suppose I programmatically start a process that runs httpd.exe . I wouldn't have any console at all. I've tried without success to send terminate signals to the process (on win32); there doesn't seem to be any functions to send a CTRL_C_EVENT to:\n\n1. A non-console process (I could be wrong)\n\n2. A process that didn't spawn from a console process (I'm sure about this).\n\nAs my program isn't itself a console process, I couldn't terminate the process I created to run httpd.exe .\n\nAll these acrobatics with signals to processes can be avoided if we allow `httpd.exe -k stop' on the console. I'm curious how you did this, though. Searched for a pid? Registry key?\n\n\"-k\" for commandline really won't be necessary if I simply run processes that fire off \"-k install -n ServiceName\" and \"-k start...\". In fact, that is my current solution now, to uninstall the service once my program exits.\n\nI was only worried that users may not have permissions to create services.\n\n> Of course, if we decide not to support \"-k\" for commandline httpd on\n> Windows, we need to fix the docs.\n\nThanks for the confirmation of my findings. Thought I missed something there. :)", "id": 127717, "time": "2009-06-07T07:49:24Z", "creator": "jhannwong@gmail.com", "creation_time": "2009-06-07T07:49:24Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "is_private": false, "id": 127718, "time": "2009-06-07T07:56:38Z", "bug_id": 47325, "creation_time": "2009-06-07T07:56:38Z", "text": "My code only uses the existing event infrastructure in httpd source and reads the pid from the pid file (so if you have started httpd with some \"-f\" using a non stadard pid file, you also would have to pass \"-f\" to the stop to find the right pid file). So it is only able to stop or restart console processes started from the same login."}, {"count": 4, "tags": [], "bug_id": 47325, "attachment_id": null, "id": 127720, "time": "2009-06-07T08:23:10Z", "creator": "wrowe@apache.org", "creation_time": "2009-06-07T08:23:10Z", "is_private": false, "text": "The discussion is welcomed, but remember that console processes are not the\ntarget of the -k stop API.  This is because console processes are launched\nthrough some other facility which should track what should be stopped.\n\nTherefore we keep user-launched console processes attached to the console\nwindow, such that Ctrl+C will stop them.  This is sufficient for testing.\nThere is also a windows event mechanism that can be used to halt or even\nrestart httpd.\n\nBut the mechanism correlated to Unix daemon processes on Windows are Windows\nServices, and therefore this was always the \"supported\" mechanism.  I'm\nconsidering the various permutations of Ranier's patches to determine which\nis best for the user community while being least disruptive to the default.\n\nI'll work up some patches to docs that better clarify this all.\n\nW.R.T. Ranier's comments, although it would also be possible to stop such\nservices from the Administrator login, it might be necessary for us to add\nsome games to elevate privileges.  I'll consider such a patch in the coming\nweeks, since I already patched ApacheMonitor.exe."}, {"count": 5, "tags": [], "creator": "jhannwong@gmail.com", "attachment_id": null, "is_private": false, "id": 127726, "time": "2009-06-07T19:24:59Z", "bug_id": 47325, "creation_time": "2009-06-07T19:24:59Z", "text": "> But the mechanism correlated to Unix daemon processes on Windows are\n> Windows Services, and therefore this was always the \"supported\"\n> mechanism.\n\nAgreed. Daemons serve the widest need, be it my unusual use case or the usual http server deployment case. And daemons really are the proper way to run server processes.\n\n> I'll work up some patches to docs that better clarify this all.\n\nThat's great. I'm actually very surprised this \"bug\" with the docs is there. The rest of the docs are squeaky clean. Thanks for making it better than 100%. :)"}, {"count": 6, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "text": "Moving docs bugs to docs@httpd.a.o ownership.", "id": 141210, "time": "2010-10-29T11:06:55Z", "bug_id": 47325, "creation_time": "2010-10-29T11:06:55Z", "is_private": false}, {"text": "I'm not a Windows expert, but I've changded the instructions in the trunk doc for stopping the server when running in a console as described in this bug.\n\nThanks for the report.", "tags": [], "bug_id": 47325, "is_private": false, "count": 7, "id": 141441, "time": "2010-11-04T18:48:24Z", "creator": "poirier@pobox.com", "creation_time": "2010-11-04T18:48:24Z", "attachment_id": null}]