[{"count": 0, "tags": [], "bug_id": 47344, "attachment_id": null, "is_private": false, "id": 127787, "time": "2009-06-10T05:44:42Z", "creator": "rbowen@apache.org", "creation_time": "2009-06-10T05:44:42Z", "text": "I'd like a new argument to UseCanonicalName. The current syntax of UseCanonicalName is:\n\nUseCanonicalName On|Off|DNS\n\nI'd like a fourth option, 'Redirect', which would do the same thing as:\n\nRewriteRule (.*) http://$SERVERNAME/$1 [R,L]\n\nThat is, any request that's received on a ServerAlias will be immediately redirected to the canonical ServerName value.\n\nThe justifications for this are numerous, from preserving the right hostname in cookies, to ensuring the right hostname for SSL certificates, to the eternal (if occasionally misguided) quest for SEO brownie points.\n\nThis also goes under the general heading of my quest to see mod_rewrite become unnecessary except for the gravest situations. :-)"}, {"count": 1, "tags": [], "bug_id": 47344, "attachment_id": null, "text": "-1 veto.\n\nThe UseCanonicalName directive is a *passive* setting.  It does not modify the\nresource served by a given request.  Your request is an active reaction to\na given request that is out of scope.  And note your proposal fails to make\nthat distinction between On and DNS redirection.\n\nMight I suggest a directive\n\nRedirectCanonicalName [on|off]\n\nto accomplish what you are attempting to do here?  It would have a specific\naction in the mod_alias TranslateName hook.", "id": 127803, "time": "2009-06-10T10:54:29Z", "creator": "wrowe@apache.org", "creation_time": "2009-06-10T10:54:29Z", "is_private": false}, {"count": 2, "tags": [], "text": "Sure, that would be perfect. Strangely, when I started opening the ticket, I thought, RedirectCanonicalName, but then started looking at UseCanonicalName and thought maybe this would be better than adding a while new directive. But as there seems to be a strong reason for *not* doing that, I certainly don't object. mod_alias seems like a good place to put it. Should I open a separate ticket for this, can can this one be repurposed?", "attachment_id": null, "bug_id": 47344, "id": 127812, "time": "2009-06-10T11:43:03Z", "creator": "rbowen@apache.org", "creation_time": "2009-06-10T11:43:03Z", "is_private": false}]