[{"count": 0, "tags": [], "bug_id": 47349, "attachment_id": null, "id": 127797, "time": "2009-06-10T07:48:34Z", "creator": "iknopf.bxug-1@csc-dd.de", "creation_time": "2009-06-10T07:48:34Z", "is_private": false, "text": "Deployment of huge WAR files in a LAN or any WAR files in a WAN doesn't work properly. Tomcat seems to try unzipping an incomplete uploaded WAR file.\nUsing a 64-kbit WAN I can't upload a WAR file containing just a small \"index.jsp\"; in a slow LAN I have equivalent problems with WAR files of 20...30 MByte."}, {"count": 1, "tags": [], "text": "Use the manager app rather than copying the file directly.", "is_private": false, "id": 127798, "creator": "markt@apache.org", "time": "2009-06-10T07:56:45Z", "bug_id": 47349, "creation_time": "2009-06-10T07:56:45Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 47349, "attachment_id": null, "is_private": false, "id": 127856, "time": "2009-06-10T23:44:13Z", "creator": "iknopf.bxug-1@csc-dd.de", "creation_time": "2009-06-10T23:44:13Z", "text": "Perhaps you misunderstood me: I have only problems when I use the manager application: This application provides a \"Deploy\" subsection, there I use \"WAR file to deploy\" and \"Select WAR file to upload\" and - after selecting a WAR file\", I press \"Deploy\". And this does NOT WORK in described circumstances (huge WAR files in a slow LAN, any WAR file in a WAN)."}, {"count": 3, "tags": [], "text": "Hmm. The manager app should stop the deployer from doing anything until the upload is complete to prevent this. Either that isn't working or the upload itself is failing.\n\nHow long does the upload take when it fails? Is there some upload time above which it always fails?", "is_private": false, "id": 127875, "creator": "markt@apache.org", "time": "2009-06-11T06:22:11Z", "bug_id": 47349, "creation_time": "2009-06-11T06:22:11Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 47349, "attachment_id": null, "id": 127878, "time": "2009-06-11T08:04:52Z", "creator": "iknopf.bxug-1@csc-dd.de", "creation_time": "2009-06-11T08:04:52Z", "is_private": false, "text": "I didn't measure the exact upload time. I think if the upload time is less than a second the deployment is okay, if it takes more than 2 seconds (perhaps more than 5) the deployed WAR file will not work."}, {"count": 5, "attachment_id": null, "bug_id": 47349, "is_private": false, "id": 130901, "time": "2009-10-06T05:53:21Z", "creator": "uwe@cscc.de", "creation_time": "2009-10-06T05:53:21Z", "tags": [], "text": "Ingolf, does this happen for new applications, never deployed before, or only for applications you previously undeployed before uploading and deploying it again?\n\nDid you see any logs appear while this happend?\n\n-- \nKind Regards\nUwe Günther"}, {"count": 6, "tags": [], "text": "I had this problem only on new applications. I've never tried a redeployment of previously undeployed applications, so I have no idea, if it would have worked.\n\nNo logfiles available, I usually had this problem on a tomcat installed at our customers, where I have no access to the file system (... and 2 minutes ago I re-tried installing a 15-kByte file per manager upload hoping to find such a logfile, but this time it worked perfectly. Sorry, effect of demonstration.)", "is_private": false, "id": 130902, "creator": "iknopf.bxug-1@csc-dd.de", "time": "2009-10-06T06:17:09Z", "bug_id": 47349, "creation_time": "2009-10-06T06:17:09Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 47349, "attachment_id": null, "id": 130907, "time": "2009-10-06T07:30:49Z", "creator": "uwe@cscc.de", "creation_time": "2009-10-06T07:30:49Z", "is_private": false, "text": "Thanks Ingolf, I will have a look to reproduce this with the debugger. I will let you know here. There is a deamonthread where the AutoDeployer of the HostConfig.java kicks in on a regular base. I had a lock in the manager code and before the uploaded file gets written to the disk, the upcomming context gets flaged as serviced by an external application (in our case the /manager servlet)) to the AutoDeployer part of the HostConfig.java. So from an high level code review it looks ok, but let me see.\n\n-- \nKind Regards \nUwe Günther"}, {"count": 8, "tags": [], "bug_id": 47349, "attachment_id": null, "id": 130926, "time": "2009-10-06T23:08:06Z", "creator": "iknopf.bxug-1@csc-dd.de", "creation_time": "2009-10-06T23:08:06Z", "is_private": false, "text": "I tested it yesterday again and again, but it worked everytime well. But I remember one difference: When the error occured we used Java 5 in every tomcat installation, but now we've changed to Java 6."}, {"count": 9, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 131539, "creation_time": "2009-11-01T16:39:13Z", "time": "2009-11-01T16:39:13Z", "bug_id": 47349, "text": "This sounds like some form of network issue but it is hard to be sure. I can't reproduce this so I am closing it. If you see the issue again and can provide steps to reproduce or can work with us to track down the root cause please re-open and we'll take another look.", "is_private": false}]