[{"count": 0, "tags": [], "text": "Hi,\n\nthis is yet another patch to enable auto table layout. I've done some work for one of our customers who needs auto table layout. This patch is doing the job.\n\nI've tried several ways to minimize side effects (and implementation efforts) as much as possible. Now it hardly affects the existing process.\n\nMay be there are cases which are not considered currently. It's certainly an improvable approach.\n\nBest Regards\nAchim", "attachment_id": null, "id": 127793, "creator": "achim.derigs@googlemail.com", "time": "2009-06-10T07:14:38Z", "bug_id": 47347, "creation_time": "2009-06-10T07:14:38Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 47347, "attachment_id": 23787, "id": 127794, "time": "2009-06-10T07:21:24Z", "creator": "achim.derigs@googlemail.com", "creation_time": "2009-06-10T07:21:24Z", "is_private": false, "text": "Created attachment 23787\nauto-table-layout.diff"}, {"count": 2, "tags": [], "bug_id": 47347, "attachment_id": null, "is_private": false, "id": 127861, "time": "2009-06-11T03:54:03Z", "creator": "vhennebert@gmail.com", "creation_time": "2009-06-11T03:54:03Z", "text": "Hi Achim,\n\n(In reply to comment #0)\n> Hi,\n> \n> this is yet another patch to enable auto table layout. I've done some work for\n> one of our customers who needs auto table layout. This patch is doing the job.\n> \n> I've tried several ways to minimize side effects (and implementation efforts)\n> as much as possible. Now it hardly affects the existing process.\n> \n> May be there are cases which are not considered currently. It's certainly an\n> improvable approach.\n> \n> Best Regards\n> Achim\n\nThank you very much for your patch. It may prove useful to other users who need this feature to work on simple tables.\n\nWe are not going to apply it to the Trunk, though, as it only cover very simple cases. For example, it doesn't handle the case of a cell consisting of a long paragraph that must be broken into lines. Also it doesn't seem to do well with nested tables.\n\nStill, like I said above some users with only simple cases may be interested in applying this patch to their local copy.\n\nI hope you understand.\nThanks,\nVincent"}, {"count": 3, "tags": [], "bug_id": 47347, "attachment_id": null, "is_private": false, "id": 135569, "time": "2010-03-23T19:21:53Z", "creator": "apache.bugzilla@umito.nl", "creation_time": "2010-03-23T19:21:53Z", "text": "I tried the patch.\nIt doesn't work with current trunk revision, but it does (of course) work with the revision specified in the diff (783305). Not really a problem.\n\nIt works great for simple tables. Main problem I have with the patch is that it doesn't work when the block that contains the table, or the table itself has a margin-left set. It falls back to the original FOP behaviour, which is unwanted.\n\nThat's quite a problem, since you can't layout any table on the page this way.\n\nI hope this can be easily adjusted, but since this patch is almost a year old, I am afraid it won't happen. Will try to look into it myself, but the codebase is too advanced for me to really grasp.\n\nI do have some money to spend as a bounty for getting it to work however."}, {"count": 4, "text": "In case anyone needs to use this auto layout table with a margin-left set on containing block:\nUse a 2 column table. Set first column-width to the required left-margin. Fill the second column with the table that you want auto-layouted. This way the auto-layout still works and you have a left margin.\n\nSo, this will do for me.", "bug_id": 47347, "attachment_id": null, "id": 135668, "time": "2010-03-26T13:05:31Z", "creator": "apache.bugzilla@umito.nl", "creation_time": "2010-03-26T13:05:31Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 47347, "is_private": false, "text": "resetting P2 open bugs to P3 pending further review", "id": 157376, "time": "2012-04-07T01:42:05Z", "creator": "gadams@apache.org", "creation_time": "2012-04-07T01:42:05Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 47347, "attachment_id": null, "text": "increase priority for bugs with a patch", "id": 157878, "time": "2012-04-11T03:22:13Z", "creator": "gadams@apache.org", "creation_time": "2012-04-11T03:22:13Z", "is_private": false}]