[{"count": 0, "tags": [], "creator": "poirier@pobox.com", "text": "Created attachment 23900\nFix memory leak in 2.0 mod_mem_cache\n\nIn 2.0.x, mod_mem_cache has a memory leak.  The attached patch\ncorrects it.  \n\nThe problem doesn't happen in 2.2 or trunk, since mod_mem_cache's\nmemory management was completely re-written for 2.2.\n\nThe leak occurs when a cache entry expires, the cache determines that\nit is still valid, and updates the headers saved in the cache entry.\nThe previously saved headers are never freed.\n\nSimply adding free() calls before saving the new headers resulted in\ninstability under load, as other threads might still be accessing the\nolder saved headers.  The patch looks at the reference count, and if\nit might not be safe to free the old headers yet, remembers the\npointers to free them later.\n\nSome alternative approaches would have been to use a process-wide lock\nto make sure no other thread could access the entry at the same time,\nbut that would likely have had terrible effects on performance.  Or a\nper-cache-entry lock might have been used, but managing those would\nrequire a pool for each cache entry, and by the time that was all\ndone, we'd be half-way to the 2.2 code anyway.\n\nI've run this for hours, and a slightly earlier version for\ndays, under the same load that originally reproduced the memory leak\nand then the instability with the simple fix.\n\nI don't know if mod_mem_cache in 2.0 is used widely enough to warrant\nfixing this.  I'd rather just move to 2.2 myself, but couldn't in this\ncase.  But I wanted to at least provide the patch, in case someone\nelse is running into the problem.", "id": 128392, "time": "2009-06-29T08:10:01Z", "bug_id": 47449, "creation_time": "2009-06-29T08:10:01Z", "is_private": false, "attachment_id": 23900}, {"count": 1, "tags": [], "creator": "christophe.jaillet@wanadoo.fr", "attachment_id": null, "id": 170450, "time": "2013-10-06T11:41:45Z", "bug_id": 47449, "creation_time": "2013-10-06T11:41:45Z", "is_private": false, "text": "2.0 branch is now closed. (http://www.apache.org/dist/httpd/Announcement2.0.html)\n\n\nAs stated above, 2.2 and above are not impacted, so I just close this PR as WONTFIX"}]