[{"count": 0, "tags": [], "bug_id": 47446, "text": "For my given project, I am trying to create standalone executable jars. And because at the compile time I do not know what is the Class-Path for the application jar being built, Class-Path is being set at the run-time and I achieve this by extending the Jar task:\n\n \n\nCode snippet:\n\nString formattedManifestClassPath = \"aaa.jar bbb.jar ccc.jar ddd.jar eee.jar fff.jar ggg.jar hhh.jar iii.jar jjj.jar kkk.jar lll.jar mmm.jar nnn.jar ooo.jar ppp.jar qqq.jar rrr.jar sss.jar ttt.jar uuu.jar vvv.jar www.jar xxx.jar yyy.jar zzz.jar\";\n \nManifest.Attribute classpathAttribute =\nnew Manifest.Attribute(Manifest.ATTRIBUTE_CLASSPATH, formattedManifestClassPath);\n \nmanifest.addConfiguredAttribute(classpathAttribute);\n \nNow the problem is that the Class-Path in MANIFEST.MF file (int the jar) is generated as\n \nClass-Path: aaa.jar bbb.jar ccc.jar ddd.jar eee.jar fff.jar ggg.jar hh\n h.jar iii.jar jjj.jar kkk.jar lll.jar mmm.jar nnn.jar ooo.jar ppp.jar\n  qqq.jar rrr.jar sss.jar ttt.jar uuu.jar vvv.jar www.jar xxx.jar yyy.\n jar zzz.jar\n\nSo if you observe the last jar's on each line of Class-Path may or may-not get split based on the write rules ( Manifest.MF only allows 71 characters on each line and after 71 Character's thw Manifest.write() inserts \\n and a space character - this causes -in my example- hhh.jar to split over 2 lines hh \\n h.jar.\n\nSo when I try to run this jar via java - jar command, class-path is being ignored because it is not formatted correctly. \n\nI have tried implementing hacks - but nothing works - This definitely is a bug in the Manifest.write() method ( Method should insert \\n logically such that it is not splitting a jar name over multiple lines - or to make it more simple, on each line there should only be one jar file name - class-path's can get really long).\n\nI will really appreciate if this can be fixed ASAP.\n\nThanks,\nGarima.", "id": 128372, "time": "2009-06-29T00:29:15Z", "creator": "Garima.Bathla@gmail.com", "creation_time": "2009-06-29T00:29:15Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 47446, "text": "Garima, \n\nyou've already been told that the classpath entry inside the MANIFEST.MF is correct on the mailing list - this is what the specification of the manifest format says: no lines longer than 72 chars (including newline) with continuation lines starting with a space.\n\nIf you classpath doesn't work it is *not* because of the formatting of the classpath entry - unless the code reading the manifest was in violation of the spec, that is.", "id": 128378, "time": "2009-06-29T02:49:12Z", "creator": "bodewig@apache.org", "creation_time": "2009-06-29T02:49:12Z", "is_private": false, "attachment_id": null}]