[{"attachment_id": null, "tags": [], "bug_id": 47469, "is_private": false, "count": 0, "id": 128485, "time": "2009-07-02T10:39:50Z", "creator": "osegarra@gencat.net", "creation_time": "2009-07-02T10:39:50Z", "text": "Hi, \n\nWe are trying to deploy an application in a multilevel path /Gabjur/AD but we system does not deploy the webapp as it is described in http://tomcat.apache.org/tomcat-5.5-doc/config/context.html\n\nIn the server.xml file we have the following entry:\n\n      <Host\n         appBase=\"D:\\Export\\webapps_instancia2\"\n         name=\"localhost\">\n\nIn the \\Catalina\\localhost\\Gabjur#AD.xml we have the following:\n\n<Context path=\"/Gabjur/AD\" reloadable=\"true\" antijarlocking=\"true\" antiresourcelocking=\"true\">\n    <Resource \n\nIn D:\\Export\\webapps_instancia2 we have a Gabjur folder and inside this Gabjur folder we have placed the AD.war file (noghing else): D:\\Export\\webapps_instancia2\\Gabjur\\AD.war\n\nAfter restarting the system we expected to have a new directory in the \\Gabjur folder called AD (D:\\Export\\webapps_instancia2\\Gabjur\\AD) with the deployed AD.war webapp. But system creates a directory called Gabjur#AD directory in the appBase directory (D:\\Export\\webapps_instancia2\\Gabjur#AD).\n\nNow we have stoped the server and we have moved D:\\Export\\webapps_instancia2\\Gabjur#AD folder to D:\\Export\\webapps_instancia2\\Gabjur\\AD folder and restarting the system webapp is not redeployed in a Gabjur#AD folder (as it was initially) and application is accessible from http://localhost:8080/Gabjur/AD as it is expected.\n\nThe problem is each time we have to restart our server twice: one for the initial deployment at Gabjur#AD folder and another with this Gabjur#AD folder moved to Gabjur\\AD.\n\nWe have tested to create an empty AD directory in the Gabjur folder but system detects a folder and it does not deploy the application (neither in Gabjur#AD folder). In linux it deploys it in spite of the empty folder.\n\nDeployment system does not look to work correclty in this conditions. Is there any workarround o known fix.\n\nThanks a lot."}, {"count": 1, "tags": [], "text": "Multi-level deployment doesn't work the way you think it does. Please use the users list for assistance.", "attachment_id": null, "bug_id": 47469, "id": 128487, "time": "2009-07-02T13:18:09Z", "creator": "markt@apache.org", "creation_time": "2009-07-02T13:18:09Z", "is_private": false}]