[{"count": 0, "tags": [], "creator": "alexey.v.varlamov@gmail.com", "attachment_id": 23933, "id": 128541, "time": "2009-07-06T01:05:00Z", "bug_id": 47476, "creation_time": "2009-07-06T01:05:00Z", "is_private": false, "text": "Created attachment 23933\nSuggested fix to the problem.\n\nOnce mod_session saves a session (to cookie), the session expiration cannot be reset - the only way to delete and re-create cookie anew. \n\nAccordingly to documentation:\n\"The SessionMaxAge directive defines a time limit for which a session will remain valid. When a session is saved, this time limit is reset and an existing session can be continued.\"\nHowever tests and code inspection show that the expiry can be set just once and later updates do not refresh the session.\nAlso, \"Max-Age\" value for the updated session cookie is not passed to a user agent.\n\nPlease see the suggested fix attached."}, {"count": 1, "tags": [], "text": "Yow!  Those functions are a bit of a confusing mess (declared int, return apr_status_t - ouch).  Which should it be?\n\nThe second half of your patch looks obviously right.  But are you sure the first half won't also update the expiry when that wasn't intended?", "is_private": false, "bug_id": 47476, "id": 128545, "time": "2009-07-06T02:03:20Z", "creator": "nick@webthing.com", "creation_time": "2009-07-06T02:03:20Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 47476, "attachment_id": null, "text": "Actually there are 2 interconnected issues. As I said, original code did not reset expiry AND was dropping \"Max-Age\" value when updating session.\nThe first chunk of the patch only changes maxage setting logic, the expiry handling is not changed:\n< earlier the maxage was only set if a new session is created or a session encountered which does not have expiry while it should per configuration (AFAIU only possible if server gets re-configured adding MaxAge and user comes with older cookie w/o expiry); and normally loaded sessions had maxage=0 (as maxage is not included to session encoding)\n--\n> now maxage is set always when present in config.\n\nSo the first chunk is necessary preparation for the second one :) \nOtherwise, if loaded session is modified and saved but maxage is zero, it should expire immediately.\n\nAs for the mess in functions, indeed they are declared to return int - don't know why :)", "id": 128574, "time": "2009-07-06T22:32:14Z", "creator": "alexey.v.varlamov@gmail.com", "creation_time": "2009-07-06T22:32:14Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 47476, "attachment_id": null, "is_private": false, "id": 170593, "time": "2013-10-13T13:10:30Z", "creator": "minfrin@sharp.fm", "creation_time": "2013-10-13T13:10:30Z", "text": "Fixed in trunk in r1531683, proposed for backport to v2.4.x."}, {"count": 4, "tags": [], "creator": "minfrin@sharp.fm", "text": "Backported to v2.4.7.", "id": 170876, "time": "2013-10-28T12:09:51Z", "bug_id": 47476, "creation_time": "2013-10-28T12:09:51Z", "is_private": false, "attachment_id": null}]