[{"count": 0, "tags": [], "bug_id": 47491, "attachment_id": null, "is_private": false, "id": 128614, "time": "2009-07-07T15:39:29Z", "creator": "herve.girod@club-internet.fr", "creation_time": "2009-07-07T15:39:29Z", "text": "RFE #33348 asks to be able to convert SVG to WMF or EMF. \n\nThis RFE asks to be able to convert SVG to PowerPoint documents. Basically a SVG document would become one slide in a PPT document. This capability would also allow as some cool side effects:\n- being able to get WMF and EMF images (because PowerPoint allows conversion to EMF and WMF)\n- being able to create \"natively\" a PPT document from a SVG image for eople who want to use EMF and WMF just to get a PowerPoint document at the end\n- interoperate with programs such as OpenOffice which are able to read PowerPoint documents\n\nI (Hervé Girod) have a working copy of a SVG => PowerPoint transcoder, using Apache POI HSLF classes in scratchpad (last POI Beta version). I could not use the PPGraphics2D which comes with the HSLF package; however using this class fired no exceptions, but the result was very incorrect, though I don't know if it comes from the maturity of this class, the way I used it, or even specific Graphics2D features that were heavily used by my (rather complex) SVG examples and not supported yet. It turned out I created a new PPTranscoder class, associated with a PPTGraphics2D (of course).\n\nI have no problem to give this code to Apache (I already filed a contributor agreement some time ago and sent a lot of patches for the WMF => SVG conversion), as it can be useful to others, but apart from the fact that I surely have to perform more tests, I really don't know how to integrate it in Batik (it uses a part of POI).\n\nPOI is under Apache 2.0 like Batik. The problem is I don't know what is the best way to 'integrate\" POI library with Batik in order to provide this functionality without making Batik dependent from POI at the end (and even if this is really possible to do this cleanly)"}, {"count": 1, "text": "Hello Hervé!\n\nHow well does the Conversion to Powerpoint work? In a recent project of mine I need a usable converter from (EPS or) SVG to EMF. (This is very related to #33348). Your approach sounds promising. Could you post your code so we can have a look?", "bug_id": 47491, "is_private": false, "id": 132074, "time": "2009-11-18T01:28:43Z", "creator": "florian.sesser@gmail.com", "creation_time": "2009-11-18T01:28:43Z", "tags": [], "attachment_id": null}]