[{"count": 0, "tags": [], "bug_id": 47514, "attachment_id": 23961, "id": 128769, "time": "2009-07-12T11:58:37Z", "creator": "jmarine@dev.java.net", "creation_time": "2009-07-12T11:58:37Z", "is_private": false, "text": "Created attachment 23961\nPatch to add basic suport for Subject Directory Attributes extension\n\nHello everyone.\n\nI think \"mod_ssl\" doesn't have enough support for Subject Directory Attributes extension (that may contain personal data information). It doesn't generates environment variables for the common attributes, and restrictions seem  impossible (PeerExtList \"function\" returns a mix of all attribute values with incorrect characters, but doesn't allow to select one of the attributes of the \"SDA\").\n\nSo, I would like to contribute the attached patch to add basic support for Subject Directory Attributes extension. It generates the following environment variables (when present in peer certificate, and the new \"SubjectDirAttrVars\" option is enabled in \"SSLOptions\"):\n\nSSL_CLIENT_EXT_SDA_GENDER\nSSL_CLIENT_EXT_SDA_COUNTRYOFRESIDENCE_n\nSSL_CLIENT_EXT_SDA_COUNTRYOFCITIZENSHIP_n\nSSL_CLIENT_EXT_SDA_PLACEOFBIRTH\nSSL_CLIENT_EXT_SDA_DATEOFBIRTH\nSSL_CLIENT_EXT_SDA_AGE\n\n\nIt is also possible to add restrictions on the previous variables.\nFor example:\nSSLRequire %{SSL_CLIENT_EXT_SDA_AGE} >= 18\n\nThat can be very useful to restrict adult contents, when using client credentials like Spanish electronic National Identity Card (DNIe).\n\n\nThe enhancements are only implemented for OpenSSL toolkit (I don't have SSL-C toolkit).\n\nBut I expect you will find it interesting enough, to commit the patch to the apache server project.\n\n-----\nJordi Marine\n<jmarine@dev.java.net>"}, {"count": 1, "tags": [], "bug_id": 47514, "attachment_id": 23967, "id": 128788, "creation_time": "2009-07-13T06:38:56Z", "time": "2009-07-13T06:38:56Z", "creator": "jmarine@dev.java.net", "text": "Created attachment 23967\nPatch to add basic suport for Subject Directory Attributes extension (revision 2)\n\nThe first patch didn't free the peer certificate memory when generating the new environment variables for the \"SubjectDirAttrVars\" option, but \"Subject Directory Attributes\" extension was not present in client certificate. The second patch, also includes the proposed enhancement, and fixes this memory issue.", "is_private": false}]