[{"count": 0, "attachment_id": null, "bug_id": 47552, "is_private": false, "id": 129009, "time": "2009-07-20T20:42:48Z", "creator": "damjan.perenic@guest.arnes.si", "creation_time": "2009-07-20T20:42:48Z", "tags": [], "text": "Currently there is no way to compress data on the fly with scp task.\n\nMy build produces over 90MB of highly compressable files which are then uploaded sometimes over slow link. Compression would help a lot.\n\nI can exec scp with -C parameter, but that it not cross platform. It will not work on Windows, unless some kind of scp is present in path."}, {"count": 1, "tags": [], "bug_id": 47552, "is_private": false, "text": "Created attachment 33791\nPatch to add compression option to Ant scp task\n\nThis patch adds the currently unavailable compression option to the Ant scp task. On the command line, it's just adding a \"-C\" to the parameters of the \"scp\" command. This fix exposes this parameter up to the level of the Ant task wrapper with the boolean \"compressed\" parameter.\n\nAll modifications are to classes in the org.apache.tools.ant.taskdefs.optional.ssh package.\n\nA private boolean flag to indicate whether compression should be used is added to AbstractSshMessage, mutable only via a new constructor which overloads the previous constructor by adding the new parameter. The flag's value is visible via a new accessor method, getCompressed(). The AbstractSshMessage class is extended by both ScpFromMessage and ScpToMessage. Both ScpFromMessage and ScpToMessage contain execute() methods. New overloaded constructors have been added to both ScpFromMessage and the ScpToMessage to include the boolean flag to use compression. These flags are passed into the call to\n the parent AbstractSshMessage class's newly added constructors.\n\nIn ScpFromMessage, the execute() method is where the call to \"scp\" with its various command line parameters is made. This has been altered to check the parent class's getCompressed() accessor method. If true, the \"-C\" command line parameter is appended to the command String.\n\nThe ScpToMessage class's execute() method calls one of two other private member methods to enact the \"scp\" command: doSingleTransfer() and doMultipleTransfers(), depending on whether either a single file or a list of files has been specified. In both of these methods, the parent class's getCompressed() accessor method is checked. If true, the \"-C\" command line parameter is appended to the command String.\n\nFinally, the Scp class, representing the actual ant task, was modified to include a private boolean flag to indicate that compression should be used. Its value is defaulted to false, and the class has been modified to include a standard mutator method for it. This new boolean flag is the parameter by which the compression option can be used. A call to the An\nt task using the new compression option would look like the following:\n<scp file=\"myfile.txt\" todir=\"user@somehost:/home/chuck\" password=\"password\" compression=\"true\" />", "id": 190466, "time": "2016-04-21T19:16:01Z", "creator": "matthew.yanos@ptpinc.com", "creation_time": "2016-04-21T19:16:01Z", "attachment_id": 33791}, {"count": 2, "tags": [], "bug_id": 47552, "text": "Thanks a lot Matthew\n\nunfortunately the patch didn't apply cleanly because of other changes made to scp in the meantime. I've tried to adapt it, the result is commit 3fe363e - currently inside a branch. See for example https://github.com/apache/ant/commit/3fe363e2120342f6de2b219c3bd74efe9aea2803\n\nDo you think I've adapted it correctly or did I miss anything?", "id": 191166, "time": "2016-05-22T15:59:13Z", "creator": "bodewig@apache.org", "creation_time": "2016-05-22T15:59:13Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 47552, "text": "Yes, I reviewed it, and your adaptation looks correct to me. I didn't notice any missed modifications. I very much appreciate you doing the manual merge work to include this. Thanks!", "id": 191169, "time": "2016-05-22T17:40:45Z", "creator": "matthew.yanos@ptpinc.com", "creation_time": "2016-05-22T17:40:45Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 47552, "text": "Thank you.\n\nI've merged the branches, the feature will be available inn 1.9.8 and 1.10.0.", "id": 191178, "time": "2016-05-23T04:03:40Z", "creator": "bodewig@apache.org", "creation_time": "2016-05-23T04:03:40Z", "is_private": false, "attachment_id": null}]