[{"count": 0, "tags": [], "bug_id": 47586, "attachment_id": 24041, "text": "Created attachment 24041\nPatch to move \"-k start\" for mpm_winnt form post config to pre config\n\nObserved on Windows XP SP 3.\n\nConfiguration: Default plus rotatelogs.\n\nService can be started and works using the service manager or ApacheMonitor. But when started via commandline \"httpd -k start\" the service doesn't start. The event log shows:\n\n  (OS 10048)Normalerweise darf jede Socketadresse (Protokoll, Netzwerkadresse\n  oder Anschluss) nur jeweils einmal verwendet werden.  : make_sock: could not\n  bind to address 0.0.0.0:8000\n\n  no listening sockets available, shutting down\n\n  Unable to open logs\n\nThis doesn't happen on another test system with Windows 2K3 SP 2 using the same binaries and configuration.\n\nProblem analysis shows:\n\n\"httpd -k start\" starts the service in post config. Before it opens, it starts the listening sockets and also starts rotatelogs itself. Then, shortly before starting the service it closes the sockets it has opened.\n\nIf one looks at netstat between closing the sockets and the starting of the service, it still shows the socket listening (so the service can't successfully start). This only happens if rotatelogs is configured, so it seems the rotatelogs child process somehow inherits the socket and inhibits the close call from the parent to actualy succeed. The call to apr_socket_close() does return with APR_SUCCESS though. SysInternals ProcessExplorer and \"netstat -ano\" both show the httpd commandline process as having the socket in LISTEN even after it has called apr_socket_close().\n\nThere is a lot of additional network related software on the test system (VMWare, VPN clients etc.), but I think the attached patch is nevertheless valid in general. It moves the \"-k start\" handling from post config to pre config, so that no listeners are opened and no loggers spawned in the commandline process.\n\nSee also \n\nhttp://marc.info/?l=apache-httpd-dev&m=124853079730814&w=2\n\nand the followup messages.", "id": 129166, "time": "2009-07-27T06:16:49Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2009-07-27T06:16:49Z", "is_private": false}, {"count": 1, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "id": 129167, "time": "2009-07-27T06:39:26Z", "bug_id": 47586, "creation_time": "2009-07-27T06:39:26Z", "is_private": false, "text": "I tested on another Windows XP SP3 system and could not reproduce there. That system is more bare bones. So the issue depends on the exact patch plus additional software installation status.\n\nThe root cause of the problem could be related to BZ 46139. But we can solve this service start issue here with the attached patch, whereas a solution for 46139 seems to be more difficult (without using DisableWin32AcceptEx).\n\nTo avoid confusion: DisableWin32AcceptEx does not help for this issue here."}, {"count": 2, "tags": [], "bug_id": 47586, "attachment_id": null, "text": "The problem is also not directly related to rotatelogs itself, only to the use of a piped logger.\n\nIf I replace rotatelogs by some dummy program, the same problem occurs.\n\nIt is also independent of using the piped logger directly or via cmd.exe (\"||\" or \"|\").", "id": 129168, "time": "2009-07-27T06:41:52Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2009-07-27T06:41:52Z", "is_private": false}]