[{"count": 0, "text": "The POM files of the companions project have problems:\n* they state they are using 1.2 as the compile version, but they are using classes from 1.4+ (e.g. XML DOM classes);\n* the \"assembly\" goal is not connected to a phase (I suppose that it is \"package\"\n* project \"apache-log4j-receivers\" depend on log4j 1.2.16-SNAPSHOT, while version 1.2.15 is enough.", "bug_id": 47595, "is_private": false, "id": 129205, "time": "2009-07-28T06:45:06Z", "creator": "antonio.petrelli@gmail.com", "creation_time": "2009-07-28T06:45:06Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 47595, "attachment_id": 24050, "id": 129207, "time": "2009-07-28T06:48:35Z", "creator": "antonio.petrelli@gmail.com", "creation_time": "2009-07-28T06:48:35Z", "is_private": false, "text": "Created attachment 24050\nPatch for the \"apache-log4j-component\" project"}, {"count": 2, "tags": [], "text": "Created attachment 24051\nPatch for the \"apache-log4j-extras\" project", "is_private": false, "id": 129208, "creator": "antonio.petrelli@gmail.com", "time": "2009-07-28T06:49:11Z", "bug_id": 47595, "creation_time": "2009-07-28T06:49:11Z", "attachment_id": 24051}, {"count": 3, "tags": [], "bug_id": 47595, "attachment_id": 24052, "is_private": false, "id": 129209, "time": "2009-07-28T06:49:38Z", "creator": "antonio.petrelli@gmail.com", "creation_time": "2009-07-28T06:49:38Z", "text": "Created attachment 24052\nPatch for the \"apache-log4j-receivers\" project"}, {"count": 4, "text": "Fix committed to svn trunk in r821364", "bug_id": 47595, "is_private": false, "id": 130862, "time": "2009-10-03T14:13:43Z", "creator": "sdeboy@iname.com", "creation_time": "2009-10-03T14:13:43Z", "tags": [], "attachment_id": null}, {"count": 5, "text": "Sorry, I thought I had commented on this on the mailing list.\n\njavax.xml.parsers was available for earlier JDK's as an additional component.\n\nThe source and target parameters on a Java compiler do not indicate the version of JDK necessary to build the component, they specify the version of the Java language specification accepted and the version of the Java byte-code emitted.  There are specific reasons why 1.1 was chose for byte-code and 1.2 was selected for source.  Those choices were made a long time ago and maybe the should be review but the post did indicate any specific problem that occurred due to that choice or advantage that would be gained by changing the versions.  As deep in the maintenance cycle as log4j 1.2 is, it seems unwise to make changes for no defined benefit.", "bug_id": 47595, "is_private": false, "id": 130869, "time": "2009-10-03T21:13:11Z", "creator": "carnold@apache.org", "creation_time": "2009-10-03T21:13:11Z", "tags": [], "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 47595, "attachment_id": null, "id": 130876, "time": "2009-10-04T04:16:09Z", "creator": "antonio.petrelli@gmail.com", "creation_time": "2009-10-04T04:16:09Z", "is_private": false, "text": "I must admit that the compilation problem appears only in Eclipse, because, when choosing a runtime environment, it enforces restrictions in class use. In this case, if I have a 1.2 version of JDK, I cannot use XML classes.\nUsually this is not an issue, but probably, since Eclipse is OSGi based, this can cause a problem under OSGi-based applications (never tested it, though).\nAnyway I don't see why it is a problem to \"upgrade\" the companions, Java 1.2 is abandoned, Java 5 is at the end-of-life, Java 1.4 seems \"reasonably old\" :-D"}, {"count": 7, "tags": [], "creator": "carnold@apache.org", "attachment_id": null, "id": 130877, "time": "2009-10-04T06:17:10Z", "bug_id": 47595, "creation_time": "2009-10-04T06:17:10Z", "is_private": false, "text": "Good to know the problem you were trying to fix.  Is this observed with Eclipse projects that are generated with \"mvn eclipse:eclipse\", with projects that Eclipse reads directly or is it using Maven with the Eclipse java compiler?\n\nLeaving the byte-code at 1.1 allows us to binary diff the generated classes with earlier versions of log4j 1.2 to determine that we didn't make inadvertent changes between versions.  That is an auditing step that we could still do by rolling back the target, but it is an extra annoyance and it is a nice check for something as widely deployed as log4j.\n\nThe assert keyword was added in the Java language at 1.4.  I'm not sure if that required upgrading the byte-code version to 1.4 also.  Could you try just upgrading the source to 1.4 and see if that eliminates your issue with Eclipse.  Updating source to 1.5 definitely requires updating the byte-code to 1.5 since there are productions that can not be generated using 1.1 byte code."}, {"count": 8, "tags": [], "bug_id": 47595, "attachment_id": null, "id": 130883, "time": "2009-10-05T01:24:19Z", "creator": "antonio.petrelli@gmail.com", "creation_time": "2009-10-05T01:24:19Z", "is_private": false, "text": "I use m2eclipse plugin, so it's a Maven inside Eclipse.\nIt's a strange situation, now everything works fine, with the exception of an error in the properties of the project, as Eclipse (Galileo)  does not list 1.2 version as possible value of the Java source :-O\nAnyway, it compiles.\nSo, I think the source/target levels can be restored to original values.\n\nAbout the asserts, what are you referring to? I don't see any assert inside the companion code."}, {"count": 9, "tags": [], "text": "We are using the Apache parent pom meanwhile and have merged the components to a single jar. Therefore I am closing this issue as described problems should not longer occur. Thanks!", "attachment_id": null, "id": 167234, "creator": "grobmeier@gmail.com", "time": "2013-05-16T09:12:48Z", "bug_id": 47595, "creation_time": "2013-05-16T09:12:48Z", "is_private": false}]