[{"count": 0, "tags": [], "bug_id": 47610, "attachment_id": 24069, "id": 129304, "time": "2009-07-30T12:58:53Z", "creator": "spepping@apache.org", "creation_time": "2009-07-30T12:58:53Z", "is_private": false, "text": "Created attachment 24069\nclasses for hyphenation, generated from UnicodeData.txt\n\nThe TeX people are now moving to Unicode based TeX engines. Therefore they created new hyphenation pattern files in utf-8 encoding, see http://www.ctan.org/tex-archive/language/hyph-utf8/tex/generic/hyph-utf8/patterns/ and http://tug.org/svn/texhyphen/trunk/hyph-utf8/tex/generic/hyph-utf8/patterns/. These pattern files can be directly transformed into XML format and used in FOP. I tested a few, and had no problems.\n\nThey lack one thing, however, classes. FOP uses classes to determine what is a letter (only words consisting of letters will be hyphenated) and the LC/UC mapping. TeX gets the classes from its Unicode setup, see e.g. http://scripts.sil.org/svn-public/xetex/TRUNK/texmf/tex/generic/xetex/unicode-letters.tex. I have tried to do the same, and I attach the result. These classes would be valid for each hyphenation pattern file. Some localizations seem to have their own variants of the LC/UC mapping, but I have not investigated that.\n\nThe classes were generated as follows: Roughly, each character that is its own LC generates a class. Its UC and TC (title case character) are added to the class. More precisely, the selection of characters generating a class was done as follows:\n1. In the first plane,\n2. Category Ll or Lu or Lt and its own LC character, or category Lo,\n3. Not in the following blocks: Superscripts and Subscripts, Letterlike Symbols, Alphabetic Presentation Forms, Halfwidth and Fullwidth Forms, CJK Unified Ideographs, CJK Unified Ideographs Extension A, Hangul Syllables.\n\nWe can do two things: Add these classes to each hyphenation file, or add them to the code that generates the hyphenation trie, preferably to be read from a separate file. I prefer the latter option. What do you think?"}, {"count": 1, "tags": [], "creator": "spepping@apache.org", "attachment_id": null, "id": 129361, "time": "2009-07-31T12:29:53Z", "bug_id": 47610, "creation_time": "2009-07-31T12:29:53Z", "is_private": false, "text": "Of course, I can also XInclude the classes into the pattern files. The question is if the classes are more a property of FOP or of the hyphenation pattern files."}, {"count": 2, "tags": [], "bug_id": 47610, "text": "Hi Simon,\n\n(In reply to comment #0)\n> Created an attachment (id=24069) [details]\n> classes for hyphenation, generated from UnicodeData.txt\n<snip/> \n> We can do two things: Add these classes to each hyphenation file, or add them\n> to the code that generates the hyphenation trie, preferably to be read from a\n> separate file. I prefer the latter option. What do you think?\n\nNot that I know much about hyphenation, but the latter option also looks preferable to me. I'd say that the classes belong in FOP.\n\nVincent", "id": 129514, "attachment_id": null, "creator": "vhennebert@gmail.com", "creation_time": "2009-08-06T02:45:16Z", "time": "2009-08-06T02:45:16Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 47610, "attachment_id": null, "id": 137095, "time": "2010-05-25T05:26:21Z", "creator": "spepping@apache.org", "creation_time": "2010-05-25T05:26:21Z", "is_private": false, "text": "Fixed in revision 805561 and some later revisions, finally in revision 810896"}, {"count": 4, "tags": [], "text": "batch transition pre-FOP1.0 resolved+fixed bugs to closed+fixed", "attachment_id": null, "bug_id": 47610, "id": 156165, "time": "2012-04-01T07:02:12Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T07:02:12Z", "is_private": false}]