[{"count": 0, "tags": [], "bug_id": 47629, "attachment_id": null, "id": 129415, "time": "2009-08-03T12:59:43Z", "creator": "michael_mclawhorn@yahoo.com", "creation_time": "2009-08-03T12:59:43Z", "is_private": false, "text": "I've seen this bug intermittently in the past but now I'm reproducing it consistently in my dev environment, and I'm not at all sure how to debug it (or even how to categorize it)\n\nA java webapp is deployed to the server.  Subsequently all responses are delayed by one request.  The first request fails in some way.  Then each response is displayed as the answer to the request one after it.  And this crosses users, so if there are multiple users using different webapplications I can see another user's page render if I'm the next to post a request after his response.  \n\nOnce this behavior begins, the only way to clear it up seems to be to shut down the entire tomcat instance and restart it.  This is not an acceptable situation for our production environments which have many webapplications.\n\nOne thing that seemed to be a contributing factor back when this problem was originally discovered seemed to be if the web.xml was being touched multiple times (with config parameter substitution) that seemed to increase the odds of this situation.  In the current case, however, the deploy scripts have been adjusted so all subsitutions are done before copying the webapplication files to the server."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 129416, "time": "2009-08-03T13:14:18Z", "bug_id": 47629, "creation_time": "2009-08-03T13:14:18Z", "text": "As this is consistent, please can you provide the steps to reproduce this on a clean 5.5.27 Tomcat install.\n\nAs an aside, the only time I have seen this to date is when an app held onto a response object between requests"}, {"count": 2, "tags": [], "bug_id": 47629, "attachment_id": null, "text": "Let me clarify, it's happening right now consistently in my non-clean Tomcat instance with a large and particularly complex web application.  I'm not at all certain how to reproduce it on a clean install.  I was hoping I could get some advice at how to poke into the Tomcat internals and get useful diagnostic information to isolate the issue.", "id": 129420, "time": "2009-08-03T14:44:27Z", "creator": "michael_mclawhorn@yahoo.com", "creation_time": "2009-08-03T14:44:27Z", "is_private": false}, {"count": 3, "attachment_id": null, "creator": "markt@apache.org", "text": "Start tomcat with\ncatalina.bat jpda start\nand then connect your favourite IDE on port 8000 for remote debugging.\nYou'll need to point your IDE to s 5.5.27 source bundle to do anything useful\n\nPut a break point in org.apache.catalina.connector.CoyoyeAdaptor.service() and follow the processing of your first few requests.\n\nThings to look out for:\n1. Why does the first request break?\n2. Does the response object being used ever change?\n\nI suspect the answer to question 1 will help with question 2.", "id": 129422, "time": "2009-08-03T15:47:15Z", "bug_id": 47629, "creation_time": "2009-08-03T15:47:15Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 47629, "attachment_id": null, "text": "No update in 2 months, so assuming that the app was holding onto request objects and closing this as invalid. If this is not the case, please re-open and provide a test case to reproduce.", "id": 130848, "time": "2009-10-03T09:33:07Z", "creator": "markt@apache.org", "creation_time": "2009-10-03T09:33:07Z", "is_private": false}]