[{"count": 0, "tags": [], "bug_id": 47637, "text": "Created attachment 24094\nFO\n\nWhen a table-cell break over two pages the display-align=\"after\" attribute set\nthe content to the bottom of the first page instead of the bottom of the second\npage", "id": 129440, "time": "2009-08-04T07:04:47Z", "creator": "guillaume.levrero@free.fr", "creation_time": "2009-08-04T07:04:47Z", "is_private": false, "attachment_id": 24094}, {"count": 1, "tags": [], "bug_id": 47637, "attachment_id": 24095, "id": 129441, "time": "2009-08-04T07:05:15Z", "creator": "guillaume.levrero@free.fr", "creation_time": "2009-08-04T07:05:15Z", "is_private": false, "text": "Created attachment 24095\nPDF"}, {"count": 2, "tags": [], "creator": "jeremias@apache.org", "attachment_id": null, "text": "Guillaume, the XSL specification defines display-align in terms of areas and not related to the table-cell. A table-cell produces more than one area if it is broken accross pages. The behaviour in this case is correct IMO. I find nothing in the spec that would support your expectation (although it can make sense).\n\nhttp://www.w3.org/TR/xsl11/#display-align\n\nIn your case, you can try to work-around this by putting the bottom-aligned content in a separate cell and use row-spanning on the first column and a fixed height for the second row with the content that is bottom-aligned. But if that content doesn't always have the same height (more or less), this is probably not going to work. Disclaimer: I haven't verified this myself.\n\nI'm inclined to close this issue as invalid but to be sure, I'd appreciate an opinion from a fellow committer.", "id": 129449, "time": "2009-08-04T12:11:51Z", "bug_id": 47637, "creation_time": "2009-08-04T12:11:51Z", "is_private": false}, {"count": 3, "tags": [], "creator": "vhennebert@gmail.com", "attachment_id": null, "text": "(In reply to comment #2)\n> Guillaume, the XSL specification defines display-align in terms of areas and\n> not related to the table-cell. A table-cell produces more than one area if it\n> is broken accross pages. The behaviour in this case is correct IMO. I find\n> nothing in the spec that would support your expectation (although it can make\n> sense).\n> \n> http://www.w3.org/TR/xsl11/#display-align\n> \n> In your case, you can try to work-around this by putting the bottom-aligned\n> content in a separate cell and use row-spanning on the first column and a fixed\n> height for the second row with the content that is bottom-aligned. But if that\n> content doesn't always have the same height (more or less), this is probably\n> not going to work. Disclaimer: I haven't verified this myself.\n> \n> I'm inclined to close this issue as invalid but to be sure, I'd appreciate an\n> opinion from a fellow committer.\n\nConfirmed. Guillaume's requirement definitely is valid but unfortunately can't be addressed with display-align=\"after\".\n\nUsing a row-span and setting a fixed height on the second row wouldn't work. FOP's support of fixed row heights still is limited.\n\nIf doable, you can split the first column's cell in two rows, and put on the second row content that amounts to the same height as the second column's cell  (and play with borders and padding such that the two cells look like a single one).\n\nAnother solution would be to put the content of the second cell in the table's footer, in an absolutely-positioned block-container shifted to the top so that it overlaps the table's body (see upcoming attachment). Setting the \"bottom\" property to \"0\" should do the job but for some reason it doesn't work. So you have to put a negative value in \"top\" that is worth the line-height plus the cell's padding-bottom (14pt here).\n\nHTH,\nVincent", "id": 129562, "time": "2009-08-07T03:28:24Z", "bug_id": 47637, "creation_time": "2009-08-07T03:28:24Z", "is_private": false}, {"count": 4, "tags": [], "creator": "vhennebert@gmail.com", "attachment_id": 24117, "text": "Created attachment 24117\nA solution using table-footer", "id": 129563, "time": "2009-08-07T03:30:24Z", "bug_id": 47637, "creation_time": "2009-08-07T03:30:24Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 47637, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs", "id": 156540, "time": "2012-04-01T13:49:31Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T13:49:31Z", "is_private": false, "attachment_id": null}]