[{"count": 0, "tags": [], "creator": "business2008@rodneybeede.com", "text": "OpenSSL bundled with the Win32 installer comes with an out-of-date version of OpenSSL.\n\nOpenSSL version 0.9.8k should be used which resolves the following issues:\n\n---------------\n\nOpenSSL before 0.9.8k are affected by multiple vulnerabilities:\n\nASN1 printing crash (CVE-2009-0590). The ASN1_STRING_print_ex function in affected versions of OpenSSL could allow remote attackers to cause a denial of service (invalid memory access and application crash) via vectors that trigger printing of a BMPString or UniversalString with an invalid length.\nIncorrect Error Checking During CMS verification (CVE-2009-0591). When CMS is enabled, the CMS_verify function does not properly handle errors associated with malformed signed attributes. This could allow remote attackers to repudiate a signature that originally appeared to be valid but was actually invalid.\nInvalid ASN1 clearing check (CVE-2009-0789). On WIN64 and certain other platforms affected versions of OpenSSL do not properly handle a malformed ASN.1 structure. This could allow remote attackers to cause a denial of service (invalid memory access and application crash) by placing this structure in the public key of a certificate, as demonstrated by an RSA public key.\n\n--------------\n\nMultiple OpenSSL DTLS Denial of Service Vulnerabilities\n\nThe dtls1_buffer_record function in OpenSSL 0.9.8k and earlier could allow remote attackers to cause a denial of service (memory consumption) via a large series of \"future epoch\" DTLS records that are buffered in a queue, aka \"DTLS record buffer limitation bug\". (CVE-2009-1377)\n\nOpenSSL 0.9.8 up to and including 0.9.8k could allow remote attackers to cause a denial of service (memory consumption) via DTLS records that are duplicates, or have sequence numbers much greater than current sequence numbers (DTLS fragment handling memory leak). (CVE-2009-1378)\n\nOpenSSL 1.0.0 Beta2 contains a use-after-free vulnerability in the dtls1_retrieve_fragment function. This could allow remote attackers to cause a denial of service (openssl s_client crash) and possibly have unspecified other impact vua a DTLS packet, as demonstrated by a packet from a server that uses a crafted server certificate. (CVE-2009-1379)\n\nThe dtls1_retrieve_buffered_fragment function in OpenSSL before 1.0.0 beta2 could allow remote attackers to cause a denial of service (NULL pointer dereference and daemon crash) via an out-of-sequence DTLS handshake message, related to a \"fragment bug\". (CVE-2009-1387)\n\n---------------\n\nOpenSSL DSA/ECDSA \"EVP_VerifyFinal()\" Spoofing Vulnerability\n\nOpenSSL before 0.9.8j does not properly check the return value from the EVP_VerifyFinal function. This could allow remote attackers to bypass validation of the certificate chain via a malformed SSL/TLS signature for DSA and ECDSA keys.", "id": 129499, "time": "2009-08-05T13:23:50Z", "bug_id": 47649, "creation_time": "2009-08-05T13:23:50Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 47649, "is_private": false, "text": "We are familiar with these; they only primarily affect httpd as a client (think\nproxy connections to an untrusted back end server).  Therefore there appeared\nno urgency to updating this.\n\nThe httpd contributors update OpenSSL upon each release, so with the 2.2.13\nrelease, there will be an updated openssl bundled.", "id": 129504, "time": "2009-08-05T14:11:53Z", "creator": "wrowe@apache.org", "creation_time": "2009-08-05T14:11:53Z", "attachment_id": null}]