[{"count": 0, "tags": [], "creator": "josh.ribakoff@gmail.com", "text": "http://forums.devnetwork.net/viewtopic.php?f=6&t=104170&p=557306#p557306\n\nIf I request /foo/ apache serves /foo.html, which prevents me from rewriting /foo/(.*) to foo.php?$1 Appears to be undocumented behavior from the accept path info directive, more info @ devnetwork", "id": 129463, "time": "2009-08-04T21:19:14Z", "bug_id": 47644, "creation_time": "2009-08-04T21:19:14Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "This behavior is by design.\n\nDisable multiviews or disable acceptpathinfo.\n\nissues.apache.org is not a support forum.  Use the peer-support users@ list\nto discuss configurations", "is_private": false, "id": 129464, "creator": "wrowe@apache.org", "time": "2009-08-04T21:23:44Z", "bug_id": 47644, "creation_time": "2009-08-04T21:23:44Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 47644, "text": "if I have foo.htm and foo.php why should requesting /foo/ serve 1 over the other?? Shouldn't this be in the documentation?", "id": 129491, "time": "2009-08-05T10:17:32Z", "creator": "josh.ribakoff@gmail.com", "creation_time": "2009-08-05T10:17:32Z", "tags": [], "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 47644, "is_private": false, "id": 129492, "time": "2009-08-05T10:41:05Z", "creator": "poirier@pobox.com", "creation_time": "2009-08-05T10:41:05Z", "tags": [], "text": "Bugzilla is not the place to argue about whether something is a bug or you just don't understand the behavior.  Take it to the users mailing list."}, {"count": 4, "tags": [], "creator": "josh.ribakoff@gmail.com", "text": "That is fine, but then that makes this a documentation issue and should remain open, it should at least be documented so people don't waste valuable work days screwing around.\n\n\"This directive controls whether requests that contain trailing pathname information that follows an actual filename (or non-existent file in an existing directory) will be accepted or rejected.\"\n\nNowhere does it state\n\n\"This directive will check if the prefix of the filename before the extension matches a requested PATH and serve the first file it finds\"\n\nI am raising issues of undocumented behavior, at the very least it should explain how it decides what file to include if I request /foo/\n\nand there are 2 files\n/foo.htm\n/foo.sql\n\nDoes it go alphabetically?\nDoes it pick based on some extension priority?\n\nThis are basically rhetorical questions a user would ask him / herself after reading the documentation. I am not asking for support since I already fixed my issue, I am simply stating the actual behavior and documentation differ. The fact if it was \"intended\" or not I am not arguing.", "id": 129495, "time": "2009-08-05T11:10:02Z", "bug_id": 47644, "creation_time": "2009-08-05T11:10:02Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "nick@webthing.com", "is_private": false, "text": "It is in the documentation.  But this is the WRONG PLACE to discuss that.\n\nClue: what comes before the PATH_INFO is not affected by the PATH_INFO.  So blank out the trailing / and read the docs that are relevant to your question.", "id": 129498, "time": "2009-08-05T13:05:04Z", "bug_id": 47644, "creation_time": "2009-08-05T13:05:04Z", "attachment_id": null}, {"count": 6, "tags": [], "text": "Ok so multi views in the documentation answers my question, that apache will basically randomize what it serves with some convoluted weighting scheme. great.\n\nbut shouldn't a rewrite rule with an [L] flag take precedence over this ( undesired! ) feature?? I am not sure if that is \"by design\" or not but it simply does not make sense, so I am just suggesting, if the user asks to rewrite a URL\n\nThere are people whos SEO is being destroyed by this \"feature\" http://www.gerd-riesselmann.net/archives/2005/04/beware-of-apaches-multiviews\nhttp://www.webmasterworld.com/apache/3595094.htm\n\nIT WOULD APPEAR that your users disagree with you. At the very least in my humble opinion the rewrite engine should run before the multi-views so that the [L] flag does what it intends to, I for one feel that this contradicts what is stated in the rewrite engine documentation then\n\n\"Once a request comes in, and Apache has determined the appropriate server (or virtual server), the rewrite engine starts the URL-to-filename translation,\"\n\nThis is incorrect then, it should state that multiviews and god knows what else can mess with the URL first, even if it didn't state specific modules, theres nothing to lead a newb like me to believe the rewrite engine isn't _first_ in the chain\n\n\"It is in the documentation.  But this is the WRONG PLACE to discuss that.\"\n\nSo if there are issues with the documentation then APACHE doesn't want to know about it? Really?", "is_private": false, "id": 129500, "creation_time": "2009-08-05T13:31:27Z", "time": "2009-08-05T13:31:27Z", "creator": "josh.ribakoff@gmail.com", "bug_id": 47644, "attachment_id": null}, {"count": 7, "tags": [], "creator": "josh.ribakoff@gmail.com", "text": "\"from the per-server configuration in the URL-to-filename phase\"\nmaybe this part is supposed to convey it? In my opinion that should be reworded because that is definitely not very clear to me, just my 2 cents.", "id": 129501, "time": "2009-08-05T13:33:29Z", "bug_id": 47644, "creation_time": "2009-08-05T13:33:29Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "is_private": false, "id": 129505, "time": "2009-08-05T14:16:46Z", "bug_id": 47644, "creation_time": "2009-08-05T14:16:46Z", "text": "Josh, the number of interactions between your choice of configuration of\nthe entire array of modules cannot reasonably be documented.  Yes, they have\ninteractions, and the behavior of Multiviews is well documented, which is\nprecisely what you configured.\n\nReopen this upon threat of being blacklisted to apache.org topography, your\nimmature behavior is not amusing.  You have been told repeatedly that this\nis not a support forum."}]