[{"count": 0, "tags": [], "creator": "alex@envivio.com", "attachment_id": null, "id": 129548, "time": "2009-08-06T14:55:34Z", "bug_id": 47657, "creation_time": "2009-08-06T14:55:34Z", "is_private": false, "text": "When WebDAV MOVE is used to replace an existing file with a new one, mod_dav systematically deletes the destination file before moving the new file to the destination filename. This non-atomicity leads to a race condition whereby GET requests can return 404 Not Found for a short time. When the source and destination are on the same filesystem, it should be possible to use standard OS APIs for file renaming (which generally support atomic file replacement) without deleting the destination file first.\n\nSee line 2873 of modules/dav/main/mod_dav.c (http://svn.apache.org/viewvc/httpd/httpd/trunk/modules/dav/main/mod_dav.c?revision=644050):\n\n    /* If destination is being replaced, remove it first\n     * (we know Ovewrite must be TRUE). Then try to copy/move the resource.\n     */\n    if (replace_dest)\n        err = (*resnew->hooks->remove_resource)(resnew, &multi_response);\n\n    if (err == NULL) {\n        if (is_move)\n            err = (*resource->hooks->move_resource)(resource, resnew,\n                                                    &multi_response);\n        else\n            err = (*resource->hooks->copy_resource)(resource, resnew, depth,\n                                                    &multi_response);\n    }\n\nIt may be sufficient to simply suppress the call to remove_resource to fix this bug, although I haven't tried it...\n\nThe original WebDAV specification (RFC 2518) clearly says that the replacement should occur atomically:\n\n8.9 MOVE Method\n\n   The MOVE operation on a non-collection resource is the logical\n   equivalent of a copy (COPY), followed by consistency maintenance\n   processing, followed by a delete of the source, where all three\n   actions are performed atomically.\n\nThe more recent specification (RFC 4918) changes the wording slightly: \"all three actions are performed in a single operation\". Whether this means \"atomic\" is debatable. Nevertheless, it is highly useful in practice for the operation to be atomic whenever possible.\n\nNote: To ensure atomic file replacement on Win32, it is apparently necessary to use MoveFileTransacted to ensure atomicity (see http://msdn.microsoft.com/en-us/library/aa365241%28VS.85%29.aspx), although this API is only supported on Vista and later. For other OSes, POSIX rename should do the job."}, {"count": 1, "attachment_id": null, "bug_id": 47657, "is_private": false, "id": 131792, "time": "2009-11-07T14:22:28Z", "creator": "sf@sfritsch.de", "creation_time": "2009-11-07T14:22:28Z", "tags": [], "text": "It is not that easy:\n\n- The current mod_dav API requires that the destination of a move_resource does not exist.\n- The move must also work if the destination is a collection (directory).\n- The move must also move the properties.\n\nMaybe the API should be changed in a way that move_resource should handle this automatically."}]