[{"count": 0, "tags": [], "creator": "bprucha@gmail.com", "text": "Created attachment 24129\nFix to prevent headers from being dropped\n\nIn Windows 2000 Server with IIS 5.0 when using isapi_redirect.dll as an\nextension, the SF_NOTIFY_AUTH_COMPLETE event is not called.  This means the\nHTTP_TOMCATURI_XXXXXXXX and HTTP_TOMCATWORKER_XXXXXXXX headers don't exists. \nHowever the number of headers sent to Tomcat is automatically reduced by 2\nassuming these headers exists causing other legitimate headers to get dropped.", "id": 129627, "time": "2009-08-11T12:31:37Z", "bug_id": 47679, "creation_time": "2009-08-11T12:31:37Z", "is_private": false, "attachment_id": 24129}, {"count": 1, "tags": [], "creator": "Tim.Whittington@orionhealth.com", "text": "This is interesting - I seem to remember testing on Windows 2000 Server when making changes to this area, and the AUTH_COMPLETE was firing.\n\nDepending on whether your connector was built with automatic notification event detection (mine are, but not sure about the ones available via Tomcat) you may be able to force the use of SF_NOTIFY_PREPROC_HEADERS by setting auth_complete=0 in your configuration.\n\nI don't think your proposed patch will work - trapping the appropriate notify event in HttpFilterProc is necessary for the redirector to work (all of the URI -> worker mapping happens there).\n\nThe fix should be to make automatic flag detection work on Windows 2000 (reliably), or simply to use the manual override with an appropriately built connector.\n\nPerhaps some additional error checking in HttpExtensionProc to check if the filter has executed correctly would also be in order.", "id": 133312, "time": "2010-01-04T11:46:04Z", "bug_id": 47679, "creation_time": "2010-01-04T11:46:04Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 47679, "is_private": false, "id": 133453, "time": "2010-01-08T06:45:29Z", "creator": "bprucha@gmail.com", "creation_time": "2010-01-08T06:45:29Z", "tags": [], "text": "I'm not sure you understand what I mean by \"extension\". I am referring to the IIS application mappings (Website properties / Home Directory / Configuration under Application settings / Mappings / Add mappings of specific extensions to ISAPI dll). In this scenario IIS handles the authentication and isapi_redirect does not use the url mappings.\n\nUnfortunately I am no longer using Windows 2000 server so I can't verify the settings you are talking about though I am quite positive I had auth_complete=0. I initially ran into this problem using the precompiled dll downloaded from the apache website so if that version was built with automatic notification event detection then that is what I was using. Even if that isn't the case I know IIS intercepts the authentication when using the filter as an \"extension\" so the SF_NOTIFY_AUTH_COMPLETE event does not get called."}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "Report on users list of similar issues on windows 2k8/ IIS 7.5:\nhttp://markmail.org/message/obnvxffoc4wwy2x4", "id": 145339, "time": "2011-03-28T04:25:56Z", "bug_id": 47679, "creation_time": "2011-03-28T04:25:56Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 47679, "attachment_id": null, "text": "I've committed a fix for this.\nThe ISAPI Redirector was assuming that it was always running in 'redirector' mode, where the filter part of the redirector was determining whether an incoming URL matched and forwarding that match to the extension part via magic HTTP headers.\n\nThe extension code was not accounting for the 'legacy' mode of operation, where those headers were not present.\nThe downside is an insignificant memory overhead on each request.\n\nFix will be in 1.2.32", "id": 145690, "time": "2011-04-11T05:36:20Z", "creator": "timw@apache.org", "creation_time": "2011-04-11T05:36:20Z", "is_private": false}]