[{"count": 0, "tags": [], "text": "<snip> from users@tomcat.apache.org\n There has to be some use of that resource-ref element. All the Tomcat\n> examples and tutorials instruct you to create this element. Someone\n> really badly wants you to use it, yet it seemingly has not function\n> whatsoever. Something just doesn't add up, or maybe it's just me...\n \nIt's not just you. I've also been wondering why you should need it when\nobviously you don't as your <Resource> works without a <resource-ref>.\n\n<commentary>\nif web.xml <resource-ref> and <resource-env-ref> tags are optional \ncould the documentation be updated to say web.xml <resource-ref> and <resource-env-ref> tags are 'optional'\n\n<Existing Documentation considerations>\nchange tomcat-docs/config/context.html#Resource Definitions\nYou can declare the characteristics of the resource to be returned for JNDI lookups of <resource-ref> and <resource-env-ref> elements in the web application deployment descriptor. You MUST also define the needed resource parameters as attributes of the Resource element, to configure the object factory to be used (if not known to Tomcat already), and the properties used to configure that object factory.\n\nchange Documentation to:\nOptionally you can declare the characteristics of the resource to be returned for JNDI lookups of <resource-ref> and <resource-env-ref> elements in the web application deployment descriptor. Be advised that both <resource-ref> and <resource-env-ref> tags are OPTIONAL tags within web.xml\nYou MUST define the needed resource parameters as attributes of the Resource element, to configure the object factory to be used (if not known to Tomcat already), and the properties used to configure that object factory.\nThe ApplicationContext.xml <Resource> tag within <Context> is mandatory for the resource to be recognised.\n\n....\nThe valid attributes for a <Resource> element are as follows:\n...\n\nThanks,\nMartin-\nFor example, you can create a resource definition like this:\n\nThanks \nMartin", "attachment_id": null, "bug_id": 47769, "id": 130062, "time": "2009-08-31T04:49:13Z", "creator": "mgainty@hotmail.com", "creation_time": "2009-08-31T04:49:13Z", "is_private": false}, {"count": 1, "tags": [], "text": "I took a look at this and it works as follows:\n\n- if there is enough info in web.xml to create the resource, that is all that is required\n- if more info is needed to create the resource, then that must be provided via a Context element\n- any resource defined via a context element need not be defined in web.xml\n\nIt is a good idea to list all the resources in web.xml to document the JNDI resource expectations of the web app.\n\nI have updated the docs in trunk, 6.0.x and 5.5.x to try and make this clearer.", "attachment_id": null, "id": 132805, "creator": "markt@apache.org", "time": "2009-12-14T10:14:07Z", "bug_id": 47769, "creation_time": "2009-12-14T10:14:07Z", "is_private": false}]