[{"count": 0, "tags": [], "text": "There should be something like  \"Version Released DD MMM YYYY\"  in the Change Log and Release Notes pages on tomcat.apache.org as well as the \"RELEASE-NOTES\" file in the official distro bundles.\n\nAlso the Apache Tomcat Versions table on http://tomcat.apache.org/ should have a third column \"Released\" with the appropriate dates.\n\nIt is useful because when my company is using version 6.0.3, and I want to tell them to upgrade to the latest version I can easily tell them how old that version is.  That encourages them to do the upgrade sooner instead of putting it off.", "is_private": false, "bug_id": 47777, "id": 130116, "time": "2009-09-02T07:18:03Z", "creator": "business2008@rodneybeede.com", "creation_time": "2009-09-02T07:18:03Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "id": 130812, "time": "2009-10-02T05:39:29Z", "bug_id": 47777, "creation_time": "2009-10-02T05:39:29Z", "is_private": false, "text": "It cannot be done, because Change Log and RELEASE NOTES are part of the release bundle, and when the bundle is created (and signed) nobody knows what the release date will be, and whether the bundle will be released or rejected, and once the bundle is created, it cannot be changed.\n\n\nThere is usually at least a week for voting between creating the bundle and releasing it. If you need to say \"n years ago\", such precision is sufficient.\n\nYou can: a) look at the time when the release bundle was created (e.g. at archive.apache.org),\n\nb) look at the time when the relevant tag in subversion was created (and commit e-mails can be found in dev@ archives).\n\nc) subscribe/search archives of announce@ / users@ / dev@ [1], where release announcements are published.\n\n[1] http://tomcat.apache.org/lists.html\n\n\nAlso, if you want to encourage them to upgrade, it is good to point at\nhttp://tomcat.apache.org/security.html"}, {"count": 2, "tags": [], "bug_id": 47777, "attachment_id": null, "id": 130834, "creation_time": "2009-10-02T19:30:09Z", "time": "2009-10-02T19:30:09Z", "creator": "knst.kolinko@gmail.com", "text": "I added official release dates for previous releases to the change log files of TC 5.5 and 6.0. (r821209, r821218). Unless there are objections, it will be in 5.5.29, 6.0.21 onwards.\n\nI think that we can add the new date to the changelog file once the release vote is done and release is announced. Even if the date of the current release is not present in the online copy of the Change Log, it should be fine for ones that want to review our history.\n\nAlso, I should note that if one needs the build date of release binaries, it can be found in the following file in catalina.jar:\norg\\apache\\catalina\\util\\ServerInfo.properties", "is_private": false}]