[{"attachment_id": 24232, "tags": [], "creator": "jimg@docmagic.com", "text": "Created attachment 24232\nadds color pcl support\n\nThe implementation to support color pcl is automatic.  If a color image is\nused, then color pcl is output.  Otherwise, the output remains B/W.", "count": 0, "id": 130225, "time": "2009-09-08T13:48:33Z", "bug_id": 47805, "creation_time": "2009-09-08T13:48:33Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "max@berger.name", "text": "Jim,\n\nI don't understand the motivation behind this: is there an advantage of NOT using color PCL? Are there some printers which don't support it correctly, or is the image quality better? Is the result smaller?\n\nSecond: There are some things which are duplicated in your patch, in particular the lines surrounding the *v6W command. They could be refactored into a private methods.\n\nMax", "count": 1, "id": 130227, "time": "2009-09-08T23:37:49Z", "bug_id": 47805, "creation_time": "2009-09-08T23:37:49Z", "is_private": false}, {"count": 2, "tags": [], "creator": "bowditch_chris@hotmail.com", "attachment_id": null, "text": "Thanks for the patch.\n\nThe current version of the PCL Renderer generates PCL5, but after the PCL5 standard was released there were further standards: PCL5c (for color) and PCL5e. Older printers may only support PCL5, so if you send it PCL5c it will fail to print. Therefore this behaviour should be controlled from a configuration option in fop.xconf. So that existing users of the PCL Renderer can carry on generating PCL5 and not suddenly start getting PCL5c.\n\nOf course nowadays there is also PCL6, but that is a whole new topic!", "id": 130228, "time": "2009-09-09T00:23:34Z", "bug_id": 47805, "creation_time": "2009-09-09T00:23:34Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 47805, "attachment_id": null, "id": 130272, "time": "2009-09-09T23:17:53Z", "creator": "max@berger.name", "creation_time": "2009-09-09T23:17:53Z", "is_private": false, "text": "Just got an email from Jim, which I will summarize:\n\n- B/W PCL is much smaller than color PCL (therefore, the proposed patch makes a lot of sense)\n\n- Older Printers cannot print color PCL directly, is has to be converted to b/w pcl in a separate step.\n\nNow the only question remains if the auto-selection method (as in the patch) should be used or a configuration method. I personally prefer auto-selection, but the \"fop\" tradition is to be more conservative and let the user decide through configuration.\n\nMax\n\nAnd some background reading:\nhttp://en.wikipedia.org/wiki/Printer_Command_Language (Contains Links to PCL spec)"}, {"count": 4, "tags": [], "bug_id": 47805, "attachment_id": null, "text": "I'm not seeing any auto-detection in the patch. What do you refer to? The offline PCL production doesn't allow for bi-directional querying of the printer to get its capabilities so there can't be any auto-detection anyway.\n\nAs Chris noted, not all printers support PCL5C. My Brother HL-1250, for example, prints out garbage with the patch applied. IMO, it's imperative to have a configuration option to enable/disable PCL5C functionality.\n\nI see various issues with the patch:\n- the output is no longer compatible with PCL5 printers.\n- I got ByteArrayOutOfBoundsExceptions with many of my usual test images.\n- PJL support is disabled in a hard-coded fashion (Jim, you can disable PJL in configuration, no need to do that in code: http://xmlgraphics.apache.org/fop/trunk/output.html#pcl-configuration)\n- If I interpreted this correctly from my short test, the color images don't get scaled if the image is not used in its intrinsic size.\n- PCLGenerator.paintBitmap() converts an image to monochrome even though its later rendered in color which gives away lots of performance. Image conversion is an expensive operation.\n- an updated patch should be a bit closer to FOP's coding style (no tabs in particular). Also, you should remove your initials spread throughout the code. Due attribution will be given in the status file and the commit messages.", "id": 130273, "time": "2009-09-10T00:25:14Z", "creator": "jeremias@apache.org", "creation_time": "2009-09-10T00:25:14Z", "is_private": false}, {"count": 5, "tags": [], "creator": "gadams@apache.org", "text": "resetting P2 open bugs to P3 pending further review", "id": 157434, "time": "2012-04-07T01:42:55Z", "bug_id": 47805, "creation_time": "2012-04-07T01:42:55Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 47805, "is_private": false, "text": "increase priority for bugs with a patch", "id": 157867, "time": "2012-04-11T03:21:43Z", "creator": "gadams@apache.org", "creation_time": "2012-04-11T03:21:43Z", "attachment_id": null}]