[{"attachment_id": null, "tags": [], "bug_id": 47816, "is_private": false, "count": 0, "id": 130287, "time": "2009-09-10T08:24:00Z", "creator": "jvangaalen@computest.nl", "creation_time": "2009-09-10T08:24:00Z", "text": "Connections are not properly handled as you expect. When a new loop starts for a single thread, you expect that it would start a new connection. Unfortunately the open connection (when Keep-Alive is enabled) will still be used. What you want is dat a new loop would simulate a new user, so it would start a new connection. This is bad for especially https, which means it doesn't initiate a new SSL Handshake. This is the case for \"HTTP Request\" and \"HTTP Request HTTPClient\".\n\nAnd for the sampler \"HTTP Request\" the open connections are shared among the threads. When Thread 1 has a connection open and is waiting for the next request, Thread 2 will use the open connection of Thread 1. What you expect is that all threads initiates their own connections. Wireshark/tcpdump analyses shows that SYN's are not initiated for new threads when another thread is in an idle state but with a connection to a server open.\n\nEach thread (and iteration / loop) should handle its own connections."}, {"count": 1, "tags": [], "bug_id": 47816, "attachment_id": null, "text": "If you want to close a connection, ensure you don't use Keep Alive for the last sample", "id": 130291, "time": "2009-09-10T09:23:58Z", "creator": "sebb@apache.org", "creation_time": "2009-09-10T09:23:58Z", "is_private": false}, {"count": 2, "text": "(In reply to comment #1)\n> If you want to close a connection, ensure you don't use Keep Alive for the last\n> sample\n\nThat is an option, but not really realistic. When the last action involves many items like gif/css etc. it will use connection: close for all of them. And also, in real life the user would hold his connection until it times out (or browses to another host).\n\nStill there is some connection pooling going on for all the threads what should not be happening.", "creator": "jvangaalen@computest.nl", "is_private": false, "id": 130292, "time": "2009-09-10T09:26:51Z", "bug_id": 47816, "creation_time": "2009-09-10T09:26:51Z", "tags": [], "attachment_id": null}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 130293, "time": "2009-09-10T09:30:14Z", "bug_id": 47816, "creation_time": "2009-09-10T09:30:14Z", "is_private": false, "text": "If you are using the default Http Sampler (Java) then there's no much JMeter can do."}]