[{"count": 0, "tags": [], "creator": "nrc@cs.berkeley.edu", "attachment_id": null, "id": 130337, "time": "2009-09-12T21:47:05Z", "bug_id": 47829, "creation_time": "2009-09-12T21:47:05Z", "is_private": false, "text": "When I build apr 1.3.8 on OSX or Linux, \"apr-1-config --cflags\" yields:\n\n% ./apr-1-config --cflags\n -g -O2\n\nWhy are either of these flags useful? \"apr-config --help\" notes that\n\n\"An application should use the results of --cflags, --cppflags, --includes, and --ldflags in their build process.\"\n\nWhy should an application that links against apr-config include \"-O2\" in its build process, just because apr was compiled that way?\n\nThis is an issue in practice, because \"-O2\" makes debugging harder (and increases compile times, etc.). If an application that links against apr wants to have a \"debug\" build mode, there are 3 options:\n\n(1) Don't include \"apr-1-config --cflags\" in the application's CFLAGS, which is potentially non-portable\n(2) Manually strip \"-O2\" from apr's CFLAGS by text search, which is error-prone and hacky\n\nI think it would be better to limit \"--cflags\" to only include flags that application programs should add to their CFLAGS in order to safely build against APR."}, {"count": 1, "tags": [], "bug_id": 47829, "attachment_id": null, "is_private": false, "id": 134065, "time": "2010-01-31T05:31:27Z", "creator": "jorton@redhat.com", "creation_time": "2010-01-31T05:31:27Z", "text": "APR simply exports all the CFLAGS used during the build.  I think this is reasonable and follows the principle of least surprise - apps built against APR will be built using exactly the same CFLAGS as APR.  Sure, if you want your app to be explicitly built without debugging symbols even if APR is, you will have to manually strip out -g or whatever from CFLAGS.\n\nIt is generally hard/impossible for APR to know what CFLAGS are \"safe\" to strip;  e.g. if any CFLAGS affected an ABI/API choice.   Stripping simply -g and -O2 alone would not necessarily be correct, either; any compiler-specific debugging-related flags might still pass through, e.g. -gdwarf-* etc.  It seems possible that stripping -g alone might even break the build if a combination of flags remained that the compiler fails for."}]