[{"count": 0, "tags": [], "text": "In the documentation about custom resource factories (http://tomcat.apache.org/tomcat-6.0-doc/jndi-resources-howto.html) I read following: You will need to compile this class against a class path that includes all of the JAR files in the $CATALINA_HOME/lib directory. When you are through, place the factory class (and the corresponding bean class) unpacked under $CATALINA_HOME/lib, or in a JAR file inside $CATALINA_HOME/lib. In this way, the required class files are visible to both Catalina internal resources and your web application.\n\nDoes it mean that I must ALWAYS put it in common, or I must put it in common if I want it to be visible to Tomcat? Can I put custom factory to WEB-INF/lib of my application if I don't want it to be visible to Tomcat?\n\nActually we have a custom factory that derive from org.apache.tomcat.dbcp.dbcp.\nBasicDataSourceFactory. We have it inside our war, we're plug it in inside application's context.xml as\n\n<Resource name=\"jdbc/db\" auth=\"Container\"\n         type=\"javax.sql.DataSource\"\n         dsProps=\"properties.file\"\n         removeAbandoned=\"true\"\n         username=\"user\"\n         password=\"pass\"\n         driverClassName=\"com.mysql.jdbc.Driver\"\n         url=\"jdbc:mysql://url\"\n         factory=\"our.package.FactoryClass\" />\n\nFactory just searching for properties.file and if it is found, it's props will be used to create datasource, otherwise props from context.xml will be used. When we're trying to get jdbc/db by calling \nDataSource dataSource   = ( DataSource )( new InitialContext () ).lookup( \"java:/comp/env/jdbc/db\" );\nour FactoryClass is actually called instead. So it is works this way, but I still don't understand is it proper way or not.", "is_private": false, "id": 130360, "creator": "kvasiliev@gmail.com", "time": "2009-09-14T01:48:15Z", "bug_id": 47832, "creation_time": "2009-09-14T01:48:15Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "Bugzilla is not a support forum. This question belongs on the users mailing list.", "id": 132810, "time": "2009-12-14T13:31:17Z", "bug_id": 47832, "creation_time": "2009-12-14T13:31:17Z", "is_private": false, "attachment_id": null}]