[{"count": 0, "tags": [], "creator": "mguillemot@yahoo.fr", "is_private": false, "text": "Created attachment 24305\nPatch replacing usage of StringBuffer by StringBuilder for local variables\n\nTomcat code base uses a lot of StringBuffer where it should use StringBuilder\nfor performance reasons. StringBuilder's JavaDoc is quite explicit:\n\n\"This class is designed for use as a drop-in replacement for StringBuffer in\nplaces where the string buffer was being used by a single thread (as is\ngenerally the case). Where possible, it is recommended that this class be used\nin preference to StringBuffer as it will be faster under most implementations.\n\"\n\nThe provided patch replaces all usage of StringBuffer by StringBuilder for\nlocal variables. It doesn't change any public or protected API even if it would\nprobably make sense (for instance in\nAccessLogValve.AccessLogElement#addElement) and it doesn't change class fields.\n\nNote that the patch just change StringBuffer to StringBuilder even in places\nwhere the java compiler would automatically use a StringBuilder when normal\nstring concatenation is used.", "id": 130601, "time": "2009-09-23T02:28:38Z", "bug_id": 47893, "creation_time": "2009-09-23T02:28:38Z", "attachment_id": 24305}, {"attachment_id": null, "tags": [], "bug_id": 47893, "text": "Ping! Any sign of life here?", "count": 1, "id": 131307, "time": "2009-10-22T08:36:40Z", "creator": "mguillemot@yahoo.fr", "creation_time": "2009-10-22T08:36:40Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 47893, "attachment_id": null, "is_private": false, "id": 131308, "time": "2009-10-22T08:42:39Z", "creator": "markt@apache.org", "creation_time": "2009-10-22T08:42:39Z", "text": "Plenty thanks.\n\nIf you look at the archives you'll see that the backlog of bugs has reduced significantly over the last few years but there is still work to be done. This one is in the queue.\n\nThere are currently 59 open bugs without patches against Tomcat 5 and 6 and a stack of Tomcat 7 development to do for Servlet 3.  Any help with any of the other currently open bugs or the Servlet 3 would be greatly appreciated."}, {"attachment_id": null, "tags": [], "bug_id": 47893, "is_private": false, "count": 3, "id": 131379, "time": "2009-10-26T02:53:10Z", "creator": "mguillemot@yahoo.fr", "creation_time": "2009-10-26T02:53:10Z", "text": "(In reply to comment #2)\nMark, \nyou surely already know that, but quick reactions are the best way for a project to show that it is interested in contributions.\nI agree that complex patches require work to be applied but here I believe that commenting the ticket was nearly more time consuming than understanding and applying the patch."}, {"count": 4, "tags": [], "bug_id": 47893, "attachment_id": null, "text": "trunk has been updated with all StringBuffer usage except that in the Servlet API to required to interface with the Java API switched to StringBuilder.", "id": 131603, "time": "2009-11-02T16:30:24Z", "creator": "markt@apache.org", "creation_time": "2009-11-02T16:30:24Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 47893, "attachment_id": null, "is_private": false, "id": 133072, "time": "2009-12-22T19:45:23Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2009-12-22T19:45:23Z", "text": "Fixed in Tomcat 7.\n\nAs of now, this probably won't be fixed in Tomcat 6, as there is not enough support for these changes. There are no evidences that this will provide any noticeable performance gain."}]