[{"count": 0, "tags": [], "creator": "roman.durdik@volny.cz", "is_private": false, "text": "When the embedded Excel Workbook is opened and stored again into PowerPoint presentation, it is not possible to access it again. Please see the attachment for the program doing the action. There is also the template which consists the embedded excel workbook.", "id": 130757, "time": "2009-09-30T07:01:47Z", "bug_id": 47920, "creation_time": "2009-09-30T07:01:47Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Created attachment 24326\nProgram showing the bug.\n\nThe Eclipse project. The program opens powerpoint template and excel workbook inside it. Then it stores the workbook back to the powerpoint presentation and saves it into output directory. It is needed to put poi-3.5-FINAL-20090928.jar and poi-scratchpad-3.5-FINAL-20090928.jar into lib directory to run the program.", "attachment_id": 24326, "bug_id": 47920, "id": 130759, "time": "2009-09-30T09:16:22Z", "creator": "roman.durdik@volny.cz", "creation_time": "2009-09-30T09:16:22Z", "is_private": false}, {"count": 2, "tags": [], "creator": "yegor@dinom.ru", "is_private": false, "text": "Fixed in r890714\n\nWhen embedding a workbook, MS Office modifies the .xls file and sets a special property called StorageClassID. It turned out that this property is important for embedded objects - MS Office uses it to activate the document's application. HSSFWorkbook did't preserve this property across read-write and it was the reason why PowerPoint could not open embedded .xls after modification.\n\nYegor", "id": 132821, "time": "2009-12-15T01:40:56Z", "bug_id": 47920, "creation_time": "2009-12-15T01:40:56Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 47920, "attachment_id": null, "id": 133996, "time": "2010-01-28T07:13:34Z", "creator": "pichlermeister@gmail.com", "creation_time": "2010-01-28T07:13:34Z", "is_private": false, "text": "Preview of embedded workbooks are not automatically updated when the content of the workbook gets overwritten.\n\nWhen the embedded workbook is inline (shown as table/preview - not as icon as the example above) and gets opened and stored again with the content of another workbook, the workbook-preview of the output PowerPoint is still the same as before. \nWhen double-clicking on the embedded workbook of the output-PPT Excel opens with the new data and the preview gets updated."}, {"count": 4, "attachment_id": 24901, "creator": "pichlermeister@gmail.com", "is_private": false, "id": 133997, "time": "2010-01-28T07:29:55Z", "bug_id": 47920, "creation_time": "2010-01-28T07:29:55Z", "tags": [], "text": "Created attachment 24901\nEclipse Example Project showing the bug\n\nHere is my Eclipse Example Project. \nI used the latest development build (poi-3.7-SNAPSHOT-20100126.jar and poi-scratchpad-3.7-SNAPSHOT-20100126.jar) of of apache poi because in Release 3.6 I couln't open the new workbook in my output presentation"}, {"count": 5, "tags": [], "bug_id": 47920, "attachment_id": null, "id": 134491, "time": "2010-02-14T17:03:05Z", "creator": "yegor@dinom.ru", "creation_time": "2010-02-14T17:03:05Z", "is_private": false, "text": "> Preview of embedded workbooks are not automatically updated when the content of\n> the workbook gets overwritten.\n> \nSorry, it's beyond the scope of POI. Generating of preview images is a feature of GUI (MS Office or OpenOffice). POI is a library to read/write office files, it can't emulate Excel UI and update the preview image. \n\nYegor"}]