[{"count": 0, "tags": [], "bug_id": 47956, "text": "Running Solaris 9, Tomcat 5.5.26. There's no Apache - Tomcat is serving itself. \n\nWhen I point JAVA_HOME to the 1.5.0_21 JDK, I have no problems. However, when I start tomcat up using JDK 1.6.0_16, Firefox, but not Safari or IE, will report the following error on https connection:\n\n    Secure Connection Error\n    An error occurred during a connection to mysite.com:8443.\n    Peer reports it experienced an internal error.\n    (Error code: ssl_error_internal_error_alert)\n\nThere's no error in catalina.out or any other error log that I can find when this happens.\n\nHere's our SSL conf stanza (with passwords removed):\n\n           <Connector port=\"8443\" maxHttpHeaderSize=\"8192\"\n               maxThreads=\"150\" minSpareThreads=\"25\" maxSpareThreads=\"75\"\n               enableLookups=\"false\" disableUploadTimeout=\"true\"\n               acceptCount=\"100\" scheme=\"https\" secure=\"true\"\n               clientAuth=\"false\" sslProtocol=\"TLS\"\n        keystoreFile=\"/path/to/my/keystore\"\n                keystorePass=\"somePass\" />\n\nWe're using a JKS keystore. I thought that maybe jdk 1.6 didn't like 1.5's keystore format, so I re-created the keystore using the JDK 1.6's keytool. It's the same as before - if I start up tomcat using 1.5, there's no problem, but if I then restart tomcat using 1.6, Firefox can't make an ssl connection.\n\nThanks for your time, and please let me know if you'd like any additional information.", "id": 130957, "attachment_id": null, "creator": "nco2104@columbia.edu", "creation_time": "2009-10-07T14:54:04Z", "time": "2009-10-07T14:54:04Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 47956, "attachment_id": null, "text": "You are already discussing this at the tomcat-users list:\nhttp://markmail.org/thread/6odzvp75fdqskxaz\n\nBugzilla is not a support forum. Please discuss this on users list until it is agreed that it is an error in Tomcat and there is sufficient information to reproduce this issue on a fresh Tomcat installation.", "id": 130967, "time": "2009-10-08T02:29:56Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2009-10-08T02:29:56Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 47956, "text": "Thanks for this note. I agree that bugzilla is not a support forum. I'd judged that the discussion on the list was sufficient to establish that there's a bug between 5.5.26, this JDK, and Firefox for SSL, but I'm happy to reply to the message that you've sent to the list (once I can install some later versions of tomcat and configure them), and then re-submit this bug later.", "id": 130981, "time": "2009-10-08T07:25:32Z", "creator": "nco2104@columbia.edu", "creation_time": "2009-10-08T07:25:32Z", "is_private": false, "attachment_id": null}]