[{"text": "I have been using 'ScriptInterpreterSource Registry-strict' on my Windows XP system to override shebang without problem. Attempting to migrate to Windows 7 (skipping Vista) ScriptInterpreterSource seems to be broken and the reason appears to be that file association is handled totally differently in Windows 7; this apparently causes Apache to revert to shebang behaviour. I've verified this by putting a Windows shebang in a test file and it works properly. Here is the sum total of the registry entries for a .pl extension:\n\n---\nWindows Registry Editor Version 5.00\n\n[HKEY_CLASSES_ROOT\\.pl]\n\"PerceivedType\"=\"text\"\n@=\"Perl\"\n\n[HKEY_CLASSES_ROOT\\.pl\\PersistentHandler]\n@=\"{5e941d80-bf96-11cd-b579-08002b30bfeb}\"\n---\n\nI've tried to back down to 'ScriptInterpreterSource Registry' but no luck.\n\nI'm fairly certain my file associations are configured correctly. I'm able to invoke a perl script by clicking on it in Explorer and by typing the name only at the command prompt.\n\nIs there any work-around aside from shebangin' all my scripts (that run on Linux as well)?", "tags": [], "creator": "oangoazewoxaulia@gmail.com", "attachment_id": null, "count": 0, "id": 131124, "time": "2009-10-14T10:17:03Z", "bug_id": 47994, "creation_time": "2009-10-14T10:17:03Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 47994, "text": "It turns out that 'ScriptInterpreterSource Registry' for a .pl extension\nDOES work even though the description of the registry tree in the Apache\ndocs is incorrect for Windows 7. Getting other extensions to invoke Perl\napparently cannot be done with the tools available at the Windows\nControl Panel but use of shell commands may be able to accomplish this.\nI have not discovered ANY tools that can set up extension processing for\n'ScriptInterpreterSource Registry-Strict' aside from direct hacking with\nREGEDIT.\n\nIt looks like ScriptInterpreterSource is badly crippled by Windows 7\nand perhaps an alternative (like other suggestions to directly specify the\nscript interpreter) should be considered.", "id": 131313, "time": "2009-10-22T16:12:55Z", "creator": "oangoazewoxaulia@gmail.com", "creation_time": "2009-10-22T16:12:55Z", "is_private": false, "attachment_id": null}]