[{"count": 0, "tags": [], "creator": "opldupuy@gmail.com", "attachment_id": null, "id": 131146, "time": "2009-10-15T11:17:55Z", "bug_id": 48005, "creation_time": "2009-10-15T11:17:55Z", "is_private": false, "text": "Hello,\nIn a servlet or in a filter (before passing the control to doFilter() or after) try the following\nHttpServletResponse myResponse = ...\nmyResponse.setHeader(\"Server\",\"My own server name because I do not want to expose the real server name to the public for security reasons\");\n...\n\nIn the headers of the response you will get\nServer\tApache-Coyote/1.1, My own server name...\n\nAccording to the J2EE API for HttpServletResponse.html.setHeader()\nhttp://java.sun.com/j2ee/sdk_1.3/techdocs/api/javax/servlet/http/HttpServletResponse.html#setHeader(java.lang.String,%20java.lang.String)\n...\nSets a response header with the given name and value. If the header had already been set, the new value overwrites the previous one. The containsHeader method can be used to test for the presence of a header before setting its value.\n...\nIn fact if I call myResponse.containsHeader(\"Server\") I even get a false!!!\n\nIf you look in the IDE at the response object and dig in the responses and wrappers, you will find at the end a buffer with some data already set by Tomcat with this value and other things\n.\nAs I understand it Tomcat (or Coyote) does not let this header to be changed while nothing in the specification says that it is special.\nI did not find either a parameter in server.xml or other where the server name is specified to be overiden.\n\nSo the spec is not implemented properly for this specific header.\nSome other values are in this buffer, my goal was not to change them but other headers or values could have the same issue.\n\nThis issue is the same in Tomcat 5.5.28 and Tomcat 6.0.20. Not tested on 7.x.\n\nThanks \nOlivier"}, {"count": 1, "tags": [], "bug_id": 48005, "attachment_id": null, "id": 131147, "time": "2009-10-15T11:31:43Z", "creator": "markt@apache.org", "creation_time": "2009-10-15T11:31:43Z", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of bug 48004 ***"}]