[{"count": 0, "tags": [], "bug_id": 48022, "attachment_id": null, "id": 131204, "time": "2009-10-18T14:46:54Z", "creator": "ian.hobson@ntlworld.com", "creation_time": "2009-10-18T14:46:54Z", "is_private": false, "text": "I have a search box in a form that is submitted by \n\n<form accept-charset=\"UTF-8\" method=\"get\" id=\"searchtop\" action=\"/list/customer/0/post/\">\n\nThe search box is submitted and available to php using nginx, but not with Apache2. The exact version is Apache/2.2.11 (Win32) DAV/2 PHP/5.2.9-2 SVN/1.6.2 \n\nThe standard appears to permit method=\"get\" in a form and it would be daft \nif fields appear correctly in the browser, are sent the the server, and then dropped by some, but not all servers. \n\nI do have strange rewrite rules, which are below, just in case these contribute to the problem. the aim is to serve images and ,css directly, pass test.php to php, and process the rest with index.php. It is, of course, index.php that is not receiving the variable. \n\nRewriteEngine On\nRewriteRule ^(/images/.*\\.(png|gif|jpg))$  $1 [L]\nRewriteRule ^(/.*\\.css)$   $1  [L]\nRewriteRule ^/test\\.php$  /test.php [PT]\nRewriteRule ^(.*)$ /index.php?$1  \t[PT]\n\nThanks\n\nIan"}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "is_private": false, "text": "Your last rule discards the query string.  See the QSA flag or the users discussion list.", "id": 131205, "time": "2009-10-18T16:19:53Z", "bug_id": 48022, "creation_time": "2009-10-18T16:19:53Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 48022, "attachment_id": null, "id": 131207, "time": "2009-10-19T01:59:00Z", "creator": "ian.hobson@ntlworld.com", "creation_time": "2009-10-19T01:59:00Z", "is_private": false, "text": "Hi Eric, \n\nYou have miss-understood the problem. The QSA flag APPENDS to the query string. Without it the query string is NOT lost. \n\nI am getting the query string correctly. It is what I expect, and what I need. \n\nWhat I am not getting is a form variable. This is a form variable, NOT part of the query string. \n\nThe QSA flag is not documented to modify or remove form variables. \n\nSending a form with GET and variables, may be considered unusual, but it should work - and does work with other web servers. \n\nIan"}, {"count": 3, "tags": [], "bug_id": 48022, "attachment_id": null, "id": 131208, "time": "2009-10-19T03:35:43Z", "creator": "covener@gmail.com", "creation_time": "2009-10-19T03:35:43Z", "is_private": false, "text": "(In reply to comment #2)\n> You have miss-understood the problem. The QSA flag APPENDS to the query string.\n> Without it the query string is NOT lost. \n\nIt is when you have an explicit question mark in your substitution, as you do.\n> \n> I am getting the query string correctly. It is what I expect, and what I need. \n\nApache only cares to the extent of the query string,  PHP parses the query string and stuffs the values into your variables.\n\n> What I am not getting is a form variable. This is a form variable, NOT part of\n> the query string. \n\nWhen you define inputs in a GET-based form, they're sent to the server in the query string.  PHP or any other scripting language just parses the query string, there is no notion of form variables anywhere else."}]