[{"count": 0, "tags": [], "text": "Hello,\n\nMy application has run into an issue where some log statements in \"one particular class\" do not get printed at times. The issue is not  reproduced in a consistent manner ie. it may happen on some days/may not on some other days.\n\nHere is the structure of the two classes which has reported the issue. I have a class A and another class B which has extended the class A. I am printing 2 log statements in class B(one statement using the logger object of class A (logA object), and the other statement with the logger object of class B (logB object)). But the logger statement using the logA object does not get printed on some days. After a server restart, it starts working fine. Is there some thread which gets killed?\n\npublic class A{\n   protected static Logger logA = Logger.getLogger(A.class);\n   \n   public static void myLog(String s) {\n\t\tlogA.info(\"in myLog, \" + s);\n   }\n\n}\n\npublic class B extends A{\n\nprotected static Logger logB = Logger.getLogger(B.class);\n.\n.\n.\n.\nmyLog(\"Log Statement Number 1\"); //This statement does not get printed all the time\nlogB.info(\"Log Statment Number 2\"); //This statement always get printed\n\n}\nThis is not just a problem with the non-functioning log statements, but the entire code in this particular class seems to be working wrong due to this issue. This is hampering the functionality of my application. Any help is appreciated. \n\nThanks\nAnoop", "attachment_id": null, "id": 131240, "creator": "isaac.anoop@gmail.com", "time": "2009-10-20T03:52:59Z", "bug_id": 48027, "creation_time": "2009-10-20T03:52:59Z", "is_private": false}, {"count": 1, "tags": [], "text": "Not really enough info to try to determine if there is a problem.  You are logging to two different loggers and there is no information on how the app is configured, what appenders are attached, any dynamic reconfiguration, etc.  Any number of valid reasons could be responsible for your observation as well as any number of potential bugs.\n\nRunning with log4j.debug=true may give you some diagnostics that may help you.", "attachment_id": null, "id": 131801, "creator": "carnold@apache.org", "time": "2009-11-08T13:22:35Z", "bug_id": 48027, "creation_time": "2009-11-08T13:22:35Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 48027, "attachment_id": null, "id": 131802, "time": "2009-11-08T13:24:50Z", "creator": "carnold@apache.org", "creation_time": "2009-11-08T13:24:50Z", "is_private": false, "text": "Also, this appears to be more of a usage question that a bug report.  If you can not identify or isolate the problem, please post on log4j-user to get assistance.  If you get a resolution, come back and update or resolve this bug report."}]