[{"count": 0, "tags": [], "bug_id": 48045, "attachment_id": null, "is_private": false, "id": 131350, "time": "2009-10-23T20:14:27Z", "creator": "scott@newgeo.com", "creation_time": "2009-10-23T20:14:27Z", "text": "I posted this to the Apache Users list, and bumped it with no additional replies.\n\nThe main trouble is this results in an exit of Apache, no sites will serve without a restart. This exit appers random, and can not be caused by any actions on my part.\n\nThis exit followed me from a base install, through the process of building up Apache to be used in a shared hosting environment.\n\nAsking a few collegues to grep their logs shoes they too experience these issues but were not aware.\n\nIt appears this problem can be seen in the 1.x series as well, and also appers in my research, limited to OS X/BSD.\n\nApache 2 initgroups alert, Max OS X, abnormal exit in error log\n$httpd -v\nServer version: Apache/2.2.13 (Unix)\n\n$grep '\\[alert\\]' error_log\n[Thu Oct 08 16:23:24 2009] [alert] (22)Invalid argument: initgroups:\nunable to set groups for User www and Group 70\n[Thu Oct 08 16:23:24 2009] [alert] (22)Invalid argument: initgroups:\nunable to set groups for User www and Group 70\n[Thu Oct 08 16:23:24 2009] [alert] (22)Invalid argument: initgroups:\nunable to set groups for User www and Group 70\n[Thu Oct 08 16:23:24 2009] [alert] (22)Invalid argument: initgroups:\nunable to set groups for User www and Group 70\n[Thu Oct 08 16:23:24 2009] [alert] (22)Invalid argument: initgroups:\nunable to set groups for User www and Group 70\n[Thu Oct 08 16:23:25 2009] [alert] Child 13545 returned a Fatal\nerror... Apache is exiting!\n[Thu Oct 08 17:29:48 2009] [alert] (36)Operation now in progress:\ninitgroups: unable to set groups for User www and Group 70\n[Thu Oct 08 17:29:49 2009] [alert] Child 13782 returned a Fatal\nerror... Apache is exiting!\n\nThere is a little info on this, one which is in this list, but dates\nback a year:\nhttp://mail-archives.apache.org/mod_mbox/httpd-users/200810.mbox/%3C5249c07e0810091021s77d4f603y50c3fbb20cd4c181[at]mail.gmail.com%3E\n\nThere was no solution to that thread I could find.\n\nLooking through a few changelogs, I see mention of initgroups, but I\nam not versed in this enough to now if this was addressed, attempted\nto be addressed, or was assumed to have been solved. I am not using\nany LDAP as some googling will point to.\n\nThe only correlation I have, is I was playing with rotatelogs for the\nfirst time. I removed the single pipe line for the error log\nand issued apachectl graceful. That graceful was issued at Oct 8\n16:23, but you can see, I had an exit afterward as well.\n\nThe pipe I added was put into a virtual host container, did make a log\nafter a graceful start, and followed the 300 second rotation schedule\nI was testing. User was root and group was www.\n\nMy google searches on this seem to be mostly limited to Mac OS X, both\nPPC and Intel, info is sparse.\n\nMore details below, but the meat of the exit issue is above.\n\nThis is a relatively new install, and was just put into production\nafter stable testing for a few weeks. I have not seen any other\nunusual exits, but I am also staying away from rotatelogs for the time\nbeing, though I am pretty sure that my end goals will need use of\nrotatelogs.\n\nI believe rotatelogs to be coincidental, as this has now appeared in my logs with no config changes for weeks.\n\nI am running Mac OS X 10.5 on PPC.\n\nHardware Overview:\nModel Name: Power Mac G5\nModel Identifier: PowerMac7,2\nProcessor Name: PowerPC 970 (2.2)\nProcessor Speed: 2 GHz\nNumber Of CPUs: 2\nL2 Cache (per CPU): 512 KB\nMemory: 3.5 GB\nBus Speed: 1 GHz\nBoot ROM Version: 5.1.4f0\n\nI used MacPorts to install, which from what I can tell about the port install\ndescription file, these are the configure args I used:\n\n--prefix=/opt/local/apache2\n--with-apr=/opt/local/bin/apr-1-config \\\n--with-apr-util=/opt/local/bin/apu-1-config \\\n--libdir=/opt/local/lib \\\n--with-expat=/opt/local \\\n--with-pcre=/opt/local \\\n--mandir=/opt/local/share/man \\\n--enable-mods-shared=all \\\n--enable-ssl \\\n--with-ssl=/opt/local \\\n--enable-cache \\\n--enable-disk_cache \\\n--enable-file_cache \\\n--enable-mem_cache \\\n--enable-deflate \\\n--enable-proxy \\\n--enable-proxy-connect \\\n--enable-proxy-http \\\n--enable-proxy-ftp\n\nI've found log lines showing this issue from stock Apple builds on OS X Server and Client, as built by Apple.\n\nI can not locate the OP's email address from the above tgread to follow up with him and see if he has resolution to this.\n\nDeeper research into the code shows the call to initgroups where the exit happens. Comparing for -1, though I seem to recall a thread where this return was tested as -1 or otherwise, and the results were the same.\n\nAt this point, my lack of debugging understanding, and inability to be too agressive with a live server, as well as the sporadic and unrepeatable nature of this, lead me to post here.\n\nI would love to work with someone to pin this down. I have plenty of access to test servers, assuming someone can show me how to repeat this exit code issue.\n\nThanks for a great server."}]