[{"count": 0, "tags": [], "creator": "erh+apache@nimenees.com", "text": "I'm attempting to use the \"tar\" task to create a tarball.  The tarball gets created, but it seems like all the file permissions are set to mode 644.  It looks like this should be possible to do to some extent (the File class has at least canExecute(), canWrite() and canRead() methods, even though there doesn't seem to be a way to get the full set), but it doesn't work (not implemented?).\n\nIf ant doesn't support this on purpose, the documentation for the tar task should at least explain that.", "id": 131395, "time": "2009-10-26T14:54:41Z", "bug_id": 48058, "creation_time": "2009-10-26T14:54:41Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 48058, "attachment_id": null, "text": "There are many facets to this and I'll sure miss some:\n\n* tar supports non-File resources as well, which do not provide said information at all\n\n* canRead and friends will give you information about the current user, is that the owner, a group member or \"other\"?\n\n* canExecute is Java6 and beyond, Ant's svn trunk targets Java 1.4.  For a long time Java's file API has simply been insufficient and was the reason Ant didn't even try to deduce permissions - and it still mostly is, in particular when you take Ant's conservative compatibility requirements into account.\n\n* canExecute most likely returns false for directories (haven't tried) and canRead/Write likely show something different from Unix permissions for directories as well - so we'd need special handling for dirs.\n\n* checking the permissions for all files is likely a time-consuming operation, java.io.File isn't exactly known for its efficient implementation.\n\nInitially Ant didn't support storing permissions at all and when it started to do so, it only was with the help of tarfileset/zipfileset.\n\nThe documentation doesn't say you won't get proper permissions directly, but it could be derived from the paragraph starting with \"In addition to the implicit fileset\" - but this may be a stretch.  svn revision 830262 improves the situation a bit.", "id": 131431, "time": "2009-10-27T10:44:36Z", "creator": "bodewig@apache.org", "creation_time": "2009-10-27T10:44:36Z", "is_private": false}]