[{"count": 0, "tags": [], "creator": "arunzjohn@gmail.com", "is_private": false, "text": "The Log Files not getting updated while using isapi_redirect.properties. This works fine if i use the registry to configure properties. I have the below isapi_redirect.properties\n\n# Configuration file for the Jakarta ISAPI Redirector\n\n# The path to the ISAPI Redirector Extension, relative to the website\n# This must be in a virtual directory with execute privileges\nextension_uri=/jakarta/isapi_redirect.dll\n\n# Full path to the log file for the ISAPI Redirector\nlog_file=C:\\Program Files\\ISAPI JK Conn\\isapi_redirect.log\n\n# Log level (debug, info, warn, error or trace)\nlog_level=debug\n\n# Full path to the workers.properties file\nworker_file=C:\\Program Files\\ISAPI JK Conn\\workers.properties\n\n# Full path to the uriworkermap.properties file\nworker_mount_file=C:\\Program Files\\ISAPI JK Conn\\uriworkermap.properties\n\nSomehow the logs specified under C:\\Program Files\\ISAPI JK Conn\\isapi_redirect.log are not getting updated.I even tried creating a file and reloading the plugin by restarting IIS 6.0 ,but no luck.This seems to be a bug.", "id": 131436, "time": "2009-10-27T12:06:46Z", "bug_id": 48069, "creation_time": "2009-10-27T12:06:46Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Does it create the file?\n\nCan you please try a log file without spaces in the path and in a directory for which you (or the service) have szurely write access?\n\nLogging should work in principle and this is to narrow done possible reasons in your environment.", "attachment_id": null, "id": 131439, "creator": "rainer.jung@kippdata.de", "time": "2009-10-27T15:21:02Z", "bug_id": 48069, "creation_time": "2009-10-27T15:21:02Z", "is_private": false}, {"count": 2, "tags": [], "creator": "rainer.jung@kippdata.de", "is_private": false, "text": "Is it possible, that the file is owned by a different user?\n\nIs the redirector working when loading from a properties file, i.e. do we know it actually read and processed the file correctly (like the uriworkermap is working)?", "id": 131440, "time": "2009-10-27T15:29:02Z", "bug_id": 48069, "creation_time": "2009-10-27T15:29:02Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 48069, "attachment_id": null, "id": 132835, "time": "2009-12-15T09:33:53Z", "creator": "dave@9summer.com", "creation_time": "2009-12-15T09:33:53Z", "is_private": false, "text": "I had this exact same issue. When I had the isapi_redirect.properties in the directory with the DLL, the log file was never created (very frustrating). When I created the registry key and all of the string values for the configuration properties (exactly the same as the .properties file), the log file was created.\n\nI verified using Process Monitor (sysinternals) that the isapi_redirect.properties file was getting opened and read by the DLL so it wasn't a permissions issue on the properties file .. and since the log file was created in the location specified by both the properties and registry keys, that rules out a filesystem permission issue in the directory for the log file.\n\nI also tried both the 32-bit and amd64 builds of 1.2.28 (both the chunking and non-chunking builds) and all exhibited the same problem."}, {"count": 4, "tags": [], "creator": "Tim.Whittington@orionhealth.com", "is_private": false, "text": "Process Monitor should also tell your if the log file is being created and/or written to.\n\nThe code paths for the properties file and registry settings methods are identical apart from the reading of the actual config values, and the log file config definitely works for me in the properties file.\n\nThe obvious options appear to be:\n- The configuration file is invalid in some way, so the redirector is not initializing correctly. Is the filter showing up as correctly loaded in IIS? Are redirections actually working?\n- The value for the log file param being loaded via the properties file is invalid in some way (i.e. invisible characters). Try creating the file from scratch and/or checking in a text editor with a hex mode.", "id": 133313, "time": "2010-01-04T11:57:35Z", "bug_id": 48069, "creation_time": "2010-01-04T11:57:35Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 48069, "attachment_id": null, "is_private": false, "id": 133314, "time": "2010-01-04T12:39:31Z", "creator": "dave@9summer.com", "creation_time": "2010-01-04T12:39:31Z", "text": "No, the redirector wasn't working. Unfortunately, it's been a little while since I tried to get this working so the details are a bit foggy but I was getting either a 500 or 503 server error and when I turned on detailed output, it was due to a problem with loading the DLL .. an exit code of 0x80---something \n\nI tried both the 64 and 32 bit builds, and tried both the \"-chunking\" and non-chunking builds. All yielded the same output.\n\nI apologize for the poor detail. Attached is the config file I was trying to use. There was no entry in Process Monitor for trying to create or open the log file, I'm sure of that.\n\nI scrolled back in EventViewer and I believe this is one of the events that was being raised whenever I tried to restart IIS or the application pool:\n\n- <Event xmlns=\"http://schemas.microsoft.com/win/2004/08/events/event\">\n- <System>\n  <Provider Name=\"Microsoft-Windows-IIS-W3SVC-WP\" Guid=\"{670080D9-742A-4187-8D16-41143D1290BD}\" EventSourceName=\"W3SVC-WP\" /> \n  <EventID Qualifiers=\"49152\">2214</EventID> \n  <Version>0</Version> \n  <Level>2</Level> \n  <Task>0</Task> \n  <Opcode>0</Opcode> \n  <Keywords>0x80000000000000</Keywords> \n  <TimeCreated SystemTime=\"2009-12-14T21:06:32.000Z\" /> \n  <EventRecordID>814</EventRecordID> \n  <Correlation /> \n  <Execution ProcessID=\"0\" ThreadID=\"0\" /> \n  <Channel>Application</Channel> \n  <Computer>bnw1.cloud.bargainnews.com</Computer> \n  <Security /> \n  </System>\n- <EventData>\n  <Data Name=\"IsapiFilter\">D:\\jboss-4.2.3.GA\\bin\\isapi_redirect-1.2.28-chunking.dll</Data> \n  <Binary>02000000</Binary> \n  </EventData>\n  </Event>"}, {"count": 6, "tags": [], "creator": "dave@9summer.com", "is_private": false, "text": "Created attachment 24794\nproperties file I was using when using the non-chunking build of the DLL", "id": 133315, "time": "2010-01-04T12:40:40Z", "bug_id": 48069, "creation_time": "2010-01-04T12:40:40Z", "attachment_id": 24794}, {"count": 7, "tags": [], "creator": "Tim.Whittington@orionhealth.com", "is_private": false, "text": "If that is the properties file you're using, then the problem is probably that it's a UTF-16 encoded text file, which the redirector cannot load.\nTry saving it as an ASCII text file, and it should work - if you need any more help, ask on the Tomcat Users list.", "id": 133435, "time": "2010-01-07T12:55:45Z", "bug_id": 48069, "creation_time": "2010-01-07T12:55:45Z", "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 48069, "attachment_id": null, "is_private": false, "id": 133436, "time": "2010-01-07T13:11:56Z", "creator": "dave@9summer.com", "creation_time": "2010-01-07T13:11:56Z", "text": "Ugh ... I was using Notepad, the most intolerant editor out there, and it obviously obscured that detail .. I downloaded a sample isapi_redirect from somewhere and modified it to suit my needs so the file encoding never even entered my mind .. \n\nIs there some way that isapi_redirect could return a more helpful error message if the issue was that the properties file was unparseable?"}]