[{"count": 0, "tags": [], "text": "TLS / SSL Man-In-The-Middle Renegotiation Vulnerability \n\nTLS and its predecessor, SSL, are cryptographic protocols that provide security for communications over IP data networks such as the Internet. An industry-wide vulnerability exists in the TLS protocol that could impact many products that uses any version of TLS and SSL. The vulnerability exists in how the protocol handles session renegotiation and exposes users to a potential man-in-the-middle attack. \n\nTLS 1.0 (and higher) and SSL 3.0 (and higher), does not properly associate renegotiation handshakes with an existing connection, which allows man-in-the-middle attackers to insert data into HTTPS sessions, and possibly other types of sessions protected by TLS or SSL, by sending an unauthenticated request that is processed retroactively by a server in a post-renegotiation context, related to a \"plaintext injection\" attack, aka the \"Project Mogul\" issue. \n\nAffected Version and Products include, the TLS protocol 1.0, and the SSL protocol 3.0 and possibly earlier, as used in Microsoft Internet Information Services (IIS) 7.0, mod_ssl in the Apache HTTP Server 2.2.14 and earlier, OpenSSL before 0.9.8l, GnuTLS 2.8.5 and earlier, Mozilla Network Security Services (NSS) 3.12.4 and earlier, multiple Cisco products, and other products.", "attachment_id": null, "bug_id": 48210, "id": 132032, "time": "2009-11-17T02:25:17Z", "creator": "alcol@hotmail.com", "creation_time": "2009-11-17T02:25:17Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 48210, "is_private": false, "id": 132033, "time": "2009-11-17T02:26:57Z", "creator": "alcol@hotmail.com", "creation_time": "2009-11-17T02:26:57Z", "tags": [], "text": "TLS / SSL Man-In-The-Middle Renegotiation Vulnerability \n\nCVE #: \nCVE-2009-3555 \nRelease Date: \nNovember 4, 2009\nVulnerable OS: \nAny\nVulnerable Application: \nN/A\nRisk Type: \nUnauthorized Access\nSummary: \nTLS 1.0 and SSL 3.0 contain a man-in-the-middle renegotiation vulnerability.\nInfo: \nTLS 1.0 (and higher) and SSL 3.0 (and higher) are vulnerable to man-in-the-middle style attacks.\n\nThe flaw is specific to the renegotiation phase within the protocol.  An attacker can potentially inject arbitrary plaintext into an application's protocol stream.  This action can lead to numerous results, including attacks on Certificate Authentication mechanisms.  This issue affects multiple platforms/vendors/applications which use the affected protocols.\nGeneral Fix: \nApply the appropriate patch from your vendor.  Several vendors have released httpd update packages.\n\nThe OpenSSL Repository also contains an update for OpenSSL.\n\nIt should be noted that initial patches simply mitigate the problem by disabling renegotiation rather than solving the problem completely.\nReferences: \nBugTraq SecurityFocus BID 36935 \n\nCERT \nCERT Vulnerability Note VU#120541 \n\nCisco \nCisco Advisory ID: cisco-sa-20091109-tls \n\nFoundstone \nFaultline ID 7312 \n\nMandriva \nMandriva Security Advisory MDVSA-2009:295 \n\nOAR \nMSS-OAR-E01-2009:3405.1 \nMSS-OAR-E01-2009:3456.1 \nMSS-OAR-E01-2009:3457.1 \nMSS-OAR-E01-2009:3458.1 \nMSS-OAR-E01-2009:3464.1 \n\nOther \nOpenSSL CVS Repository Check-in 18790 \nCitrix Document ID: CTX123359 \n\nRedHat \nRed Hat Security Advisory RHSA-2009-1579 \nRed Hat Security Advisory RHSA-2009-1580 \n\nXForce \nXForce tls-renegotiation-weak-security (54158)"}, {"count": 2, "tags": [], "creator": "rpluem@apache.org", "attachment_id": null, "text": "See http://www.apache.org/dist/httpd/patches/apply_to_2.2.14/CVE-2009-3555-2.2.patch and ongoing discusssion on dev list.", "id": 132036, "time": "2009-11-17T04:50:17Z", "bug_id": 48210, "creation_time": "2009-11-17T04:50:17Z", "is_private": false}]