[{"count": 0, "tags": [], "creator": "vlast3k@gmail.com", "attachment_id": null, "is_private": false, "id": 132038, "time": "2009-11-17T06:39:45Z", "bug_id": 48213, "creation_time": "2009-11-17T06:39:45Z", "text": "Hi,\nI've tried to work with a shared XSSF Workbook, and nothing happend. The api does not recognize that this is a shared WB.\nIs this feature missing?\nCan it be implemented?\nOr is it implemented for a diffrent version of the API?\nIf it is missing just because it is not implemented - i would like to contribute it's implementation to the team. \nI just would like somebody with more experience in this API to confirm that this is technically possible?\n\nThanks, Vladimir"}, {"count": 1, "attachment_id": null, "bug_id": 48213, "is_private": false, "id": 132365, "time": "2009-11-28T07:23:08Z", "creator": "yegor@dinom.ru", "creation_time": "2009-11-28T07:23:08Z", "tags": [], "text": "Vladimir, you are very much welcome to contribute! \n\nShared workbooks are not yet supported. XSSF treats shared workbooks just like any others - it ignores changes made by other users, does not write changes, etc. \n\nI'm pretty much sure it is technically feasible to implement. Can you post a use case? It would help us to better understand what functionality is required and design the API appropriately. What did you expect to happen 'automatically' when you were working with a shared XSSF workbook? \n\nAt least three use-cases come to my mind:\n\n - turn on the \"shared mode\" on a .xlsx file. This will allow multiple external users to edit the workbook at the same time. By 'external' I mean Excel 2007 clients.\n\n - programmatically work with the Revision Table - read changes made by other users and update the workbook with those changes. A potentially tricky part is resolving conflicts.\n\n - track changes made by XSSF and update the Revision History part so that other users will see / merge them. \n \nThe first one seems trivial, it should be a flag somewhere in workbook.xml. The other two can take efforts.\n\nPlease see http://poi.apache.org/guidelines.html for initial guidelines how to contribute. \n\nRegards,\nYegor"}, {"count": 2, "attachment_id": null, "bug_id": 48213, "is_private": false, "id": 181891, "time": "2015-03-18T20:41:32Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-03-18T20:41:32Z", "tags": [], "text": "No update for a long time and obviously no plans on providing this soon, therefore I am resolving this as LATER, please reopen this if you still plan to work on this functionality."}]