[{"count": 0, "tags": [], "creator": "marsh@extendedsubset.com", "attachment_id": null, "id": 132288, "time": "2009-11-24T15:25:10Z", "bug_id": 48277, "creation_time": "2009-11-24T15:25:10Z", "is_private": false, "text": "HTTP has long defined a TRACE verb.\n\nA well-known paper on web security from 2003\nhttp://www.cgisecurity.com/whitehat-mirror/WH-WhitePaper_XST_ebook.pdf\nclearly documents the opportunities for evil provided by TRACE.\n\nWeb security scanners warn when TRACE is enabled:\nhttp://nessus.org/plugins/index.php?view=single&id=11213\n\nMy recent attack on TLS/SSL\nhttp://extendedsubset.com/Renegotiating_TLS.pdf\nhighlights the need to disable TRACE. Having TRACE enabled may allow an attacker to leverage the blind plaintext injection attack into arbitrary evil script running in the browser from the origin of the target website.\n\nApache provides a configuration directive to disable TRACE.\nhttp://httpd.apache.org/docs/2.2/mod/core.html#traceenable\nHowever, the default setting leaves it in the enabled, insecure configuration.\n\nIt is time to set the default to the secure configuration."}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "text": "[Tagging FAQ for clarification]\n\nTRACE is not a vulnerability, any more than traceroute or ping would be security\nissues.  It is simply a tool, and the HTTP project will not disable such tools\nby default.  The RFC spells out that servers SHOULD implement, therefore we do.\n\nNow, there are entirely moronic clients and programmatic interfaces; old, stale\nand badly designed flavors of Microsoft Internet Explorer and Adobe Flash all\nspring to mind, which would present the results of a TRACE request to the user.\nThis is out of the server developers hands, and there are other sinister flaws\nhiding in those design errors which 'TraceEnable off' has no effect on.\n\nSo marked as an FAQ for the justification why the \"security communities'\" request\nto address the TRACE directive is entirely invalid.  The serious DoS consideration\nwould be the reflection of request bodies, which are not enabled by default, but\nonly offered as an 'extended' feature for testing server or routing behavior.", "id": 132368, "time": "2009-11-28T14:35:12Z", "bug_id": 48277, "creation_time": "2009-11-28T14:35:12Z", "is_private": false, "attachment_id": null}]