[{"count": 0, "attachment_id": 24613, "creator": "kerem.erkan@gmail.com", "is_private": false, "id": 132318, "time": "2009-11-25T07:43:22Z", "bug_id": 48283, "creation_time": "2009-11-25T07:43:22Z", "tags": [], "text": "Created attachment 24613\nConnection debug file\n\nSince httpd 2.2.12, we have been getting error \"proxy: error processing body\" followed by error \"proxy: dialog to xxx.xxx.xxx.xxx:xxxx (xxx.xxx.xxx.xxx) failed\".\n\nI have not been able to isolate the situation, and I also have not been able to upgrade Apache to latest because of this problem. It seems like Apache does not give any server errors to the client, but I am not sure of that either. I am using 2.2.11 for the time being.\n\nThe server hosts both web and wap sites, and I encounter this mostly on our wap sites, because they have more traffic. I am sending a debug from a wap site connection.\n\nI would be glad to have some insight about this problem because I am unable to upgrade my webservers for the time being."}, {"count": 1, "tags": [], "text": "This is just a bad error message for what happens in your case. What happens is that the client to your website cancels the connection by e.g. pressing the stop button in the browser or because of some network problem between client and server. So there is no functional defect here only the error logging needs improvement in this case.", "attachment_id": null, "id": 132322, "creator": "rpluem@apache.org", "time": "2009-11-25T09:03:50Z", "bug_id": 48283, "creation_time": "2009-11-25T09:03:50Z", "is_private": false}, {"count": 2, "attachment_id": null, "creator": "kerem.erkan@gmail.com", "is_private": false, "id": 132343, "time": "2009-11-25T22:57:32Z", "bug_id": 48283, "creation_time": "2009-11-25T22:57:32Z", "tags": [], "text": "(In reply to comment #1)\n> This is just a bad error message for what happens in your case. What happens is\n> that the client to your website cancels the connection by e.g. pressing the\n> stop button in the browser or because of some network problem between client\n> and server. So there is no functional defect here only the error logging needs\n> improvement in this case.\n\nThanks Ruediger.\n\nWhat I understand from your comment is, some logging method changed in 2.2.12 and upgrading from 2.2.11 should not impact the working of the site. Am I right?\n\nAlso, is there any way to understand the connection problem between the client and Apache, so that it does not log the message like there is some problem between Apache and Tomcat?"}, {"count": 3, "tags": [], "text": "(In reply to comment #2)\n> (In reply to comment #1)\n> > This is just a bad error message for what happens in your case. What happens is\n> > that the client to your website cancels the connection by e.g. pressing the\n> > stop button in the browser or because of some network problem between client\n> > and server. So there is no functional defect here only the error logging needs\n> > improvement in this case.\n> \n> Thanks Ruediger.\n> \n> What I understand from your comment is, some logging method changed in 2.2.12\n> and upgrading from 2.2.11 should not impact the working of the site. Am I\n> right?\n\nYes.\n\n> \n> Also, is there any way to understand the connection problem between the client\n> and Apache, so that it does not log the message like there is some problem\n> between Apache and Tomcat?\n\nAs said it can be simply that someone pressed the stop button in the browser. Yo cannot avoid this. Of course you can check the network under your control and try to rule out any network issues (which is hard to do for these kind of problems), but IMHO you can do nothing more.", "is_private": false, "bug_id": 48283, "id": 132355, "time": "2009-11-26T03:52:29Z", "creator": "rpluem@apache.org", "creation_time": "2009-11-26T03:52:29Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 48283, "attachment_id": null, "is_private": false, "id": 132360, "time": "2009-11-26T09:16:09Z", "creator": "kerem.erkan@gmail.com", "creation_time": "2009-11-26T09:16:09Z", "text": "(In reply to comment #3)\n> \n> As said it can be simply that someone pressed the stop button in the browser.\n> Yo cannot avoid this. Of course you can check the network under your control\n> and try to rule out any network issues (which is hard to do for these kind of\n> problems), but IMHO you can do nothing more.\n\nBut the logging started with Apache 2.2.12 and later (before that version I have never seen this error), so couldn't I patch the source code and disable logging for this error only? It gets written nearly every 2 minutes or so on busy hours. If patching is possible could you be able to shed some light on where to start?"}, {"attachment_id": null, "tags": [], "bug_id": 48283, "is_private": false, "count": 5, "id": 151896, "time": "2011-12-01T14:43:27Z", "creator": "katherine.zurbruegg@six-group.com", "creation_time": "2011-12-01T14:43:27Z", "text": "This Bug Report is old but the Status is still on NEW. Are someone working on it to get this Message in a other Loglevel as Error?\n\nOur Apache Service logged this Error Message also a lot and take unnecessary disk space from our log filesystem."}, {"count": 6, "tags": [], "text": "This is still happening with 2.2.22. Any way to filter these messages out, or turn them off. My error logs are flooded with these and it makes it hard to identify real errors.", "attachment_id": null, "id": 170676, "creator": "jchamlin@gmail.com", "time": "2013-10-18T15:41:51Z", "bug_id": 48283, "creation_time": "2013-10-18T15:41:51Z", "is_private": false}]