[{"count": 0, "tags": [], "text": "Currently the LogFormat and CustomLog directives support the \"%X\" format string which indicates the connection status when response is completed.\n\nThis format string is extremely useful for determining how the end user accessing a site is served, especially for requests that have a potential to fail - such as long running request/response that generate a large amount of content (e.g. downloading a large file).\n\nThe problem is that the %X directive does not provide enough granulatity to indicate whether the connection was aborted by the client side or by the server (Apache) side. \nThis is a very important metric as web analysts need to be able to distinguish if the failure of an end user to receive a response is due to an issue on the Apache side (e.g. due a possible configuration issue such as a low TimeOut value) or due to the client aborting or canceling. An initial examination of the code indicates that it is possible to clearly distinguish these two cases. \n\nI suggest the following modification to connection status when the response completes:\n\nX = connection aborted by the SERVER before the response completed.\nx = connection aborted by CLIENT side the before the response completed.", "is_private": false, "id": 132457, "creator": "ajp.sheppard@gmail.com", "time": "2009-11-30T03:08:49Z", "bug_id": 48301, "creation_time": "2009-11-30T03:08:49Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 48301, "attachment_id": null, "id": 132516, "time": "2009-11-30T16:48:28Z", "creator": "markt@apache.org", "creation_time": "2009-11-30T16:48:28Z", "is_private": false, "text": "Note that due to a data loss on 26/27 Nov 2009 the issue that was originally created as bug 48301 was lost. It has been re-created as bug 48312."}, {"count": 2, "tags": [], "creator": "ajp.sheppard@gmail.com", "text": "(In reply to comment #1)\n> Note that due to a data loss on 26/27 Nov 2009 the issue that was originally\n> created as bug 48301 was lost. It has been re-created as bug 48312.\n\nThe above comment does not appear to be correct. bug 48312 is a completely different bug. Can you clarify the status of bug 48301?", "id": 132603, "time": "2009-12-03T06:10:06Z", "bug_id": 48301, "creation_time": "2009-12-03T06:10:06Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 48301, "text": "Could you expand on what sort of cases you're thinking of where the server aborts the connection?  There are a very few cases where some error occurs in the server and it aborts the connection, but in almost all cases, the Apache web server aborts the connection because it's detected an error on the connection, which is the network or the client's fault, not the server's.  Arguably if the client stops responding and some timeout expires, that's also the client's fault, not the server's.  So I think we'd be logging \"client abort\" 99.9% of the time, which doesn't sound all that useful.", "count": 3, "id": 136608, "time": "2010-05-03T14:36:52Z", "creator": "poirier@pobox.com", "creation_time": "2010-05-03T14:36:52Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 48301, "attachment_id": null, "id": 136627, "time": "2010-05-04T11:55:10Z", "creator": "ajp.sheppard@gmail.com", "creation_time": "2010-05-04T11:55:10Z", "is_private": false, "text": "\nLet me expand on the sort of cases where the server aborts the connection. I will outline both the technical details and the business requirements to give the issue some overall context.\n\nA lot of companies now use the web to allow end users to download software and this typically results in the end user's browser initiating a GET request which  results in a response containing the software. For a company this means their web site and back end web server is of extreme importance in serving their user community. \n\nThe HTTP response containing the software download may take a long time to complete depending on the size of the download, the network latency and bandwidth between the client and server.\n\nIf the connection is terminated, \"X\" appears in the access log but it's not possible to know if the client terminated the connection or the server terminated it.\n\nIf the client terminated the connection, well that's OK - it's a user initiated decision, however if the server terminated it then it can indicate an underlying problem with the Apache configuration or supporting infrastructure which should be addressed. So it's very important to know whether it's client or server initiated.\n\nSome scenarios in which the server can terminate the connection are as follows:\n\n(1) the client is on a high latency, low bandwidth connection (such as a modem) and during the download it experiences periodic intervals in which no TCP ACK is sent due to congestion as it attempts to empty its local receive buffer. If the Apache Timeout directive is set too low in this situation then the Server terminates the connection.\n\n(2) when multiple clients are downloading simultaneously it's possible that they may cause the bandwidth allocation of the web servers to reach capacity. In this situation the Server terminates the connection as it cant receive a TCP ACK due to congestion.\n\nIn the first scenario a change to the Apache config is required, in the second an infrastructure upgrade may be required, but the important aspect is that the network termination is due to an issue within the server domain and is not user initiated.\n\nIt may be true that in a lot of instances this type of abort does not appear often but it also true that when it occurs it should be easily detected and the desired metrics should be available to facilitate this."}]