[{"count": 0, "tags": [], "bug_id": 48336, "attachment_id": 24665, "text": "Created attachment 24665\nExcel file\n\nThe attached Excel has a date value in row 1, column D.  POI doesn't read it as a date.  The file was created by SoftArtisans OfficeWriter for Excel 7.0.0.1642 (http://officewriter.softartisans.com).\n\nThanks.", "id": 132604, "time": "2009-12-03T09:46:09Z", "creator": "vdhanda@epistemic.com", "creation_time": "2009-12-03T09:46:09Z", "is_private": false}, {"count": 1, "tags": [], "creator": "vdhanda@epistemic.com", "text": "Created attachment 24666\nBiffViewer dump", "id": 132605, "attachment_id": 24666, "bug_id": 48336, "creation_time": "2009-12-03T09:47:09Z", "time": "2009-12-03T09:47:09Z", "is_private": false}, {"count": 2, "tags": [], "creator": "josh@apache.org", "attachment_id": null, "id": 132606, "time": "2009-12-03T10:04:23Z", "bug_id": 48336, "creation_time": "2009-12-03T10:04:23Z", "is_private": false, "text": "There is something wrong with cell D1.  It displays as '#######################' in my Excel 2007.  Excel has roll-over tip text that provides more information: \"Dates and times that are negative or too large display as ######.\"\nIndeed the cell value is -1094\nHSSFCell.getNumericCellValue() should return -1094.0 and HSSFCell.getDateCellValue() should return null due to this invalid date value.\n\nThe cell has a custom format 'mmm-dd-yyyy' which suggests that the application that wrote this file intended for the cell to have a date value.\n\nI am marking this bug as invalid because it appears that the problem is with \"SoftArtisans OfficeWriter\""}, {"count": 3, "tags": [], "creator": "vdhanda@epistemic.com", "attachment_id": null, "id": 132607, "time": "2009-12-03T10:14:08Z", "bug_id": 48336, "creation_time": "2009-12-03T10:14:08Z", "is_private": false, "text": "Can you try opening it in OpenOffice.  It shows the correct value as 12/31/1896."}, {"count": 4, "tags": [], "creator": "josh@apache.org", "is_private": false, "id": 132613, "attachment_id": null, "bug_id": 48336, "creation_time": "2009-12-03T15:17:26Z", "time": "2009-12-03T15:17:26Z", "text": "A short term work around is for you to use methods from DateUtil like setCalendar to calculate dates with negative 'serial date' values.  However it seems like you might be requesting a real change (to how POI behaves).\n\nNormally such an enhancement request is rejected on the grounds that it involves POI doing something that Excel considers invalid.  However, I agree that the functionality you desire is very reasonable.  I think the restriction on dates before 1900 is silly.  On the other hand, we can't go about implementing every request for features from other applications that go beyond the Excel file format spec.\n\nI want to wait for comments from other POI committers before doing anything.  There is also the general question of how we accept/reject/prioritize bugs and feature requests that raise issues of compliance with other applications.  I don't know of any POI documentation that deals with this."}, {"count": 5, "tags": [], "creator": "vdhanda@epistemic.com", "is_private": false, "id": 132617, "attachment_id": null, "bug_id": 48336, "creation_time": "2009-12-03T21:06:58Z", "time": "2009-12-03T21:06:58Z", "text": "Thanks Josh.    \n\nIt seems that the \"culprit\" is HSSFDateUtil.isValidExcelDate(double value).  The fix might be as simple as unconditionally returning \"true\" in that method instead of the current \"return (value > -Double.MIN_VALUE);\"\n\nI pretty much did that and it worked for me.\n\nPerhaps, as a courtesy, one could \"guard\" this change with a -DinterpretNegativeValuesAsDate flag."}]