[{"count": 0, "tags": [], "bug_id": 48404, "attachment_id": null, "id": 132892, "time": "2009-12-17T02:07:53Z", "creator": "vesa.akerman@dans.knaw.nl", "creation_time": "2009-12-17T02:07:53Z", "is_private": false, "text": "When I read (using hssf.usermodel) a cell formula, where the formula is a 3-D reference, I get a 2-D reference, referring to the first sheet.\nFor instance, if the formula is 'SUM($Sheet1.A1:$Sheet3.B1)', I get 'SUM(Sheet1!A1:B1)'."}, {"count": 1, "tags": [], "bug_id": 48404, "text": "This feature (multi-sheet 3D references) is not yet supported by POI.  Incidentally, the syntax of your formula looks wrong.  My Excel(win, 2007) seems to require \"SUM(Sheet1:Sheet3!A1:B1)\".\n\n\nThere are three aspects that will need fixing:\n 1 - Rendering\n 2 - Parsing\n 3 - Evaluation\n\nI'm not sure if you care about 2 or 3.\n\nThe rendering fix will probably involve ExternSheetNameResolver.prependSheetName() and perhaps some code in LinkTable.\n\nThe parsing fix may be a little more difficult with all the existing complexity regarding distinguishing sheet names, defined names, function names and cell names.   This will probably affect FormulaParser and LinkTable.checkExternSheet(int)\n\nI'm not sure about the evaluation fix.  It may be simple because it seems like multi-sheet references are nowhere near as usable as single sheet ones.  Besides the aggregate functions (sum, stdev, etc) do you know of any other function or operator which can use multi-sheet references? \n\n\nContributions always welcome.", "id": 132914, "time": "2009-12-17T12:20:24Z", "creator": "josh@apache.org", "creation_time": "2009-12-17T12:20:24Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "vesa.akerman@dans.knaw.nl", "attachment_id": null, "id": 133001, "time": "2009-12-21T00:39:48Z", "bug_id": 48404, "creation_time": "2009-12-21T00:39:48Z", "is_private": false, "text": "Thanks for the prompt reply.\n\nThat's correct that the syntax I gave for the formula was wrong. I had namely opened the excel file with open office and copied the syntax from there to the bug message.\n\nYou asked if I know any other than aggregate functions used in 3-D references.  No, I don't.  I am using POI in a project where we convert files from different (older) file formats into XML format.  In testing I noticed that 3-D formulas gave wrong result.\n\nI reported this as a bug, because in POI website, in 'Formula support' under 'Supported Features' it says: 'References: single cell & area, 2D & 3D, relative & absolute'.\n\nI don't know if it is simple or difficult to recognize a 3-D reference.  I think that POI should give anyway an error message, instead of giving erroneous 2-D reference.\n\nBy the way, at the moment POI supports approximately 60 of the 346 functions implemented in Excel 2003.  Do you know if there are any plans to add support to more functions?\n\nThanks,  Vesa"}, {"count": 3, "tags": [], "bug_id": 48404, "attachment_id": null, "id": 189979, "creation_time": "2016-04-05T16:45:11Z", "time": "2016-04-05T16:45:11Z", "creator": "onealj@apache.org", "text": "As of POI 3.14, POI still does not support multi-sheet 3D references. If you still need this or found a solution, please submit a patch with a working unit test.", "is_private": false}]