[{"count": 0, "tags": [], "bug_id": 48415, "attachment_id": null, "id": 132972, "time": "2009-12-20T07:07:45Z", "creator": "gweii@hotmail.com", "creation_time": "2009-12-20T07:07:45Z", "is_private": false, "text": "Test steps:\n\n1.1 Use Excel to new an Excel workbook\n1.2 Save and close the workbook as Book1.xls\n1.3 Use POI to open Book1.xls and insert an image\n1.4 Call HSSFPicture.resize()\n1.5 Save and close Book1.xls\n\n2.1 Use Excel to new an Excel workbook\n2.2 Modify the default font size (For example, from 10 to 20)\n2.3 Save and close the workbook as Book2.xls\n2.4 Use POI to open Book2.xls and insert the same image used in the previous test\n2.5 Call HSSFPicture.resize()\n2.6 Save and close Book2.xls\n\nThen use Excel to open these two workbooks, you can see the same image in these workbooks do NOT have the same size! The later one stretchs horizontally!"}, {"count": 1, "tags": [], "bug_id": 48415, "text": "I'm re-posting my reply from poi-user:\n\nHSSFPicture.resize() as well as XSSFPicture.resize() indeed work only for the default font which is Arial 10pt for .xls and Calibri 11pt for .xlsx.\n\nExcel uses a funny coordinate system to position graphic objects. X and Y axes  are measured not in pixels but in units proportional to a character width of the default font. To properly position and size an image POI needs to translate the actual dimensions measured in pixels to columns and rows. This is the key of the problem. At the moment POI performs this translation using hardcoded constants obtained empirically for Arial 10pt and Calibri 11pt. It works OK in most cases and also explains why HSSFPicture.resize() is 'off' if the default font is changed.\n\nUnfortunately it can not be easily fixed. To measure a custom font POI needs to load it (i.e. the font must be physically available) and get the font metrics using java.awt.* utilities. It will make the result machine dependent and impossible to test.\n\nI updated the javadocs on HSSFPicture.resize()  to reflect it. \n\nYegor", "id": 133030, "time": "2009-12-21T08:30:03Z", "creator": "yegor@dinom.ru", "creation_time": "2009-12-21T08:30:03Z", "is_private": false, "attachment_id": null}]