[{"count": 0, "tags": [], "creator": "helder.magalhaes@gmail.com", "attachment_id": null, "text": "While participating in a batik-users thread [1], I discovered a set of (minor?) issues while playing with Batik Squiggle's DOM Viewer. I'm creating this bug in order to 1) act as a reminder to try better tracking them down whenever possible and 2) act like a list of known-issues in case someone else also happens to bump at something weird while using the DOM viewer.\n\n\nMaybe this could/should be broken into several bugs (one per issue) but, given that these issues should be fairly to fix, managing multiple issues can become too much of a burden (as already discussed a couple of times in batik-dev). :-)\n\n\n\n1. Works with simple cases [1], seem to choke with more complex ones [2].\n\n\n\nNevertheless, in the second test case, I'm also seeing unresolved namespace weirdness (the \"a0\" hints towards that)which I thought it had already been fixed in trunk:\n\n\n\n<a0:g xmlns:a0=\"http://www.w3.org/2000/svg\" style=\"fill: #ffffff; stroke:#000000; stroke-width:0.172\">\n\n  <a0:path d=\"[long path data]\"/>\n\n</a0:g>\n\n\n\nI still haven't figured out if this is due to:\n\n * [3] being a more complex document;\n\n * [3] making heavy use of cubic splines, which may be breaking the node finder/highlighting algorithm.\n\n\n\n \n\n2. The DOM viewer doesn't maintain state: whenever the (DOM Viewer) window is closed and opened again, the previously highlighted items are disconnected. The simplest approach would be clearing the set of highlighted items prior to closing the window; another possibility would be maintaining state, for example by hiding the window instead of closing it (not sure about the performance implications of that).\n\n\n\n\nBoth issues were noticed in revision 892855, using Sun Java 1.6 update 17 on Windows Vista SP2.\n\n\n[1] http://old.nabble.com/background-for-text-td26879322.html\n\n[2] http://heldermagalhaes.com/stuff/svg/demos/SVGObject-HTMLCanvasInteractors/sample.svg\n\n[3] http://croczilla.com/bits_and_pieces/svg/samples/tiger/tiger.svg", "id": 133240, "time": "2009-12-30T14:09:40Z", "bug_id": 48468, "creation_time": "2009-12-30T14:09:40Z", "is_private": false}]