[{"attachment_id": null, "tags": [], "creator": "banyek@gmail.com", "is_private": false, "count": 0, "id": 133194, "time": "2009-12-30T01:53:01Z", "bug_id": 48461, "creation_time": "2009-12-30T01:53:01Z", "text": "So, I've got 2 apache servers, named \"A\" and \"B\"\n\nServer A is reachable from the cloud, Server B is only reachable from the intranet. \nI have to access some documents from Server B from the cloud, so I made an apache proxy on server \"B\" to reach server A like this\n\nProxyPass /some_page http://ServerB.intra/some_page\nProxyPassReverse /some_page http://ServerB.intra/some_page\n\nThe Server A's documentroot is protected via .htpasswd and allowed only an user \"UserA\"\n\nThe Server B's /some_page is protected via .htpasswd and allowed only an user \"UserB\"\n\nWhen I navigated to http://ServerA/some_page then I got an authentication window, from ServerA's realm and I authenticated as \"UserA\" then I got an another authentication window (From ServerB's realm of course) and I authenticated as UserB ... and THEN I got ServerA's authentication again ... and then ServerB of course, and so on...\n\nOK, I made a dirty hack, so I can auth on ServerB as UserA now, and it's working now, but it looks like a bug for me, so I share it with you guys.\n\nBest regards,\n  Balazs Pocze"}, {"count": 1, "tags": [], "bug_id": 48461, "attachment_id": null, "id": 133201, "time": "2009-12-30T02:27:40Z", "creator": "nick@webthing.com", "creation_time": "2009-12-30T02:27:40Z", "is_private": false, "text": "Please use a user support forum for setup questions.\n\nIn this instance, you seem to be looking for proxy-chain-auth."}, {"count": 2, "text": "(In reply to comment #1)\n> Please use a user support forum for setup questions.\n> \n> In this instance, you seem to be looking for proxy-chain-auth.\n\nNo, I didn't wanted to use proxy-chain-auth, I just tried to use 2 different authentication creditentals at two different servers. For the record I've read this : http://httpd.apache.org/docs/2.2/mod/mod_proxy_http.html#env\nabout proxy-chain-auth and here's described, if I wanted to send my creditentals to the next proxy, then I have to use this... but that is what I didn't want to do. \nLiterally I wanted do 2 different auth at two hosts. \n(BTW this is really looks invalid, because it can be a http protocol restriction about basic auth)", "bug_id": 48461, "is_private": false, "id": 133219, "time": "2009-12-30T07:09:41Z", "creator": "banyek@gmail.com", "creation_time": "2009-12-30T07:09:41Z", "tags": [], "attachment_id": null}]