[{"count": 0, "tags": [], "bug_id": 48475, "attachment_id": 24786, "text": "Created attachment 24786\npatch to protect EscherProperties initialization, against trunk 2010-01-02\n\nWhen multiple Word 97 documents hit our multi-threaded system the initial load of EscherProperties can cause a lockup. The attached patch protects the initialization phase of this class. Since it is loading a static HashMap it needs this protection to get loaded safely.", "id": 133271, "time": "2010-01-02T10:17:44Z", "creator": "flester@gmail.com", "creation_time": "2010-01-02T10:17:44Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48475, "is_private": false, "text": "Your patch doesn't seem to change anything.  I am almost certain that either version of this source file compiles to the same bytecode.\n\nI know synchronization errors are very difficult to prove, but can you at least write a non-deterministic test case (i.e. one that fails sometimes) to show that there is actually a problem here.\n\nA problem with a very similar description was 'fixed' with bug 47412.  The problem there was much more obvious (concurrent access to a single map object referenced by  a static field).  Hopefully the 'fix' was obvious too (no test provided).\n\nFrom what I understand, the JVM guarantees class initialisation to be synchronized, so the current code looks fine to me.  I'm happy to be proven wrong, but I don't see any point in making an apparent change that actually does nothing.", "id": 133272, "time": "2010-01-02T11:11:21Z", "creator": "josh@apache.org", "creation_time": "2010-01-02T11:11:21Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 48475, "attachment_id": null, "text": "No response for a very long time, therefore we are closing this as WONTFIX for now as it does not seem to occur in any other usage. Also I think static initialization is guaranteed to run thread-safe and the only thing that would happen here would be that multiple instances of the map would be created and assigned, leaving the last one in place at the end, or?", "id": 187187, "time": "2015-12-28T20:47:07Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-12-28T20:47:07Z", "is_private": false}]