[{"count": 0, "text": "Hello.\n\nI have a directory /foo that's mapped into my web root by 'Alias /bar /foo'.\n/foo contains a file named x?y. I want this file to be reachable by /bar/x%3Fy and /bar/x?y. So I thought I'd use mod_rewrite.\n\nmod_rewrite makes this unnecessarily hard by its special handling of query parameters, but I think something like\n\nRewriteCond %{QUERY_STRING} .\nRewriteRule ^(/bar/.*)$ $1\\%3F%{QUERY_STRING}? [PT]\n\nought to work. However, this creates only 404s. I can understand that without [PT] it tries to prepend the web root path, but with [PT] it should arrive at my alias. This doesn't seem to work, however. I can see the rewrite happening in the logs, but the resulting url can't be resolved.\n\nI think the above is bug #1.\n\nMy next attempt was to bypass the alias and rewrite to the actual file path:\n\nRewriteCond %{QUERY_STRING} .\nRewriteRule ^/bar/(.*)$ /foo/$1?%{QUERY_STRING}\n\nThis fails because mod_rewrite strips the part after ?, treating it as another query parameter list. Then I tried /foo/$1\\%3F%{QUERY_STRING}?, but that also 404s, maybe because it looks for a file called 'x%3Fy', not 'x?y'.\n\nIn any case I couldn't get that to work either, which I think is bug #2.\n\nI eventually found a workaround, using an external redirect:\n\nRewriteCond %{QUERY_STRING} .\nRewriteRule ^(/bar/.*)$ $1\\%3F%{QUERY_STRING}? [NE,L,R=permanent]\n\nThis causes another roundtrip to the client, but it works. But there really should be a way to do all of this internally. If such a way exists, I didn't find it, and it's a documentation bug. If such a way doesn't exist, it's a code bug (and probably a documentation bug as well, because [PT] really looks like it should do what I want).\n\nThanks for your attention.", "bug_id": 48499, "is_private": false, "id": 133402, "time": "2010-01-06T19:55:13Z", "creator": "M8R-3mye921@thisisnotmyrealemail.com", "creation_time": "2010-01-06T19:55:13Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 48499, "is_private": false, "id": 142381, "creation_time": "2010-12-04T18:08:23Z", "time": "2010-12-04T18:08:23Z", "creator": "covener@gmail.com", "text": "a workaround is to put the directive in per-directory config, where the \\%3F can be re-injected verbatim which is not 100% the same as [PT] apparently.", "attachment_id": null}]