[{"attachment_id": null, "tags": [], "creator": "qdinar@gmail.com", "is_private": false, "count": 0, "id": 133431, "time": "2010-01-07T11:35:11Z", "bug_id": 48507, "creation_time": "2010-01-07T11:35:11Z", "text": "hello.\nif to make several virtual hosts all on same port and same ip address and every has its one domain name, like example1.com and example2.org (or can be also, more useful case: example1.example.com and example2.example.com ) and every of this virtual hosts is configured to have its own different document root and all different directory, alias, location etc configurations in it, including that log files are different, but all this virtual hosts use one certificate file, because they cannot use different certificate files in regular apache which is without \"SNI\". this has not worked. apache httpd 2.2.12 in ubuntu 9.10 .\nhow this has not worked: apache has started but with some warning and and but has not served all of this vhosts properly. may be i will check it again. it has served only one of this vhosts properly, may be because it was first in vhosts' order, may be because its domain was equal to what is in the certificate.\nwhat has not worked properly: apache has applied document root of one of this vhosts to other vhosts , and may be also applied all other configurations in that vhost to other vhosts. so only one vhost has worked properly.\nsomebody can say here: name virtual hosts cannot work with 1 ip address, 1 port and ssl. no, they can. if same site is opened from all this addresses and in document root of the site an index.php , it is possible to send different content to the requests different by http host, it is possible to distinguish them from $_SERVER['HTTP_HOST'] variable of php. and also client side i.e. browser, firefox 3.5.x in my case, opens all this domains without extra error messages, just when user accepts certificate he sees in it domain name that does not match the domain name in address bar. i think, as/because this way works default ssl configuration, though they do not match, he can accept that certificate if he knows that this domains are of same owner or one of them is subdomain of other."}, {"count": 1, "text": "This bugzilla is for reporting suspected bugs in Apache HTTP Server, not a support forum for questions, configuration assistance, support, or systems analysis.\n  \nPerhaps someone on the Apache HTTP Server users list can help you determine what's going on with your system, and if this due diligence points to an Apache HTTP Server bug, reopen this ticket with a rigorous description that illustrates (via verbatim error messages, configurations, logs, packet captures, etc) the misbehavior in Apache HTTP Server. \n \nhttp://httpd.apache.org/userslist.html", "bug_id": 48507, "is_private": false, "id": 133432, "time": "2010-01-07T11:41:07Z", "creator": "covener@gmail.com", "creation_time": "2010-01-07T11:41:07Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 48507, "text": "i have searched before i reported this and have found that possibly there are several bugs because of one part of code.\nsee also this bugs:\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=42923 \"vhost certificate NOT overriding cert from the _default:443_ vhost\"\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=43218 \"Wrong cert used for vhost if ServerName is same\"\n\nnow regarding(?) first of these 2 urls to other bug reports i have remembered one more thing to add to my report: with the configuration i described , i said that httpd said a warning on restart, it said something about _default_ , i have/had checked my enabled virtual hosts, in none of them were written \"_default_\" , also in none place of configuration , i think/remember. (so apache used _default_ though it was not in configuration.)", "id": 133433, "time": "2010-01-07T11:48:12Z", "creator": "qdinar@gmail.com", "creation_time": "2010-01-07T11:48:12Z", "is_private": false, "attachment_id": null}]