[{"count": 0, "tags": [], "bug_id": 48519, "is_private": false, "text": "The THead, TFoot and TBody standard structure types have only been added in the fourth edition of PDF Reference (PDF 1.5). Yet PDFs produced by FOP are still declared as PDF 1.4. Some mechanism is needed to increase the PDF version to 1.5 when such tags are being used.", "id": 133507, "time": "2010-01-11T08:26:27Z", "creator": "vhennebert@gmail.com", "creation_time": "2010-01-11T08:26:27Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "pascal.sancho@takoma.fr", "attachment_id": null, "is_private": false, "id": 134608, "time": "2010-02-17T16:04:04Z", "bug_id": 48519, "creation_time": "2010-02-17T16:04:04Z", "text": "PDF version is related to Reader version.\nIn certain cases, FOP users may want to generate a PDF compatible with an old Reader version.\n\nIMHO, there are 2 options:\n - inform user what version of PDF is generated, depending on actual functionalities are used in that PDF;\n - block the target PDF version by setting it directly in the XSL-FO (using for example either a FOX extension or an XML PI)."}, {"count": 2, "tags": [], "bug_id": 48519, "is_private": false, "text": "(In reply to comment #1)\n> PDF version is related to Reader version.\n> In certain cases, FOP users may want to generate a PDF compatible with an old\n> Reader version.\n\nThat said, PDF 1.4 is getting really old now (Nov 2001 according to Adobe's website). Maybe just upgrading to PDF 1.5 as a minimal version, which is the simplest, would be ok for users.\n\n\n> IMHO, there are 2 options:\n>  - inform user what version of PDF is generated, depending on actual\n> functionalities are used in that PDF;\n\nThat's the other possibility, but that would require some work.\n\n\n>  - block the target PDF version by setting it directly in the XSL-FO (using for\n> example either a FOX extension or an XML PI).\n\nAnd throw an exception if a feature requiring PDF 1.5 is being used? Hmmm. Why not. Maybe a bit simpler to implement than the previous solution. Although, \"yet another extension\", etc.", "id": 134822, "time": "2010-02-23T16:42:34Z", "creator": "vhennebert@gmail.com", "creation_time": "2010-02-23T16:42:34Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "bowditch_chris@hotmail.com", "text": "(In reply to comment #2)\n> That said, PDF 1.4 is getting really old now (Nov 2001 according to Adobe's\n> website). Maybe just upgrading to PDF 1.5 as a minimal version, which is the\n> simplest, would be ok for users.\n\nThat would not be acceptable. The biggest problem is the millions of old reader versions installed within large organisations. Also, don't forget that PDF/A-1 requires PDF 1.4.\n\n> > IMHO, there are 2 options:\n> >  - inform user what version of PDF is generated, depending on actual\n> > functionalities are used in that PDF;\n> That's the other possibility, but that would require some work.\n> >  - block the target PDF version by setting it directly in the XSL-FO (using for\n> > example either a FOX extension or an XML PI).\n> And throw an exception if a feature requiring PDF 1.5 is being used? Hmmm. Why\n> not. Maybe a bit simpler to implement than the previous solution. Although,\n> \"yet another extension\", etc.\n\nI don't see a problem with adding another extension or fop.xconf setting. As long as its documented correctly. Making PDF 1.5 optional is the preferred option.\n\nThanks,\n\nChris", "id": 134825, "time": "2010-02-23T17:17:21Z", "bug_id": 48519, "creation_time": "2010-02-23T17:17:21Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "resetting P2 open bugs to P3 pending further review", "is_private": false, "id": 157538, "creator": "gadams@apache.org", "time": "2012-04-07T01:44:23Z", "bug_id": 48519, "creation_time": "2012-04-07T01:44:23Z", "attachment_id": null}]