[{"count": 0, "tags": [], "bug_id": 48540, "attachment_id": null, "id": 133587, "time": "2010-01-13T13:44:33Z", "creator": "jks@iname.com", "creation_time": "2010-01-13T13:44:33Z", "is_private": false, "text": "Apparently the BalancerMember takes many parameters, but they are not documented well at http://httpd.apache.org/docs/2.2/mod/mod_proxy.html#balancermember\n\nI spent a long time trying to figure out why my sticksessions were not working, when I finally found in an email in the archives that I needed a route parameter set in the  BalancerMember line."}, {"count": 1, "tags": [], "bug_id": 48540, "text": "Are you asking to draw more attention to the options, or to draw attention to \"route\" option specifically?\n\nCurrently: \"...and can take any of the key value pairs available to ProxyPass directives.\"  (ProxyPass being a hyperlink)", "id": 133588, "time": "2010-01-13T14:29:32Z", "creator": "covener@gmail.com", "creation_time": "2010-01-13T14:29:32Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 48540, "text": "Well route specifically confused me. \"The route is a value appended to session id.\" doesn't really explain what it is and why my stickysessions were not working w/o routes being set. I also gathered from reading emails in the archives that are are some other options available that are not listed in ProxyPass (but I could be wrong about that, I didn't look in the source code. )\n\nI also just noticed a typo under ttl:\n\n\"that has not\" should be \"that has have not\"", "id": 133589, "time": "2010-01-13T14:37:35Z", "creator": "jks@iname.com", "creation_time": "2010-01-13T14:37:35Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 48540, "attachment_id": null, "id": 154512, "time": "2012-03-05T00:32:41Z", "creator": "rbowen@apache.org", "creation_time": "2012-03-05T00:32:41Z", "is_private": false, "text": "I'm not able to find the typo mentioned. Can you point me to a location where this typo exists? Did someone already fix it?\n\nThis bug is two years old and has seen no activity. If you could provide a patch, or a description of route that you'd like to see in here, that would be very helpful."}, {"count": 4, "tags": [], "creator": "jks@iname.com", "attachment_id": null, "text": "It looks like the documentation has been much improved since I filed this bug.  That typo does not exist.  The mod_proxy_balancer documentation now clearly explains that the role of routes in stickysessions.  This bug can be closed.", "id": 154524, "time": "2012-03-05T02:36:42Z", "bug_id": 48540, "creation_time": "2012-03-05T02:36:42Z", "is_private": false}]