[{"count": 0, "tags": [], "bug_id": 48541, "attachment_id": null, "id": 133598, "time": "2010-01-14T05:11:42Z", "creator": "vsizikov@gmail.com", "creation_time": "2010-01-14T05:11:42Z", "is_private": false, "text": "In JRuby build, we use JarJar to bundle multiple JARs into a single one, plus tweak the package names. We have the following:\n\n<rule pattern=\"org.objectweb.asm.**\" result=\"jruby.objectweb.asm.@1\"/>\n\nto replace org.objectweb.asm package with jruby.objectweb.asm one.\n\nAnd it works just fine with Ant 1.7.0 and 1.7.1. But with 1.8.0RC1 the things are broken and jarjar just silently skips this step of renaming the package.\n\nIf you'd like a test for this, then from JRuby repository:\n\n1. ant jar-complete\n2. java -cp lib\\jruby-complete.jar org.jruby.Main -v\n\nleads to crash (due to missing classes).\n\nI bisected Ant repo, and it seems that the commit that introduced this problem is:\nrev 794204:\n\nAuthor: Stefan Bodewig <bodewig@apache.org>\nDate:   Wed Jul 15 09:01:48 2009 +0000\n\npreserve ZIP extra fields\n\nSo, this is a regression that breaks important and popular JarJar task and makes JRuby build completely broken."}, {"count": 1, "tags": [], "bug_id": 48541, "is_private": false, "text": "First of all thank you for checking the release candidate.\n\nThe commit in question does two things.  First it tries to preserve \"ZIP extra fields\" when re-packaging an archive and second it introduces a different signature for the protected zipFile method since the old one contained a parameter that has never been used.\n\nDo you have any further information on how jarjar works internally (if not I can try to locate the sources and check myself).  I'd suspect it is the second part of the change causing problems.  Likely jarjar overrides the no-longer used old signature.\n\nThe way I've implemented the new signature is not backwards compatible in any case, so I'm going to revert that bit.", "id": 133649, "time": "2010-01-16T22:41:04Z", "creator": "bodewig@apache.org", "creation_time": "2010-01-16T22:41:04Z", "attachment_id": null}, {"text": "Thanks for quick response, and big thanks for moving Ant forward!\n\nUnfortunately, I don't really know the JarJar internals. All I know is that their repo is:\n\nhttp://code.google.com/p/jarjar/source/browse/#svn/trunk/jarjar/src/main/com/tonicsystems/jarjar\n\nAnd I just realized that I haven't provided the JRuby repo location, in case it is needed for quick verification that JarJar works after the fix:\n\nhttp://github.com/jruby/jruby\n\nI'll also make sure to check the fix myself, as soon as I see it.", "tags": [], "bug_id": 48541, "attachment_id": null, "count": 2, "id": 133651, "time": "2010-01-17T00:44:30Z", "creator": "vsizikov@gmail.com", "creation_time": "2010-01-17T00:44:30Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 48541, "text": "It turned out to be non-trivial (yes, jarjar overrides the method in question) but I think svn revision 900082 should fix it.  It would be good if you could give it a try.\n\nI'll look into adding jarjar or even the jruby builds to Gump so we catch new regressions here.", "id": 133652, "time": "2010-01-17T02:04:27Z", "creator": "bodewig@apache.org", "creation_time": "2010-01-17T02:04:27Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 48541, "text": "Stefan, excellent news! I tested the latest version with JRuby, and the build is exactly the same for both Ant 1.7.1 and 1.8-dev. Thanks for the fix, much appreciated!", "id": 133653, "time": "2010-01-17T02:29:44Z", "creator": "vsizikov@gmail.com", "creation_time": "2010-01-17T02:29:44Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "is_private": false, "id": 133654, "time": "2010-01-17T02:38:44Z", "bug_id": 48541, "creation_time": "2010-01-17T02:38:44Z", "text": "great news, thanks for checking."}]