[{"count": 0, "tags": [], "bug_id": 48562, "attachment_id": 24851, "is_private": false, "id": 133663, "time": "2010-01-17T15:37:48Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2010-01-17T15:37:48Z", "text": "Created attachment 24851\nScreenshot of item 3 (Windows)\n\nWhile testing Batik I noticed a few glitches with cursors.\n\n\nSteps to reproduce:\n1. Open Batik Squiggle;\n2. Load the SVG 1.1 test suite regarding cursors [2] (bug's URL);\n3. Slowly move the mouse into the \"help\" and \"move\" areas.\n\n\nExpected result:\nCursor behavior would behave the same as a native implementation.\n\n\nActual result:\nI've noticed a few minor issues, namely:\n\n1. Imprecision. When the mouse enters the (already stated) areas where custom cursors are used (see org.apache.batik.bridge.CursorManager), there's a small, about 1 pixel jump. This seems to be caused by the fact that cursor hot spots seem to be zero-based, while the code assumes 1-based.\n\n2. The \"move\" cursor (according to the code, MacOS only) is even size and, therefore, not very precise. An odd-sized cursor is suggested.\n\n3. The custom help cursor looks bad in Windows. What seems to be happening is that the cursor is scaled according to the hint from \"Toolkit.getDefaultToolkit().getBestCursorSize\", while the native cursors seem to be smaller than that. I'm not sure if a fix should be attempted.\n\n4. The \"pointer\" cursor doesn't use the native cursor: a generic hand-looking cursor is displayed (at least in Windows [2] and Linux [3]). Apparently it is due to a Java limitation, which doesn't contain a native cursor binding to this cursor -- I recall from the docs that it's not consistent across platforms, but I haven't got a pointer handy and we can't fix this one, so it doesn't matter much...\n\n\nAdditional details:\nI had this problem almost fixed in my previous laptop but, unfortunately, something got lost during migration to my current one. The fixes are rather simple and this should be easy to address soon.\n\n\n[1] http://www.w3.org/Graphics/SVG/Test/20061213/svggen/interact-cursor-01-f.svg\n[2] Windows XP SP3 + JRE 1.6.0_05 + Batik 1.7 & 1.8pre\n[3] Ubuntu 7.10 + JRE 1.6.0_03 + Batik 1.7"}]