[{"count": 0, "tags": [], "creator": "errorken@yahoo.com", "attachment_id": null, "id": 133681, "time": "2010-01-18T05:37:56Z", "bug_id": 48566, "creation_time": "2010-01-18T05:37:56Z", "is_private": false, "text": "I've created a tag file (XML style) on which I have a attribute on which I enable deferral. I'm doing this on tomcat 6.0.20 started with Java6\n\nTag file looks something like:\n\n<jsp:root  xmlns:jsp=\"http://java.sun.com/JSP/Page\" version=\"2.1\" >\n\t<jsp:directive.tag language=\"java\" pageEncoding=\"UTF-8\" />\n\t<jsp:directive.attribute   name=\"userInformation\" required=\"true\"  deferredValue=\"true\" />\n</jsp:root>\n\nHowever, at compilation I get this: \n\norg.apache.jasper.JasperException: Invalid JSP version defined for tag file at /WEB-INF/tags/userInfo.tag\n\tat org.apache.jasper.compiler.DefaultErrorHandler.jspError(DefaultErrorHandler.java:51)\n\tat org.apache.jasper.compiler.ErrorDispatcher.dispatch(ErrorDispatcher.java:409)\n\tat org.apache.jasper.compiler.ErrorDispatcher.jspError(ErrorDispatcher.java:116)\n\tat org.apache.jasper.compiler.TagFileProcessor$TagFileDirectiveVisitor.visit(TagFileProcessor.java:280)\n\n\nIf I go look at TagFileProcessor$TagFileDirectiveVisitor L280 , I see a call to ImplicitTagLibraryInfo which will return the JSP version, and indeed, in my case it returns 2.0, so the error is at least correct according to the spec (the spec says it should throw an error is deferral is used pre 2.1)\n\nNow, if I check ImplicitTagLibraryInfo why the version returned is 2.0, I see that in the constructor of ImplicitTagLibraryInfo the version is initialized b default at 2.1 (weird, since its 2.1 container, but anyway).\nHowever, when further executing the constructor, it scans the files to see if has to change the version.\nBut the problem is that this is only done in case of an IMPLICIT TLD:\n\nImplicitTagLibraryInfo-L115: } else if (path.endsWith(IMPLICIT_TLD)) {\n\nSo, in case of my tag file there is no implicit TLD and the else is never executed leaving the version at 2.0\n\nThis seems incorrect, since my tag clearly indicates to be 2.1 and the JSP version on tomcat is also 2.1 \nCan this be fixed?"}, {"count": 1, "tags": [], "bug_id": 48566, "attachment_id": null, "is_private": false, "id": 134533, "time": "2010-02-15T23:59:09Z", "creator": "markt@apache.org", "creation_time": "2010-02-15T23:59:09Z", "text": "Short version:\nThe TLD determines the JSP version to be used.\nThe JSP version in the tag file must agree with the one in the TLD.\nThe default version for implicit.tld is 2.0\n\nLong version:\nFollowing the quotes from the JSP 2.1 spec:\n\nFrom the end of JSP.8.3:\nIf a tag file in XML syntax contains a jsp:root element, the value of that\nelement’s version attribute must match the tag file’s JSP version. See\nSection JSP.8.4.2, “Packaging in a JAR”, and Section JSP.8.4.3, “Packaging\nDirectly in a Web Application”, for how the JSP version of a tag file is\ndetermined.\n\nIn this case we need to look at JSP.8.4.3:\nThe JSP version of an implicit tag library defaults to 2.0.\nThe JSP version and tlib-version of an implicit tag library may be configured\nby placing a TLD with the reserved name implicit.tld in the same directory as the implicit tag library’s constituent tag files. A JSP 2.1 container must consider only the JSP version and tlib-version specified by an implicit.tld file, and ignore its short-name element."}]