[{"count": 0, "tags": [], "bug_id": 48574, "text": "Created attachment 24861\nExtensions of XWPF to insert tables, paragraphs with pictures, styles and numberings\n\nActually I have to problem, with adding tables and paragraphs to a document. For example if I have three paragraphs between two tables I am only able to insert a table between these two tables. But I cannot position the table excatly after the first of the three paragraphs. Initially I tried to handle this problem with XmlCursors, but debugging an XmlCursor is not a very funny.  So I decided to create a marker Interface IBodyElement, which is implemented by XWPFParagraph and XWPFTable (Yes I call them BodyElements). On the other Hand I created the Interface IBody which is implemented by all Classes, who owns arrays with tables and paragraphs. (Actually this are the classes XWPFDocument, XWPFTableCell, XWPFHeaderFooter). In IBody there a some signature of methods which are handling the operations with XWPFTable and XWPFParagraph in a Body.\nTo support styles and numberings  the classes XWPFStyles, XWPFStyle, XWPFNumbering, XWPFNum, XWPFAbstractNum are added. The classes XWPFPictureData and XWPFPicture were created to support pictures. This classes are quit equal to XSSFPictureData and XSSFPicture. \n\nHope you like my changes. :-)\nPhilipp Epp", "id": 133702, "time": "2010-01-19T08:16:46Z", "creator": "Philipp.Epp@hoefliger.de", "creation_time": "2010-01-19T08:16:46Z", "is_private": false, "attachment_id": 24861}, {"count": 1, "tags": [], "bug_id": 48574, "attachment_id": 24862, "is_private": false, "id": 133703, "time": "2010-01-19T08:18:53Z", "creator": "Philipp.Epp@hoefliger.de", "creation_time": "2010-01-19T08:18:53Z", "text": "Created attachment 24862\nTest-Data of the test cases in the previous patch\n\nthis test-data must be added to Test-Data/documents/"}, {"count": 2, "tags": [], "bug_id": 48574, "attachment_id": null, "text": "Hello all\n\nMaybe someone can look into this. The attached patch contains a major contribution to the XWPF classes. The new classes and methods allow the modification of existing objects to some extent. \n\nIf you need more information on the classes, the API or anything else, please let us know. \n\nThe classes were created in terms of a diploma thesis and we internally use them. For now we merge ongoing POI commits with this patch, until either POI accepts the commit or comes up with some other API which provides equal modification options.\n\nRegards,\nStefan Stern", "id": 135351, "time": "2010-03-15T10:25:09Z", "creator": "stefan.stern@mind8.com", "creation_time": "2010-03-15T10:25:09Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 48574, "attachment_id": null, "is_private": false, "id": 136031, "time": "2010-04-12T03:02:44Z", "creator": "Philipp.Epp@hoefliger.de", "creation_time": "2010-04-12T03:02:44Z", "text": "Hi at all,\nCould somebody tell me what I did wrong with this patch? Is there any chance that it will be accepted like it is. Or do have to change it. (splitting it into smaller patches or changing the API). So that at least some parts of my patch will find a way into Apache POI.\nThank for your response\nPhilipp Epp"}, {"attachment_id": null, "tags": [], "creator": "apache@gagravarr.org", "is_private": false, "count": 4, "id": 137578, "time": "2010-06-11T10:40:40Z", "bug_id": 48574, "creation_time": "2010-06-11T10:40:40Z", "text": "Thanks for this patch, applied to trunk in r953704 with only minor tweaks.\n\nIn future though, it's generally worth mentioning on the dev list when you're working on big contributions like this. That should allow you to get feedback, and give us a heads-up on the impending patch. This generally reduces the chances that everyone sees a monster patch and decides \"I don't have time to review that now, I'll wait for someone else\"...\n\nAlso, any chance you could send in an ICLA at some point when you have a minute? <http://www.apache.org/licenses/icla.txt>. Can just be emailed or faxed. It confirms that you understand the terms of the apache license that your contribution will be used under, and we like to have them from people who make large scale contributions so there's no confusion, and everyone's happy :)"}, {"count": 5, "tags": [], "bug_id": 48574, "text": "Philipp,\n\nYour patch included the following:\n> +public class XWPFLatentStyles {\n> +\tprivate CTLatentStyles latentStyles;\n> +\tprotected XWPFStyles styles; //LatentStyle shall know styles\n\nYour patch didn't include a LatentStyle class. After 6 years, do you remember what LatentStyle was referring to?", "id": 191592, "time": "2016-06-13T04:59:26Z", "creator": "onealj@apache.org", "creation_time": "2016-06-13T04:59:26Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 48574, "attachment_id": null, "is_private": false, "id": 191593, "time": "2016-06-13T06:07:46Z", "creator": "Philipp.Epp@hoefliger.de", "creation_time": "2016-06-13T06:07:46Z", "text": "Yes you're right. After 6 years I really do not know something about XWPF anymore. Sorry. Everything is gone."}]