[{"count": 0, "tags": [], "text": "Created attachment 24880\ntest program that is able to hit the bug being described \n\nI have a specific issue with a website that is using apache 2.2.3 on linux CentOS.   I have no idea which module is actually responsible for this so I have placed the ticket under worker, sorry if that is incorrect.\n\nbut I think the issue I have is actually an apache parsing issue which is why I am posting the bug here.\n\nI have a small test program that I wrote up quickly to test what is happening to see if it was reproduceable, and it is.\n\nif I send the following request to the server images.themoviedb.org from an application where I write() the entire string to the socket, it comes back with a failure \n\nGET http://images.themoviedb.org/posters/102029/armored.jpg HTTP/1.1\\r\\nConnection: Keep-Alive\\r\\nHost: images.themoviedb.org\\r\\n\\r\\n\n\ncomes back with \n\n\"This URLs or Page has been blocked.\"\n\nbut if I modify the request to \n\nGET /posters/102029/armored.jpg HTTP/1.1\\r\\nConnection: Keep-Alive\\r\\nHost: images.themoviedb.org\\r\\n\\r\\n\n\nit works, and returns the image as expected. So I assumed that the server just didnt like the FULL URI passed as the parameter to GET.  I then changed my test program to write out the request 1 byte at a time, and it came back with the image even if I passed it the entire URI.\n\nthis sounds like something that would be happening within apache and not something being done within cgi scripts on the server... if that is incorrect let me know.", "attachment_id": 24880, "bug_id": 48592, "id": 133798, "time": "2010-01-21T12:21:38Z", "creator": "kcarmich@hotmail.com", "creation_time": "2010-01-21T12:21:38Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48592, "text": "That's not an error message from Apache HTTP Server, and your example URL reports nginx.  If that's not the verbatim HTTP response, include the verbatim response along with headers and corresponding log entries.", "id": 133801, "attachment_id": null, "creator": "covener@gmail.com", "creation_time": "2010-01-21T15:02:05Z", "time": "2010-01-21T15:02:05Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 48592, "attachment_id": null, "text": "anyway, that first request is a proxy request", "id": 133834, "time": "2010-01-22T03:40:41Z", "creator": "trawick@apache.org", "creation_time": "2010-01-22T03:40:41Z", "is_private": false}]