[{"count": 0, "tags": [], "bug_id": 48603, "attachment_id": null, "id": 133854, "time": "2010-01-24T02:13:26Z", "creator": "daveyjatin@gmail.com", "creation_time": "2010-01-24T02:13:26Z", "is_private": false, "text": "The test plan was designed as below :\n\nOne JDBC request sent to the database querying for some data tables and an assertion for it. Based on the assertion the results obtained were either passed of failed. There was a listener added to the test plan as mailer visualizer which was configured to send a mail when the results fails. \n\nHad failed a response and received two emails instead of one. In the mailer visualizer i had it configured 0 as the limit to the number of failures, hence it should have just sent one mail when a failure occurs. Instead two mails are being sent.\n\nthis must be corrected as one failure should result in sending only one email and two. Please revert back to me if anymore inputs are required."}, {"count": 1, "attachment_id": null, "creator": "daveyjatin@gmail.com", "is_private": false, "id": 133860, "time": "2010-01-24T08:10:26Z", "bug_id": 48603, "creation_time": "2010-01-24T08:10:26Z", "tags": [], "text": "(In reply to comment #0)\n> The test plan was designed as below :\n> \n> One JDBC request sent to the database querying for some data tables and an\n> assertion for it. Based on the assertion the results obtained were either\n> passed of failed. There was a listener added to the test plan as mailer\n> visualizer which was configured to send a mail when the results fails. \n> \n> Had failed a response and received two emails instead of one. In the mailer\n> visualizer i had it configured 0 as the limit to the number of failures, hence\n> it should have just sent one mail when a failure occurs. Instead two mails are\n> being sent.\n> \n> this must be corrected as one failure should result in sending only one email\n> and not two. Please revert back to me if anymore inputs are required."}, {"count": 2, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "text": "Confirmed that the problem exists with any sampler (not just JDBC) and was also present in version 2.3.3, possibly earlier.", "id": 133861, "time": "2010-01-24T08:29:21Z", "bug_id": 48603, "creation_time": "2010-01-24T08:29:21Z", "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "text": "URL: http://svn.apache.org/viewvc?rev=902601&view=rev\nLog:\nBug 48603 - Mailer Visualiser sends two emails for a single failed response\n\nModified:\n   jakarta/jmeter/trunk/src/components/org/apache/jmeter/reporters/MailerModel.java\n   jakarta/jmeter/trunk/src/components/org/apache/jmeter/reporters/MailerResultCollector.java\n   jakarta/jmeter/trunk/xdocs/changes.xml", "id": 133862, "time": "2010-01-24T09:22:35Z", "bug_id": 48603, "creation_time": "2010-01-24T09:22:35Z", "is_private": false}]