[{"count": 0, "tags": [], "bug_id": 48633, "text": "The current Launcher class uses this code:\n\n        URLClassLoader loader = new URLClassLoader(jars);\n\nUnfortunately, I'm trying to run Ant from an already running Java program, and I don't want to launch an entirely new VM just to spawn Ant.\n\nSo I tried putting the Ant launcher into a URLClassLoader(), and it doesn't work.\n\nIf I changed the above line to:\n\n        URLClassLoader loader = new URLClassLoader(jars, getClass().getClassLoader() );\n\nmy bootstrap code works as expected.  Is there any reason against making this change?\n\nProblem observed in the source for both Ant 1.7.1 and the latest 1.8.0RC1", "id": 133985, "time": "2010-01-27T19:42:45Z", "creator": "eric@tibco.com", "creation_time": "2010-01-27T19:42:45Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 48633, "attachment_id": null, "text": "If you are integrating Ant into your own program Launcher is not the best starting place since it will load Ant's Main class which isn't written to be used in any way other than the command line interface.\n\nAll in all it is probably easier to mimic what Main does from inside your own code.", "id": 135091, "time": "2010-03-05T17:01:29Z", "creator": "bodewig@apache.org", "creation_time": "2010-03-05T17:01:29Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 48633, "attachment_id": null, "id": 135092, "time": "2010-03-05T17:35:36Z", "creator": "eric@tibco.com", "creation_time": "2010-03-05T17:35:36Z", "is_private": false, "text": "Effectively, I'm trying to do one very simple thing - provide a wrapper around Ant so that I can download the Ant distribution and run it from the same JVM.  I don't want to pay the performance penalty of downloading Ant, then running it in a different JVM.\n\nSo what I want to do is almost exactly to launch Ant as if it were a command line invocation, except that when the JVM starts, the Ant JARs may not be on disk, so they're not in the system class loader.  My little stub fetches the JAR files, loads up the launcher in a URLClassLoader, then launches Ant with exactly the parameters that were passed to it.\n\nDuplicating all the functionality of the Launcher Class certainly is possible, but would be hundreds of lines of unnecessary code, since the Launcher class makes a unnecessary assumption about how it is being used.  Passing the ClassLoader as my patch suggests simply eliminates that assumption."}, {"count": 3, "tags": [], "bug_id": 48633, "attachment_id": null, "text": "Committed revision 1233420.", "id": 152936, "time": "2012-01-19T15:09:14Z", "creator": "jglick@apache.org", "creation_time": "2012-01-19T15:09:14Z", "is_private": false}]