[{"count": 0, "tags": [], "text": "For quite a while we've been using Tomcat 6.0.20 with the SSLWithFormFallbackAuthenticator described here: http://wiki.apache.org/tomcat/SSLWithFORMFallback\n\nWe need to have our server first attempt to do user authentication with SSL certificates, and if that fails, let the user log in with a form.\n\nThis no longer works in Tomcat 6.0.24.  Users with certificates can log in successfully; if a user does not have a certificate, after the cert check fails, Tomcat seems to close the connection without sending any data back to the browser.  Since the user never gets the form page, they can't log in.\n\nThis log line in particular appears when a user without a certificate tries to log in with 6.0.24:\nWARN http-443-1 org.apache.tomcat.util.net.jsse.JSSESupport - SSL server initiated renegotiation is disabled, closing connection\n\nThat warning message gets printed out between the logging statements at lines 291 and 303 of SSLWithFormFallbackAuthenticator.java.  (that is, between \" No certificates found in HttpRequest.\" and \"  No certificates included with this request\".  That warning message does not appear when a user without a cert logs in under Tomcat 6.0.20.\n\nMy hunch is that this may be related to the fix for bug 46950, \"SSL renegotiation does not occur when resource with CLIENT-CERT auth is requested\", which was supposedly in the unreleased version 6.0.21.  I'm not sure, though.", "attachment_id": null, "bug_id": 48677, "id": 134199, "time": "2010-02-03T11:35:09Z", "creator": "preed@swri.org", "creation_time": "2010-02-03T11:35:09Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48677, "is_private": false, "text": "The renegotiation protection feature that you are facing was implemented in rev.891292.\n\nNote, that you can disable it by setting allowUnsafeLegacyRenegotiation attribute on a Connector to the value of \"true\". That is documented here:\n\nhttp://tomcat.apache.org/tomcat-6.0-doc/config/http.html\nhttp://tomcat.apache.org/security-6.html", "id": 134209, "time": "2010-02-04T00:08:56Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2010-02-04T00:08:56Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 134214, "time": "2010-02-04T01:36:38Z", "bug_id": 48677, "creation_time": "2010-02-04T01:36:38Z", "text": "Questions about allowUnsafeLegacyRenegotiation should be directed to the users list."}]