[{"count": 0, "tags": [], "bug_id": 48689, "attachment_id": null, "text": "Jasper can load TLD files through the ServletContext or from a Jar file. To load TLDs from Jar file, an URL to a Jar file must be passed. However, in some environments (e.g. in OSGi) it might not be easy to provide an URL to a jar file. It would be nice to abstract the way Jasper is looking up the embedded TLDs so that different ways of looking up TLDs within Jar files or Bundles or whatever could be used.", "id": 134261, "time": "2010-02-05T12:30:40Z", "creator": "jgawor@gmail.com", "creation_time": "2010-02-05T12:30:40Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48689, "text": "Created attachment 24933\nProposed patch for this issue.\n\nProposed patch for this issue is now attached. The patch introduces JarResource interface through which most of the embedded TLD lookup is done. In most places the code uses JarResource.getEntry() to get an URL to a specific entry within the JarResource. In one or two places JarResource.getJarFile() is used but really JarResource.getEntry() should be preferred.", "id": 134262, "time": "2010-02-05T12:38:53Z", "creator": "jgawor@gmail.com", "creation_time": "2010-02-05T12:38:53Z", "is_private": false, "attachment_id": 24933}, {"count": 2, "tags": [], "bug_id": 48689, "attachment_id": null, "text": "Tomcat 7 already includes a number of features added specifically to support TLD scanning in OSGi environments. Can you elaborate as to what you can't currently do with Tomcat 7?\n\nAlso, could you provide an example of situations when a URL can't be provided?", "id": 134267, "time": "2010-02-06T05:53:31Z", "creator": "markt@apache.org", "creation_time": "2010-02-06T05:53:31Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 48689, "text": "First, can you quickly describe or point me to the features that were added to support TLD scanning in OSGi env. in case I missed them?\n\nWe have a custom implementation of TldLocationsCache.java. If the TLD is within the application bundle (accessible via ServletContext or within a jar file in a bundle) everything works fine. But in some cases we want to return a TLD that is located in another bundle. So all we have is a URL to the TLD. For example, something like bundle://123:0/META-INF/foo.tld. And in this case there is no \"jar url\" I can pass/return to Jasper.", "id": 134268, "time": "2010-02-06T10:01:14Z", "creator": "jgawor@gmail.com", "creation_time": "2010-02-06T10:01:14Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 48689, "is_private": false, "text": "It was bug47834 and mainly r814617 and r817685.\n\nBundles (as long as they are on the class path) are handled if org.apache.jasper.compiler.TldLocationsCache.SCAN_ALL_FILES is set as any file on the class path is checked to see if it is in JAR format and if it is, it is scanned.\n\nExploded bundles (again as long as they are on the class path) are handled if org.apache.jasper.compiler.TldLocationsCache.SCAN_ALL_DIRS is set and any directory on the class path is checked to see it it is an exploded JAR/bundle. If it is it is scanned.\n\nAs an aside, the TLD scanning is likely to see another refactoring once the Servlet 3.0 work is complete to take advantage of some of the new features to simplify the code.", "id": 134270, "time": "2010-02-06T12:13:37Z", "creator": "markt@apache.org", "creation_time": "2010-02-06T12:13:37Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 48689, "text": "Thanks for the pointers. I am aware of that code but it doesn't really help or address the problem described in this bug. Jasper shouldn't require (as it doesn't really need) a jar url to be passed from TldLocationsCache just to parse the TLD or tag files within it. The problem is not with TLD scanning itself but what TldLocationsCache.getLocation() method forces me to return and rest of the Jasper code that uses the location information to do its stuff.", "id": 134334, "time": "2010-02-08T08:01:38Z", "creator": "jgawor@gmail.com", "creation_time": "2010-02-08T08:01:38Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "markt@apache.org", "text": "Thanks for the patch. It has been applied to 7.0.x and will be included in 7.0.0 onwards.", "count": 6, "id": 136399, "time": "2010-04-25T08:57:13Z", "bug_id": 48689, "creation_time": "2010-04-25T08:57:13Z", "is_private": false}]