[{"attachment_id": null, "tags": [], "bug_id": 48702, "is_private": false, "count": 0, "id": 134337, "time": "2010-02-08T09:56:11Z", "creator": "j.stuyts@javathinker.com", "creation_time": "2010-02-08T09:56:11Z", "text": "The rasterizer uses the default Java2D rendering hints of the platform. This results in lower quality graphics (depending on the platform I guess), which is especially noticable when drawing small (in terms of pixels) shapes.\n\nThe rasterizer should have options that allow setting the rendering hints to use. A number of fast presets (highest, lowest, etc.) could be used to set known sets of rendering hints at once.\n\nSee the following thread for more information:\nhttp://mail-archives.apache.org/mod_mbox/xmlgraphics-batik-users/201002.mbox/%3c002701caa5d9$eee2d5d0$d08d664e@hanz%3e"}, {"count": 1, "tags": [], "bug_id": 48702, "attachment_id": null, "id": 134529, "time": "2010-02-15T18:50:18Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2010-02-15T18:50:18Z", "is_private": false, "text": "(In reply to comment #0)\n> The rasterizer uses the default Java2D rendering hints of the platform.\n\nI don't think this is correct. AFAIK, the rasterizer uses the rendering hints specified by content [1].\n\n\n> The rasterizer should have options that allow setting the rendering hints to\n> use. A number of fast presets (highest, lowest, etc.) could be used to set\n> known sets of rendering hints at once.\n\nLet's try to clear this up a bit. As I've stated within the same thread [2], the idea was to allow these rendering hints to *override* the hints already provided by the content (even if not specified, the lacuna values will be used, so this is implicit).\n\nProviding a mechanism to override the rendering hints, possibly through the proposed presets would then be cool to allow optimizing for a few use-cases (somehow already stated [2] also):\n * Batch or high volume conversion, where speed could be required/desirable over quality;\n * Printing, where optimal quality would be highly desired given the usually high resolution available in most output devices;\n * Etc..\n\n\nI've rephrased the bug's summary to reflect this clarification. :-)\n\n\n[1] http://www.w3.org/TR/SVG/painting.html#RenderingProperties\n[2] http://mail-archives.apache.org/mod_mbox/xmlgraphics-batik-users/201002.mbox/%3C2a1ddf8a1002071046t499e6580i66c8bc9e8a1dbd23@mail.gmail.com%3E"}]