[{"count": 0, "tags": [], "bug_id": 48739, "is_private": false, "text": "Problem: \n\nMy build folder is over 100 gig (didn't know why), during a backup I happened to\nnotice a file taking forever to copy named large.bin in the folder\napr-1.4.2/test/lfstests. I stopped the backup and investigated and found 4 such\nfiles in the test/lfstests of APRs 1.3.11, 1.3.12 & 1.4.1 as well as 4\nbuffer.bin files in same said test/lfstests all totaling 64 gigs. This could eaily eat up my 200G backup drive since I am half way there now.\n\nThe files show up as 8GB on the hard drive\n\n Directory of E:\\build\\apr-1.3.12\\test\\lfstests\n\n02/13/2010  02:40 AM    <DIR>          .\n02/13/2010  02:40 AM    <DIR>          ..\n02/13/2010  02:40 AM     8,589,934,592 buffer.bin\n02/13/2010  02:40 AM     8,589,934,605 large.bin\n               2 File(s) 17,179,869,197 bytes\n\nWindows XP SP 2 & 3 \nVC 6 2003R2 SDK\nVC 9 Express SDK\n\nThis seems to be a problem in the Windows build system for \ntestall/testdll/testlib. \n\nAs far as I can tell a nmake clean would remove at least the lfstests\\large.bin\nfile if done from the command line cause I see the file listed in $(CLEAN_DATA)\nin makefile.win, this still seems to leave buffer.bin behind. makefile.in has \n$(CLEAN_TARGETS) targeting both, lfstests/*.bin. I however am a lazy win32\nbuilder and use the ide which is where the problem seems to lie, the projects\nseem to not clean either of these files when clean is run at the ide. In fact, nothing seems to clean out of LibR, Release and lfstests in my VC6.\n\nRegardless of clean (at least make clean) in the build system, if 2 files \nare being generated the os thinks are 8 gig monsters each, wouldn't it be \nbetter being dealt with as soon as the files are done being used which is after\ntest_buffered on line 366 of test/testlfs.c and not be left behind to rely on\nn/make clean et al to hopefully remove these files on any platform? The files \ncan just be created and removed again if need be so I am proposing doing just \nthat.\n\nsee attached patch, it works on Win32 in APR 1.3.12 with no warnings or\nfailure. Propose committing to trunk and backporting to 1.3, 1.4 & 1.5 provided\napproval.\n\nIf all else fails, fix the win32 build system and I'll just have to remember \nto clean. I cannot however think of any reason to keep them around unless there\nis a problem at which point comment out these two calls to apr_file_remove to\nleave the files for post build inspection.\n\n\nRegards,\nGregg", "id": 134482, "time": "2010-02-14T04:21:09Z", "creator": "gls@gknw.net", "creation_time": "2010-02-14T04:21:09Z", "attachment_id": null}, {"count": 1, "attachment_id": 24980, "creator": "gls@gknw.net", "text": "Created attachment 24980\nPatch to add removing of the large files after use", "id": 134483, "time": "2010-02-14T04:23:16Z", "bug_id": 48739, "creation_time": "2010-02-14T04:23:16Z", "tags": [], "is_private": false}]