[{"count": 0, "tags": [], "bug_id": 48744, "attachment_id": null, "id": 134501, "time": "2010-02-15T10:03:53Z", "creator": "zdravko.spoljar@styria-it.hr", "creation_time": "2010-02-15T10:03:53Z", "is_private": false, "text": "we have busy web site and for last few weeks we have problem with apache processes eat all memory. we attempt to control problem by lowering ServerLimit\n(documentation states that is max number of apache processes).\n\nServerLimit is at 75 (confirmed by /server-info as active value), but ps auxw\nshow around 90-95 processes. \n\nhere is part of worker config:\n\n<IfModule mpm_worker_module>\nServerLimit 75\nThreadLimit 30\n        StartServers            11\n        MinSpareThreads         45\n        MaxSpareThreads         95\n        ThreadsPerChild         25\n        MaxClients              1500\n        MaxRequestsPerChild     500\n</IfModule>\n\nserver is 12core, 8Gb ram. cpu usage is about 20-25% under normal load. at busier part of day sometimes processes start to eat more memory, and server locks (no swap configured as this make stuff even more painful). if i grab some server statistics (ps, netstat, df...) between start of problem and lock-up, i see there are more apache processes than configured. \nis this a bug in ServerLimit or that directive really cannot keep server processes limited to number? (next i going to use kernel mechanism to keep apache down in limits, but i'm not sure how apache would like fork() to fail) because i would rather have apache shot dead (and restarted by cron job) than dead server (which i need to restart).\n\nadditional info: server is using php & proxy modules."}, {"count": 1, "tags": [], "text": "You have a configuration problem, not a bug.  \n\nBugzilla is not the right place to ask for help configuring\nyour web server.\n\nPlease raise your question on the users mailing list at\nhttp://httpd.apache.org/userslist.html (and first read the advice\nthere about how to ask a question in a way that's likely to get\nhelpful answers).\n\nIf discussion there concludes that there is a bug, by all means\nre-open this bug report and update it with the conclusions from the\ndiscussion.\n\nThanks for helping those who volunteer to work on Apache to use their\ntime efficiently.", "attachment_id": null, "id": 134503, "creator": "poirier@pobox.com", "time": "2010-02-15T11:32:32Z", "bug_id": 48744, "creation_time": "2010-02-15T11:32:32Z", "is_private": false}]