[{"attachment_id": 24995, "tags": [], "bug_id": 48748, "is_private": false, "count": 0, "id": 134542, "time": "2010-02-16T09:05:24Z", "creator": "onkelpax-fop@yahoo.de", "creation_time": "2010-02-16T09:05:24Z", "text": "Created attachment 24995\nHyphenation test examples and pattern files\n\nAfter the bug fixing in #48745 my hyphenation test of 10 German words works identically with OpenOffice which used the same hyphenation patterns. Before the bug fix there were 4 differences in the hyphenation results, and now it's zero. Furthermore, also the test of the French language finished without the previous differences.\n\nBut the hyphenation results of English (US) and Russian weren't be enhanced. I attached the two files who show the results. On following page you can find a hyphenation tool which uses OpenOffice's hyphenation program. It allows you some rapid tests: http://www.ushuaia.pl/hyphen/?ln=en\n\nThe differences where the hyphenation starts after the first letter won't be detected by OpenOffice, because they assume that there must be at least 2 letters before the hyphen. But other hyphenation examples shouldn't differ from us (see the 5. and 7. result in the Russian file).\n\nBest regards\n\n\nPAX"}, {"attachment_id": null, "tags": [], "bug_id": 48748, "text": "I've got to take back my information about the hyphenation difference of the US English examples.\n\nThe online tool doesn't always equal to OpenOffice. But I checked the Russian examples in OpenOffice again and 2 differences remained. You can skip the first 3 failed hyphenation examples of the Russian example file. They differ because I cannot set the minimum word length before/after hyphenations lesser than 2 in OpenOffice.\n\nBut the other 2 differences are real.", "count": 1, "id": 134816, "time": "2010-02-23T11:58:01Z", "creator": "onkelpax-fop@yahoo.de", "creation_time": "2010-02-23T11:58:01Z", "is_private": false}, {"count": 2, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "text": "resetting P2 open bugs to P3 pending further review", "id": 157565, "time": "2012-04-07T01:44:42Z", "bug_id": 48748, "creation_time": "2012-04-07T01:44:42Z", "is_private": false}]