[{"count": 0, "tags": [], "bug_id": 48769, "attachment_id": 25019, "id": 134668, "time": "2010-02-18T18:29:09Z", "creator": "jd@cpanel.net", "creation_time": "2010-02-18T18:29:09Z", "is_private": false, "text": "Created attachment 25019\nGraceful restart patch\n\nDuring graceful restarts mod_fcgid sends SIGTERM to its child processes, waits one second, sends SIGKILL to them, then blocks until they are all reaped.  This is a particularly bad method since the only safe time for a fastcgi worker process to shut down is between requests.  For graceful restarts to be truely graceful with mod_fcgid, all fastcgi requests need to complete in under 1 second.\n\nAdditionally, we've seen some servers where it takes several minutes for mod_fcgid to reap all of its processes during graceful restarts.  This is likely due the the fact that mod_fcgid is also trying to reap processes in the free list which it didn't actually spawn.\n\n\nAn better method would be for mod_fcgid to not send SIGKILL and wait on the processes in the busy list during graceful restarts.  The attached patch attempts to go this route by keeping the shared memory, mutexes and pipes the mod_fcgid process manager uses to communicate with bridged apache workers alive across restarts.\n\nThis also changes the shutdown code so that it does not signal and attempt to reap processes IDs that are in the free list.\n\nI also changed the virtualhost part of the process tables to be a static string instead of a pointer.  The results of the pointer comparisons were often incorrect, resulting in the creation of multiple fastcgi classes for the same exact virtualhost and location."}, {"count": 1, "tags": [], "creator": "trawick@apache.org", "is_private": false, "text": "Hi John,  \n\nIt would be helpful if you can open separate bugs and provide separate patches for issues that can be solved separately from the primary bug you reported -- SIGKILL-ing active processes during graceful restart.\n\nAt a glance, issues that appear to be addressable separately appear to be\n\na) broken vhost pointer comparisons (is anything special required to trigger the problem?)\nb) trying to reap non-existent processes in the free list\n\n(maybe there is something else as well?)\n\nThanks a bunch!", "id": 134669, "time": "2010-02-18T18:50:47Z", "bug_id": 48769, "creation_time": "2010-02-18T18:50:47Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 48769, "is_private": false, "text": "No problem.  I'll split it up.", "id": 134670, "time": "2010-02-18T19:05:45Z", "creator": "jd@cpanel.net", "creation_time": "2010-02-18T19:05:45Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 48769, "is_private": false, "text": "BTW, a different fix has been committed (r939472) for the broken vhost pointer comparison issue.", "id": 136540, "time": "2010-04-29T16:52:27Z", "creator": "trawick@apache.org", "creation_time": "2010-04-29T16:52:27Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 48769, "is_private": false, "text": "Created attachment 28262\nSeparated graceful restart patch\n\nThis is against current mod_fcgid trunk, only parts related to graceful restart\nfrom John Lightsey's patch are included.", "id": 153421, "time": "2012-02-03T20:43:38Z", "creator": "lazy@iq.pl", "creation_time": "2012-02-03T20:43:38Z", "attachment_id": 28262}, {"count": 5, "tags": [], "creator": "stefan@priebe.ws", "is_private": false, "text": "Great, why is this one not upstream? Nobody wants killed processes on reload.", "id": 181911, "time": "2015-03-19T19:19:32Z", "bug_id": 48769, "creation_time": "2015-03-19T19:19:32Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 48769, "text": "*** Bug 59112 has been marked as a duplicate of this bug. ***", "id": 189117, "time": "2016-03-04T21:10:21Z", "creator": "apache-bugs.a2@x25.pl", "creation_time": "2016-03-04T21:10:21Z", "is_private": false, "attachment_id": null}, {"count": 7, "attachment_id": null, "bug_id": 48769, "text": "Yes, after 6+ years this bug is still at large. Not only that graceful restarts don't work with fastcgi php processes, fcgid actualy kills apache processes (like static object downloads that were not using php at all) with a graceful restart (only if at least 2 fcgid handers were running at the time of graceful restart) - major bug.\n\nI've tested https://bz.apache.org/bugzilla/attachment.cgi?id=28262 patch and it seems to fix that.", "id": 189118, "time": "2016-03-04T21:14:17Z", "creator": "apache-bugs.a2@x25.pl", "creation_time": "2016-03-04T21:14:17Z", "tags": [], "is_private": false}, {"count": 8, "tags": [], "bug_id": 48769, "is_private": false, "text": "Created attachment 34001\nRe-added #define FCGID_PM_MAX_SHUTDOWN_WAIT_ATTEMPTS to fcgid_pm_main.h", "id": 192076, "time": "2016-07-03T16:25:26Z", "creator": "damien.norris@gmail.com", "creation_time": "2016-07-03T16:25:26Z", "attachment_id": 34001}, {"count": 9, "tags": [], "bug_id": 48769, "attachment_id": null, "id": 192077, "time": "2016-07-03T16:26:07Z", "creator": "damien.norris@gmail.com", "creation_time": "2016-07-03T16:26:07Z", "is_private": false, "text": "Since Debian's migration to systemd, this bug has become much more prominent.  Logrotate jobs that run apachectl graceful several times in succession frequently get hung up, crashing the webserver in the middle of the night, requiring manual intervention (kilall -9 /usr/sbin/apache2 seems to do it, but only a SIGKILL can get rid of the stuck ones).\n\nThe separated restart patch from comment #4 (attachment 28262) did not work right away because it's missing the \"#define FCGID_PM_MAX_SHUTDOWN_WAIT_ATTEMPTS 30\" from the original patch.  I've attached one with that re-added that should apply cleanly and build.\n\nI am testing in the Debian libapache2-mod-fcgid package source to see if the problem is resolved.. unfortunately I haven't had much luck reproducing the problem except when it happens on production machines.  So I will load the patched mod_fcgid up there and see if my problem goes from happening several times a week to not at all, and report back."}]