[{"count": 0, "tags": [], "bug_id": 48762, "is_private": false, "text": "Hi,\nI have the following load testing set up:\n\nThread Group1\n    http Request Sampler\n        Timer -> delay timer (30 seconds0\n    Listener -> Summary Report\n    Listener -> View Result Tree\nThread Group2\n'\n'\n'\nThread Group125\n\nEach thread group contains one single http Request sampler to a RESTService\nEach http Request sampler has a delay timer attached as a child\nEach thread group also contains two listeners to capture the http response.\n\nCommand for http sampler:\n   GET\nPath value for http sampler:\n    /<Application_Name>/<client_name>/<user_name>/<action>\\&<startdate>\\&<enddate>\n       \\&<datatype>\n\nI choose 125 separate thread groups as each http request sends different user_name, startdate, enddate, and datatype. So, this way, I can capture the response for each request separately.\n\nWhen JMeter runs it creates 125 threads running concurrently, each thread running about twice a minute. The created threads send their request to the service which, in return spawns off its own threads, to access text indexed data.\n\nThe way I have set JMEter set up works very well if the start and enddate are very close together, only a small range of text indexes need to be accessed. If the date range increases to over one week then the thread response degradetes to where some threads hardly get the chance to run.\nAlso, I encounter the following error messages in JMeter's log file:\n    WARN  - jmeter.threads.JMeterThread: Interrupting: U8 Load Test 8-1 \n            sampler: GET Verbatims Text One Month Request \n    WARN  - jmeter.threads.JMeterThread: The delay timer was interrupted - \n            probably did not wait as long as intended. \n\nSorry if this is logged at the incorrect place if this issue deems not to be a bug.\n\nAny information on this is greatly appreciated.\n\nRoland", "id": 134619, "time": "2010-02-17T22:54:03Z", "creator": "roland_wettstein@jdpa.com", "creation_time": "2010-02-17T22:54:03Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 48762, "text": "This is not a bug; the log message is a warning.\n\nAlso, Bugzilla is not a support forum - please use the JMeter user mailing list.", "id": 134823, "time": "2010-02-23T16:44:04Z", "creator": "sebb@apache.org", "creation_time": "2010-02-23T16:44:04Z", "is_private": false, "attachment_id": null}]