[{"count": 0, "tags": [], "text": "The setup was:\n\nBlueCoat reverse proxy server --> HPUX 11.23, Apache v2.2.8, Tomcat 5.5 --> Oracle DB.\n\nBefore we upgraded to HPUX 11.23, Apache v2.2.8, Tomcat 5.5 in above setup, we used HPUX 11.11, Apache v2.0.59, Tomcat 5.5 with mod_ajp (mod_jk) no problem. The Apache on HPUX 11.11 has multiple virtual servers. I use two virtual servers to explain the problem. One virtual server strictly served local html static web pages. Another virtual server is Apache mod_jk redirected traffic to Tomcat AJP port. \nWe migrated to HPUX 11.23, Apache v2.2.8, Tomcat 5.5. After running for several days, Apache stopped to redirect traffic to Tomcat. Meanwhile the Apache virtual server served static html web pages no problem. We first thought the problem is on Tomcat, restarted Tomcat did not help. After restarted Apache, the problem fixed and it ran for several days then the problem happened again and needed to restart Apache again. I then downgraded Apache to v2.0.59 on HPUX 11.23 and the problem went away. The only change here is the Apache version and its httpd.conf file. I called HP support but no help. The latest version of Apache being compiled by HP is 2.2.8.\n\nThe new setup after above setup is:\n\nSolaris 10, Apache v2.2.14 reverse proxy --> HPUX 11.23, Apache v2.0.59, Tomcat 5.5 --> Oracle DB\n\nHere the change is replacing BlueCoat proxy to Solaris. HPUX server stays the same except Apache being downgraded as the problem described above.\n\nThe web pages from multiple virtual servers have user login pages from Tomcat. After users logged in to the web server, the server does not show the user has logged. After the user click F5 to refresh the web page, the web page shows the user is logged in. The same happened when the users logged out from the web servers. After downgraded Apache on Solaris reverse proxy from v2.2.14 to v2.0.59, the problem went away. The web page shows the user logged in correctly. The problem happens on all my web servers. \n\nOn HPUX 11.23 server, we use mod_ajp (mod_jk) to redirect traffic from Apache to Tomcat AJP which are on the same host.\nOn Solaris 10 Apache reverse proxy, we use mod_proxy, mod_proxy_http. \nThe traffic between HPUX with either front BlueCoat or Solaris is http. \nOn my Solaris proxy server, the proxypass and proxyreversepass of one of the virtualhost are:\n\n     ProxyPass /       http://www.loveisnotabuse.com/\n     ProxyPassReverse /        http://www.loveisnotabuse.com/\n\nThe Apaches used are compiled by either by HP or Internet although I could. The changes on Apache side are only httpd.conf or httpd-vhosts.conf.", "attachment_id": null, "id": 134908, "creator": "ruiyuan_jiang@liz.com", "time": "2010-02-25T21:00:05Z", "bug_id": 48819, "creation_time": "2010-02-25T21:00:05Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48819, "attachment_id": null, "id": 144961, "time": "2011-03-12T21:38:05Z", "creator": "covener@gmail.com", "creation_time": "2011-03-12T21:38:05Z", "is_private": false, "text": "Would minimally need to see logs and backtraces if mod_proxy stopped sending requests to tomcat."}]