[{"count": 0, "tags": [], "bug_id": 4881, "is_private": false, "id": 7925, "attachment_id": null, "creator": "c.siedentop@ndh.net", "creation_time": "2001-11-14T16:38:16Z", "time": "2001-11-14T16:38:16Z", "text": "Hello batik-team,\n\nfirst of all: the programms makes a lot of fun. I use it for my first steps \nwith svg (since 3 days). I found the following reproducible problem.\n\nWhat happened:\nI use the SvgViewer, load the textRotateShadows.svg from the samples and the  \ngraphic was rendered very well. Then I switched the solution of the screen from \n1024x768 (true-color) to 800x600 (true-color) and with that action the java \nruntime hangs up. (The windows task-manager say's \"no response\".)\n\nI tried this again and can't reproduce the effect. I tried it a third time and \nthe application died again. \nI had success (to reproduce the bug) when I opened two batik-application with \ndifferent sources and switched from 1024x768 to 800x600. \nI also was able, to let the SvgViewer hang up, when I switched from 800x600 to \n640x480. \n\nWith further investigations I could reproduce this misbehaviour often but not \nalwys. It does not depend on the kind of the loaded-svg source. (Therefore I \nopened two instances of batik, loaded the same svg-source and switched the\nscreen solution. Then only one window hangs up.)\n\nI opened two instances of batik with different svg-sources, switched the screen \nsolution and both instances hang up.\n\n\nHere are my system data:\n\nWindows NT4 with SP6, \nSUN JDK1.3.0rc2, \nBatik-1_1rc3, \nThe source was not zoomed.\n\n---\n\nThis is my first bug report in an open source project. I read the bug writing \nguidelines before and I hope the description is useful for the team.\n\nThank you for your work, much fun and good luck for finding bugs.\n\nCarsten"}, {"count": 1, "tags": [], "text": "Changing the screen resolution on Windows 2000 while Batik is running works.\nWe were not able to reproduce the problem.\n\nI don't know for windows NT.\nWe are using the jdk1.3.1\n\n", "attachment_id": null, "id": 8567, "creator": "tkormann@apache.org", "time": "2001-12-04T04:28:09Z", "bug_id": 4881, "creation_time": "2001-12-04T04:28:09Z", "is_private": false}]