[{"count": 0, "tags": [], "bug_id": 48818, "attachment_id": null, "id": 134905, "time": "2010-02-25T19:57:55Z", "creator": "opensource@kestle.net", "creation_time": "2010-02-25T19:57:55Z", "is_private": false, "text": "Request.doGetSession() has all sorts of areas it returns null even though the api docs state:\n\n\"Returns the current session associated with this request, or if the request does not have a session, creates one.\"\n\nSince we expect something that's not null, we're getting NPE's in our testing, which exposes a risk that all our production sites may do the same.\n\nThere is not so much as a warn log to indicate when this violation occurs.  If it's a request that can't be serviced, then throw an exception. \n\nAlternatively, return a \"null\" session implementation that is empty.  Better would be have configuration between the two (since the null session would just defer the NPE in many situations)."}, {"count": 1, "tags": [], "bug_id": 48818, "attachment_id": null, "id": 134907, "time": "2010-02-25T20:02:20Z", "creator": "opensource@kestle.net", "creation_time": "2010-02-25T20:02:20Z", "is_private": false, "text": "It may be worth noting that this is happening when calling from jsp on a page that has required a login (using stripes)"}, {"count": 2, "tags": [], "bug_id": 48818, "text": "By any chance does the JSP use <%@ page session=\"false\" %>\n\nHow, exactly, are you referencing the session within the JSP? Seems like it would have been better to start a discussion on the users list...", "id": 134911, "time": "2010-02-26T01:04:19Z", "creator": "kschneider@gmail.com", "creation_time": "2010-02-26T01:04:19Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 48818, "attachment_id": null, "id": 134949, "time": "2010-02-28T20:03:39Z", "creator": "opensource@kestle.net", "creation_time": "2010-02-28T20:03:39Z", "is_private": false, "text": "(In reply to comment #2)\n> By any chance does the JSP use <%@ page session=\"false\" %>\n> \n> How, exactly, are you referencing the session within the JSP? Seems like it\n> would have been better to start a discussion on the users list...\n\nNo - definitely uses sessions - the session is retrieved by:\n\n<%=new WorkflowClientState(request.getSession()).get...()...%>\n\nThe call to getSession() just defers what could be a session creation exception to a NPE.\n\nThe issue is threefold:\n\n* A session should already exist (although I will enforce a login/session creation and see how that goes)\n* This has been in production for over a year (and has recently been noted to have this error occasionally (< 1 per week)\n* The Request API is violated by returning null."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "The cases in which null will be returned are:\n1. no context associated with the request\n2. no manager associated with the context\n3. no response associated with the request\n4. the manager returns null for Manager.createSession()\n\n4. should never happen and will throw an NPE in the Manager if it does\n1., 2., & 3. should not be possible unless the request is accessed after it is recycled which would indicate an application bug (we do see this from time to time - apps storing references to the request object and using them after request processing has finished)\n\nIn terms of returning null, the spec is silent on how session generation errors should be handled. If an exception were thrown, you could equally argue that the spec does not allow for any exceptions to be thrown.\n\nA code review has not identified any code paths that would cause a null to returned unless some other error has occurred first. Absent an explanation or a reproducible test case, I am going to assume that the root cause of the NPEs is an application bug.\n\nThe cases where null is returned seem reasonable to me given the lack of direction provided by the specification.\n\nI am therefore resolving this as WONTFIX.", "id": 135572, "time": "2010-03-24T00:24:41Z", "bug_id": 48818, "creation_time": "2010-03-24T00:24:41Z", "is_private": false}]