[{"count": 0, "tags": [], "bug_id": 48829, "attachment_id": null, "is_private": false, "id": 134959, "time": "2010-03-01T04:49:51Z", "creator": "andrew@eisenberg.as", "creation_time": "2010-03-01T04:49:51Z", "text": "The javac task explicitly filters from the compiler all files that do not end in *.java.\n\nThis is a problem for CompilerAdapters classes that can compile more than just Java, for example compiler adapters for Groovy or AspectJ.  As an example of where this is important, Eclipse's pde build will soon support custom compiler adapters to be specified and we have just written one for AspectJ (and will soon do one for Groovy):\n\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id=303960\n\nI propose that the Javac task accept a new attribute such as sourceFileExtensions that can take a comma separated list of source file extensions (eg- \"*.java,*.aj,*.groovy\").  And these are the source file extensions accepted by the Javac task.\n\nAn example is something like this:\n\n<javac destdir=\"dest\" compiler=\"org.eclipse.ajdt.core.ant.AJDT_AjcCompilerAdapter\" sourceFileExtensions=\"*.java,*.aj\">\n...\n\nAnd if the sourceFileExtensions attribute is not used, then the default is *.java (ie- the current behavior).\n\nI believe that this is a fairly small fix to the javac task and if you think this is a reasonable proposal, I can probably submit a patch.\n\nthanks."}, {"count": 1, "tags": [], "bug_id": 48829, "attachment_id": null, "id": 134968, "creation_time": "2010-03-01T14:05:35Z", "time": "2010-03-01T14:05:35Z", "creator": "antoine@apache.org", "text": "Hello Andrew,\n\nthe Eclipse/AspectJ project supplies ant tasks too.\n\nsee http://www.eclipse.org/aspectj/doc/released/devguide/antTasks.html\n\nThe AspectJ compiler task compiles both java and aspects.\n\nDo you think that there is scope to do things differently/better in Ant ?\n\n\n\nAntoine", "is_private": false}, {"count": 2, "tags": [], "creator": "andrew@eisenberg.as", "attachment_id": null, "text": "There are several reasons why the iajc task is not sufficient.\n\n1. Eclipse PDE builds do not allow the use of the iajc task, only the javac task.  This kind of change would allow us to compile aspectj code using the javac task.  Moreover, this change would allow any language that compiles to java byte code to be compiled using PDE.\n\n2. The ajc ant task is largely a copy of the javac ant task and so providing this functionality would make this copied code largely irrelevant.\n\n3. There is the possibility to handle extensible Java compilers.  For example, groovy-eclipse ships with an extended JDT compiler that also handles groovy code.  The fix proposed in this bug would allow javac to handle this compiler as a compiler adapter without the need for a custom ant task.\n\n4. This change would allow new compilers for JVM languages to take advantage of the full power of the javac task when used with ant, while only implementing a minimal amount of code.\n\n5. More generally, it seems arbitrary to me that javac would only accept .java files when there is a proliferation of compilers that produce java byte code from non-Java code.", "id": 134976, "time": "2010-03-01T16:57:56Z", "bug_id": 48829, "creation_time": "2010-03-01T16:57:56Z", "is_private": false}, {"count": 3, "tags": [], "text": "Think its more something the compiler adapter should provide; a list of filetypes it likes", "is_private": false, "bug_id": 48829, "id": 134998, "time": "2010-03-02T13:20:57Z", "creator": "stevel@apache.org", "creation_time": "2010-03-02T13:20:57Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 48829, "attachment_id": null, "id": 135007, "time": "2010-03-02T18:23:15Z", "creator": "andrew@eisenberg.as", "creation_time": "2010-03-02T18:23:15Z", "is_private": false, "text": "(In reply to comment #3)\n> Think its more something the compiler adapter should provide; a list of\n> filetypes it likes\n\nThat sounds like a reasonable way to go, but that would imply changing the CompilerAdapter interface to require an extra method, something like:\n\n    String[] getSupportedFileExtensions();\n\nThe problem here is that adding this would break backwards compatibility for all those implementors that do not implement DefaultCompilerAdapter.  Suggestions around this problem are welcome."}, {"count": 5, "tags": [], "bug_id": 48829, "attachment_id": 25824, "id": 138800, "creation_time": "2010-08-01T18:55:15Z", "time": "2010-08-01T18:55:15Z", "creator": "andrew@eisenberg.as", "text": "Created attachment 25824\nFirst attempt at a patch\n\nHere is a first attempt at a patch.  As described above, I created a CompilerAdapterExtension interface and made the DefaultCompilerAdapter implement it.  \n\nI have not tested this yet and the patch is still a little rough (eg- no tests and little documentation).  I am only submitting this right now to see if this is a kind of solution that you would accept.", "is_private": false}, {"count": 6, "tags": [], "bug_id": 48829, "attachment_id": null, "is_private": false, "id": 138976, "time": "2010-08-07T18:24:54Z", "creator": "andrew@eisenberg.as", "creation_time": "2010-08-07T18:24:54Z", "text": "Just wondering if there is anyone around who can comment on this patch as to whether or not it is appropriate for the next release."}, {"count": 7, "tags": [], "bug_id": 48829, "attachment_id": null, "id": 142129, "time": "2010-11-29T11:29:51Z", "creator": "bodewig@apache.org", "creation_time": "2010-11-29T11:29:51Z", "is_private": false, "text": "I've committed your code with some formatting changes as svn revisions 1040170 ,\nsvn revision 1040171 and svn revision 1040173\n\nI've also removed your @author tag from CompilerAdapterExtension since we have a\nno @author tag policy inside Ant.  Let me know if this is a problem for you.\n\nThank you for your persistence and the nagging."}, {"count": 8, "tags": [], "text": "and svn revision 1040174 after I finally saved all my Emacs buffers.", "is_private": false, "id": 142130, "creator": "bodewig@apache.org", "time": "2010-11-29T11:30:55Z", "bug_id": 48829, "creation_time": "2010-11-29T11:30:55Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 48829, "attachment_id": null, "id": 142132, "time": "2010-11-29T11:35:18Z", "creator": "andrew@eisenberg.as", "creation_time": "2010-11-29T11:35:18Z", "is_private": false, "text": "Much appreciated...thanks."}]