[{"count": 0, "tags": [], "bug_id": 48847, "attachment_id": null, "id": 135012, "time": "2010-03-03T09:50:54Z", "creator": "michal.bunarowski@comarch.com", "creation_time": "2010-03-03T09:50:54Z", "is_private": false, "text": "Project set-up:\n- Tomcat 6.0.13 + Weblogic 10.0\n- wlfullclient.jar is placed in <TOMCAT_HOME>\\lib.\n- two web apps are deployed on Tomcat (WebApp1 & WebApp2). The wep apps don't share any libraries except wlfullclient.jar.\n- both web apps are subscribed to weblogic JMS topic.\n\nBug scenario:\n1. a message is generated in the weblogic JMS topic\n2. both web apps retrieve the message\n3. logic that handles the message in WepApp2 operates on a certain class that belongs to WebApp2 (let's call the class \"XXX\" for convenience). Namely, the logic contains casting: \nObject xxxObject = someJndiLookup();\nXXX someVariable = (XXX) xxxObject;\n4. Casting results in ClassCastException. Debugging shows that xxxObject is an object of the XXX class and its loaded by WebLogic GenericClassLoader. And the object is cast to the XXX class loaded by WebApp2ClassLoader.\n\nReason:\nAt the application startup, WebLogic GenericClassLoader (that is provided within wlfullclient.jar) is loaded and it sets WepApp1ClassLoader as its parent (!).\nXXX class is a part of WepApp2 and obviously is loaded by WepApp2ClassLoader.\n\nWhen Weblogic JMS message comes up, GenericClassLoader has to deal with an object of the XXX class. According to the Tomcat classloaders delegation model GenericClassLoader first asks its parent whether the parent knows XXX. \nBut - surprise! - the parent of GenericClassLoader is WepApp1ClassLoader. \nObviously WepApp1ClassLoader does not know this class, since it belongs to WebApp2. That's why GenericClassLoader decides to load the class itself.\n\nAs a result there are multiple copies of the same class."}, {"count": 1, "tags": [], "bug_id": 48847, "text": "This isn't a Tomcat bug so it doesn't belong in Bugzilla.\n\nThere are probably a couple of ways around this. The Tomcat users list can help with this.", "id": 135024, "time": "2010-03-03T18:17:41Z", "creator": "markt@apache.org", "creation_time": "2010-03-03T18:17:41Z", "is_private": false, "attachment_id": null}]