[{"count": 0, "tags": [], "bug_id": 48856, "attachment_id": 25082, "text": "Created attachment 25082\nExample drawing to reproduce the error\n\nI am using fonts with blanks in their names when creating drawings, for instance the font \"Frutiger LT 45 Light\" (I am using Inkscape to create my drawings). Opening such a document with Squiggle or another tool using the library causes a svg error.", "id": 135042, "time": "2010-03-04T11:47:02Z", "creator": "axel.brinkop@gmx.de", "creation_time": "2010-03-04T11:47:02Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48856, "text": "The actual displayed error is:\n  The \"font-family\" property does not support integer values.\nThis hints towards Batik trying to parse each of the tokens which constitute the font name independently, instead of taking the whole expression. :-|\n\nAccording to my tests (from a while ago), having multi-word font names without any delimiters should be the proper way of declaring multiple word fonts (or, at least, handled gracefully) due to a few reasons:\n * An example [1] hints towards not surrounding names with delimiters;\n * ASV (Adobe SVG Viewer) doesn't support apostrophe (');\n * Opera complains if quote (&quot;) is used.\n\nNote that bug 47800 already exists to track issues with vendor-specific properties (such as \"-inkscape-font-specification\", which are also embedded in the file), which is also somehow related. By surrounding the font family with apostrophes, nothing unexpected happened, though (i.e., the file is parsed without any errors)... :-)\n\nFor now, I'm only slightly decreasing importance as this can be somehow easily worked around.\n\nThanks for the report! ;-)\n\n[1] http://www.w3.org/Style/Examples/007/fonts#font-family", "id": 135129, "time": "2010-03-06T21:46:32Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2010-03-06T21:46:32Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 48856, "text": "CSS 2.1 http://www.w3.org/TR/CSS21/fonts.html#font-family-prop doesn't provide an exact grammar to be used for parsing font-family values, but I think unquoted numbers should be accepted.  At least, that's what I think the description in the above URL implies.\n\nTo fix this I think the org.apache.batik.css.engine.value.css2.FontFamilyManager.createValue() method needs to be changed to allow more than just SAC_STRING_VALUE and SAC_IDENT in the loop.  (Basically, it would parse anything excep a comma, semicolon, parenthesis or brace.)", "id": 135130, "time": "2010-03-06T23:20:19Z", "creator": "cam@apache.org", "creation_time": "2010-03-06T23:20:19Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 48856, "text": "Following the resolution given to bug 44828, this is being marked as \"duplicate\" of bug 49968. Again, this maybe should depend on that issue but this is being mostly done for consistency with the previous action.\n\n*** This bug has been marked as a duplicate of bug 49968 ***", "count": 3, "id": 140450, "time": "2010-10-04T11:52:29Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2010-10-04T11:52:29Z", "is_private": false}]