[{"count": 0, "tags": [], "bug_id": 48872, "text": "Created attachment 25104\nNotes, code examples, and sample data.\n\nI'm working on a project where I try to take an Excel 97 or an Excel 07 file and export it as a CSV file using Java code. For testing, we use Excel's save as CSV converter. I have noted many discrepancies and have provided some corrections/additions/and hacks to address them. I would like to share my findings with someone here so that someone who is willing and able can merge them properly into the POI project.\n\n\n\nDateUtil issue\n1. The method isADateFormat does not know how to handle quoted values, for example mm\"/\"dd\"/\"yyyy.\n\n\nDataFormatter issues\n\n2. Format strings for zero values are not properly handled. They should use the third component (delimited by ;) if available.\n\n3. Color checking is too simple - it removes all text in [] when it should probably limit itself to the color words. This has an effect if trying to implement elapsed time [h], [m], and [s].\n\n4. Some stupid date formats are not handled by the createFormat method:\na. m\\\\/d\\\\/yyyy \nb. mm\"/\"dd\"/\"yyyy\n\n5. Elapsed time processing is missing.\n\n6. It appears that _( and _) processing does not match with Excel. Trying to format using built in formats does not work as  expected when _( and _) are corrected. (In other words, the built in format Strings have to be modified too)\n\n7. * padding is not working as expected.\n\n8. Fractions are not being processed, and I've tried and it's really ugly to implement the same as Excel, but they could be replaced with spaces instead of left as ?.\n\n9. If the resulting format does not contain any # or 0, then the number still gets appended to the format string. This happens most often when trying to print a 0 value using a third position format - many formats just print - or blank. and never \"-0\".\n\n10. Excel appears to use half_up rounding scheme, and not the DecimalFormat default.\n\n11. formatRawCellContents needs a way to send it the 1904 windowing parameter.\n\n12. An invalid date in Excel processing should be returned as 255 #s (when doing CSV conversion).\n\n\n\nAttached items:\nShareable Notes.txt\nHas some of these notes with a little more wording and some cut/paste code examples.\n\nNcoDataFormatter.java\nis my example of this DataFormatter class coded with my hacks. It should be used as a reference.\n\nAll Excel Formats.xls\nAn Excel 97 workbook containing 1 example of all formats available under \"custom\" option. This is just a sampling, because I know more can be generated if I go into individual options.\n\nAll Excel Formats.csv\nThe above file saved as a CSV.\n\nAll Excel Formats.xlsx\nThe above file saved as a 2007 Excel.\n\nAll Excel Formats.0.csv\nMy program's output from processing the XLS or XLSX file.\nI custom formatted dates to show 4 digit years and 2 digit hours, etc.\nThe discrepancies are:\n\tThere's no 1/0/1900 date but instead 12/31/1899.\n\tExponent processing just doesn't work the same way - Java doesn't round digits after decimal.\n\tFractions... I tried using BigFraction class, but pulled it out from this release - Excel is weird - it rounds down except when it gets close to next whole number.", "id": 135172, "attachment_id": 25104, "creator": "robert_kish@yahoo.com", "creation_time": "2010-03-08T20:47:37Z", "time": "2010-03-08T20:47:37Z", "is_private": false}, {"count": 1, "text": "Thanks for all the helpful investigations and explanations in your bug report and attached notes\n\nI've added several new features to DataFormatter inspired by your work\n\nI believe that almost everything you mentioned is now properly supported, except for two bits. Firstly the padding / whitespace bit, which should now be properly ignored (because we don't know about the fonts of column widths, I didn't think we could really do anything else). Secondly fractions still need support, probably via lazy loading of commons math if available.\n\nIf you take a look at src/testcases/org/apache/poi/ss/usermodel/TestDataFormatter.java you should see tests for much of the new support\n\nIf you spot anything that we're still not doing correctly, please do open a new bug to report it. If possible, please also upload a failing unit test (probably a new test method of TestDataFormatter.java), so we've got something to test against!", "creator": "apache@gagravarr.org", "is_private": false, "id": 137247, "time": "2010-06-01T11:33:21Z", "bug_id": 48872, "creation_time": "2010-06-01T11:33:21Z", "tags": [], "attachment_id": null}]