[{"count": 0, "tags": [], "bug_id": 48918, "attachment_id": null, "is_private": false, "id": 135365, "time": "2010-03-15T19:02:40Z", "creator": "leighton@cis.udel.edu", "creation_time": "2010-03-15T19:02:40Z", "text": "APR has supported using SCTP socket for many years, but it does not support access to the many features of SCTP.  I am proposing to add support for sctp_sendmsg() and sctp_recvmsg(), as well as methods to get and set the many SCTP socket options that are not simply on/off options."}, {"count": 1, "tags": [], "bug_id": 48918, "attachment_id": 25133, "id": 135367, "time": "2010-03-15T19:15:12Z", "creator": "leighton@cis.udel.edu", "creation_time": "2010-03-15T19:15:12Z", "is_private": false, "text": "Created attachment 25133\nSupport for additional SCTP functionality \n\nI've attached a patch that adds the following new functions:\n\napr_socket_sctp_sendmsg()\napr_socket_sctp_recvmsg()\napr_socket_opt_set_sctp()\napr_socket_opt_get_sctp()\n\nThe patch also adds support for the SCTP on/off socket option SCTP_USE_EXT_RCVINFO, and adds SCTP socket test code to several files in the test directory, as well as adding an additional file called testsockopt_sctp.c."}, {"count": 2, "tags": [], "bug_id": 48918, "attachment_id": null, "text": "The bigger picture with this effort is to add SCTP streams support into Apache's APR and httpd server. \n\nThe current HTTP over SCTP design (http://tools.ietf.org/html/draft-natarajan-http-over-sctp-01) exploits SCTP streams to avoid head-of-line blocking. SCTP (RFC 4960) also offers other services unavailable in TCP such as unordered delivery, partially reliable transmission, message based transfer, multihoming support, more\nsecure connection establishment with a cookie mechanism and so on. \n\nOur empirical study has shown that HTTP over SCTP streams improves HTTP response times, and created a lot of interest at IETF's http-bis WG.\n\nJon Leighton (who submitted this patch) has been working with mozilla to get HTTP/SCTP into Firefox and NSPR's source repositories (https://bugzilla.mozilla.org/show_bug.cgi?id=486199). Our hope is to do something similar with APR and httpd. \n\nWe'd appreciate any comments/suggestions on the patch. Thanks!", "id": 135455, "time": "2010-03-19T00:16:58Z", "creator": "preethi.cis@gmail.com", "creation_time": "2010-03-19T00:16:58Z", "is_private": false}, {"count": 3, "text": "Extending support beyond just Mac OS X and FreeBSD might increase interest.  According to Wikipedia, Linux, AIX, HP-UX, and Solaris all support SCTP, and others; any reason not to include them?", "bug_id": 48918, "attachment_id": null, "id": 135467, "time": "2010-03-19T14:16:44Z", "creator": "poirier@pobox.com", "creation_time": "2010-03-19T14:16:44Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 48918, "text": "(In reply to comment #3)\n> Extending support beyond just Mac OS X and FreeBSD might increase interest. \n> According to Wikipedia, Linux, AIX, HP-UX, and Solaris all support SCTP, and\n> others; any reason not to include them?\n\nThe patch should support FreeBSD, Mac OS X, Linux, Solaris and Open Solaris, though I haven't yet tested it on either Solaris or OpenSolaris.  If you have trouble getting the patch to work on any of those systems I would like to know about it.  AIX and HP-UX are more of a problem because they are proprietary and not widely available (in the same way and Mac OS X and Windows are).  I would be very interested in hearing from anyone that has access to either AIX or HP-UX and is willing to test out the patch.  I'm guessing you concluded that the patch only supported FreeBSD and Mac OS X because my modifications to configure.in explicity check for those two OSes.  The OS check is there because only the FreeBSD and Mac OS X implementations of SCTP currently support the SCTP_USE_SCTP_RCVINFO socket option.\n\n- Jon", "id": 135475, "time": "2010-03-19T15:27:07Z", "creator": "leighton@cis.udel.edu", "creation_time": "2010-03-19T15:27:07Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 48918, "attachment_id": null, "text": "Hello, \n\nWondering if our patch worked on Linux and other platforms. We'd really appreciate any feedback/comments on the patch. Thanks!", "id": 136509, "time": "2010-04-28T20:35:34Z", "creator": "preethi.cis@gmail.com", "creation_time": "2010-04-28T20:35:34Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 48918, "text": "I've updated the patch and would very much appreciate any feedback.  The patch has been tested on recent versions of FreeBSD, Linux, Mac OS X, Solaris, Solaris Express, and Windows XP.  I'm now working on updating this from 1.4.5 to trunk and will then add support for more recent versions of Windows.\n\nThe patch is broken into three files:\napr-1.4.5_sctp_main.patch - adds support for non-Windows platforms\napr-1.4.5_sctp_win32.patch - adds support for Windows XP (requires main)\napr_1.4.5_sctp_test.patch - adds support for tests on all platforms (requires main and win32)\n\nSupport for SCTP on Mac OS X requires installing the SCTP network kernel extension from http://sctp.fh-muenster.de/sctp-nke.html\n\nSupport for SCTP on Windows requires installing the SCTP driver and library from http://www.bluestop.org/SctpDrv\n\nAll other platforms have native support for SCTP.", "id": 151901, "time": "2011-12-01T19:12:33Z", "creator": "leighton@cis.udel.edu", "creation_time": "2011-12-01T19:12:33Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 48918, "attachment_id": 28014, "is_private": false, "id": 151902, "time": "2011-12-01T19:13:47Z", "creator": "leighton@cis.udel.edu", "creation_time": "2011-12-01T19:13:47Z", "text": "Created attachment 28014\nadds support for non-Windows platforms"}, {"count": 8, "tags": [], "bug_id": 48918, "attachment_id": 28015, "is_private": false, "id": 151903, "time": "2011-12-01T19:14:40Z", "creator": "leighton@cis.udel.edu", "creation_time": "2011-12-01T19:14:40Z", "text": "Created attachment 28015\nadds support for Windows XP (requires main)"}, {"count": 9, "tags": [], "bug_id": 48918, "attachment_id": 28016, "id": 151904, "time": "2011-12-01T19:15:42Z", "creator": "leighton@cis.udel.edu", "creation_time": "2011-12-01T19:15:42Z", "is_private": false, "text": "Created attachment 28016\nadds support for SCTP tests on all platforms"}]