[{"count": 0, "tags": [], "bug_id": 48916, "text": "Created attachment 25129\nExample code to illustrate the problem\n\nUsing the attached Java and PPTs, the copied text in the output PPT has font.color of white, even though the original is black and efforts are made to make the color black.\n\nThis seems to be specific to the version of PowerPoint used to make the slides, which is my customer's domain.  I can make PPTs in OpenOffice that do not show this problem.\n\nAlso, and this can be separated out into another bug if appropriate, when setting the font.color of RichTextRuns in a slides MasterSlide I get a NPE.  This is also in the example code.", "id": 135358, "time": "2010-03-15T17:55:26Z", "creator": "jeffrey.l.lavezzo@saic.com", "creation_time": "2010-03-15T17:55:26Z", "is_private": false, "attachment_id": 25129}, {"count": 1, "tags": [], "bug_id": 48916, "text": "Created attachment 25130\nThe 'template' PPT file for use with the example code", "id": 135359, "time": "2010-03-15T17:56:20Z", "creator": "jeffrey.l.lavezzo@saic.com", "creation_time": "2010-03-15T17:56:20Z", "is_private": false, "attachment_id": 25130}, {"count": 2, "tags": [], "bug_id": 48916, "text": "Created attachment 25131\nThe 'merge' PPT to use with the example code.", "id": 135360, "time": "2010-03-15T17:57:10Z", "creator": "jeffrey.l.lavezzo@saic.com", "creation_time": "2010-03-15T17:57:10Z", "is_private": false, "attachment_id": 25131}, {"count": 3, "tags": [], "bug_id": 48916, "attachment_id": null, "text": "The problem should be fixed in r930525\n\nThe Invalid Color issue was caused by improper caching of decoded ppt records. \nTwo objects (TextShape and EscherTextboxWrapper) cached different instances of the same logical records which resulted in incorrect text colors in the resulting ppt. \n\nThe NPE was caused by null parent in parent-aware records. Propagation of parent to parent-aware descendants is automatic, it happens when constructing SlideShow. Your bug helped to discover a special case which was not covered.\n\nRegards,\nYegor", "id": 135864, "time": "2010-04-03T15:09:50Z", "creator": "yegor@dinom.ru", "creation_time": "2010-04-03T15:09:50Z", "is_private": false}]