[{"count": 0, "tags": [], "text": "This is related to bug 48763.\n\n\nWe are experiencing intermittent timeouts of POST requests with transfer-encoding: chunked.\n\nThese failures occur very frequently after IIS has shutdown ISAPI_Redirect because of a period of inactivity. The next request triggers IIS to restart the redirector, and that request and several more that queue up behind it fail. JK puts the worker in error state. Eventually, the failure gets back to the client.\n\n\nI've done some tracing and this is what I see:\n\n- The requests that fail do arrive at the Tomcat. Tomcat times out trying to read the post body.\n\n- The failing AJP request messages from ISAPI both a positive content-length and \"transfer-encoding: chunked\". Ordinary requests don't have the c-l.\n\n\nMy guess is,\n\n 1) If IIS is able to receive and assemble the chunked body before JK asks for it, IIS reports the actual size instead of -1.\n\n 2) This possibly occurs while ISAPI_Redirect is reinitializing because there is time for IIS to build the body before JK needs it.\n\n 3) When this occurs, the JK end of the APR connection waits for a get-body-chunk message. The Tomcat APR sees the positive c-l and waits for the free body chunk that non t-e requests send.", "attachment_id": null, "id": 135444, "creator": "bgstewart@covad.net", "time": "2010-03-18T20:22:54Z", "bug_id": 48940, "creation_time": "2010-03-18T20:22:54Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48940, "is_private": false, "text": "er, where I wrote APR, please read AJP.\n\nIt's been a long day.", "id": 135449, "time": "2010-03-18T21:50:34Z", "creator": "bgstewart@covad.net", "creation_time": "2010-03-18T21:50:34Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "I think this has the same root cause as bug 50975, and I think the behaviour is as Bruce suggests.\nIt looks like IIS is adding a CONTENT_LENGTH server variable, where there was no Content-Length in the original request under some conditions (my guess is when the entire request is able to be decoded into the available buffer).\n\nThe fix will be to mask the synthetic CONTENT_LENGTH out when Transfer-Encoding: chunked is present in the request.", "is_private": false, "id": 145682, "creator": "timw@apache.org", "time": "2011-04-10T16:48:54Z", "bug_id": 48940, "creation_time": "2011-04-10T16:48:54Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "\n\n*** This bug has been marked as a duplicate of bug 50975 ***", "attachment_id": null, "bug_id": 48940, "id": 145687, "time": "2011-04-11T04:17:53Z", "creator": "timw@apache.org", "creation_time": "2011-04-11T04:17:53Z", "is_private": false}]