[{"text": "Hi all,\n\nThis issue is probably related to the bug #40860.\n\nI have a webapp with lots of servlets.\n\nWhen I try to heavy load my webapp, sometimes the request.getParameter() function returns null values, meaning that the request object has not correctly parsed the HTTP request.\n\nI ran Tomcat in eclipse in debug mode, and then I noticed that when the issue occurs, the request object has not been recycled. That's probably why all my HTTP parameters are lost.\n\nWhen I encounter such cases, all my next Tomcat calls (JSP and servlets from all webapps) may be impacted and may received a non recycled request object. But the issue is not so frequent.\n\nI have created a JMeter script in order to reproduced the issue. And I call only a very simple JSP (that only output the input parameters), the problem isnot reproductible. But if I mix the JSP call with call to my webapp servlets, I manage to reproduce the issue relatively easily.\n\nDo you have any suggestion about the reason of such a behavior? Maybe I do something wrong in my servlets that could cause the non recycling of request  objects?\n\nUnfortunately I haven't a good testcase in order to reproduce the issue. The ony thing I can tell is that it appears in case of heavy load.", "tags": [], "bug_id": 48959, "attachment_id": null, "count": 0, "id": 135534, "time": "2010-03-22T16:36:46Z", "creator": "fabienb@convertigo.com", "creation_time": "2010-03-22T16:36:46Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 48959, "attachment_id": null, "id": 135537, "time": "2010-03-22T16:53:05Z", "creator": "markt@apache.org", "creation_time": "2010-03-22T16:53:05Z", "is_private": false, "text": "Bugzilla is not a support forum. This looks like an application issue that is best raised on the users mailing list."}, {"count": 2, "attachment_id": null, "creator": "fabienb@convertigo.com", "text": "I don't think it is an application issue: if it was, could you explain me why the internal objects of Tomcat are impacted? (it works well with other webapp servers such as WebSphere)\n\nThat's why I decided to post this issue in Bugzilla. After having browsed a lot of forums about Tomcat and googled a lot about this issue, I didn't find any solution to my problem. Maybe I am wrong, but I think it is a Tomcat issue, and that's why I try to get help from you.", "id": 135538, "time": "2010-03-22T17:04:36Z", "bug_id": 48959, "creation_time": "2010-03-22T17:04:36Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "knst.kolinko@gmail.com", "is_private": false, "count": 3, "id": 135548, "time": "2010-03-23T07:34:07Z", "bug_id": 48959, "creation_time": "2010-03-23T07:34:07Z", "text": "1. Unless there is a reproduction script or in-depth analysis and explanation, the developers cannot do much. We cannot tell much about an issue that we do not observe.\n2. There were several threads about observing non-recycled objects on users@ in the last 6 months and more. AFAIR, all caused by application issues.\n\nhttp://marc.info/?l=tomcat-user&m=126695154719938&w=2\nhttp://marc.info/?l=tomcat-user&m=126692685813593&w=2\n\n> when the issue occurs, the request object has not been recycled\n\nYou will need to explain, what you do mean by \"not recycled\" in the above.\n\n3. You did not tell us much about your configuration.\n4. There were a lot of fixes between 6.0.20 that you are running and 6.0.24/6.0.26 releases.\n\n5. As far as you need help debugging, please use the users@ list. There are more people there, than on dev@ where the bugzilla mail is sent.\n6. Fell free to reopen this issue, when enough details to reproduce it are available."}]