[{"count": 0, "attachment_id": 25165, "bug_id": 48961, "is_private": false, "id": 135536, "time": "2010-03-22T16:49:33Z", "creator": "christoph.grothaus@isr.de", "creation_time": "2010-03-22T16:49:33Z", "tags": [], "text": "Created attachment 25165\nAnt and Ant-Contrib Performance Leak debugging script\n\nThere is a regression from Ant 1.7.1 to Ant 1.8.0 regarding performance. The Ant-Contrib \"variable\" task has slowed down significantly with the new Ant version. I wrote a little demonstration script, see the attached file \"AntDebug.zip\".\n\nThe story goes as this: I have a for loop (also from Ant-Contrib), that loops over a path-like structure. Inside the for loop I use the \"variable\" task from Ant-Contrib (<var name=\"testvar\" value=\"...\" />) to append a string (built of the iteration element) to a variable. So this variable grows with each iteration.\n\nI assume this is a pure in-memory operation. With Ant 1.7.1, it is blazing fast, as you could expect. With Ant 1.8.0, the performance is worse. Moreover, each single iteration is a bit slower than the previous one, so in total the performance degrades exponentially in the number of elements. You can also observe that it takes longer if the iteration elements are longer strings.\n\nIf you comment out the \"variable\" task, the for loop runs equally fast with both Ant versions.\n\nYou can play around with the attached demonstration script. On my machine, it takes 8 seconds if the basedir is /tmp/AntDebug, and 16 seconds if the basedir is somewhere much deeper in the filesystem. With Ant 1.7.1, in both locations it takes 0 seconds (I think it's somewhat below 500ms, which in turn is rounded down).\n\nAlso see the companion mail thread on the ant-user mailing list: http://mail-archives.apache.org/mod_mbox/ant-user/201003.mbox/%3COF85426667.E1376D33-ONC12576EE.003DDF91-C12576EE.003F6402@isr.de%3E"}, {"count": 1, "tags": [], "bug_id": 48961, "attachment_id": null, "id": 135993, "time": "2010-04-09T15:16:42Z", "creator": "mbenson@apache.org", "creation_time": "2010-04-09T15:16:42Z", "is_private": false, "text": "I have just committed a change to PropertyHelper to use a different approach than the costly indexOf check.  It may address the noted performance degradation:\n\nCommitted revision 932456."}, {"count": 2, "tags": [], "bug_id": 48961, "attachment_id": null, "id": 136032, "time": "2010-04-12T04:52:16Z", "creator": "christoph.grothaus@isr.de", "creation_time": "2010-04-12T04:52:16Z", "is_private": false, "text": "(In reply to comment #1)\nHello Matt,\n\nI just checked out the latest Ant sources from SVN, built them, and ran my test against this build. Your fix did it, now the ant script runs fast again! In my opinion this bug is resolved.\n\nThank you.\nChristoph"}, {"count": 3, "tags": [], "bug_id": 48961, "attachment_id": null, "id": 136040, "time": "2010-04-12T06:14:58Z", "creator": "bodewig@apache.org", "creation_time": "2010-04-12T06:14:58Z", "is_private": false, "text": "Thanks for testing"}]