[{"count": 0, "tags": [], "text": "I have an existing XLS file from a customer with VLOOKUP-Formulas referencing a separate sheet.\n\nI can read the cached values using\nvalue = cell.getStringCellValue();\n\nwhere cell contains a formula =VLOOKUP(.... - for example:\n=VLOOKUP($D3;$Entity.$A$1:$B$1048576;2;FALSE())\n\n(I am not going to re-evaluate the value because references can be also to a separate file I didn't get from the customer.)\n\nSo far so good - looks fine. Now the thing is, that I am on Linux (Ubuntu 9.10) and there are a few invalid (invalid in they way that they contain data I don't want to process) lines and I just deleted them using Open Office Calc v3.1.1 build 9420.\n\nAfter I saved the file with Open Office all columns containing a VLOOKUP-formula throw an IllegalStateException when I try to call\n\nvalue = cell.getStringCellValue();\n\nI tested the same saving the OO XLS file as XLSX - and there it works. So this is a workaround.", "is_private": false, "id": 135565, "creator": "mwildam@gmail.com", "time": "2010-03-23T17:31:59Z", "bug_id": 48969, "creation_time": "2010-03-23T17:31:59Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "josh@apache.org", "text": "Can you please upload the offending file (and identify one cell will the problem).  The full stack trace of your IllegalStateException would also be useful.", "id": 135568, "time": "2010-03-23T18:07:31Z", "bug_id": 48969, "creation_time": "2010-03-23T18:07:31Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "mwildam@gmail.com", "text": "Sorry, for the delay, but\n\n1.: I was under stress finishing at deadline.\n2.: I tried to produce the simplest possible test file to produce the error without success. - Unfortunately I cannot post the original file as it is confidential.\n\nFurther: In the meantime I also got a new updated file from the customer which does not produce the error any more. The customer also changed structure (not only content - nice from the customer when already struggling to get the project ;-) ). I tried to find out differences that might have an effect but I was not successful.\n\nI only can imagine two possible reasons:\n\na) On my tests I edited the original file (to make a test case out of it) with Excel 2003 incl. latest patches. Customer might have different patch level or anyone in the team might have edited the file with Excel 2007 and that caused some corruption not kept properly ( ;-) ) when saving with OO.\n\nb) The earlier version simply was corrupt or had some other bad link in it that created the problem when saving with OO.\n\nHowever, I made you loose enough time reading this and myself lost a very lot of time also initially when facing the problem and later when trying to generate a test case - just because of yet another issue touching a shitty M$ format.\n\nI would say: Close the issue and forget it.", "id": 135743, "time": "2010-03-29T09:01:55Z", "bug_id": 48969, "creation_time": "2010-03-29T09:01:55Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "text": "Resolving as suggested long ago.", "is_private": false, "id": 183209, "creator": "dominik.stadler@gmx.at", "time": "2015-05-31T21:07:11Z", "bug_id": 48969, "creation_time": "2015-05-31T21:07:11Z", "attachment_id": null}]