[{"count": 0, "tags": [], "bug_id": 48993, "text": "Hi,\n\n   We have two tomcat production servers both 5.5.12 on Windows Server 2003, one on java 4 and the other on Java 5.\n\nThe server on Java 4 is enabled for https long time ago. It is used to hang by the end of every 2nd week. We didn't keep much effort on identifying the cause and we want on restarting it every week end. \n\nWe enabled https on the other server 2 weeks ago and since then the tomcat server is not responding/accepting requests every 3rd day. We have to restart it from services to make it work. And there is no exceptions in the logs. But i can only see the requests coming in have decreased during that time while actually clients are sending requests which tomcat is not accepting.\n\nIt never happened before on this server and started happening only after enabling https . I am not very sure what caused this but since this is only change that has been made, I doubt this may have caused the issue. These are settings we made on the server for enabling https.\n\n  <Connector port=\"443\" maxHttpHeaderSize=\"8192\"\n               maxThreads=\"400\" minSpareThreads=\"25\" maxSpareThreads=\"75\"\n               enableLookups=\"false\" disableUploadTimeout=\"true\"\n               acceptCount=\"300\" scheme=\"https\" secure=\"true\"\n               clientAuth=\"false\" keystoreFile=\"keys/key1.kdb\" keystorePass=\"****\" sslProtocol=\"TLS\" />\n\nThanks in advance", "id": 135657, "time": "2010-03-26T08:09:33Z", "creator": "svkirans@gmail.com", "creation_time": "2010-03-26T08:09:33Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "1. Support questions are not appropriate for Bugzilla, but you can send them to the tomcat-users mailing list\nhttp://tomcat.apache.org/bugreport.html#Bugzilla%20is%20not%20a%20support%20forum\n\n2. If a java application (such as Tomcat) hangs, it is important to take a thread dump. There is an item in the FAQ on how to obtain thread dumps. Also we will need to know a bit more about your configuration: whether Tomcat is fronted by another web server or it is running standalone, do you use Tomcat Native, and their versions.\n\n3. Please consider upgrading your Tomcat and Java versions.\n\nBecause of 1. I am closing this as INVALID.", "id": 135661, "time": "2010-03-26T09:52:56Z", "bug_id": 48993, "creation_time": "2010-03-26T09:52:56Z", "is_private": false}]