[{"count": 0, "attachment_id": 25220, "bug_id": 49027, "text": "Created attachment 25220\nthe template (see description)\n\nI wrote a program to generate an Excel spreadsheet containing rows of data in which cells in each column have a particular format. Some columns are french (canadian) dates.\n\nMy program works by copying a template which is the same as the output report but with only one blank data row. Each row of data in the output spreadsheet is obtained by cloning the styles in the blank row, and then filling in the data.\n\nThis works fine, except when the cell style in the blank row is a French date (i.e. in Excel, pick the Date format, with language French (Canada)).\n\nThe dates always show up in English.\n\nAttached is the template (portfolio_template_FR.xls) with columns FGHI formatted as French (Canada) dates. I'd like to attach the output report as well but I am only allowed one attachment below.", "id": 135805, "time": "2010-03-31T03:02:14Z", "creator": "atombuilder@gmail.com", "creation_time": "2010-03-31T03:02:14Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 49027, "attachment_id": null, "is_private": false, "id": 135813, "time": "2010-03-31T11:16:27Z", "creator": "apache@gagravarr.org", "creation_time": "2010-03-31T11:16:27Z", "text": "Can you check what POI thinks the date formats were before and after?\n\nIt'd be useful to check both the format index, and the format string for both\n\nIf possible, you should also write a small unit test. This unit test would show loading of the template, making the changes, writing out, reading in the temp file and verifying that the date formats are incorrect. That'll give us something to debug against."}, {"count": 2, "tags": [], "bug_id": 49027, "attachment_id": null, "is_private": false, "id": 183211, "time": "2015-05-31T21:25:19Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-05-31T21:25:19Z", "text": "No update in a long time, thus resolving this for now, please reopen or report a new bug if this is still an issue for you."}]