[{"count": 0, "tags": [], "creator": "mitsu@syntheticzero.com", "text": "When using environment variable expansion in Apache configuration files when running Apache 2.2.x in Windows, Apache fails to start.\n\nSteps to reproduce:\n\n1) For example, create an empty file \"x.conf\" and place in C:\\\n\n2) Set an environment variable (in control panel -> System -> advanced -> environment variables) called APACHETEST, with the value \"C:\\\"\n\n3) Add the following line to httpd.conf:\n\n  Include ${APACHETEST}/x.conf\n\n4) Restart Apache\n\nActual results:\n\nNo error appears on the command line when starting Apache, but the Apache service fails to load. The error is only visible in the Windows Event Viewer, accessible from Control Panel -> Administrative Tools -> Computer Management -> System Tools -> Event Viewer -> Application, and it fails with the following error:\n\nThe Apache service named  reported the following error:\n>>> httpd.exe: Syntax error on line 55 of C:/Program Files/Apache Software Foundation/Apache2.2/conf/httpd.conf: Could not open configuration file C:/Program Files/Apache Software Foundation/Apache2.2/${APACHETEST}/x.conf: The system cannot find the path specified     .\n\nExpected results:\n\nThe Apache service starts normally.\n\nWe have reproduced this bug in both 2.2.3 and 2.2.15 on Windows XP. Note that the bug does NOT occur on Linux or OS X.\n\nIMPORTANT NOTE:\n\nNote that the error is only visible in Event Viewer. Interestingly, if you fail to set the environment variable or set it to the wrong location (for example set APACHETEST=foobar) then Apache will fail to start but will report the error to the console. It appears that when Apache first starts, when it parses the configuration file it DOES to environment variable substitution correctly, and will report errors correctly to the console. However, in some subsequent phase (while actually acting on the configuration directives, presumably), environment variable substitution does NOT work correctly, but instead of reporting the error to the console, it reports it \"silently\" to Event Viewer and exits. This was a very frustrating bug to track down!", "id": 135824, "time": "2010-03-31T19:54:44Z", "bug_id": 49032, "creation_time": "2010-03-31T19:54:44Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 49032, "is_private": false, "count": 1, "id": 135825, "time": "2010-03-31T20:01:24Z", "creator": "covener@gmail.com", "creation_time": "2010-03-31T20:01:24Z", "text": "Don't you need to reboot for a windows service to see a change in the system environment variables?  No error appears on the command-line because the command line invocation just kicks off the service.  Unless theres something more subtle happening here, there's no Apache defect."}, {"count": 2, "tags": [], "bug_id": 49032, "text": "Reboot no, though it would work fine after a reboot. It does however depend on how step 4 is accomplished.\n\nAdding the variable as described in step 2 calls WM_SETTINGCHANGE and that change is available to all processes started *after* the addition.\n\nhttpd -k restart is going to fail since the httpd process is already running IMO and has not received the change per the caveat. For me the error ends up in the error log but then Apache is also stopped. Follow it with httpd -k start and ${APACHETEST} expands to C:\\ and all is good since httpd is now starting as a new process.\n\nHowever post making the change run the commands;\nnet stop apache2.2\nnet start apache2.2\nor restart from the services window via administrative tools and\n${APACHETEST} expands to C:\\ and all is good and no noise.\n\nThat this error does not occur under *nix is not surprising since the environment is at the OS level and *nix isn't Windows and vice-versa.\nIMO the bug is invalid.", "id": 135830, "time": "2010-04-01T01:57:49Z", "creator": "gls@gknw.net", "creation_time": "2010-04-01T01:57:49Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "\"invalid\" was the prognosis in 2010...", "is_private": false, "id": 161522, "creator": "trawick@apache.org", "time": "2012-08-19T23:54:23Z", "bug_id": 49032, "creation_time": "2012-08-19T23:54:23Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "jmichae3@yahoo.com", "text": "From eventvwr.exe:\nThe Apache service named  reported the following error:\n>>> AH00112: Warning: DocumentRoot [C:/w/Apache-2.4.18-win32-VC14/Apache24/$(ServerRoot)/manual] does not exist     .\n\nsame result if I use {} instead of (), the var expansion doesn't work anymore, and pages don't serve up, I get google results in address bar of browser.\n\nbug is still there. vista 32 pae amd\nwindows services can be controlled through [windows-logo-flag-key]-R services.msc (accessories, Admin tools, Services) and do not require a reboot. windows isn't *that* bad. some things like filesystem checks against the system partition need to be done with the OS offline (like sync sync fsck, which is no longer in use).\n\n\nnotice it did not give the name of the service. you can use \n#include <sstream>\nstd::ostringstream o;\nint n=12;\no<<\"c:\\windows\\system32\\cmd.exe /c dir/s/b .\\\\\"<<n<<\"miles-high\";\nsystem(o.str.c_str());\n\ngreat for number conversions and commandline stuff.", "id": 191928, "time": "2016-06-24T02:49:41Z", "bug_id": 49032, "creation_time": "2016-06-24T02:49:41Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 49032, "text": "also note how the \"expansion\" is done there. it prepends the path to the variable expansion. that path is not in that string beforehand.\n\na proper string replace is needed (requires at least 2 strings internal to function), or better parsing and lexing.", "count": 5, "id": 191929, "time": "2016-06-24T03:13:58Z", "creator": "jmichae3@yahoo.com", "creation_time": "2016-06-24T03:13:58Z", "is_private": false}]