[{"count": 0, "attachment_id": null, "bug_id": 49050, "is_private": false, "id": 135892, "time": "2010-04-06T03:49:05Z", "creator": "trejkaz@trypticon.org", "creation_time": "2010-04-06T03:49:05Z", "tags": [], "text": "We encountered a spreadsheet with a lot of drawings in it, which resulted in a DrawingGroupRecord which was so large it had multiple separate ContinueRecord entries to make up all its data.\n\nSubsequently, the gradual growing of the byte array as these were encountered became a performance issue, with the file taking around 20 minutes to load.\n\nI can't provide a sample file, but I will provide a patch which reduces this case to around 3 seconds."}, {"count": 1, "tags": [], "creator": "trejkaz@trypticon.org", "attachment_id": 25231, "id": 135893, "time": "2010-04-06T03:52:15Z", "bug_id": 49050, "creation_time": "2010-04-06T03:52:15Z", "is_private": false, "text": "Created attachment 25231\nProposed patch\n\nProposed patch fixes the issue for that specific record type.\n\nI took a look at some other record types (e.g. DrawingRecord.)  A lot of them assume a single ContinueRecord and indeed I haven't seen a case of them having more than one.  But in the event that one day they do, this solution would work there as well.\n\nAnother thing I noticed is that other record types explicitly keep the ContinueRecord data separate and serialise it separately, whereas with EscherDrawingRecord this was not the case.  This may not be a problem though, I just thought it was worth noting."}, {"count": 2, "tags": [], "bug_id": 49050, "is_private": false, "text": "Created attachment 25232\nProposed patch\n\nNewer version after our own review.", "id": 135894, "time": "2010-04-06T04:33:32Z", "creator": "trejkaz@trypticon.org", "creation_time": "2010-04-06T04:33:32Z", "attachment_id": 25232}, {"count": 3, "attachment_id": null, "creator": "apache@gagravarr.org", "is_private": false, "id": 136668, "time": "2010-05-05T12:46:41Z", "bug_id": 49050, "creation_time": "2010-05-05T12:46:41Z", "tags": [], "text": "Thanks for the patch, applied in r941379."}]