[{"count": 0, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "is_private": false, "id": 135934, "time": "2010-04-07T16:06:34Z", "bug_id": 49063, "creation_time": "2010-04-07T16:06:34Z", "text": "During debugging of a problem that turned out to be my own web application's fault, it would have been very helpful to confirm via the jk-status worker that JKStripSession was in effect for my VirtualHost.\n\nCan you add a display for that configuration value?"}, {"count": 1, "tags": [], "text": "I currently do not plan to implement this feature.\n\nJkStripSession is from a configuration point of view a relatively simple flag. It is boolean and per vhost. We do have quite a few config items in mod_jk for the Apache web server on top of worker properties and mapping. JkStripSession is not that special, so if we are going to add more config info to the status worker, I think we should add most of these items there. That would make the page huge, so for the HTML page, it should be a separate page. I hesitate to do the work now. Not only the work in the status worker, but also in the Apache web server part of the module to make the config accessible from the more generic status worker.\n\nNot really difficult, but quite a bit of code and work. As always: patches welcome.\n\nI'm not closing as WONTFIX and I'm interessted in more comments on this enhancement request.", "attachment_id": null, "bug_id": 49063, "id": 180049, "time": "2014-12-29T13:00:47Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2014-12-29T13:00:47Z", "is_private": false}, {"count": 2, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "is_private": false, "id": 180051, "time": "2014-12-29T13:03:52Z", "bug_id": 49063, "creation_time": "2014-12-29T13:03:52Z", "text": "See also BZ 52483 for a somewhat similar feature request."}, {"count": 3, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "id": 180057, "time": "2014-12-29T15:15:23Z", "bug_id": 49063, "creation_time": "2014-12-29T15:15:23Z", "is_private": false, "text": "What about a new \"view\" of the status worker that would just dump the (options) configuration for all vhosts? I'm not sure the best way to specify a vhost's name in an HTTP parameter, but we could accept an optional parameter to specify the vhost to limit the size of the resulting page.\n\nI like the recent addition of the \"dump configuration\" to the log file, but that will only be in effect if mod_jk is in DEBUG log mode, and would likely require a restart in order to do that. It would be nice to be able to look at a misbehaving server and immediately dump the (options) configuration regardless of the state of the logger, how long the server had been running, etc."}]