[{"count": 0, "tags": [], "text": "Created attachment 25244\nPatch and new files\n\nThis patch has updated org.apache.poi.hssf.contrib.view.SViewer to include the ability to handle most border types, cell formats, and conditional formatting.\n\nThe cell formats include almost all formats as excel understands them for numbers, dates, and strings.  The only format parts that aren't handled are those that require the width of the cell in characters.  These classes are separated out so they can be used in other contexts (see below).\n\nThe viewer panel and the JTable for showing the spreadsheet are built as separate components that can be used in other applications.\n\nThe tests for excel formats are done by comparison to the actual results of using the formats in an excel spreadsheet — that is, the tests compare the results of the formatting with a row in a spreadsheet that formats the same number according to the same format.\n\nThe same is done for conditional formatting.\n\nBesides the view, a new example is provided that converts an spreadsheet into HTML (read-only).  This can be included in any HTML page.\n\n(The formatting stuff in Excel is very picky and very poorly documented, but I tried to be as exhaustive as I could be.)\n\n[Hm.  The instruction say to upload both patch and tar files, but bugzilla seems to be allowing me to only upload one file.  I have therefore put the \"diff.txt\" file into the tar.]", "is_private": false, "bug_id": 49066, "id": 135949, "time": "2010-04-07T21:51:27Z", "creator": "arnold@moonhill.org", "creation_time": "2010-04-07T21:51:27Z", "attachment_id": 25244}, {"count": 1, "tags": [], "bug_id": 49066, "text": "Thanks for the excellent patch. Sorry it took so long to review and apply.\n\nI committed it in r942809 with some tweaks:\n\n (1) The poi-contrib module is obsolete. Eventually, all its contents will be repackaged and the module itself will be zapped. \n\n I put org.apache.poi.ss.format.* in poi-main, it is a general-purpose code that can be re-used across POI. ToHtml and SViewer were moved to poi-examples. \n\t\n (2) SVSheetTable#setupScroll(JScrollPane scroll) did not compile. The problem line was \n    SVRowHeader rowHeader = new SVRowHeader(sheet, this);\n\nThe constructor of SVRowHeader takes 3 arguments and I changed it to \n\n    SVRowHeader rowHeader = new SVRowHeader(sheet, this, 0);\n\nPlease confirm that it makes sense.\n\n (3) I added the Apache Licence Header to almost all new classes. ASF header is a must. \n\n (4) org.apache.poi.ss.format.CellNumberFormatter depends on a class from Apache Commons-Math. I would rather avoid dependency on the Commons-Math jar and created an inner class CellNumberFormatter.Fraction based on org.apache.commons.math.fraction.Fraction. When POI uses more classes from Commons-Math then I'm OK to drop this inner class and use Commons-Math, but for a single dependency and I would rather duplicate code. \n\n (5) The preferred way of constructing Workbook from the given InputStream is to use WorkbookFactory.create(InputStream in). I changed ToHtml to use WorkbookFactory and removed ToHtml#createXSSF and ToHtml#createHSSF. \n\n (6) By convention, names of test classes start with Test*, the build script runs junit only for files matching \"**/Test*.java\" . I renamed classes in org.apache.poi.ss.format.* to follow this convention.\n\nOther than that, very cool! Thanks again.  \n\nRegards,\nYegor", "id": 136760, "attachment_id": null, "creator": "yegor@dinom.ru", "creation_time": "2010-05-10T12:14:30Z", "time": "2010-05-10T12:14:30Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 49066, "is_private": false, "count": 2, "id": 136837, "time": "2010-05-13T11:53:20Z", "creator": "arnold@moonhill.org", "creation_time": "2010-05-13T11:53:20Z", "text": "Yes, that all looks fine.  Thanks!"}, {"count": 3, "tags": [], "creator": "onealj@apache.org", "is_private": false, "text": "I've opened bug 58254 because of an inconsistency between the documented behavior and the actual behavior.\n\nKen/Yegor, since you are the authors of this code, do you have a preference towards resolving bug 58254?", "id": 184627, "time": "2015-08-18T16:01:30Z", "bug_id": 49066, "creation_time": "2015-08-18T16:01:30Z", "attachment_id": null}]