[{"count": 0, "tags": [], "bug_id": 49074, "text": "Created attachment 25245\nSee the comments at the top of the attached test driver program\n\nBackground:\nIn POI Bug 47543, we discovered that one must apply the base cell font to the cell itself via the cell style and not to the HSSFRichTextString object. Only the second and subsequent fonts used in HSSFRichTextStrings should use the HSSFRichTextString.applyFont() routine.\n\nThat approach works well up to a point, after which Excel 2003 and Excel 2007 will fail to read the font data, throwing user errors instead and showing only the raw sheet data without any formatting.\n\nTo reproduce, run the attached Driver.java program and try to open the generated file in Excel 2007. Excel throws an error stating that it found \"unreadable content\", and all cell formatting is then lost.\n\nNote that in the test driver program we are creating 65 rows and 10 columns of cell data that contains footnote markers (a superscript character at the end of each cell text). If you change the row constant to 64 rows or lower, then Excel can read the generated content. If you use 65 rows or higher, the error described here will occur. \n\nOur customers typically generate large amounts of output containing many tables with footnotes in certain cells. When we reach the rich text limit described here their Excel output becomes useless and we receive technical support compaints.", "id": 135969, "time": "2010-04-08T16:32:50Z", "creator": "brownicu@us.ibm.com", "creation_time": "2010-04-08T16:32:50Z", "is_private": false, "attachment_id": 25245}, {"count": 1, "tags": [], "text": "Is 65x10 the smallest file you can generate that gives the problem, or can you find something smaller?\n\nI'd suggest you create four files:\n* One via POI, which is the smallest you can that gives the problem\n* One via POI, which is like the above, but the biggest without issues\n* One via Excel, containing the same data as the POI one that fails\n* One via Excel, containing the same data as the POI one that works\n\nNext, use BiffViewer to try to see how the files differ. Especially interesting will be between the two poi ones, and between the poi one that breaks and the excel equivalent. Use the poi+excel pair that both work to help identify harmless things that are done differently.\n\nHopefully from this analysis, you can identify what's going wrong with the file that POI generates", "is_private": false, "bug_id": 49074, "id": 136667, "time": "2010-05-05T12:40:36Z", "creator": "apache@gagravarr.org", "creation_time": "2010-05-05T12:40:36Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 49074, "text": "Hi Nick,\n\nIn response to your questions:\n\n1. Yes, the 65 row x 10 column file is the smallest file that I can create in POI that will demonstrate the problem.\n\n2. I have attached 4 sample Excel workbooks, two created via POI (test_export_64_rows.xls and test_export_65_rows.xls), and two created via the attached driver.vbs script (vba_64_rows.xls and vba_65_rows.xls). The two 64-row files and the two 65-row files contain the exact same cell content.\n\n3. I tried following the steps you requested I take with the BiffViewer application, but the two files created via the VBA script cause BiffViewer to crash with a General Protection Fault. I also tried to manually create the test file in Excel (slow and cumbersome as it was), but the same GPF occurred when opening the file in BiffViewer.\n\nPlease have a look at the attachments and the relevant POI code. Hopefully it will help you to get to the root cause of this problem.\n\nRegards,\nCurtis", "count": 2, "id": 138063, "time": "2010-07-01T15:20:38Z", "creator": "brownicu@us.ibm.com", "creation_time": "2010-07-01T15:20:38Z", "is_private": false}, {"count": 3, "tags": [], "text": "Created attachment 25679\nTest Driver to Create the Sample Excel Files", "is_private": false, "bug_id": 49074, "id": 138064, "time": "2010-07-01T15:22:06Z", "creator": "brownicu@us.ibm.com", "creation_time": "2010-07-01T15:22:06Z", "attachment_id": 25679}, {"count": 4, "tags": [], "text": "Created attachment 25680\n64 rows created by POI code in the attached Driver.java", "is_private": false, "bug_id": 49074, "id": 138065, "time": "2010-07-01T15:28:53Z", "creator": "brownicu@us.ibm.com", "creation_time": "2010-07-01T15:28:53Z", "attachment_id": 25680}, {"attachment_id": 25681, "tags": [], "bug_id": 49074, "text": "Created attachment 25681\n65 rows created by POI code in the attached Driver.java", "count": 5, "id": 138066, "time": "2010-07-01T15:29:20Z", "creator": "brownicu@us.ibm.com", "creation_time": "2010-07-01T15:29:20Z", "is_private": false}, {"count": 6, "tags": [], "text": "Created attachment 25682\n64 rows created by driver.vbs script", "is_private": false, "bug_id": 49074, "id": 138067, "time": "2010-07-01T15:30:30Z", "creator": "brownicu@us.ibm.com", "creation_time": "2010-07-01T15:30:30Z", "attachment_id": 25682}, {"count": 7, "attachment_id": 25683, "creator": "brownicu@us.ibm.com", "text": "Created attachment 25683\n65 rows created by driver.vbs script", "id": 138068, "time": "2010-07-01T15:30:56Z", "bug_id": 49074, "creation_time": "2010-07-01T15:30:56Z", "tags": [], "is_private": false}, {"count": 8, "attachment_id": null, "creator": "apache@gagravarr.org", "text": "I've been comparing the BiffViewer dumps from poi, excel and open office, and I can't spot anything wrong with what POI is doing. There are some differences, but generally when POI and Excel differ, open office does it the same way as POI, and when POI and OpenOffice differ, POI has done it similar to excel...\n\nOpenOffice can read the poi 65 row file without error, so we're not doing anything too crazy\n\nThe only thing I can suggest is you ask around all of your clients, until you find one who have a support contract with Microsoft. Then, get the 65 row POI file submitted to Microsoft, and see if they can shed any light on what Excel dislikes about the file\n\nAs it stands, I can't figure out what POI is doing wrong to be able to fix it :/", "id": 140007, "time": "2010-09-21T06:54:33Z", "bug_id": 49074, "creation_time": "2010-09-21T06:54:33Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 49074, "is_private": false, "count": 9, "id": 183212, "time": "2015-05-31T21:27:25Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-05-31T21:27:25Z", "text": "Analysis by Nick some time ago indicates that no problem could be spotted in POI itself, thus resolving this issue for now, please reopen with more information if this is still a problem for you."}]