[{"count": 0, "tags": [], "text": "Hi , I am having workbook which has sheet1, sheet2 and sheet3 viz. If i add a range01 inside sheet3 and shifts the sheet3 before sheet2 and try to read the data from range01 it doesnt work correctly.\n\nI am using AbortableHSSFListener to read the data from the range.\nPlease find the attached code for reference. Urgent help will be highly helpful for us as its blocking issue for us.", "is_private": false, "id": 136345, "creator": "amitkalemail@gmail.com", "time": "2010-04-23T06:02:08Z", "bug_id": 49175, "creation_time": "2010-04-23T06:02:08Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "Please attach the workbook and sample code to reproduce the problem. \n\nYegor", "attachment_id": null, "bug_id": 49175, "id": 136375, "time": "2010-04-24T13:00:51Z", "creator": "yegor@dinom.ru", "creation_time": "2010-04-24T13:00:51Z", "is_private": false}, {"count": 2, "tags": [], "creator": "amitkalemail@gmail.com", "attachment_id": 25351, "id": 136407, "time": "2010-04-26T03:01:02Z", "bug_id": 49175, "creation_time": "2010-04-26T03:01:02Z", "is_private": false, "text": "Created attachment 25351\nThe attached file contains the code snippet and input excel file\n\nWe are trying to read the header row from the range \"Range_01\" which is part of \"sheet2\" . The expected output is header row of Range_01 while actual output is the same row from different sheet (i.e. sheet1).\n\nOn debugging what we have obesrved is the sheetIndex associated with Range_01 is coming invalid. Please let us know how we can resolve this.\n\nThanks,\nAmit"}, {"count": 3, "attachment_id": null, "creator": "yegor@dinom.ru", "is_private": false, "id": 147447, "time": "2011-06-24T10:22:50Z", "bug_id": 49175, "creation_time": "2011-06-24T10:22:50Z", "tags": [], "text": "Use high-level usermodel API and you will be good. \n\nBy using a low-level HSSFListener you are taking the burden of processing BIFF records, it requires a good knowledge of the Excel BIFF8 format and in cases like your it is not trivial. Spreadsheet usermodel API already does it for you, just try.\n\nYegor"}]