[{"count": 0, "tags": [], "text": "Created attachment 25358\nTest document which exposes the problem\n\nIn the current trunk, two characters separated by a tab character are glued together the tab is removed. \n\nI tried to debug the issue and found a following piece of code in XWPFParagraph.getText() method:\n\nXmlObject o = c.getObject();\nif (o instanceof CTText) {\n    text.append(((CTText) o).getStringValue());\n}\nif (o instanceof CTPTab) {\n    text.append(\"\\t\");\n}\n\nThis seems to assume that wherever a <w:tab/> construct appears in the source text file, XMLBeans will return an instance of CTPTab. Unfortunately in my case it seems to return CTEmptyImpl, which is not a CTPTab. \n\nI tried to read the specs, and in section 17.3.1.37 it says that there is only one possible parent element for <w:tab> and it is <w:tabs>. In my file, generated with office 2010 beta I have:\n\n<w:p w14:paraId=\"4EB09767\" w14:textId=\"77777777\" w:rsidR=\"00B3064F\"\n\tw:rsidRDefault=\"00B3064F\">\n\t<w:r>\n\t\t<w:t>a</w:t>\n\t</w:r>\n\t<w:r>\n\t\t<w:tab />\n\t\t<w:t>b</w:t>\n\t</w:r>\n\t<w:bookmarkStart w:id=\"0\" w:name=\"_GoBack\" />\n\t<w:bookmarkEnd w:id=\"0\" />\n</w:p>\n\nYou see that <w:tab /> is note enclosed within <w:tabs></w:tabs>\n\nThis might imply that either office produces a wrong file, or the OpenXML XSDs are wrong, or there is something wrong with XMLBeans class generator, or with its runtime parser.\n\nCould someone with more knowledge of the OpenXML format take a look at this? This error spoils fulltext indexing and seems pretty important for the users of the Aperture Framework.\n\nThe easiest workaround for me would be to add a third 'if' for CTEmptyImpl and put a space in the output. Superfluous whitespace (almost) never hurts, while glueing words together is bad, but as I said, my knowledge on this topic is limited.", "is_private": false, "bug_id": 49189, "id": 136429, "time": "2010-04-27T04:21:50Z", "creator": "antoni.mylka@gmail.com", "creation_time": "2010-04-27T04:21:50Z", "attachment_id": 25358}, {"count": 1, "tags": [], "bug_id": 49189, "attachment_id": 25359, "text": "Created attachment 25359\nA test case, to be placed in ooxml/testcases/org/apache/poi/xwfp/extractor", "id": 136430, "time": "2010-04-27T04:23:11Z", "creator": "antoni.mylka@gmail.com", "creation_time": "2010-04-27T04:23:11Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 49189, "attachment_id": 25360, "text": "Created attachment 25360\nPatch, with my workaround\n\nThis fixes the issue for me, introduces some superfluous spaces in other tests, which I consider a small problem.\n\nI don't know what consequences it might have in other scenarios - more OpenXML knowledge is needed.", "id": 136433, "time": "2010-04-27T06:08:34Z", "creator": "antoni.mylka@aduna-software.com", "creation_time": "2010-04-27T06:08:34Z", "is_private": false}, {"count": 3, "tags": [], "text": "From looking at the xsds, it seems to me that a tab entry is allowed in two places, within the tabs element, or within a normal paragraph tag\n\nWhen within a paragraph, on it's own, it's of type CT_Empty. This fits with what xmlbeans is giving us\n\ncr (carriage return) looks to be quite similar (it's next to tabs in the paragraph definition), so we should probably handle the two in a similar way\n\nWill take a look at your patch later on", "is_private": false, "bug_id": 49189, "id": 137120, "time": "2010-05-25T13:06:57Z", "creator": "apache@gagravarr.org", "creation_time": "2010-05-25T13:06:57Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 49189, "attachment_id": null, "id": 137121, "time": "2010-05-25T16:32:52Z", "creator": "apache@gagravarr.org", "creation_time": "2010-05-25T16:32:52Z", "is_private": false, "text": "Fixed in r948199, along with a unit test. \n\nWe now spot the CTEmpty instances, and check what they really are. If it's a tab or a cr, we then append the appropriate thing to the internal text representation"}]