[{"count": 0, "attachment_id": null, "bug_id": 49190, "text": "All of the Exceptions in javax.xml.crypto.** packages are designed so that they have a Throwable cause field, this is an anti-pattern and should be avoided. Proper way of containing root cause for the exception is to call Exception(Throwable cause) or Exception(String message, Throwable cause) super constructor.\n\nTo be fair this is somewhat indicated in the javadocs by the:\n\"Note that the detail message associated with\n     * <code>cause</code> is <i>not</i> automatically incorporated in\n     * this exception's detail message.\"\n\nbut I fail to see the reason for this design decision. The only reason I could hypothesize is that the root cause could contain sensitive information, but in that case implementation that threw the exception should not include any sensitive information, or should appropriately obfuscate the same.\n\nImplementing the exceptions by using appropriate super constructors would reduce the complexity of the current implementation, and would be inline with best practices for creating one's own exceptions.", "id": 136431, "time": "2010-04-27T04:24:07Z", "creator": "zregvart@gmail.com", "creation_time": "2010-04-27T04:24:07Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 49190, "text": "There is a reason behind this design.\n\nJSR 105 was designed to run on JDK 1.2 and up. This is documented in the API dependencies of the JSR 105 specification: http://jcp.org/aboutJava/communityprocess/final/jsr105/index.html . The Exception(Throwable cause) constructor did not get added to the JDK until version 1.4, so we could not use them.\n\nHaving said that, Apache XML Security requires JDK 1.4 and up, so we should be able to change this implementation of JSR 105 to invoke these constructors.", "id": 136445, "time": "2010-04-27T09:46:41Z", "creator": "sean.mullan@oracle.com", "creation_time": "2010-04-27T09:46:41Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 49190, "text": "Sean, thanks for the prompt reply. Being that you are one of the maintenance leads of the JSR, what are the chances of updating the required JDK to 1.4, or even 1.5 -- the xml-dsig API would certainly benefit from generics?", "id": 136446, "time": "2010-04-27T10:05:11Z", "creator": "zregvart@gmail.com", "creation_time": "2010-04-27T10:05:11Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "sean.mullan@oracle.com", "is_private": false, "id": 136469, "attachment_id": null, "bug_id": 49190, "creation_time": "2010-04-27T15:25:52Z", "time": "2010-04-27T15:25:52Z", "text": "(In reply to comment #2)\n> Sean, thanks for the prompt reply. Being that you are one of the maintenance\n> leads of the JSR, what are the chances of updating the required JDK to 1.4, or\n> even 1.5 -- the xml-dsig API would certainly benefit from generics?\n\nNo immediate plans. There are other minor API changes I would like to make as well, but all in all the API has been holding up pretty well since it was finalized. \n\nAlso I would be interested in seeing if we could create a smaller API that would be more suitable for memory constrained platforms or for those that don't need all the bells and whistles of XML Signature. There is also the ongoing work of XML Signature 2.0 in the W3C XML Security working group and that will probably require changes to the API if it gains traction."}]