[{"count": 0, "attachment_id": null, "bug_id": 49193, "is_private": false, "id": 136437, "time": "2010-04-27T08:11:59Z", "creator": "peter.thomas@readi-systems.com", "creation_time": "2010-04-27T08:11:59Z", "tags": [], "text": "The current LDAP cache implemented for httpd's mod_ldap only does exact matches based on LDAP URL and filter expression.  An intelligent caching mechanism would respect basedn and scope of a given LDAP search.  Essentially we need the caching to implement the behavior of an RFC-compliant \"mini-LDAP server.\"\n\nPlease enhance APR-Util's LDAP implementation to the extent necessary to support \"scope-aware\" caching, specifically:\n\n1) the current implementation works for exact matches of both search expression and basedn, this is equivalent to \"basedn scoped\" searches.\n2) onelevel cache searches would include case 1 and also any cache entries with no more than one additional DN entry.\n3) subtree-scoped cache searches; would include both case 1, case 2, and any deeper matches.\n\nI will write a companion bug against httpd's mod_ldap and update this as a blocker."}, {"count": 1, "attachment_id": null, "bug_id": 49193, "text": "It's unlikely that an LDAP cache would be moved into APR and enhanced. There are currently discussion to even move the portability aspects of LDAP into httpd.", "id": 136438, "time": "2010-04-27T08:15:02Z", "creator": "covener@gmail.com", "creation_time": "2010-04-27T08:15:02Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "peter.thomas@readi-systems.com", "text": "Makes sense...rather than build a \"dependency tree,\" I'll clone this into httpd, proper.", "id": 136456, "time": "2010-04-27T13:12:52Z", "bug_id": 49193, "creation_time": "2010-04-27T13:12:52Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "(In reply to comment #1)\n> It's unlikely that an LDAP cache would be moved into APR and enhanced. There\n> are currently discussion to even move the portability aspects of LDAP into\n> httpd.\n\nFYI, the httpd copy of this bug is at https://issues.apache.org/bugzilla/show_bug.cgi?id=49199 .  Have the discussions about moving LDAP portability into httpd reached a conclusion?", "is_private": false, "id": 138446, "creator": "peter.thomas@readi-systems.com", "time": "2010-07-15T20:25:38Z", "bug_id": 49193, "creation_time": "2010-07-15T20:25:38Z", "attachment_id": null}]