[{"count": 0, "tags": [], "bug_id": 49232, "text": "For several revisions now, the signjar task has had a bug in which providing the storepass and keypass arguments to the signjar task element has not prevented Ant\nfrom displaying the prompt 'Enter Passphrase from keystore: ' followed by a command to turn off echo mode in the terminal discipline.\n\nThe problem with this is that when I run ant against my build.xml in emacs, the prompt for the passphrase and the terminal discipline shenanigans cause emacs to interrupt whatever else I'm doing and prompt for the passphrase, despite my already having provided that in the signjar element.\n\nLooking at the source code, it appears that the createRedirector() method in org.apache.tools.ant.taskdefs.AbstractJarSignerTask is using a RedirectorElement to handle interposition of input data and output filtering when running the JDK's jarsigner application.\n\ncreateRedirector() actually creates a RedirectorElement with logic to explicitly filter the passphrase out so that it is not unnecessarily sent to the console.\n\nFrom my testing on Linux, it appears that jarsigner actually emits that prompt to stdout, not stderr as is assumed in createRedirector().  If\nline 256 of AbstractJarSignerTask.java was changed from 'createErrorFilterChain().addLineContainsRegExp(filter)' to 'createOutputFilterChain().addLineContainsRegexp(filter)', it would properly inhibit the display of the useless prompt.\n\nI have not yet built a test against this to see if filtering out the prompt causes emacs to do the right thing, but I will try to get it built and tested anon.", "id": 136546, "time": "2010-04-29T20:01:40Z", "creator": "jonabbey@ganymeta.org", "creation_time": "2010-04-29T20:01:40Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "jglick@apache.org", "is_private": false, "count": 1, "id": 136548, "time": "2010-04-29T20:53:19Z", "bug_id": 49232, "creation_time": "2010-04-29T20:53:19Z", "text": "I thought I had fixed that in r708670, the code you are referring to. (I too am a heavy M-x shell user.) At least it is broken in 1.7.1 and works for me in 1.8.0.\n\nWhich JDK version do you use? Perhaps that is significant.\n\nDoes it work for you to use both variants, i.e.\n\nresult.createOutputFilterChain().addLineContainsRegExp(filter);\nresult.createErrorFilterChain().addLineContainsRegExp(filter);\n\n?"}, {"count": 2, "tags": [], "bug_id": 49232, "attachment_id": null, "id": 136549, "time": "2010-04-29T20:57:48Z", "creator": "jonabbey@ganymeta.org", "creation_time": "2010-04-29T20:57:48Z", "is_private": false, "text": "*blush*\n\nI'm afraid I actually haven't tested in 1.8.0.  I did check the source code for 1.8.0 and saw that it was still filtering on the error filter chain rather than the output filter chain, and I tested to see that the jarsigner app writes the passphrase prompt to stdout rather than to stderr.\n\nLet me get my Ant updated and test against 1.8.0 before anyone wastes any more time on this."}, {"count": 3, "tags": [], "creator": "jonabbey@ganymeta.org", "is_private": false, "id": 136574, "attachment_id": null, "bug_id": 49232, "creation_time": "2010-04-30T12:52:46Z", "time": "2010-04-30T12:52:46Z", "text": "Sorry, 1.8.0. does fix this issue.  Thanks for fixing this, it was a long time sore spot when using Ant."}]