[{"count": 0, "attachment_id": 25395, "bug_id": 49244, "text": "Created attachment 25395\nSubversion patch file with changes for OOXML validation support.\n\nData validations are supported for the binary format. We'd like to have this feature for the OOXML format as well. I tried to see how to get this done and I've a working version that fits my needs for now. Please find attached a patch created using Subversion that contains all the changes I've made. If you deem it fit please accept it ( it might require further work to be release worthy. ).", "id": 136618, "time": "2010-05-04T06:08:13Z", "creator": "rjankiraman@emptoris.com", "creation_time": "2010-05-04T06:08:13Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 49244, "text": "First question - why did you need to add new things to HSSF's validation support? If it's common functionality, we should probably move it into SS, rather than hacking HSSF\n\nSecondly, we should probably have a file with existing constraints in it, which we can unit test. Finally on testing, as well at the test that creates new validation, we should probably also have one that creates some validation, saves to a temp file, re-opens it, and tests that the correct values can be read back out\n\nAny chance you could submit a new patch with these changes in?", "id": 136659, "time": "2010-05-05T11:29:47Z", "creator": "apache@gagravarr.org", "creation_time": "2010-05-05T11:29:47Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 49244, "attachment_id": null, "is_private": false, "id": 136670, "time": "2010-05-05T14:41:46Z", "creator": "rjankiraman@emptoris.com", "creation_time": "2010-05-05T14:41:46Z", "text": "Thanks for taking a look at this. This would require some thought in how best to add things to SS package which are at the same time compatible with current HSSF code as well.\n\nAs for improving test cases, I accept all points. I will try to submit another patch. We need this feature and at the same time don't want to maintain a custom version of POI code base. Will try to submit another patch."}, {"count": 3, "tags": [], "bug_id": 49244, "attachment_id": 25418, "is_private": false, "id": 136740, "time": "2010-05-08T16:54:23Z", "creator": "rjankiraman@emptoris.com", "creation_time": "2010-05-08T16:54:23Z", "text": "Created attachment 25418\nRevised patch with a cleaner approach\n\nThis revised patch addresses points raised in comment #1.\n - Introduced set of interfaces in ss package. \n - Added a new test case."}, {"count": 4, "attachment_id": 25419, "bug_id": 49244, "text": "Created attachment 25419\ntest-data/spreadsheet/DataValidations-49244.xlsx", "id": 136741, "time": "2010-05-08T16:57:28Z", "creator": "rjankiraman@emptoris.com", "creation_time": "2010-05-08T16:57:28Z", "tags": [], "is_private": false}, {"count": 5, "attachment_id": null, "bug_id": 49244, "text": "Has anyone had a chance to take a look at the revised patch yet ?", "id": 136826, "time": "2010-05-12T16:47:48Z", "creator": "rjankiraman@emptoris.com", "creation_time": "2010-05-12T16:47:48Z", "tags": [], "is_private": false}, {"count": 6, "attachment_id": null, "bug_id": 49244, "text": "Thanks for the patch, I applied it in r944869 with some changes.\n\nI noticed that you changed visibility of HSSFDataValidation._region to public and HSSFSheet._sheet to protected. I reverted it back to private, I guess this change was needed for debug purposes.\n\nPOI's ooxml-schemas.jar does not support generics, the patch didn't compile against ooxml-schemas-1.0.jar and I had to change usages of CTDataValidations.getDataValidationList() to  CTDataValidations.getDataValidationArray. Are you using a custom jar with OOXML schemas?\n\nI also refactored test cases to follow POI conventions and added missing ASF license header.\n\nRegards,\nYegor", "id": 136896, "time": "2010-05-16T12:13:59Z", "creator": "yegor@dinom.ru", "creation_time": "2010-05-16T12:13:59Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "creator": "rjankiraman@emptoris.com", "text": "I compiled the ooxml-schemas jar independently and put it the ooxml-lib folder to get going  ( I noticed later that there were targets to build the jars required in the ooxml-lib folder ). Guess that is where the differences crept in. \n\nThanks for making the changes to get it in.", "id": 136903, "time": "2010-05-17T02:50:31Z", "bug_id": 49244, "creation_time": "2010-05-17T02:50:31Z", "is_private": false, "attachment_id": null}]