[{"count": 0, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": 25396, "is_private": false, "id": 136619, "time": "2010-05-04T06:57:31Z", "bug_id": 49245, "creation_time": "2010-05-04T06:57:31Z", "text": "Created attachment 25396\nwebapps.zip\n\nWhen a servlet is called using cross-context forward/include call from another web application, its call to request.getSession(boolean) may return a session which was inactive for longer than configured session-timeout.\n\nThis issue was fixed in trunk in r926716\n\nTo reproduce:\n1. Unzip the attached archive and deploy the two web applications contained there, \"expire\" and \"expireB\". \"expireB\" is configured to have session-timeout of one minute.\n2. Access http://localhost:8080/expire/\nThe index.jsp page there will print current time and will display two sessions from both web applications.\n3. Wait for 65-70 seconds and once more access http://localhost:8080/expire/\nYou may see the following output:\n[[[\nCurrent time: Tue May 04 14:44:16 MSD 2010\n\nexpire/index.jsp: Session:\nid: 6124AB5790D0ABF2CD6472D63EE5332D\nisNew: false\ngetCreationTime: Tue May 04 14:43:04 MSD 2010\ngetLastAccessedTime: Tue May 04 14:43:04 MSD 2010\n\nexpireB/index.jsp: Session:\nid: 6124AB5790D0ABF2CD6472D63EE5332D\nisNew: false\ngetCreationTime: Tue May 04 14:43:05 MSD 2010\ngetLastAccessedTime: Tue May 04 14:43:05 MSD 2010\n]]]\n\nCurrent time is 14:44:16 which is more that 1 minute more than lastAccessedTime of expireB session, 14:43:05. Observed: \"expireB\" reuses an old session. Expected: to use a new session (isNew: true) in \"expireB\".\n\n\nI think this issue is a minor one, because it looks as the effective value for session-timeout configuration option is slightly greater that its literal value:\n\n1) I observed no problems with the session. Even if the session was a stale one, session.access() call prolongs its lifetime. There was no IllegalStateException when calling its methods.\n\n2) There is a background thread that cleans stale sessions once in several minutes (calls ManagerBase#processExpires()). This limits the difference between effective and literal values of session-timeout."}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "is_private": false, "id": 136620, "time": "2010-05-04T07:12:50Z", "bug_id": 49245, "creation_time": "2010-05-04T07:12:50Z", "text": "Fixed in 6.0 in r940804 and will be in 6.0.27 onwards."}]