[{"count": 0, "tags": [], "creator": "mguillemot@yahoo.fr", "text": "Created attachment 25423\nPatch adding target checkstyle to main build.xml with a extrem minimal number of checks\n\nTomcat code style is not consistent but it should be (it would give more time to discuss about unit tests rather than about code style).\n\nRather than to propose a huge patch in one time, I propose a simple one that:\n- adds a checkstyle target to the build.xml\n- adds a chestyle.xml configuration file (the \"sun coding conventions\") with nearly everything deactivated (otherwise it gives over 80000 style errors)\n- activates only check for tabs\n\nWith this check the checkstyle target fails as a lot of files still contain a tab character. A find / replace by a committer makes far more sense than providing it in the patch as it would be more difficult to review.\n\nOf course it would make sense to add this target to the default build.\n\nOnce this patch has been applied, work can start on other checkers, like the one verifying the presence of Version Javdoc tag in the right format.", "id": 136759, "time": "2010-05-10T12:12:31Z", "bug_id": 49268, "creation_time": "2010-05-10T12:12:31Z", "is_private": false, "attachment_id": 25423}, {"count": 1, "tags": [], "bug_id": 49268, "text": "What about applying this patch to have style conventions verified without discussion?\nCommits here and there again with comments like:\n\"Tabs to spaces. No functional change.\"\njust waste attention of all people (committers or not) following code changes. Additionally nothing guarantees that the work won't be lost, reverted by a future commit.", "id": 137018, "time": "2010-05-21T09:30:31Z", "creator": "mguillemot@yahoo.fr", "creation_time": "2010-05-21T09:30:31Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 49268, "attachment_id": null, "is_private": false, "id": 138344, "time": "2010-07-10T20:23:02Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2010-07-10T20:23:02Z", "text": "Thank you for the effort.\nI won't comment on the project policies - that is to be discussed and decided on dev@.\n\nSeveral comments on the patch itself:\n\n1) Checkstyle version should not be hard-coded in build.xml.\n\n> style=\"${checkstyle.home}/checkstyle-5.1/contrib/checkstyle-noframes.xsl\"/> \n\n2) What is the origin of the res/checkstyle.xml file? There is no copyright or license notice there.\n\n3) Contrary to the written \"- activates only check for tabs\", there are more checks that are enabled in the proposed checkstyle file."}, {"count": 3, "tags": [], "text": "(In reply to comment #2)\n> ...\n> 1) Checkstyle version should not be hard-coded in build.xml.\n\nwhat is your preferred way? I wanted to avoid having an additional property but I can change it.\n\n> > style=\"${checkstyle.home}/checkstyle-5.1/contrib/checkstyle-noframes.xsl\"/> \n> \n> 2) What is the origin of the res/checkstyle.xml file? There is no copyright or\n> license notice there.\n\nthis is the default checkstyle config file... with nearly everything as comments\n\n> 3) Contrary to the written \"- activates only check for tabs\", there are more\n> checks that are enabled in the proposed checkstyle file.\n\nthis is correct. The very few remaining checkers were the default one that weren't failing (what means that the style of some sources can be even worse than here ;-)).", "is_private": false, "id": 138356, "creator": "mguillemot@yahoo.fr", "time": "2010-07-12T01:18:01Z", "bug_id": 49268, "creation_time": "2010-07-12T01:18:01Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Fixed in trunk. Will be included in 7.0.1 onwards.", "is_private": false, "id": 138642, "creator": "markt@apache.org", "time": "2010-07-22T18:32:10Z", "bug_id": 49268, "creation_time": "2010-07-22T18:32:10Z", "attachment_id": null}]