[{"count": 0, "tags": [], "bug_id": 49270, "attachment_id": null, "is_private": false, "id": 136769, "time": "2010-05-11T03:33:24Z", "creator": "c343888@owlpic.com", "creation_time": "2010-05-11T03:33:24Z", "text": "Please watch this code:\n\nvoid main(int argc, char *argv[], char* envp[] )\n{\n\tprintf(\"Content-Type: text/plain;charset=us-ascii\\n\\n\");\n\tfor(;;)\n\t{\n\t\tprintf(\"working\\n\");\n\t\tfflush(stdout);\n\t\tSleep(100);\n\t}\n}\n\nIt works finde. Puts \"working\" scrolling down the browser.\nBut when you POST a lot of data to this script (about 63-64 KBytes and more) than the cgi script blocks. You have to kill the script via taskmanager to see any output."}, {"count": 1, "text": "closing, not a bug in Apache HTTP Server. If you want a browser to read your response, you need to read the body it's sending you.  Further discussion belongs on the users list.", "bug_id": 49270, "attachment_id": null, "id": 136775, "time": "2010-05-11T07:58:07Z", "creator": "covener@gmail.com", "creation_time": "2010-05-11T07:58:07Z", "tags": [], "is_private": false}, {"text": "Somehow you're right, somehow that behaviour can lead to trouble.\nI did some further testing. Problem occurs when data to stdout > 64 KK AND post data > 64 KB (or around that value) If one of them is below the 64 KB mark, everything is fine. \n\nThink of a perl script that outputs large data (>64K). That script gets its input via post with some arguments. Now somebody just posts data > 64 K. He does this repeatedly. He does this very often. Eventually the server gets an out of memory error, because there is not enough time to get a timeout. So there are more and more perl interpreters running, doing nothing, consuming memory. \n\nWhy does the apache not output anything to stdout till it has read all the post-data? Think of an upload cgi. You can't output the status, because the status arrives when the whole file is uploaded, so the status is useless at that time.", "tags": [], "bug_id": 49270, "attachment_id": null, "count": 2, "id": 136776, "time": "2010-05-11T08:40:10Z", "creator": "c343888@owlpic.com", "creation_time": "2010-05-11T08:40:10Z", "is_private": false}]