[{"count": 0, "tags": [], "bug_id": 49298, "attachment_id": null, "id": 136880, "time": "2010-05-15T16:44:00Z", "creator": "jerry@ieee.org", "creation_time": "2010-05-15T16:44:00Z", "is_private": false, "text": "I tried to enter this on the Documentation Wiki but the pages where I thought the information maybe should be are immutable.\n\nIn the documentation of mod_rewrite,\n\nhttp://httpd.apache.org/docs/2.2/mod/mod_rewrite.html\n\nthe first sentence in the summary is:\n\n<quote>This module uses a rule-based rewriting engine (based on a regular-expression parser) to rewrite requested URLs on the fly.</quote> ...\n\nThat's fine if you know what a \"rewriting engine\" is, or at least what a \"rewrite\" is in Apache's context.  But I still can't find these definitions in .  To me, \"writing\" or \"rewriting\" is something that you do to a hard disk, and I had no idea that this was what I wanted until I got help from some of the helpful people in the forums at webmasterworld.com.  I would have been up and running much faster if that first sentence were replaced with these:\n\n<quote>This module allows you to set *URL Rewrites* on a site.  A *URL Rewrite* is similar to a *URL Redirect*, in that it intercepts requests prior to processing by the server.  However, instead of sending a response back to the client with HTTP Status 301 or 302 and the new URL, it simply overwrites (rewrites) the requested URL with the new URL and then forwards the *rewritten* request to the server for processing.  The Client is not given any indication that this happened because it's all done internally.  Therefore, for example, if the Client is a web browser, the address bar will indicate the originally-requested URL when a response is received from the resource specified by the rewritten URL.\n\nURL Rewrites are implemented by regular expression (regex) search and replace rules which the webmaster adds to the site's .htaccess file.</quote> ..."}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "text": "I'm not really feeling the proposed text, and this intro has been enhanced in trunk already.\n\nhttp://httpd.apache.org/docs/trunk/mod/mod_rewrite.html\n\nI think we can fold a phrase or two to emphasize that the \"mapping\" aspect is transparent to the client, but the rest seems excessive.  \n\nAny concerns relative to the trunk version?", "id": 136881, "time": "2010-05-15T17:29:30Z", "bug_id": 49298, "creation_time": "2010-05-15T17:29:30Z", "is_private": false}, {"count": 2, "tags": [], "text": "Minor changes for clarification. Most users just don't 'get it' when they read the current docs.\n\nThe mod_rewrite module uses a rule-based rewriting engine, based on a regular-expression parser, to rewrite requested URLs on the fly. By default, mod_rewrite maps a URL to an internal filesystem path. However, it can also be used to externally redirect one URL to another URL, or to invoke an HTTP proxy fetch from the same or another domain.\n\nmod_rewrite provides a flexible and powerful way to manipulate URL requests using an unlimited number of rules. Each rule can have an unlimited number of attached rule conditions, to allow you to rewrite the incoming URL request based on server variables, environment variables, HTTP headers, or time stamps.\n\nmod_rewrite operates on the full requested URL path, including the path-info section. A rewrite rule can be invoked in httpd.conf or in .htaccess. The new path generated by a rewrite rule can include an appended query string, and can lead to internal sub-processing as a rewrite (when only the target filepath and/or filename is specified), external request redirection (when a target domain name and/or the [R] flag is specified), or proxy throughput (when using the [P] or [PT] flags).", "attachment_id": null, "id": 136886, "creator": "g1smd@freeuk.com", "time": "2010-05-15T19:19:29Z", "bug_id": 49298, "creation_time": "2010-05-15T19:19:29Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jerry@ieee.org", "attachment_id": null, "text": "> Any concerns relative to the trunk version?\n\nThank you, Eric.  Indeed, the trunk version is better.\n\nHowever, I feel that it's still confusing because it jumps immediately into\n*how* to create a rewrite before explaining *what* it is and *why* it is\nuseful.\n\nMaybe a whole new \"overview\" document is needed, something which defines,\ncompares, contrasts, and gives typical reasons to use: an external redirect, an\ninternal rewrite, an include, a same-domain proxy request and a cross-domain\nproxy request.  Maybe there is such a document somewhere, but I couldn't find\nany.", "id": 136889, "time": "2010-05-15T19:41:01Z", "bug_id": 49298, "creation_time": "2010-05-15T19:41:01Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 49298, "attachment_id": null, "text": "The intro doc you request is now here: http://httpd.apache.org/docs/trunk/rewrite/\n\nI've rewritten the introductory paragraph a little, but I think it could use an example or a diagram, even in this intro, to show people what it is that they're looking at. So I'm going to leave this ticket open for the moment, to remind me to work on this some more.\n\nThanks.", "id": 141158, "time": "2010-10-29T09:32:55Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-29T09:32:55Z", "is_private": false}, {"count": 5, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "text": "Moving docs bugs to docs@httpd.a.o ownership.", "id": 141195, "time": "2010-10-29T11:05:56Z", "bug_id": 49298, "creation_time": "2010-10-29T11:05:56Z", "is_private": false}, {"count": 6, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "text": "I feel like our recent changes to the rewrite documentation more than address this ticket. While of course there's *always* room for improvement, I think that we've addressed the concerns addressed in this ticket, and are well on track to continue these improvements. I'm going to close this ticket. Thanks for the feedback.", "id": 143867, "time": "2011-02-01T14:25:27Z", "bug_id": 49298, "creation_time": "2011-02-01T14:25:27Z", "is_private": false}]