[{"count": 0, "tags": [], "creator": "Larry.Isaacs@sas.com", "attachment_id": 25437, "text": "Created attachment 25437\nPossible \"starter\" patch to make ContextConfig tolerant of file URLs\n\nCurrently ContextConfig's processServletContainerInitializers() and processResourceJARs() are hard coded to only accept jar URLs.  If they encounter a file URL due to a JarScanner with scanAllDirectories=true, they throw a ClassCastException.  The attached patch is what I used to update Tomcat 7 so it would start.  I've verified that the modified processServletContainerInitializers() picks up the \"javax.servlet.ServletContainerInitializer\" file from a directory.  As for processResourceJARs(), I was lazy and modified it to simply ignore file URLs as BaseDirContext doesn't currently accept non-jar URLs for these \"META-INF/resources\" locations.\n\nThe Tomcat 7 support found in the Web Tools Platform would need this fixed (i.e. allow JarScanner with scanAllDirectories=true to be usable) for the feature of serving web application projects directly from the development workspace to work fully.  The patch as is would be sufficient.  A new feature in WTP 3.2 is multiple web content folders in web application projects.  The Tomcat 7 support in WTP has to enable a customized FileDirContext to handle this.  It's like VirtualDirContext, but with more hacks.  It is able to handle the \"META-INF/resources\" from directories that processResourceJARs() currently doesn't.  However, it may not get the order right.  So it would be a benefit if processResourceJARs() could add file URLs to BaseDirContext as well as jar URLs.\n\nI'm marking the severity as major mainly be cause I have a bit of a deadline.  I likely have a little less than a week to make the WTP change to use a JarScanner.  Without it the web-fragment.xml files won't be picked up when serving projects directly from the workspace.  However, this is all new \"stuff\".  So there probably won't be a critical need for this feature.  If I miss the deadline, I'll be able to fix it in the first WTP maintenance release which would be available in late September.  Serving web application projects directly from the workspace on Tomcat 7 wouldn't be fully functional for just a few months.  Addressing this later is also fine.\n\nCheers,\nLarry", "id": 136855, "time": "2010-05-14T10:26:11Z", "bug_id": 49290, "creation_time": "2010-05-14T10:26:11Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Patch applied. Many thanks.\n\nI'll leave this open as an enhancement so we don't forget to revisit this to look at Resource JARs that aren't really JARs.", "id": 136884, "time": "2010-05-15T18:53:21Z", "bug_id": 49290, "creation_time": "2010-05-15T18:53:21Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 49290, "text": "I believe this was fixed with bug 51741, marking as resolved.", "id": 152029, "time": "2011-12-06T21:19:13Z", "creator": "slaurent@apache.org", "creation_time": "2011-12-06T21:19:13Z", "is_private": false, "attachment_id": null}]