[{"count": 0, "text": "Created attachment 25549\nSpot Color Support for PDF Renderer\n\nThis patch provides spot color support for spot colors for the PDF renderer. It was developed against the 0.95 codebase, so it may not be compatible with the HEAD.\n\nThe code's rather rough and unforgiving (you need to specify the color function with ALL arguments correctly or it will likely die), but it's sufficient for our current production environment. Values for the alternate colorspaces (RGB/CMYK) must be provided, with the tint pre-calculated...though I believe it currently only actually uses one of the alternates (I think CMYK ??) for non-PDF renderers.\n\nWith this patch applied, you may specify spot colors in your FO using the following function:\n\nrgb-icc(R,G,B,'#Separation',spot-color-name,tint-value,C,M,Y,K)\n\nHere's one with real values:\nrgb-icc(0,91,165,'#Separation','Reflex Blue CV',1,0.96,0.7,0.04,0)\n\nI'm posting this here at Jeremias' request since he's working on implementing full support for spot colors. If you're looking at this for your own fork, you should probably review the status of his efforts first!", "bug_id": 49403, "attachment_id": 25549, "id": 137441, "time": "2010-06-08T09:14:39Z", "creator": "Patrick@Jaromin.com", "creation_time": "2010-06-08T09:14:39Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 49403, "attachment_id": null, "text": "Thanks for your code on spot colors, Patrick. I've kind of cherry-picked parts of your changes and adjusted those to the new color classes I've built in XML Graphics Commons.\n\nWhat I haven't added, yet, is to provide the CMYK fallback. So right now, the syntax for separation colors is:\n\nrgb-icc(R,G,B,'#Separation',spot-color-name[,tint-value])\n\nPDF will fall back to the sRGB value instead of the CMYK value, mostly because sRGB is a calibrated color space where as DeviceCMYK isn't. I'm not sure if the CMYK fallback is that important at all. I assume the fallback is mostly used on the computer screen. On the printer, you will want to have the separation color configured. If I decide to write support for NCPs (ICC named color profiles), I will likely use CIE Lab as the fallback. WDYT?\n\nI've started two branches for the color work:\nhttps://svn.apache.org/repos/asf/xmlgraphics/commons/branches/Temp_Color\nhttps://svn.apache.org/repos/asf/xmlgraphics/fop/branches/Temp_Color\n\nThe initial changes based on your work:\nhttp://svn.apache.org/viewvc?rev=957913&view=rev\n\nThis is all still work in progress! I'm keeping this issue open until the work on FOP and XGC is completed.", "id": 137897, "time": "2010-06-25T08:30:01Z", "creator": "jeremias@apache.org", "creation_time": "2010-06-25T08:30:01Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 49403, "text": "Patrick's changes along with mine are now in the color branch mentioned earlier. I've got the functionality running in production.\n\nThe initial commit with Patrick's work was: http://svn.apache.org/viewvc?view=revision&revision=957913\n\nI consider this issue closed. Only some cleanup and a merge back to trunk is left.\n\nThanks, Patrick!", "id": 139786, "time": "2010-09-09T09:08:00Z", "creator": "jeremias@apache.org", "creation_time": "2010-09-09T09:08:00Z", "is_private": false, "attachment_id": null}, {"text": "batch transition to closed; if someone wishes to restore one of these to resolved in order to perform a verification step, then feel free to do so", "tags": [], "bug_id": 49403, "attachment_id": null, "count": 3, "id": 155499, "time": "2012-04-01T06:19:16Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T06:19:16Z", "is_private": false}]