[{"count": 0, "tags": [], "bug_id": 49400, "attachment_id": null, "id": 137419, "time": "2010-06-07T16:07:01Z", "creator": "gavares@gmail.com", "creation_time": "2010-06-07T16:07:01Z", "is_private": false, "text": "I use the tasks defined in Apache Ant programatically to perform simple unix tasks such as deleting directories, untarring files, etc. When using these tasks in this fashion, I do not create instances of Project to pass to the classes.\n\nRecently, after using the Delete class successfully some time, I began calling:\n\n    delete.setFollowSymlinks(false)\n\nand started seeing NPE's after calling delete.execute(). Stacktrace:\n\nCaused by: java.lang.NullPointerException\n    at org.apache.tools.ant.types.AbstractFileSet.setupDirectoryScanner(AbstractFileSet.java:464)\n    at org.apache.tools.ant.types.AbstractFileSet.getDirectoryScanner(AbstractFileSet.java:430)\n    at org.apache.tools.ant.types.FileSet.size(FileSet.java:82)\n    at org.apache.tools.ant.types.resources.Resources$MyCollection.<init>(Resources.java:74)\n    at org.apache.tools.ant.types.resources.Resources.validate(Resources.java:229)\n    at org.apache.tools.ant.types.resources.Resources.isFilesystemOnly(Resources.java:162)\n    at org.apache.tools.ant.taskdefs.Delete.execute(Delete.java:587)\n\n\nThis was run using ant version 1.7.0. Looking into the source code for AbstractFileSet, line 464 is:\n\n            p.log(getDataTypeName() + \": Setup scanner in dir \" + dir \n            + \" with \" + ps, Project.MSG_DEBUG);\n\n\nIt seems like project is null at this line when the log statement is called. This problem does not occur if I do not call setFollowSymlinks.\n\nThis line corresponds with line 520 of AbstractFileSet in version 1.8.1."}, {"count": 1, "tags": [], "bug_id": 49400, "text": "Forgot to add that the following code does not cause NPE's.\n\n  Delete delete = new Delete();\n  delete.setProject(new Project());\n  delete.setFollowSymlinks(false);\n  delete.setDir(deleteDir);\n  delete.execute();", "id": 137420, "time": "2010-06-07T16:12:17Z", "creator": "gavares@gmail.com", "creation_time": "2010-06-07T16:12:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "bodewig@apache.org", "is_private": false, "id": 137444, "time": "2010-06-08T10:36:48Z", "bug_id": 49400, "creation_time": "2010-06-08T10:36:48Z", "tags": [], "text": "The report above says ant 1.8.1 but your comment says 1.7.0 - which version are you using when the bug occurs?\n\nIf the problem still exists in 1.8.1, please provide an updated stack trace.\n\nMany of Ant's tasks require a Project instance to work properly - for logging but sometimes they communicate via properties or references as well."}, {"count": 3, "tags": [], "bug_id": 49400, "text": "Setting the project is an explicit step in the lifecycle of each task, therefore you should always set the project instance, also when using ant task programatically, note that this is also valid for the Location and Target, these items are explicitly stated in the manual.\nThese can be set using setProject, setLocation and setOwningTarget.\n\nThe workaround you describe actually solves a part of the bug in your code, in such way that you are not hitting a bug anymore. Though the code still does not obey the lifecycle of the task.", "id": 137450, "time": "2010-06-08T13:53:28Z", "creator": "jkf@apache.org", "creation_time": "2010-06-08T13:53:28Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": " It seems like a bad thing for logging statements to cause NPE's or, more generally, for logging statements to halt the execution of code. \n\nThis isn't a significant problem, and I admit that I'm using the and tasks outside the scope of their original intent so perhaps this shouldn't be a bug.(In reply to comment #3)\n> Setting the project is an explicit step in the lifecycle of each task,\n> therefore you should always set the project instance, also when using ant task\n> programatically, note that this is also valid for the Location and Target,\n> these items are explicitly stated in the manual.\n> These can be set using setProject, setLocation and setOwningTarget.\n> \n> The workaround you describe actually solves a part of the bug in your code, in\n> such way that you are not hitting a bug anymore. Though the code still does not\n> obey the lifecycle of the task.\n\nFair enough, although I would like to make the point that it seems like a bad thing for logging statements to cause NPE's or, more generally, for logging statements to halt the execution of code. \n\nThis isn't a significant problem, and I admit that I'm using the and tasks outside the scope of their original intent so perhaps this sh0ouldn't be a bug.", "is_private": false, "id": 137452, "creator": "gavares@gmail.com", "time": "2010-06-08T14:07:22Z", "bug_id": 49400, "creation_time": "2010-06-08T14:07:22Z", "attachment_id": null}]