[{"count": 0, "tags": [], "bug_id": 49413, "attachment_id": 25565, "text": "Created attachment 25565\nmod_jk.log in the debug mod\n\nHi All\nMy application has been working just fine with of Jboss 4.3.0 and tomcat engine.\nWe decided to upgrade the connector from version 1.2.28 and 1.2.30 we are using apache 2.2.15\nWe are experiencing errors in the mod_jk log and as the result some of the pages in my app are not displaying right, the same pages display fine with the an1.2.28.\nI start to think that it could be the size of the chunked data between the connector and the tomcat because I see this error.\nUnexpected AJP13_SEND_BODY_CHUNK\n(myapp) sending request to tomcat failed (recoverable), because of server error (attempt=1)\n[Wed Jun 09 06:47:14.545 2010] [5900:2248] [debug] jk_connect.c (722): About to shutdown socket 784\n\nProblem is reproducible with the new connector 1.2.30 but not the previous version.\n\n\n\nI have attached the log in the debug mod, have you seen these types of errors?", "id": 137485, "time": "2010-06-09T07:12:05Z", "creator": "osaloum@hotmail.com", "creation_time": "2010-06-09T07:12:05Z", "is_private": false}, {"count": 1, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "id": 137486, "time": "2010-06-09T07:53:41Z", "bug_id": 49413, "creation_time": "2010-06-09T07:53:41Z", "is_private": false, "text": "I think you hit the following JBoss bug. If you have a support contract with them, please raise an issue there. You should mention, which AJP connector in JBoss you are using:\n\nSince I will refer to those types, as a reminder here's the list of AJP\npacket types used by the backend:\n\n3  \tSend Body Chunk\n4 \tSend Headers\n5 \tEnd Response\n6 \tGet Body Chunk\n9 \tCPong Reply\n\nWhat happens is, that after mod_jk sends the request, JBoss responds, sending\ntype \"3\" packets containing the response data, and after the final response packet it send a type \"5\" packet with the reuse bit set, which tells mod_jk that the response is finished.\n\nSo far everything is fine.\n\nNow very shortly after that, the backend sends another type \"3\" packet with data of size \"0\" over the same connection. That's the packet that is not allowed and breaks the protocol. mod_jk doesn't consume that packet, because packet type \"5\" ends response processing. The packet stays in the connection buffer. I think that happens only for some JBos AJP connectors, but I don't know which of them.\n\nWhen the next request arrives, mod_jk sends the request headers and expects a type \"6\" packet from the backend. Instead it reads the old type \"3\" packet still in the buffer and throws an error because of a protocol corruption.\n\nTo sum up: the problem is JBoss sending an empty type \"3\" packet after\nthe response is finished. It doesn't happen for all requests, but it\nhappens quite often. It is not unlikely that the error is triggered by\nstrange webapp behaviour, but the webapp should not be able to corrupt\nthe AJP 13 protocol.\n\nOther users exhibit the same probem when enabling cping/cpong. Then the erroneous type \"3\" packet is detected when waiting for the cping answer of type \"9\" and triggers again a failure. That failure also leads to closing the connection, but might be handled a bit faster and more transparent from the point of view of the browser and application.\n\nI'll mark this as invalid, because we made mod_jk stricter on protocol checks for security reasons. Feel free to reopen if you find any information that contradicts my explanation. Please let us know how JBoss responds.\n\nRainer"}, {"count": 2, "tags": [], "bug_id": 49413, "attachment_id": null, "text": "Adding to self:\n\nProblem seems to be spurious flush packets coming from the backend. Could be a webapp problem but still the app server should not send them after finishing the request. A similar problem, sendng flushes before the headers existed a while ago.\n\nOn the other hand we already fixed the cping/cpong problem by silently consuming flushes (nothing else) even when not allowed by protocol.\n\nSo could you please test the following patch:\n\nhttp://people.apache.org/~rjung/patches/mod_jk-trunk-ignore-flush-while-sending-request.patch\n\nIt drops those flush packets. \n\nThanks!\n\nNevertheless also talking to JBoss makes sense.", "id": 137488, "time": "2010-06-09T08:41:23Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2010-06-09T08:41:23Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 49413, "attachment_id": null, "text": "Thanks for the detailed explanation\nWould anyone knows of the patch will be integrated with future release of the Mod_jk.?\nAlso is there a nightly build of the mod_jk?, I have been using the binary from the Apache foundation and not compiling the module. We only compile the module for Solaris and AIX, but for windows we go with the binaries, but I will compile if there is no binaries available.", "id": 137542, "time": "2010-06-10T10:01:27Z", "creator": "osaloum@hotmail.com", "creation_time": "2010-06-10T10:01:27Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 49413, "attachment_id": null, "text": "(In reply to comment #3)\n> Would anyone knows of the patch will be integrated with future release of the\n> Mod_jk.?\n\nYes, that's the plan at the moment, subject to further testing. The patch is already part of the source tree used to cut the next release.\n\n> Also is there a nightly build of the mod_jk?, I have been using the binary from\n> the Apache foundation and not compiling the module. We only compile the module\n> for Solaris and AIX, but for windows we go with the binaries, but I will\n> compile if there is no binaries available.\n\nUnfortunately no nightly builds. It would be nice, if you could do the build on windows yourself.\n\nRegards,\n\nRainer", "id": 137543, "time": "2010-06-10T10:08:26Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2010-06-10T10:08:26Z", "is_private": false}, {"count": 5, "tags": [], "creator": "rainer.jung@kippdata.de", "text": "The patch was applied as r952980 and is contained in version 1.2.31 and beyond.\nIf you think the bug is still in the latest version 1.2.32 please reopen.", "id": 150919, "time": "2011-10-25T19:20:44Z", "bug_id": 49413, "creation_time": "2011-10-25T19:20:44Z", "is_private": false, "attachment_id": null}]