[{"count": 0, "tags": [], "creator": "stoehr_sukachevin@hotmail.com", "attachment_id": null, "text": "Setting the HTTP \"Connection\" header to \"close\" does not take affect by a Java \nservlet.  Note that this servlet sets all response header fields (including \nthe \"Connection\" and \"Content-Length\" fields) before writing out the response \nbody via the servlet output stream.\n\nIt appears that the \norg.apache.catalina.connector.http.HttpResponseStream#checkChunking\n(HttpResponseImpl) method arbitrarily removes the \"Connection\" header if \nchunking should not be done; however, this prevents the servlet from forcing \nthe current connection to close after the processing is completed.\n\nIt seems reasonable for servlets to specify to close the current connection.  \nPossible uses might be to help combat denial-of-service attacks, for example.\n\nMy particular motivation for closing the connection is because clients to my \nservlet (a Java application) in general try to re-use the connection to the \nservlet as much as possible (so the clients will never on their own \"release\" \nthe connection and use a new one).  My servlet, therefore, would like to be \nable to close the current connection when a max count is reached for a \nparticular HTTP session so that the corresponding client would use a new \nconnection, and ultimately our server-side system will be free to handle more \nquasi-concurrent clients than otherwise.  (Even though the client has a config \nparameter to limit the number of HTTP requests/responses over a single socket \nconnection, we would like to have more control and force a maximum on the \nserver-side.)", "id": 8035, "time": "2001-11-18T14:11:35Z", "bug_id": 4942, "creation_time": "2001-11-18T14:11:35Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 4942, "attachment_id": null, "id": 8036, "time": "2001-11-18T14:18:52Z", "creator": "stoehr_sukachevin@hotmail.com", "creation_time": "2001-11-18T14:18:52Z", "is_private": false, "text": "Sorry, I think this was already been fixed since the beginning of this month \n(HttpResponseStream.java version 1.10 and 1.7.2.2)."}, {"count": 2, "tags": [], "text": "Yes, it has been fixed already.\n\nI don't think it's a good idea to try to think too much about connection \nhandling in the servlet itself. That's really not going to help in any \nsignificant way avoid a DoS attack, so I advise against it; just let the \ncontainer take care of this part of the job.", "is_private": false, "id": 8039, "creator": "remm@apache.org", "time": "2001-11-18T18:03:13Z", "bug_id": 4942, "creation_time": "2001-11-18T18:03:13Z", "attachment_id": null}]