[{"count": 0, "tags": [], "creator": "mguillemot@yahoo.fr", "text": "Created attachment 25582\nPatch (with unit test) fixing the problem for the ManagerServlet\n\nThe manager app shows message using the server's default locale whereas it should react on the request Locale.\n\nThe cause is that the ManagerServlet uses StringManager what is fine for messages that are logged but not for those that are sent as responses.\n\nThe attached patch fixes the problem for the ManagerServlet but not for the HTMLManagerServlet. It will require a bit more refactoring there because the same messages may be intended for log or for output to the response. I can propose a second patch for it once the problem has been fixed for the ManagerServlet.\n\nFor info: same problem occurs in Tomcat 6.", "id": 137562, "time": "2010-06-11T03:26:07Z", "bug_id": 49426, "creation_time": "2010-06-11T03:26:07Z", "is_private": false, "attachment_id": 25582}, {"count": 1, "tags": [], "bug_id": 49426, "text": "Created attachment 25583\nRight patch (with unit test) fixing the problem for the ManagerServlet   (\n\nOops previous patch contained changes for HTMLManagerServlet that are not ready yet. Attached the right version of the patch.", "id": 137563, "attachment_id": 25583, "creator": "mguillemot@yahoo.fr", "creation_time": "2010-06-11T03:31:50Z", "time": "2010-06-11T03:31:50Z", "is_private": false}, {"count": 2, "tags": [], "text": "-1 to the patch as currently written. It isn't thread safe.", "attachment_id": null, "bug_id": 49426, "id": 137604, "time": "2010-06-13T16:52:36Z", "creator": "markt@apache.org", "creation_time": "2010-06-13T16:52:36Z", "is_private": false}, {"count": 3, "tags": [], "creator": "mguillemot@yahoo.fr", "attachment_id": null, "id": 137607, "time": "2010-06-14T03:13:31Z", "bug_id": 49426, "creation_time": "2010-06-14T03:13:31Z", "is_private": false, "text": "OK, you're right. What about holding the ResourceBundle in a ThreadLocal?"}, {"count": 4, "tags": [], "text": "(In reply to comment #3)\n> OK, you're right. What about holding the ResourceBundle in a ThreadLocal?\n\nGiven all the issues we have seen with memory leaks and ThreadLocals I'd rather not.\n\nSome additional thoughts:\n- we could just pass the Locale around with the writer\n- I wonder how hard it would be to extend StringManager (efficiently - which may be the slightly tricky bit) to support multiple Locales\n- in determining which Locale to use we need to call request.getLocales() and check each in turn until we find a suitable match.", "attachment_id": null, "id": 137639, "creation_time": "2010-06-14T17:48:05Z", "time": "2010-06-14T17:48:05Z", "creator": "markt@apache.org", "bug_id": 49426, "is_private": false}, {"count": 5, "tags": [], "bug_id": 49426, "text": "(In reply to comment #4)\n> (In reply to comment #3)\n> > OK, you're right. What about holding the ResourceBundle in a ThreadLocal?\n> \n> Given all the issues we have seen with memory leaks and ThreadLocals I'd\n> rather not.\n> \n> Some additional thoughts:\n> - we could just pass the Locale around with the writer\n\nthis would be the only solution when ThreadLocal is not wanted. I didn't want to choose this way as it means more changes but I can do it.\nRather than passing writer and Locale (or ResourceBundle) everywhere along the way, I could imagine having a wrapper for both.\n\n> - I wonder how hard it would be to extend StringManager (efficiently - which\n> may be the slightly tricky bit) to support multiple Locales\n\nthis wouldn't solve previous point: you have to be able to access the Locale each time you need to get a String.\nAdditionally StringManager is quite useless. StringManager's cache doesn't make sense as java.util.ResourceBundle has already one. This means that the only value of StringManager is the facility method getString(final String key, final Object... args).\n\n> - in determining which Locale to use we need to call request.getLocales() and\n> check each in turn until we find a suitable match.\n\nthis is correct. I didn't do it to keep the patch smaller in a first time but I can adapt patch (including unit test) for that now if you want.", "id": 137643, "attachment_id": null, "creator": "mguillemot@yahoo.fr", "creation_time": "2010-06-15T03:11:56Z", "time": "2010-06-15T03:11:56Z", "is_private": false}, {"count": 6, "tags": [], "text": "Fixed in trunk and will be in 7.0.5 onwards.", "attachment_id": null, "id": 140778, "creation_time": "2010-10-16T15:32:32Z", "time": "2010-10-16T15:32:32Z", "creator": "markt@apache.org", "bug_id": 49426, "is_private": false}]