[{"count": 0, "tags": [], "bug_id": 49464, "text": "DefaultServlet doesn't set a character encoding. As per spec the encoding of the page is asssumed to be iso-8859-1. \n\nIf files are served with a different encoding, this can lead to display problems in the browser.\n\nThe problem has been discussed in http://old.nabble.com/DefaultServlet-doesn%27t-set-charset-td18893115.html#a18929527\nIn http://marc.info/?l=tomcat-user&m=127678462332564&w=2 another component was added - namely mod_jk/httpd - which set a character encoding on its own, if no character set was set previously.\n\nThere are at least three different solutions for this problem. \n\nOne of them is extending DefaultServlet to be configurable to include a charset in the response. A patch has been proposed by Markus Schönhaber (MKS) and can be found at\n  http://www.ddt-consult.de/sendCharset.patch\n\nThe two other solutions which were discussed are\n * configure httpd/mod_jk properly by adding AddDefaultCharset ENCODING to the right location/host\n * Use a filter to set the character encoding\n\nAll in all I still think it would be a good idea to explicitly set the wanted encoding in the first possible place, which is the DefaultServlet.", "id": 137744, "time": "2010-06-18T08:13:17Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2010-06-18T08:13:17Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 49464, "attachment_id": null, "id": 199509, "time": "2017-06-30T16:27:46Z", "creator": "markt@apache.org", "creation_time": "2017-06-30T16:27:46Z", "is_private": false, "text": "I've been digging into this and I think the situation is a little more complicated.\n\nThere are three scenarios to consider:\na) directly returning a file\nb) including a file into an output stream\nc) including a file into a writer\n\na) is the simple case. We can set the character encoding to be the effective value of fileEncoding (i.e. the value or system default it not set)\n\nb) and c) are trickier. In both cases we need to read the input as characters (conversion form bytes via fileEncoding). Then for b) we need to write it out again using whatever output encoding has been set on the response. c) we can just write the characters and let the write handle it.\n\nI think that covers all the cases although some edge cases may emerge as I dig into this.\n\nAs far as I can see this can all be done without any additional configuration options. I'm not so sure it can be done without changing some method signatures. While those methods are protected and internal to Tomcat, the default servlet is something that tend to get 'tweaked' by users so we'll need to tread carefully if we back-port any of this."}, {"count": 2, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "text": "(In reply to Mark Thomas from comment #1)\n> I've been digging into this and I think the situation is a little more\n> complicated.\n> \n> There are three scenarios to consider:\n> a) directly returning a file\n> b) including a file into an output stream\n> c) including a file into a writer\n> \n> a) is the simple case. We can set the character encoding to be the effective\n> value of fileEncoding (i.e. the value or system default it not set)\n\nWhat if web.xml contains a <mime-type> which includes a charset parameter? I think respecting that parameter would be good if possible.\n\n> b) and c) are trickier. In both cases we need to read the input as\n> characters (conversion form bytes via fileEncoding). Then for b) we need to\n> write it out again using whatever output encoding has been set on the\n> response. c) we can just write the characters and let the write handle it.\n\nI'm assuming that binary file types are basically out-of-scope here, right?\n\n> I think that covers all the cases although some edge cases may emerge as I\n> dig into this.\n> \n> As far as I can see this can all be done without any additional\n> configuration options. I'm not so sure it can be done without changing some\n> method signatures. While those methods are protected and internal to Tomcat,\n> the default servlet is something that tend to get 'tweaked' by users so\n> we'll need to tread carefully if we back-port any of this.\n\n+1", "id": 199516, "time": "2017-06-30T21:13:36Z", "bug_id": 49464, "creation_time": "2017-06-30T21:13:36Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 199518, "time": "2017-06-30T21:40:08Z", "bug_id": 49464, "creation_time": "2017-06-30T21:40:08Z", "is_private": false, "text": "If the response character encoding is set (via any of the available means to do so) then the patch will respect that.\n\nCorrect, binary files are out of scope. I'll double check the patch doesn't impact them.\n\nFixed in:\n- trunk for 9.0.0.M23 onwards\n- 8.5.x for 8.5.17 onwards\n- 8.0.x for 8.0.46 onwards\n- 7.0.x for 7.0.80 onwards"}, {"count": 4, "tags": [], "bug_id": 49464, "attachment_id": null, "id": 199519, "time": "2017-06-30T21:48:49Z", "creator": "markt@apache.org", "creation_time": "2017-06-30T21:48:49Z", "is_private": false, "text": "Whoops. Binary files are caught in this. That needs fixing. Thanks for the hint."}, {"count": 5, "tags": [], "creator": "markt@apache.org", "text": "And fixed. Same versions as above.", "id": 199520, "time": "2017-06-30T22:03:03Z", "bug_id": 49464, "creation_time": "2017-06-30T22:03:03Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 49464, "text": "Re-opening. The first attempt at fixing this triggered a series of regressions. The fix has therefore been reverted in 7.0.x, 8.0.x and 8.5.x.\n\nThis needs more careful consideration. The end result may be that it is only fixed for 9.0.x", "id": 200118, "time": "2017-07-31T10:22:57Z", "creator": "markt@apache.org", "creation_time": "2017-07-31T10:22:57Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 49464, "text": "With a significant increase in the number of unit tests and a number of additional regressions fixed, this is now fixed again for 9.0.x.\n\nGiven the history of regressions, I do not propose back-porting this to earlier versions as this time.", "id": 200122, "time": "2017-07-31T19:49:02Z", "creator": "markt@apache.org", "creation_time": "2017-07-31T19:49:02Z", "is_private": false, "attachment_id": null}]