[{"count": 0, "attachment_id": 25617, "bug_id": 49467, "text": "Created attachment 25617\nClipped vs Masked\n\nWhen a shape is clipped, the rasterized clipped shape is aliased. If the same shape is masked, the masked shape is not aliased.\n\nsvg example in attachment done with Inkscape 0.46", "id": 137750, "time": "2010-06-19T07:48:16Z", "creator": "jfhren@yahoo.fr", "creation_time": "2010-06-19T07:48:16Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 49467, "is_private": false, "id": 139348, "time": "2010-08-22T13:21:25Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2010-08-22T13:21:25Z", "tags": [], "text": "The SVG spec. states that:\n\n\"A clipping path can be thought of as a mask wherein those pixels outside the clipping path are black with an alpha value of zero and those pixels inside the clipping path are white with an alpha value of one (with the possible exception of anti-aliasing along the edge of the silhouette)\" [1]\n\nSo, although it made sense, IMHO, that Batik would apply \"anti-aliasing along the edge of the silhouette\" (given that it supports anti-aliasing), AFAIK it is not nonconforming behavior. Lowering severity to \"enhancement\", as it is what it should be (please correct me if I'm wrong!).\n\nConfirm this still reproduces in 1.8-pre using the current trunk code, using Oracle's JDK 1.6.0_21.\n\n[1] http://www.w3.org/TR/SVG11/masking.html#ClippingPaths"}, {"count": 2, "tags": [], "creator": "deweese@apache.org", "text": "(In reply to comment #0)\n> Created an attachment (id=25617) [details]\n> Clipped vs Masked\n> \n> When a shape is clipped, the rasterized clipped shape is aliased. If the same\n> shape is masked, the masked shape is not aliased.\n> \n> svg example in attachment done with Inkscape 0.46\n\n   The SVG spec allows for hard edged and/or antialiased clipping.\nBatik supports both through the use of the shape-rendering=\"geometricPrecision\" rendering hint on the clipPath element.\n\n   The advantage of this is that hard edged clipping is typically much faster than anti-aliased.\n\n   See samples/test/spec/masking/clipQuality.svg for an example.", "id": 139354, "time": "2010-08-22T21:48:24Z", "bug_id": 49467, "creation_time": "2010-08-22T21:48:24Z", "is_private": false, "attachment_id": null}]