[{"count": 0, "tags": [], "text": "Created attachment 25612\nAttached jmx file with bug reproduction. Just load & run.\n\nThe Cookie Manager is not working as we expect in case you use a Counter element inside a Loop Controller that should update the cookie value.\n\nI use a Counter that increments a variable, and use this variable inside a Cookie Manager and inside a HTTP Header Manager. The result is that inside the Cookie Manager, the variable appears with different values than in the HTTP Header Manager and also the variable values are repeating (which it's not possible because the counter generates a unique value each iteration).\n\nSee the attached .jmx file for complete description and bug reproduction.", "attachment_id": 25612, "id": 137737, "creator": "radu.leterna@softvision.ro", "time": "2010-06-18T07:05:42Z", "bug_id": 49462, "creation_time": "2010-06-18T07:05:42Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 49462, "text": "Hello,\nThe difference in behaviour is due to the fact that CookieManager implements an empty:\n1) recoverRunningVersion\n2) setRunningVersion\n\nThis causes recoverRunningVersion not to be subsequently called on Cookie which explains why value is not the same as HeaderManager.\nHeaderManager calls recoverRunningVersion on FunctionProperty  which will ends up resetting cachedValue to null so recompute it at each iteration..\nThis behaviour seems to be voluntary (sebb, milamber you confirm ?) to keep SessionID for example but maybe it should be documented or modified if it's a bad side effect.\nRegards\nPhilippe", "id": 149192, "time": "2011-09-13T17:28:11Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-09-13T17:28:11Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 149452, "time": "2011-09-18T09:31:04Z", "bug_id": 49462, "creation_time": "2011-09-18T09:31:04Z", "is_private": false, "text": "Works for me in the latest SVN trunk (which will be 2.5.1).\n\nThis was possibly fixed by the changes for Bug 48943."}]