[{"count": 0, "tags": [], "text": "Created attachment 25620\noriginal file and corrupted file\n\nIf the xls file has a 'Chart sheet', poi method Workbook.write(OutputStream) will corrupt the file. Excel 2007 and earlier does not show the corruption, but Excel 2010 will detect the corruption and show it. \n\nWhat we have done here is straightforward. We use HSSFWork's constructor, HSSFWorkbook(FileInputStream) to read a xls file with Chart sheet from disk, and directly write it back using method Workbook.write(OutputStream). The file is corrupted afterwards.\n\nI attached a zip file here including: 1. the original xls file, 2. the corrupted file, and 3. the screen shot from Excel 2010 when opening the corrupted file.", "is_private": false, "id": 137764, "creator": "thomasj@geotab.com", "time": "2010-06-19T16:50:38Z", "bug_id": 49472, "creation_time": "2010-06-19T16:50:38Z", "attachment_id": 25620}, {"count": 1, "tags": [], "bug_id": 49472, "text": "I believe that this is very critical bug.", "id": 139044, "time": "2010-08-10T16:18:49Z", "creator": "thomasj@geotab.com", "creation_time": "2010-08-10T16:18:49Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 49472, "text": "If this is critical for you, then do please do some investigating on it!\n\nWhat's the simplest file that will show the corruption? What's the most complex one that won't? For the simplest file that excel complains about, how does the file differ between the excel version and the poi version? What does BiffViewer show as having been changed between the two? Are there records that are missing in one? Are records in a different order? Have flags on key records been changed? If you open the file in excel 2007, and save it, can excel 2010 read it? What changed? etc", "id": 139048, "time": "2010-08-11T06:24:10Z", "creator": "apache@gagravarr.org", "creation_time": "2010-08-11T06:24:10Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 49472, "attachment_id": null, "is_private": false, "id": 139262, "time": "2010-08-19T17:42:02Z", "creator": "mp_i@hotmail.com", "creation_time": "2010-08-19T17:42:02Z", "text": "I have just hit this issue with an application in Production. Currently the application uses POI (v3.6) HSSF to output Excel 2003 workbooks. With no coding changes, if I open the application output with Excel 2010 I see the red error indicator.\n\nIf I save the file using 2010 and open again then there is no error and all data appears to be there.\n\nThe same (2003) file can be opened using 2010 without error outside of the application; it's only when POI is involved that the error presents.\n\nThe workbook I'm using doesn't have chart sheets; rather, it has a bunch of sophisticated macros, named ranges, a hidden sheet of reference data and a displayed sheet of data that a user can use to enter data and select from dropdowns.\n\nLet me know if there's anything I can do to help. (I've never debugged through POI before.)\n\nThanks,\nMark."}, {"count": 4, "tags": [], "bug_id": 49472, "attachment_id": null, "text": "Mark, \n\nWhat you observed is correct. Only when POI is involved, the error will come up, and only if there is a Chart sheet in the xls. I never tried with sophisticated macros, but I do have a lot of complicated formulas, named ranges etc. all the time, and never had problem with them.\n\nI can also open the file with Excel 2010 with the error indicator. Nothing prevents me from opening it. However, in my application, I use Office OLE automation to open the file, and it will fail for this corrupted file if Excel 2010 is installed on the computer.\n\nThanks,\nThomas", "id": 139297, "time": "2010-08-20T16:31:12Z", "creator": "thomasj@geotab.com", "creation_time": "2010-08-20T16:31:12Z", "is_private": false}]