[{"count": 0, "tags": [], "bug_id": 49473, "text": "Created attachment 25621\nPatch for requested enhancement\n\nHi guys,\n\nI'm loving the new 1.8 extension point functionality.\n\nI'm working on a project which has multiple deployable components (\"services\") and has separate build and deploy scripts. I'd like to use extension points to be able to write a single \"descriptor\" for any given service in order to centralise the definitions of services which are currently sprinkled liberally throughout the build and deploy scripts.\n\nThe problem I have is that some of the targets in the descriptor are extensions of extension points in the build script (and are only used during build) and some are extensions of extension points in the deploy script (and are only used during deployment). Of course, this doesn't work because ProjectHelper2 tries to verify the existence of an extension point during project file parsing and which extension points are present is a function of whether the importing script is the build script or the deploy script.\n\nI've made some changes to add an \"extension-point-missing\" attribute which takes values:\n- \"error\" - the current behaviour (and default if the attribute is missing)\n- \"warn\" - log a warning and ignore (see next)\n- \"ignore\" - don't stop or warn, and don't add the extension target as a dependency of the (non-existent) extension point\n\nI've attached a patch for consideration for Ant 1.8.2\n\nThanks", "id": 137766, "time": "2010-06-19T19:08:21Z", "creator": "danny@codeaholics.org", "creation_time": "2010-06-19T19:08:21Z", "is_private": false, "attachment_id": 25621}, {"attachment_id": 25622, "tags": [], "bug_id": 49473, "text": "Created attachment 25622\nPatch for documentation\n\nAdded patch for documentation", "count": 1, "id": 137767, "time": "2010-06-19T19:24:25Z", "creator": "danny@codeaholics.org", "creation_time": "2010-06-19T19:24:25Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 49473, "text": "patches are in with some modifications (naming, in particular) with svn revision 957170\n\nMany thanks!", "count": 2, "id": 137839, "time": "2010-06-23T08:16:12Z", "creator": "bodewig@apache.org", "creation_time": "2010-06-23T08:16:12Z", "is_private": false}]