[{"attachment_id": null, "tags": [], "bug_id": 49497, "text": "When Tomcat performs shutdown, it pauses its connectors, then all web applications, and then stops the connectors.\n\nIn my understanding, pause() should stop Tomcat from accepting new requests from clients,  to give it time to complete requests that are currently being processed. The stop() call will close the sockets, and thus will abort request processing.\n\n\nThe problem is that the default (aka Bio) HTTP/1.1 connector of TC 6.0 behaves differently: when endpoint is paused, connector stops to accept new connections, but it still continues to accept new requests over existing keep-alive connections. I think it is not a feature, but a bug.\n\nTo reproduce:\n1. Start Tomcat\n2. Open http://localhost:8080/ in Firefox\n3. Start jconsole, connect to Tomcat, select MBean for the Connector on port 8080 and invoke its pause() method.\n4. Actual behaviour: In Firefox you can still open other pages of the web site, in spite of Connector being paused.\n\nThis issue does not affect Apr and Nio HTTP/1.1 connectors. In their case an attempt to navigate to another page of the site results in browser waiting for response from Tomcat.\n\n\nTo fix it, one has to modify the loop in Http11Processor#process() to check for the current value of endpoint.isPaused().\n\nCaveat/separate issue: when the current Apr/Nio implementations are paused, they stop accepting the requests, but the keep-alive connection is still kept open. Maybe they should close the connection? On second thought, though, it makes a difference only if there is some load balancer in front of several Tomcats. Otherwise closing the connection will be just annoying, because a user will be tempted to immediately repeat the request, but Tomcat instance is still paused and will not be able to process it.\n\nTested with 6.0.27, WinXP, Firefox 3.6.4.\n\nThis bug report was inspired by the following comment in StandardService.stop():\n// FIXME pero -- Why container stop first? KeepAlive connetions can send request!", "count": 0, "id": 137876, "time": "2010-06-24T08:15:31Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2010-06-24T08:15:31Z", "is_private": false}, {"attachment_id": 26094, "tags": [], "bug_id": 49497, "text": "Created attachment 26094\nProposed patch", "count": 1, "id": 140262, "time": "2010-09-28T07:53:16Z", "creator": "markt@apache.org", "creation_time": "2010-09-28T07:53:16Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 49497, "text": "Fixed in 6.0.x and will be included in 6.0.30 onwards.", "id": 141368, "time": "2010-11-03T15:03:16Z", "creator": "markt@apache.org", "creation_time": "2010-11-03T15:03:16Z", "is_private": false, "attachment_id": null}]