[{"count": 0, "tags": [], "bug_id": 49493, "attachment_id": 25632, "is_private": false, "id": 137851, "time": "2010-06-23T10:56:51Z", "creator": "Clement_Pellerin@ibi.com", "creation_time": "2010-06-23T10:56:51Z", "text": "Created attachment 25632\nsource code patch with new junit\n\nDuring decryption, XMLCipher needs to find the key to decrypt an encrypted key. The kek can be provided by the caller, otherwise XMLCipher can call the KeyResolvers to resolve the kek. The KeyResolvers work fine if the Key Encryption Key is a symmetric key because the SecretKey can be returned by KeyInfo.getSecretKey(). When the Key Transport algorithm is RSA-1.5 or RSA-OAEP, the key we need is a PrivateKey and there are no calls that can return an object of this type.\n\nTo reproduce use the junit included in the source patch attached to the bug.\n\nThe solution is to introduce a new method called engineLookupAndResolvePrivateKey() in the KeyResolverSpi base class. The new method returns a PrivateKey. In XMLCipher, we now check which algorithm was used to encrypt the key, and if the kek type is RSA, we resolve a PrivateKey instead of a SecretKey.\n\nNotice the StorageResolvers have no way to return a PrivateKey either.\nTo avoid controversy, the proposed solution does not affect StorageResolver. The custom KeyResolver implementing engineLookupAndResolvePrivateKey() must know a source of PrivateKeys other than StorageResolver. This explains why the StorageResolver argument of engineLookupAndResolvePrivateKey() is always null.\nThe hope is that one day new APIs will be added to StorageResolver and we'll be able to pass StorageResolvers in the existing argument.\n\nThis solution does not depend on Bug 49465, but both are needed to allow PrivateKey KeyResolvers per KeyInfo."}, {"count": 1, "tags": [], "bug_id": 49493, "attachment_id": null, "text": "\nPatch applied, thanks:\n\nSending        CHANGELOG.txt\nSending        src/org/apache/xml/security/encryption/XMLCipher.java\nSending        src/org/apache/xml/security/keys/KeyInfo.java\nSending        src/org/apache/xml/security/keys/keyresolver/KeyResolverSpi.java\nSending        src/org/apache/xml/security/keys/keyresolver/implementations/RetrievalMethodResolver.java\nSending        src_unitTests/org/apache/xml/security/test/ModuleTest.java\nAdding         src_unitTests/org/apache/xml/security/test/keys/keyresolver\nAdding         src_unitTests/org/apache/xml/security/test/keys/keyresolver/KeyResolverTest.java\nTransmitting file data .......\nCommitted revision 1003198.\n\nColm.", "id": 140332, "time": "2010-09-30T14:41:10Z", "creator": "coheigea@apache.org", "creation_time": "2010-09-30T14:41:10Z", "is_private": false}]