[{"count": 0, "tags": [], "bug_id": 49520, "attachment_id": null, "text": "This is a duplicate request from the Tomcat 6 (Bug 48960). See proposed solution/discussion:\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=48960\n\nThe current configuration of the SSI module is \"All\" or \"None\". The \"ALL\"\noption will expose all the legacy Apache SSI directive (echo, printenv, if,\nexec, ...). As documented, allowing SSI will allow execution of arbitrary\nprograms using the \"exec\". As a result, there is no safe way to expose\nsites/projects containing SSI directive, without taking a security risk, or\nreviewing of every file.\n\nThe \"exec\" directive, with the cmd option is a major risk. Even for Apache, you\nhave the option to allowing the \"safe\" include (includeNoExec). The\nincludeNoExec allow pages to be served, even when the content is not reviewed,\nor when users are allowed to upload content to the site.\n\nI have a big site which need to be converted into JSP. I would like to use the\nSSI servlet to allow for transition over time. The extra risk from ( from exec\ncmd) make it impossible to deploy the SSI.\n\nMy request: Modify the configuration of SSI as follow: By default, it will only\nallow \"safe\" directive (no exec cmd=...). This will eliminate the risk from\narbitrary execution of commands (\"del *.*\"). It will also remove many potentail\nload problems. The cmd= should only be allowed using a directive like\n\"allowUnsafeExec\", which will default to false.\n\nI think that the change will make it easier to use the SSI feature, without\nexposing the server to big risk. The risk associated with the \"safer\" version\nof SSI is similar to the risk from running JSP pages.\n\nA better alternative is to eliminate the \"exec cmd=\" option alltogether.", "id": 137982, "time": "2010-06-29T09:50:10Z", "creator": "yair.lenga@citi.com", "creation_time": "2010-06-29T09:50:10Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "We don't create issues for each version. Any issue reported against major version X, will get fixed (if applicable) in all major versions >= X. It may also, depending on the severity of the issue, get fixed in major versions < X as well.\n\n*** This bug has been marked as a duplicate of bug 48960 ***", "id": 138000, "time": "2010-06-29T12:45:54Z", "bug_id": 49520, "creation_time": "2010-06-29T12:45:54Z", "is_private": false}]