[{"count": 0, "tags": [], "creator": "mguillemot@yahoo.fr", "is_private": false, "id": 138452, "attachment_id": 25766, "bug_id": 49600, "creation_time": "2010-07-16T05:38:47Z", "time": "2010-07-16T05:38:47Z", "text": "Created attachment 25766\nUnit tests illustrating the problems\n\nTwo problems with exception thrown by ProxyDirContext.lookup\n\n- ProxyDirContext.lookup throws notFoundException when the entry doesn't exist. notFoundException is a field and therefore initialized at ProxyDirContext creation.\n\nThe consequence is that the exception thrown contains a stacktrace that has nothing to do with the current execution stack. This makes difficult to find the root cause of a problem. If this is really an optimization (what is the gain), then what about making this field static?\n\n- ProxyDirContext.lookup is not consistent: for the same call it may throw NamingException or NameNotFoundException depending whether the cache has been used or not.\n\nProblems occur in Tomcat 6 and 7."}, {"count": 1, "tags": [], "bug_id": 49600, "text": "The gain by using notFoundException is in GC. It prevents exception objects being created for resources that don't exist. I agree it could be static (final too).", "id": 138610, "time": "2010-07-21T14:05:57Z", "creator": "markt@apache.org", "creation_time": "2010-07-21T14:05:57Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "markt@apache.org", "text": "Thanks for the test case. I kept the \"not Found\" test (with a minor modification\" but not the strack trace test.\n\nThe returned exceptions have been made consistent for 7.0.x and will be included in 7.0.1 onwards.", "count": 2, "id": 138618, "time": "2010-07-21T16:33:07Z", "bug_id": 49600, "creation_time": "2010-07-21T16:33:07Z", "is_private": false}, {"count": 3, "attachment_id": null, "creator": "mguillemot@yahoo.fr", "is_private": false, "id": 138630, "time": "2010-07-22T02:50:00Z", "bug_id": 49600, "creation_time": "2010-07-22T02:50:00Z", "tags": [], "text": "Can you explain why GC gain are considered at this special place in detriment of a correct exception? \n\nFor me if GC gain is an argument, then there are so many other places in Tomcat where it should apply. This starts with the BaseDirContext.lookup that you've fixed to address the \"not Found\" point of this case."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 138632, "time": "2010-07-22T09:42:03Z", "bug_id": 49600, "creation_time": "2010-07-22T09:42:03Z", "is_private": false, "text": "No, I didn't write the original code but I trust that Remy had a good reason for this particular optimisation."}]