[{"count": 0, "tags": [], "bug_id": 49672, "attachment_id": null, "id": 138743, "creation_time": "2010-07-29T15:54:44Z", "time": "2010-07-29T15:54:44Z", "creator": "oldenuf2nobtr2003@yahoo.com", "text": "I installed the Tomcat 6.0.29 on a Windows 2008 R2 64bit server using the downloaded exe called, apache-tomcat-6.0.29.exe. I am using JDK 6 Update 21. Once installed I tried to start the service through the Windows Service panel and it failed. I was seeing in the jakarta_service log the message stating: prunsrv.c] [error] failed setting process executable. I don't know what this meant. I uninstalled this and cleaned up the Programs Files directory and then I downloading the 64 bit zipped install called, apache-tomcat-6.0.29-windows-x64.zip. I unzipped this and copied the files to a location I wanted and ran the startup.bat. It ran fine. I then tried to run the service.bat and tried to install the service this way. That ran fine but when I tried to run the tomcat6w.exe it failed. I removed the service I added and I stopped tomcat with the shutdown.bat command. I decided to try running the apache-tomcat-6.0.29.exe on top of what I had. This ran successfully. Only then was I able to start the service from the Windows Service panel. I uninstalled everything to double check what I had done and installed Tomcat 6.0.26 with the apache-tomcat-6.0.26.exe to verify I did not have to install anything on top of that and I did not. It just installed and started. So I am not sure what changed or what the problem is in the 6.0.29 exe install that I cannot start the service after using the 6.0.29 exe without installing the files from your zipped up version of Tomcat 6.0.29.", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 49672, "is_private": false, "count": 1, "id": 138744, "time": "2010-07-29T15:59:47Z", "creator": "markt@apache.org", "creation_time": "2010-07-29T15:59:47Z", "text": "This looks like a common Java problem. The users list is the place to seek help."}]