[{"count": 0, "tags": [], "text": "Created attachment 25838\nPatch against revision 982124.\n\nThis patch resolves all compilation warnings save for one, described below. Comments follow:\n\n* some deprecation warnings were eliminated by removing the deprecation; this was done only in those cases where no alternative mechanism was defined; in general, a feature should not be deprecated unless a documented and working alternative exists; in these cases, i left a comment in the code indicating this; the deprecations removed were on the following:\n\n  - FONode.getContextInfo\n  - MinOptMax.{plus,minus}{Min,Max}\n\n* one deprecation remains, and another eliminated through a work around, both of which derive from the deprecation of drawString(String,...) in the org.apache.xmlgraphics.java2d.TextHandler interface; in general, a method in an exported interface should not be deprecated unless an adapter class is exported as well that implements the interface along with the deprecated method; in the present case, a class (StrokingTextHandler) was exported that could serve in this role, and that was used to create a fix for one warning;  however, the second warning, which is based on use of the PSTextHandler interface could not be eliminated, since no class was exported that could serve as an adaptor; consequently, to fix the last remaining warning a patch will have to be made to the xmlgraphics commons (I will submit such a patch, which, once implemented, will allow fixing the last warning);\n\nThis patch was created relative to revision 982124 of FOP trunk.\n\nRegards,\nGlenn", "attachment_id": 25838, "bug_id": 49700, "id": 138865, "time": "2010-08-04T02:20:54Z", "creator": "gadams@apache.org", "creation_time": "2010-08-04T02:20:54Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 49700, "is_private": false, "id": 138866, "attachment_id": 25839, "creator": "gadams@apache.org", "creation_time": "2010-08-04T02:36:56Z", "time": "2010-08-04T02:36:56Z", "text": "Created attachment 25839\nPatch against revision 982124.\n\nUpdate patch file to add new file, FOPTextHandlerAdapter.java."}, {"count": 2, "attachment_id": 25839, "creator": "gadams@apache.org", "is_private": false, "id": 138988, "time": "2010-08-09T05:40:29Z", "bug_id": 49700, "creation_time": "2010-08-09T05:40:29Z", "tags": [], "text": "Comment on attachment 25839\nPatch against revision 982124.\n\nObsoleting this patch file, which will be replaced shortly by a new patch combining the elimination of compile, javadoc, and checkstyle warnings."}, {"count": 3, "tags": [], "creator": "spepping@apache.org", "attachment_id": null, "is_private": false, "id": 139188, "time": "2010-08-18T05:10:58Z", "bug_id": 49700, "creation_time": "2010-08-18T05:10:58Z", "text": "\n\n*** This bug has been marked as a duplicate of bug 49733 ***"}, {"count": 4, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 156410, "time": "2012-04-01T13:43:06Z", "bug_id": 49700, "creation_time": "2012-04-01T13:43:06Z", "text": "batch transition to closed for remaining resolved bugs"}]