[{"count": 0, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "text": "This patch resolves all current compilation and javadoc warnings. Comments follow:\n\n* deprecations on following were removed because the member name clearly indicates it is \"old\"; if a user wants to use something \"old\", then they shouldn't be warned of doing so:\n\n  - XMPConstants.PDF_A_IDENTIFICATION_OLD\n  - PDFAOldXMPSchema\n\n* deprecation of drawString(String,...) on the TextHandler interface was removed due to newly added adapter classes (about which see below)\n\n* new adapter classes TextHandlerAdapter and PSTextHandlerAdapter were added to provide default implementations of drawString(String,...)\n\n* the existing StrokingTextHandler class was reworked to extend TextHandlerAdapter\n\n* various javadocs build warnings were removed, some which entailed changing custom tag @todo to @asf.todo to avoid conflicts with future standardized extensions to javadoc tags\n\nThis patch was created against revision 982145 of the xmlgraphics commons trunk.\n\nRegards,\nGlenn", "id": 138870, "time": "2010-08-04T04:11:30Z", "bug_id": 49703, "creation_time": "2010-08-04T04:11:30Z", "is_private": false}, {"count": 1, "tags": [], "creator": "gadams@apache.org", "attachment_id": 25841, "is_private": false, "id": 138871, "time": "2010-08-04T04:13:24Z", "bug_id": 49703, "creation_time": "2010-08-04T04:13:24Z", "text": "Created attachment 25841\nPatch against revision 982145."}, {"count": 2, "tags": [], "bug_id": 49703, "attachment_id": null, "id": 139190, "time": "2010-08-18T05:12:52Z", "creator": "spepping@apache.org", "creation_time": "2010-08-18T05:12:52Z", "is_private": false, "text": "A few questions:\n\nIn the existing situation TextHandler deprecates registering a\nGraphics2D object with the TextHandler object. Instead, the\nrecommended way is to give the Graphics2D object with the drawString\nmethod. Why do you restore registering a Graphics2D object in its full\nglory (remove deprecation, new method getGraphics)?\n\nThe PSTextHandlerAdapter is not used. Why do you introduce it?\n\nThere are now an interface PSTextHandler and a class\nPSTextHandlerAdapter which does not implement that interface. The\nnames are confusing."}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 139191, "time": "2010-08-18T05:43:59Z", "bug_id": 49703, "creation_time": "2010-08-18T05:43:59Z", "text": "\nOverall I was attempting to remove the deprecation warnings in FOP deriving from TextHandler#drawString. See inline below for specific answers.\n\n(In reply to comment #2)\n> A few questions:\n> \n> In the existing situation TextHandler deprecates registering a\n> Graphics2D object with the TextHandler object. Instead, the\n> recommended way is to give the Graphics2D object with the drawString\n> method. Why do you restore registering a Graphics2D object in its full\n> glory (remove deprecation, new method getGraphics)?\n\nThe prior deprecation of the drawString method appeared to be an incomplete solution. In particular, StrokedTextHandler.java provided an implementation that continued to use a local reference to the G2D instance.\n \n> The PSTextHandlerAdapter is not used. Why do you introduce it?\n> \n> There are now an interface PSTextHandler and a class\n> PSTextHandlerAdapter which does not implement that interface. The\n> names are confusing.\n\nI introduced it as a counterpart to the more generic TextHandlerAdapter in order to allow clients of the commons library to not encounter deprecation reports due to their use of PSTextHandler. However, I see I mistakenly had PSTextHandlerAdapter implementing TextHandler rather than PSTextHandler, which was my intent.\n\nGenerally speaking, with\n\nTextHandlerAdapter\nPSTextHandlerAdapter\n\nI was trying to hide the deprecation of #drawString(String...) in external clients since the adapters provided an adequate solution.\n\nHaving said that, I am open to other solutions, such as leaving the original deprecation in place, but with a time schedule or specific release target for its removal.\n\nG."}, {"count": 4, "tags": [], "bug_id": 49703, "attachment_id": null, "id": 139623, "time": "2010-09-02T11:20:28Z", "creator": "jeremias@apache.org", "creation_time": "2010-09-02T11:20:28Z", "is_private": false, "text": "I must say I'm not too happy with the idea of introducing multiple classes to handle a deprecation from almost two years ago (https://svn.apache.org/viewvc?view=revision&revision=718586) for an interface that has probably never been used directly outside of the XML Graphics project. Essentially, you're removing the deprecations completely. Without actually searching through the source code, the user won't find out anymore if he's working with a deprecated method.\n\nWe've had a release in between, so why not just remove this method? This is very technical stuff (i.e. not an end-user API) and we can expect people to migrate within 2 years should anyone have used it. But yes, freely upgrading xmlgraphics-commons.jar while staying with an older fop.jar will cause problems then. But at some point, deprecated stuff should be removed.\n\nA similar argument for the \"old\" PDF/A identification URI. We're mostly about producing PDF here, not about reading it. So if anyone needs to process outdated PDF/A files they can recover the old PDF/A schema from out Subversion repo or write their own. At any rate, the old (wrong) URI should not be used anymore for new PDFs.\n\nI've locally applied the patch and did the following changes to it:\n- @asf.todo converted to //TODO comments\n- Removed \"old\" PDF/A identification URI (deprecated)\n- Removed org.apache.xmlgraphics.java2d.TextHandler.drawString(String, float, float); (deprecated)"}, {"count": 5, "tags": [], "bug_id": 49703, "attachment_id": null, "id": 139637, "time": "2010-09-02T21:34:18Z", "creator": "gadams@apache.org", "creation_time": "2010-09-02T21:34:18Z", "is_private": false, "text": "Thanks. Your resolution is a better one. I did not have the historical perspective to judge it was best to simple remove them.\n\nG."}, {"count": 6, "tags": [], "bug_id": 49703, "attachment_id": null, "text": "No objections to the changes I made to Glenn's patch. I've applied the whole bunch:\nhttp://svn.apache.org/viewvc?rev=995366&view=rev\n\nThanks, Glenn!!!", "id": 139783, "time": "2010-09-09T06:04:43Z", "creator": "jeremias@apache.org", "creation_time": "2010-09-09T06:04:43Z", "is_private": false}]