[{"count": 0, "tags": [], "bug_id": 49701, "attachment_id": null, "text": "While visiting http://httpd.apache.org/docs/1.3/mod/mod_access.html I get greeted with a message to consider using the 2.2 documentation.\n\nThe text \"in the 2.2 docs.\" is linked. From the message a user get's the impression that that link would direct her/him to the 2.2 documentation.\n\nBut the link does link to the following document:\n\nhttp://httpd.apache.org/docs/1.3/mod/mod_access.html\n\nWhich is just the page the user is currently visiting.\n\nI've experienced this myself since some weeks now, I thought it might be useful to be reported.", "id": 138867, "time": "2010-08-04T02:59:52Z", "creator": "tklingenberg@lastflood.net", "creation_time": "2010-08-04T02:59:52Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 49701, "attachment_id": null, "is_private": false, "id": 138872, "time": "2010-08-04T04:40:22Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2010-08-04T04:40:22Z", "text": "This feature uses browser-side Javascript to calculate the correct URL. If you turn off Javascrpt, then indeed the link refers to the original page."}, {"count": 2, "tags": [], "bug_id": 49701, "is_private": false, "text": "That explains why it did not work for me, javascript is switched off per default in my browser.\n\nIt might be considerable to change this into static html somehow so that clients which do not support javascript (like a properly configured browser (opinionated) or search engine robots) do realize that as well.\n\nFor any user a short message that this link requires javascript to work might be considerable as well.\n\n<noscript>Your browser does not support Javascript, but this link into the 2.2 documentation relies on Javascript!</noscript>\n\nAt least that would have enabled me to solve the issue on my own right away.", "id": 138873, "time": "2010-08-04T04:48:53Z", "creator": "tklingenberg@lastflood.net", "creation_time": "2010-08-04T04:48:53Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 49701, "attachment_id": null, "is_private": false, "id": 141152, "time": "2010-10-29T06:02:14Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-29T06:02:14Z", "text": "Thanks. Good point. Will do this promptly."}, {"count": 4, "tags": [], "bug_id": 49701, "is_private": false, "text": "Of course, mod_access is a great example, because it does *not* exist in the 2.2 docs. So even now that I've made this \"work\" with javascript is turned off, it still doesn't work. Looks like, at least for modules that no longer exist, we need to do something static, rather than attempting to be clever.", "id": 141153, "time": "2010-10-29T06:09:10Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-29T06:09:10Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "id": 141156, "time": "2010-10-29T09:11:12Z", "bug_id": 49701, "creation_time": "2010-10-29T09:11:12Z", "is_private": false, "text": "I've made the generic included header work correctly when there's no javascript (or, at least, link to the main 2.2 module listing page), and, in the case of mod_access specifically, I've hard-coded the link to 2.2 mod_authz_host.\n\nWill add an item in the STATUS file for someone to go through all the module docs, and ensure that they link to a still-valid module doc."}]