[{"attachment_id": null, "tags": [], "bug_id": 49782, "is_private": false, "count": 0, "id": 139242, "time": "2010-08-19T08:33:18Z", "creator": "michiel.beijen@gmail.com", "creation_time": "2010-08-19T08:33:18Z", "text": "The Apache.org project provides binary versions of the web server. For the Windows platform however, only 32-bit builds are available. Since the last couple of years, more and more 64-bit operating systems are deployed, especially on servers. The latest version of the Windows Server operating system, Windows Server 2008R2, is ONLY available in a 64-bit version.\n\nIt would be great if Apache would also start providing 64-bit builds of the web server for windows platforms. I know some 'fan-sites' like ApacheLounge are providing these builds now, but it would add value to the apache project to also provide 64-bit windows versions as well."}, {"count": 1, "tags": [], "bug_id": 49782, "is_private": false, "text": "Don't the 32-bit builds work there?  If so, what's the need for 64-bit builds that will only run on some Windows systems?", "id": 139245, "time": "2010-08-19T09:10:54Z", "creator": "poirier@pobox.com", "creation_time": "2010-08-19T09:10:54Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 49782, "text": "Of course 32-bit builds will install fine on 64-bit Windows systems. But to use the full 64-bit capabilities like memory allocation and such it would be nice to have a 64-bit build available. Also, if you use for instance mod_perl a 32-bit Apache will force you to also use a 32-bit perl, which is simply inconvenient.\n\nSo technically the urgent need might be limited, it will still be a good addition to offer 64-bit builds. There is also no technical need for 64-bit Linux builds, you can install ia32-libs and it will work fine. Still, there are 64-bit linux builds available.", "id": 139247, "time": "2010-08-19T09:20:51Z", "creator": "michiel.beijen@gmail.com", "creation_time": "2010-08-19T09:20:51Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "covener@gmail.com", "is_private": false, "id": 172508, "attachment_id": null, "bug_id": 49782, "creation_time": "2014-01-19T20:28:35Z", "time": "2014-01-19T20:28:35Z", "text": "binaries are not an official deliverable of the project, only source code. The trend has been towards fewer and fewer binaries contributed by project members."}]