[{"count": 0, "tags": [], "bug_id": 4981, "attachment_id": null, "is_private": false, "id": 8104, "time": "2001-11-20T11:06:10Z", "creator": "ruvinsky@yahoo.com", "creation_time": "2001-11-20T11:06:10Z", "text": "When building Tomcat 4.0.1 from source, Ant seems to disregard the specified exclude tag when compiling Java source files:\n\n<!-- The following snippet is from Tomcat's catalina/build.xml -->\n\n<!-- Compile internal server components -->\n<javac srcdir=\"src/share\" destdir=\"${catalina.build}/server/classes\"\n       debug=\"${compile.debug}\" deprecation=\"${compile.deprecation}\"\n       optimize=\"${compile.optimize}\"\n       excludes=\"**/CVS/**\">\n    <!-- ... -->\n    <exclude name=\"org/apache/catalina/net/SSLServerSocketFactory.java\" \n    unless=\"compile.jsse\"/>\n    <!-- ... -->\n</javac>\n\nThe compile.jsse property has not been set, but when building Tomcat from scratch (clean), the SSLServerSocketFactory.java file tries to get compiled.  After it errors out (because the file fails to compile, since it shouldn't get compiled), I run ant again, but this time the build goes through just fine.\n\nI suspect this is a bug in Ant 1.4.1."}, {"count": 1, "tags": [], "bug_id": 4981, "text": "It is not a bug in Ant but a bug in tomcats build system ;)Ant will only pass files to the compiler that are specified in fileset (run \"ant -debug\" to verify). However the compiler may suck in dependencies of specified files.So say you pass in class A and it depends on class B, then the compiler will automatically compile both A and B - even if Ant only specified A.So somewhere in the tomcat build system there is another file that references SSLServerSocketFactory or something and thus the compiler is building it.Could you run \"ant -debug\" look at the output and verify that ant is not passing SSLServerSocketFactory to the compiler ? If so could you close this bug and notify the tomcat developers.", "id": 8624, "time": "2001-12-05T13:11:59Z", "creator": "donaldp@apache.org", "creation_time": "2001-12-05T13:11:59Z", "is_private": false, "attachment_id": null}]