[{"count": 0, "tags": [], "bug_id": 49863, "is_private": false, "id": 139620, "attachment_id": null, "creator": "trond.endrestol@fagskolen.gjovik.no", "creation_time": "2010-09-02T10:04:43Z", "time": "2010-09-02T10:04:43Z", "text": "Hi,\n\nI'm running Apache 2.2.14 on FreeBSD/i386 8.1-STABLE. User accounts are stored in and authenticated by LDAP running on Novell NetWare 6.5.\n\nI don't expect there to be any problems with the LDAP auth as this does work for our other FreeBSD boxes and all our users, including our friend jf, see below.\n\nI have this user with a short username, jf. Apache doesn't seem to care to display this user's public_html directory. Instead, Apache claims the directory [DocumentRoot]/~jf does not exist. True enough, but Apache should accept this (sub)string as a username and look up this user's home directory and the user's public_html directory in particular and display the result accordingly.\n\nI have checked and rechecked the ownership and permissions on all directories leading down to the user's public_html directory. All directories and files within jf's public_html directory check out with respect to ownership and permissions.\n\nOther users with two letter usernames, such as tt, works like a charm.\nWhat's the deal with the two letter username jf?\n\nA workaround is to create a *local* username, say jwf, with the same uid/gid/home directory as the jf user and direct everyone to use /~jwf/ in their links. You have to admit this is strictly unnecessary and rather stupid.\n\nI realise 2.2.14 is a bit old, and I'll upgrade to 2.2.16 shortly to see if this bug exists there. To be frank, I believe this bug has existed in Apache for a long, long time, but then again I could be very, very wrong.\n\nTrond."}, {"count": 1, "tags": [], "bug_id": 49863, "is_private": false, "text": "Looks to me like a configuration issue (and works fine for /~aa ).  Please use a user support forum for help, and reopen if a real (reproducible) bug turns up after fixing your config.", "id": 139621, "time": "2010-09-02T10:35:58Z", "creator": "nick@webthing.com", "creation_time": "2010-09-02T10:35:58Z", "attachment_id": null}]