[{"count": 0, "tags": [], "bug_id": 49872, "attachment_id": null, "text": "If you have a shared formula, and you run evaluateInCell() on the original formula, the referenced formula's will fail because the original formula can no longer be found, XSSFCell throws a nullpointer exception on \"convertSharedFormula()\" because \"sfCell.getCTCell().getF()\" is null.\n\nI'm not entirely sure if this is a bug or a feature.", "id": 139639, "time": "2010-09-03T02:25:10Z", "creator": "i8c.alex@gmail.com", "creation_time": "2010-09-03T02:25:10Z", "is_private": false}, {"count": 1, "tags": [], "creator": "yegor@dinom.ru", "attachment_id": null, "id": 139695, "time": "2010-09-04T11:27:48Z", "bug_id": 49872, "creation_time": "2010-09-04T11:27:48Z", "is_private": false, "text": "I'm not quite sure how to reproduce it. Can you attach a sample file and Java code that demonstrates the problem? \n\n\nYegor"}, {"count": 2, "tags": [], "bug_id": 49872, "attachment_id": 25990, "text": "Created attachment 25990\nExample file and code", "id": 139709, "time": "2010-09-06T03:03:50Z", "creator": "i8c.alex@gmail.com", "creation_time": "2010-09-06T03:03:50Z", "is_private": false}, {"count": 3, "tags": [], "creator": "yegor@dinom.ru", "attachment_id": null, "id": 139836, "time": "2010-09-12T05:15:31Z", "bug_id": 49872, "creation_time": "2010-09-12T05:15:31Z", "is_private": false, "text": "It was a bug. The same workbook saved as .xls evaluates OK in HSSF.  \n\nWhen a group of cells shares a formula then only the first cell in the group contains the actual formula expression. This is considered the 'master' formula cell. Subsequent cells refer to the master by id and adjust the expression based on the cell's relative location to the master formula.\n\nFormulaEvaluator.evaluateInCell changes cell type. This method evaluates the formula, and puts the result back into the cell, in place of the old formula. \nIn your case, the first call of evaluateInCell changed the master shared formula and subsequent calls on dependent cells resulted in NPE. \n\nI committed the fix in r996265. Now you can call evaluateInCell on a group of shared formulas cells in any order - first master then dependent or first dependent cells and then master. \n\nYegor"}]