[{"count": 0, "tags": [], "bug_id": 4988, "attachment_id": null, "is_private": false, "id": 8109, "time": "2001-11-20T15:09:35Z", "creator": "martin.engstrom@askus.se", "creation_time": "2001-11-20T15:09:35Z", "text": "I have a JSP page which uses a class which accesses a local database through a \nJDBC connection. When I start Tomcat (standalone) maually this page and all \nother pages work perfectly but when Tomcat has been started as an NT service or \nby the task scheduler this JSP page causes Tomcat to hang. The NT service can't \neven be restarted. The computer has to be rebooted. The logs are not giving any \nclues. I've even tried using a wrapper bat-file with a custom CLASSPATH with \nlittle success."}, {"attachment_id": null, "tags": [], "bug_id": 4988, "text": "I'll need some test case to fix this, otherwise, I'll mark the bug as \nWORKSFORME and assume some kind of problem with the JDBC driver.\nDo you use the service installed by the installer, or is it the jk service ?\nWhat do you mean by \"Tomcat hangs\" ? Does the VM crash ? Does the server stop \nresponding ?", "count": 1, "id": 8155, "time": "2001-11-21T10:04:57Z", "creator": "remm@apache.org", "creation_time": "2001-11-21T10:04:57Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 4988, "attachment_id": null, "id": 8204, "time": "2001-11-22T13:46:30Z", "creator": "martin.engstrom@askus.se", "creation_time": "2001-11-22T13:46:30Z", "is_private": false, "text": "Some more info - I'm using JDK 1.4. The JDBC driver is mm.mysql-2.0.7. The \nservice was installed by the installer.\n\nWhen I say that the server 'hangs' I mean that that it is not responding to \nHTTP requests but the VM doesn't crash (the process is still there). The JSP \npage is supposed to query a database and return a gif. This works fine when \nTomcat is started manually but when I auto-start it the browser just waits \ninfinitely (hourglass).\n\nHowever, further tests show that Tomcat may not be causing the bug after all. I \nhave now also tried the Resin standalone server and the Caucho MySQL JDBC \ndriver and surprisingly I get the same result. I'm starting to suspekt the JDK. \nMaybe I should down-grade to 1.3.x..."}, {"count": 3, "tags": [], "bug_id": 4988, "text": "I've had some problems with 1.4 myself.\n\nUsing Tomcat as a service uses JNI (using the jvm.dll). It is a very strange \nproblem.\nSince it's unlikely Tomcat could fix the problem, I'll mark the bug as invalid.", "id": 8436, "time": "2001-11-29T10:49:52Z", "creator": "remm@apache.org", "creation_time": "2001-11-29T10:49:52Z", "is_private": false, "attachment_id": null}]