[{"count": 0, "tags": [], "bug_id": 49918, "attachment_id": null, "id": 139840, "time": "2010-09-12T14:28:11Z", "creator": "richard.elkins@gmail.com", "creation_time": "2010-09-12T14:28:11Z", "is_private": false, "text": "As of version 1.8, failing to add includeantruntime=\"false\" to the Javac task gets a warning diagnostic.  As the Ant documentation states:\n\n\"It is usually best to set this to false so the script's behavior is not sensitive to the environment in which it is run.\"\n\nSo, there are 2 reasons for this requested enhancement:\n(1) Ant project documentation recommendation\n(2) Impact on existing build.xml files\n\nThank you for your attention & time."}, {"count": 1, "tags": [], "text": "See thread \"warning: 'includeantruntime' was not set\" on the dev list. There was no consensus to break backward compatibility in this way.", "attachment_id": null, "id": 140001, "creator": "jglick@apache.org", "time": "2010-09-20T18:59:34Z", "bug_id": 49918, "creation_time": "2010-09-20T18:59:34Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "richard.elkins@gmail.com", "text": "(In reply to comment #1)\n> See thread \"warning: 'includeantruntime' was not set\" on the dev list. There\n> was no consensus to break backward compatibility in this way.\n\nJesse,\n\nSorry but I really cannot see the logic of this action in version 1.8.  \n\nIt seems that the default value for the includeantruntime parameter was reversed with insufficient consideration for the consequences to users.  This action caused 100s of my own build.xml files to now require editing in order to avoid this warning; I am certain that 1000s (if not millions) of Ant users around the world have been impacted.  Googling bears this out.\n\nI understand that includeantruntime=\"true\" is useful to the Ant developers and to some individual Ant users but it violates a basic premise of software development: \"The needs of the many outweigh the needs of the few\".  And, as the Ant document states, it can render a build.xml that is environmentally-sensitive which, in most cases, is not a good idea (I agree with the documentation).\n\n-Richard", "count": 2, "id": 140004, "time": "2010-09-21T05:11:44Z", "bug_id": 49918, "creation_time": "2010-09-21T05:11:44Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 49918, "attachment_id": null, "id": 140005, "time": "2010-09-21T05:42:35Z", "creator": "peterreilly@apache.org", "creation_time": "2010-09-21T05:42:35Z", "is_private": false, "text": "Remember the prime directive - \"do no harm\""}, {"count": 4, "tags": [], "bug_id": 49918, "text": "(In reply to comment #2)\n> It seems that the default value for the includeantruntime\n> parameter was reversed\n\nNo, it was not. It was, and remains, \"true\" - which is bad, since it is nonportable, but not something we can change without breaking some existing scripts (e.g. causing previously successful runs of <javac> to fail with compiler errors).\n\n> This action caused 100s of my own build.xml files\n> to now require editing in order to avoid this warning\n\nSorry, but they should have been edited before now to specify includeantruntime=\"false\" anyway. The warning is just reminding you to do this.\n\nNote that you can also use macro or presetdef to define common settings for <javac> in your scripts. You may also define the magic property build.sysclasspath=ignore to effectively change the default for Ant - in a master script using <property>, in ~/.antrc, etc. - if you are sure you have no instances of <javac> which are relying on the old default.\n\n(For cases where you do want to compile an Ant task, it is best to add <pathelement location=\"${ant.core.lib}\"/> to the appropriate <classpath>.)\n\nAgain, please read the thread on the dev list and post comments there. Nobody likes the current state, but issuing some warnings and continuing is considered a lower-priority incompatibility than causing a build to fail, even if the warnings affect more scripts than would have been broken by a change in defaults.", "id": 140017, "time": "2010-09-21T09:10:52Z", "creator": "jglick@apache.org", "creation_time": "2010-09-21T09:10:52Z", "is_private": false, "attachment_id": null}]