[{"count": 0, "text": "I'd like to finish implementation and create a patch for BorderCodes. Currently it reads only the Word 97 structure (4-byte), and the class does not provide any getters or setters. Word 2000 and above use new 8-byte version, which is changed in new SPRM, which are currently not processed.\n\nI don't know how to do it best in regard of backward compatibility. Two BorderCode structures should be supported. They have the same properties, except for color, which is changed from 8-bit to 24-bit in word 2000.\n\nI suggest this:\n1. rename existing BorderCode to BorderCode97 and create new BorderCode2000. These will read/write values as appropriate for particular version.\n2. create new class BorderCode, which will delegete to BorderCode97 or BorderCode2000. Will provide method returning boolean as whether 8 or 24-bit color is valid. It will not contain following public methods from current implementation: \n  - the public contructor\n  - the toInt method\nAs such it will not be full backwards compatible, but I think this is not the issue, as currently the class is useless.\n\nNote, that there are different BorderCode structures for Word 95 and Word 1.0, but as I understand, we do not support these.\n\nPlease let me know.", "bug_id": 49919, "is_private": false, "id": 139848, "time": "2010-09-13T06:00:51Z", "creator": "a6537691@bofthew.com", "creation_time": "2010-09-13T06:00:51Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 49919, "is_private": false, "text": "Created attachment 26032\nPatch to support borders\n\nAttached is the patch created by following the instructions in the Contribution Guidelines. How it is implemented:\n\n- no support for Word 2000 structure of BorderCode. The only difference is that Word 2000 has 24-bit color while Word 97 version has only 16 colors. In my tests Word 2003 and 2007 saves both structures, so you are able to read it anyway.\n\n- get methods for borders were added to TableRow: for some strange reason TableRow extends Paragraph. Paragraph has getXxxBorder methods, but they return incorrect values, because they read from _props superclas's field instead of _tprops field\n\nPlease give feedback or merge.", "id": 139896, "time": "2010-09-16T07:52:03Z", "creator": "a6537691@bofthew.com", "creation_time": "2010-09-16T07:52:03Z", "attachment_id": 26032}, {"count": 2, "tags": [], "bug_id": 49919, "text": "To answer the question - the TableXXXX classes extend from paragraph because in the file format they're really just paragraphs with special properties!\n\nIn terms of table vs paragraph properties: For a table where the row has a border, and a paragraph in it has one, do we need to merge the two properties?", "id": 139899, "time": "2010-09-16T09:52:31Z", "creator": "apache@gagravarr.org", "creation_time": "2010-09-16T09:52:31Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "apache@gagravarr.org", "text": "The patch looks good, thanks for that\n\nAny chance of a quick unit test for it? I guess we'll need a word file with a table in it, some rows with borders and some without. The test would then check each row in turn, and ensure that the borders show up / don't show up as expected. I'm happy to commit this to svn once we have a test to go with it", "count": 3, "id": 139904, "time": "2010-09-16T12:04:47Z", "bug_id": 49919, "creation_time": "2010-09-16T12:04:47Z", "is_private": false}, {"count": 4, "tags": [], "text": "Created attachment 26128\nPatch to support borders (with testcase)\n\nUpdated patch with a testcase.", "is_private": false, "id": 140531, "creator": "a6537691@bofthew.com", "time": "2010-10-07T01:45:18Z", "bug_id": 49919, "creation_time": "2010-10-07T01:45:18Z", "attachment_id": 26128}, {"count": 5, "text": "Created attachment 26129\nAdded files for the patch", "bug_id": 49919, "is_private": false, "id": 140532, "time": "2010-10-07T01:45:47Z", "creator": "a6537691@bofthew.com", "creation_time": "2010-10-07T01:45:47Z", "tags": [], "attachment_id": 26129}, {"count": 6, "tags": [], "bug_id": 49919, "text": "Applied in r1005447\n\nThanks,\nYegor", "id": 140558, "time": "2010-10-07T09:58:13Z", "creator": "yegor@dinom.ru", "creation_time": "2010-10-07T09:58:13Z", "is_private": false, "attachment_id": null}]