[{"count": 0, "tags": [], "bug_id": 4994, "attachment_id": null, "text": "I've searched the web and posted this to tomcat-user without finding a \nsolution, so I'm entering it here hoping that it might be considered a useful \nfeature request. I'm entering this against 3.2.3 only because that it the \nversion we're using at present. I believe that the same problem exists in \nCatalina. \n\nThis problem stops us being able to use Tomcat for operational purposes. Other \nthan that, we are very happy with Tomcat. Cheers, Andy.\n----------------\n\nHi all,\n\nI have a problem with stopping Tomcat reliably, initially as part of an NT\nsystem shutdown though I think the problem applies independent of OS.\n\nAs best I understand it, when Tomcat is stopped by the conventional means\n(i.e. org.apache.tomcat.startup.Tomcat -stop) the stop action returns before\nthe running Tomcat server has actually completed. This causes me a problem.\n\nWhen this action is part of a system shutdown we can end up with the Tomcat\nshutdown process failing to complete, before it gets killed. Given that our\ncontexts can be running database updates, this is not a good situation.\n\nWe're using Tomcat 3.2.3 at present and need to run on Java 1.3. The\nspecific problem is on NT, but I believe that the root cause is the way\nTomcat stop works, making it is OS independent. That is, it opens a\nconnection via AJP12, sends a 'stop' message, and exits. If there is an\nacknowledgement of this from the stopping process, it is returned a good\ntime before the final exit occurs. (Sorry for the uncertainty, I should have\nbut haven't looked at the source yet).\n\nOn *nix there would be some simple if in-elegant work-around based on\nsleeping the shutdown process. Even that doesn't seem to be available on NT.\nWe've tried various NT service options (e.g. JavaService from Alexandria)\nand IIS in-process set-up, but none of them actually wait for Tomcat to\nexit. We've not tried the \"Jakarta NT Service\" as it is currently marked as\nnot working on Java 1.3. \n\nSo what we have not found is a way to shutdown Tomcat cleanly which waits\nfor it to actually shutdown before returning, and allowing the system\nshutdown to continue. We could code up our own wrapper for start and stop\nbut would prefer not to (we want to be able to run with existing Tomcat\ninstallations).\n\nFinally, some questions:\n\n1. Is there another standard mechanism for stopping Tomcat which will wait\nfor it to really shutdown?\n2. Is there a parameter to org.apache.tomcat.startup.Tomcat -stop which\nwould do this?\n3. If not, are there changes in the Stop process in 3.3 or 4.0, which might\nhelp me?\n4. If not, is anyone aware of this being considered as an enhancement to\nTomcat?\n5. If this is an issue for other people, and an enhancement to 'stop' would\nmake sense, then let me know. I hope we could contribute it.\n\nThanks for reading this. Any useful input on will be appreciated.\n\nAndy", "id": 8139, "time": "2001-11-21T03:49:42Z", "creator": "Andy.Newton@lazysoft.com", "creation_time": "2001-11-21T03:49:42Z", "is_private": false}, {"text": "Marking as WORKSFORME, since there have been no similar problems reported with\nrecent stable Tomcat releases.", "tags": [], "bug_id": 4994, "attachment_id": null, "count": 1, "id": 93433, "time": "2006-09-12T17:28:23Z", "creator": "sriramnrn@gmail.com", "creation_time": "2006-09-12T17:28:23Z", "is_private": false}]