[{"count": 0, "tags": [], "bug_id": 49943, "attachment_id": 26035, "id": 139909, "time": "2010-09-16T14:22:23Z", "creator": "mfemal@altaresources.com", "creation_time": "2010-09-16T14:22:23Z", "is_private": false, "text": "Created attachment 26035\nFull source code (changes done against pristine 6.0.29 src code)\n\nIt is possible to normally do a LogManager.getLogManager() (which returns the JULI specific implementation).  However, when calls to re-read the configuration via readConfiguration() or readConfiguration(inputStream) are done the current implementation does not properly re-read the config as the standard JVM LogManager does.  In other words, the desired capability is to update the logging.properties file at run-time without forcing any other types of reloads (application context) or server restarts.\n\nTo address this, it is necessary to look at run-time to see which loggers are already instantiated and manipulate the level at run-time based on the new configuration.  Any loggers which are already instantiated should also have their levels reset if they are not in the current configuration (fall back to the default global level).\n\nIn addition, in the current implementation a reset is not consistently done.  I pulled the JDK6 source code to contrast what the JULI ClassLoaderLogManager was doing to do a comparison.\n\nAttached is the file I used for testing which should address these issues.  It should be fairly trivial to add this into Tomcat 7 as well as not much has changed in this class in that version.\n\nWith this change, sites can modify the site-specific logging.properties (context) and automatically reload those changes at run-time in the logging system.\n\nThe attachment is all the code necessary to implement it (I did not do a patch)."}, {"count": 1, "tags": [], "text": "I am concerned that having viewed the JDK6 source code you then based the attached file on that. If that is the case, the attachment is not acceptable for use with in the Tomcat code base due to licensing issues.\n\nIt the changes are permissible, not providing a patch isn't going to help the changes get applied.", "attachment_id": null, "id": 139910, "creator": "markt@apache.org", "time": "2010-09-16T14:30:17Z", "bug_id": 49943, "creation_time": "2010-09-16T14:30:17Z", "is_private": false}, {"count": 2, "attachment_id": 26036, "creator": "mfemal@altaresources.com", "text": "Created attachment 26036\ncleaned up patch - sorry for not supplying the first time", "id": 139911, "time": "2010-09-16T18:13:40Z", "bug_id": 49943, "creation_time": "2010-09-16T18:13:40Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "mfemal@altaresources.com", "attachment_id": null, "id": 139912, "time": "2010-09-16T18:23:42Z", "bug_id": 49943, "creation_time": "2010-09-16T18:23:42Z", "is_private": false, "text": "Thanks for the extremely fast response.\n\nSupplied a unified diff.\n\nRegarding viewing LogManager.java, I made all changes on the Tomcat source file.  Basically I moved a bunch of code out of addLogger to make it reusable (initial add and reload of config has to do many of the same things), ensured the properties aren't appended (or same properties just overwritten) on read calls (otherwise things that should drop out of logging.properties will not).  This does account for statically defined loggers as the references will still exist, the level is just reset.  None of the specific code is in the parent class - it is all tomcat specific.\n\nI'm not sure if viewing can be an issue of the class which this extends, but if so then hopefully this can be corrected by someone else after prioritizing.  I'm no expert, but I don't believe I'm stepping on any toes on this as I made all changes based on changing the ClassLoaderLogManager.java file directly..."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "text": "OK, that sounds fine. The reference to the JDK6 source worried me but moving and cleaning up existing Tomcat code shouldn't be a problem.\n\nI haven't looked at the patch in detail yet but a quick look shows there are a few tabs in there. No need to provide a new patch. This is easy to fix but for future reference tabs should be replaced with 4 spaces.", "id": 139913, "attachment_id": null, "bug_id": 49943, "creation_time": "2010-09-16T18:32:47Z", "time": "2010-09-16T18:32:47Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 49943, "attachment_id": 26037, "text": "Created attachment 26037\nSample Test code", "id": 139914, "time": "2010-09-16T18:34:45Z", "creator": "mfemal@altaresources.com", "creation_time": "2010-09-16T18:34:45Z", "is_private": false}, {"count": 6, "text": "Created attachment 26038\nSample test configuration - useful for test test.* package level changes", "bug_id": 49943, "attachment_id": 26038, "id": 139915, "time": "2010-09-16T18:35:32Z", "creator": "mfemal@altaresources.com", "creation_time": "2010-09-16T18:35:32Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "bug_id": 49943, "attachment_id": null, "id": 140419, "time": "2010-10-03T19:31:39Z", "creator": "markt@apache.org", "creation_time": "2010-10-03T19:31:39Z", "is_private": false, "text": "The patch as provided does not work. It fails to take account of the caching of resources that occurs in the web application class loaders. I'm also curious how the re-reading of the CATALINA_BASE/conf/logging.properties was being triggered.\n\nHaving reviewed the patch in more detail there are also a few places where unnecessary cosmetic changes are made. This makes the patch harder to review.\n\nI'm marking this as an enhancement and would be happy to revisit this to review a patch that addresses this issues. The patch will be applied to 7.0.x before it is applied to 6.0.x so patches against that code base are preferred."}, {"count": 8, "tags": [], "bug_id": 49943, "attachment_id": 26115, "text": "Created attachment 26115\nNon-working TC7 patch (for reference)\n\nYou may find the attached port for TC7 useful. Or not.", "id": 140420, "time": "2010-10-03T19:33:00Z", "creator": "markt@apache.org", "creation_time": "2010-10-03T19:33:00Z", "is_private": false}, {"count": 9, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 198206, "time": "2017-04-07T15:21:41Z", "bug_id": 49943, "creation_time": "2017-04-07T15:21:41Z", "is_private": false, "text": "No update provided in light of comment #7. Given the time that has past, resolving this as WONTFIX. The Tomcat community remains open to considering an updating patch that addresses comment #7 (and is updated for Tomcat 9)."}]