[{"attachment_id": null, "tags": [], "bug_id": 49964, "is_private": false, "count": 0, "id": 139988, "time": "2010-09-20T13:50:55Z", "creator": "chris@christopherschultz.net", "creation_time": "2010-09-20T13:50:55Z", "text": "(Apologies for the awkward summary, but I wanted this bug to be easily findable in bugzilla)\n\nA couple of questions have been raised on various lists about why Tomcat doesn't support auto-parsing of PUT requests, and the reason is clear: the servlet spec doesn't require it. On the other hand, it seems that there are enough users who would love to have this capability, and it doesn't seem to be too difficult to implement, so why not go ahead and do it?\n\nMy proposal is this (and I'm prepared to write the patches myself):\n\n1. A new configuration attribute on the <Connector> element: \"parseBodyRequestParametersMethods\" (suggestions for a better name are welcome). The default value for this setting is \"POST\" which retains strict servlet spec compliance.\n\n2. Change catalina.connector.Request.parseParameters method to allow any method mentioned in the above configuration attribute to undergo request body conversion into request parameters. All other existing requirements remain in place: the request body must be application/x-www-form-urlencoded, must fit into maxPostSize, etc.\n\nOne question I have about this implementation: how should it behave under org.apache.catalina.STRICT_SERVLET_COMPLIANCE=true? I believe that org.apache.catalina.STRICT_SERVLET_COMPLIANCE=true should take precedence over this setting, disable it's use, and issue a warning/error during startup when they conflict."}, {"count": 1, "tags": [], "bug_id": 49964, "attachment_id": null, "id": 139989, "time": "2010-09-20T13:52:39Z", "creator": "chris@christopherschultz.net", "creation_time": "2010-09-20T13:52:39Z", "is_private": false, "text": "References to some list discussions that are relevant:\n\nhttp://markmail.org/message/dxgvu6fhcvp22xbo [tomcat-user]\nhttp://markmail.org/message/opptokzqz7y6z7nk [cocoon-user]"}, {"count": 2, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of bug 48692 ***", "id": 139993, "time": "2010-09-20T16:31:54Z", "bug_id": 49964, "creation_time": "2010-09-20T16:31:54Z", "attachment_id": null}]