[{"count": 0, "tags": [], "bug_id": 49974, "attachment_id": null, "id": 140057, "time": "2010-09-22T07:24:18Z", "creator": "moreira@privasphere.com", "creation_time": "2010-09-22T07:24:18Z", "is_private": false, "text": "This is an RFE. It would be very interesting to be able to pause and resume tests.\n\nWe have tests that need to run for about 24 hours. It does happen that we need to restart our servers in the meantime. For such cases, instead of seeing errors in the tests results for the period that the server was down it would be more interesting to be able to pause the test for a couple of minutes and resume it thereafter."}, {"count": 1, "attachment_id": null, "bug_id": 49974, "text": "*** Bug 37155 has been marked as a duplicate of this bug. ***", "id": 151435, "time": "2011-11-12T15:16:36Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-11-12T15:16:36Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "colin.jackson@nzlotteries.co.nz", "text": "Can I second the request for a \"Pause Button\"? \n\n1/. The test system is complex and requires frequent tinkering, which is difficult when running long test sequences. Additionally, the staging environment matches production, which has several scheduled events and down time which interfere with long test runs.\n2/. Many long test sequences are for response metric gathering, which precludes doing any other task while the test is active (for the sake of a clean reading). It would be good to be able to pause a test run while some short task on the system is conducted, then resume.\n3/. Some tasks cannot be automated, so it would be good for the tester to be able to pause the test, manually perform test steps, then resume the test.\n4/. We would like to be able to pause the test and check certain aspects of the system while there is no load, then resume the load.\n\nI would imagine that when a pause button is pressed, in-flight transactions are completed, and no new transactions are initiated. In this way, a pause would not tend to generate false-negative results.\n\nThe paused state would be indicated in the \"activity light\" (maybe it goes from green to amber).", "count": 2, "id": 162125, "time": "2012-09-13T02:29:34Z", "bug_id": 49974, "creation_time": "2012-09-13T02:29:34Z", "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "text": "The BeanShell server [1] can be used for this, in conjunction with a BeanShell test element (e.g. Timer).\n\nUse the server to set / clear a property (or possibly a variable in bsh.shared - don't know if that works across server and threads).\n\nThe timer then checks the property; if set, it waits and loops until the property is cleared.\n\nObviously a dedicated test element would be easier to use, but if you need a solution now, it would be worth a try.\n\n[1] http://jmeter.apache.org/usermanual/best-practices.html#beanshell_server", "id": 162140, "time": "2012-09-13T09:32:28Z", "bug_id": 49974, "creation_time": "2012-09-13T09:32:28Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "sebb@apache.org", "text": "Note: any implementation needs to work for both GUI and non-GUI modes as well as client-server mode if possible.", "count": 4, "id": 162141, "time": "2012-09-13T09:52:12Z", "bug_id": 49974, "creation_time": "2012-09-13T09:52:12Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "apc4@ya.ru", "text": "IMO, This could be easily done as Timer plugin, supporting both UI and non-UI flows...", "count": 5, "id": 193005, "time": "2016-08-11T10:05:48Z", "bug_id": 49974, "creation_time": "2016-08-11T10:05:48Z", "is_private": false}, {"count": 6, "tags": [], "creator": "support@ubikloadpack.com", "text": "(In reply to Andrey Pokhilko from comment #5)\n> IMO, This could be easily done as Timer plugin, supporting both UI and\n> non-UI flows...\n\nYes it's a good start. \nIt could test presence of a Flag (that needs to be distributed with an api for remote testing) and sleep when state is paused and poll on it until test is resumed.\nNote that some queries could fail due to timeout occuring or in case of restart , infrastructure not being warmed up.", "id": 193013, "time": "2016-08-11T11:34:23Z", "bug_id": 49974, "creation_time": "2016-08-11T11:34:23Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "sebb@apache.org", "text": "(In reply to Andrey Pokhilko from comment #5)\n> IMO, This could be easily done as Timer plugin, supporting both UI and\n> non-UI flows...\n\nTimers don't currently wait; they just return a wait time value.\nThe values of all timers are added up and used by the JMeter engine as the wait time.\n\nIf the Timer does not return immediately this would affect engine behaviour.\n\nUsing a Pre/Post processor might be a better solution", "count": 7, "id": 193068, "time": "2016-08-12T11:20:19Z", "bug_id": 49974, "creation_time": "2016-08-12T11:20:19Z", "is_private": false}]