[{"count": 0, "attachment_id": null, "bug_id": 49991, "is_private": false, "id": 140128, "time": "2010-09-23T20:01:53Z", "creator": "servlet@ig.com.br", "creation_time": "2010-09-23T20:01:53Z", "tags": [], "text": "Tomcat is suffering from the same bug fixed in Glassfish:\nhttps://glassfish.dev.java.net/issues/show_bug.cgi?id=12642\n\nWhen the container redirects to a login page, CDI (Weld) tell that there is no active contexts for requestscope."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "This bug report refers to JAAS but the Glassfish fix seems to be more related to FORM authentication. It isn't at all clear to me at this point what the problem is. A test case for Tomcat - with the necessary steps to re-create from a clean 7.0.x install - would help.\n\nWhat also isn't clear is whether there is a Servlet specification compliance issue or if CDI expects things to be a certain way and Tomcat does them differently. The former will certainly get fixed, the latter will probably get fixed.", "id": 140581, "time": "2010-10-08T06:50:57Z", "bug_id": 49991, "creation_time": "2010-10-08T06:50:57Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 49991, "is_private": false, "id": 140602, "attachment_id": null, "creator": "servlet@ig.com.br", "creation_time": "2010-10-08T11:36:21Z", "time": "2010-10-08T11:36:21Z", "text": "Sorry, the problem is related to FORM authentication, not JAAS. Again: sorry for this mistake.\n\nI will prepare the test as soon I reach my Office.\n\nThanks"}, {"count": 3, "attachment_id": 26144, "bug_id": 49991, "is_private": false, "id": 140610, "time": "2010-10-08T22:25:58Z", "creator": "servlet@ig.com.br", "creation_time": "2010-10-08T22:25:58Z", "tags": [], "text": "Created attachment 26144\nTomcat FormAuthentication and CDI problem\n\nYou will need to grab Weld 1.1.0 and put weld-1.1.0.Beta1\\artifacts\\weld\\weld-servlet.jar inside WEB-CONTENT/lib, because I couldn´t updaload the project with the library (file size limit).\n\nYou can download weld here http://seamframework.org/Weld/Downloads\n\nThis problem happens with all Weld versions, even with the newest beta."}, {"count": 4, "tags": [], "bug_id": 49991, "is_private": false, "text": "Mark, here is the project for Eclipse Helios 3.6 SR1.\n\nYou will need to grab Weld 1.1.0 and put\nweld-1.1.0.Beta1\\artifacts\\weld\\weld-servlet.jar inside WEB-CONTENT/lib,\nbecause I couldn´t updaload the project with the library (file size limit).\n\nYou can download weld here http://seamframework.org/Weld/Downloads\n\nThis problem happens with all Weld versions, even with the newest beta.\n\nThe instructions are in the readme.txt, that I will also put here:\n\nhow to see the bug:\n\n1 - import the project in Helios 3.6 SR1\n2 - run on Tomcat 7.0.2\n3 - try to access the protected page in restricted/restrictedpage.jsp (right click on the page and execute)\n4 - you will get the exception org.jboss.weld.context.ContextNotActiveException: WELD-001303 No active contexts for scope type javax.enterprise.context.RequestScoped\n\nComment the security constraint that fire the form authentication and you have NO exception.\n\nI also discoverd that:\n\na) in eclipse, if you run restricted.jsp with right click (Run On Server) the exception is throw, but if you run the project and after the \nserver start type the complete URL to restricted.jsp, the bug doesn´t happen. \nb) if you \"run on server\" the project and open the URL in another browser (don´t use eclipse build in browser), this problem happens.", "id": 140611, "time": "2010-10-08T22:28:11Z", "creator": "servlet@ig.com.br", "creation_time": "2010-10-08T22:28:11Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 49991, "text": "Just updating status now info has been provided.", "id": 140632, "time": "2010-10-10T05:52:08Z", "creator": "markt@apache.org", "creation_time": "2010-10-10T05:52:08Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "creator": "pmuir@bleepbleep.org.uk", "is_private": false, "text": "(Unfortunately) the Servlet spec provides no guarantees of the behaviour of request listeners if a forward occurs e.g. for FORM auth or to an error page. Tomcat (and derivatives such as Grizzly and JBossWeb) don't call request listeners around forwards, so Weld's listeners do not get fired.\n\nThis can either be fixed in Tomcat by calling listeners around forwards (when I spoke to the Servlet EG lead about this, they indicated that they would look at specifying that there is some listener called around forwards in the future) or in Weld's Tomcat support by using Tomcat APIs to get a callback when forwards occur. \n\nMark/anyone on the Tomcat team, if you don't want to make Tomcat call the request listeners around forwards, then we can do some custom hooks in the Weld/Tomcat integration code to get the needed callback. In this case, could the OP file an issue in the WELD issue tracker on http://jira.jboss.org.", "id": 140636, "time": "2010-10-10T11:47:10Z", "bug_id": 49991, "creation_time": "2010-10-10T11:47:10Z", "attachment_id": null}, {"count": 7, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "I don't see any reason to add this to Tomcat but it will probably be optional behaviour.\n\nIf added this to my list of things to keep an eye on when the EG starts the next version of the spec.", "id": 140692, "time": "2010-10-12T08:13:04Z", "bug_id": 49991, "creation_time": "2010-10-12T08:13:04Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 49991, "text": "I've done a little digging on this. The best definition of the required behaviour is actually in the Javadoc:\n<quote>\nInterface for receiving notification events about requests coming into and going out of scope of a web application.\nA ServletRequest is defined as coming into scope of a web application when it is about to enter the first servlet or filter of the web application, and as going out of scope as it exits the last servlet or the first filter in the chain. \n</quote>\nLooking at Tomcat's current behaviour, it isn't firing the request listener for the request that displays the login page. That looks like a spec breach to me. I'll fix that and then see how the test case performs. If the test case is still broken then I'd lean towards the fixing this in Weld option.", "count": 8, "id": 140829, "time": "2010-10-19T13:12:05Z", "creator": "markt@apache.org", "creation_time": "2010-10-19T13:12:05Z", "is_private": false}, {"count": 9, "attachment_id": null, "bug_id": 49991, "text": "I've fixed Tomcat 7 so it fires the ServletRequestListener events for the login and error page for FORM authentication. The supplied test case now passes.\n\nAs part of this, I refactored the process of firing ServletRequestListener so any future change to the Servle spec will be simple to handle.\n\nThe fix will be in the 7.0.5 onwards.", "id": 140836, "time": "2010-10-19T16:29:46Z", "creator": "markt@apache.org", "creation_time": "2010-10-19T16:29:46Z", "tags": [], "is_private": false}, {"count": 10, "tags": [], "bug_id": 49991, "attachment_id": null, "text": "Thanks Marks, the fix of this feature will accelerate CDI adoption in TOMCAT.\n\n\n(In reply to comment #9)\n> I've fixed Tomcat 7 so it fires the ServletRequestListener events for the login\n> and error page for FORM authentication. The supplied test case now passes.\n> As part of this, I refactored the process of firing ServletRequestListener so\n> any future change to the Servle spec will be simple to handle.\n> The fix will be in the 7.0.5 onwards.", "id": 140838, "time": "2010-10-19T16:57:02Z", "creator": "servlet@ig.com.br", "creation_time": "2010-10-19T16:57:02Z", "is_private": false}]