[{"count": 0, "tags": [], "bug_id": 49996, "attachment_id": null, "text": "I want to reverse proxy error documents from a backend server (to keep them consistent with the rest of the content/application proxied from there).\n\nI tried the following reverse proxy configuration:\n---------------------------\n<Location /public>\n   ProxyPass http://backend:8080/public\n</Location>\nErrorDocument 404 /public/404.html\n---------------------------\n... with backend:8080 configured to serve up a valid 404 document for /public/404.html requests.\n\nWhen I request a URL that does not exist on my reverse proxy, I get a 200 OK response instead of a 404 response code, along with the correct error document body from the backend. This is obviously confusing for caching, automation, etc.\n\nEvidently with a ProxyPass the response code from the backend is used as the response code for the original request. Normally this would make sense, but not when a response code has already been set and we're just getting content to go with it. For reference, if instead we use a CGI script as the ErrorDocument and don't specify a new response code, the original response code is retained.\n\nThis suggests a relatively simple approach: upon returning successfully from a ProxyPass, check to see if the response already has a code, and leave it if so. AFAICS the only scenario where this would make a difference is the one I've described; in which case this handling offers the least surprising result.", "id": 140142, "time": "2010-09-24T15:01:54Z", "creator": "lmeyer@vmware.com", "creation_time": "2010-09-24T15:01:54Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 49996, "attachment_id": null, "text": "What about IgnoreErrorDocumentStatus on/off?\n\nBetter suggestions for the name?\n\nThere are legitimate reasons to use the result code of a crafty error document handler, so we need to distinguish between \"here, have this status instead\", and \"ignore me, here's your error result text\".", "id": 140143, "time": "2010-09-24T15:49:37Z", "creator": "wrowe@apache.org", "creation_time": "2010-09-24T15:49:37Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 49996, "text": "(In reply to comment #1)\n\n> There are legitimate reasons to use the result code of a crafty error document\n> handler\n\nYes, but is there a reason for ProxyPass to overwrite an existing status code?\n\nIf there's to be a directive for this, then perhaps:\n\nErrorDocumentStatus keep (default override)\nor\nErrorDocumentKeepStatus on (default off)\n\n- so that it's clearly related to ErrorDocument and next to it in the docs.", "id": 140275, "time": "2010-09-28T14:42:25Z", "creator": "lmeyer@vmware.com", "creation_time": "2010-09-28T14:42:25Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 49996, "attachment_id": null, "text": "\"is there a reason for ProxyPass to overwrite an existing status code?\"\n\nYes.  The nature of the response defines what status it will present.\n\nE.g. it is equally valid to present a redirect, or an OK document in response\nto some error conditions.  This is all on the implementer to decide.\n\nA new directive would give implementers more flexibility to avoid correcting\ntheir obtuse cgi based or proxy based successful (200) error documents as\nnon-success pages.", "id": 142160, "time": "2010-11-29T20:07:42Z", "creator": "wrowe@apache.org", "creation_time": "2010-11-29T20:07:42Z", "is_private": false}]