[{"count": 0, "tags": [], "bug_id": 50000, "attachment_id": null, "text": "Developers on trunk are generally much faster at creating new features than they can be documented by the docs@ team.  This situation is exacerbated by the humble (or not so humble) attempts of dev@ folks to attempt to explain their own new features, immediately after misnaming the new directive/option/feature.\n\nThis could be trivially remedied with an ap_drbacchus_clone() function.  Although the ap_drbacchus_progeny() function was already implemented, the httpd project will be hard pressed to wait the two decades before this benefit is fully realized.\n\nIt is expected that this feature would dramatically reduce the number of new bugzilla incidents added during the alpha/beta and early GA periods (and many duplicates thereafter), by raising questions of the developers of exactly what they intended for their feature to accomplish, how on earth they expected to accomplish/configure it, and correcting their spelling of said features prior to release.\n\nHowever, there appears to be a patent minefield lurking in the implementation of this function, and legal-internal@ should be consulted on the methodology applied to derive a non-infringing implementation.", "id": 140151, "time": "2010-09-24T17:35:39Z", "creator": "wrowe@apache.org", "creation_time": "2010-09-24T17:35:39Z", "is_private": false}, {"count": 1, "tags": [], "creator": "noodl@apache.org", "text": "ap_drbacchus_clone() should do fractional arguments.\n\nA non-integer number of cloned DrBacchi would allow for N-misnamed-new-directives to be documented concurrently while allowing the remainder (smaller) clones to commit the build fluff.\n\nBeard colour should be a trivial matter.", "id": 140155, "time": "2010-09-24T17:58:53Z", "bug_id": 50000, "creation_time": "2010-09-24T17:58:53Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "wrowe@apache.org", "is_private": false, "id": 140157, "time": "2010-09-24T18:32:22Z", "bug_id": 50000, "creation_time": "2010-09-24T18:32:22Z", "tags": [], "text": "w.r.t. comment #1, I would be very concerned that fractional clones would lead to\nmore incomplete review and commits."}, {"count": 3, "tags": [], "bug_id": 50000, "is_private": false, "text": "Meh. Fractional (irrational, perhaps) DrBacchoda could be assigned tasks by whichever body part(s) were effectively cloned and their hair quotient. I suggest:\n\n* Leg (medium hairyness) - kicking fajita to sense\n* Spleen (few hairs) - Softly codling newcommers\n* Face (severe hair) - Dealing with you", "id": 140158, "time": "2010-09-24T18:44:01Z", "creator": "noodl@apache.org", "creation_time": "2010-09-24T18:44:01Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "(In reply to comment #0)\n> \n> However, there appears to be a patent minefield lurking in the implementation\n> of this function, and legal-internal@ should be consulted on the methodology\n> applied to derive a non-infringing implementation.\n\nNo need.  We have an ICLA on file.  We're good to go.", "is_private": false, "id": 140159, "creator": "rubys@intertwingly.net", "time": "2010-09-24T19:29:48Z", "bug_id": 50000, "creation_time": "2010-09-24T19:29:48Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 50000, "attachment_id": null, "is_private": false, "id": 140174, "time": "2010-09-25T16:11:38Z", "creator": "sander@temme.net", "creation_time": "2010-09-25T16:11:38Z", "text": "+1 someone should fix this.  And document the fix."}, {"count": 6, "tags": [], "bug_id": 50000, "attachment_id": null, "is_private": false, "id": 141222, "time": "2010-10-29T11:07:25Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-29T11:07:25Z", "text": "Moving docs bugs to docs@httpd.a.o ownership."}, {"count": 7, "tags": [], "bug_id": 50000, "text": "Thanks. I'm flattered, and I'm very proud of the work that we've done over the last decade or so.\n\nBut I'll take this opportunity to point out that I'm just one of a team - a team that is very active and very prolific. And we couldn't do any of it without the support of the folks who write the code in the first place.\n\nAs for documenting the fix, it's something like this:\n\n1) Listen to the customers. Listen on IRC, on the mailinglists, on the numerous third-party Apache HTTP Server support sites. Answer their questions and enhance the documents so that they don't need to ask it again.\n2) Use the product and verify that what the documents say are actually correct, make sense, and are grammatically correct.\n3) Lower the bar to entry, so that folks who want to contribute fixes to the docs are not discouraged from doing so.\n\nExact implementation details are left to everyone in the community.\n\nMarking resolved, not because it's a closed issue, but because it's an always-open issue with a known and documented solution that we have only to continue to apply every day.", "id": 141291, "time": "2010-10-31T19:23:40Z", "creator": "rbowen@apache.org", "creation_time": "2010-10-31T19:23:40Z", "is_private": false, "attachment_id": null}]