[{"count": 0, "tags": [], "text": "Created attachment 26089\nimprove division of responsibility for isUserInRole and login/logout methods\n\nThere are 2 similar problems that have a bad division of responsibility.\n\n1. Request.isUserInRole tries to prevent jacc implementations and is also wrong.\n\nIn the current tomcat implementation, role-ref mappings are first applied to the supplied role and then the target role is tested. If the user is not in the mapped role the original role is tested. However,\n(a). jacc requires that this be implemented by constructing a role-ref permission with the current servlet name and the supplied (not mapped) role. So to be reasonably amenable to a jacc implementation Request.isUserInRole should supply the original role and if possible the servlet name to the wrapper.\n(b) if there is a mapping, only the mapped role should be checked. Aside from the spec language, consider a web app with two roles A and B and a servlet S that maps A to B and B to A. A user that logs in and is in role A and not B should be able to test in S\n\nis in A >> false\nis in B >> true\n\nThe current implementation reports true for both A and B.\n\n2. The implementation of the new login and logout methods are excessively intrusive into the internals of the authentication. Both should be delegated directly to the Authenticator. In particular, checking which known Authenticator is installed to see if it supports user/pw login is overly restrictive since other authenticators might be installed. The authenticator also ought to be able to decide if it wants to cache the authentication results.", "is_private": false, "id": 140240, "creator": "djencks@apache.org", "time": "2010-09-27T16:56:39Z", "bug_id": 50016, "creation_time": "2010-09-27T16:56:39Z", "attachment_id": 26089}, {"count": 1, "tags": [], "text": "Fixed in trunk with some alterations:\n- removed rather than deprecated unnecessary code\n- kept line lengths to <=80\n- Used string manager so messages have i18n support\n\nThe fix will be in 7.0.4 onwards.", "is_private": false, "id": 140589, "creator": "markt@apache.org", "time": "2010-10-08T09:59:47Z", "bug_id": 50016, "creation_time": "2010-10-08T09:59:47Z", "attachment_id": null}]