[{"count": 0, "tags": [], "bug_id": 50014, "attachment_id": null, "id": 140234, "time": "2010-09-27T14:03:10Z", "creator": "holtisep@xs4all.nl", "creation_time": "2010-09-27T14:03:10Z", "is_private": false, "text": "The finish() method of TarOutputStream does not flush the TarBuffer to the underlying output stream. A subsequent flush() on the TarOutputStream unexpectedly does not flush all written data to the underlying stream.\n\nCase: If an outputStream is tied to a Socket OutputStream, the receiving server can be notified that the stream has finished by calling the Socket.shutdownOutput() method while still allowing the server to respond to the client e.g. for sending a status report of the finished data transfer. This is in particular usefull if the size of the stream is not known in advance such as for a tar stream generated on the fly at the client side.\n\nThe above case relies on all data being sent to the server before invoking Socket.shutdownOutput(). The TarOutputStream finish() method suggests to be doing just this but in practice does not send any remaining data in the TarBuffer. Calling the TarOutputStream close() method is not an option in this case since this also closes the Socket connection.\n\nQuick fix: insert a buffer.flushBlock() statement at the end of the TarOutputStream.finish() method."}, {"count": 1, "tags": [], "bug_id": 50014, "attachment_id": null, "text": "In general I'd encourage you to use Apache Commons Compress rather than Ant's\nimplementations of tar/bzip2 or zip since the Ant classes are really more\ntailored to Ant's usage and not expected to be used outside of this context.\n\nThat being said, the same issue applies there as well\nhttps://issues.apache.org/jira/browse/COMPRESS-119", "id": 140437, "time": "2010-10-04T08:34:00Z", "creator": "bodewig@apache.org", "creation_time": "2010-10-04T08:34:00Z", "is_private": false}, {"count": 2, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 141038, "time": "2010-10-26T05:50:51Z", "bug_id": 50014, "creation_time": "2010-10-26T05:50:51Z", "is_private": false, "text": "fixed in Commons Compress with svn revision 1027427 and in Ant with svn revision 1027431"}]