[{"count": 0, "tags": [], "creator": "mark.tischler@alcatel-lucent.com", "text": "We would like to have an *encrypted* password sent from *the browser to the Apache web server* when authenticating via LDAP.  I understand that encryption is performed from the web server to the LDAP server by using ldaps, which we\nare using, but we are getting complaints that the password is traveling from the users' web browsers to our Apache web server in the clear (not encrypted).  The problem really requires that the web browsers and Apache support an encrypted authentication over http instead of counting on wrapping everything via https.\n\nI understand that I could force the users to use an https URL instead of an http URL, but that seems like it would be overkill.\n\nI also understand that using the Digest method of authentication (vs. Basic) does not work with LDAP.\n\nThere is a discussion from Aug. 2007 at http://www.latenightpc.com/blog/archives/2007/08/31/no-authtype-digest-with-ldap-authentication-provider-for-apache-today.  Unfortunately, after more than 3 years, it doesn't appear that this issue has been addressed.\n\nI searched the ASF Bugzilla database for a request similar to this, but found none.  Are there any plans to support this in the near future?", "id": 140303, "time": "2010-09-29T14:12:41Z", "bug_id": 50028, "creation_time": "2010-09-29T14:12:41Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 50028, "is_private": false, "id": 140305, "attachment_id": null, "creator": "sf@sfritsch.de", "creation_time": "2010-09-29T17:28:55Z", "time": "2010-09-29T17:28:55Z", "text": "It simply can't work. Citing a comment from the URL you have given:\n\n'It is impossible to use Digest and LDAP together. This is because the LDAP server can only answer to a query like \"is password Y correct for user X?\", but it will never give the password. Digest, then, does not send a password to the server. This means Apache doesn't have a password Y to query the LDAP server.'\n\n\nYou will have to use https instead."}, {"count": 2, "attachment_id": null, "bug_id": 50028, "text": "I wasn't suggesting that you make LDAP work with Digest.  I was suggesting that someone come up with a way to allow the password to be encrypted between the browser and the web server before it gets sent to the LDAP server.  There must be a way to do this, even if it means creating a completely new mechanism to do it.  It is unacceptable to ask users to wrap their applications in SSL, given that SSL incurs performance hits.  There ought to be a way for the equivalent of Digest (read: not *actually* Digest) to work with LDAP.  That is, it would be nice if the public key encryption worked between the browser and Apache for the password part.  Would it be reasonable to re-open this or reassign it so that you or others might be able to suggest ways to do this?", "id": 140306, "time": "2010-09-29T17:36:02Z", "creator": "mark.tischler@alcatel-lucent.com", "creation_time": "2010-09-29T17:36:02Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 50028, "is_private": false, "text": "This won't happen.  ldaps and ldap StartTLS exist for this purpose.\n\nIt is not unreasonable to ask for an enhancement to use an ldap data store for \ndigest authentication credentials; that we are willing to investigate when\nsomeone has free time to do so.  Perhaps a local ldap procedure for validating\na user/pass/realm token?\n\nIt is not likely to happen for 2.2.", "id": 140307, "time": "2010-09-29T17:47:48Z", "creator": "wrowe@apache.org", "creation_time": "2010-09-29T17:47:48Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 50028, "is_private": false, "id": 140308, "attachment_id": null, "creator": "mark.tischler@alcatel-lucent.com", "creation_time": "2010-09-29T17:50:31Z", "time": "2010-09-29T17:50:31Z", "text": "ldap and ldaps exist for the route between the web server and the LDAP server.  But I'm talking about the route between the browser and the web server.\n\nI'm not sure what you mean by an \"ldap data store\", though."}, {"count": 5, "attachment_id": null, "bug_id": 50028, "text": "For user agent to server communications, there are only two, basic and digest,\nand we aren't inventing protocols here, take it to the IETF.\n\nYou would prefer the phrase 'attribute' for the user/pass/realm hash, I presume.", "id": 140309, "time": "2010-09-29T18:19:47Z", "creator": "wrowe@apache.org", "creation_time": "2010-09-29T18:19:47Z", "tags": [], "is_private": false}, {"count": 6, "tags": [], "creator": "covener@gmail.com", "text": "> was suggesting that someone come up with a way to allow the password to be \n> encrypted between the browser and the web server before it gets sent to \n> the LDAP server\n\nClosing as WONTFIX as we won't be inventing some protocol to encrypt an LDAP password between the browser and server.", "id": 142368, "time": "2010-12-04T07:26:20Z", "bug_id": 50028, "creation_time": "2010-12-04T07:26:20Z", "is_private": false, "attachment_id": null}]