[{"count": 0, "tags": [], "bug_id": 50046, "attachment_id": null, "text": "The new functionality added to the SMTP Sampler (send plain body) is partially ignored.\n\nIf there is some text in the message area, this test will be sent as body independent of the check box being selected or not.\n\nWith the checkbox selected I expected JMeter to ignore anything that may be written there.\n\nAttached you will find a patch that corrects this behavior. Additionally, In the patch I removed the verification on the attached file and body length.\n\nThe number of attached files is later checked on the if statement, and the length of the message should simply be ignore.", "id": 140480, "time": "2010-10-05T05:09:39Z", "creator": "moreira@privasphere.com", "creation_time": "2010-10-05T05:09:39Z", "is_private": false}, {"count": 1, "tags": [], "creator": "moreira@privasphere.com", "attachment_id": 26121, "id": 140481, "time": "2010-10-05T05:10:36Z", "bug_id": 50046, "creation_time": "2010-10-05T05:10:36Z", "is_private": false, "text": "Created attachment 26121\nPatch to correctly handle the plain body checkbox"}, {"count": 2, "tags": [], "bug_id": 50046, "attachment_id": null, "id": 140498, "time": "2010-10-05T19:02:03Z", "creator": "milamber@apache.org", "creation_time": "2010-10-05T19:02:03Z", "is_private": false, "text": "Hello,\nOriginal patch for Bug 49775 is to \"Allow sending messages without a body\"\nFinally the patch became \"Send plain body\"\n\nI think you want this behavior below (with your patch 50046 & 50047):\nIf Message field is empty and checkbox Send plain body  is checked and Attach files is empty ==> SMTP sampler sends a message without a body?\n\nsebb in Bug 49775, final patch added this behaviors:\n* If Message field is empty *or not* and checkbox Send plain body  is checked and Attach files is empty ==> SMTP sampler sends a message with content Message field (mailBody)\n* If Message field is empty and checkbox Send plain body is checked and Attach files is not empty\n==> SMTP sampler send a message with a \"send-as-is\" for attach files (mailBody is ignored)\n\nI think we need a new checkbox \"Suppress body (mail sent with no body)\" which disable Message field and all attach files/eml?\n\nMilamber"}, {"count": 3, "tags": [], "bug_id": 50046, "attachment_id": null, "id": 140499, "time": "2010-10-05T19:39:33Z", "creator": "sebb@apache.org", "creation_time": "2010-10-05T19:39:33Z", "is_private": false, "text": "My testing generated the following error if there was no body:\n\njava.io.IOException: No content\n\nIn order to suppress this, I had to add the following:\n\nmessage.setText(\"\");\n\nwhich results in an empty body.\n\nThis can be achieved with the current code by ensuring that:\n- there are no files\n- the message field is empty\n- \"send plain body\" is checked\n\nDoes that not do what you want? If not, what is wrong with the output?"}, {"count": 4, "tags": [], "bug_id": 50046, "text": "Thank you very much for the quick reply.\nIn regard to comment 3, I also saw that same error in my own tests. I believe your solution message.setText(\"\"); is the correct one.\n\nFrom what I see in the code, the need for the \"plain body\" checkbox is doubtful. Am I correct that we can achieve the exact same behavior of the check box simply by not adding any text to the message area and not add any attachment?\n\nBy selecting the checkbox, I expected JMeter to create a plain body and not use the text in the message area. If we use the text in there, then it is not plain body anymore.\n\nSo I believe the correct behaviour should rather be:\n\n•  If checkbox Send plain body is checked and Attach files is empty \n    ==> SMTP sampler sends a message with content message.setText(\"\")\n\n•  If checkbox Send plain body is checked and Attach files is not empty\n   ==> SMTP sampler send a message with a \"send-as-is\" for attach files (mailBody is ignored)\n\nSummarizing, I see no reason to add message text if we select plain body. This is what I attempted to do with my patch.", "id": 140512, "time": "2010-10-06T10:09:12Z", "creator": "moreira@privasphere.com", "creation_time": "2010-10-06T10:09:12Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 140546, "time": "2010-10-07T06:49:54Z", "bug_id": 50046, "creation_time": "2010-10-07T06:49:54Z", "is_private": false, "text": "(In reply to comment #4)\n> Thank you very much for the quick reply.\n> In regard to comment 3, I also saw that same error in my own tests. I believe\n> your solution message.setText(\"\"); is the correct one.\n> \n> From what I see in the code, the need for the \"plain body\" checkbox is\n> doubtful. Am I correct that we can achieve the exact same behavior of the check\n> box simply by not adding any text to the message area and not add any\n> attachment?\n\nNo.\n\nThe check-box affects the format of the message.\n\n> By selecting the checkbox, I expected JMeter to create a plain body and not use\n> the text in the message area. If we use the text in there, then it is not plain\n> body anymore.\n\nYes, it is still plain body - as opposed to multipart/mixed.\n\n> So I believe the correct behaviour should rather be:\n> \n> •  If checkbox Send plain body is checked and Attach files is empty \n>     ==> SMTP sampler sends a message with content message.setText(\"\")\n\nIt does that if you leave the message field empty.\n \n> •  If checkbox Send plain body is checked and Attach files is not empty\n>    ==> SMTP sampler send a message with a \"send-as-is\" for attach files\n> (mailBody is ignored)\n\nIt does that, so long as the message field is empty.\n \n> Summarizing, I see no reason to add message text if we select plain body. This\n> is what I attempted to do with my patch.\n\nYour patch would mean one could only use multipart/mixed, even if there were no files."}, {"count": 6, "tags": [], "bug_id": 50046, "text": "> > By selecting the checkbox, I expected JMeter to create a plain body and not\n> use\n> > the text in the message area. If we use the text in there, then it is not\n> plain\n> > body anymore.\n> \n> Yes, it is still plain body - as opposed to multipart/mixed.\n\nThx for the clarification, this phrase you posted made things clear to me now. So, yes, no need for fix.", "id": 140548, "time": "2010-10-07T07:01:12Z", "creator": "moreira@privasphere.com", "creation_time": "2010-10-07T07:01:12Z", "is_private": false, "attachment_id": null}]