[{"count": 0, "tags": [], "bug_id": 50048, "attachment_id": null, "id": 140494, "time": "2010-10-05T14:56:03Z", "creator": "lmeyer@vmware.com", "creation_time": "2010-10-05T14:56:03Z", "is_private": false, "text": "ProxyPass can get its first argument (the path) from a wrapping Location block. ProxyPassMatch can get its first argument (the regex) from a wrapping LocationMatch (or Location ~, which I won't mention again) block.\n\nThe ProxyPass docs are pretty clear about the first case. They don't really mention the second case, and also don't describe what happens if you mix and don't match - in particular, a ProxyPass within LocationMatch is probably not going to do what the user hopes. And also, ProxyPassReverse is only discussed in the context of Location.\n\nFor any who wonder - my understanding is that when these directives are used inside a Location or LocationMatch block, the argument to the block is used verbatim as the argument to the directive. When one is expecting a regex and the other a path, results may be surprising, but httpd will not complain about the syntax.\n\nI propose changes to three sections:\n1) http://httpd.apache.org/docs/2.2/mod/mod_proxy.html#proxypass\n\nMention that if you're trying to put this inside LocationMatch, you probably want the ProxyPassMatch directive instead.\n\n2) http://httpd.apache.org/docs/2.2/mod/mod_proxy.html#proxypassmatch\n\nExplain that inside LocationMatch, the first argument comes from the block. Currently the syntax marks the regex as optional, while not explaining where it would come from.\n\n3) http://httpd.apache.org/docs/2.2/mod/mod_proxy.html#proxypassreverse\n\nExplain that inside Location or LocationMatch, the first argument comes from the block, and that this is probably not desirable inside LocationMatch (perhaps there should be a ProxyPassReverseMatch?)."}, {"count": 1, "tags": [], "creator": "lmeyer@vmware.com", "text": "Created attachment 26127\nProposed patch for the mod_proxy docs\n\nAttaching proposed changes - would appreciate someone evaluating and applying it.", "id": 140518, "time": "2010-10-06T14:01:30Z", "bug_id": 50048, "creation_time": "2010-10-06T14:01:30Z", "is_private": false, "attachment_id": 26127}, {"count": 2, "tags": [], "bug_id": 50048, "attachment_id": null, "text": "Thanks Luke -- committed and backported to 2.2.x in r1021471.", "id": 140672, "time": "2010-10-11T15:16:36Z", "creator": "covener@gmail.com", "creation_time": "2010-10-11T15:16:36Z", "is_private": false}]