[{"count": 0, "tags": [], "bug_id": 50055, "attachment_id": null, "id": 140545, "time": "2010-10-07T06:41:19Z", "creator": "gaealimited@live.com", "creation_time": "2010-10-07T06:41:19Z", "is_private": false, "text": "Millions and millions of people all around the world, across all cultures and all beliefs, enjoy the benefits of metaphysical healing using crystals and gemstones.\nMetaphysical healing is a science practiced by many doctors, mathematicians and scientists. It is based on the belief that negative mental patterns can eventually result in physical illness; and that the reversing of those negative mental patterns into positive patterns can in turn lead to healing. Crystals and Gemstones are used in the process to help neutralise negative energy and/or create positive energy.\n\nThere is little doubt about the connection between mind and body. Doctors routinely tell patients to keep spirits high, understanding that anything that makes a patient feel better mentally and emotionally, aids in healing. Depression, on the other hand, tends to slow healing. \nResearch in 2010, led by Ellen Langer at Harvard University, was initiated to help understand how the mind and body connect, particularly how mindset affects the body's performance.\n\nLanger has studied this kind of connection for decades. \"Many of the things that we think we can't do are a function of our mindset rather than our abilities to do them,\" she says. \nIn one of her recent studies, she wanted to understand how eyesight can be improved by our mind. To help determine this, she looked at the belief that pilots have good eyesight. College students in the Reserve Office Training Corps (ROTC) in USA, dressed in army attire, flew in a flight simulator and then did an eyesight test. The same experiment was then repeated, but the second time students were told the simulator was broken, and that they should just pretend to fly the plane. The people who had performed like pilots, as opposed to those who just pretended, had a 40 percent improvement in their eyesight.\n\nThese findings suggest that visual acuity is influenced by mindset and can be improved by psychological means. Further studies indicated that these findings are not just related to eyesight; every part of the body and its performance can be improved by psychological means. These studies reinforce the metaphysical healing science and the positive wellbeing that is derived from processes such as Chakra and Reiki.\nIn such processes, people use crystals and gemstones on and about their person, around their homes and work environments to neutralise negative energy, depression or ill feelings. Unfortunately crystals can physically weigh many lbs or kg’s. They are not that portable and they are easily damaged. However faceted gemstones provided by G.A.E.A. Limited, are a practical solution as these healing gemstones can be worn in rings, pendants, earrings and all types of jewelry. Wearing an appropriately faceted gemstone provides the wearer with constant positive psychological wellbeing as well as the physical good feeling one gets by having something precious and beautiful on display.\n\nG.A.E.A Limited are pioneers in faceting healing gemstones such as Witches Finger, Orange River Quartz, Labradorite and other metaphysical healing minerals. These faceted gemstones help deliver psychological benefits to the wearer which, according to Langer’s associated research, in turn can lead to improved body performance and a healthier life.\nG.A.E.A. Limited is a UK company who specialise in faceting non-commercially available healing gemstones used in metaphysical healing. See www.gaealimited.com for further information.\n\n\n\n\n\n\n\n<a href=”http://gaealimited.com”>www.gaealimited.com</a>"}]