[{"count": 0, "tags": [], "bug_id": 50053, "attachment_id": null, "text": "According to the documentation:\n\"Timers are only processed in conjunction with a sampler. A timer which is not in the same scope as a sampler will not be processed at all. \"\n\nIt would be very good to see timers that will be ignored marked in red or yellow in the JMeter GUI.", "id": 140538, "time": "2010-10-07T03:55:52Z", "creator": "moreira@privasphere.com", "creation_time": "2010-10-07T03:55:52Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50053, "attachment_id": null, "id": 140544, "creation_time": "2010-10-07T06:20:57Z", "time": "2010-10-07T06:20:57Z", "creator": "sebb@apache.org", "text": "Similar reasoning applies to Assertions, Pre- and Post-Processors, and even Listeners.\n\nI think this will be quite difficult to implement, and would need to be carefully designed to ensure it did not impose a run-time load.\n\nAlso, unless all the samplers are added first, the indicators would keep changing as a test plan was being updated.", "is_private": false}, {"count": 2, "tags": [], "creator": "moreira@privasphere.com", "attachment_id": null, "id": 140550, "time": "2010-10-07T07:09:23Z", "bug_id": 50053, "creation_time": "2010-10-07T07:09:23Z", "is_private": false, "text": "I agree with you in all points. But changing the indicators is what helps the developer see where his/her errors might be. Given that \"similar reasoning applies to Assertions, Pre- and Post-Processors, and even Listeners\", maybe we can extend the idea to these elements.\n\nFor the design I would suggest to add a verification function in the method that adds the element (or move it). This would reduce the runtime load to verifications done on single elements, in contrast to the entire tree. I haven't looked into the code to see what changes would be necessary though.\n\nOf course, once the script is loaded, it would be necessary to do a full run. If this turns out to be too heavy for certain scripts, we can always add a property to disable it."}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "text": "One could easily add a menu item to run the check manually, and not try to do it automatically.\n\nNote that adding or moving a sampler would potentially affect every other item in the tree.\n\nHowever, the main difficulty is likely to be implementing the check itself; the test tree is one of the most complicated parts of JMeter.", "id": 140551, "time": "2010-10-07T07:22:25Z", "bug_id": 50053, "creation_time": "2010-10-07T07:22:25Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "text": "Too much work for low value.", "id": 196417, "time": "2017-01-25T19:43:30Z", "bug_id": 50053, "creation_time": "2017-01-25T19:43:30Z", "is_private": false, "attachment_id": null}]