[{"count": 0, "tags": [], "bug_id": 50068, "is_private": false, "text": "The <sql:setDataSource> tag may instantiate a new instance of a JDBC Driver from a Class name supplied as a tag attribute. This is done using the application's ClassLoader. The JDBC specification recommends that implementations register instances of their Driver with the DriverManager during class (static) initialization. As a result, the DriverManager will retain references to classes loaded by the application ClassLoader leading to a memory leak.", "id": 140628, "time": "2010-10-09T18:42:03Z", "creator": "jboynes@apache.org", "creation_time": "2010-10-09T18:42:03Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "bayard@apache.org", "attachment_id": null, "id": 141522, "time": "2010-11-07T02:36:43Z", "bug_id": 50068, "creation_time": "2010-11-07T02:36:43Z", "is_private": false, "text": "Seems like there are three paths:\n\n1) Document that this exists and point out that people should be using the dataSource parameter anyway.\n2) Document and provide a flag that disables this part of the spec - 'DISABLE_SHODDY_SPEC_FEATURES' or its ilk. We could disable x:forEach too :) There are other items in the FAQ, so it's possible there are other crufty pieces of code that should be disabled.\n3) Solve the problem while maintaining the feature.\n\nI don't see any solutions for 3, but maybe someone else does."}, {"count": 2, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "1. The only way that I see that this can be solved is to define a listener.\n\nEven if the tag was the first to register a JDBC driver, it cannot unload it immediately after use, but can do it only when the webapp stops. That would be a task for a listener, not for a tag. A tag library can define listeners in its TLD.\n\n(Or a webapp can define its own listener for the purpose of [registering and] deregistering its JDBC drivers.)\n\n\n2. The JSTL spec explicitly says that such usage is not recommended.\n\nReading jstl-1_2-mrel2-spec.pdf, chapter 10.6 \"<sql:setDataSource>\":\n\n[cite]\nAs mentioned in Section 10.1.1, using JDBC’s DriverManager class to access a\ndatabase is intended for prototyping purposes only because it does not provide\nconnection management features one can expect from a properly designed\nDataSource object.\n[/cite]", "id": 141527, "time": "2010-11-07T12:00:40Z", "bug_id": 50068, "creation_time": "2010-11-07T12:00:40Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 50068, "is_private": false, "text": "Resolving per Henri's option 1 that this is a \"feature\" and the advice is to use a DataSource from the container rather than a raw JDBC Driver.", "id": 142903, "time": "2010-12-21T22:51:28Z", "creator": "jboynes@apache.org", "creation_time": "2010-12-21T22:51:28Z", "attachment_id": null}]