[{"count": 0, "tags": [], "bug_id": 50098, "attachment_id": null, "text": "Because AFP doesn't use floating point numbers to define x,y co-ordinates (like PDF and PS) there are rounding error that cause border inconsistencies. However, because (I presume) most borders are very thin, they are barely visible. This issue became apparent when fixing Bug# 15368.\n\nWhen using dashed borders, this issue is much more visible since it manifests in non-squared borders i.e. there are white-spaces in corners rather than proper squared borders.", "id": 140762, "time": "2010-10-15T10:50:47Z", "creator": "med1985@gmail.com", "creation_time": "2010-10-15T10:50:47Z", "is_private": false}, {"count": 1, "tags": [], "creator": "gadams@apache.org", "is_private": false, "id": 157382, "attachment_id": null, "bug_id": 50098, "creation_time": "2012-04-07T01:42:11Z", "time": "2012-04-07T01:42:11Z", "text": "resetting P2 open bugs to P3 pending further review"}, {"count": 2, "tags": [], "bug_id": 50098, "text": "please provide a test input FO file and an image of currently produced AFP (for those of us who don't have access to an AFP output device", "id": 157747, "time": "2012-04-09T18:55:10Z", "creator": "gadams@apache.org", "creation_time": "2012-04-09T18:55:10Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "med1985@gmail.com", "attachment_id": null, "text": "This doesn't require a single FO to demonstrate the point, it was more of a marker for illustrating a flaw in how the AFP rendering works. The AFP painter does a lot of arithmetic and the floating-point -> integer conversion happens too early, magnifying rounding errors.\n\nAs always, this just needs time... Sorry if that isn't very helpful", "id": 157750, "time": "2012-04-09T19:02:49Z", "bug_id": 50098, "creation_time": "2012-04-09T19:02:49Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 50098, "attachment_id": null, "id": 157751, "time": "2012-04-09T19:15:22Z", "creator": "gadams@apache.org", "creation_time": "2012-04-09T19:15:22Z", "is_private": false, "text": "(In reply to comment #3)\n> This doesn't require a single FO to demonstrate the point, it was more of a\n> marker for illustrating a flaw in how the AFP rendering works. The AFP painter\n> does a lot of arithmetic and the floating-point -> integer conversion happens\n> too early, magnifying rounding errors.\n> \n> As always, this just needs time... Sorry if that isn't very helpful\n\nwhen someone gets around to looking at this, it will be important to have a test file that demonstrates the problem; i don't see why you can't construct such a test file"}, {"count": 5, "tags": [], "bug_id": 50098, "text": "Well, because I could append the original FO but that would only show a subset of the problem. The issue is a systemic one, concerning how floating point numbers are handled, or not handled as the case may be in some cases, in the AFP rendering system.\n\nCoincidentally r1311638, which I've just applied also addresses one of many symptoms of this problem. But this issue isn't present and wouldn't have been noticed when this problem was initially recognised. If you are demanding an FO; playing with Bug#45822 would be sufficient, but again this is only subset of the symptoms.", "id": 157766, "time": "2012-04-10T08:50:44Z", "creator": "med1985@gmail.com", "creation_time": "2012-04-10T08:50:44Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 158355, "time": "2012-04-24T05:51:37Z", "bug_id": 50098, "creation_time": "2012-04-24T05:51:37Z", "text": "(In reply to comment #5)\n> Well, because I could append the original FO but that would only show a subset\n> of the problem. The issue is a systemic one, concerning how floating point\n> numbers are handled, or not handled as the case may be in some cases, in the\n> AFP rendering system.\n> \n> Coincidentally r1311638, which I've just applied also addresses one of many\n> symptoms of this problem. But this issue isn't present and wouldn't have been\n> noticed when this problem was initially recognised. If you are demanding an FO;\n> playing with Bug#45822 would be sufficient, but again this is only subset of\n> the symptoms.\n\nyes, i'm asking for a minimal input FO, an output PDF, and any relevant console log;"}, {"count": 7, "tags": [], "bug_id": 50098, "attachment_id": 28791, "id": 159097, "time": "2012-05-16T14:36:11Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-05-16T14:36:11Z", "is_private": false, "text": "Created attachment 28791\ntest *.fo file"}, {"count": 8, "tags": [], "creator": "lmpmbernardo@gmail.com", "attachment_id": 28792, "is_private": false, "id": 159098, "time": "2012-05-16T14:37:01Z", "bug_id": 50098, "creation_time": "2012-05-16T14:37:01Z", "text": "Created attachment 28792\ntest *.afp output"}]