[{"count": 0, "tags": [], "bug_id": 50100, "attachment_id": null, "id": 140764, "time": "2010-10-15T22:39:26Z", "creator": "andrejohn.mas@gmail.com", "creation_time": "2010-10-15T22:39:26Z", "is_private": false, "text": "I generated some an SVG document using the SVGGraphics2D Java class. I first displayed the document in Safari which showed everything as expected, with the text in the right size. Trying the same in Firefox 3.6 and Opera 10.63 on MacOS X resulted in the text being the wrong size. \n\nLooking at the source of the generated document I noticed that the font-size has no unit:\n\n<g style=\"font-family:&apos;Arial&apos;; font-size:10;\">\n\nChanging the style by hand to include the unit resolves the font size issue in both Firefox and Opera:\n\n<g style=\"font-family:&apos;Arial&apos;; font-size:10px;\">"}, {"count": 1, "tags": [], "bug_id": 50100, "attachment_id": null, "is_private": false, "id": 140765, "time": "2010-10-15T22:41:01Z", "creator": "andrejohn.mas@gmail.com", "creation_time": "2010-10-15T22:41:01Z", "text": "The issue was produced while using Batik 1.7."}, {"count": 2, "tags": [], "text": "(In reply to comment #0)\n> I generated some an SVG document using the SVGGraphics2D Java class. I first\n> displayed the document in Safari which showed everything as expected, with the\n> text in the right size. Trying the same in Firefox 3.6 and Opera 10.63 on MacOS\n> X resulted in the text being the wrong size. \n> \n> Looking at the source of the generated document I noticed that the font-size\n> has no unit:\n> \n> <g style=\"font-family:&apos;Arial&apos;; font-size:10;\">\n\nI can confirm this. Firefox is strict-compliant to the SVG specification by ignoring the (invalid) CSS declaration when no units are provided.\n\nI remind that font-size is valid without units when used as XML attribute, so toggling the SVG generator to use XML attributes instead of CSS style declarations can help. I don't have a pointer handy to the relevant documentation on how to do this, nor I've checked that it is even possible with SVGGraphics2D, but take a look at \"useCss\" in the SVG generator documentation [1]. ;-)\n\n\n> Changing the style by hand to include the unit resolves the font size issue in\n> both Firefox and Opera:\n> \n> <g style=\"font-family:&apos;Arial&apos;; font-size:10px;\">\n\nRight, that may be a current (but ugly) workaround for things to work while this is being worked on. Another, more elegant IMO, would be to set the already stated \"useCss\" to false when generating SVG. If you try it, please confirm that it works as a workaround.\n\n\nAt last but not least, please consider attaching a reduced (as simple as it can get) test case in order for anyone to be able to reproduce the issue. (For example, as I'm not familiar with SVGGraphics2D, I'm not even able to reproduce this without a big time investment.)\n\n\n[1] http://xmlgraphics.apache.org/batik/using/svg-generator.html", "is_private": false, "id": 140784, "creator": "helder.magalhaes@gmail.com", "time": "2010-10-17T04:59:08Z", "bug_id": 50100, "creation_time": "2010-10-17T04:59:08Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "Created attachment 26206\nTest case\n\nSetting useCSS to false, in the stream() call does workaround the css issue.\n\nI have attached a test case that draws text in 3 different sizes: 14px, 12px and 10px. In Firefox these are all drawn the same size, whereas in Safari they are drawn at different sizes.\n\nIt appears that the class SVGFontDescriptor is responsible for display the text and modifying:\n\nattrMap.put(SVG_FONT_SIZE_ATTRIBUTE, fontSize);\n\nto\n\nattrMap.put(SVG_FONT_SIZE_ATTRIBUTE, fontSize + \"px\");\n\nresolves the issues, but in doing so also impacts the case when useCSS=false, though, it should be noted that in testing with Opera, Safari and Firefox that all three browsers appear to accept the unit in the non-CSS \"font-size\" attribute, and display the font in the correct sizes.\n\nWould simply appending the unit in this location be appropriate as a fix, or should we be looking at another approach to fixing this issue?", "attachment_id": 26206, "id": 140945, "creator": "andrejohn.mas@gmail.com", "time": "2010-10-22T14:17:39Z", "bug_id": 50100, "creation_time": "2010-10-22T14:17:39Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 50100, "attachment_id": null, "id": 141083, "time": "2010-10-27T01:13:01Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2010-10-27T01:13:01Z", "is_private": false, "text": "(In reply to comment #3)\n> It appears that the class SVGFontDescriptor is responsible for display the text\n> and modifying:\n> \n> attrMap.put(SVG_FONT_SIZE_ATTRIBUTE, fontSize);\n> \n> to\n> \n> attrMap.put(SVG_FONT_SIZE_ATTRIBUTE, fontSize + \"px\");\n> \n> resolves the issues, but in doing so also impacts the case when useCSS=false,\n> though [...]\n\nCould you generate a patch with this and attach to this bug? I'd say it's not a good correction, but I may already help other users in the meantime... :-)\n\n\n> [...] it should be noted that in testing with Opera, Safari and Firefox that\n> all three browsers appear to accept the unit in the non-CSS \"font-size\"\n> attribute, and display the font in the correct sizes.\n\nAs stated (in comment 2) this had to do with compliance. I haven't checked for sure but yes, your description corresponds to what the specification says it should happen (and also to what my testing experience with this sort of things has showed me, but last time I checked was probably a few years ago).\n\n\n> Would simply appending the unit in this location be appropriate as a fix, or\n> should we be looking at another approach to fixing this issue?\n\nI'd say no, this isn't a good fix: you even already recognize it breaks \"useCSS=false\", which would be an important regression IMO.\n\nAlso, I guess you generally can do that assumption (user units=px) but my feeling is that some corner cases (like percent sizes) may not be covered by this...? To be further investigated.\n\nAs stated above, I'd consider this a workaround until a better fix/ideas can be provided (Cameron? Thomas?)."}, {"count": 5, "tags": [], "bug_id": 50100, "attachment_id": null, "is_private": false, "id": 143447, "time": "2011-01-18T15:56:03Z", "creator": "cam@apache.org", "creation_time": "2011-01-18T15:56:03Z", "text": "Fixed in r1060577."}]