[{"count": 0, "tags": [], "creator": "ej@cgram.com", "attachment_id": null, "text": "I am not a very experienced Apache person, so please forgive me if I have this wrong.  If this is just user error, feel free to delete (although the solution would be appreciated.)\n\nEssentially there seems to be a way of bypassing Digest authentication.  N.B. these webpages are under development and sit in a sub-tree htdocs/website .\n\n1. In my httpd.conf I have set \"AllowOverride All\" in all directories just to be sure.  It made no difference.  The mod_auth_digest module is built-in using the flag to 'configure'.\n2. In the htdocs/protected directory I have a .htaccess file\n\nAuthType Digest\nAuthName \"Please login\"\nAuthUserFile /srv/www/passwd\nRequire user users\n\nErrorDocument 401 \"/website/preloginrequired.html\"\nErrorDocument 404 \"/website/preloginrequired.html\"\n\nNote that I use AuthUserFile because it works, whereas AuthDigestFile throws an 'Invalid command' line in error_log, plus authentication doesn't work.\n\n3. I have a page htdocs/website/loginclientarea.html that essentially puts a message on the screen that says \"Please login\", it also has\n<body onLoad=\"window.location='protected/clientarea.html'\">\n\nAs soon as the page has pasted, it tries to branch to the protected page, causing the browser login box to appear.  So I get a login page, and when they have completed it successfully, they get into the protected page.  Works on every browser I can find, bar one.\n\nOn version 6.0.2800.1106.xpsl.020828-1920 of IE6 no browser login box is presented and you arrive straight into the protected page without giving a  password.  Just to make sure there is no issue of cached passwords etc. I have changed the password on 'protected' twice and it still happens although this browser has never logged into the protected page with the new password.\n\nI suggest this is not a browser issue; the Apache server should not be handing out the page without authentication under any circumstances.  But it does.", "id": 141123, "time": "2010-10-28T09:30:07Z", "bug_id": 50172, "creation_time": "2010-10-28T09:30:07Z", "is_private": false}, {"count": 1, "tags": [], "creator": "poirier@pobox.com", "text": "Can you get a network trace of IE6 accessing the protected page without a userid/password?  Also please provide the configuration files.", "id": 141127, "time": "2010-10-28T10:32:29Z", "bug_id": 50172, "creation_time": "2010-10-28T10:32:29Z", "is_private": false, "attachment_id": null}]