[{"count": 0, "attachment_id": 26229, "bug_id": 50184, "is_private": false, "id": 141245, "time": "2010-10-29T17:12:34Z", "creator": "arielandres@hotmail.com", "creation_time": "2010-10-29T17:12:34Z", "tags": [], "text": "Created attachment 26229\nproposed patch\n\nHi,\n\nI'm using apache tribes outside of Tomcat.\nAlthough my version is not the latest one, this also applies to trunk.\n\nI have a customer that was using Bio senders (a version before to the excecutors refactor see bug 50183), and there were experiencing some weird behavior. (I couldn't reproduce it, but I guess it is related with the platform since they are using solaris)\n\nMy application uses tribes to create an RPC channel. They also had some network issues.\nSo, in certain occasions, the application invoked a remote method, the remote node processed the invocation and send the answer back (but it is not received in the first node).\nSo, the timeout occurs and eventually a new RPC invocation occurs. But this time, the second node realized that there is a socket issue when trying to send the answer back (it gets a broken pipe exception). Them the connection is re-established and the message is received without any issues.\n\nMy customer is complaining about the timeout that occurred the first time.\n\nTo send the message we do the following:\nBioSender.pushMessage(.....) {\n    ...\n    soOut.write(data);\n    soOut.flush();\n    ...\n}\nBut the flush operation does not warranty that the message was successfully sent to the network. It just warranty that the information was passed to the S.O. \nhttp://download.oracle.com/javase/6/docs/api/java/io/OutputStream.html#flush()\n\nSo, in order to avoid this issue I thought that we can modify the RpcChannel to send the reply message using SEND_OPTIONS_USE_ACK option.\nSetting this, the remote node will be able to detect situations like the one I commented, and recreate the connection.\n\nI'm attaching a patch with my proposal.\n\n\nThanks for your time.\n\nRegards,\nAriel"}, {"count": 1, "tags": [], "bug_id": 50184, "attachment_id": null, "text": "Any news?", "id": 141363, "time": "2010-11-03T14:37:56Z", "creator": "arielandres@hotmail.com", "creation_time": "2010-11-03T14:37:56Z", "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 141576, "time": "2010-11-09T12:09:43Z", "bug_id": 50184, "creation_time": "2010-11-09T12:09:43Z", "is_private": false, "text": "Many thanks for your analysis and patch. I have applied a variation to 7.0.x and it will be included in 7.0.5 onwards."}, {"count": 3, "text": "Thank you for fixing this bug!", "bug_id": 50184, "is_private": false, "id": 141797, "time": "2010-11-18T09:24:37Z", "creator": "arielandres@hotmail.com", "creation_time": "2010-11-18T09:24:37Z", "tags": [], "attachment_id": null}]