[{"count": 0, "tags": [], "bug_id": 50182, "attachment_id": 26227, "text": "Created attachment 26227\nSource code and example web.xml\n\nYears ago I contributed an enhancement to convert the SSIServlet into a filter (java/org/apache/catalina/ssi/SSIFilter.java).  Now I'm back to offer up some enhancements to the CompressionFilter example (webapps/examples/WEB-INF/classes/compressionFilters).\n\nI've found (as have others) that the connector compression is flaky and unreliable, so I turned to the CompressionFilter example, but found it to be badly lacking in functionality.  No doubt owing to its status as an example project.  I've made a bunch of enhancements to it and I feel it's worth of being moved out of examples now.  You may even want to deprecate the connector compression in favor of this - or at least roll the two together.  In my own webapp (and the attached zip) I've renamed it to GZipFilter and it lives in my own internal package structure, but please move it back into an org.apache package structure and rename it as you see fit.\n\nThe enhancements I've made are:\n* It now supports specifying which mime types are compressible.\n* It now supports a variable sized buffer, which can be used to avoid chunking on small files.\n* The compression threshold and all other settings are configurable in web.xml.\n* Miscellaneous bug fixes.\n\nIf you adopt these enhancements, please credit David Becker with no email, same as on the SSIServlet.\n\nEnjoy!", "id": 141242, "time": "2010-10-29T15:45:38Z", "creator": "david@sogeeky.net", "creation_time": "2010-10-29T15:45:38Z", "is_private": false}, {"count": 1, "tags": [], "creator": "david@sogeeky.net", "is_private": false, "text": "For records on my previous SSIFilter see: https://issues.apache.org/bugzilla/show_bug.cgi?id=33106", "id": 141243, "time": "2010-10-29T15:47:26Z", "bug_id": 50182, "creation_time": "2010-10-29T15:47:26Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 50182, "is_private": false, "id": 159925, "time": "2012-06-12T19:07:59Z", "creator": "markt@apache.org", "creation_time": "2012-06-12T19:07:59Z", "tags": [], "text": "Patch applied (with minor alterations) to 7.0.x and will be included in 7.0.28 onwards."}]