[{"count": 0, "tags": [], "text": "If a servlet (probably incorrectly) closes the writer/outputstream of a response, and then attempts to read from the request, the AJP connector sends GET BODY CHUNK to the mod_jk worker.\n\nThis then starts a series of very confusing communication between the worker and tomcat.  The worker doesn't read it until it makes its next request.  After making its next request, it reads it, and then sends a response with 0 length.  At the same time, Tomcat responds to the request made by the worker with another GET BODY CHUNK, which the worker also responds with a message of 0 length.  Then the really weird thing happens, Tomcat replays the first request made by that worker.  At this point, based on what I'm looking at with tcpdump, I get too confused to work out exactly what is happening.", "is_private": false, "id": 141292, "creator": "jroper2@gmail.com", "time": "2010-10-31T23:27:02Z", "bug_id": 50189, "creation_time": "2010-10-31T23:27:02Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 50189, "text": "Thanks for the report. Which version of mod_jk and which config are you using?", "count": 1, "id": 141296, "time": "2010-11-01T07:42:48Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2010-11-01T07:42:48Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 50189, "attachment_id": null, "id": 141331, "time": "2010-11-01T20:18:23Z", "creator": "jroper2@gmail.com", "creation_time": "2010-11-01T20:18:23Z", "is_private": false, "text": "The version of mod_jk is 1.2.28 on CentOS 5.4.\n\nIf you are unable to reproduce this issue, let me know and I'll do more investigations to reproduce it on my side, I'll see if I can reproduce it on later versions of Tomcat and I'll attach tcpdump logs etc.  I haven't done that yet because the only logs and environment that I have handy are a production environment, and the logs contain sensitive information, but I'm hoping my description so far is adequate."}, {"count": 3, "tags": [], "bug_id": 50189, "attachment_id": null, "id": 141609, "time": "2010-11-10T14:22:58Z", "creator": "clint.morgan@tasktop.com", "creation_time": "2010-11-10T14:22:58Z", "is_private": false, "text": "I've also hit this issue in tomcat 6.0.26 and 7.0.4. This has been using an in-house version of the AJP client (webserver-side).\n\nOur symptoms were the same, and we had been working around by disabling connection sharing across requests.\n\nFollowing James' advice, I've removed the possibility for a servlet-side read from the request after the response has been closed. This has resolved the issue of us."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "Fixed in 7.0.x and will be included in 7.0.9.\n\nAn attempt to read from the request once the response has been will trigger an exception.\n\nI'll also propose back-ports for 6.0.x and 5.5.x", "id": 144410, "time": "2011-02-18T11:25:39Z", "bug_id": 50189, "creation_time": "2011-02-18T11:25:39Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "Fixed in 6.0.x and will be included in 6.0.33 onwards.", "is_private": false, "id": 144452, "creator": "markt@apache.org", "time": "2011-02-21T07:53:34Z", "bug_id": 50189, "creation_time": "2011-02-21T07:53:34Z", "attachment_id": null}, {"count": 6, "tags": [], "text": "This has been fixed in 5.5.x and will be included in 5.5.34 onwards.", "attachment_id": null, "id": 144986, "creator": "markt@apache.org", "time": "2011-03-14T07:43:44Z", "bug_id": 50189, "creation_time": "2011-03-14T07:43:44Z", "is_private": false}]