[{"count": 0, "tags": [], "creator": "1983-01-06@gmx.net", "attachment_id": null, "is_private": false, "id": 141336, "time": "2010-11-02T06:31:13Z", "bug_id": 50197, "creation_time": "2010-11-02T06:31:13Z", "text": "Tomcat comes with predefined shell scripts which work very well. A lot of people compile commons daemon but need to alter those scripts over and over again. Please provide those scripts in a jsvc-style way \"catalina.jsvc.sh\" by default. People would only need to compile the source and start using it. I personally refrained using JSVC because I did not want to alter and test the modified shell scripts.\n\nIt would really be a great benefit for all Tomcat users."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 141681, "time": "2010-11-12T13:57:38Z", "bug_id": 50197, "creation_time": "2010-11-12T13:57:38Z", "text": "It isn't at all clear what you are looking for here. An example for what catalina.jsvc.sh should look like or a diff against catalina.sh would help.\n\nI would also point out that jsvc is a product of Apache Commons Daemon and already includes scripts for running with Tomcat. If you are referring to these then you;'ll need to open a JIRA for the Commons Daemon project."}, {"id": 141692, "tags": [], "bug_id": 50197, "attachment_id": null, "count": 2, "text": "The purpose of my ticket is simply this:\nBy now you provide a plain shell script to start tomcat. Additionally, you bundle the sources of commons daemon with tomcat to compile and run it. There are no startup scripts which resemble those bundled with tomcat but configured to use JSVC. Those provided in the tarball are outdated. Since you bundle commons daemon with Tomcat you should provide startup scripts on par with those provide with \"plain\" Java.\n\nA simple approach for this script would be pass startup arguments to jsvc with PID and TOMCAT_USER and let it boot. The guys at ubuntu took such an approach.", "time": "2010-11-13T08:39:54Z", "creator": "1983-01-06@gmx.net", "creation_time": "2010-11-13T08:39:54Z", "is_private": false}, {"id": 141693, "tags": [], "bug_id": 50197, "attachment_id": null, "count": 3, "text": "The scripts in commons-daemon 1.0.4 have been updated. The next release of Tomcat should use daemon 1.0.4. If there are still changes you would like to see then the commons daemon project is the place to make them. The Tomcat project tracks commons daemon and pulls in new releases as they are made available.", "time": "2010-11-13T08:45:36Z", "creator": "markt@apache.org", "creation_time": "2010-11-13T08:45:36Z", "is_private": false}]