[{"count": 0, "tags": [], "bug_id": 50214, "attachment_id": null, "id": 141415, "time": "2010-11-04T13:06:11Z", "creator": "paulm@sitescout.com", "creation_time": "2010-11-04T13:06:11Z", "is_private": false, "text": "Hello,\n\nI'm dealing with a bug that I have seen on a few other posts but to date has no solution. \n\nBasically, connections come in to the nodes and periodically hang forever and cause the thread to spiral out of control. If left untouched they keep happening until I restart tomcat.\n\nLooks like this on tomcat manager:\n Stage\tTime\t        B Sent\tB Recv\n S\t11115068 ms\t0 KB\t        0 KB\t\n\nExact behavior is also described in this old thread:\n     - http://old.nabble.com/httpd-JK-Tomcat-hung-connections-td10403182.html\n             - Mind you we dont use JK -- just standalone tomcat on its own getting requests from a LB\n     - more recently: http://forums.terracotta.org/forums/posts/list/3264.page\n\nFirst off, let me explain my setup. We run a high performance ad network that processes & bids on real time bidding information. We run two clusters with two different ISPs: one on the west coast and one on the east coast. (East coast one is amazon).\n\nI originally thought this was a bug caused by virtualization since I would only see this issue on nodes running on the west coast. At the time the east coast and the west coast shared the exact same setup (same software) but different os images., We use CentOS on the west and the Amazon Flavor linux distro on east - both 32bit.\n\nAfter fighting for weeks with my west coast provider I finally realized it wasn't them. The tell tale was the fact that I started seeing this issue on west coast (yesterday) when i launched 64bit instance(only with 64bit does it occur on east coast now).\n\nAlso, to note we were originally running with 6.0.24 and then recently upgraded all to 6.0.29 and still occurring. I tried yesterday running the 64bit instance with the APR JNI libs and also still occurs.\n\nWe don't use sessions, and there are no errors on any nodes when this happens. They just block and spiral forever. Luckily this doesn't really affect the cluster. The node is still able to function normally, however eating all the CPU.\n\nOn the west coast where this has happened for months now (since launching) we are running 32bit CentOS and I have tried everything including upgrading the kernel to latest. Up until yesterday I had never seen this issue on the east coast where it shares _identical_ setup (binaries/java/configuration/db) until we attempted to run a 64bit node where it was immediately noticed.\n\nCan anyone point me in the right direction ? It's definitely occurring on the latest version of tomcat 6.\n\nThanks,\n-Paul"}, {"count": 1, "tags": [], "text": "Without a thread dump that shows the thread is stuck in Tomcat code, this looks like an application issue. The issue from the terracotta forums is definitely an app or terracotta issue, not a Tomcat one.\n\nThe users mailing list is the place to get help.", "attachment_id": null, "id": 141416, "creator": "markt@apache.org", "time": "2010-11-04T13:10:42Z", "bug_id": 50214, "creation_time": "2010-11-04T13:10:42Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 50214, "is_private": false, "id": 141419, "time": "2010-11-04T13:28:15Z", "creator": "paulm@sitescout.com", "creation_time": "2010-11-04T13:28:15Z", "tags": [], "text": "I will provide you with a thread dump on the next occurrence.\n\nHow could it be application level when the hanging thread is unable to even process the underlying request? \n\nPlease note that these hanging threads are hanging on normal HTTP connector threads (using keepalive mind you) and not using any external connector.\n\nWith that said, I am without doubt that this is not an application level issue. Nothing external should cause tomcat to hang like this. Which is why I thought it was a virtualization issue (which I have now ruled out).\n\nCan this be reopened please? Would really like to resolv this."}, {"text": "(In reply to comment #2)\n> I will provide you with a thread dump on the next occurrence.\n> Can this be reopened please? Would really like to resolv this.\n\nBugzilla is *not* a support forum.  Use the Tomcat support mailing list.\n\n - Chuck", "tags": [], "creator": "chuck.caldarale@unisys.com", "attachment_id": null, "count": 3, "id": 141421, "time": "2010-11-04T13:36:18Z", "bug_id": 50214, "creation_time": "2010-11-04T13:36:18Z", "is_private": false}]