[{"count": 0, "tags": [], "text": "If multiple processes or threads are writing to unique files in the same folder on a webdav server using LOCKS, intermittent webdav errors will occur during the UNLOCK request.\n\nServer configuration: Centos 5.5. Tested with Apache/2.2.3, Apache/2.2.17 and Apache/2.3.8.\n\nI have a custom application that uses libcurl to upload files to a webdav server. However, I have reproduced the same problem using cadaver, a simple script and a locally hosted Apache webdav server.\n\nThe error occurs during an UNLOCK. A 400 (bad request) is returned. Once this failure occurs, the file remains locked. I used several methods over several days to ensure the LOCK/PUT/UNLOCK sequences being issued are valid and contain the correct lock token (wireshark, added custom logging to dav, etc.).\n\nI used a patched version of cadaver that adds scripting ability so I could automate the test.\n\nHere is what the test does:\n\nOne shell script is repeatedly running this:\n\n1. LOCK webdav/test/a.bin 2. PUT a.bin webdav/test/a.bin 3. UNLOCK webdav/test/a.bin\n\nAt the same time, a second shell script is repeatedly running this (same webdav folder, but accessing a different file):\n\n1. LOCK webdav/test/b.bin 2. PUT b.bin webdav/test/b.bin 3. UNLOCK webdav/test/b.bin\n\nThe test repeats anywhere from a few times to several hundred times before the failure occurs. Below is the output from cadaver at the failure point:\n\nLocking `webdav/test/a.bin': succeeded. Lock token <opaquelocktoken:7ca6e55d-1bf6-4ce0-a8a4-7d97117db8af>: Depth infinity on `http://localhost:81/webdav/test/a.bin' Scope: exclusive Type: write Timeout: infinite Owner: Uploading a.bin to `/webdav/test/a.bin': [.......... succeeded. Unlocking `webdav/test/a.bin': failed: 400 Bad Request\n\nAt the failure point, this message is in the Apache error_log:\n\n(11)Resource temporarily unavailable: The locktoken specified in the \"Lock-Token:\" header is invalid because this resource has no outstanding locks. [400, #0]\n\nI tried adding additional debug messages to dav, but have not been able to track down why the lock is not valid. I also tried to make a debug build of Apache so I could use gdb to help debug at least one of the scripts to better understand the flow of the lock data, but was unable to get debug symbols in the binary (I used the --enable-maintainer-mode configure option).", "is_private": false, "id": 141552, "creator": "mikeh@elementaltechnologies.com", "time": "2010-11-08T13:33:15Z", "bug_id": 50237, "creation_time": "2010-11-08T13:33:15Z", "attachment_id": null}, {"count": 1, "text": "I could not reproduce this (neither with 2.2.16 nor with trunk).\n\nI suspect that there may be a lock contention when accessing the dbm file that stores the locks. Which dbm library are you using? (Try 'ldd /usr/lib/apr-util-1/apr_dbm_db.so' or 'ldd /usr/lib/libaprutil-1.so' depending on how you compiled it). I have Berkley DB 4.8.\n\nTo get more info, you could also try strace-ing httpd and see which system call returns 'Resource temporarily unavailable' (EAGAIN). If it is something related to your dav lockdb, that would give a hint. But it's also possible that it is not related to DAV at all but a bug in the logging code.", "bug_id": 50237, "is_private": false, "id": 141612, "time": "2010-11-10T15:53:21Z", "creator": "sf@sfritsch.de", "creation_time": "2010-11-10T15:53:21Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 50237, "text": ">To get more info, you could also try strace-ing httpd and see which system \n>call returns 'Resource temporarily unavailable' (EAGAIN).\n\nMike, when you tested at trunk did you see 'Resource temporarily available' logged?\n\nPossibly the logging of EAGAIN is because the dav error APIs prior to httpd 2.3.4 did not take an apr_status_t parameter, and assumed errno was meaningful for the problem at hand (and that's a common error for network I/O).", "id": 141613, "time": "2010-11-10T16:02:35Z", "creator": "trawick@apache.org", "creation_time": "2010-11-10T16:02:35Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 50237, "attachment_id": null, "is_private": false, "id": 141810, "time": "2010-11-18T18:16:47Z", "creator": "mikeh@elementaltechnologies.com", "creation_time": "2010-11-18T18:16:47Z", "text": "I lost my PC that I was using the debug the issue. I will have to setup everything up on another system. I will update the bug after completed."}]