[{"count": 0, "text": "Currently the operations that can be performed on webapps are from the manager app are triggered by links that generate GET requests. These actions include: Start, Stop, Reload, Undeploy. These actions have side-effects and should not be triggered by GET requests, but by POSTs. The effect on the end-user of the manager app is that reloading the page after performing one of these actions causes it to be performed again without warning. \n\nSuggested fix: change the links to forms with method=\"post\", redirect the user back to the list after posting.", "creator": "ramon@echophase.com", "attachment_id": null, "id": 141533, "time": "2010-11-08T04:17:33Z", "bug_id": 50231, "creation_time": "2010-11-08T04:17:33Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 50231, "attachment_id": null, "is_private": false, "id": 141534, "time": "2010-11-08T04:42:37Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2010-11-08T04:42:37Z", "text": "For the mod_jk status worker we use GET but respond with an answer page that only acknowledges and is after a few seconds redirected to the page used before the operation was requested.\n\nThat way operations are still easy to automate (many tools are better or at least easier to use with POST) but there is no problem with reloads."}, {"count": 2, "tags": [], "bug_id": 50231, "is_private": false, "id": 141540, "attachment_id": null, "creator": "ramon@echophase.com", "creation_time": "2010-11-08T06:40:02Z", "time": "2010-11-08T06:40:02Z", "text": "I'm not sure what you're suggesting Rainer? My issue relates to the tomcat manager HTML page specifically. In my opinion the right thing to do is to use POST. I do not see the need for complex logic just so that we can still use GET. To my mind, the use of GET in this context is just plain wrong to begin with, see http://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html#sec9.1.1.\n\nRegarding tooling, I'm not suggesting a change to the tooling interface. If it currently supports GET, it should probably continue to do so for backwards compatibility. It should also support POST as the \"proper\" way of doing things. I think all HTTP clients support POST easily - wget, curl, lwp - what are you using?\n\nAnother problem that could arise from these side-effecting GET requests is CSRF - not sure how that could be dealt with while preserving tool compatibility."}, {"count": 3, "text": "The comment re CSRF is pure FUD:\na) POSTs make it marginally harder to commit a CSRF attack but by no means prevent it.\nb) The generic CSRF protection from Tomcat 7 has been back-ported to 6.0.x and will be included for the Manager and Host Manager in 6.0.30 onwards.\n\nI'd lean towards not fixing this in 6.0.x but if someone wants to back-port the changes from 7.0.x I'd probably vote for it.", "bug_id": 50231, "is_private": false, "id": 141546, "time": "2010-11-08T09:42:05Z", "creator": "markt@apache.org", "creation_time": "2010-11-08T09:42:05Z", "tags": [], "attachment_id": null}, {"count": 4, "tags": [], "creator": "ramon@echophase.com", "attachment_id": null, "id": 141548, "creation_time": "2010-11-08T10:33:21Z", "time": "2010-11-08T10:33:21Z", "bug_id": 50231, "text": "I'm sorry if I offended you. I admit don't know enough about how browsers handle HTTP authentication credential to properly assess the CSRF threat. I did not mean to sensationalize the issue. Glad to see that it is addressed in the next version anyway though.\n\nMy real issue is with the HTML manager interface and usability. It is a really bad experience to accidentally undeploy an application just by refreshing the page without any warning. Will this be addressed in Tomcat 7 too?", "is_private": false}, {"count": 5, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 141549, "time": "2010-11-08T10:41:18Z", "bug_id": 50231, "creation_time": "2010-11-08T10:41:18Z", "is_private": false, "text": "Tomcat 7 has switched to POST for all requests where you'd expect POST to be used. A refresh can still cause problems but at least the user will be prompted by the browser first.\n\nIf someone is so inclined to propose a patch for 6.0.x, the 7.0.x patches would be a good starting point and shouldn't be that hard to find in the archives. http://svn.apache.org/viewvc/tomcat/trunk/java/org/apache/catalina/manager/HTMLManagerServlet.java?view=log would be a good place to start."}, {"count": 6, "tags": [], "bug_id": 50231, "is_private": false, "id": 141553, "attachment_id": null, "creator": "ramon@echophase.com", "creation_time": "2010-11-08T13:55:12Z", "time": "2010-11-08T13:55:12Z", "text": "\n\n*** This bug has been marked as a duplicate of bug 40001 ***"}]