[{"count": 0, "tags": [], "bug_id": 50260, "attachment_id": null, "id": 141658, "time": "2010-11-12T08:14:38Z", "creator": "matpen@dnet.it", "creation_time": "2010-11-12T08:14:38Z", "is_private": false, "text": "Description of the issue\n------------------------\n1) Website proj initially served by apache correctly\n2) While trying to setup a simple ftp+www system, set the permission of all the files in folder /home/www/proj to 770 ftpuser:ftpgroup. Added apache to ftpgroup. Thereafter getting 403 forbidden error.\n\nSteps to reproduce\n-------------------\n1) Set up a normal virtual host for apache. It can also be the default one (\"It works\")\n2) Change owner & group for the file index.htm (for example ftpuser:ftpgroup)\n3) Add the user www-data to ftpgroup and set permissions accordingly (group must have at least read permission on the file, and read+exec on the folder). I set 770, for different reasons and testing.\n4) Add one user (NOT www-data) to ftpgroup. I added user \"matteo\" with \"sudo adduser matteo ftpgroup, but this can be done by editing /etc/groups manually.\n5) NOW, add www-data to ftpgroup. Since the user www-data is now in the group \"ftpgroup\", it can access the files. This can be tested by switching to user www-data and manually access the directories and files via console.\n6) HOWEVER, when connecting via browser to the site, a 403 forbidden error is issued.\n\nWorkaround\n-----------------\n1) After many experiments I found out that, if www-data is the only member of ftpgroup, everything works fine.\n2) By manually editing the /etc/group file, and adding a user BEFORE www-data, and separate the usernames with commas, the error is returned.\n3) By manually editing the /etc/group file, and adding a user BEFORE www-data, and separate the usernames with SPACES, everything works fine.\n\nPossible solution\n------------------\n1) Probably, only the algorithm for parsing the list of group's users has to be refined to take comma-separated lists into account.\n\nComments\n--------\nThank you in advance for taking care of the bug.\n\n\nSystem infos:\n-------------\nLinux 2.6.31-22-generic-pae\nUbuntu 9.10 Karmic Server edition\nApache/2.2.12 (Ubuntu)"}, {"count": 1, "tags": [], "bug_id": 50260, "text": "Apache doesn't parse these files.\n\nThis bugzilla is for reporting suspected bugs in Apache HTTP Server, not a support forum for questions, configuration assistance, support, or systems analysis.\n  \nPerhaps someone on the Apache HTTP Server users list can help you determine what's going on with your system, and if this due diligence points to an Apache HTTP Server bug, reopen this ticket with a rigorous description that illustrates (via verbatim error messages, configurations, logs, packet captures, etc) the misbehavior in Apache HTTP Server. \n \nhttp://httpd.apache.org/userslist.html", "id": 141659, "time": "2010-11-12T08:23:58Z", "creator": "covener@gmail.com", "creation_time": "2010-11-12T08:23:58Z", "is_private": false, "attachment_id": null}]