[{"count": 0, "tags": [], "bug_id": 50271, "attachment_id": null, "text": "I'm trying to format a cell to date on a German machine.\nWhat I expected is that the cell is formatted with format string \"d.M.yy\", but what I got is that the cell is formatted with format string \"M/d/yy\".\n\nAs a example, for the cell A3 in the attachment, what I expected is \"22.11.2010\", what I got is \"11/22/2010\".", "id": 141716, "time": "2010-11-15T02:13:00Z", "creator": "zjuwufan@gmail.com", "creation_time": "2010-11-15T02:13:00Z", "is_private": false}, {"attachment_id": 26297, "tags": [], "bug_id": 50271, "text": "Created attachment 26297\nExcel file to reproduce this issue.", "count": 1, "id": 141717, "time": "2010-11-15T02:15:38Z", "creator": "zjuwufan@gmail.com", "creation_time": "2010-11-15T02:15:38Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 50271, "attachment_id": 26298, "text": "Created attachment 26298\nPatch to fix this issue\n\nI found that when the format index of one cell is equal to 14, there is no formatCode associated with it. So it will used 'M/d/yy' as a default one. Instead we should take the current locale into account.\n\nI provided this patch. The fix is not elegant. I hope it could help somehow anyway :-).", "id": 141719, "time": "2010-11-15T05:05:18Z", "creator": "zjuwufan@gmail.com", "creation_time": "2010-11-15T05:05:18Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 50271, "attachment_id": null, "text": "If you want a date format that's always going to look the same no matter where you open it, then you need to set an explicit date format on that cell. Otherwise, it'll open in the default date format for the copy of excel.\n\nIf you always want d.m.yy, then explicitly set that as your cell format!\n\nIf someone was willing to figure out for each locale what excel uses as it's default format rules, we could possibly put in optional logic to use that, but that would need quite a bit of work that no-one has so far volunteered to do.", "id": 141721, "time": "2010-11-15T06:34:02Z", "creator": "apache@gagravarr.org", "creation_time": "2010-11-15T06:34:02Z", "is_private": false}, {"count": 4, "tags": [], "creator": "zjuwufan@gmail.com", "text": "(In reply to comment #3)\n> If you want a date format that's always going to look the same no matter where\n> you open it, then you need to set an explicit date format on that cell.\n> Otherwise, it'll open in the default date format for the copy of excel.\n> \n> If you always want d.m.yy, then explicitly set that as your cell format!\n> \n> If someone was willing to figure out for each locale what excel uses as it's\n> default format rules, we could possibly put in optional logic to use that, but\n> that would need quite a bit of work that no-one has so far volunteered to do.\n\n\nOn MS excel, if no format explictly provided then it will use default format rules. I think this feature is useful for those softwares support multilple locales. And actually to get the default format is not complicated. We only need one line of code to do this.\n\njava.text.DateFormat.getDateInstance(\n                         java.text.DateFormat.SHORT, aLocale);\n\n\nThank you for your patience.", "id": 141722, "time": "2010-11-15T07:11:47Z", "bug_id": 50271, "creation_time": "2010-11-15T07:11:47Z", "is_private": false, "attachment_id": null}]