[{"count": 0, "tags": [], "bug_id": 50289, "text": "Overview:\n\nThe XSLT task <http://ant.apache.org/manual/Tasks/style.html> has an optional \"classpath\" attribute for specifying the \"the classpath to use when looking up the XSLT processor\".\n\nThis is not happening and any XSLT processor is referenced by the classpath attribute is not getting used.\n\n\nSTEPS TO REPRODUCE\n\nDetailed steps were written in: https://issues.apache.org/bugzilla/show_bug.cgi?id=41314 (along with sample files).  Essentially, trying to reference an XSLT 2.0 processor (namely SAXON) in the classpath attribute.\n\nActual results: the task uses the default Java XSLT processor (which is an XSLT 1.0 processor).\n\nExpected results: the task uses the XSLT 2.0 processor found inside the JAR file that is in the classpath attribute.\n\n\nBUILD\n\nThis bug (re)appears in Ant 1.8.1.\n\nThis bug is not present in Ant 1.8.0, 1.7.1 and 1.7.0. (Though it runs about 5 times slower on release 1.8.0 than the others.)\n\nHave reproduced this bug in release 1.8.1, and the success of the other releases, on Microsoft Windows XP and Mac OS 10.6.4.\n\n\nADDITIONAL INFORMATION\n\nIf there is an explicit XSLT factory class specified then the classpath attribute is always not used, even though it is expected that it would be used.\n\nThat is, this will work\n\n<xslt ... classpath=\"/Users/.../saxon9.jar\">\n</xslt>\n\nbut this will not work:\n\n<xslt ... classpath=\"/Users/.../saxon9.jar\">\n  <factory name=\"net.sf.saxon.TransformerFactoryImpl\"/>\n</xslt>\n\neven though the first example should be implicitly picking the class which was explicitly specified in the second example.\n\nThis problem with an explicit factory occurs with release 1.8.1 as well as in 1.8.0, 1.7.1 and 1.7.0.  So it seems the code for using the classpath attribute is conditional on whether a factory element exists or not.", "id": 141783, "attachment_id": null, "creator": "hoylen@hoylen.com", "creation_time": "2010-11-17T21:58:03Z", "time": "2010-11-17T21:58:03Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50289, "attachment_id": null, "text": "Check in 1.8.2 dev builds.\n\n*** This bug has been marked as a duplicate of bug 49271 ***", "id": 141799, "time": "2010-11-18T10:03:36Z", "creator": "jglick@apache.org", "creation_time": "2010-11-18T10:03:36Z", "is_private": false}]