[{"count": 0, "tags": [], "creator": "jordi.benaiges@imagsa.com", "attachment_id": 26307, "text": "Created attachment 26307\nthe 1 thread process\n\nHi,\n\nI'm trying to install an apache 2.2.17 in a Windows XP __Embedded__, SP3. (not appearing in the OS combo box, although it should be the same as XP SP3 without some components)\n\nWhen httpd.exe is run, the program crashes some seconds later. \n\n\nI've tried to follow the instructions at http://httpd.apache.org/dev/debugging.html but there are some differences between the description and my system (I suppose it's because it crashes just at the start)\n\n\"The parent process has about three threads, we don't care about that one. The child worker process we want has many more threads\"\n\nIn my embedded computer, I have 1 httpd.exe process with 4 threads, and another httpd.exe process with only 1 thread.\n\n\nThe process with only 1 thread minidump is attached as \"1thread.zip\"\n\nThe process with 4 threads gives me an error while drwatson-dumping: \"The requested operation failed\", however it generates another dump attached as \"4thread.zip\"\n\nI'm also including the default windows dump just in case it's useful.\n\n\nIf anything more is needed, don't hesitate to contact me\n\nThanks,\nJordi\n\np.s. The same problem appears with 2.0.x latest version.", "id": 141788, "time": "2010-11-18T04:47:23Z", "bug_id": 50290, "creation_time": "2010-11-18T04:47:23Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50290, "attachment_id": null, "id": 141899, "time": "2010-11-22T03:36:17Z", "creator": "jordi.benaiges@imagsa.com", "creation_time": "2010-11-22T03:36:17Z", "is_private": false, "text": "I think I messed with important. As it's a crash it should be 'critical', however I don't know how to change it."}, {"count": 2, "tags": [], "bug_id": 50290, "attachment_id": null, "id": 142151, "time": "2010-11-29T18:10:46Z", "creator": "wrowe@apache.org", "creation_time": "2010-11-29T18:10:46Z", "is_private": false, "text": "Don't take the debugging.html instructions so literally.  Set up Dr. Watson to write the dump and drwatson log file to disk.  Track down those files after the crash-at-startup.  Share the drwatson log file with us.\n\nEmbedded hasn't been tested AFAIK, which may mean it is too hobbled to work.  OTOH, never heard of anyone having problems, either, so it's quite possible that others have gotten this to work.  In any case, without more details to go on, this case is not critical.  Voting has no effect in this tracker, as this is not a democracy, but a do-ocracy"}]