[{"count": 0, "tags": [], "creator": "plynch@apache.org", "is_private": false, "id": 141954, "attachment_id": null, "bug_id": 50324, "creation_time": "2010-11-23T23:20:42Z", "time": "2010-11-23T23:20:42Z", "text": "I notice that JMeter does not use Maven to build. It also does not publish artifacts to Maven central either ( see 49753 ).\n\nI am opening this issue more or less to query folks to see if converting the JMeter build process to a Maven project structure and build is something that would be acceptable. If the core developers would find this a useful enhancement, I would consider spending effort in my free time in helping to convert the project.\n\nI am not going to argue all the benefits this could have. If there is significant resistance to this idea then fine. However I would like to suggest a few advantages to this:\n\n1. better IDE integration ( via m2eclipse for example ). Load and go. The current build is definitely not load and go in all IDEs, making development and submitting patches cumbersome.\n\n2. Attracting more interest in the project, and consequently more patches, as the artifacts would easily be published in Maven central.\n\n3. Enhance JMeter artifact usage in external plugins for Hudson,Maven, as already stated in issue 49753.\n\nI propose the conversion could be done with a script that could be applied at a convenient time in the JMeter development cycle.\n\nSo are the core JMeter developers for or against this idea?\n\n---\nDisclaimer: I work at Sonatype and use JMeter in my day job. Sonatype is NOT sponsoring me to work on this idea of project conversion though."}, {"count": 1, "attachment_id": null, "creator": "sebb@apache.org", "is_private": false, "id": 141957, "time": "2010-11-24T05:56:38Z", "bug_id": 50324, "creation_time": "2010-11-24T05:56:38Z", "tags": [], "text": "This ought to be discussed on the developer list first.\n\nBugzilla is not suitable as a forum for discussions, though it would be useful to record any decisions here once they have been reached."}, {"count": 2, "tags": [], "creator": "woolfel@yahoo.com", "is_private": false, "id": 142019, "attachment_id": null, "bug_id": 50324, "creation_time": "2010-11-25T14:40:10Z", "time": "2010-11-25T14:40:10Z", "text": "I vote -1\n\nHaving been responsible for maintaining maven in the past for a commercial project. Maven is a huge overhead and isn't worth the hassle. The whole idea of having to change the structure of the project to fit maven is stupid. Jmeter's structure is perfectly fine as it is and doesn't need to change."}, {"count": 3, "tags": [], "bug_id": 50324, "text": "I apologize for opening the issue here first before discussing on dev list.\n\nThe relevant dev list thread discussing this is here\n\nhttp://mail-archives.apache.org/mod_mbox/jakarta-dev/201011.mbox/%3CAANLkTi=kt8MWjLy=Lr-4L4mQ_iiiH_ihjSVYM=kmJEHg@mail.gmail.com%3E", "id": 142027, "time": "2010-11-25T21:35:46Z", "creator": "plynch@apache.org", "creation_time": "2010-11-25T21:35:46Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 50324, "is_private": false, "text": "Closing as discussion led to a NO.", "id": 151962, "time": "2011-12-04T12:31:35Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-12-04T12:31:35Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "[Recording some extra info for completeness]\n\nAny Maven implementation would need to allow for the following:\n\n1) Documentation is in XML, which is processed using Velocity to create the website. A separate build using different template/macros is used to generate the help files included in the binary archive. Two of those files (functions.html and component_reference.html) are used to provide help within the application itself; this requires correlation of text anchors in the HTML with the test element names.\n\n2) JMeter assumes that all jars are in lib/ and user.classpath or lib/ext  and search_paths. The former is used for support classes only; the latter is used for JMeter plugins.\n\n3) The release build updates the version displayed by the application to include the SVN revision.\n\n4) Some of the test classes require a lot of setup to ensure that the classpath is correct. This is normally done by the class org.apache.jorphan.test.AllTests which finds and runs all the tests. Some tests can be run stand-alone, but many cannot at present.\n\n5) The tar.gz and zip archives use EOL=LF and EOL=CRLF for eol=native files. Some source files need to be LF and some need to be CRLF regardless of archive type.\n\n6) The binary release contains all the dependencies, and so requires different NOTICE and LICENSE files from the source release.\n\n7) The tests need to be runnable with headless=true for Gump and Jenkins and other CI systems\n\n8) As well as the unit tests, there are several script tests. One script is run both stand-alone (non-GUI) and in client-server mode, which requires starting an instance of JMeter server in parallel. Other scripts are run as necessary to test bug fixes that cannot easily be unit-tested.", "is_private": false, "bug_id": 50324, "id": 152863, "time": "2012-01-17T23:51:07Z", "creator": "sebb@apache.org", "creation_time": "2012-01-17T23:51:07Z", "attachment_id": null}]