[{"count": 0, "tags": [], "text": "I have Ubuntu 10.04 and Apache 2.2.14-5 and Java.\n\nI installed PHP5. They worked together, instantly.\n\nI installed TomCat6 and spent a week trying to get two packages from the same organization to talk to each other. This is damned irritating.\n\nIt has taken me a week to see a web page when I point my browser at\n   \"http://localhost:8080/War/Sandy4\"\nI expect it till take me another week to get rid of the \":8080\". This is stupid.\n\nThe standard install script for Tomcat should detect Apache2 and do whatever is necessary to get the two talking to each other.\n\nI invented jx.php to run Java programs that generate web pages without Tomcat. jx.php requires no Tomcat, only Java. A jx.php site can do everything in HTML but must drop into PHP to emit HTTP headers.\n\nIf I create an application for a customer, should plan on a week installing Tomcat on his server? Or should I just just use jx.php instead? That is my concern right now.\n\nTomcat is so difficult to install that it may be worse than nothing.", "is_private": false, "bug_id": 50346, "id": 142045, "time": "2010-11-26T23:57:16Z", "creator": "andycanfield@yahoo.com", "creation_time": "2010-11-26T23:57:16Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "The ASF doesn't provide the packages used by Ubuntu (or any other Linux distribution for that matter). The ASF has no control over how the packages are installed, which httpd modules are included and how Tomcat and httpd are configured. Each linux distribution does its own packaging so if you want to see improvements to the packaging on Unbuntu you need to address your concerns to the Unbuntu team.\n\nIf it has taken you a week to get http://localhost:8080/War/Sandy4 (which appears to be going direct to Tomcat and not using httpd at all) that suggests that something is badly wrong with the Ubuntu packaging, the WAR you were trying to deploy was broken, that you need help understanding Tomcat or any combination of the above. It should take about 30s to get a WAR running with Tomcat. If you need help with Tomcat, the users mailing list is the place to get it. (Note bugs that look like support requests will just get closed as invalid). You should also be aware that the first suggestion from the users list is likely to be to throw away whatever Tomcat install was provided by Unbuntu and start again with the tar.gz distribution from the ASF.\n\nRegaarding removing the :8080, there are a number of options including not using httpd at all. If you do use httpd, there is a little configuration involved (and you might needs an extra httpd module or two) but it certaily should not be a difficult thing to do. The best approach from the range if options available will depend on your circumstances. Again the users mailing list is the place to get help.", "id": 142047, "time": "2010-11-27T02:43:14Z", "bug_id": 50346, "creation_time": "2010-11-27T02:43:14Z", "is_private": false, "attachment_id": null}]