[{"count": 0, "tags": [], "text": "http://httpd.apache.org/docs/2.2/dns-caveats.html any many other places warn from using hostnames instead of IP addresses in several directives.\n\nIt should be added that this is:\na) ...only partially true, when usgin \"foreign\" nameserver but having DNSSEC deployed and used on all relevant zones\n=> Then it's at least not possible to trick the server to use \"wrong\" addresses, but DoS attacks might still be possible\nb) ...totally safe to use hostnames, when using one's own nameservers, if\n- connection to is secure (e.g. on the same host, TSIG, DNSSEC, IPsec secure connection, etc.)\n- they're authoritative for the respective zones\nc) ...totally safe, when the respective host/domainnames are specified in /etc/hosts, and that one is used rather than DNS (=> /etc/nsswitch.conf).\n\n\nI guess it makes sense to note this, as right now, security conscious people don't use hostnames (because of the warnings) but might find hostnames much easier in order to make changing IP addresses less elaborate.\n\ne.g. I specify things like:\n1.2.3.4 eth0.localhost\nin my /etc/hosts and have with that a central point to change my static IPs (for all services using hostnames).", "is_private": false, "bug_id": 50359, "id": 142095, "time": "2010-11-28T19:21:14Z", "creator": "calestyo@scientia.net", "creation_time": "2010-11-28T19:21:14Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "id": 142958, "time": "2010-12-27T16:25:51Z", "bug_id": 50359, "creation_time": "2010-12-27T16:25:51Z", "is_private": false, "text": "I disagree with this bug report. It is not the job of the documentation to teach the reader how to exploit the server. Nor is it the job of the docs to list all possible permutations in which the recommended BEST PRACTICE is not 100% necessary. It is, instead, our job to promote best practice configurations that are the right thing to do in most cases.\n\nBy the argument here, we should also list all the scenarios in which it's probably-mostly-ok to use hostnames in <VirtualHost> declarations too. But, in fact, we don't ever want to encourage that, because it's not the right thing to do in most cases, and it increases the support burden when everyone feels that there's no recommended best practice.\n\nThose who know, and understand, the rules, should probably feel comfortable breaking them. We're not comfortable encouraging the other 98% to ignore the rules."}]