[{"count": 0, "attachment_id": null, "bug_id": 50380, "text": "I use Ant to customize a vanilla Tomcat distribution to our needs. During this process Ant downloads files from our local Nexus (only Nexus has outbound connection). At ths moment I have to download Tomcat manually, place on the target server and run the Ant script.\nIt'd be much better if all of these files http://tomcat.apache.org/download-60.cgi would be available with appropriate classifiers in Maven Central. I could Ant download Tomcat and customize it. It would the useless manual step.\n\nThe Maven goes do provide both distros in Central. Their classifier/release scheme could be taken as an example. More over, this could be automated in the build.xml file to upload artifacts to Apache's Nexus repo which is automatically synched to Maven Central. \n\nLook here for the example: https://repository.apache.org/index.html#nexus-search;gav~org.apache.maven~apache-maven~3.0.1~~\nEverything is provided, bin and src as zip and tar.gz.", "id": 142183, "time": "2010-11-30T06:15:44Z", "creator": "1983-01-06@gmx.net", "creation_time": "2010-11-30T06:15:44Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "The primary distribution channel for the Apache Tomcat project is the Apache Mirror system, not Maven.\n\nThe Tomcat JAR files are made available via Maven.\n - Tomcat 6 includes binary JARs\n - Tomcat 7 includes binary and source JARs\n\nThere is currently relatively little interest within the Tomcat developer community in Maven so the chances of this happening without a patch being provided are very low. Even with a patch, there is no guarantee. A working patch for 7.0.x that applies cleanly stands the best chance.\n\nIf producing a patch I'd suggest a group ID of \"org.apache.tomcat\" and an artifact ID of \"tomact\"", "is_private": false, "id": 144989, "creator": "markt@apache.org", "time": "2011-03-14T08:18:26Z", "bug_id": 50380, "creation_time": "2011-03-14T08:18:26Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 50380, "text": "(In reply to comment #1)\n> artifact ID of \"tomact\"\n\nThat was meant to be \"tomcat\", obviously.", "id": 144993, "time": "2011-03-14T09:47:44Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-03-14T09:47:44Z", "tags": [], "is_private": false}]