[{"count": 0, "tags": [], "bug_id": 504, "text": "I found a strange behavior of session handling of tomcat 3.2.1 .\n\nThe application:\n\nWe have an application with authentication done by servlets. If a\nuser requests a service of the application which detects he or she \nis not yet logged in, the request is forwarded to the login servlet\nwhich presents the login page. The user submits this screen and given\nuserid and password are correct, this request is forwarded to the\nservlet the user originally requested. \n\nThe problem appears in this situation:\n\nA new user requests some service and gets the login screen. This is already\ndone within a HttpSession (number 4711). The user goes away and after a \nwhile this sessions times out. \n\nThe user comes back to the browser and submits the login request. The\nbrowser sends a cookie with sessionId 4711 to tomcat.\n\nThe login servlet requests the HttpSession object from tomcat to find\nout if the user is logged in. Tomcat correctly creates a new HttpSession (4712).\nThe login servlet finds that the user has not yet logged in during this new\nsession and verifies userid and password. Given that this is successful, the\nlogin\nservlet forwards the request to the servlet the user originally requested.\n\nwhile (no stack overflow) {\n\tDuring this forward, requestMap() of        \norg.apache.tomcat.session.StandardSessionInterceptor\n\tis called (maybe this is an error). This method assumes, that any valid session\nis fromUrl\n\tand will always reset it if there is a cookie presented by the browser. In our\nexample\n\tthe valid session 4712 is replaced with the invalid sessionId 4711. In\nconsequence a\n\tnew session 4713 is created. \n\n\tSo the requested servlet will not find a valid \"logged in\" status in session\n4713 and\n\tforwards the request to the login servlet which, as the user already supplied\nuserid and\n\tpassword in the request, does the login. Again the request is forwarded to the\n\trequested servlet. \n}", "id": 467, "time": "2001-01-31T11:59:04Z", "creator": "joerg.ahrens@braincapital.de", "creation_time": "2001-01-31T11:59:04Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "kief@bitBull.com", "attachment_id": null, "text": "This was due to a problem in StandardSessionInterceptor.\nThe code was resetting the session to null in a circumstance\nthat only happened during forwarding, and then only when the \nrequest included an invalid session ID, as when the previous\nsession had expired. This has been fixed for 3.2.2.", "id": 658, "time": "2001-02-13T01:13:14Z", "bug_id": 504, "creation_time": "2001-02-13T01:13:14Z", "is_private": false}]