[{"count": 0, "tags": [], "bug_id": 50441, "text": "When I set docBase in context tag to relative path it is not possible to have more then one Context with same docBase. For example\n\nWe have two XML files for our application in folder Catalina/localhost.\niis.xml and iisstampa.xml. Both of them have the same docBase=\"iis\".\nappBase is set to webbaps in Host tag in server.xml.\n\niis.xml is loaded corectly, but iisstampa.xml is not. This is because inside of method org.apache.catalina.startup.HostConfig.deployDescriptor there is part that recognizes that {tomcat_home}/webapps/iis folder is inside of appBase an docBase attribute is ignored by calling context.setDocBase(null). This causes Tomcat looks for folder iisstampa inside of appbase which of course does not exist.\n\nIf we put this context and docBase outside appBase everything works corectly.\n\nBut described situation is in conflict with documentation because it is not possible to have multiple instances of same docBase if the docBase is inside appBase.\n\nThis behavour is introduced in revision SVN 303926 of Tomcat 5.5 by remm (Remy Maucherat) as a solution of bug 34840 to recognize if the context path is external.\n\nThis bug exists on Tomcat 7 also.\n\nWe experinced this bug during migration from tomcat 5.5.4 to Tomcat 6 so this is reason reporting in Tomcat 6 section.", "id": 142508, "time": "2010-12-09T05:18:13Z", "creator": "ognjen.milic@asw.eu", "creation_time": "2010-12-09T05:18:13Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 50441, "attachment_id": null, "id": 142510, "time": "2010-12-09T05:25:53Z", "creator": "markt@apache.org", "creation_time": "2010-12-09T05:25:53Z", "is_private": false, "text": "This is working as designed. If you need further assistance, please use the users mailing list."}, {"count": 2, "tags": [], "creator": "ognjen.milic@asw.eu", "text": "(In reply to comment #1)\n> This is working as designed. If you need further assistance, please use the\n> users mailing list.\n\nBut in documentation for Context tag it is written\n\nThe Document Base (also known as the Context Root) directory for this web application, or the pathname to the web application archive file (if this web application is being executed directly from the WAR file). You may specify an absolute pathname for this directory or WAR file, or a pathname that is relative to the appBase directory of the owning Host.\n\nIf I have only one xml file in example above called iisstampa.xml with docBase=iis.\nMessage A docBase /home/programi/tomcat/webapps/iis inside the host appBase has been specified, and will be ignored. Then Tomcat looks for folder iisstampa under webapps folder which does not exist and the context is not loaded.\n\nSo there is no possibility to have docBase set relative to appBase because every relative path is ignored.", "id": 142513, "time": "2010-12-09T05:49:54Z", "bug_id": 50441, "creation_time": "2010-12-09T05:49:54Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 50441, "text": "Patches to the documentation are welcome.", "id": 142514, "time": "2010-12-09T06:22:09Z", "creator": "markt@apache.org", "creation_time": "2010-12-09T06:22:09Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "I have updated the docs. The update will be included in 7.0.7 onwards.", "attachment_id": null, "id": 143521, "creator": "markt@apache.org", "time": "2011-01-20T15:43:31Z", "bug_id": 50441, "creation_time": "2011-01-20T15:43:31Z", "is_private": false}, {"count": 5, "attachment_id": null, "bug_id": 50441, "text": "The documentation patch has been applied to Tomcat 6 as well, along with further clarifications added later. It will be in 6.0.37.", "id": 165884, "time": "2013-03-17T04:57:38Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2013-03-17T04:57:38Z", "tags": [], "is_private": false}]