[{"count": 0, "tags": [], "creator": "aag@enforex.es", "attachment_id": null, "text": "If we have a jsp file (not in a war file; just directly in the file system) then we first call the jsp; then it is compiled and executed.\nBut if after this, the jsp file is modified very very fast (by an external process for example), then, jasper does not detect the change and then do not recompile the file, and so on, we do not see the change with the first version.\n\nthis is because in the class:\n\norg/apache/jasper/compiler/Compiler.java\n\nin the line 442 is like:\n\n'if (targetLastModified < jspRealLastModified)'\n\nWhy is the error? because in some systems, the method lastModified or getLastModified does not care miliseconds and return units in seconds.\n\nThen, if we first compile, and after (in the same second) we modify the jsp file, as the functions ignores miliseconds units, then jspRealLastModified is equals to \ntargetLastModified (BUT IT IS NOT).\n\nSo I think is that the solution is very simple. Change the condition from:\n\n'if (targetLastModified < jspRealLastModified)'\n\nto\n\n'if (targetLastModified <= jspRealLastModified)'\n\n\nI tried this and it works.", "id": 142577, "time": "2010-12-10T12:41:29Z", "bug_id": 50455, "creation_time": "2010-12-10T12:41:29Z", "is_private": false}, {"count": 1, "tags": [], "creator": "aag@enforex.es", "attachment_id": null, "is_private": false, "id": 142578, "time": "2010-12-10T13:22:51Z", "bug_id": 50455, "creation_time": "2010-12-10T13:22:51Z", "text": "(In reply to comment #0)\n> If we have a jsp file (not in a war file; just directly in the file system)\n> then we first call the jsp; then it is compiled and executed.\n> But if after this, the jsp file is modified very very fast (by an external\n> process for example), then, jasper does not detect the change and then do not\n> recompile the file, and so on, we do not see the change with the first version.\n> \n> this is because in the class:\n> \n> org/apache/jasper/compiler/Compiler.java\n> \n> in the line 442 is like:\n> \n> 'if (targetLastModified < jspRealLastModified)'\n> \n> Why is the error? because in some systems, the method lastModified or\n> getLastModified does not care miliseconds and return units in seconds.\n> \n> Then, if we first compile, and after (in the same second) we modify the jsp\n> file, as the functions ignores miliseconds units, then jspRealLastModified is\n> equals to \n> targetLastModified (BUT IT IS NOT).\n> \n> So I think is that the solution is very simple. Change the condition from:\n> \n> 'if (targetLastModified < jspRealLastModified)'\n> \n> to\n> \n> 'if (targetLastModified <= jspRealLastModified)'\n> \n> \n> I tried this and it works.\n\n\nJust only to clarify that when I say 'the method lastModified or getLastModified does not care miliseconds and return units in seconds' I do not mean that the funtion returns seconds.. I mean that if the real time is '1292005037195' it returns '1292005037000' ignoring the 195ms.\n\n(The timestamp of creation of the file, In some file systems does this.)\n\nI tried to be as much clear as it is posible."}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 142604, "time": "2010-12-12T16:29:34Z", "bug_id": 50455, "creation_time": "2010-12-12T16:29:34Z", "text": "The suggested change will not be made. The system described is clearly capable of generating and compiling a JSP within the same second. With the proposed change, the JSP could get compiled unnecessarily.\n\nThere are a couple of ways of handling the root cause. Bug 23406 is probably the best solution for this scenario."}]