[{"count": 0, "tags": [], "bug_id": 50453, "attachment_id": null, "text": "When a request comes in with multiple X-Forwarded-For headers the RemoteIP valve should be examining all of them in reverse order.\n\nAs defined by the standard:\n\"Multiple message-header fields with the same field-name MAY be present in a message if and only if the entire field-value for that header field is defined as a comma-separated list [i.e., #(values)]. It MUST be possible to combine the multiple header fields into one \"field-name: field-value\" pair, without changing the semantics of the message, by appending each subsequent field-value to the first, each separated by a comma. The order in which header fields with the same field-name are received is therefore significant to the interpretation of the combined field value, and thus a proxy MUST NOT change the order of these field values when a message is forwarded.\"\n\nthus:\n(a)\nX-Forwarded-For: 192.168.0.3\nX-Forwarded-For: 222.234.0.4\n\nIs semantically equivalent to:\n(b)\nX-Forwarded-For: 192.168.0.3, 222.234.0.4\n\nHowever (a) is not handled by the RemoteIP valve as it only ever looks at the first header.\n\nFor reference, this was raised on the HAproxy mailing list:\nhttp://www.formilux.org/archives/haproxy/1012/4122.html\nand tomcat user's mailing list:\nhttp://mail-archives.apache.org/mod_mbox/tomcat-users/201012.mbox/%3C4D022C57.1070005@apache.org%3E\n\nTomcat users suggested raising a bug. Hence this.", "id": 142567, "time": "2010-12-10T09:29:39Z", "creator": "brett.dellegrazie@intact-is.com", "creation_time": "2010-12-10T09:29:39Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50453, "attachment_id": null, "text": "This is due to RemoteIpValve's use of request.getHeader() rather than the enumeration from request.getHeaders().  I'll try to whip up a patch...", "id": 142569, "time": "2010-12-10T09:39:04Z", "creator": "jim@riggs.me", "creation_time": "2010-12-10T09:39:04Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 50453, "attachment_id": null, "text": "I think there is no given standard concerning whether the first or the last header is the \"right\" one (coming from the closest proxy). The same for a comma-separated multi-valued header.\n\nmod_remoteip for the Apache Web Server claims:\n\nWhen multiple, comma delimited remote IP addresses are listed in the header value, they are processed in Right-to-Left order. Processing halts when a given remote IP address is not trusted to present the preceeding IP address. The header field is updated to this remaining list of unconfirmed IP addresses, or if all IP addresses were trusted, this header is removed from the request altogether.\n\nIn replacing the remote_ip, the module stores the list of intermediate hosts in a remoteip-proxy-ip-list note, which mod_log_config can record using the %{remoteip-proxy-ip-list}n format token. If the administrator needs to store this as an additional header, this same value can also be recording as a header using the directive RemoteIPProxiesHeader.\n\n\nSo it might be a good idea to handle the IPs from right to left resp. later headers before earlier ones, as long as the previous IP is trusted.", "id": 142572, "time": "2010-12-10T10:19:00Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2010-12-10T10:19:00Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 142574, "time": "2010-12-10T10:46:07Z", "bug_id": 50453, "creation_time": "2010-12-10T10:46:07Z", "is_private": false, "text": "RFC2616 is clear on how headers should be combined so order is retained. In short\n...\nX-Forwarded-For : A, B\n...\nX-Forwarded-For : C\n...\nX-Forwarded-For : D, E\n\nmust be treated exactly the same way as:\nX-Forwarded-For: A, B, C, D, E\n\nTomcat will return values for a header in the correct order although it may return the above as \"A, B\", \"C\", \"D, E\" - I haven't checked."}, {"count": 4, "tags": [], "bug_id": 50453, "attachment_id": null, "id": 142581, "creation_time": "2010-12-10T14:40:29Z", "time": "2010-12-10T14:40:29Z", "creator": "chris@christopherschultz.net", "text": "So, should the RemoteIPValve/Filter should be looking at the first X-Forwarded-For (A) or the last X-Forwarded-For (E) address?\n\nIt sounds like the reporter was expecting \"E\" but the spec seems to imply that \"A\" should be returned.", "is_private": false}, {"count": 5, "tags": [], "bug_id": 50453, "text": "Rainer, the spec is absolutely clear about precidence, the last (rightmost) value is added by the nearest adjacent proxy to the server agent.  Ergo, the first (leftmost) value was added by the proxy closest to the user agent.\n\nmod_remoteip uses this in combination of proxy trust metrics to determine how far back to unwind that from the rightmost value.  Perhaps only the proxies under the control of the server administrator will be trusted, in which case only the last or near-last value will be used, or perhaps all servers are trusted and any arbitrary value presented by any proxy will be accepted, in which case the first value is used.\n\nIt entirely depends on what the administrator wants, either trusted values of X-Forwarded-For presented by known proxy agents, or any arbitrary/potentially spammed values.", "id": 142584, "attachment_id": null, "creator": "wrowe@apache.org", "creation_time": "2010-12-10T15:24:59Z", "time": "2010-12-10T15:24:59Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 50453, "attachment_id": null, "text": "(In reply to comment #4)\n> So, should the RemoteIPValve/Filter should be looking at the first\n> X-Forwarded-For (A) or the last X-Forwarded-For (E) address?\n\nChris -\n\nIt should be looking at them as if they were combined in a single comma-separated list and evaluating them from right-to-left.  As Mark said, regardless of how the header(s) are received, it should be treated as \"X-Forwarded-For: A, B, C, D, E\" and RemoteIP should \"trust\" them in the order E - D - C - B - A.  I will make sure that the switch to getHeaders() in my patch does this.", "id": 142585, "time": "2010-12-10T16:48:05Z", "creator": "jim@riggs.me", "creation_time": "2010-12-10T16:48:05Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 50453, "text": "> \"X-Forwarded-For: A, B, C, D, E\" and RemoteIP should \"trust\" them in the order\n> E - D - C - B - A.\n\nI'm not convinced that order matters, here, since all addresses will be checked and if one of them matches, the request will be allowed. Am I missing something?", "id": 142650, "attachment_id": null, "creator": "chris@christopherschultz.net", "creation_time": "2010-12-13T11:08:42Z", "time": "2010-12-13T11:08:42Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 50453, "attachment_id": null, "text": "Yes. Order is critical in this use case since a) proxy order matters b) not all proxies are trusted. Jim is heading in the right direction.", "id": 142651, "time": "2010-12-13T11:17:55Z", "creator": "markt@apache.org", "creation_time": "2010-12-13T11:17:55Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 50453, "attachment_id": 26428, "text": "Created attachment 26428\nv1\n\nHere is a first pass at this.  I have done rudimentary testing of both the valve and filter.  Both appear to be working correctly, but it would be good if someone with a real-life test/dev setup could run it through the gauntlet.\n\nI tried to make as few changes as possible.  Effectively, all this patch does is concatenate multiple headers into a single comma-delimited string before passing it off to commaDelimitedListToStringArray().  Then processing continues as it did before.\n\nNote that this only addresses the remoteIpHeader (e.g. X-Forwarded-For).  It does not do anything with proxiesHeader or protocolHeader.", "id": 142862, "time": "2010-12-20T14:50:27Z", "creator": "jim@riggs.me", "creation_time": "2010-12-20T14:50:27Z", "is_private": false}, {"count": 10, "tags": [], "bug_id": 50453, "attachment_id": null, "id": 142866, "creation_time": "2010-12-20T16:13:45Z", "time": "2010-12-20T16:13:45Z", "creator": "chris@christopherschultz.net", "text": "Don't forget RemoteIPFilter in trunk.", "is_private": false}, {"count": 11, "tags": [], "bug_id": 50453, "text": "The attachment patches both the valve and the filter, and my comment says that I tested both.", "id": 142870, "time": "2010-12-20T16:23:25Z", "creator": "jim@riggs.me", "creation_time": "2010-12-20T16:23:25Z", "is_private": false, "attachment_id": null}, {"count": 12, "tags": [], "bug_id": 50453, "attachment_id": null, "id": 142871, "creation_time": "2010-12-20T16:56:21Z", "time": "2010-12-20T16:56:21Z", "creator": "chris@christopherschultz.net", "text": "D'oh. This head cold is killing my ability to concentrate on even reading 5 or 6 sentences. Apologies for the noise.", "is_private": false}, {"count": 13, "tags": [], "bug_id": 50453, "attachment_id": null, "text": "Fixed in trunk for 7.0.x and will be included in 7.0.6 onwards. I also updated the test cases.\n\nThe Valve fix has been proposed for 6.0.x.", "id": 143089, "time": "2011-01-05T10:08:01Z", "creator": "markt@apache.org", "creation_time": "2011-01-05T10:08:01Z", "is_private": false}, {"count": 14, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 143183, "time": "2011-01-07T13:28:50Z", "bug_id": 50453, "creation_time": "2011-01-07T13:28:50Z", "is_private": false, "text": "Fixed in Tomcat 6.0.x and will be included in 6.0.30 onwards."}]