[{"count": 0, "tags": [], "text": "I use NIO HTTP Tomcat connector org.apache.coyote.Http11NioProtocol to\nimplement Comet streaming to browsers and mobile devices. \nThe application opens 'primary' persistent Comet connection to receive data\nfrom the server. Server sends data to the client periodically.\n\nCurrently, the response always uses HTTP 1.1 type response with chunked encoding.\n\nThere could be a legitimate reason to disable chunked encoding - use \"Connection: close\" without \"Content-Length\" headers.\n\nFor example, if I use tomcat to implement EventType streaming with Chrome, it does not like chunked encoding and fails to receive any data. Also, chunked encoding increases network bandwidth.\n\nOne way to disable chunked encoding (and actually the one I would prefer) is to force HTTP 1.0 response.\n\nSo my questions are: \n1) is it possible to force HTTP 1.0 response\n2) is it possible to use HTTP 1.1 response, but disable chunked encoding.", "attachment_id": null, "bug_id": 50494, "id": 142824, "time": "2010-12-17T23:10:36Z", "creator": "goberman@msn.com", "creation_time": "2010-12-17T23:10:36Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 50494, "is_private": false, "id": 143051, "time": "2011-01-04T09:55:33Z", "creator": "markt@apache.org", "creation_time": "2011-01-04T09:55:33Z", "tags": [], "text": "Bugzilla is not a support forum. These questions below on the users mailing list."}, {"count": 2, "tags": [], "text": "This is not a support question. It is a legitimate requests for enhancement. Is there a place I can request enhancements for Tomcat?\nOr maybe you do not accept requests for enhancements?", "attachment_id": null, "id": 143053, "creator": "goberman@msn.com", "time": "2011-01-04T10:02:30Z", "bug_id": 50494, "creation_time": "2011-01-04T10:02:30Z", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 50494, "is_private": false, "id": 143054, "time": "2011-01-04T10:09:15Z", "creator": "markt@apache.org", "creation_time": "2011-01-04T10:09:15Z", "tags": [], "text": "The questions you asked \"Is it possible to ...?\" are support questions that belong on the users mailing list. Enhancement requests are usually phrased \"Please add an option to ...\"\n\nEnhancement requests can be made by selecting 'enhancement' for the issues severity.\n\nGiven your questions, I'd recommend the users list is the place to start to get the \"Is it possible to ...\" answers and then open an enhancement request if there is a new feature you'd like to see."}, {"count": 4, "attachment_id": null, "bug_id": 50494, "is_private": false, "id": 143055, "time": "2011-01-04T10:16:35Z", "creator": "goberman@msn.com", "creation_time": "2011-01-04T10:16:35Z", "tags": [], "text": "Given how fast you reject enhancement requests, I feel it will be waste of time, but, just to please you I am making the changes:\n\nI use NIO HTTP Tomcat connector org.apache.coyote.Http11NioProtocol to\nimplement Comet streaming to browsers and mobile devices. \nThe application opens 'primary' persistent Comet connection to receive data\nfrom the server. Server sends data to the client periodically.\n\nCurrently, the response always uses HTTP 1.1 type response with chunked\nencoding.\n\nThere could be a legitimate reason to disable chunked encoding - use\n\"Connection: close\" without \"Content-Length\" headers.\n\nFor example, if I use tomcat to implement EventType streaming with Chrome, it\ndoes not like chunked encoding and fails to receive any data. Also, chunked\nencoding increases network bandwidth.\n\nOne way to disable chunked encoding (and actually the one I would prefer) is to\nforce HTTP 1.0 response.\n\nPLEASE ADD AN OPTION TO:\n1) force HTTP 1.0 response.\n2) use HTTP 1.1 response, but disable chunked encoding."}, {"count": 5, "attachment_id": null, "bug_id": 50494, "text": "Tomcat aims to implement the various specifications (HTTP, Servlet, etc.) as closely as possible and deviates from those specifications only when there is a very good reason to do so. Working around bugs in third party applications is typically not viewed as good reason to diverge from the specifications.\n\nQuoting from section 4.4 of the HTTP 1.1 spec:\n<quote>\nAll HTTP/1.1 applications that receive entities MUST accept the\n\"chunked\" transfer-coding (section 3.6), thus allowing this mechanism\nto be used for messages when the message length cannot be determined\nin advance.\n</quote>\n\nWith the above in mind, this looks like a bug in the user agent.\n\nI can think of several ways to force a non-chunked response with the current Tomcat versions. As I said previously, the users mailing list is the place to discuss this. If a discussion on the users list identifies a use case that isn't currently supported, that would be the point to re-open this issue.", "id": 143057, "time": "2011-01-04T10:52:52Z", "creator": "markt@apache.org", "creation_time": "2011-01-04T10:52:52Z", "tags": [], "is_private": false}]