[{"count": 0, "tags": [], "bug_id": 50502, "is_private": false, "text": "Hi,\n\nI have an enhancement to propose in mod_proxy/mod_proxy_http.\n\nIt should be possible to use ProxyPreserveHost inside a <Location> block, which would be useful when using ProxyPass without a path parameter and sending different subpaths to different hosts.\n\nExample:\n\nProxyPass /test http://test.example.com\n\n<Location /virtual>\n  ProxyPreserveHost on\n  ProxyPass http://virtual.example.com/virtual\n</Location>\n\nThat way http://something.example.com/test/index.html would be proxied to http://test.example.com/index.html with Host: test.example.com, but http://something.example.com/virtual/subdir/index.html would be proxied to the exact same URL, connecting on virtual.example.com:80, but sending Host: something.example.com.\n\nBTW, this request is based on a real situation I have, I have a proxy with two backends for different purposes, one of them uses the Host: header content inside the generated HTML, so I'd like to use ProxyPreserveHost on for it, the other one uses the Host: header to decide what is the physical location of the server (in short, it depends on a certain virtual host to be accessed) and I would like to have ProxyPreserveHost off for those ProxyPass directives. To fix the issue the one that uses the name passed in the Host: header inside the generated HTML will be fixed to use relative URLs (which is the right way to fix that) but I guess Apache should keep the flexibility of using different settings of ProxyPreserveHost in different contexts.\n\nThanks,\nFilipe", "id": 142863, "time": "2010-12-20T14:51:50Z", "creator": "filbranden@gmail.com", "creation_time": "2010-12-20T14:51:50Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 50502, "is_private": false, "text": "This already works in trunk as of r824072. Not sure how likely it is to be backported to 2.2.x.", "id": 142876, "time": "2010-12-21T01:54:39Z", "creator": "rpluem@apache.org", "creation_time": "2010-12-21T01:54:39Z", "attachment_id": null}]