[{"count": 0, "text": "Mail archive HTML page is generated by mod_mbox. This module must try hide the full email address of people in messages. But as you can see below links, it doesn't always work. \n\nhttp://mail-archives.apache.org/mod_mbox/httpd-users/200608.mbox/%3C8d423b320608160950l4ab345b1p74d76c62fe4aa42f@mail.gmail.com%3E\n\n\nhttp://mail-archives.apache.org/mod_mbox/tomcat-users/201012.mbox/%3CAANLkTikxhDGOQZv+CDQ2hsMwQKzBAyD4wFoyv=jGJ5T4@mail.gmail.com%3E", "bug_id": 50532, "is_private": false, "id": 142994, "time": "2010-12-30T05:26:05Z", "creator": "brad.revolver@gmail.com", "creation_time": "2010-12-30T05:26:05Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "id": 143004, "time": "2010-12-30T12:37:12Z", "bug_id": 50532, "creation_time": "2010-12-30T12:37:12Z", "is_private": false, "text": "This is because of two entirely different concepts you would benefit from\nunderstanding.  Mail headers are well understood and easily modified without \ndamage to the content of the message, and mod_mbox modifies these values.\n\nMail body content is not defined, and may contain semantic information relevant \nto understanding the message.  E.g. if you had java source with annotations,\nor character or line number offsets of a file, or other non-email information, \nwould you prefer that the semantic value of these messages were obliterated?  \nWhat about in attachments?\n\nMy inclination is to close this as being unrealistic, but if a more serious\nproposal with specific definitions were offered, they could be discussed.\nNote that this will not conceal email addresses, however, since unfiltered\nmail archives are available."}, {"count": 2, "tags": [], "creator": "nick@webthing.com", "text": "It's actually a good suggestion.  Sure, we can't reliably parse addresses in free text, any more than other agents from desktop tools to spambots.  But we can point a regexp at low-hanging fruit.\n\nI'll have a think about how greedy a regexp to throw at it.", "id": 143006, "time": "2010-12-30T14:07:25Z", "bug_id": 50532, "creation_time": "2010-12-30T14:07:25Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "I agree with Nick that it is the point. \n\nThat Apache Mail Archive can at least put under protection these names as abcxxxxxxx@noway.com.\n\nBesides preventing so much problems (such as security, spam) from occurring, I also think that it is important for the Apache's own reputation. Because those messages are taken and parsed right away by so many 3rd. parties. Even some of those 3rd parties are reliable, we are not sure about all of them. \n\nI am pretty sure that there are so many spam/security victims which are waiting to hear that this problem has been fixed.", "is_private": false, "bug_id": 50532, "id": 143014, "time": "2010-12-31T08:05:00Z", "creator": "kaanatabey@yahoo.com.tr", "creation_time": "2010-12-31T08:05:00Z", "attachment_id": null}]