[{"count": 0, "tags": [], "bug_id": 50605, "text": "I have a document that uses U+002D in a variety of situations, including the phrase \"troff -mx\".  Obviously, the U+002D should be flush against the \"m\".  However, when using fop with Nimbus Roman No9 L (the Type 1 Times equivalent from gsfonts) or URW Palladio L (the Type 1 Palatino equivalent), there is a significant gap after the U+002D.  This occurs whether the font is bold or not.  Hyphenation is also not relevant.\n\nThe problem occurs in 1.0 (and trunk) but does not occur in 0.95.  I've used the Apache git bridge to bisect the problem.  For git, the problematic commit is 3b4af07609eb6f091ca110d99ba1f63b828222e1; for svn, it is 910445 (at least according to the information the bridge included).\n\nThere are testcases and examples of the misrendering attached to Debian bug 610344 (http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=610344).  Since Nimbus Roman No9 L is generally the default font for Times on many Linux boxes, this misrendering will likely affect a significant number of users on Linux platforms.", "id": 143422, "time": "2011-01-17T15:54:57Z", "creator": "sandals@crustytoothpaste.net", "creation_time": "2011-01-17T15:54:57Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "sandals@crustytoothpaste.net", "attachment_id": 26501, "text": "Created attachment 26501\nPatch to prevent double-mapping", "id": 143423, "time": "2011-01-17T17:43:44Z", "bug_id": 50605, "creation_time": "2011-01-17T17:43:44Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 50605, "text": "I've narrowed down the problem to the call to overridePrimaryEncoding on line 422 of Type1FontLoader.java.  Commenting this line out seems to solve the problem.\n\nThis function (overridePrimaryEncoding) iterates over the set of metrics and sets a character code for each one based on the mapping passed in.  However, two different characters are mapped to 0x2d: U+002D and U+2212.  Of course, the metrics for U+2212 are different than those for U+002D; the former is wider than the latter.  When layout occurs, the incorrect metrics are used and consequently, a gap occurs.\n\nI think the sensible thing to do here is not to map U+2212 onto U+002D.  Attached is a patch that does exactly that.  When we call overridePrimaryEncoding, the encoding is always a single byte.  The patch creates an array of 256 elements.  When we map a character to a byte value, we store the given character value into the array (indexed by the byte value) and make the mapping.  Next time we have a mapping to the same byte value, we do nothing.  And by nothing, I mean nothing.  We do not map it onto the given byte value (because that breaks things, as I've demonstrated) and we do not map it onto -1 (because then the next glyph is rendered over the top of this one).  We simply do nothing.", "id": 143424, "time": "2011-01-17T17:44:29Z", "creator": "sandals@crustytoothpaste.net", "creation_time": "2011-01-17T17:44:29Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 50605, "text": "Should be fixed with:\nhttp://svn.apache.org/viewvc?rev=1142188&view=rev\nhttp://svn.apache.org/viewvc?rev=1142189&view=rev\n\nThanks for taking the time to produce a patch! I've noticed it too late. I've fixed the problem as part of a series of bugfixes in that area and only checked Bugzilla afterwards.", "id": 147696, "time": "2011-07-02T10:33:20Z", "creator": "jeremias@apache.org", "creation_time": "2011-07-02T10:33:20Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 50605, "attachment_id": null, "id": 155500, "time": "2012-04-01T06:19:19Z", "creator": "gadams@apache.org", "creation_time": "2012-04-01T06:19:19Z", "is_private": false, "text": "batch transition to closed; if someone wishes to restore one of these to resolved in order to perform a verification step, then feel free to do so"}]