[{"count": 0, "tags": [], "bug_id": 50608, "is_private": false, "text": "Created attachment 26506\nFiles to reproduce issue\n\nWe're running Apache 2.2.17 compiled against OpenSSL 0.9.8q with the FIPS 1.2 module, we're using PHP 5.3.5. Our platform is Redhat ES5.\n\nWhen we introduce the SSLFIPS directive in our httpd.conf and log in to our application (which requires a license) the license files to decrypt via PHP. However, without the SSLFIPS directive, everything works fine. We've been digging through this and trying to figure out what's going on, it appears to be something FIPS enabled. I've attached a tarball containing instructions, PHP scripts, and keys to reproduce this issue.\n\nIf you need further information, feel free to ask.", "id": 143432, "time": "2011-01-18T08:46:31Z", "creator": "jyerge@tenable.com", "creation_time": "2011-01-18T08:46:31Z", "attachment_id": 26506}, {"count": 1, "tags": [], "bug_id": 50608, "attachment_id": null, "text": "Take this up with your application vendor, their license check uses some\nFIPS-prohibited ciphers or hash.  This is not a support forum, it's a tracker\nfor flaws in the software.  Peer-to-peer user support should always be\ndirected to the users list.", "id": 143433, "time": "2011-01-18T09:02:39Z", "creator": "wrowe@apache.org", "creation_time": "2011-01-18T09:02:39Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 50608, "attachment_id": null, "text": "We are the application vendor and we've attempted to create the pub/priv keys in FIPS mode and are still encountering this issue.", "id": 143495, "time": "2011-01-20T08:18:09Z", "creator": "jyerge@tenable.com", "creation_time": "2011-01-20T08:18:09Z", "is_private": false}, {"count": 3, "tags": [], "creator": "wrowe@apache.org", "text": "Please review http://openssl.org/docs/fips/ - it is incumbent upon you to\nthoroughly understand openssl's FIPS operating mode if you are attempting\nto set this in conjunction with your software - what is and what is not\nFIPS validated.  This remains your issue, with the openssl library, and\nhas nothing whatsoever to do with Apache software.\n\nSSLFIPS On does exactly what it says, it changes the operating mode of\nthe openssl library, and the impact of that is for you to understand and\ncompensate for.  Or else don't enable it.", "id": 143534, "time": "2011-01-20T19:14:51Z", "bug_id": 50608, "creation_time": "2011-01-20T19:14:51Z", "is_private": false, "attachment_id": null}]