[{"count": 0, "tags": [], "text": "Created attachment 26551\nPatch file for inch res unit and rows per strip changes to xmlgraphicscommons\n\nImageWriterParams\n1) Added more variables to ImageWriterParams to support following changes.  Propose future evaluation to extend class to mime-specific (TIFF, JPEG) implementations as too many private variables are mime-specific (even prior to this change).\n\n2) Separated single resolution into X and Y, as unequal values is definitely possible with TIFF (consider the 196 x 204 standard for faxing); xResolution becomes container for standard single resolution.  setResolution will set both x and y values equally; getResolution will now return xResolution.\n\n3) Added resolution unit (to allow for inches and none); still defaults to centimeter.\n\n4) Added rowsPerStrip which at this time may be 1 (default) or pixel height of current image.\n\n5) Added rowsPerStripOverridden boolean which is evaluated to sets height of current page as value of rowsPerStrip for TIFF.\n\nImageIOImageWriter\n1) Replaced updateMetadata(IIOMetaData, ImageWriterParams) with updateMetadata(RenderedImage, IIOMetaData, ImageWriterParams);\nWanted to leave original in for backwards compatibility, but could not determine a way to do so without breaking.  This is the biggest change and will cause controversy with any classes which extend the current version of ImageIOImageWriter.  As far as I can tell, updateMetadata of ImageIOImageWriter is only used by Tiff, not by PNG or JPEG and should probably just be moved to ImageIOTIFFImageWriter.\n\nThe reason for the replacement was to allow the height of the current RenderedImage to be used for RowsPerStrip \n\n2) Altered updateMetadata to account for non-centimeter resolution unit; cm is still default.\n\nTIFFImageDecoder\n1) Added new constants as I could not find a more appropriate class.\n\nImageIOTIFFImageWriter\n1) Applied TIFFImageDecoder constants judiciously.  I understand we don't reference BaselineTIFFTagSet to reduce required libraries on compilation, but since these classes require imageio anyway, I recommend we reconsider rather than duplicate code.\n\n2) Added set of Resolution Unit in metadata; calculation performed correctly for Inch and maintained for Centimeter (default).\n\n2.5) Removed existing code for Resolution Unit - after evaluation, it was determined this code did absolutely nothing.\n\n3) Added option to override RowsPerStrip with the height of the currently rendered image; this correctly reduces the size of the metadata, which is currently immense in comparison, and time to create file.\n\n4) Created utility methods and cleaned up existing.\n\nTIFFImageWriter\n1) Accounted for separate X and Y resolutions\n\n2) Accounted for resolution unit (cm (3) is default)", "attachment_id": 26551, "id": 143649, "creator": "joshua.marquart@firstdata.com", "time": "2011-01-26T00:54:53Z", "bug_id": 50657, "creation_time": "2011-01-26T00:54:53Z", "is_private": false}, {"count": 1, "tags": [], "creator": "joshua.marquart@firstdata.com", "text": "Referring to the following comment I wrote:\n\n\"As far as I can tell, updateMetadata of ImageIOImageWriter\nis only used by Tiff, not by PNG or JPEG and should probably just be moved to\nImageIOTIFFImageWriter.\"\n\nI refer not to the method itself, but to the functionality within the current updateMetadata method of ImageIOImageWriter.  This functionality appears to be TIFF-specific and \n(1) referred to via super in ImageIOTIFFImageWriter, \n(2) completely overridden in ImageIOJPEGImageWriter and \n(3) ignored(?) by ImageIOPNGImageWriter.\n\nMaking updateMetadata abstract may be a viable option.", "id": 143650, "time": "2011-01-26T01:03:12Z", "bug_id": 50657, "creation_time": "2011-01-26T01:03:12Z", "is_private": false, "attachment_id": null}, {"attachment_id": 26552, "tags": [], "bug_id": 50657, "text": "Created attachment 26552\nReplaces earlier attachment, use this instead.\n\nI made a couple mistakes in my initial patch.\n\nDifferences in this patch are\n\nImageWriterParams \n1) now uses constant from TIFFImageDecoder for cm instead of arbitrary hard-coded value 3.\n\n2) replaced unused proposed rowsPerStrip value and new boolean rowsPerStripOverridden with more appropriately named oneRowPerStrip boolean.\n\n3) revised hasResolution method to check both X and Y, which are both set in setResolution and their own individual methods.\n\n4) added javadoc comments to many methods that were not commented; my bad.\n\nImageIOTIFFImageWriter\n1) replaced call to isRowsPerStripOverridden with call to NOT isOneRowPerStrip\n\n2) Consolidated identical boolean checks.", "count": 2, "id": 143671, "time": "2011-01-26T11:55:23Z", "creator": "joshua.marquart@firstdata.com", "creation_time": "2011-01-26T11:55:23Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 143835, "creation_time": "2011-01-31T15:49:11Z", "time": "2011-01-31T15:49:11Z", "creator": "jeremias@apache.org", "text": "Thanks for the patch, Joshua. Would you mind doing a couple of changes?\n\nYou've added a few constants to TIFFImageDecoder which are only used in the package o.a.x.image.writer (which is an API package and should not access any implementation packages). I think it would be better to change these constants into an enum in the ...image.writer package.\n\nThe other one concerns the ImageWriterParams.setOneRowPerStrip(boolean). Wouldn't it make more sense to actually use an integer here? With the boolean the only possible values are 1 and <image-height>. With an integer, one could set 32 rows for a strip, for example. Alternatively, this method could be renamed to setSingleStrip(boolean) (or something like that) essentially inverting the meaning of the boolean. My reasoning: setOneRowPerStrip(false) says \"not one row per strip\", but setSingleStrip(true) would say \"one strip with <image-height> rows\" and setSingleStrip(false) would set the internal \"Integer rowsPerStrip\" to 1, allowing to later add a method setRowsPerStrip(int) if anyone needs that.\n\nPlease let me know what you think. I'll later take a deeper look again. Thanks.", "is_private": false}, {"count": 4, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 143839, "creation_time": "2011-01-31T18:19:02Z", "time": "2011-01-31T18:19:02Z", "creator": "joshua.marquart@firstdata.com", "text": "--\nRegarding TIFFImageDecoder:\n\nI can certainly create an enum in writer if you like.\nI originally placed the value constants in the TIFFImageDecoder class to persist alongside the name constant they are used with, TiffImageDecoder.TIFF_RESOLUTION_UNIT.  Figured they might be referred-to elsewhere in the codebase, but have not yet looked.\n\nI do see now that TIFFImageDecoder extends ImageDecoderImpl, and agree this might not be the best place.\n\n--\nRegarding RowsPerStrip:\n\nWith ImageWriterParams not being page-specific, as is the case with multi-paged TIFF files, RowsPerStrip set to image height would need to vary on a per-page basis and might not be able to be set until the image is rendered, as the value might not be known.\n\nA different solution that I am going to submit a patch for will have the following changes to ImageWriterParams:\n\n* VARIABLE rowsPerStrip is an int with standard get/set methods.  Defaults to 1.\n* METHOD void setSingleStrip(boolean) method - true sets to -1, false sets to 1.\n* METHOD boolean isSingleStrip() - convenience returns true if rowsPerStrip == -1\n\n--\nRegarding BitsPerSample\n\nI believe adding the \"BitsPerSample\" line might have been a mistake on my part, and I'll remove it in the upcoming patch revision to this bug.", "is_private": false}, {"count": 5, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 143848, "creation_time": "2011-02-01T03:14:08Z", "time": "2011-02-01T03:14:08Z", "creator": "jeremias@apache.org", "text": "Your suggestion is even better, Joshua. Looking forward to your updated patch.", "is_private": false}, {"count": 6, "tags": [], "bug_id": 50657, "attachment_id": 26727, "id": 144719, "creation_time": "2011-03-03T17:40:23Z", "time": "2011-03-03T17:40:23Z", "creator": "joshua.marquart@firstdata.com", "text": "Created attachment 26727\nPatch revision with enum and other changes from comments\n\nBeen a little over a month, but the patch has been revised pretty much according to my comments earlier.", "is_private": false}, {"count": 7, "attachment_id": null, "bug_id": 50657, "text": "Also, I do believe we should have a variable bits per sample value tag set (hardened depending on compression) in a future update to the TIFF family along the lines of this code:\n\nifd.appendChild(createShortMetadataNode(TIFFImageDecoder.TIFF_BITS_PER_SAMPLE, \"BitsPerSample\", \"1\"));", "id": 144720, "time": "2011-03-03T17:42:23Z", "creator": "joshua.marquart@firstdata.com", "creation_time": "2011-03-03T17:42:23Z", "tags": [], "is_private": false}, {"count": 8, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 144952, "time": "2011-03-12T10:26:44Z", "creator": "joshua.marquart@firstdata.com", "creation_time": "2011-03-12T10:26:44Z", "is_private": false, "text": "Changed back to NEW since info was provided and I didn't change back to NEW."}, {"count": 9, "tags": [], "creator": "jeremias@apache.org", "text": "Sorry for the late response, Joshua. You forgot to include ResolutionUnit in your patch. Would you please attach that one, too?", "id": 145941, "time": "2011-04-22T05:16:17Z", "bug_id": 50657, "creation_time": "2011-04-22T05:16:17Z", "is_private": false, "attachment_id": null}, {"count": 10, "tags": [], "creator": "joshua.marquart@firstdata.com", "text": "Created attachment 27104\nResolutionUnit DOT java ENUM attached\n\nENUM ResolutionUnit.java attached; svn -diff doesn't add completely new files.\n\nIs packaged for org.apache.xmlgraphics.image.writer and should be combined with the prior patch, Patch 26727", "id": 146827, "time": "2011-06-02T20:25:40Z", "bug_id": 50657, "creation_time": "2011-06-02T20:25:40Z", "is_private": false, "attachment_id": 27104}, {"count": 11, "tags": [], "text": "Thanks for supplying the missing file, Joshua. I'm not done with the patch. I'm currently writing some unit tests to verify that the new code works as expected. I found that you set the default resolution unit to centimeters although ImageWriterParams currently uses inches. Later this is converted internally to units per centimeters. Your new code now mixed up the two, although the end result in the image file was correct. I'm in the process to correct that. Please don't post a new patch. I'll fix the problems. I don't want to restart fixing code style problems (like the tab characters). At this point I have to interrupt the processing of the patch but I'll continue shortly. Just to let you know I'm on it as time allows.", "attachment_id": null, "id": 147128, "creator": "jeremias@apache.org", "time": "2011-06-15T08:02:04Z", "bug_id": 50657, "creation_time": "2011-06-15T08:02:04Z", "is_private": false}, {"count": 12, "tags": [], "creator": "joshua.marquart@firstdata.com", "attachment_id": null, "text": "In the Fop code I was working from, without my patch, tiffs created would generate with Centimeter set in the resulting image metadata by default.  You and I discussed it mildly on the list almost a year ago (\"Various TIFF Rendering Questions\" - July 2010)\n\nMy alterations were an attempt to maintain this default state, while still adding the Inch and none-specified functionality.", "id": 147151, "time": "2011-06-15T16:45:08Z", "bug_id": 50657, "creation_time": "2011-06-15T16:45:08Z", "is_private": false}, {"count": 13, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 147157, "creation_time": "2011-06-15T19:21:17Z", "time": "2011-06-15T19:21:17Z", "creator": "jeremias@apache.org", "text": "I haven't checked TIFF, yet, but with PNG, I stumbled over a bug from 2004 that has still not been fixed. As you may have seen in the ImageIO JPEG writer, there is a similar (but different) bug there. More info here:\nhttp://www.tracemodeler.com/articles/aging-bugs-and-setting-dpi-with-java-image-io/\n\nSo, it could very well be that it works fine with TIFF but not with other formats. Still looking for the best way to deal with this.....", "is_private": false}, {"count": 14, "attachment_id": null, "bug_id": 50657, "text": "Hi Joshua,\n\nI'm speaking as a prospective user under the FOP framework. I have a requirement for a project that has some specific needs for TIFF images (header and content). Using the current FOP and XMLGraphics release, the images are not conforming to these requirements. One of the repairs (single strip images) would require decompressing and recompressing which I would rather avoid by having the image created that way in the first place. I can see a path to be able to reprocess the TIFF to do that but your patch update would seem to make that unnecessary. The other requirement I am faced with is for ResolutionUnit to be 'inches' - I have successfully configured for X/YResolution=200 but it still presents that as 787402/10000 dots/centimeter.\n\nI understand I could use the options in your patch by calling the appropriate methods. Since the 'options' I need to set would be the same for every image generated, is there a way for them to be set through initialization either in the fop.xconf or XSL file?", "id": 148147, "time": "2011-07-25T19:54:59Z", "creator": "Dave.Schwartz@ncr.com", "creation_time": "2011-07-25T19:54:59Z", "tags": [], "is_private": false}, {"count": 15, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 148182, "creation_time": "2011-07-26T16:46:56Z", "time": "2011-07-26T16:46:56Z", "creator": "joshua.marquart@firstdata.com", "text": "Hi Dave,\n\nFrom what understand, Jeremias is incorporating my patch as time allows.  \n\nThere were no alterations made to allow new settings to propagate upwards from xconf.fop.\n\nYou will have to call getWriterParams().setResolutionUnit(2) from your renderer to enforce inches.", "is_private": false}, {"count": 16, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 148184, "time": "2011-07-26T16:52:55Z", "creator": "joshua.marquart@firstdata.com", "creation_time": "2011-07-26T16:52:55Z", "is_private": false, "text": "I missed the comment about single-strip.\n\nYou will have to call getWriterParams().setSingleStrip(true) from your renderer\nto set that appropriately.\n\nAgain, I didn't adjust XSL or xconf.fop, and I'll hold off on alterations to this Bug to allow this until Jeremias gives the go-ahead.  My submitted code did not conform to the coding standards."}, {"count": 17, "tags": [], "bug_id": 50657, "attachment_id": null, "text": "The part about the single-strip refers to the fact that the images we are getting now have a strip per row (strip count = image height) due to the default rowsperstrip = 1 behaviour.\n\nSimilar to requirements for resolutionunit being in inches, I was asking whether setting rowsperstrip = imageheight (which would be a constant in my application) could also be done through either the fop.xconf or the XSL itself.\n\nHowever, since the 'set it in configuration' option is not there for resolutionunit, requiring a call to set it, then I can also live with having to make the call to set rowsperstrip.\n\nThanks.\n\nP.S. Can I assume that Joshua's changes are, or will soon be, incorporated in the snapshot builds?", "id": 148253, "time": "2011-07-28T15:47:37Z", "creator": "Dave.Schwartz@ncr.com", "creation_time": "2011-07-28T15:47:37Z", "is_private": false}, {"count": 18, "tags": [], "text": "Jeremias is working on the incorporation; he is doing additional work for it as well, so I can't comment to that status (see his prior post in this bug).  You may be better off grabbing the code and creating a custom IOWriter to use than waiting.\n\nThe patch in this bug does not add any additional fop.xconf/XSL functionality to pre-set any values added in this bug.\n\nIf you set setSingleStrip(true), it will use the incoming image height automatically for rowsperstrip; you will not need to set height specifically.", "attachment_id": null, "id": 148264, "creator": "joshua.marquart@firstdata.com", "time": "2011-07-28T22:28:52Z", "bug_id": 50657, "creation_time": "2011-07-28T22:28:52Z", "is_private": false}, {"count": 19, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 154887, "creation_time": "2012-03-13T21:39:16Z", "time": "2012-03-13T21:39:16Z", "creator": "joshua.marquart@firstdata.com", "text": "As Jeremias has stated recently in an e-mail to the FOP mailing list, \"I'm on hiatus from working on FOP due to various experiences and the direction the project has taken policy-wise in the last few months,\" I am uncertain if that also pertains to the XMLGraphics project and this patch remains up in the air.", "is_private": false}, {"count": 20, "tags": [], "bug_id": 50657, "attachment_id": null, "id": 157801, "creation_time": "2012-04-10T19:35:26Z", "time": "2012-04-10T19:35:26Z", "creator": "gadams@apache.org", "text": "(In reply to comment #11)\n> Thanks for supplying the missing file, Joshua. I'm not done with the patch.\n\njeremias, any chance you will be able to commit this (with your changes)?", "is_private": false}, {"count": 21, "tags": [], "creator": "peter.hancock@gmail.com", "attachment_id": null, "text": "Committed 1384277 based upon the contributions of Joshua Marquart and Jeremias Maerki with minor tweaks.\n\nNote that the unit testing of Tiff metadata was disabled as it required JAI ImageIO support and this is not currently a dependency of the XGC build process.", "id": 162145, "time": "2012-09-13T12:39:50Z", "bug_id": 50657, "creation_time": "2012-09-13T12:39:50Z", "is_private": false}]