[{"count": 0, "tags": [], "text": "When calling the setProperty(String, String) method in Connector.java (line 316 in 6.0.29), the explicit property values are not set.\n\nFor instance, if I call connector.setProperty(\"proxyName\", \"my.host.com\") then check connector.getProxyName() it does not return \"my.host.com\".  I've also tested \"proxyPort\" / getProxyPort -- same issue.\n\nLooking at the code, setProperty sets replacements hashmap and the value in the protocolhandler.  Individual explicit property setter methods, e.g. setProxyName(String) set both the individual field value (this.proxyName) AND invoke setProperty.\n\nHowever, looking at the getters for the individual properties, shows they only check the individual fields and not the replacements hashmap or the protocol handler value.  Therefore the above series (call to setProperty(\"proxyName\"...) and then getProxyName()) fails.", "attachment_id": null, "id": 143624, "creator": "apache@lonbinder.com", "time": "2011-01-25T12:07:04Z", "bug_id": 50650, "creation_time": "2011-01-25T12:07:04Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50650, "attachment_id": null, "id": 143625, "time": "2011-01-25T12:21:43Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-01-25T12:21:43Z", "is_private": false, "text": "That is by design. setProperty(String, String) is the method that is called when explicit property setter is not available.\n\nSee org.apache.tomcat.util.IntrospectionUtils.setProperty(Object, String, String, boolean)"}, {"count": 2, "tags": [], "creator": "apache@lonbinder.com", "attachment_id": null, "text": "Konstantin - I respectfully disagree, the design is fatally flawed.  It should not be the case that setProperty(\"proxyName\", String) behaves differently than setProxyName(String).  \n\nMost specifically, if the user calls setProperty(\"proxyName\", String) it should be expected that the getProxyName returns the same value.\n\nIf this is by design, the API docs need a lot of work, and I've already seen at least one major application (ofbiz) that expects that to work.\n\nIf you won't change the code, please at least make this really clear in the API and in the tomcat properties pages (non javadoc).", "id": 143633, "time": "2011-01-25T15:42:12Z", "bug_id": 50650, "creation_time": "2011-01-25T15:42:12Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 50650, "attachment_id": null, "text": "> and I've already seen at least one major application (ofbiz) that expects that to work\n\nThat never worked. Why are they expecting something?\n\n> Most specifically, if the user calls setProperty(\"proxyName\", String) it should\nbe expected that the getProxyName returns the same value.\n\nNo, I would expect that getProperty(\"proxyName\") would return the value, from symmetry.  There is no need in a class to provide two sets of API to the same underlying features. It is caller's responsibility to call the correct API.\n\nNote, that besides Connector there are also a lot of other classes in Tomcat that have setProperty(..)/getProperty(..) methods and behave in the same way. If anybody would like to propose a patch we may talk further, but I see no bug here.\n\nI will leave this open for a while, if anyone else wants to comment.", "id": 143636, "time": "2011-01-25T16:49:42Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-01-25T16:49:42Z", "is_private": false}, {"count": 4, "tags": [], "text": "In order to work around this for my situation (using OFBiz) I wrote a patch to their code that essentially does the same as IntrospectionUtils: it uses reflection to find the the appropriate setter by name and type and sets in the value.  This (or IntrospectionUtils or something else available) could be set in place.  I don't have a tomcat dev environment set up, but I could get it going and put the patch together.\n\nBtw, I don't think the existing of explicit getter/setters and a generalized getProperty/setProperty is redundant.  The generalized method is useful for setting from an XML file while the explicit comply with the stronger typing for java.", "attachment_id": null, "id": 143639, "creator": "apache@lonbinder.com", "time": "2011-01-25T17:50:30Z", "bug_id": 50650, "creation_time": "2011-01-25T17:50:30Z", "is_private": false}, {"count": 5, "tags": [], "creator": "markt@apache.org", "text": "Agree with Konstantin, this is a WONTFIX.", "id": 143667, "time": "2011-01-26T11:14:12Z", "bug_id": 50650, "creation_time": "2011-01-26T11:14:12Z", "is_private": false, "attachment_id": null}]