[{"count": 0, "tags": [], "bug_id": 50675, "text": "Created attachment 26565\nTest case for bug\n\nI have a test which generates HTTP requests based on values parsed out of a text file. For this, obviously I use a CVS Data Set Config in conjunction with a HTTP Request.\n\nThis test works fine when run locally, but when run via Remote Start, the URLs they request contain ${VARIABLE} instead of the variable parsed from the txt file.\n\nThis was very surprising to me, not the least because none of the Jmeter docs seem to mention any such restriction, and moreover because the whole internet seems to have no mentions of anyone else having this problem. This \"bug\" might be a software bug, or it might be a documentation bug. If Remote Start tests can't use CVS values, then the docs should have a gigantic red box advertising that.\n\nI have attached a minimal test case. If you run it locally, notice in the Results Tree that the requests contain values from the text file; run it remote and notice that they contain the raw variable \"${PARSED_PARAM}\".", "id": 143724, "time": "2011-01-27T12:43:12Z", "creator": "c4339981@pjjkp.com", "creation_time": "2011-01-27T12:43:12Z", "is_private": false, "attachment_id": 26565}, {"count": 1, "tags": [], "bug_id": 50675, "attachment_id": null, "text": "I can confirm the bug, and hope to address it before too long.", "id": 143740, "time": "2011-01-27T17:40:55Z", "creator": "sebb@apache.org", "creation_time": "2011-01-27T17:40:55Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 50675, "attachment_id": null, "id": 143741, "creation_time": "2011-01-27T18:03:20Z", "time": "2011-01-27T18:03:20Z", "creator": "sebb@apache.org", "text": "Could you check the jmeter server log file please?\n\nI suspect the problem is that the server cannot find the CSV data file.\n\nThe problem is that the JMX file is read by the client, which saves its location.\nHowever, this is not passed on to the server, so it defaults to the server launch directory, which may mean it cannot find the data file.\n\nA work-round is to adjust the JMeter starting directory or the relative file name or copy the data file to where it can be found.", "is_private": false}, {"count": 3, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "is_private": false, "id": 143750, "time": "2011-01-28T07:58:47Z", "bug_id": 50675, "creation_time": "2011-01-28T07:58:47Z", "text": "(In reply to comment #1)\n> I can confirm the bug, and hope to address it before too long.\n\nI'm not sure it's really a bug:\n\nThe client does not send the JMX file location across to the server, but what could it send anyway?\n\nAn absolute pathname would in general be meaningless unless the directory structures are identical - the server(s) may run different OSes.\n\nFor relative paths there needs to be a fixed known point on each system - e.g. user.dir, the launch directory. But relative paths will generally only work if the JMX files all in subdirectories of the launch directory.\n\nSo there is no general solution, but in many cases it might be sufficient to calculate the calculate the relative path from user.dir to the JMX file, and send that across to establish the base directory."}, {"count": 4, "text": "I've committed some changes to SVN which resolve the issue for me:\n\nURL: http://svn.apache.org/viewvc?rev=1064920&view=rev\nLog:\nBug 50675 - CVS Data Set Config incompatible with Remote Start\nFixed RMI startup to provide location of JMX file relative to user.dir.\n\nModified:\n   jakarta/jmeter/trunk/bin/testfiles/BatchTestLocal.csv\n   jakarta/jmeter/trunk/bin/testfiles/BatchTestLocal.jmx\n   jakarta/jmeter/trunk/bin/testfiles/BatchTestLocal.xml\n   jakarta/jmeter/trunk/src/core/org/apache/jmeter/engine/ClientJMeterEngine.java\n   jakarta/jmeter/trunk/src/core/org/apache/jmeter/engine/RemoteJMeterEngine.java\n   jakarta/jmeter/trunk/src/core/org/apache/jmeter/engine/RemoteJMeterEngineImpl.java\n   jakarta/jmeter/trunk/xdocs/changes.xml\n\nIf you want to try this in your case, use nightly build 1064920 or later.\n\nAny problems, please re-open the issue and attach client and server log files (info level)", "bug_id": 50675, "is_private": false, "id": 143771, "time": "2011-01-28T18:07:43Z", "creator": "sebb@apache.org", "creation_time": "2011-01-28T18:07:43Z", "tags": [], "attachment_id": null}]