[{"count": 0, "tags": [], "text": "Scenario: SunONE Webserver with MODJK NSAPI plugin on Solaris10, reverse-proxied to by Varnish proxy on same server.\n\nDescription of issue: A request comes into the webserver and is passed back to a JBoss server via the MODJK plugin, when the response comes back, the MODJK plugin inserts a Content-Length header using mixed-case ie: Content-Length: <length> (as defined in /native/common/jk_ajp_common.c), this is ignored by the webserver core as it’s expecting inserted headers to be all lower-case (mentioned here: http://wikis.sun.com/pages/viewpage.action?pageId=58042468#P%26R-%7B%7Bpblocknninsert%28%29%7D%7DFunction see \"Parameter names are case sensitive. By convention, lowercase names are used for parameters that correspond to HTTP header fields.\") and it duly inserts its own “Transfer-encoding: chunked” header, leading to Varnish being presented with a response containing both “Content-Length: <len>”  and “Transfer-encoding: chunked” which breaks Varnish.\n\nChanging the constants below to lower case resolved our issue (Section from /native/common/jk_ajp_common.c showing mixed-case header constants:)\n\nconst char *response_trans_headers[] = {\n    \"Content-Type\",\n    \"Content-Language\",\n    \"Content-Length\",\n    \"Date\",\n    \"Last-Modified\",\n    \"Location\",\n    \"Set-Cookie\",\n    \"Set-Cookie2\",\n    \"Servlet-Engine\",\n    \"Status\",\n    \"WWW-Authenticate\"\n};\n\nThis change may well break plugins for the other webservers of course so I'm requesting that this fix be investigated and if verified, incorporated into ModJk builds for iPlanet going forward.", "attachment_id": null, "id": 143831, "creator": "deltawasp@gmail.com", "time": "2011-01-31T12:51:04Z", "bug_id": 50694, "creation_time": "2011-01-31T12:51:04Z", "is_private": false}, {"count": 1, "tags": [], "text": "This has been fixed in r1078762 and will be part of version 1.2.33.", "attachment_id": null, "bug_id": 50694, "id": 150865, "time": "2011-10-23T20:35:36Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2011-10-23T20:35:36Z", "is_private": false}]