[{"count": 0, "tags": [], "text": "Created attachment 26595\nPacket Capture  File\n\nHi,\n\nI'm seeing a weird Apache behavior.\n\nI;ve got an apache server configured as a proxy which sends all of its request via another proxy out to the internet using the ProxyRemote directive. The secong apache acts as a GW to connect to internet.\n\nProxyRemote http http://<hostname>:80\n\nWe are now seeing this weird behavior:\n1. Client requests URL \n2. Apache forwards this request to the second apache in chain\n3. The GW tears down the tcp connection.\n4. Apache retries the HTTP request, however this time it tries to connect\ndirectly to the OS instead of going through the GW\n5. The OS replies directly to apache with a HTTP status code\n6. The HTTP status code reply is sent to the client\n\nThe question is: how come Apache(httpd) is connecting directly to the OS when the GW tears down the connection? Is this the expected Apache 2 behavior in this scenario? Is there any way to avoid it?\n\nI've been browsing the Apache 2.x documentation but could not find anything\nthat explains this behavior, could it be caused by our ngp_module?\n\nI'm guessing that it may be related to load on teh second proxy if Apache can't connect to it then it trys a direct connection??\n\nThanks a lot.\n- Shashank", "is_private": false, "id": 143907, "creator": "mail2shashank@gmail.com", "time": "2011-02-02T09:43:47Z", "bug_id": 50707, "creation_time": "2011-02-02T09:43:47Z", "attachment_id": 26595}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "text": "Yes, the HTTP proxy tries to connect directly if it fails to connect through a ProxyRemote.  In some other similar cases, it just returns an error immediately.", "id": 144118, "time": "2011-02-09T19:06:44Z", "bug_id": 50707, "creation_time": "2011-02-09T19:06:44Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 50707, "text": "(In reply to comment #1)\n> Yes, the HTTP proxy tries to connect directly if it fails to connect through a\n> ProxyRemote.  In some other similar cases, it just returns an error\n> immediately.\n\nIs there a workaround for this, so as to avoid apache to directly contact to origin server. Also, is this expected apache behavior or a bug in mod_proxy module.\n\n-- shashank", "id": 144137, "time": "2011-02-10T11:21:43Z", "creator": "mail2shashank@gmail.com", "creation_time": "2011-02-10T11:21:43Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 50707, "attachment_id": null, "text": "(In reply to comment #2)\n> (In reply to comment #1)\n> > Yes, the HTTP proxy tries to connect directly if it fails to connect through a\n> > ProxyRemote.  In some other similar cases, it just returns an error\n> > immediately.\n> \n> Is there a workaround for this, so as to avoid apache to directly contact to\n> origin server. Also, is this expected apache behavior or a bug in mod_proxy\n> module.\n> \n\nI don't see a workaround. According to comments, It seems to be working as designed, but not necessarily matching anyones expectations.", "id": 144143, "time": "2011-02-10T12:40:59Z", "creator": "covener@gmail.com", "creation_time": "2011-02-10T12:40:59Z", "is_private": false}]