[{"count": 0, "tags": [], "bug_id": 50723, "text": "Created attachment 26609\nzip contains both FO and PDF files\n\nFor some fonts text underlines may be incorrect. They are positioned upper than they should be or disappear at all.\n\nQuick investigation of those fonts and FOP sources shows that it depends on sTypoAscender used in FOP.\n\nNormally sTypoAscender is negative and underlines are positioned correctly in this case.\nIf sTypoDecender is positive then text is crossed out instead of underlined. If it's 0 then underline is invisible.\n\nAttached are FO file and result PDF.", "id": 144000, "time": "2011-02-05T16:54:12Z", "creator": "alexander.chingarev@duallab.com", "creation_time": "2011-02-05T16:54:12Z", "is_private": false, "attachment_id": 26609}, {"count": 1, "tags": [], "creator": "pc.subscriptions@gmail.com", "text": "Does the FOP community consider this a font issue or a FOP problem? \n\nIn case it is considered a FOP issue we are willing to contribute a patch.", "id": 144133, "time": "2011-02-10T09:55:56Z", "bug_id": 50723, "creation_time": "2011-02-10T09:55:56Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "It's a bit of both actually. See my comment on TTFFile.determineAscDesc(). I've had to come up with some tricks to determine the best possible values for most fonts. But Alexander now has some fonts where this doesn't work. I've spent hours trying to improve this and I don't know if there's a better solution. If anyone has one, I'm thankful but please do extensive tests with as many fonts as possible!\n\nThe part that is a FOP issue is the determination of the underline position (and thickness). We currently use a formula based on the baseline, ascender and descender. See AbstractPathOrientedRenderer.renderTextDecoration(). Some fonts (TrueType and Type 1) provide the desired position and thickness of the underline (but not strike and overline). Ideally, we would of course use that. If these values are reliable is, of course, another question again.", "attachment_id": null, "bug_id": 50723, "id": 144139, "time": "2011-02-10T11:49:05Z", "creator": "jeremias@apache.org", "creation_time": "2011-02-10T11:49:05Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 50723, "text": "Created attachment 26660\nThe validation of TrueType descenders.\n\nSome times TrueTupe contains incorrect OS/2 ascender and descender, but hh metrics is more correct. In this case the OS/2 descender value is positive or equal to zero. We found a several fonts that have such problem.\nIn this patch the validation of descender value is added to function TTFFile.determineAscDesc(). The validation of computed localAscender and localDescender is added to TTFFile.guessVerticalMetricsFromGlyphBBox.\nMay such changes could make FOP more robust of font descenders problems?", "id": 144293, "time": "2011-02-15T04:58:34Z", "creator": "eugene.markovskyi@duallab.com", "creation_time": "2011-02-15T04:58:34Z", "is_private": false, "attachment_id": 26660}, {"count": 4, "tags": [], "creator": "pc.subscriptions@gmail.com", "text": "Wonder whether anyone of the fop community is willing to share viewpoints on the approach taken in the patch. Seems a fairly safe change at first sight.", "id": 144485, "time": "2011-02-22T16:44:59Z", "bug_id": 50723, "creation_time": "2011-02-22T16:44:59Z", "is_private": false, "attachment_id": null}, {"count": 5, "attachment_id": null, "bug_id": 50723, "text": "Looking closer, this indeed seems like a fairly inconsequential (apart from fixing the bug, obviously ;-P).\n\nStill, endorsing and committing it would seem to require incorporating such a font (hardcoding?) in the test suite... which would either make it dependent on the font being locally available, or we would have to distribute such a font (?)\n\nOr is there another way to check this? Anyone?", "id": 144492, "time": "2011-02-22T18:15:02Z", "creator": "adelmelle@apache.org", "creation_time": "2011-02-22T18:15:02Z", "tags": [], "is_private": false}, {"count": 6, "tags": [], "creator": "adelmelle@apache.org", "attachment_id": null, "text": "Seems like Mehdi's efforts in bug 50483 may offer an answer to my question. The patch also touches TTFFile and, IIC, adds testing-infrastructure that might be of use here (?)", "id": 144493, "time": "2011-02-22T19:28:19Z", "bug_id": 50723, "creation_time": "2011-02-22T19:28:19Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 50723, "text": "I've added a bit of testing to the o.a.f.fonts.truetype package, some of which would be of use here, but my patch is to be applied to the Temp_TrueTypeInPostScript branch and would require some work to be ported to trunk. (I assume this patch is for trunk, if not, feel free to ignore the above statement)\n\nAs for testing... That is an area we are sadly complacent on and from my experience with the fonts package, we want both unit tests (which you can plagiarise from my patch) and we want to have more actual font files to test with. The problem with fonts is that it's not always obvious where the bugs are, so we need to test them as exhaustively as we can. \n\nIn my patch, I've used \"Droid Sans Mono\" (a font I liberated from google's Android) to test the behaviour of a mono-spaced font since it was under the Apache license. The unit tests I've added are based on that and DejaVu which was already supplied and would be fairly worthless without their inclusion.\n\nIn summary, no Andreas, to my knowledge there isn't another way to tests fonts other than the methods you mention. But then, I'm still a little green when it comes to FOP so someone else may have a better idea.", "id": 144497, "time": "2011-02-23T03:45:29Z", "creator": "med1985@gmail.com", "creation_time": "2011-02-23T03:45:29Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 50723, "text": "resetting P2 open bugs to P3 pending further review", "id": 157540, "time": "2012-04-07T01:44:27Z", "creator": "gadams@apache.org", "creation_time": "2012-04-07T01:44:27Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "text": "(In reply to comment #3)\n> Created attachment 26660 [details]\n> The validation of TrueType descenders.\n> \n> Some times TrueTupe contains incorrect OS/2 ascender and descender, but hh\n> metrics is more correct. In this case the OS/2 descender value is positive or\n> equal to zero. We found a several fonts that have such problem.\n> In this patch the validation of descender value is added to function\n> TTFFile.determineAscDesc(). The validation of computed localAscender and\n> localDescender is added to TTFFile.guessVerticalMetricsFromGlyphBBox.\n> May such changes could make FOP more robust of font descenders problems?\n\nif you wish to have this patch considered, please provide a patch file, and not an edited source file (for which I have no idea which revision you based it upon)", "attachment_id": null, "bug_id": 50723, "id": 158246, "time": "2012-04-21T05:08:00Z", "creator": "gadams@apache.org", "creation_time": "2012-04-21T05:08:00Z", "is_private": false}, {"count": 10, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "text": "(In reply to comment #9)\n> (In reply to comment #3)\n> > Created attachment 26660 [details]\n> > The validation of TrueType descenders.\n> > \n> > Some times TrueTupe contains incorrect OS/2 ascender and descender, but hh\n> > metrics is more correct. In this case the OS/2 descender value is positive or\n> > equal to zero. We found a several fonts that have such problem.\n> > In this patch the validation of descender value is added to function\n> > TTFFile.determineAscDesc(). The validation of computed localAscender and\n> > localDescender is added to TTFFile.guessVerticalMetricsFromGlyphBBox.\n> > May such changes could make FOP more robust of font descenders problems?\n> \n> if you wish to have this patch considered, please provide a patch file, and not\n> an edited source file (for which I have no idea which revision you based it\n> upon)\n\nAlexander, I am still awaiting your input as requested above. if I see no further input by April 30, I will close this bug due to lack of requested information. Regards, Glenn", "id": 158336, "time": "2012-04-24T05:31:53Z", "bug_id": 50723, "creation_time": "2012-04-24T05:31:53Z", "is_private": false}]