[{"count": 0, "tags": [], "bug_id": 50730, "attachment_id": null, "id": 144038, "time": "2011-02-08T05:04:21Z", "creator": "mongolie2006-apache@yahoo.fr", "creation_time": "2011-02-08T05:04:21Z", "is_private": false, "text": "The page\nhttp://httpd.apache.org/docs/current/en/content-negotiation.html#negotiation\nexplains how to create a type-map file for the mod_negotiation module, but fails to explain where to put such a file and whether several such files are possible/recommended or not."}, {"count": 1, "tags": [], "bug_id": 50730, "attachment_id": null, "id": 144614, "time": "2011-02-28T14:25:35Z", "creator": "i.galic@brainsware.org", "creation_time": "2011-02-28T14:25:35Z", "is_private": false, "text": "\"\"\"Using a type map (i.e., a *.var  file) which names the files containing the variants explicitly, or\"\"\"\n\nand then:\n\n\"\"\"Type map files should have the same name as the resource which they are describing, and have an entry for each available variant; these entries consist of contiguous HTTP-format header lines.\"\"\"\n\nIf that is not clear enough, can you suggest a better phrasing?\n\nFor one, for the other: We then go on to describe the multitude of things you can pack into a single .var file -- I'm not quite clear how from these two pieces of information you were able to interpret that:\n\na) type-maps can be placed in arbitrary directories (How then should they be mapped to the requested resources?)\nb) There can be more than one type-map\n\n...sure there can be.. but that would be silly...\n\nYou could for instance create\n\n# foo.en.var:\nURI: foo.en.html\nContent-Encoding: text/html\n\nURI: foo.en.xhtml\nContent-Encoding: text/xhtml\n\n# foo.fr.var:\nURI: foo.fr.html\nContent-Encoding: text/html\n\nURI: foo.fr.xhtml\nContent-Encoding: text/xhtml\n\n\nBut that seems silly, since you can vary on all that within the same type-map:\n\n# foo.var:\nURI: foo.en.html\nContent-Language: en\nContent-Type: text/html\n\nURI: foo.en.xhtml\nContent-Language: en\nContent-Type: text/xhtml\n\nURI: foo.fr.html\nContent-Language: fr\nContent-Type: text/html\n\nURI: foo.fr.xhtml\nContent-Language: fr\nContent-Type: text/xhtml"}, {"count": 2, "tags": [], "text": "Thank you.\nIt's said that “Type map files should have the same name as the resource which they are describing”.\nA 1st problem is that the example immediately following show that the two names do differ, since the file name has an extension, but not the resource.\nA 2nd problem is, if I understand well, that type map files \"should\" not but HAVE TO have that name.\nA 3rd problem is that mixing the plural with the singular in this sentence, though grammatically correct, leads to 2 possible interpretations if read quickly or by a non native speaker like me, one interpretation being that several type map fileS ARE describing THE resourcE.\nA 4th problem is that it's obvious for you that the type map file should be placed where most other resource file would, but it's not written and it's not obvious. Please take into account that most people are familiar with the notion of file and unfamiliar, if not completely new, to notion of resource, so that things which can become obvious after a few minutes of thinking are not at first reading for us. Moreover readers can, like me, be discovering how a web server works. My former experience of maths teacher in high school is that \"obvious\" things are not obvious at all for pupils, even for those with a good brain, specially when there are several new things in one lesson.\n\nI suggest to replace\n“Type map files should have the same name as the resource which they are describing, and have an entry for each available variant;”\nby\n“The type map of a given resource must have the same name as the resource it describes, followed by the extension \".var\", and must be placed in the directory indicated by the URI of that resource. For instance, for a ressource of URI http://example.com/bar/dir/foo , the type map file must be bar/dir/foo.var inside the file hierarchy pointed to by http://example.com . The type map must have an entry for each available variant;”", "is_private": false, "id": 144624, "creator": "mongolie2006-apache@yahoo.fr", "time": "2011-03-01T10:00:52Z", "bug_id": 50730, "creation_time": "2011-03-01T10:00:52Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "I've added some clarifications in r1149174, in trunk. If I get a chance, I'll put these changes in the 2.2 docs as well. Thanks for the suggestions.", "attachment_id": null, "id": 148064, "creator": "rbowen@apache.org", "time": "2011-07-21T13:45:01Z", "bug_id": 50730, "creation_time": "2011-07-21T13:45:01Z", "is_private": false}]