[{"count": 0, "tags": [], "creator": "brandond@alum.mit.edu", "attachment_id": 26633, "text": "Created attachment 26633\nPatch for this issue vs. 6_0_29.\n\nI would like to configure JNDIRealm to authenticate to an Active Directory server using userPattern=DOMAIN\\{0}. Active Directory will accept this username in bind requests, however context.getAttributes(...) will fail if that name is used. JNDIRealm makes a request for user attributes before logging in, even when there are no user attributes to request. As a result, the above configuration fails with an InvalidNameException:\n\njavax.naming.InvalidNameException: DOMAIN\\username: [LDAP: error code 34 -\n0000208F: LdapErr: DSID-0C090654, comment: Error processing name, data 0,\nvece ]; remaining name 'DOMAIN\\username\n\nI have a patch for this (against 6.0.29) that I will attach. The patch fixes the issue for my specific case (bind mode, no roles), but it seems like there is a more fundamental problem in accessing the user's attributes before the user is even authenticated. This makes sense if it is configured for password comparison mode, but for bind mode it seems unnecessary until the user's password is validated. If only there were a way to get the DN of the authenticated user (not just the name that was used to authenticate), then it would be straightforward to fix this to query for roles after auth. I could not find such an API. I would be happy to write that patch if someone can point me in the right direction on that API.\n\nMore discussion on this issue from the tomcat-users list:\n\nhttp://mail-archives.apache.org/mod_mbox/tomcat-users/201102.mbox/%3CAANLkTinTS3qBx5Wb6jLXCzozv+wTXQ9XwtJHN0O=FAXn@mail.gmail.com%3E", "id": 144141, "time": "2011-02-10T12:11:43Z", "bug_id": 50751, "creation_time": "2011-02-10T12:11:43Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50751, "is_private": false, "text": "I applied a slightly different patch for this issue that acheives the same results. Note that the JNDI realm assumes that anonymous access is allowed in some cumstances.\n\nFixed in 7.0.x for 7.0.9 onwards.\n\nProposed for 6.0.x.", "id": 144193, "time": "2011-02-11T09:52:51Z", "creator": "markt@apache.org", "creation_time": "2011-02-11T09:52:51Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 145674, "time": "2011-04-10T07:02:59Z", "bug_id": 50751, "creation_time": "2011-04-10T07:02:59Z", "is_private": false, "text": "Fixed in 6.0.x and will be included in 6.0.33 onwards."}]