[{"count": 0, "tags": [], "text": "Created attachment 26637\nfile needed to reproduce the problem\n\nPutting indexed images (PDFs and GIFs) result in crash of Adobe Reader on Macs when attempting to print the document. Viewing it is fine, its only when you try to print it then it crashes. Using Preview on mac is fine for both viewing and printing. Adobe Reader on other platforms works normally with same files. I don't know whether its Adobe Readers fault of FOP's problem, I just want to put out there. It's reliably reproducible and it results in crash every time. I would rather have it fixed by FOP team so I could update FOP on server and fix issue for all my Mac customers.\n\nAs soon as images are replaced by a non indexed images Adobe Reader stops crashing. As the results the PDFs are larger in size.\n\nSee below for FO and image files to reproduce the issue. No custom config.", "attachment_id": 26637, "id": 144166, "creation_time": "2011-02-10T19:25:36Z", "time": "2011-02-10T19:25:36Z", "creator": "mike.starov@gmail.com", "bug_id": 50760, "is_private": false}, {"count": 1, "tags": [], "bug_id": 50760, "is_private": false, "text": "\nConfirmed. I am also on Mac, and can reproduce the issue with Adobe Reader X. Trying to send one of the attached PDFs to the printer results in an application crash.\n\nI am unfortunately no expert on images in PDF, so cannot say if we can do something about it from the FOP end.\n\nAnyone?", "id": 144203, "time": "2011-02-11T11:51:42Z", "creator": "adelmelle@apache.org", "creation_time": "2011-02-11T11:51:42Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "gadams@apache.org", "text": "resetting P2 open bugs to P3 pending further review", "id": 157534, "time": "2012-04-07T01:44:19Z", "bug_id": 50760, "creation_time": "2012-04-07T01:44:19Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 157719, "time": "2012-04-09T01:05:15Z", "bug_id": 50760, "creation_time": "2012-04-09T01:05:15Z", "text": "i am unable to reproduce this with Adobe Reader 9.5.0, Preview 5.0.3;\n\nthere is also no problem with loading PDFs using the itext RUPS utility (com.itextpdf.rups.Rups);\n\nhowever, i can confirm the problem is still present with Adobe Reader 10.1.2;\n\ni'm moving this to resolved+wontfix, and recommend that someone report a bug to Adobe; if someone wishes to investigate this in FOP and can identify an FOP issue (and fix) that is triggering this Adobe bug, then it can be reopened to perform the fix;\n\ni did the above tests on Mac OS X 10.6.8"}, {"count": 4, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 158585, "time": "2012-04-30T00:15:06Z", "bug_id": 50760, "creation_time": "2012-04-30T00:15:06Z", "text": "batch transition resolved+wontfix to closed+wontfix"}, {"count": 5, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "is_private": false, "id": 158630, "time": "2012-04-30T00:17:26Z", "bug_id": 50760, "creation_time": "2012-04-30T00:17:26Z", "text": "batch transition resolved+wontfix to closed+wontfix; if you believe this remains a bug and can demonstrate it with appropriate input FO file and output PDF file (as applicable), then you may reopen"}]