[{"count": 0, "tags": [], "bug_id": 50774, "text": "In r1070179, bug 15868 (some HTTP methods MUST cause a cache to invalidate entities) is fixed. This led to discussion in httpd-dev that these non-GET methods should invalidate cache only if 2xx is in response: <http://mail-archives.apache.org/mod_mbox/httpd-dev/201102.mbox/%3C5E44EE80-76CD-4743-B57E-AF90FF0F97EC@gbiv.com%3E>. This doesn't consider a very important use of this invalidation ability.\n\nAs described in bug 43826, ability to invalidate cache have many benefits for web applications. It allows these web applications to server pages with very long cache age and when content changes, to invalidate all the affected URLs. A simple example is when a page in CMS is edited, it can just be invalidated and so everyone can see the change immediately.\n\nThis bug is about assuring that there's a way for web application to invalidate cache for all URLs it pleases without actually invoking the web application. For example, in a PHP-based system, without ever reaching PHP interpreter.\n\nExample implementation is new content handler for just invalidating cache for request URL and return nothing. RewriteRule can use that content handler. All the security guards will be in RewriteCond. Before invalidating, RewriteRule can transform the URL in its final form for invalidating, e.g. http://example.com/invalidator/page123 to invalidate http://example.com/page123.", "id": 144270, "time": "2011-02-14T15:04:03Z", "creator": "ogi@tower.3.bg", "creation_time": "2011-02-14T15:04:03Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "ogi@tower.3.bg", "text": "Good content handler name is \"cache-invalidate\".\n\nThere should be a way for invalidating many cache entries at once and the easiest is an ability to invalidate all cache entries \"below\" request URI with \"cache-invalidate-prefix\" content handler.", "id": 144370, "time": "2011-02-17T01:33:28Z", "bug_id": 50774, "creation_time": "2011-02-17T01:33:28Z", "is_private": false, "attachment_id": null}]