[{"count": 0, "tags": [], "creator": "jboynes@apache.org", "text": "If a ServletRequestListener is defined, when is invoked after a call to AsyncContext#dispatch() the DispatcherType returned from the ServletRequest is REQUEST rather than ASYNC. When the actual servlet is invoked, the type is correctly set to ASYNC.\n\nIf the listener is intended to be invoked for each dispatch, then the DispatcherType should match the value returned in the filter/servlet.", "id": 144334, "time": "2011-02-15T22:47:30Z", "bug_id": 50793, "creation_time": "2011-02-15T22:47:30Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "jboynes@apache.org", "attachment_id": 26663, "text": "Created attachment 26663\nexample using listener added to examples", "id": 144335, "time": "2011-02-15T22:48:16Z", "bug_id": 50793, "creation_time": "2011-02-15T22:48:16Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jboynes@apache.org", "attachment_id": null, "text": "Although invoking the listener on every dispatch strictly matches the Javadoc that says \"A ServletRequest is defined as coming into scope of a web application when it is about to enter the first servlet or filter of the web application, and as going out of scope as it exits the last servlet or the first filter in the chain.\"\n\nHowever, that is the same definition as used before async support was added. The methods on the listener (requestInitialized/requestDestroyed) make it sound like the event should occur at the start and end of the request lifetime.", "id": 144336, "time": "2011-02-15T22:53:39Z", "bug_id": 50793, "creation_time": "2011-02-15T22:53:39Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "That was fun. It is always the simple looking bugs that are tricky to fix.\n\nI agree that these events should be fired once per request. There was already some code trying to ensure that this was the case but it was ineffective.\n\nI have fixed the problem and expanded the async test cases to cover this issue.\n\nThe fix is in trunk and will be in 7.0.9 onwards.", "id": 144362, "time": "2011-02-16T12:37:49Z", "bug_id": 50793, "creation_time": "2011-02-16T12:37:49Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 50793, "is_private": false, "text": "Thanks", "id": 144368, "time": "2011-02-16T22:37:16Z", "creator": "jboynes@apache.org", "creation_time": "2011-02-16T22:37:16Z", "attachment_id": null}]