[{"count": 0, "tags": [], "text": "Created attachment 26675\ntest application to reproduce. extract, deploy the war, make a query to root URL, see the system-out for evidence of standard-deviating behavior\n\nHi!\n\nI'm writing you from ZeroTurnaround and we are currently building JRebel integration with new containers aiming to implement the servlet3 standard. I've stumbled on a bug in your implementation that is actually at the very core of the servlet standard and thus quite important, and actually a major issue for our integration.\n\nNamely, i'm copy-pasting you a fragment of the reference javadoc of the servlet3 spec for the method ServletContext#getResourcePaths():\n\n============= SPEC START =================\n\nFor example, for a web application containing:\n\n   /welcome.html\n   /catalog/index.html\n   /catalog/products.html\n   /catalog/offers/books.html\n   /catalog/offers/music.html\n   /customer/login.jsp\n   /WEB-INF/web.xml\n   /WEB-INF/classes/com.acme.OrderServlet.class\n   /WEB-INF/lib/catalog.jar!/META-INF/resources/catalog/moreOffers/books.html\n \n\ngetResourcePaths(\"/\") would return {\"/welcome.html\", \"/catalog/\", \"/customer/\", \"/WEB-INF/\"}, and getResourcePaths(\"/catalog/\") would return {\"/catalog/index.html\", \"/catalog/products.html\", \"/catalog/offers/\", \"/catalog/moreOffers/\"}. \n\n============= SPEC END =================\n\n\nNow run my test-application, you'll discover immediately that Tomcat doesn't respect that standard. getResourcesPath(\"/catalog\") would not return \"/catalog/moreOffers\" if there were 2 embedded jars containing web-fragments. And even more importantly, had there been a new folder coming solely from a jar's META-INF/resources, this wouldn't get listed with getResourcePaths(\"/\").\n\nPlease note that these are important issues! Many frameworks rely on various scanning techniques for recursive resource lookup, and so forth.\n\nI've tested this thing with Tomcat 7.0.6 and 7.0.8, problems are present with both.\n\n(Btw, we've received information about the same problems from users of latest glassfish version as well.. i think they are just re-using this part of tomcat and thus getting the same problems... not sure.)\n\nThanks a lot if you can have a look at this!", "attachment_id": 26675, "id": 144382, "creator": "sander.sonajalg@gmail.com", "time": "2011-02-17T13:20:33Z", "bug_id": 50802, "creation_time": "2011-02-17T13:20:33Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50802, "attachment_id": null, "id": 144383, "time": "2011-02-17T13:25:14Z", "creator": "sander.sonajalg@gmail.com", "creation_time": "2011-02-17T13:25:14Z", "is_private": false, "text": "Mm, i forgot to mention: the static resource serving itself is working okay. If you make queries to URLs \"/webstart/test1.txt\" and \"/webstart/test2.txt\" they are okay. Only the getResourcePaths() implementation is faulty.\n\nI know I'm now violating the \"one-bug-per-report\" rule and you can just ignore this if that's important or whatever, but I've also noticed that when I map my servlet to the root URL in web.xml, all the requests (to WHATEVER urls) are being made against my servlet now, making the DefaultServlet never apply, and thus making my static resources unreachable. Just mentioning.. I haven't read the spec on this, but this behavior doesn't make too much sense for me. :)"}, {"count": 2, "tags": [], "text": "(In reply to comment #1)\n> I know I'm now violating the \"one-bug-per-report\" rule and you can just ignore\n> this if that's important or whatever, but I've also noticed that when I map my\n> servlet to the root URL in web.xml, all the requests (to WHATEVER urls) are\n> being made against my servlet now, making the DefaultServlet never apply, and\n> thus making my static resources unreachable. Just mentioning.. I haven't read\n> the spec on this, but this behavior doesn't make too much sense for me. :)\n\nYep. That is as per the spec. Please use the users mailing list if you have any further questions on this and keep this issue for the original problem.", "is_private": false, "id": 144384, "creator": "markt@apache.org", "time": "2011-02-17T13:28:23Z", "bug_id": 50802, "creation_time": "2011-02-17T13:28:23Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 50802, "attachment_id": null, "id": 144389, "time": "2011-02-17T15:38:56Z", "creator": "markt@apache.org", "creation_time": "2011-02-17T15:38:56Z", "is_private": false, "text": "Thanks for the test case.\n\nThis issue has been fixed in trunk and will be in 7.0.9 onwards."}]