[{"count": 0, "tags": [], "bug_id": 50838, "attachment_id": null, "id": 144600, "creation_time": "2011-02-27T09:42:39Z", "time": "2011-02-27T09:42:39Z", "creator": "scott.hamilton@plateau.com", "text": "Prior to TC7.x, one could in their development environment use an exploded deployment model for their java and web projects such that taglib library projects that included TLD files in their classpath:META-INF folder would be expanded into the WEB-INF/classes folder for testing on the servlet container.\n\nIn TC6 this worked because TC6 scanned this location along with the other supported locations.\n\nIn TC7, stricter compliance to the JSP spec required TC to NOT scan this location.\n\nThis enhancement request proposes to add a configuration option (in context.xml?) to allow WEB-INF/classes to also be scanned as an exploded JAR.\n\nThe present workaround suggested by Mark Thomas works fine but requires one to write additional code to customize Tomcat's behavior: write a JarScanner implementation extending the default.", "is_private": false}, {"count": 1, "tags": [], "text": "The JAR scanning in Tomcat 7 also supports scanning for web fragments. It isn't going to be possible for IDEs to expand web fragments into WEB-INF/classes since the web-fragment.xml files would over-write each other. Therefore IDEs are going to have to find an alternative solution for this.\n\nI took a look at adding this extension to Tomcat 7 but hit a few issues. Since you have a working solution for your case, the general case is looking problematic and the general solution will always fail anyway for web fragments I don't think this is worth pursuing.", "is_private": false, "bug_id": 50838, "id": 145030, "time": "2011-03-16T08:17:18Z", "creator": "markt@apache.org", "creation_time": "2011-03-16T08:17:18Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Thanks for taking a look, and I understand the issue you're running into.  As long as Tomcat allows a configurable JarScanner I think we've got a viable work-around.", "attachment_id": null, "bug_id": 50838, "id": 145031, "time": "2011-03-16T08:25:05Z", "creator": "scott.hamilton@plateau.com", "creation_time": "2011-03-16T08:25:05Z", "is_private": false}]