[{"count": 0, "tags": [], "bug_id": 50831, "text": "Created attachment 26694\nReplacement for jsp/security/protected/index.jsp\n\nWhen linking to a protected resource with anchor specified in the URL using Form Authentication, tomcat directs to the login page (correct) and upon successful authentication, directs to the original request but strips off the anchor.\n\nExample:\n1- Copy altered attached index.jsp into examples/jsp/security/protected (replace index.jsp).\n\n2- Link to the JSP with an anchor:\nhttp://localhost/examples/jsp/security/protected/index.jsp#sectc\n\n3- Note you will be correctly linked to the login JSP. Authenticate with both/tomcat.\n\n4- Upon successful authentication, you are directed to the index page, but it doesn't follow the anchor. Look at the URL in the address bar and you'll see that the anchor was stripped off by Tomcat.\n\n5- Re-paste the original URL from #2 above, and notice that the anchor is valid and works.\n\nTested in Tomcat 5.5.29 and 6.0.29. Tested with Chrome and Firefox.\n\nThe attached index.jsp has three different anchor points and long sections of junk between them so you can easily see when the page retains the anchor and when it doesn't.\n\nSince Tomcat handles all the j_security_check stuff internally, I can't find a work-around that will let me get the original requested URL with the anchor.", "id": 144538, "attachment_id": 26694, "creator": "mbatchelor@pentaho.com", "creation_time": "2011-02-25T11:33:20Z", "time": "2011-02-25T11:33:20Z", "is_private": false}, {"count": 1, "tags": [], "creator": "mbatchelor@pentaho.com", "is_private": false, "text": "Further looking with tracing tools indicates that the anchor is never actually sent to the server. So there's no way for the server (Tomcat) to store it in the SavedRequest object without it being sent to the server.\n\nThere really isn't a work-around that I can see at this point. Since the server processes the j_security_check, and the redirect rightly goes to the login page, by the time it lands there, the anchor bit is completely lost.\n\nGiven all this, it's safe to close this. My only recourse in my current application is to rewrite handling to not use anchors.", "id": 144544, "time": "2011-02-25T14:21:31Z", "bug_id": 50831, "creation_time": "2011-02-25T14:21:31Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 50831, "text": "> Further looking with tracing tools indicates that the anchor is never actually\n> sent to the server.\n\nYes, this is how it works. It has nothing to do with Tomcat. Thus I am closing this as INVALID.\n\nJust a note: Servlet 3.0 spec (implemented by Tomcat 7.0.+) allows to perform login() programmatically. Maybe that will help you.  Also using BASIC or DIGEST auth methods won't suffer from this issue.\n\nIf you want to discuss this further, please use the users@ mailing list.", "id": 144546, "attachment_id": null, "creator": "knst.kolinko@gmail.com", "creation_time": "2011-02-25T14:30:07Z", "time": "2011-02-25T14:30:07Z", "is_private": false}]