[{"count": 0, "tags": [], "creator": "d_tagliabue2@yahoo.it", "text": "Created attachment 26728\noriginal Excel 2007 file and POI output file\n\nI created a .xlsx file contaning an Excel 2007 table in the first sheet.\nThen, using POI, I opened it a created a new sheet with:\nwb.createSheet(\"ARC\")\nwb.setSheetOrder(\"ARC\", 0)\nThe resulting Excel file seems to be corrupted. Not only the table (now in the second sheet) is \"read-only\", but deleting the first sheet (\"test\") also the sheet with the table is deleted.\nThis bug is related only to XSSF (with .xls files and HSSF no problems).", "id": 144721, "time": "2011-03-04T03:50:41Z", "bug_id": 50867, "creation_time": "2011-03-04T03:50:41Z", "is_private": false, "attachment_id": 26728}, {"count": 1, "tags": [], "bug_id": 50867, "attachment_id": null, "is_private": false, "id": 144745, "time": "2011-03-04T12:35:12Z", "creator": "apache@gagravarr.org", "creation_time": "2011-03-04T12:35:12Z", "text": "Bad news - I can't see anything wrong with what POI is doing\n\nI've looked at the POI output xlsx file, and all the relationships and links look just fine to me. I've added a unit test in r1078065 which loads the original file, checks it, adds the new sheet and re-orders, checks, saves + reloads, and checks. All passes just fine.\n\nIncidentally, OpenOffice has no problems opening the POI saved file, and the table is writable. Unfortunately, that either means you've hit an Excel bug, or you've found an area where Excel is much stricter than it needs to be (and also stricter than POI + OpenOffice are)\n\nWhat I'd suggest you do is firstly try a different version of excel, in case it is an excel bug. Failing that, perform the same action in excel as you did in poi, and see if you can identify (by unzipping and comparing the xml) what excel does differently"}, {"count": 2, "tags": [], "creator": "d_tagliabue2@yahoo.it", "text": "(In reply to comment #1)\n> Bad news - I can't see anything wrong with what POI is doing\n> I've looked at the POI output xlsx file, and all the relationships and links\n> look just fine to me. I've added a unit test in r1078065 which loads the\n> original file, checks it, adds the new sheet and re-orders, checks, saves +\n> reloads, and checks. All passes just fine.\n> Incidentally, OpenOffice has no problems opening the POI saved file, and the\n> table is writable. Unfortunately, that either means you've hit an Excel bug, or\n> you've found an area where Excel is much stricter than it needs to be (and also\n> stricter than POI + OpenOffice are)\n> What I'd suggest you do is firstly try a different version of excel, in case it\n> is an excel bug. Failing that, perform the same action in excel as you did in\n> poi, and see if you can identify (by unzipping and comparing the xml) what\n> excel does differently\n\nHi Nick, I tested the workbook created with POI on different Excel 2007 installations and as a matter of fact sometimes the bug happens and sometimes does not. I found that the problem is that more than one sheet are selected by default when the workbook is opened (and this prevents updating the table).\nThe simple workaround I found is to use:\n\nworkBook.getSheetAt(j).setSelected(false);\n\non ALL sheets in the workBook. This solves the problem (so I think the bug can be closed). Thanks!", "id": 144815, "time": "2011-03-08T02:27:09Z", "bug_id": 50867, "creation_time": "2011-03-08T02:27:09Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 50867, "text": "I could not reproduce this any more in a quick test with the latest version 3.13-dev, I think we had some fixes related to the default selected sheet during moving/re-ordering so I assume this is fixed since some time, please re-test this with a recent nightly build and reopen this if you still see this problem.", "id": 184717, "attachment_id": null, "creator": "dominik.stadler@gmx.at", "creation_time": "2015-08-23T19:26:23Z", "time": "2015-08-23T19:26:23Z", "is_private": false}]