[{"count": 0, "tags": [], "creator": "evgenyg@gmail.com", "attachment_id": null, "text": "Please, see this thread - http://goo.gl/F4F7M. When Tomcat starts as a service \"startup.bat\" or \"catalina.bat\" are not running and if any custom code is put there it is not invoked as well.\n\nIt would be very convenient to have \"onStartup.bat/sh\" and \"onShutdown.bat/sh\" scripts that are *always* invoked, regardless of how Tomcat was started or shut down. This will allow to add any custom listeners without writing new code or adding new Tomcat applications just for that purpose.", "id": 144826, "time": "2011-03-08T09:13:58Z", "bug_id": 50890, "creation_time": "2011-03-08T09:13:58Z", "is_private": false}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "(In reply to comment #0)\n\n1) The service wrapper used by Tomcat is not a part of Tomcat project. We are using the one provided by the Daemon project of Apache Commons (jsvc on Unix, procrun on Windows). This enhancement proposal should be reported there,\n\nhttp://commons.apache.org/daemon/\nhttps://issues.apache.org/jira/browse/DAEMON\n\n\n2) Tomcat, per se, has support for LifecycleListener classes in various places of its configuration.\n\nImplementing a listener that calls an external program should not be hard (though has its tricks, see CGIServlet for an example).\n\nCalling a script file (through JSR 223 support for scripting languages) might be even more easier.\n\nI suppose that this is a rare requirement though.\n\n> \"onStartup.bat/sh\" and \"onShutdown.bat/sh\"\n\nI should note, that there are time limits on shutdown process, and there might be different reasons why Tomcat shuts down. I would not expect that calling anything external during shutdown would work reliably.", "id": 144837, "time": "2011-03-08T15:51:01Z", "bug_id": 50890, "creation_time": "2011-03-08T15:51:01Z", "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I don't see the need for this. External scripts can call Tomcat scripts and/or start a service as desired.", "id": 144971, "time": "2011-03-13T14:20:03Z", "bug_id": 50890, "creation_time": "2011-03-13T14:20:03Z", "is_private": false}]