[{"count": 0, "tags": [], "bug_id": 50939, "text": "Created attachment 26779\nthe smallest file i could manage to show the problem.\n\nHello,\n\ni have another case of record format exception. i am aware that similar issues have been reported, and that one has been fixed in 3.8.1 beta, but mine is still there with that version.\n\n1. the evidence:\n=============\n1.1 the file\n--------------\ni have tried to boil my file down to the absolute minimum, and here it is:\n\n\n1.2 my code (fragment)\n--------------------------\nmy code that tries to read this is as simple as \n       private static HSSFWorkbook readFile(String filename) throws IOException {\n                mfis = new FileInputStream(filename);\n                HSSFWorkbook wb = null;\n61              try {\n62                      wb = new HSSFWorkbook(mfis);\n63              } catch ( IOException ioe ) {\n                        // blah\n                } catch(RecordFormatException rfe){\n                        // blahblah\n                }\n                return wb;\n        }\n\n1.3 the stack trace\n----------------------\nthe stack trace is ( copied from eclipse console)\norg.apache.poi.hssf.record.RecordFormatException: Unable to construct record instance\n        at org.apache.poi.hssf.record.RecordFactory$ReflectionConstructorRecordCreator.create(RecordFactory.java:65)\n        at org.apache.poi.hssf.record.RecordFactory.createSingleRecord(RecordFactory.java:300)\n        at org.apache.poi.hssf.record.RecordFactoryInputStream.readNextRecord(RecordFactoryInputStream.java:270)\n        at org.apache.poi.hssf.record.RecordFactoryInputStream.nextRecord(RecordFactoryInputStream.java:236)\n        at org.apache.poi.hssf.record.RecordFactory.createRecords(RecordFactory.java:442)\n        at org.apache.poi.hssf.usermodel.HSSFWorkbook.<init>(HSSFWorkbook.java:298)\n        at org.apache.poi.hssf.usermodel.HSSFWorkbook.<init>(HSSFWorkbook.java:260)\n        at org.apache.poi.hssf.usermodel.HSSFWorkbook.<init>(HSSFWorkbook.java:204)\n        at org.apache.poi.hssf.usermodel.HSSFWorkbook.<init>(HSSFWorkbook.java:340)\n        at org.apache.poi.hssf.usermodel.HSSFWorkbook.<init>(HSSFWorkbook.java:321)\n        at org.panda.giggling.in.ChecklistTransformer.readFile(ChecklistTransformer.java:62)\n        at org.panda.giggling.in.ChecklistTransformer.readAndTransform(ChecklistTransformer.java:159)\n        at org.panda.giggling.Main.extractChecklistsFromFiles(Main.java:339)\n        at org.panda.giggling.Main.main(Main.java:113)\nCaused by: org.apache.poi.hssf.record.RecordFormatException: Not enough data (0) to read requested (6) bytes\n        at org.apache.poi.hssf.record.RecordInputStream.checkRecordPosition(RecordInputStream.java:216)\n        at org.apache.poi.hssf.record.RecordInputStream.readFully(RecordInputStream.java:288)\n        at org.apache.poi.hssf.record.RecordInputStream.readFully(RecordInputStream.java:284)\n        at org.apache.poi.hssf.record.chart.ChartEndObjectRecord.<init>(ChartEndObjectRecord.java:44)\n        at sun.reflect.NativeConstructorAccessorImpl.newInstance0(Native Method)\n        at sun.reflect.NativeConstructorAccessorImpl.newInstance(NativeConstructorAccessorImpl.java:39)\n        at sun.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:27)\n        at java.lang.reflect.Constructor.newInstance(Constructor.java:513)\n        at org.apache.poi.hssf.record.RecordFactory$ReflectionConstructorRecordCreator.create(RecordFactory.java:57)\n        ... 13 more\n\nnote: i couldn't persuade eclipse to show the 13 more ( is there a trick to this? please tell me )\n\n2. circumstantial notes\n=====================\n2.-1 i first observed this using poi 3.7 around december. now i discovered 3.8.1beta and tried again. no discernible difference. the above stack trace is against 3.8.1 beta \n(unless i screwed up, which is at least possible if not likely).\n2.0 the recently solved issue was about requesting 2 bytes and getting only one ( i think). my numbers are different so maybe this _is_ a different issue \n2.1  my code runs on a win xt box at work. the same problem can however be observed on my home mac.\n2.2 the file was generated using excel 2003.\n2.3 i tried eliminating that embedded graphic on \"Sheet 2\", and the crash went away\n2.4 one apparent workaround is to take this file to a mac, open it with neo_office, write a blank in an otherwise empty cell, save, remove the blank and save again, and done. the same exorcism does not work using OpenOffice (or indeed Excel2003) on that same win box that held the original file. All cited programs read the file without apparent effort.\n2.5 there are other files, similar in structure, but different in content details that are read (by that same code snippet of mine) without problem. in particular, those files also contain embedded graphics like on \"sheet3\". all these files were forked off the same template some 6 years ago  but have seen profuse editing since. research into the recent change history of the original (non-stripped) file revealed no obvious reasons for suspicion. ( if \"sheet 2\" still held the orig data, \"sheet3\" would show bar graphs presenting some aspect of those data. i earnestly believe you don't need to know more. ) \n2.6 i read in some tickets about BiffViewer analysis. I hope i can be excused for not managing to get ahold of BiffViewer (where is it? how is it run? i'm getting too old for this sort of thing...). I found other purported BiffViewers on the web and tried to look at a working file vs this nonworking file (in the pre-reduced state) but could make no sense of what i saw there.\n2.7 and finally, i looked at the same working and the non-working file (as in 2.6) using notepad++ (Plugins > Compare) and found one potential strangeness: the working file sported a line (near the end) of VersionCompatible32=\"393222000\", where the nonworking file said  VersionCompatible32=\"393B\".\nThe long number is all but ubiquitous according to google, the short number was a zero-hit search. A search in an alleged file format spec for ms excel showed no evidence of the term VersionCompatible so this dead-ended, too.\n\ni'd appreciate developer's comments on whether this is indeed a bug and not some rudeness on the part of my own code, please.\nmany thanks,\nmats.", "id": 145042, "time": "2011-03-17T03:05:06Z", "creator": "MatsWolpers@gmail.com", "creation_time": "2011-03-17T03:05:06Z", "is_private": false, "attachment_id": 26779}, {"count": 1, "tags": [], "creator": "MatsWolpers@gmail.com", "text": "one answer received from nick:\n\n\nOn Wed, 16 Mar 2011, Matthias Wolpers wrote:\n1.3 the stack trace\n----------------------\n      at org.apache.poi.hssf.record.chart.ChartEndObjectRecord.<init>(ChartEndObjectRecord.java:44)\n\nThis is the bit that matters. There's a problem with creating one of the chart records for your file\n\nIn theory, the record should be padded with 6 bytes at the end, but it looks like in your case it isn't. Can you share the problem file so we can look into it?\n\nAlso, if you fancy checking the Microsoft docs on this record (it'll be in the [MS-XLS].pdf file, look it up by the sid of 0x0855) and see what they say about the contents of the record, that'd be handy.\n\n2.6 i read in some tickets about BiffViewer analysis. I hope i can be excused for not managing to get ahold of BiffViewer (where is it? how is it run? i'm getting too old for this sort of thing...). I found other purported BiffViewers on the web and tried to look at a working file vs this nonworking file (in the pre-reduced state) but could make no sense of what i saw there.\n\nIt's included in the main POI jar. The class is org.apache.poi.hssf.dev.BiffViewer, and it has a main method - just call it with the name of the file to be analyzed\n\nNick", "id": 145043, "time": "2011-03-17T03:06:04Z", "bug_id": 50939, "creation_time": "2011-03-17T03:06:04Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 50939, "text": "re MS spec: is this the info you wanted?\n\nquote Excel97-2007BinaryFileFormat(xls)Specification.pdf, page 343f:\n\nENDOBJECT: Chart Future Record Type End Object (855h)\nIntroduced in Excel 9 (2000), this BIFF record is an FRT record for Charts that indicates the end of an object's scope for Excel 9 and later objects.\nRecord Data\nOffset\tField Name\tSize      Contents\n4              rt                     2\t     Record type; this matches the BIFF rt in the first two \n                                                     bytes of the record; =0855h\n6             grbitFrt             2          FRT flags; must be zero\n8\t       iObjectKin\t        2\t    Sanity check for object scope being ended\n              d\n10\t      (unused)\t        6\t    Reserved; must be zero\n\n(continues with CATLAB: Category Labels (856h))\n\nif it isn't, i'm stuck, for \"sid\" appears only as substring of words such as \"inside\" or \"consider\".", "id": 145044, "time": "2011-03-17T03:35:18Z", "creator": "MatsWolpers@gmail.com", "creation_time": "2011-03-17T03:35:18Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "apache@gagravarr.org", "text": "(In reply to comment #2)\n> re MS spec: is this the info you wanted?\n\nYup\n\n> 10          (unused)            6        Reserved; must be zero\n\nThis tells us that microsoft does expect there to be the 6 trailing bytes in the record. The stack trace you provided tells us that in your file those 6 bytes aren't there...\n\nDo you know how the file was produced?", "id": 145048, "time": "2011-03-17T06:11:19Z", "bug_id": 50939, "creation_time": "2011-03-17T06:11:19Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 50939, "attachment_id": null, "text": "How was that file produced?\n\n1. Cannot be too sure: as i explained in section 2.5, the file's history is long and difficult to track given the fluctuation we've seen in file handling staff. Obviously, nobody left a check-in tag saying : incidentally, i ate them 6 reserve bytes.\n\n2.1 of the former editors, those that are still available for questioning remember nothing noteworthy. As far as can be told now, this file has never been subjected to anything other than treatment by Excel 2003.\n2.2 the template the file was made from is still available, and it is sound in the sense that if i re-create the file with today's content straight from the template, the resulting file can be opened through POI without throwing RFEs. In other words, something happened along the road, but it is impossible to say what with any certainty.\n\n3. One potential source of strangeness is the fact that for a while this file was in the hands of another group who confessed to using the \"Extras > Arbeitsmappe freigeben\" feature ( apologies: my excel speaks German, if i translate this roughly into \"Extras > Share workbook\", would that be recognizable? ). These people not only did part of their work in a different LAN (imagine: different building on another campus), they carried computers from the one LAN to the other with the file open but the machine in sleep mode, or similar. To my untrained eye ( i haven't studied this feature, my toe nails curl up at the very thought...) , this is a potential source of trouble.\nA trivial \"2 users hit the same file on some shared drive\" test failed to reproduce my original  symptom.\n(please understand i'm stealing this research from company time, and their patience will only stretch that far.)\n\nWe found one other file that exhibits the same behaviour (want 6, receive 0, throw), and that second file had also been with that other group, which is all the corroboration i can offer. Inconclusive, of course.\n\n4. This probably is a silly question, but bear with me, please: is there anything that my code could do to manipulate the file without actually opening it? If i could get at its content  at all, life might become easy: delete the sheets i don't need (losing the offending data) and proceed. piece of cake.\n\n5. I still wonder why/how all those office programs handle this file so gracefully: they wouldn't just add the missing 6 bytes of prescribed zero content and proceed, would they? i mean, if even i can think of that, there must be something wrong with the idea. right?", "id": 145067, "time": "2011-03-17T14:23:08Z", "creator": "MatsWolpers@gmail.com", "creation_time": "2011-03-17T14:23:08Z", "is_private": false}, {"count": 5, "tags": [], "creator": "apache@gagravarr.org", "text": "Fixed in r1082936.\n\nI've added code to do what I'm fairly sure Excel must also be doing, which is to add the padding back in if it has gone missing. Thanks for all your help diagnosing this one!", "id": 145085, "time": "2011-03-18T10:31:09Z", "bug_id": 50939, "creation_time": "2011-03-18T10:31:09Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 50939, "attachment_id": 27593, "text": "Created attachment 27593\nThrowing ArrayIndexOutOfBoundsException", "id": 149752, "time": "2011-09-26T09:42:55Z", "creator": "pablo.queixalos@polyspot.com", "creation_time": "2011-09-26T09:42:55Z", "is_private": false}]