[{"count": 0, "tags": [], "creator": "guido.leenders@invantive.com", "attachment_id": null, "text": "I am using Tomcat to deploy a software application. Some customers run Windows and want Tomcat to run servlets.\n\nFor this, we use the installer provided on the site. In two situations, the standard installer does not work well enough:\n\n1. The customer wants two installations on the same server, and therefore needs two services. For instance, one for development/test/acceptance and one for production. This can be achieved but requires manual interaction instead of just next, next, enter something finish.\n2. The customer installs software for Sonicwall, also based on Tomcat. They include the standard installer and just overwrite any current service name for Tomcat 6 or 7.\n\nTo solve these deployment issues, I would like to be able to configure:\n\n* The name and code of the Windows service to be created. For my own installations, I can then use something different of the standard name. That avoids that less intelligent installers hijack the service later, leading to a service request to me.\n* The port for AJP and server. Currently, you can enter the HTTP port. That is very handy when for instance IIS is also running on the same machine. But when two Tomcat instances are running, the AJP and server port in a standard installation must also differ.\n\nI have looked into res\\tomcat.nsi. It seems to be responsible for the creation of the service and files.\n\nIn trunk around line 202 and 306 I see that the service name and display name are currently hardcoded. That would require some form of adaption.\n\nThe additional ports can probably be handled by Function configure.\n\nI also saw that stuff is registered in the registry under SOFTWARE\\Apache Software Foundation\\Tomcat\\@VERSION_MAJOR_MINOR@. That probably would require adaptation too to allow multiple installs without interfering them with each other. I do not know to handle that.\n\nFor the two scenarios, I think I can ask one customer to invest some amount of money, because in the long run it would save him the effort to learn administrator to use tomcat*.exe with options such as //ms.", "id": 145114, "time": "2011-03-20T11:40:49Z", "bug_id": 50949, "creation_time": "2011-03-20T11:40:49Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 50949, "text": "The possibility to have multiple Tomcat installations on the same server without manual interference, just as part of the installation process, would be welcomed much. \nAs result of that it should be possible to give the created windows service a different name and code.\nGoing to follow this issue with interest!", "id": 146166, "time": "2011-05-06T13:51:26Z", "creator": "janvanengelen@live.nl", "creation_time": "2011-05-06T13:51:26Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "This has been fixed in 7.0.x and will be included in 7.0.17 onwards.", "id": 147466, "time": "2011-06-24T16:43:44Z", "bug_id": 50949, "creation_time": "2011-06-24T16:43:44Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "This has been proposed for back-port to 5.5.x and 6.0.x.", "id": 147473, "time": "2011-06-24T18:57:41Z", "bug_id": 50949, "creation_time": "2011-06-24T18:57:41Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 50949, "attachment_id": null, "id": 148550, "time": "2011-08-11T09:40:18Z", "creator": "markt@apache.org", "creation_time": "2011-08-11T09:40:18Z", "is_private": false, "text": "This has been applied to 6.0.x and will be included in 6.0.33 onwards."}, {"count": 5, "tags": [], "bug_id": 50949, "attachment_id": null, "id": 148758, "time": "2011-08-22T15:57:10Z", "creator": "markt@apache.org", "creation_time": "2011-08-22T15:57:10Z", "is_private": false, "text": "This has been fixed in 6.0.x and 5.5.x.\n\nIt is included in 6.0.33 onwards and will be included in 5.5.34 onwards."}, {"count": 6, "tags": [], "bug_id": 50949, "text": "Hi Mark,\n\nfantastic that it even has been backported!\n\nRgds,\n\nGuido Leenders\nInvantive\nhttp://www.invantive.com", "id": 148768, "time": "2011-08-22T17:30:45Z", "creator": "guido.leenders@invantive.com", "creation_time": "2011-08-22T17:30:45Z", "is_private": false, "attachment_id": null}]