[{"count": 0, "tags": [], "creator": "aaron.johnson@soa.com", "attachment_id": 26799, "is_private": false, "id": 145279, "time": "2011-03-25T18:46:50Z", "bug_id": 50975, "creation_time": "2011-03-25T18:46:50Z", "text": "Created attachment 26799\nZip of logs and network traces\n\nWe have a client application making calls through web services that are using Transfer-Encoding: chunked.  This scenario hasn't ever worked possibly due to bug 48940 and bug 48763.  It works fine against a wide variety of other setups (JBoss/WebSphere/WebLogic/Apache/IBM IHS/iPlanet) that don't include the IIS connector.  In the isapi_redirect.properties file I have enable_chunked_encoding=true -- though not sure it matters post 1.2.28.  Here are the symptoms:\n\n1.2.27 (chunked and non chunked versions) - Some POST/T-E=chunked requests work, others fail.\n1.2.28 (chunked and non chunked versions) - Some POST/T-E=chunked requests work, others fail.\n1.2.30 - Read times out on the client waiting for a response\n1.2.31 - Read times out on the client waiting for a response\n\nI'm attributing the failure of 1.2.27/28 on already known/fixed bugs and focusing on the behavior for 1.2.31.\n\nNetwork tracing between both the client and connector and the connector and JBoss 4.3.0 indicate that the client is sending a complete request and that the connector is still waiting for something else from the client, or has received it but isn't sending the chunked content to JBoss.\n\nSpecifically of interest is that the connector is sending:\nREQ:POST /rm/services/ServerInfo.asmx\nBut never sends the chunked content\n\nThe attachment has two sets of files for two scenarios, a WireShark network trace and the isapi_redirect.log.\n\nEnvironment:\nThe client_to_connector scenario was on Windows 7 x64 / IIS 7.5.7600.16385 / isapi_redirect-1.2.31.dll for amd64\n\nThe connector_to_jboss scenario was on Windows Server 2008 x64 / IIS 7.5.7600.16385 / isapi_redirect-1.2.31.dll for amd64"}, {"attachment_id": 26808, "tags": [], "creator": "aaron.johnson@soa.com", "text": "Created attachment 26808\nDon't send content length for chunked content\n\nFrom what I can tell, in the case of chunking, the headers are sent first then the chunked content.  What seems to be happening is that when both Transfer-Encoding=chunked and content-type=nnnn set the connector endpoint never requests the body because it still thinks there is content in the message.  This fix simply removes the content-type field if transfer-encoding=chunked or content > 4GB -- basically just moving the logic around.\n\nI tried to figure out what part of IIS is setting the content-type, but never came to any conclusions.\n\nIs there any way to get a 64-bit built binary to test out these changes for a customer -- I only had the ability to build a 32-bit binary?", "count": 1, "id": 145366, "time": "2011-03-28T18:05:44Z", "bug_id": 50975, "creation_time": "2011-03-28T18:05:44Z", "is_private": false}, {"count": 2, "tags": [], "creator": "aaron.johnson@soa.com", "attachment_id": 26808, "is_private": false, "id": 145367, "time": "2011-03-28T18:07:35Z", "bug_id": 50975, "creation_time": "2011-03-28T18:07:35Z", "text": "Comment on attachment 26808\nDon't send content length for chunked content\n\nI mistakenly referred to content type, when I should have said content-length in the comment above."}, {"count": 3, "text": "Hi Aaron\n\nThanks for the report (and providing in logs and network traces).\n\nLooking at the traces you supplied, it doesn't look like there is a Content-Length in the request from the client -> IIS/connector, so I'm confused by the patch modifying the behaviour when the Content-Length is present in the request.\n\ne.g.:\n\nPOST /rm/services/ServerInfo.asmx HTTP/1.1\nContent-Type: text/xml; charset=utf-8\nSOAPAction: \"http://www.logiclibrary.com/types/getServerSoapVersion\"\nUser-Agent: Axis/1.3\nHost: 192.168.231.61:81\nTransfer-Encoding: chunked\n\nI think there are a few 'quirky' parts in the code around this, but I'd like to be definite on the failing test case before delving in.", "bug_id": 50975, "is_private": false, "id": 145430, "time": "2011-03-31T03:59:11Z", "creator": "timw@apache.org", "creation_time": "2011-03-31T03:59:11Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 50975, "is_private": false, "count": 4, "id": 145436, "time": "2011-03-31T10:10:43Z", "creator": "aaron.johnson@soa.com", "creation_time": "2011-03-31T10:10:43Z", "text": "The problem is that IIS is inserting the content length into the chunked request at some point in its filtering chain.  You are correct the client isn't sending content-length, but when the isapi_redirect.dll connector gets the request it does contain the C-L header.  I think that is what is causing the connector endpoint to hang.  The C-L header is confusing the endpoint because it is waiting for the chunked content because of the C-L header, but the connector is expecting the endpoint to request the chunked content.\n\nI'd suspect that maybe the other connectors would have this bug as well, but it is only IIS putting C-L header on causing both the C-L and C-E=chunked headers to appear on the request.\n\nI was able to test out the patch on 64-bit IIS and it does solve my immediate problem with the POSTs hanging, but I'm not familiar with what the specs say about having both C-L and C-E on the same request."}, {"count": 5, "tags": [], "bug_id": 50975, "attachment_id": null, "is_private": false, "id": 145531, "time": "2011-04-03T19:27:26Z", "creator": "timw@apache.org", "creation_time": "2011-04-03T19:27:26Z", "text": "The HTTP spec is clear on the desired behaviour here:\n\n\"    If a Content-Length header field (section 14.13) is present, its\n     decimal value in OCTETs represents both the entity-length and the\n     transfer-length. The Content-Length header field MUST NOT be sent\n     if these two lengths are different (i.e., if a Transfer-Encoding\n\n     header field is present). If a message is received with both a\n     Transfer-Encoding header field and a Content-Length header field,\n     the latter MUST be ignored.\n\""}, {"count": 6, "text": "*** Bug 48940 has been marked as a duplicate of this bug. ***", "bug_id": 50975, "attachment_id": null, "id": 145688, "time": "2011-04-11T04:17:53Z", "creator": "timw@apache.org", "creation_time": "2011-04-11T04:17:53Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 50975, "is_private": false, "count": 7, "id": 145691, "time": "2011-04-11T05:39:19Z", "creator": "timw@apache.org", "creation_time": "2011-04-11T05:39:19Z", "text": "I've committed a fix similar to the one provided - thanks for providing a patch.\nBug 48940 reported what I think is the same issue, with a similar analysis.\n\nI can't replicate the actual error case in my systems, although the analysis seems fairly conclusive, and the fix implemented is correct wrt interpretation of the HTTP RFC in any case.\nI've verified everything works fine if the Content-Length is (invalidly) included in the original request to IIS - e.g. the header is dropped before forwarding to Tomcat.\n\nFix as implemented will be in 1.2.32.\nIf anyone can reproduce the issue and is able to test, that'd be appreciated."}]