[{"count": 0, "tags": [], "creator": "gogh@rambler.ru", "attachment_id": null, "is_private": false, "id": 145578, "time": "2011-04-06T07:02:47Z", "bug_id": 51030, "creation_time": "2011-04-06T07:02:47Z", "text": "As I understood there is only two mechanisms for CGI killing after colsing connection with client:\n1. Waiting for Timeout seconds and sending CIGTERM to cgi process.\n2. Waiting for SIGPIPE after cgi process trying to write to STDOUT.\n\nThere is no way to terminate long-thinking cgi-process while performing long-term queries to SQL. But there is no reason to wait for query finishing while client no more waiting for cgi response."}, {"count": 1, "tags": [], "bug_id": 51030, "text": "And your proposed new way is ... ?", "id": 145598, "time": "2011-04-06T13:21:34Z", "creator": "wrowe@apache.org", "creation_time": "2011-04-06T13:21:34Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "gogh@rambler.ru", "attachment_id": null, "text": "There is no need to wait until Timeout when connection is already closed. It is worth to send SIGTERM to cgi-process immediately after closing connection with client. Isn't it?", "id": 145601, "time": "2011-04-06T14:29:53Z", "bug_id": 51030, "creation_time": "2011-04-06T14:29:53Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 51030, "attachment_id": null, "id": 145632, "time": "2011-04-08T01:49:10Z", "creator": "wrowe@apache.org", "creation_time": "2011-04-08T01:49:10Z", "is_private": false, "text": "So to summarize, you would suggest;\n\n 1. send SIGTERM immediately\n\n 2. after timeout, send SIGKILL\n\nIs that what you are suggesting?\n\nAs it can be harmful to some applications, I can only foresee this being adopted as a per-dir (per specific <files > match) feature.  Also be aware that httpd may not be aware until httpd attempts to send data that the remote connection is AWOL, so this would be far from a perfect solution"}, {"count": 4, "tags": [], "creator": "gogh@rambler.ru", "attachment_id": null, "is_private": false, "id": 145633, "time": "2011-04-08T05:49:49Z", "bug_id": 51030, "creation_time": "2011-04-08T05:49:49Z", "text": "(In reply to comment #3)\n> So to summarize, you would suggest;\n> \n>  1. send SIGTERM immediately\n> \n>  2. after timeout, send SIGKILL\n> \n> Is that what you are suggesting?\n> \n> As it can be harmful to some applications, I can only foresee this being\n> adopted as a per-dir (per specific <files > match) feature.  Also be aware that\n> httpd may not be aware until httpd attempts to send data that the remote\n> connection is AWOL, so this would be far from a perfect solution\n\nNot exactly... I mean the only situations when you precisely know that client leave (by pressing 'cancel browsing', for example), consequently there is no need to wait untill Timeout (cause nobody waits cgi-script output), and it would be good to inform cgi-script somehow about this to force it stopping some hard job (cause no one need the results of it) or some other finishing. Why not perfect? In opposite it'll be very usefull. Of cause it should be configurable per-dir behaviour."}, {"count": 5, "tags": [], "bug_id": 51030, "attachment_id": null, "id": 145642, "time": "2011-04-08T07:55:08Z", "creator": "jorton@redhat.com", "creation_time": "2011-04-08T07:55:08Z", "is_private": false, "text": "This is not possible without completely redesigning the filter architecture; you need to poll across all of (socket, CGI stdout, CGI stderr) to be able to detect the TCP connnection closure from the client.  i.e. RESOLVED->WONTFIX."}]