[{"attachment_id": 26866, "tags": [], "creator": "kevin.w.wall@gmail.com", "is_private": false, "count": 0, "id": 145627, "time": "2011-04-07T22:34:18Z", "bug_id": 51040, "creation_time": "2011-04-07T22:34:18Z", "text": "Created attachment 26866\nCapture using script and telnet to www.apache.org (text file)\n\nI *think* this is a bug, but it may not be as it may have something\nto do with backward compatibility of HTTP 1.0 or even 0.9. I didn't\ngo back and scruntinze those earlier RFCs.\n\nAt issue is what happens when Apache is sent an apparently malformed HTTP\nrequest consisting of\n\n    GET /\n\ni.e., it is missing 'HTTP/ver#' portion; e.g.,   GET / HTTP/1.0\n\nWhile I understand the philosophy of being \"liberal in what one accepts\"\n(i.e., treat this as if it defaults to 'HTTP/1.0' or maybe HTTP/0.9),\nI do not think it is proper to be liberal in what Apache sends as it's\nresponse.\n\nIf you want to sent this, it should be something like:\n\n    HTTP/1.0 200 OK\n\nas the Status-Line, followed other optional status lines, then\na CRLF, and only THEN followed by the message body.\n\n(Personally, I would prefer that instead of 200 status being returned,\nthat a 400 status be returned to the client, indicating that the\nrequest was malformed and should not be repeated, but that's just\nme. You may have valid reasons for returning a response in such\ncases. I just want a Status-Line returned.)\n\nNote that fact that this scenario described above (the missing Status-Line\nresponse) causes an error in Imperva SecureSphere, a web application\nfirewall. (A similiar scenario has been know to cause Imperva SecureSphere\nto think that the HTTP status response code is '}'. Yeah, it doesn't make\nsense to me either. Obviously a parsing problem of some sort, but we\ntracked its root cause down to the fact that Apache was omitting\nthe Status-Line on bad responses.)\n\nAn example captured from www.apache.org site is attached."}, {"count": 1, "tags": [], "bug_id": 51040, "is_private": false, "id": 145631, "creation_time": "2011-04-08T01:46:42Z", "time": "2011-04-08T01:46:42Z", "creator": "trawick@apache.org", "text": "HTTP 0.9", "attachment_id": null}]