[{"attachment_id": 26995, "tags": [], "bug_id": 51196, "text": "Created attachment 26995\nA patch based on 735dd86ac48481cfe6350d92997514e2aa7dee21 git revision\n\nI need to insert charts in xslx documents, and at the moment (as I can see) POI does not have support for that. So I write a simple patch to simplify chart creation process. I have tried to adopt my changes to existing code (I use git repo on GitHub). At the moment the data model is the following:\n\nXSSFDrawing -- creates -- XSSFChart -- has -- XSSFChartLabel\n                            |\n                        belongs to\n                            |\n                       XSSFGraphicFrame\n\nI have also add a simple test for new functionality. But the more interesting thing is that those changes do the thing: generated xlsx file with scetter chart is attached (low-level client code is still required for that, the next step is to provide appropriate API).\n\nI am not a POI hacker and this is my first patch so any feedback will be helpful.\n\nPOI is a great thing, lets improve it )", "count": 0, "id": 146305, "time": "2011-05-13T11:54:30Z", "creator": "roman.kashitsyn@gmail.com", "creation_time": "2011-05-13T11:54:30Z", "is_private": false}, {"count": 1, "tags": [], "creator": "roman.kashitsyn@gmail.com", "attachment_id": 26996, "text": "Created attachment 26996\nGenerated chart example", "id": 146306, "time": "2011-05-13T11:56:44Z", "bug_id": 51196, "creation_time": "2011-05-13T11:56:44Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 51196, "text": "Created attachment 27004\nA patch based on 735dd86ac48481cfe6350d92997514e2aa7dee21 git revision", "id": 146345, "time": "2011-05-16T07:55:02Z", "creator": "roman.kashitsyn@gmail.com", "creation_time": "2011-05-16T07:55:02Z", "is_private": false, "attachment_id": 27004}, {"count": 3, "tags": [], "bug_id": 51196, "text": "Created attachment 27021\nCumulative patch for scatter chart creation support draft.\n\nThis is only a draft of possible chart implementation. It is only support new chart creation and only one type of chart. Parsing of existing charts not supported yet. It will be implemented soon. Comments and ideas are welcome.", "id": 146401, "time": "2011-05-18T09:27:32Z", "creator": "roman.kashitsyn@gmail.com", "creation_time": "2011-05-18T09:27:32Z", "is_private": false, "attachment_id": 27021}, {"count": 4, "tags": [], "creator": "roman.kashitsyn@gmail.com", "attachment_id": null, "text": "I have also added a draft of example `src/examples/src/org/apache/poi/xssf/usermodel/examples/ScatterChart.java' to demonstrate the api in action (I have not tested it yet, it just compiles, but I have very similar code in my application that works fine). Charts generated with the api open fine in MS Office 2007 and OpenOffice 3.3 (of course, they look much more prettier in ms office).\n\nUnfortunately, I have a problem with `poi-ooxml-schemas-3.8-beta3-TIMESTAMP.jar' file build. When I am trying to run my application with it, I got `java.lang.ClassNotFoundException'. So I am forced to use `ooxml-schemas-1.1.jar' to run my application.", "id": 146403, "time": "2011-05-18T09:54:25Z", "bug_id": 51196, "creation_time": "2011-05-18T09:54:25Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 51196, "is_private": false, "text": "Roman,\n\nGood work! I'm reviewing your patch. All looks good and I'm going to apply it whithin a day or two.\n\nA couple of comments: \n\n (1)  In ChartAxis you are using the Double object instead of the primitive double.  Do you mind if we switch it to use the primitive type?\n\n (2) We compile POI with the Java language level 5.0 which means that @Override in interfaces isn't supported. Please remove.\n\nOther than that, very cool! There is only a few tests for now, but I'm sure there will be more :)\n\nRegards,\nYegor\n\n(In reply to comment #4)\n> I have also added a draft of example\n> `src/examples/src/org/apache/poi/xssf/usermodel/examples/ScatterChart.java' to\n> demonstrate the api in action (I have not tested it yet, it just compiles, but\n> I have very similar code in my application that works fine). Charts generated\n> with the api open fine in MS Office 2007 and OpenOffice 3.3 (of course, they\n> look much more prettier in ms office).\n> \n> Unfortunately, I have a problem with\n> `poi-ooxml-schemas-3.8-beta3-TIMESTAMP.jar' file build. When I am trying to run\n> my application with it, I got `java.lang.ClassNotFoundException'. So I am\n> forced to use `ooxml-schemas-1.1.jar' to run my application.", "id": 146407, "time": "2011-05-18T12:01:53Z", "creator": "yegor@dinom.ru", "creation_time": "2011-05-18T12:01:53Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 51196, "text": "Hi Yegor,\n\n(1) I thought about using primitive types, but there is a problem: these parameters are not required and they don't have default values. So we need to inform user if requested parameter has not been set. To return null is the most simple way to do it. Another way is to use primitives and provide additional isSetXXX() methods and return NaN if requested parameter is not set. How do you think, should I introduce the second approach?\n\n(2) Ok, no problems.\n\nI will try to provide cumulative patch within two days.\n\nBest regards,\nRoman\n\n\n(In reply to comment #5)\n> Roman,\n> \n> Good work! I'm reviewing your patch. All looks good and I'm going to apply it\n> whithin a day or two.\n> \n> A couple of comments: \n> \n>  (1)  In ChartAxis you are using the Double object instead of the primitive\n> double.  Do you mind if we switch it to use the primitive type?\n> \n>  (2) We compile POI with the Java language level 5.0 which means that @Override\n> in interfaces isn't supported. Please remove.\n> \n> Other than that, very cool! There is only a few tests for now, but I'm sure\n> there will be more :)\n> \n> Regards,\n> Yegor", "id": 146413, "time": "2011-05-18T12:43:30Z", "creator": "roman.kashitsyn@gmail.com", "creation_time": "2011-05-18T12:43:30Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 51196, "text": "Can your code return reasonable defaults, say, all zeros would mean that these values are not set? To me it looks better than using the Double type in interfaces. \n\nBTW, there is a bug in your code: you need to check if the Double argument is null.\n\nFor example, passing a null to the code below will cause NPE:\n\n\t@Override\n\tpublic void setMaximum(Double max) {\n\t\tCTScaling scaling = getCTScaling();\n\t\tif (scaling.isSetMax()) {\n\t\t\tscaling.getMax().setVal(max.doubleValue());\n\t\t} else {\n\t\t\tscaling.addNewMax().setVal(max.doubleValue());\n\t\t}\n\t}\n\nYegor", "id": 146419, "time": "2011-05-18T13:27:11Z", "creator": "yegor@dinom.ru", "creation_time": "2011-05-18T13:27:11Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "creator": "roman.kashitsyn@gmail.com", "attachment_id": 27033, "is_private": false, "id": 146457, "time": "2011-05-19T11:16:08Z", "bug_id": 51196, "creation_time": "2011-05-19T11:16:08Z", "text": "Created attachment 27033\nCumulative patch with applied remarks.\n\nI have finally introduced uniform approach to charts. I have also replaced Double with double in ChartAxis.\n\nIn addition, I have  added new test cases, so the build produces correct ooxml-light version."}, {"count": 9, "tags": [], "bug_id": 51196, "text": "Applied in r1125275 with some tweaks.\n\nI see you added two methods to the Drawing interface, but forgot to implement them in HSSFPatriarch which implements Drawing. No problems - I added createAnchor and createChart to HSSFPatriarch, createChart throws NotImplemented for now. For the future, please always run the full Ant test cycle before creating a patch, i.e. \"ant clean test\".  \n\nThe ScatterChart example throws NPE.  I think the line 69 should call setYValues, not setXValues:\n\nfirstSerie.setYValues(sheet, new CellRangeAddress(1, 1, NUM_OF_COLUMNS + 1, NUM_OF_COLUMNS + 1));\n\nPlease confirm.\n\nThe generated output is readable, but differs from the atatched sample file. I see data rows and an empty graphic frame. Is it still in progress? \n\nformatAsString\n\nI think a good test would be to create a test file with a chart in Excel and try to replicate that programmatically in POI. This way we can compare XML generated by POI with XML generated by Excel and ensure that all is good. What do you think? \n\nRegards,\nYegor", "id": 146472, "time": "2011-05-20T08:23:30Z", "creator": "yegor@dinom.ru", "creation_time": "2011-05-20T08:23:30Z", "is_private": false, "attachment_id": null}, {"attachment_id": 27039, "tags": [], "bug_id": 51196, "is_private": false, "count": 10, "id": 146474, "time": "2011-05-20T13:34:57Z", "creator": "roman.kashitsyn@gmail.com", "creation_time": "2011-05-20T13:34:57Z", "text": "Created attachment 27039\nPatch for ScatterChart example and formatAsString() method\n\nHi,\n\nI have fixed the example with ScatterChart. There were also bug with formatAsString() method (the bug is reproducible when define sheet names with spaces). I have also decided to switch from git to subversion when working with poi, so new patch has been produced by svn.\n\nReverse engineering of existing MS Office documents is one of the most useful source of information for development. So I am fully agreed with your proposal. Unfortunately, there is a lot of work needed to force POI charts look similar to charts produced by MS Office. I know exactly where sources of differences are:\n- ms office always uses themes;\n- ms office always uses cache in chart series (I have introduced (dummy at the moment) option to turn on and off this feature: some people may want smaller documents);\n- ms office generates strange ids for axis (definitely there is some algorithm... maybe hashing?).\nI will turn my effort to decrease the difference between documents produced with POI and documents produced by MS Office.\n\nIt is also very useful to provide ability to parse existing charts: I will try to implement this feature in  near future."}, {"count": 11, "tags": [], "bug_id": 51196, "is_private": false, "text": "(In reply to comment #10)\n> Created attachment 27039 [details]\n> Patch for ScatterChart example and formatAsString() method\n> \n\napplied in r1125662.\n\nYegor", "id": 146515, "time": "2011-05-21T10:51:28Z", "creator": "yegor@dinom.ru", "creation_time": "2011-05-21T10:51:28Z", "attachment_id": null}, {"attachment_id": 27077, "tags": [], "bug_id": 51196, "text": "Created attachment 27077\nSome new features for charts.\n\nHi,\n\nI have introduced some new features for charts:\n+ full control of chart and legend position with manual layouts;\n+ more easy series specification with DataMarker class;\nThere is also one little addition: now we can parse value axis of existing charts.\n\nI am also working on cached values insertion for chart series (it will give more compatibility with MS Office).\n\nBest regards,\nRoman Kashitsyn", "count": 12, "id": 146690, "time": "2011-05-27T20:57:41Z", "creator": "roman.kashitsyn@gmail.com", "creation_time": "2011-05-27T20:57:41Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 51196, "text": "Applied in r1132553\n\nThanks,\nYegor\n \n> I have introduced some new features for charts:\n> + full control of chart and legend position with manual layouts;\n> + more easy series specification with DataMarker class;\n> There is also one little addition: now we can parse value axis of existing\n> charts.\n> \n> I am also working on cached values insertion for chart series (it will give\n> more compatibility with MS Office).\n> \n> Best regards,\n> Roman Kashitsyn", "count": 13, "id": 146886, "time": "2011-06-06T10:29:33Z", "creator": "yegor@dinom.ru", "creation_time": "2011-06-06T10:29:33Z", "is_private": false}, {"count": 14, "tags": [], "bug_id": 51196, "is_private": false, "text": "Created attachment 27294\nDraft of numeric cache implementation.\n\nHi,\n\nI have finally finished first draft of number cache implementation. It not so easy as I thought. I have added some utils:\n1. org.apache.poi.ss.util.SheetBuilder - useful class to build sheets from 2D arrays. I think it can be extrimely useful for tests (there are several examples in test cases ;).\n2. org.apache.poi.ss.util.cellwalk package now contains classes to easily traverse cell ranges.\n\nI hope I have not reinvent the wheel here :]\n\nThe good news is that after number cache implementation MS Office does not offer to save document with programmatically created charts when you open and close the document (so, number cache really affects compatibility).\n\nPlans:\n======\nI am planning to refactor my implementation of Series: I want to get rid of DataMarker class and introduce some kind of chart DataSource: I have found that MS Office allows you to create static charts (without any reference to cells), so DataMarker is something definitely wrong for serie composition. So I have to replace it with some kind of abstract DataSource and I am thinking about appropriate interface.\n\nBest regards,\nRoman Kashitsyn", "id": 147961, "time": "2011-07-17T20:41:44Z", "creator": "roman.kashitsyn@gmail.com", "creation_time": "2011-07-17T20:41:44Z", "attachment_id": 27294}, {"count": 15, "tags": [], "bug_id": 51196, "text": "Applied in r1148642\n\nThanks,\nYegor\n\n(In reply to comment #14)\n> Created attachment 27294 [details]\n> Draft of numeric cache implementation.\n> \n> Hi,\n> \n> I have finally finished first draft of number cache implementation. It not so\n> easy as I thought. I have added some utils:\n> 1. org.apache.poi.ss.util.SheetBuilder - useful class to build sheets from 2D\n> arrays. I think it can be extrimely useful for tests (there are several\n> examples in test cases ;).\n> 2. org.apache.poi.ss.util.cellwalk package now contains classes to easily\n> traverse cell ranges.\n> \n> I hope I have not reinvent the wheel here :]\n> \n> The good news is that after number cache implementation MS Office does not\n> offer to save document with programmatically created charts when you open and\n> close the document (so, number cache really affects compatibility).\n> \n> Plans:\n> ======\n> I am planning to refactor my implementation of Series: I want to get rid of\n> DataMarker class and introduce some kind of chart DataSource: I have found that\n> MS Office allows you to create static charts (without any reference to cells),\n> so DataMarker is something definitely wrong for serie composition. So I have to\n> replace it with some kind of abstract DataSource and I am thinking about\n> appropriate interface.\n> \n> Best regards,\n> Roman Kashitsyn", "id": 148025, "time": "2011-07-20T08:03:56Z", "creator": "yegor@dinom.ru", "creation_time": "2011-07-20T08:03:56Z", "is_private": false, "attachment_id": null}, {"count": 16, "tags": [], "creator": "roman.kashitsyn@gmail.com", "attachment_id": 27445, "text": "Created attachment 27445\npatch with ChartDataSource strategy implementation\n\nHi,\n\nI have finished the ChartDataSource idea implementation. It provides unified interface for data someone may wish to plot. From my point of view, API become more powerful and flexible.\n\nThere is several aspects:\n1. I have reformatted my code so now it indented with only spaces, not with mess of tabs and spaces. It makes your review work more tedious, sorry for that :)\n2. I have deleted some files I do not need anymore (DataMarker.java, for example), but I am in doubt regarding CellWalk API. I seems useful, but I don't need it since there are ChartDataSources.\n\nPlans:\nI will try to implement LineChart to investigate non-numeric ChartDataSources potential.\n\nBest regards,\nRoman Kashitsyn.", "id": 148875, "time": "2011-08-29T06:23:52Z", "bug_id": 51196, "creation_time": "2011-08-29T06:23:52Z", "is_private": false}, {"count": 17, "tags": [], "bug_id": 51196, "text": "Applied in 1167579, thanks, Roman\n\nThe Chart API is getting close to the point when it can be used in real applications, at least, for creating Scatter charts. The class design looks good, but to justify it we need more chart types implemented - until we have only Scatter chart it is hard to tell whether all interfaces fit together.\n\nI got my main impression from the ScatterChart example. It worked, but some important features are missing:\n\n - legend name. In the ScatterChart example the data series are titled \"Series1\" and \"Series2\" but I didn't find a way to modify it.  Shouldn't the addSerie method accept series name as a third parameter?  For example,\n\nchartData.addSerie(xValues, yValues, seriesName);\n\n - gridlines. Both X- and Y- grid lines are not visible and I couldn't change it.\n\nIt would be also nice to be able to format markers and lines. \n\nOther than that, very cool! Thanks a lot for your excellent contribution.\n\nRegards,\nYegor", "id": 149145, "time": "2011-09-10T19:04:15Z", "creator": "yegor@dinom.ru", "creation_time": "2011-09-10T19:04:15Z", "is_private": false, "attachment_id": null}]