[{"attachment_id": 27030, "tags": [], "creator": "neetuskumar@gmail.com", "is_private": false, "count": 0, "id": 146443, "time": "2011-05-19T06:52:12Z", "bug_id": 51228, "creation_time": "2011-05-19T06:52:12Z", "text": "Created attachment 27030\nScreenshot of JMS point to point sampler used\n\nI've made JMeter post to and listen to my MQ using a JMS point to point sampler. I'm trying to retrieve the response from my response queue by correlating the message id. The issue is that though I am able to see the correct response in the results tree, any other messages lying in the response queue are getting deleted from my response queue.\n\n\nSteps to reproduce : \n\nSetup MQ Queue manager and queues and jms binding file for the same.\n\nConfigure a request and one response queue.\n\nConfigure a JMS sampler to post a request onto the request queue using a sampler while listening to the response queue.\n\nPlace some dummy messages on the response queue.\n\n\nRun JMeter....and check the messages lying on the response queue."}, {"count": 1, "tags": [], "bug_id": 51228, "text": "Hello,\nPlease send your JMX file.\n\nSebb, Milamber, I think issue is due to the fact that we are in AUTO_ACKNOWLDGE mode and we call receive, and if message has not correlation ID we don't put it back.\n\n\nRegards\nPhilippe Mouawad", "id": 149103, "time": "2011-09-08T08:23:34Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-09-08T08:23:34Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 51228, "attachment_id": null, "id": 150918, "time": "2011-10-25T19:18:15Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-10-25T19:18:15Z", "is_private": false, "text": "As this feature is designed it launches a thread that calls MessageConsumer#receive until it is active, which is while thread is active.\nThis explains why all messages in QUeue are cleaned.\n\nMaybe you would like only your message to be received but I don't think it's possible .\n\nMaybe one option would be to enable a message selector on JMS Sampler so that it only selects messages that sampler sends. But it would always receive all messages in Queue, ie those posted by other Thread Group (you could make selector a Variable and it would make it).\n\nSo I will close this issue and create a new one to let us put a selector on JMS Sampler receiver."}]