[{"count": 0, "tags": [], "bug_id": 51238, "attachment_id": null, "id": 146508, "time": "2011-05-21T01:05:30Z", "creator": "haridara@gmail.com", "creation_time": "2011-05-21T01:05:30Z", "is_private": false, "text": "Currently the if you add the \"Host\" header to the \"HTTP Header Manager\", it gets silently dropped by the underlying java HTTP stack, because this is considered one of the restricted headers. However, the behavior can be changed by simply setting the system property named \"sun.net.http.allowRestrictedHeaders\" to \"true\". I have verified that by passing -Dsun.net.http.allowRestrictedHeaders=true argument on the command-line, the \"Host\" header does indeed work.\n\nSince this header is essential in testing the virtualhost functionality (without having to resort to editing hosts file on each of the load m/c, or depending on the network configuration), I request that JMeter set this property by default during the startup and allow overriding the Host header. Some research is required on what other restricted headers exist and what the consequence might be, but since we are in the business of testing HTTP, I can't imagine any harm of allowing any and all.\n\nThe workaround of passing this property on the command-line is not very flexible since it would involve changing any existing scripts that auto-start jmeter. I have looked at an alternative to programmatically change this property during the test run by calling __setProperty() in the context of a user defined variable, but that didn't help. If there is another location where changing this property could get it working, it could be considered an adequate workaround, and should be documented."}, {"count": 1, "tags": [], "text": "Thanks for the information - useful to know why the header was being ignored.\n\nSystem properties can be defined in the file \"bin/system.properties\" which is processed at startup, so should apply to the HTTP implementation.\n\nNo code change needed; just edit the file.\n\nI'm not convinced that this should be the default.\n\nNote that the Java HTTP implementation has other failings; in general the Apache HttpClient implementation (3.1 currently, will also support 4.x in the next release) is much more flexible.", "is_private": false, "id": 146511, "creator": "sebb@apache.org", "time": "2011-05-21T09:08:11Z", "bug_id": 51238, "creation_time": "2011-05-21T09:08:11Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 51238, "is_private": false, "text": "Thanks for the clarification on the bin/system.properties, this is probably a good workaround. Is there a plan to switch to the Apache HttpClient for a future release?", "id": 146517, "time": "2011-05-21T16:52:23Z", "creator": "haridara@gmail.com", "creation_time": "2011-05-21T16:52:23Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "On further reflection, I think the setting\n\n-Dsun.net.http.allowRestrictedHeaders=true\n\nshould be the default for JMeter. JMeter should be able to set such properties.\n\nURL: http://svn.apache.org/viewvc?rev=1125933&view=rev\nLog:\nDefine sun.net.http.allowRestrictedHeaders=true by default. This fixes Bug 51238.\n\nModified:\n   jakarta/jmeter/trunk/bin/system.properties\n   jakarta/jmeter/trunk/xdocs/changes.xml", "is_private": false, "id": 146523, "creator": "sebb@apache.org", "time": "2011-05-22T12:06:57Z", "bug_id": 51238, "creation_time": "2011-05-22T12:06:57Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Thank you.", "attachment_id": null, "id": 146531, "creator": "haridara@gmail.com", "time": "2011-05-23T05:57:16Z", "bug_id": 51238, "creation_time": "2011-05-23T05:57:16Z", "is_private": false}]