[{"count": 0, "tags": [], "bug_id": 51268, "text": "Created attachment 27070\nTest script (.jmx) and log files\n\nWhen performing a HTTPS request through a non-existing proxy server (i.e. there is a value specified, but it's not an actual valid proxy server), JMeter internally gives a NullPointerException and *does not show the (failed) sampler result* in the listeners. As a consequence, the user has no idea that anything went seriously wrong, unless the missing result is noticed.\n\nThis can easily be reproduced, please see attached files:\n\"HTTPS_request.jmx\" does a simple HTTPS request and displays the result.\n\n(1) Start JMeter with VALID --proxyHost and --proxyPort parameters\n(2) Run the test\n(3) You get a green result in the table. This corresponds to attached log \"jmeter_with_good_proxy.log\"\n\n(4) Start JMeter with INVALID --proxyHost and --proxyPort parameters\n(5) Run the test\n(6) You get NO result in the table. This corresponds to attached log \"jmeter_with_bad_proxy.log\" \n\nI'm using version 2.4 r961953. As you can see from the log, for an invalid proxy it gives a NullPointerException that bubbles up.", "id": 146648, "time": "2011-05-26T09:10:11Z", "creator": "w.a.hajenius@gmail.com", "creation_time": "2011-05-26T09:10:11Z", "is_private": false, "attachment_id": 27070}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "text": "This looks to be a bug in Java; it should not generate an NPE.\nIf there is a problem with the proxy, it should report an IOError, which would be handled as a sampler error.\n\nYou appear to be using Java version 1.5.0_12 which is quite old.\nDoes the problem still occur with the latest Java version?", "id": 146653, "time": "2011-05-26T11:07:13Z", "bug_id": 51268, "creation_time": "2011-05-26T11:07:13Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "Even though the NPE should not happen, it's easy enough to allow for it by catching Exception rather than just the expected failures.\n\nURL: http://svn.apache.org/viewvc?rev=1127881&view=rev\nLog:\nBug 51268 - HTTPS request through an invalid proxy causes NullPointerException and does not show in result tree.\nRather than delegating to the JMeter thread handler for \"unexpected\" failures, ensure all Exceptions generate a sample error.\n\nModified:\n   jakarta/jmeter/trunk/src/protocol/http/org/apache/jmeter/protocol/http/sampler/HTTPSamplerBase.java\n   jakarta/jmeter/trunk/xdocs/changes.xml", "attachment_id": null, "id": 146654, "creator": "sebb@apache.org", "time": "2011-05-26T12:17:37Z", "bug_id": 51268, "creation_time": "2011-05-26T12:17:37Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 51268, "is_private": false, "text": "Assuming this is now fixed; if not, please reopen with details.", "id": 149350, "time": "2011-09-17T00:34:33Z", "creator": "sebb@apache.org", "creation_time": "2011-09-17T00:34:33Z", "attachment_id": null}]