[{"count": 0, "tags": [], "bug_id": 51263, "is_private": false, "text": "Created attachment 27057\nVersionChecker tool report\n\nBuilding my java project using Maven and JDK 1.5, after cleaning my local Maven repository, causes\n> java.lang.UnsupportedClassVersionError: Bad version number in .class file\n\nAfter investigations, it's because the batik artefacts version 1.7 required by the docbkx-maven-plugin are compiled using JDK 1.6 (see attached part of VersionChecker tool report).", "id": 146615, "time": "2011-05-25T08:48:04Z", "creator": "julien@beti.name", "creation_time": "2011-05-25T08:48:04Z", "attachment_id": 27057}, {"count": 1, "tags": [], "creator": "helder.magalhaes@gmail.com", "attachment_id": null, "is_private": false, "id": 146895, "time": "2011-06-06T14:51:21Z", "bug_id": 51263, "creation_time": "2011-06-06T14:51:21Z", "text": "Julien: why was this set as a regression? AFAIK, Batik previously wasn't available in maven at all...\n\nAlthough there have been recent discussion towards pushing the minimum requirement to 1.5 for the next release, for Batik 1.7 the minimum requirement is supposed to be 1.3 [1] (!).\n\nI'm Benson Margulies, as he was the one who helped towards publishing the maven artifacts. Benson: do you think it could be easy to republish the maven artifacts based on the original ones available for download [1]? (I'm assuming you probably don't have a JDK 1.3 or 1.4 handy.)\n\n[1] http://xmlgraphics.apache.org/batik/download.cgi"}, {"count": 2, "tags": [], "bug_id": 51263, "is_private": false, "text": "(In reply to comment #1)\n> I'm Benson Margulies, as he was the one who helped towards publishing the maven\n> artifacts\n\nNaturally, I meant \"I'm CC'ing Benson\" ;-)", "id": 146896, "time": "2011-06-06T14:52:20Z", "creator": "helder.magalhaes@gmail.com", "creation_time": "2011-06-06T14:52:20Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 51263, "attachment_id": null, "is_private": false, "id": 146897, "time": "2011-06-06T15:04:52Z", "creator": "julien@beti.name", "creation_time": "2011-06-06T15:04:52Z", "text": "(In reply to comment #1)\n> Julien: why was this set as a regression? AFAIK, Batik previously wasn't\n> available in maven at all...\n\nWell as explained in comment 0, Batik libraries are used in my project as a dependency of the docbkx-maven-plugin. As my project compilation used to work some times ago, I obviously wrongly assumed that the libraries haven been previously made available in Maven repo and built with JDK 1.4. Therefore I chose \"Regression\" as severity. Sorry for that.\n\nMy current workaround, as I just can't compile using JDK 1.6, is to force the docbkx-maven-plugin version to a quite old version."}, {"count": 4, "text": "Well, this is a fine kettle of fish I've gotten us into.\n\nYou can't 'republish' an artifact. They are immutable. We'd have to use a different version number, perhaps just -java.13 on the end, or with a distinctive Maven 'classifier'. Though I'm not too sure about retroactively adding new classified pieces.\n\nI didn't use the existing binaries because, ironically, I felt uncomfortable in signing binaries that I hadn't produced myself.\n\nAre you sure that there is a sufficient intersection of 'needs maven' and 'needs 1.3' to motivate fixing this? If so, the original binaries certainly could be published under a mutant version.", "bug_id": 51263, "is_private": false, "id": 146898, "time": "2011-06-06T15:07:47Z", "creator": "bimargulies@gmail.com", "creation_time": "2011-06-06T15:07:47Z", "tags": [], "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 51263, "is_private": false, "text": "(In reply to comment #4)\n> Are you sure that there is a sufficient intersection of 'needs maven' and\n> 'needs 1.3' to motivate fixing this? If so, the original binaries certainly\n> could be published under a mutant version.\n\nWell, I'm not the one referencing the batik libraries... I'm using the docbkx-maven-plugin which uses batik libraries at runtime to generate documentation from DocBook content.\n\nIf you do not replace the existing libraries in the Maven repositories, I'll have to secondly request a new version of the docbkx-maven-plugin to make them use the 'JDK 1.3' flavour of the batik libraries :-(", "id": 146899, "time": "2011-06-06T15:26:24Z", "creator": "julien@beti.name", "creation_time": "2011-06-06T15:26:24Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 51263, "is_private": false, "text": "So, someone moved the docbk thing to the new maven version that lacks support for old java. I suppose they could move backwards.\n\nI'll look into republishing.", "id": 146900, "time": "2011-06-06T15:28:46Z", "creator": "bimargulies@gmail.com", "creation_time": "2011-06-06T15:28:46Z", "attachment_id": null}]