[{"count": 0, "tags": [], "creator": "philippe.vosges@nomura.com", "is_private": false, "text": "Created attachment 27056\nexample of the bug\n\nIn the attached file, there are two cells containing the same text \"abcxyz\", seemingly formatted the same way: \"abc\" takes the default font (MS P Gothic) but in bold and \"xyz\" is normal (not bold) but bigger (11pt).\n\nThe first cell is copied from an actual work document, I have been working with. It contains the problem.\n\nThe second cell is a reproduction of the format made directly in this XLS file with Excel 2007.\n\nWhile they show the same way in Excel, POI reads something different in both cells. The formatting run (corresponding to \"xyz\") of the first cell references the wrong font (font index 0). Everything is fine in the second cell (the formatting run points to font 29, which is different from the cell font).\n\nMight be that it comes from some BIFF8 archaism, unsupported by POI (I don't know the whole history of the original file but it could be an old one, copied again and again).\n\nAlso reproduced with 3.8-beta2-20110408.", "id": 146611, "time": "2011-05-25T03:19:36Z", "bug_id": 51262, "creation_time": "2011-05-25T03:19:36Z", "attachment_id": 27056}, {"count": 1, "tags": [], "bug_id": 51262, "attachment_id": null, "is_private": false, "id": 147239, "time": "2011-06-18T08:34:20Z", "creator": "yegor@dinom.ru", "creation_time": "2011-06-18T08:34:20Z", "text": "I can see that the problematic cell B3 is formatted using a custom user-defined style (標準_NEV) and the default font for this style is MS P Gothic 10pt bold.\n\nPOI doesn't take this into account and returns you the global default font which is 11pt regular. \n\nSomething to improve in future.\n\nYegor"}, {"count": 2, "tags": [], "bug_id": 51262, "attachment_id": null, "id": 147263, "time": "2011-06-20T01:08:29Z", "creator": "philippe.vosges@nomura.com", "creation_time": "2011-06-20T01:08:29Z", "is_private": false, "text": "Thanks for looking into this. I didn't notice there was a custom style. Now I wonder if this is not a duplicate of some other entry (couldn't find it though)."}, {"text": "Works for me now, see unit-test added via r1811595.", "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "count": 3, "id": 201363, "time": "2017-10-09T19:36:14Z", "bug_id": 51262, "creation_time": "2017-10-09T19:36:14Z", "is_private": false}]