[{"count": 0, "tags": [], "creator": "stefan.stern@mind8.com", "attachment_id": null, "text": "In OOXML, multiple references of the same picture refer to the same picture part inside the package. This applies, even if multiple parts refer to the same image, for example a header, footer and the main document. \n\nUp to now, there is no functionality in POI to support this behavior for any new image. Instead, adding the same picture n times, will create n new parts with identical content. This potentially increases the package size daramatically, given a scenario where a larger picture is referrenced several times.\n\nIn order to support the image part reuse, all available images must be managed in a central spot. All OPCPackages have one main part, which in Word is the XWPFDocument. This results in XWPFDocument being a subclass of POIXMLDocument, whereas all other XWPFClasses, which represent a package, subclass POIXMLDocumentPart only. \n\nThe XWPFDocument herewith not only represents the main document, but also represents the package and all package-wide settings & data. Therefore, managing all package-known pictures should take place in the XWPFDocument. Besides the management of all package-pictureparts, the document also manages all those picture-parts, which are related to the main document part. This is the same task, that applies to headers and footers as well. They must take care for all picture-parts related by their corresponding package-part.\n\nEnabling reuse of picture parts complicates the removal of package parts. As long as every part is referenced once, the removal of the reference goes along with removing the part. Removing an image part, in case a reference to this part was removed, may corrupt the document, as other references may still require that part. A solution to this issue is a simple reference counter, which is increased whenever a new relationship is created, and decreased whenever a relationship is removed. If the last relationship counter reaches zero, when a relation is removed, the target part can be deleted. \n\nWhile changing POIXMLDocumentPart, the relation-handling was reworked. Instead of keeping a simple list of all related parts, a Map was used, which uses the relation-ID as key and the target part as value. This eases the handling of all parts, but required some changes to the API (changes to XSSFDrawing have been applied). Additionally, the original list was kept in order to represent the relation-sequence, as these appear in the _rels XML document and several Unit-tests rely on this sequence. I do not recommend to rely on it, as a relation is defined by id, type and target only, whereas the position in the according _rels is not part of the information a PackageRelationship is defined of, in terms of the OPC.\n\nAmong the changes done to POIXMLDocumentPart concerning relation-handling, the behavior of the method \"createRelationship\" was slightly altered. So far, it always added the new part to the \"relations\" list of the affected part. But this is only valid, if a new PackageRelationship was created between the new part and the current part. If this step was skipped, adding the new part to the relations is wrong. And closing the package and reload it will not load the new part into the relations list again, if no PackageRelationship exists between these parts.\n\nFinally, in order to write test all new methods, I moved TestXWPFDocument into the org.apache.poi.xwpf.usermodel package. This allows to test methods with default-visibility, which seemed quite reasonable for a testcase.", "id": 146625, "time": "2011-05-25T12:53:33Z", "bug_id": 51265, "creation_time": "2011-05-25T12:53:33Z", "is_private": false}, {"count": 1, "tags": [], "creator": "stefan.stern@mind8.com", "text": "Created attachment 27062\nPatch to all POI-classes affected\n\nThis patch modifies all POI-OOXML-classes affected by the changes explained in the description. Some formatting issues have been fixed, as discussed in the developers mailing list. Not all classes were re-formatted.", "id": 146626, "attachment_id": 27062, "bug_id": 51265, "creation_time": "2011-05-25T13:05:13Z", "time": "2011-05-25T13:05:13Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 51265, "text": "Created attachment 27063\nPatch to all POI-Testcases, affected by the changes.\n\nThis patches all testcases (and adds a new one), that needed an update due to changes to the POI-OPC and OOXML classes.", "id": 146627, "attachment_id": 27063, "creator": "stefan.stern@mind8.com", "creation_time": "2011-05-25T13:06:18Z", "time": "2011-05-25T13:06:18Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 51265, "attachment_id": null, "is_private": false, "id": 146628, "time": "2011-05-25T13:14:33Z", "creator": "stefan.stern@mind8.com", "creation_time": "2011-05-25T13:14:33Z", "text": "I created some more test-files and zipped them up, but the ZIP is too big for an attachement. Please find the test-files here:\nhttp://www.mind8.com/apache/bug51265.7z"}, {"count": 4, "tags": [], "creator": "yegor@dinom.ru", "is_private": false, "id": 146725, "attachment_id": null, "bug_id": 51265, "creation_time": "2011-05-29T09:05:21Z", "time": "2011-05-29T09:05:21Z", "text": "Thanks for the patch. \n\nI would like to wait until 3.8 beta3 is released and then apply it to trunk (after June 6). Your patch touches some rather fundamental things ( POIXMLDocument and its friends) and I would rather not include it in release without thorough testing.  \n\nYegor"}, {"count": 5, "tags": [], "bug_id": 51265, "text": "Applied in r1130120.\n\nThis is a really good change. I didn't research hadling of pictures in XSSF and XSLF, but suspect that they should use the same logic as XWPFDocument and reuse image parts. If so, we should consider moving this logic to POIXMLDocument. \n\n> While changing POIXMLDocumentPart, the relation-handling was reworked. Instead\n> of keeping a simple list of all related parts, a Map was used, which uses the\n> relation-ID as key and the target part as value. This eases the handling of all\n> parts, but required some changes to the API (changes to XSSFDrawing have been\n> applied). Additionally, the original list was kept in order to represent the\n> relation-sequence, as these appear in the _rels XML document and several\n> Unit-tests rely on this sequence. \n\nI changed this part a little bit. There is no need to have both a Map and a List to maintain the collection of POIXMLDocumentParts. I turned relations into a ordered map :\n    private Map<String,POIXMLDocumentPart> relations = new LinkedHashMap<String,POIXMLDocumentPart>(); \n\nThe relationsOrder list is not needed and I removed it. \n\n> I do not recommend to rely on it, as a\n> relation is defined by id, type and target only, whereas the position in the\n> according _rels is not part of the information a PackageRelationship is defined\n> of, in terms of the OPC.\n> \n\nWe should not rely on the order of relations when constructing OPC packages, but we *should* preserve the order of relations when reading / saving a a package. This is why we need to store document parts in a ordered collection.\n\nP.S.  please use a standard archive tool (.zip or .gz) instead of 7z.\n\nRegards,\nYegor", "id": 146789, "time": "2011-06-01T12:11:37Z", "creator": "yegor@dinom.ru", "creation_time": "2011-06-01T12:11:37Z", "is_private": false, "attachment_id": null}, {"count": 6, "text": "Created attachment 27116\nAdd Image-Handling Unit-Tests\n\nIt seems that by moving the TestXWPFDocument class into another package, the new content didn't make it into the moved file. Please see the attached patch for the new tests.\nThe tests take care that each image is added only once, and when adding it a second time, the already related part is used / an already available image part with the same content is related.", "bug_id": 51265, "is_private": false, "id": 146879, "time": "2011-06-06T06:53:57Z", "creator": "stefan.stern@mind8.com", "creation_time": "2011-06-06T06:53:57Z", "tags": [], "attachment_id": 27116}, {"count": 7, "tags": [], "bug_id": 51265, "is_private": false, "text": "Sorry for the 7Z. We use it for a while here, so I didn't hesitate. Next time, I will create a standard ZIP.", "id": 146880, "time": "2011-06-06T06:54:33Z", "creator": "stefan.stern@mind8.com", "creation_time": "2011-06-06T06:54:33Z", "attachment_id": null}, {"count": 8, "text": "> \n> It seems that by moving the TestXWPFDocument class into another package, the\n> new content didn't make it into the moved file. Please see the attached patch\n> for the new tests.\n> The tests take care that each image is added only once, and when adding it a\n> second time, the already related part is used / an already available image part\n> with the same content is related.\n\nAre you keeping you trunk up-to-date? The new tests are already in the code. I see them both locally and online at \nhttps://svn.apache.org/repos/asf/poi/trunk/src/ooxml/testcases/org/apache/poi/xwpf/usermodel/TestXWPFDocument.java\n\nYegor", "bug_id": 51265, "is_private": false, "id": 146882, "time": "2011-06-06T07:43:18Z", "creator": "yegor@dinom.ru", "creation_time": "2011-06-06T07:43:18Z", "tags": [], "attachment_id": null}, {"count": 9, "text": "Sorry, my fault. Somehow my local Subversion sandbox stumbled. Merging showed\nme the old TestXWPFDocument file as incoming. I moved my local out of the\nsandbox and got an incoming file, which had the new content. All fine now.", "bug_id": 51265, "is_private": false, "id": 146883, "time": "2011-06-06T08:46:50Z", "creator": "stefan.stern@mind8.com", "creation_time": "2011-06-06T08:46:50Z", "tags": [], "attachment_id": null}]