[{"count": 0, "attachment_id": null, "bug_id": 51322, "is_private": false, "id": 146868, "time": "2011-06-04T23:06:04Z", "creator": "hairlesshobo@stevecross.org", "creation_time": "2011-06-04T23:06:04Z", "tags": [], "text": "While trying to setup my Apache web server for LDAP authentication against an OpenLDAP database, I discovered that there is a lack of required syntax for my needs. Most all LDAP-aware applications how some method of specifying additional characters to be added before or after the search parameter. Take my setup for instance (obviously replacing example.org with the real domain that I am not going to specify here).\n\nSince I am running multiple virtual email domains from one server, I needed a method of separating the accounts for one domain from the others. I have the users of my directory setup as such:\n\ndn: ou=People,dc=example,dc=org\nobjectclass: top\nobjectclass: organizationalUnit\nou: People\n\ndn: cn=example.org_johndoe,ou=People,dc=example,dc=org\ncn: example.org_johndoe\nobjectclass: inetOrgPerson\nobjectclass: top\nsn: doe\n\ndn: cn=example.org_janedoe,ou=People,dc=example,dc=org\ncn: example.org_janedoe\nobjectclass: inetOrgPerson\nobjectclass: top\nsn: doe\n\nWhen attempting to search by cn, which is the root DN, the user would have to type in the full account name. This is a problem because whenever an account name is setup the first portion of the name is not exposed to the end user because it is expected that the application that is talking with the LDAP database will know how to handle it automatically. With the way that the mod_authnz_ldap is setup, there is a limitation that does not allow this to work."}, {"count": 1, "tags": [], "bug_id": 51322, "text": "I have created a patch that adds the following two options to the mod_authnz_ldap configuration:\n\nAuthLDAPAttrPrependString\nAuthLDAPAttrAppendString\n\nThese two configuration parameters allow you to specify a string that must be added before and after the LDAP value that is being searched for. Using the example structure in the post above, if someone were to login with the username \"johndoe\", then it would be searching the LDAP database for that exact cn. Now configure the module with the following line:\n\nAuthLDAPAttrPrependString \"example.org_\"\n\nWhen configured this way and someone logs in with the username \"johndoe\", the LDAP database is searched for \"example.org_johndoe\" instead. I have attached the patch which was originally written for 2.2.16 but has been tested against the latest stable 2.2.19 version.\n\nSteve Cross", "id": 146869, "time": "2011-06-04T23:12:30Z", "creator": "hairlesshobo@stevecross.org", "creation_time": "2011-06-04T23:12:30Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "hairlesshobo@stevecross.org", "text": "Created attachment 27112\nPatch to mod_authnz_ldap that allows a string to be appended and prepended to the search parameter\n\nStandard unified diff format.", "id": 146870, "time": "2011-06-04T23:13:39Z", "bug_id": 51322, "creation_time": "2011-06-04T23:13:39Z", "is_private": false, "attachment_id": 27112}]