[{"count": 0, "attachment_id": null, "bug_id": 51320, "is_private": false, "id": 146840, "time": "2011-06-03T17:58:14Z", "creator": "dgoldenberg@attivio.com", "creation_time": "2011-06-03T17:58:14Z", "tags": [], "text": "Right now, only QuillContents is taken into account when extracting text.\n\nIt seems worth researching whether any useful text may be extraced from the Main and the Escher parts.\n\nThis is related to 51317 - Need ability to stream and chunk data out of MS Publisher documents. If any extra parts get exposed we'd ideally want streaming available on it."}, {"count": 1, "attachment_id": null, "bug_id": 51320, "text": "The Escher parts are being passed by DDF. So, it should be fairly easy to walk through them in some sample files and see if there's any useful text in there. If there is, extending the text extractor to look for what we've identified should be fairly straight forward. Any chance you could take a look in some files you have to hand?\n\nAs for the main part, I seem to recall the issue is having no idea what on earth is stored in it or the format... First up you'd want to look at hex dumps, and see if there is handy text in there. If there is, then look at several files to see if it's in the same place. If not, look for what might be offsets to where the text lives, and if the offsets are in a predictable place then we're ok.\n\nNeeds some investigations, sorry!", "id": 146844, "time": "2011-06-03T19:47:46Z", "creator": "apache@gagravarr.org", "creation_time": "2011-06-03T19:47:46Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "dgoldenberg@attivio.com", "text": "Nick,\n\nSorry I am swamped at the moment. This is not as critical since Quills get one most of the content it seems...", "id": 146859, "time": "2011-06-03T23:41:42Z", "bug_id": 51320, "creation_time": "2011-06-03T23:41:42Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 51320, "is_private": false, "text": "Resolving this for now as there has not been any activity for years.", "id": 181965, "time": "2015-03-22T19:30:36Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-03-22T19:30:36Z", "attachment_id": null}]