[{"attachment_id": null, "tags": [], "creator": "jw2online@verizon.net", "is_private": false, "count": 0, "id": 147074, "time": "2011-06-13T20:39:48Z", "bug_id": 51367, "creation_time": "2011-06-13T20:39:48Z", "text": "I am working on getting a test setup that has a loop in a thread group that repeats the test.  I have tested with the following combination and found that what I will label as the \"Inner Loop\" is executed only once despite the test plan configuration.\n\nThread Group (repeat 5x)\n+ Action1\n+ Inner Loop (repeat 5x)\n+ Action2\n\n\nThreat Group\n+ Loop (repeat 5x)\n++ Action1\n++ Inner Loop (repeat 5x)\n++ Action2\n\nThe result in both cases is the same:\n. Action1\n. Inner Loop (5x)\n. Action2\n. Action1 (4x)\n. Action2 (4x)\n\nMy expectation is that it would work as follows:\n. Action1\n. Inner Loop (5x)\n. Action2\n. Action1\n. Inner Loop (5x)\n. Action2\n. Action1\n. Inner Loop (5x)\n. Action2\n. Action1\n. Inner Loop (5x)\n. Action2\n. Action1\n. Inner Loop (5x)\n. Action2\n\nThis is also how is this is documented.  I hope this is a \"user error\" and that I can be set right.  However, if this is a bug, I hope a fix can be quickly issued as this makes building tests slightly more cumbersome."}, {"attachment_id": null, "tags": [], "creator": "sebb@apache.org", "text": "The test layout is not clear from the description, nor ist it clear what loop controller was used.\n\nPlease can you provide a simple test case showing the layout?\n\nYou can use the Java Test sampler to avoid the need to connect to an external host.", "count": 1, "id": 147080, "time": "2011-06-13T21:09:09Z", "bug_id": 51367, "creation_time": "2011-06-13T21:09:09Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 51367, "is_private": false, "text": "I will work on getting a simple test setup.\n\nThe Loop Controller used is the basic \"Loop Controller\" which either loops forever or for a certain count.\n\nThe \"+\" signs below are meant to indicate the levels of the layout.  In the first case everything is an immediate child of the Thread Group.  In the second case there is one immediate child of the Thread Group and the \"Loop\" (which is a Loop Controller) has three children.\n\nBut, as I said I will work on setting up a simple test and getting it posted.  I offer that explanation in case it helps while I juggle work and getting a sample test ready.", "id": 147108, "time": "2011-06-14T13:15:01Z", "creator": "jw2online@verizon.net", "creation_time": "2011-06-14T13:15:01Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 51367, "text": "I made a sample test based on your suggestion and it worked as expected.  I am going to rebuild my other tests from scratch and see if the issue persists.  I built them by taking the sampled responses and moving/adjusting them to be part of the test case.  Perhaps something odd happened there.\n\nI will followup with my results.", "id": 147113, "time": "2011-06-14T13:44:45Z", "creator": "jw2online@verizon.net", "creation_time": "2011-06-14T13:44:45Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 51367, "text": "My apologies.  This appears to be a case of EBCAK/IO.  When I built my test I took the recorded parts, made proper variables, and added a loop.  In the course of this the file was somehow corrupted and yet ran.  Now when I run the test I see more of what I am expecting to see.\n\nI have marked this bug appropriately.\n\nIf I can replicate issues with moving nodes from the recording workbench to a test plan, I will open a separate issue.", "id": 147117, "time": "2011-06-14T16:19:48Z", "creator": "jw2online@verizon.net", "creation_time": "2011-06-14T16:19:48Z", "is_private": false, "attachment_id": null}]