[{"count": 0, "tags": [], "bug_id": 51417, "text": "Created attachment 27193\nbusy.patch created by Mladen Turk and verified independently to fix this issue\n\nAn AJP worker can get stuck in the OK/BUSY state and - in the case of a stateless web service - not handle any further requests. \n\nIn jk_lb_worker.c's service(), a worker is set to busy if it can't provide a free endpoint. If a request is finished and releases one of the worker's endpoints then the busy state is cleared. \n\nThe problem is that as one thread performs the final jk_sleep() in jk_ajp_common's do_ajp_service(), all endpoints for the worker may be released. \n\nNow the worker is marked busy, but no requests will complete subsequently which would clear the busy state. The worker is stuck, indefinitely. \n\nThe problem is fairly easy to reproduce as follows: \n\n- Configure an lb worker with a few AJP member workers. \n- Configure one of the AJP workers with connection_pool_size=1. \n- Run only the application servers corresponding to the worker with connection_pool_size=1. \n- Deploy a servlet that sleeps for 200ms (default 2 retries * 100ms sleep). \n- Invoke the servlet twice in parallel, via Apache and mod_jk. \n\nThe above is a pathological setup and just for testing, however it has been encountered in a specific use case with a web service.", "id": 147363, "time": "2011-06-22T15:10:41Z", "creator": "smendenh@redhat.com", "creation_time": "2011-06-22T15:10:41Z", "is_private": false, "attachment_id": 27193}, {"count": 1, "tags": [], "bug_id": 51417, "attachment_id": null, "is_private": false, "id": 147365, "time": "2011-06-22T16:37:40Z", "creator": "mturk@apache.org", "creation_time": "2011-06-22T16:37:40Z", "text": "The fix was applied to the trunk as r1137160\nhttp://svn.apache.org/viewvc?view=revision&revision=1137160\n\nThanks for filling the issue with the better explanation of symptoms.\nI tested the patch and it cleanly applies for all mod_jk versions from\n1.2.27 up, so anyone affected with the bug can use the attached patch\nuntil 1.2.32 gets released."}, {"count": 2, "tags": [], "bug_id": 51417, "attachment_id": null, "id": 147366, "time": "2011-06-22T16:40:31Z", "creator": "mturk@apache.org", "creation_time": "2011-06-22T16:40:31Z", "is_private": false, "text": "Oops. Gave a wrong SVN reference. It's r1137200\nhttp://svn.apache.org/viewvc?rev=1137200&view=rev"}]