[{"count": 0, "tags": [], "bug_id": 51422, "text": "Just got this back from the Microsoft docs team:\n\nIn regards to your question about how to flag an .XLS file so that\nall formula fields will be recalculated the next time it's opened by Excel,\nthere is not a record specifically for this purpose. However, there is one\nthat can be used to trigger certain behavior in Excel that will accomplish\nthe same results.\n\nPlease take a look at MS-XLS section\n2.4.215<http://msdn.microsoft.com/en-us/library/dd909116(office.12).aspx>.\nThe dwBuildId value of the RecalcId record, when set to 0, will tell Excel\nthat it needs to recalculate all formulas in the workbook the next time the\nfile is opened. When the recalculation is complete, Excel will update\ndwBuildId to the correct value and future recalculations will be performed\naccording to the Workbook Calculation settings.\n\nIt is not recommended to change the dwBuildId to a value other than what Excel sets it to, or zero.\n\n\nWe currently have something on the sheet to request formula recalculation, \nsetForceFormulaRecalculation(boolean), which apparently doesn't always work. We should therefore probably add the recalcid trick in too", "id": 147387, "time": "2011-06-22T21:20:29Z", "creator": "apache@gagravarr.org", "creation_time": "2011-06-22T21:20:29Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "yegor@dinom.ru", "attachment_id": null, "text": "Committed in r1140210\n\nI added  Workbook.setForceFormulaRecalculation. Users are recommended to use it instead of Sheet.setForceFormulaRecalculation. The latter works only on sheet level and may not work if formulas refer to other sheets or external sources. \nI tested in Excel 2003 and 2010 and the recalcid trick always worked.\n\nHSSF implements Workbook.setForceFormulaRecalculation via RecalcIdRecord. \nXSSF does it via CTCalcPr.calcId property which is direct counterpart of RecalcId. \n\nI also added some notes about formula recalculation on http://poi.apache.org/spreadsheet/eval.html\n\nYegor", "id": 147531, "time": "2011-06-27T15:55:44Z", "bug_id": 51422, "creation_time": "2011-06-27T15:55:44Z", "is_private": false}, {"count": 2, "tags": [], "text": "Thanks for tackling this!\n\nI think it'd probably make sense to add a getter too. That way, if you open a file from POI (or from the python xlrt, which is where this originally started!) you can easily check to see if the formula values are going to be there+valid. What do you think?", "attachment_id": null, "bug_id": 51422, "id": 147532, "time": "2011-06-27T16:01:34Z", "creator": "apache@gagravarr.org", "creation_time": "2011-06-27T16:01:34Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 51422, "attachment_id": null, "id": 147652, "time": "2011-06-30T15:54:30Z", "creator": "yegor@dinom.ru", "creation_time": "2011-06-30T15:54:30Z", "is_private": false, "text": "Workbook.getForceFormulaRecalculation added in r1141585\n\nYegor\n\n(In reply to comment #2)\n> Thanks for tackling this!\n> \n> I think it'd probably make sense to add a getter too. That way, if you open a\n> file from POI (or from the python xlrt, which is where this originally\n> started!) you can easily check to see if the formula values are going to be\n> there+valid. What do you think?"}]