[{"count": 0, "tags": [], "bug_id": 51446, "text": "Created attachment 27222\nRTF message\n\nThe attached file as been created as following (Microsoft Outlook 2007):\n\n- Go to Tools -> Options -> Mail Format -> Signatures\n- Create a new signature (e.g. Demo)\n- Add a picture to your new signature (e.g. My Documents/My Pictures/Sample Pictures/Blue hills.jpg)\n- Send an email using that signature\n- Use the received message to do the test\n\nI want to be able to extract the image data in the signature using MAPIMessage class, but the attachment has a null value in the attachData property.\n\nOn the other hand, this message has the following header:\n\nContent-Type: application/ms-tnef; name=\"winmail.dat\"", "id": 147554, "time": "2011-06-28T10:51:23Z", "creator": "efoncubierta@zaizi.com", "creation_time": "2011-06-28T10:51:23Z", "is_private": false, "attachment_id": 27222}, {"count": 1, "tags": [], "bug_id": 51446, "is_private": false, "text": "If the attachment data is empty, then that normally means there's a attachmentDirectory instead. Did you check that?", "id": 148295, "time": "2011-07-31T19:34:32Z", "creator": "apache@gagravarr.org", "creation_time": "2011-07-31T19:34:32Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 51446, "text": "Nick,\n\nIf the attachment data is empty, I can get the attachment as embedded message by using attachment.attachmentDirectory.getAsEmbededMessage() which helps to get the .msg attachment properties like ( from,CC,TO,BCC, etc).\n\nBut I have the special use case, where I want to get the embeddedMessage as binary. If I save the binary as .msg, I should able to open that with Microsoftoutlook. Is there anyway I can get the embedded message as binary?.\n\nIf this feature is not already there , Will you please add the functionality to extract the binary or InputStream for the given MAPIMessage?.\n\nThanks\nSelva", "id": 157242, "time": "2012-04-06T19:00:02Z", "creator": "vselvakumar81@yahoo.com", "creation_time": "2012-04-06T19:00:02Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "vselvakumar81@yahoo.com", "text": "Nick,\n\nIf the attachment data is empty, I can get the attachment as embedded message\nby using attachment.attachmentDirectory.getAsEmbededMessage() which helps to\nget the .msg attachment properties like ( from,CC,TO,BCC, etc).\n\nBut I have the special use case, where I want to get the embeddedMessage as\nbinary. If I save the binary as .msg, I should able to open that with\nMicrosoftoutlook. Is there anyway I can get the embedded message as binary?.\n\nIf this feature is not already there , Will you please add the functionality to\nextract the binary or InputStream for the given MAPIMessage?.\n\nThanks\nSelva", "count": 3, "id": 157243, "time": "2012-04-06T19:01:09Z", "bug_id": 51446, "creation_time": "2012-04-06T19:01:09Z", "is_private": false}, {"count": 4, "tags": [], "creator": "apache@gagravarr.org", "text": "The outlook format doesn't work that way, so there's no input stream to just fetch. Nested outlook files are stored expanded in the ole2 stream. (Other embedded files are typically stored as just the one entry, so they can be fetched directly)\n\nYou could try copying the root directory of the attachment into a new POIFSFileSystem (there's a POIFS util to help with that), and see if that plays nicely with a copy of outlook. That should work just fine with HSMF, as that's largely analogous to what getAsEmbededMessage() does, I just don't know if there's any extra magic that a .msg file needs for outlook that is stored outside of the directory", "id": 157743, "time": "2012-04-09T17:43:55Z", "bug_id": 51446, "creation_time": "2012-04-09T17:43:55Z", "is_private": false, "attachment_id": null}]