[{"count": 0, "tags": [], "bug_id": 51442, "attachment_id": null, "is_private": false, "id": 147546, "time": "2011-06-28T08:50:56Z", "creator": "mw-mw@gmx.net", "creation_time": "2011-06-28T08:50:56Z", "text": "<property name=\"folder\" value=\"some-location\" />\n.... \n\n<!-- property 'folder' could be set here - in case not use some default -->\n<available file=\"W:\\in\\dows\" type=\"dir\" property=\"folder\" value=\"W:\\in\\dows\" />\n<available file=\"/lin/ux\"    type=\"dir\" property=\"folder\" value=\"/lin/ux\" />\n\nIn case the folder named 'W:\\in\\dows' does not exist, the code works as expected. The the value of 'folder' is not modified.\n\nIn case the folder named 'W:\\in\\dows' exists the available task complains about using a DEPRECATED feature and overwrites the property value of 'folder'. I'd expected not to modify 'folder' because its value has already been set before."}, {"count": 1, "attachment_id": null, "bug_id": 51442, "text": "Properties used to be mutable in Ant before Ant 1.1 was released (eleven years\nago, I know) and not all tasks had been tidied up to honor the new immutability\nrule.  One of them was <available>.\n\nSome people already used Ant before its first release and relied on properties\nbeing mutable - not only did they complain about the change, they also discovered\nthe backdoor that was <available> and it was shared as a \"workaround\" among\nusers.\n\nSince the Ant developers had by then become very sensitive to backwards\ncompatibility issues (the mutable -> immutable change did a lot to make\nthem, errm, us sensitive) the non-regular behavior of <available> was kept\nbut now created a big deprecation warning.  Many other tasks have been\nchanged as nobody had discovered they could be used as backdoors as well before\nthey were fixed.\n\nSo much for background, the usual \"historical reasons\".\n\nIn your case, you should wrap the available task into a <condition>\nsince condition will do the right thing.", "id": 147550, "time": "2011-06-28T10:00:00Z", "creator": "bodewig@apache.org", "creation_time": "2011-06-28T10:00:00Z", "tags": [], "is_private": false}]