[{"count": 0, "tags": [], "creator": "jeanpralo@gmail.com", "text": "Hi there,\n\n\nI've just experienced some pretty critical issues with a rewriting rule allowing a user to list your local filesystem where the apache2 is running.\n\nCreate this simple vhost :\n\n<VirtualHost *:80>\n        ServerName test.com\n\n        UseCanonicalName On\n\n        DocumentRoot /RDC/test.com\n\n       <Directory /RDC/test.com>\n               Options -Indexes +FollowSymLinks\n                AllowOverride None\n        </Directory>\n\n        RewriteEngine On\n        RewriteRule     ^(.*)                                   $1    [last]\n\n       RewriteLog /tmp/test.log\n       RewriteLogLevel 3\n\n        LogFormat \"%h %l %u %t \\\"%r\\\" %>s %b \\\"%{Referer}i\\\" \\\"%{User-agent}i\\\" t=%T\" time\n        LogFormat \"%{X-Forwarded-For}i %l %u %t \\\"%r\\\" %>s %b \\\"%{Referer}i\\\" \\\"%{User-Agent}i\\\" t=%T\" f5_forwarder\n\n        SetEnvIf X-Forwarded-For \"^.*\\..*\\..*\\..*\" is-forwarder\n\n        CustomLog /data/test.log time env=!is-forwarder\n        CustomLog /data/test.log f5_forwarder env=is-forwarder\n\n        ServerSignature Off\n\n</VirtualHost>\n\n\n\nOnce this is done try to access http://test.com/etc/ . The mod_autoindex and mod_dir must be loaded, and the DirectoryIndex must contain at least index.html.\n\n\nYou should be able to list the content of the directory if the user who is running has the legitimate right.", "id": 147791, "time": "2011-07-06T13:33:05Z", "bug_id": 51482, "creation_time": "2011-07-06T13:33:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 51482, "is_private": false, "text": "If you allow /etc/ to be served and configure it for directory listings, and you substitute /etc/ in a rewriterule, it will be served.  In most configurations with normal <Directory /> restrictions, this is not a concern.\n\nRewriteRule says:\n\nfile-system path\nDesignates the location on the file-system of the resource to be delivered to the client.\nURL-path\nA DocumentRoot-relative path to the resource to be served. Note that mod_rewrite tries to guess whether you have specified a file-system path or a URL-path by checking to see if the first segment of the path exists at the root of the file-system. For example, if you specify a Substitution string of /www/file.html, then this will be treated as a URL-path unless a directory named www exists at the root or your file-system, in which case it will be treated as a file-system path. If you wish other URL-mapping directives (such as Alias) to be applied to the resulting URL-path, use the [PT] flag as described below.\n\n\nThis is unlikely to be changed in 2.2, but there is has been dicussion in 2.4 to split RewriteRule into two directives so it's always only mapping URI->URI or URI->Filesystem.", "id": 147797, "time": "2011-07-06T15:01:52Z", "creator": "covener@gmail.com", "creation_time": "2011-07-06T15:01:52Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "jeanpralo@gmail.com", "is_private": false, "id": 147803, "time": "2011-07-06T21:22:30Z", "bug_id": 51482, "creation_time": "2011-07-06T21:22:30Z", "tags": [], "text": "Yep the thing is that I didn't pay enough attention when setting up those servers. Hopefully logs didn't show any bad behaviors. Lucky me !\n\n\nBut this is really a strange/dangerous behavior to me. On debian the <Directory /> is not set to Options -Indexes by default. I imagine there are lot of issues of that sort out there. There should be at least more information on that point ! And it should be a another method such as RewriteRuleForFs, so that dumb people like me won't make mistake :)\n\nOk this RewriteRule is kind of ...... How could I explain it without hurting my developpers feeling, can't find.\n\n\nAnyway thanks for the explanation I was trying to understand what was going on with gdb,you saved me a couple of hours :)\n\n\nI guess the case can be closed then ?!"}]