[{"count": 0, "tags": [], "bug_id": 51514, "text": "Created attachment 27290\nA ZIP file which combines a patch and a test doc.\n\nI noticed two issues, both related to the fact that the NPOIFSFileSystem instance isn't propagated correctly everywhere it should be.\n\nIf I create a HSSFWorkbook from an NPoiFileSystem then\n\n1. I get an NPE in HSSFWorkbook.write(OutputStream stream). It's because it passes a POIFSFileSystem to the copyNodesMethod. The reference is null. The code should check which of the filesystem references is not-null and use the correct one.\n\n2. I get NPEs while working with the HSSFObjectData instances obtained from the HSSFWorkbook.getAllEmbeddedObject. This is because they are all created using a constructor which accepts an POIFSFileSystem. If this is null - problems arise.", "id": 147939, "time": "2011-07-15T14:47:13Z", "creator": "antoni.mylka@aduna-software.com", "creation_time": "2011-07-15T14:47:13Z", "is_private": false, "attachment_id": 27290}, {"count": 1, "tags": [], "bug_id": 51514, "text": "NPOIFS doesn't currently support writing. Doesn't matter if you pass the NPOIFS instance along into the write method, it won't help - you can't currently write out\n\nOnce we've finished the NPOIFS write support, we'll then need to tweak how HSSF does writing\n\nThe object data is reading so should be fixed, will look into that", "id": 147940, "time": "2011-07-15T14:52:03Z", "creator": "apache@gagravarr.org", "creation_time": "2011-07-15T14:52:03Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "apache@gagravarr.org", "is_private": false, "id": 147942, "creation_time": "2011-07-15T15:19:38Z", "time": "2011-07-15T15:19:38Z", "bug_id": 51514, "text": "Looks like we can fix both easily by just using the DirectoryNode roots, rather than passing in the POIFSFileSystem and immediately getting the root\n\nFixed in r1147179 and r1147183\n\nI've applied your test, with some changes in r1147188, thanks for that!", "attachment_id": null}]