[{"count": 0, "tags": [], "bug_id": 51522, "attachment_id": null, "is_private": false, "id": 147963, "time": "2011-07-18T03:35:32Z", "creator": "chealer@gmail.com", "creation_time": "2011-07-18T03:35:32Z", "text": "The MPM page contains:\n\nThe server ships with a selection of Multi-Processing Modules (MPMs) which are responsible for binding to network ports on the machine, accepting requests, and dispatching children to handle the requests.\n\nThe French translation is:\n\nCertains Modules Multi-Processus (MPMs) sont responsables de l'association aux ports réseau de la machine, acceptent les requêtes, et se chargent de répartir ces dernières entre les différents processus enfants.\n\nThe formulation suggests that some MPMs are not responsible for binding to network ports, etc. A translation of the French version would be:\n\nSome Multi-Processing Modules (MPMs) are responsible for binding to network ports on the machine, accepting requests, and dispatching children to handle the requests.\n\nA correct translation would be:\n\nLe serveur contient une variété de Modules Multi-Processus (MPMs) qui sont responsables de l'association aux ports réseau de la machine, acceptent les requêtes, et se chargent de répartir ces dernières entre les différents processus enfants."}, {"count": 1, "tags": [], "creator": "lucien.gentis@medecine.uhp-nancy.fr", "attachment_id": null, "is_private": false, "id": 148097, "time": "2011-07-23T14:07:47Z", "bug_id": 51522, "creation_time": "2011-07-23T14:07:47Z", "text": "(In reply to comment #0)\n> The MPM page contains:\n> \n> The server ships with a selection of Multi-Processing Modules (MPMs) which are\n> responsible for binding to network ports on the machine, accepting requests,\n> and dispatching children to handle the requests.\n> \n> The French translation is:\n> \n> Certains Modules Multi-Processus (MPMs) sont responsables de l'association aux\n> ports réseau de la machine, acceptent les requêtes, et se chargent de répartir\n> ces dernières entre les différents processus enfants.\n> \n> The formulation suggests that some MPMs are not responsible for binding to\n> network ports, etc. A translation of the French version would be:\n> \n> Some Multi-Processing Modules (MPMs) are responsible for binding to network\n> ports on the machine, accepting requests, and dispatching children to handle\n> the requests.\n> \n> A correct translation would be:\n> \n> Le serveur contient une variété de Modules Multi-Processus (MPMs) qui sont\n> responsables de l'association aux ports réseau de la machine, acceptent les\n> requêtes, et se chargent de répartir ces dernières entre les différents\n> processus enfants.\n\nYou are right.\n\nUpdate is coming soon.\n\nThanks for reporting\n\nLucien"}]