[{"count": 0, "tags": [], "creator": "dave@daveboden.com", "attachment_id": 27304, "text": "Created attachment 27304\nPatch file\n\nI've got Chainsaw v2 working connecting to Tibco EMS (JMS) and receiving log updates. To do so, I needed to enter a password to connect to the Tibco EMS server.\n\nJMSReceiverBeanInfo currently doesn't let you specify a password, so you don't get the password entry box on the GUI. A small change gets things working.\n\n(I've also moved the pom.xml file over from 1.1-SNAPSHOT to 1.1 of the apache-log4j-component artifact now that 1.1 has been built and seems to have everything required. I only tend to point at snapshots when required, preferring to point at release versions when there's nothing new in the snapshot that's needed or desirable.", "id": 148053, "time": "2011-07-21T10:04:25Z", "bug_id": 51538, "creation_time": "2011-07-21T10:04:25Z", "is_private": false}, {"count": 1, "tags": [], "creator": "dave@daveboden.com", "attachment_id": 27305, "text": "Created attachment 27305\nShows the new password text entry box on Chainsaw V2.", "id": 148054, "time": "2011-07-21T10:07:31Z", "bug_id": 51538, "creation_time": "2011-07-21T10:07:31Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 51538, "attachment_id": null, "id": 148068, "time": "2011-07-21T16:45:48Z", "creator": "sdeboy@iname.com", "creation_time": "2011-07-21T16:45:48Z", "is_private": false, "text": "It seems we should also add the support for the 'promptForUserInfo' parameter, and make this a 'visual receiver' so the receiver can provide a gui dialog prompting for username and password if this is set, for those who don't want to embed a password in the configuration file.\n\nI can look into adding this."}, {"count": 3, "tags": [], "creator": "dave@daveboden.com", "is_private": false, "id": 148076, "attachment_id": null, "bug_id": 51538, "creation_time": "2011-07-21T22:09:54Z", "time": "2011-07-21T22:09:54Z", "text": "If time allows, I might consider adding a JMS Implementation classpath as an additional setting. By specifying the location of the Tibco EMS, Active MQ or other implementation jar(s), I can avoid hacking the chainsaw.bat file altogether. At the moment, I have to add the Tibco EMS tibems.jar onto the startup classpath.\n\nThis would only work on Java WebStart if the package is signed."}, {"count": 4, "tags": [], "creator": "sdeboy@iname.com", "attachment_id": null, "text": "In chainsaw, there is a plugin classpath - $userhome/.chainsaw/plugins - you may be able to add your jar there and have it just 'work' (remove the security manager in general prefs just to make sure it's ok).", "id": 148077, "time": "2011-07-21T22:12:26Z", "bug_id": 51538, "creation_time": "2011-07-21T22:12:26Z", "is_private": false}]