[{"count": 0, "tags": [], "creator": "rod@vagg.org", "is_private": false, "text": "I'm adding some fields to a subclass of org.apache.catalina.valves.AccessLogValve but createLogElements() is the closest extension point available. Rather than reimplement the functionality there it would be preferable if both of the createAccessLogElement() methods were protected rather than private then it's a simple method of matching the char you want to use and falling back to super.createAccessLogElement().", "id": 148282, "time": "2011-07-30T02:33:45Z", "bug_id": 51588, "creation_time": "2011-07-30T02:33:45Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 51588, "is_private": false, "text": "Are those new fields specific for your environment? Maybe you can propose them to be added to AccessLogValve?", "id": 148285, "time": "2011-07-30T12:18:47Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-07-30T12:18:47Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "rod@vagg.org", "text": "I want to add a %f and %F as possible options in the custom log pattern to log IP address and name safely extracted from the X-Forwarded-For header with a fallback to HttpServletRequest.getRemoteAddr().\n\nJust to back up and clarify my original bug report in case it wasn't clear (now that I re-read it I think I could have been clearer):\n\nAt the bottom of org.apache.catalina.valves.AccessLogValve, the last two private methods are:\n\nprivate AccessLogElement createAccessLogElement(char pattern)\n\nand\n\nprivate AccessLogElement createAccessLogElement(String header, char pattern)\n\nIf you want to add another 'field' to the custom log format pattern by subclassing AccessLogValve then you have to go up to the 3rd last method:\n\nprotected AccessLogElement[] createLogElements()\n\nbut unfortunately it contains a lot of good logic that would have to be either completely copied or duplicated in some way. Overriding one or both of the two private methods lets you simply plug in your addition and not replace any of the functionality of the original AccessLogValve.\n\nThis is the same for both the version 6 and 7 sources.\n\nSo my suggestions is simply to replace 'private' with 'protected' in the last 2 methods in AccessLogValve.\n\nOf course I'd love the new options to be added to the Catalina core but I suspected that they may be slightly peripheral? Perhaps not. I've just finished writing up the details for anyone else that may have a use for this functionality at: http://rod.vagg.org/2011/07/handling-x-forwarded-for-in-java-and-tomcat/\n\nIf you think this would be useful to integrate into Catalina then I'd be more than happy to refactor it all into AccessLogValve (it uses an additional utility class as it is now) and post a patch here; please let me know what you think about that option.\n\nI think changing those access modifiers would be useful in either case by the way.", "id": 148286, "time": "2011-07-30T12:49:30Z", "bug_id": 51588, "creation_time": "2011-07-30T12:49:30Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 51588, "text": "Note, that\n\n1. Parsing of X-Forwarded-For is already implemented in Tomcat 7 in RemoteIpValve and RemoteIpFilter.  RemoteIpValve was backported to Tomcat 6, though maybe not all features of it.\n\n2. AccessLogValve in Tomcat 7 can use request attributes that are set by RemoteIpValve if you set AccessLogValve.requestAttributesEnabled property to true.\n\n3. You can set any attribute on the request object (even in the Valve itself) and reference it later as %{xxx}r", "id": 148287, "time": "2011-07-30T13:41:54Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-07-30T13:41:54Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 51588, "text": "Methods changed in 7.0.x and will be included in 7.0.20 onwards.\n\nSame change proposed for 6.0.x.\n\nEven if Tomcat does support this particular use case, the general one of extensibility is a valid one.", "id": 148294, "time": "2011-07-31T17:41:17Z", "creator": "markt@apache.org", "creation_time": "2011-07-31T17:41:17Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "markt@apache.org", "text": "This has been fixed in 6.0.x and will be included in 6.0.33 onwards.", "id": 148545, "time": "2011-08-11T09:17:36Z", "bug_id": 51588, "creation_time": "2011-08-11T09:17:36Z", "is_private": false, "attachment_id": null}]