[{"count": 0, "tags": [], "creator": "Lothsahn@yahoo.com", "attachment_id": null, "text": "The zip target performs validation to ensure the fileset exists before doing zip.  Unfortunately, this fileset validation is performed ignoring the basedir.  For example, assume the following directories exist:\n\n\n\nCase #1:\n\nC:\\build\nC:\\zipOutput\nC:\\zipOutput\\temp\n\n\nAssume that we want to zip the temp directory to C:\\zipOutput\\temp.zip, and that our build process is running inside C:\\build (the ant scripts and basedir for ant is that directory).  To do this build, we would make the following zip task:\n\nAttributes:\nzip-base-dir=C:\\zipOutput\nzip-filename=temp.zip\nzip-dir-path=temp\n\nMacro:\n<zip destfile=\"@{zip-base-dir}/@{zip-filename}\" basedir=\"@{zip-base-dir}\">\n  <fileset dir=\"@{zip-dir-path}\" />\n</zip>\n\nRunning this task would result in the following output:\nC:\\build\\build.xml:102: C:\\build\\temp not found.\n\nThis is because the ant zip target does validation that the source fileset exists PRIOR to zipping.  However, it does not consider the \"basedir\" flag in this case, so errors are thrown.\n\n\n\n\nCase #2:\n\nLet's try to do the same thing, but this time, add two new folders:\nC:\\build\\doc\nC:\\zipOutput\\doc\n\nAttributes:\nzip-base-dir=C:\\zipOutput\nzip-filename=doc.zip\nzip-dir-doc=temp\n\nMacro:\n<zip destfile=\"@{zip-base-dir}/@{zip-filename}\" basedir=\"@{zip-base-dir}\">\n  <fileset dir=\"@{zip-dir-path}\" />\n</zip>\n\n\nIn this case, the zip target will succeed because the validation first validates that C:\\build\\doc exists (it does), then it proceeds to zip the C:\\zipOutput\\doc folder into C:\\zipOutput\\doc.zip", "id": 148338, "time": "2011-08-02T19:03:15Z", "bug_id": 51602, "creation_time": "2011-08-02T19:03:15Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 51602, "text": "You are misunderstanding what basedir does.\n\nbasedir and nested filesets are totally unrelated.  With basedir you create an implicit fileset with its dir attribute set to the value given in basedir.  I.e. you now have two completely independent filesets.\n\nbasedir in any of the \"directory based tasks\" really only is historical baggage we have to carry around for backwards compatibility.  Don't use it for anythig, only use nested filesets (or other suitable resource collections).\n\nThe dir attribute of the fileset is resolved against your project's basedir, not the one of your task.\n\nIf your macrodef is close to what you are trying to do then I guess you want\n\n<zip destfile=\"@{zip-base-dir}/@{zip-filename}\">\n  <fileset dir=\"@{zip-base-dir}/@{zip-dir-path}\" />\n</zip>\n\nbut I'm not sure I understand your usecase.\n\nPlease use the user mailing list if you need additional information.", "id": 148386, "time": "2011-08-04T16:03:02Z", "creator": "bodewig@apache.org", "creation_time": "2011-08-04T16:03:02Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 51602, "attachment_id": null, "id": 148413, "time": "2011-08-05T15:08:32Z", "creator": "Lothsahn@yahoo.com", "creation_time": "2011-08-05T15:08:32Z", "is_private": false, "text": "Stefan:\n\nTried to subscribe to your mailing list to respond there (as requested), but my sub request keeps getting bounced by the Apache mailserver as spam:\nSorry, we were unable to deliver your message to the following address.\n\n<user-sc.1312555838.jpmeeinonbbcmahgmdpn-lothsahn=yahoo.com@ant.apache.org>:\nRemote host said: 552 spam score (6.2) exceeded threshold (DCC_CHECK,FREEMAIL_FROM,HTML_MESSAGE,MIME_HTML_MOSTLY,RCVD_IN_DNSWL_NONE,SPF_PASS ) [BODY]\n\n\n\nThank you for looking at this bugreport.  You stated:\nbasedir and nested filesets are totally unrelated.  With basedir you create an\nimplicit fileset with its dir attribute set to the value given in basedir. \nI.e. you now have two completely independent filesets.\n\n\nI don't think this is true.  In the above example, my project basedir is \"C:\\build\".  When I specify basedir attribute, ant creates the zip based on the specified basedir.  \n\nFor example:\nIn my above case 2, the project basedir is C:\\build and the specified basedir is C:\\zipOutput.  The Zip task creates C:\\zipOutput\\doc.zip from C:\\zipOutput\\doc.  If the implicit fileset and explicit fileset were not related, ant should have zipped the C:\\build\\doc directory, which it does not do.\n\nThe bug:\nAnt is validating that <fileset using project basedir> exists, then begins to zip <fileset using specified basedir>.\n\n\n\"Don't use it [basedir] for anythig, only use nested filesets (or other suitable resource collections).\"\n\nIf we really want people to avoid using the basedir attribute (which I am totally fine with, as your suggested example does workaround the issue), can we simply mark basedir as deprecated in the ant Zip target documentation?\n\n\nI believe:\n1) This bug should be fixed OR\n2) basedir should be marked as \"deprecated, use filesets instead of basedir/includes\" on the ant Zip Task documentation"}, {"attachment_id": null, "tags": [], "creator": "bodewig@apache.org", "text": "(In reply to comment #2)\n\n> Tried to subscribe to your mailing list to respond there (as requested), but my\n> sub request keeps getting bounced by the Apache mailserver as spam:\n> Sorry, we were unable to deliver your message to the following address.\n> \n> <user-sc.1312555838.jpmeeinonbbcmahgmdpn-lothsahn=yahoo.com@ant.apache.org>:\n> Remote host said: 552 spam score (6.2) exceeded threshold\n> (DCC_CHECK,FREEMAIL_FROM,HTML_MESSAGE,MIME_HTML_MOSTLY,RCVD_IN_DNSWL_NONE,SPF_PASS\n> ) [BODY]\n\nLearn not to send HTML emails ;-)\n\n> Thank you for looking at this bugreport.  You stated:\n> basedir and nested filesets are totally unrelated.  With basedir you create an\n> implicit fileset with its dir attribute set to the value given in basedir. \n> I.e. you now have two completely independent filesets.\n> \n> \n> I don't think this is true. In the above example, my project basedir is\n> \"C:\\build\".  When I specify basedir attribute, ant creates the zip based on the\n> specified basedir.  \n\nYes, this is the implicit fileset at work, the one using the task's basedir attribute that you didn't spell out explicitly.\n\n> \"Don't use it [basedir] for anythig, only use nested filesets (or other\n> suitable resource collections).\"\n> \n> If we really want people to avoid using the basedir attribute (which I am\n> totally fine with, as your suggested example does workaround the issue), can we\n> simply mark basedir as deprecated in the ant Zip target documentation?\n\nThere are valid use-cases where basedir just means less typing\n\n<zip basedir=\"foo\" destfile=\"foo.zip\"/>\n\nrather than\n\n<zip destfile=\"foo.zip\">\n  <fileset dir=\"foo\"/>\n</zip>\n\nSo maybe my statement has been too strong.  But you shouldn't mix basedir\nand filesets.", "count": 3, "id": 148435, "time": "2011-08-06T05:07:59Z", "bug_id": 51602, "creation_time": "2011-08-06T05:07:59Z", "is_private": false}]