[{"count": 0, "tags": [], "creator": "johnashudson@gmail.com", "attachment_id": null, "text": "It seems sessions are not serialized to SESSIONS.ser when we manually stop Tomcat by executing the shutdown.sh script. Thus, if we restart Tomcat by executing the startup.sh script, previous active sessions are lost.\n\nHowever, if we stop a particular application via the Tomcat Manager, the SESSIONS.ser file is created and sessions are restored successfully after the application is started again via the Tomcat Manager.\n\nNot sure if previous versions of Tomcat 7 have the same problem, but 7.0.19 is affected. Tomcat 6 works fine.\n\nThank you very much!", "id": 148507, "time": "2011-08-09T13:21:08Z", "bug_id": 51638, "creation_time": "2011-08-09T13:21:08Z", "is_private": false}, {"count": 1, "attachment_id": null, "creator": "markt@apache.org", "is_private": false, "id": 148511, "time": "2011-08-09T16:06:12Z", "bug_id": 51638, "creation_time": "2011-08-09T16:06:12Z", "tags": [], "text": "This works for me with the latest 7.0.x code and the most recent change in this area was to fix a bug in 7.0.17.\n\nThis looks like a configuration problem so please use the users mailing list for assistance."}, {"text": "Hello Mark,\n\nYou're totally right, it works well on 7.0.19. I was trying this on a server with 7.0.16 while all my other servers already run 7.0.19. I didn't realise this one hadn't been updated to the latest version. Please accept my apologies for making you loose your time testing this.\n\nRegards,\n\nJohnas.", "tags": [], "creator": "johnashudson@gmail.com", "attachment_id": null, "count": 2, "id": 148512, "time": "2011-08-09T19:53:56Z", "bug_id": 51638, "creation_time": "2011-08-09T19:53:56Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of bug 51310 ***", "id": 148513, "time": "2011-08-09T20:12:26Z", "bug_id": 51638, "creation_time": "2011-08-09T20:12:26Z", "is_private": false}]