[{"count": 0, "tags": [], "creator": "lalitha.sg@gmail.com", "is_private": false, "text": "Excel file is created and some data is written into it.\nThe file size seems to be less.And the data was not getting read again.\nOn opening the file and saving it , the file size increased.\n\nNot able to figure the reason behind this.", "id": 148647, "time": "2011-08-16T16:43:30Z", "bug_id": 51666, "creation_time": "2011-08-16T16:43:30Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 51666, "text": "This is to be expected. Excel has various tricks for storing several cells in one record, such as MulRkRecord and MulBlankRecord. POI reads these and expands them, but currently is not able to decide when to optimise by creating them. As such, files with lots of adjacent blank cells, or lots of adjacent simple numbers will increase in size when written.", "id": 148648, "time": "2011-08-16T16:47:37Z", "creator": "apache@gagravarr.org", "creation_time": "2011-08-16T16:47:37Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 51666, "text": "(In reply to comment #1)\n> This is to be expected. Excel has various tricks for storing several cells in\n> one record, such as MulRkRecord and MulBlankRecord. POI reads these and expands\n> them, but currently is not able to decide when to optimise by creating them. As\n> such, files with lots of adjacent blank cells, or lots of adjacent simple\n> numbers will increase in size when written.\n\nBut the generated file is not readable as it show there is no data even though data is present. After opening and saving the file the data is readable.", "id": 148649, "time": "2011-08-16T17:34:23Z", "creator": "lalitha.sg@gmail.com", "creation_time": "2011-08-16T17:34:23Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "yegor@dinom.ru", "is_private": false, "text": "Please attach a test case that demonstrates what's wrong. Without additional information we can't do much to help you.\n\nYegor", "id": 154362, "time": "2012-02-29T12:03:31Z", "bug_id": 51666, "creation_time": "2012-02-29T12:03:31Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 51666, "is_private": false, "text": "No response for a long time, therefore I am resolving this now, please reopen with more information if this is still an issue for you.", "id": 181968, "time": "2015-03-22T19:36:08Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-03-22T19:36:08Z", "attachment_id": null}]