[{"count": 0, "tags": [], "creator": "hannes@erven.at", "attachment_id": 27407, "id": 148697, "time": "2011-08-18T21:38:09Z", "bug_id": 51683, "creation_time": "2011-08-18T21:38:09Z", "is_private": false, "text": "Created attachment 27407\nFirst shot at loading and decoding Shape Groups and all their children\n\nAt the moment (Rev#6041) the support for Shape Groups and Shapes in general is limited in HSSF; e.g. only the top Shape objects are decoded, any shape contained in a group is (silently!) skipped.\n\nI've tried to rework the EscherAggregate.convertUserRecordsToModel() method to recursively parse down all the Shapes and their children. Due to my limited knowledge of the Escher file format and lack of understanding for POI interals, the attempt more or less failed: although POI seems to load the Shape tree correctly, it loses a lot of the shape's properties and saves only damaged XLS files.\n\nI'll attach my patch attempt and would be glad for any feedback. I'll also be glad to hack along and/or contribute in other ways. Thanks."}, {"count": 1, "tags": [], "bug_id": 51683, "is_private": false, "text": "Thanks for the patch. The code looks good, but I'm reluctant to apply it without a unit test. \n\nAny chance you could create a test(s) that would create a worksheet with a drawing group, write, read back and assert the following:\n\n - shapes from top level group are decoded\n - shapes from nested groups are decoded\n\nI see that you commented clearEscherRecords(). Can you explain why or add a test that justifies this change:\n\n+\t\t// Now, clear any trace of what records make up\n+\t\t//  the patriarch\n+\t\t// Otherwise, everything will go horribly wrong\n+\t\t//  when we try to write out again....\n+//\t\tclearEscherRecords();\n+\t\tdrawingManager.getDgg().setFileIdClusters(new EscherDggRecord.FileIdCluster[0]);\n\n\nRegards,\nYegor", "id": 149148, "time": "2011-09-11T11:04:39Z", "creator": "yegor@dinom.ru", "creation_time": "2011-09-11T11:04:39Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "hannes@erven.at", "attachment_id": null, "is_private": false, "id": 149157, "time": "2011-09-11T19:30:13Z", "bug_id": 51683, "creation_time": "2011-09-11T19:30:13Z", "text": "I have to confess that I solved the issue that made me investigate this by other means.\nAnyways, I'm of course willing to try to prepare a test case. What is problematic is that a patched version will just read nested shape groups, but always produces corrupt files on output. I suspect that this is due to incomplete loading of the shape's properties, but I can only guess.\n\nRegarding the clearEscher() comments, I seem to have overlooked this change when creating the patch. It is just a formatting change that my IDE seems to have automatically performed... :-/"}, {"count": 3, "tags": [], "text": "Corrupted output on read-write-read of workbooks with drawings is a weak place of HSSF. Current code is oriented on creating new drawings from scratch, but read-modify-write often results in corruption. In any case, it is better that you upload a test case for the \"read only\" case and we will check-in your code in svn.", "is_private": false, "id": 149173, "creation_time": "2011-09-12T11:49:41Z", "time": "2011-09-12T11:49:41Z", "creator": "yegor@dinom.ru", "bug_id": 51683, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 51683, "is_private": false, "text": "This problem should be fixed in trunk.\n\nPlease try with a nightly build - see download links on http://poi.apache.org/\nor build yourself from SVN trunk, see http://poi.apache.org/subversion.html", "id": 161292, "time": "2012-08-12T11:35:52Z", "creator": "superrubiroyd@gmail.com", "creation_time": "2012-08-12T11:35:52Z", "attachment_id": null}]