[{"count": 0, "text": "Dear Tomcat developers,\n\nby today i tried to use the Spring Security 3.0 Package in a Spring 3.0.5 Web Application with a Tomcat 7.0.19 on Java version 1.6.0_25.\n\nWhen trying to invoke the action \"j_spring_security_check\" (which performs the authentication process) in the HTML login form, Tomcat prompts with a HTTP 404 Error \"The requested document is not available\"\n\nThe usage of exact the same application .war file in a Tomcat 6 and 5.5 works perfectly fine.\nResearches about this issue in Google brought no results except the complains of several other developers facing the same phenomenon.\n\nSo i suspect this to be a bug within Tomcat 7, which i would like to report you in this message. \nIf desired, i will provide more details on the code and configuration used to produce this error.\n\nBest regards,\n\nThilo Krawietz", "bug_id": 51682, "is_private": false, "id": 148695, "time": "2011-08-18T21:18:02Z", "creator": "n8wulf@web.de", "creation_time": "2011-08-18T21:18:02Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 148696, "time": "2011-08-18T21:25:41Z", "bug_id": 51682, "creation_time": "2011-08-18T21:25:41Z", "is_private": false, "text": "Please provide the simplest possible test application (with source code) that demonstrates the issue."}, {"count": 2, "tags": [], "bug_id": 51682, "attachment_id": null, "text": "Without a test case that demonstrates the problem, this issue will be closed as invalid on the basis (without any evidence to suggest otherwise) that the root cause is a bug in the application and/or a library it is using.\n\nTomcat 7 is stricter than previous versions regarding various aspects of the servlet specification and this issue may well be a manifestation of that.", "id": 148788, "time": "2011-08-23T16:36:48Z", "creator": "markt@apache.org", "creation_time": "2011-08-23T16:36:48Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "I spoke with the Spring Security team and they are not aware of any reports of this issue. They doubled checked Spring Security 3.1.0 on Tomcat 7.0.20 and everything worked as expected.\n\nThis looks like an application issue and therefore is being resolved as invalid.", "id": 148845, "time": "2011-08-26T16:23:39Z", "bug_id": 51682, "creation_time": "2011-08-26T16:23:39Z", "is_private": false, "attachment_id": null}]