[{"count": 0, "text": "Created attachment 27429\nDoS Exploit for mentioned vulnerability\n\nAt least apache 2.2.17 has a remotely exploitable dos vulnerability which allows to consume all memory on a target system. A request for triggering the memory consumption includes a large \"Range\" header which requests as many different bytes as possible from a file served by httpd. Combining this with a gzip \"Accept-Encoding\" header the httpd is assumed to compress each of the bytes requested in the Range header seperately consuming large memory regions. The behaviour when compressing the streams is devestating and can end up in rendering the underlying operating system unusable when the requests are sent parallely. Symptomps are swapping to disk and killing of processes including but not solely httpd processes.\n\nHow to repeat:\nExecute the attached perl script for a vulnerable httpd, means Byte Range filter and mod_deflate/mod_gzip enabled.\n\nSidenote:\nApache should be aware of that through posting to full disclosure. Nevertheless should in my opinion this bug be resolved.", "bug_id": 51714, "attachment_id": 27429, "id": 148796, "time": "2011-08-24T00:49:57Z", "creator": "isowarez.isowarez.isowarez@googlemail.com", "creation_time": "2011-08-24T00:49:57Z", "tags": [], "is_private": false}, {"count": 1, "text": "As discussed on the Apache Dev Mailing list it looks like this issue has nothing to do with mod_deflate or mod_gzip, wrong assumption by me.\n\n(In reply to comment #0)\n> Created attachment 27429 [details]\n> DoS Exploit for mentioned vulnerability\n> \n> At least apache 2.2.17 has a remotely exploitable dos vulnerability which\n> allows to consume all memory on a target system. A request for triggering the\n> memory consumption includes a large \"Range\" header which requests as many\n> different bytes as possible from a file served by httpd. Combining this with a\n> gzip \"Accept-Encoding\" header the httpd is assumed to compress each of the\n> bytes requested in the Range header seperately consuming large memory regions.\n> The behaviour when compressing the streams is devestating and can end up in\n> rendering the underlying operating system unusable when the requests are sent\n> parallely. Symptomps are swapping to disk and killing of processes including\n> but not solely httpd processes.\n> \n> How to repeat:\n> Execute the attached perl script for a vulnerable httpd, means Byte Range\n> filter and mod_deflate/mod_gzip enabled.\n> \n> Sidenote:\n> Apache should be aware of that through posting to full disclosure. Nevertheless\n> should in my opinion this bug be resolved.", "creator": "isowarez.isowarez.isowarez@googlemail.com", "attachment_id": null, "id": 148797, "time": "2011-08-24T03:32:01Z", "bug_id": 51714, "creation_time": "2011-08-24T03:32:01Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 51714, "attachment_id": null, "text": "First, I'm not an expert on the matter. A small addition might be in place to the work-around option suggested in:\n\n<http://marc.info/?l=apache-httpd-dev&m=131418828705324&w=2>\n\nThe first mitigation option was a configuration change:\n\nRequestHeader unset Range\n\nIn addition to dropping the \"Range\" from request headers, it might prove useful to drop the \"If-Range\" as well, and might also be polite to respond with \"Accept-Ranges: none\". This could be accomplished with:\n\n# Removes the \"Range\" and \"If-Range\" from the request headers\nRequestHeader unset Range\nRequestHeader unset If-Range\n# Removes all \"Accept-Ranges\" from the response headers\nHeader unset Accept-Ranges\n# Sets \"Accept-Ranges: none\" to the response headers\nHeader set Accept-Ranges none\n\n(I'm not sure if the \"Header unset Accept-Ranges\" is even necessary.)\n\nAccording to the HTTP 1.1 specification RFC 2616:\n\n* \"Servers that do not accept any kind of range request for a resource MAY send 'Accept-Ranges: none'\" (section 14.5); and\n* \"A server MAY ignore the Range header\" (section 14.35.2).\n\nBut clearly this is only a work-around.", "id": 148839, "time": "2011-08-26T10:13:11Z", "creator": "mikko.a.parviainen@gmail.com", "creation_time": "2011-08-26T10:13:11Z", "is_private": false}, {"count": 3, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "id": 149015, "time": "2011-09-03T17:58:08Z", "bug_id": 51714, "creation_time": "2011-09-03T17:58:08Z", "is_private": false, "text": "released in 2.2.20, just needs a 2.0 release to close I guess."}, {"count": 4, "tags": [], "bug_id": 51714, "text": "(In reply to comment #3)\n> released in 2.2.20, just needs a 2.0 release to close I guess.\n\nany news on a 2.0.x fix ?", "id": 149191, "time": "2011-09-13T17:24:15Z", "creator": "linux@kama-aina.net", "creation_time": "2011-09-13T17:24:15Z", "is_private": false, "attachment_id": null}, {"count": 5, "text": "revert OS change.", "creator": "covener@gmail.com", "attachment_id": null, "id": 173978, "time": "2014-03-20T15:21:26Z", "bug_id": 51714, "creation_time": "2014-03-20T15:21:26Z", "tags": [], "is_private": false}]