[{"count": 0, "tags": [], "bug_id": 51776, "attachment_id": 27464, "text": "Created attachment 27464\nScreensnap of my blog showing problem.\n\nI can not post photos to either of my blogs at blogspot.com or view photos at my blogs and other blogs from blogspot.com\nI use Firefox and this started when a forced upgrade to version 6 happened a few weeks ago. \nI was advised that it might be my Norton Internet Security Firewall but a support agent from Norton worked for about 4 hours trying every thing that Norton might be doing and also completely uninstalled Norton and the problem remained.\nwhile I could not get back to an older version of Firefox he was able to revert it back to version 5 and the problem remained.\nBut on Explorer there is no problem. I do not like to use Explorer for any thing and especially when it comes to loading photos to the uploader for the blog I have to click on one photo at a time while with Firefox I can highlight 15 or 30 photos and then the uploader will take care of the rest.\nWhen I look at my blog instead of seeing a photo all I see are small grey boxes\n(see attachment) and I get a 404 alert. The only thing that changes in the alerts are the urls and full name of each photo. Here is an example of this.\n\nNot Found\n\nThe requested URL /-IAjwgarbbe0/TmQv4JXtBPI/AAAAAAAAA_M/bjSozSOs0MA/s1600/destroyed_AFV+photos_7_1_45+%28Large%29.jpg was not found on this server.\nApache/2.2.9 (Debian) PHP/5.2.6-1+lenny9 with Suhosin-Patch Server at 1.bp.blogspot.com Port 80", "id": 149052, "time": "2011-09-07T04:13:44Z", "creator": "burntmoon_69@hotmail.com", "creation_time": "2011-09-07T04:13:44Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 51776, "is_private": false, "text": "Under your Product I inserted Apache httpd-2 but I do not know for sure if this is correct. Please excuse my ignorance but I know nothing that is technical or about coding. I am a retired disabled photographer with an interest in history and I am totally lost as to this issue.", "id": 149053, "time": "2011-09-07T04:17:39Z", "creator": "burntmoon_69@hotmail.com", "creation_time": "2011-09-07T04:17:39Z", "attachment_id": null}]