[{"count": 0, "tags": [], "creator": "lc.pvrr@orange.fr", "attachment_id": null, "is_private": false, "id": 149094, "time": "2011-09-08T02:55:25Z", "bug_id": 51784, "creation_time": "2011-09-08T02:55:25Z", "text": "In my project JOAFIP I wanted to be independant of the logging framework.\nI use log4j by default because it is my preference and it is commonly used.\nBut not all project use log4j, so I wanted to be open to alternative.\n\nThis make me create an adapter, see attachment.\nfor example Logger.error(...) in my code is replaced by JoafipLogger.error(...) and JoafipLogger.error delegate to org.apache.log4j.Logger.error(...)\n\nBut I discovered using \"[%5p] - %d [%t] (%c.java:%M:%L) %n %m%n%n\" as conversion pattern that line number was wrong. So I created the attached code.\n\nideally a method Logger.setFQCN(\"net.sf.joafip.logger.JoafipLogger\") would me able to solve the problem. But I have to write the attached code to have the issue.\n\nWhat do you think to add Logger.setFQCN method ?"}, {"count": 1, "text": "An single instance of Logger is returned for any call to Logger.getLogger(). If there were multiple \"wrapping\" classes wrapping the same instance of Logger, they would be conflicting calls to setFQCN().\n\nIs your wrapping class calling Logger.log(String callerFQCN, Priority level, Object message, Throwable t)  which is designed for this scenarios? If so, are you running into any problems.", "bug_id": 51784, "is_private": false, "id": 149112, "time": "2011-09-09T04:54:54Z", "creator": "carnold@apache.org", "creation_time": "2011-09-09T04:54:54Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 51784, "attachment_id": null, "text": "calling Logger.forcedLog(String callerFQCN, Priority level,Object message, Throwable t) to \"wrap\" the logger is not because of multiples wrapping class. There is only one proprietary logging class that delegate to log4j. I do not see any reason to have multiple class for one project, but we can imagine multiple project using the same approach, so it can exist more than one \"wrapping\" class. so use of Logger.setFQCN is not a good solution.\nmay be better to have addtionnal parameter to logger functions.", "id": 149114, "time": "2011-09-09T06:58:52Z", "creator": "lc.pvrr@orange.fr", "creation_time": "2011-09-09T06:58:52Z", "is_private": false}]