[{"count": 0, "tags": [], "text": "JMeter does not handle flash cookies.\n\nThe cookie manager is not able to clear flash cookies, neither is the cache manager.\n\nFlash cookies are flash objects stored on local machines. Third party flash player softwares are responsible in dealing with flash cookies, like the macromedia flash player.", "attachment_id": null, "id": 149127, "creation_time": "2011-09-09T16:36:25Z", "time": "2011-09-09T16:36:25Z", "creator": "vipul_paikane@persistent.co.in", "bug_id": 51793, "is_private": false}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "text": "JMeter is not a browser, and does not support client-side javascript, let alone Flash content.\n\nIt's out of scope for JMeter to support Flash and Flash cookies.\n\nJMeter knows nothing about Flash cookies - it won't store them and it won't read them back.\n\nIf you need to send specific cookies you can manually add them to the Cookie Manager. Otherwise, ask on the User list.", "id": 149128, "time": "2011-09-09T16:54:26Z", "bug_id": 51793, "creation_time": "2011-09-09T16:54:26Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 51793, "text": "Just like Traditional client side cookies are handled by JMeter, can't there be am enhancement in the JMeter cookie manager or an additional config element to handle flash cookies?\n\nThis surely looks like an investment worth working on.\n\n'On 10 August 2009, Wired magazine reported that more than half of the top websites used Local Shared Objects to track users and store information about them but only four of them mentioned it in their privacy policy.'\n\nReference - http://en.wikipedia.org/wiki/Local_Shared_Object", "id": 149133, "time": "2011-09-09T18:53:30Z", "creator": "vipul_paikane@persistent.co.in", "creation_time": "2011-09-09T18:53:30Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 51793, "is_private": false, "id": 149134, "time": "2011-09-09T18:55:35Z", "creator": "vipul_paikane@persistent.co.in", "creation_time": "2011-09-09T18:55:35Z", "tags": [], "text": "Changing the status of the bug to re-opened and making it an 'enhancement'"}, {"count": 4, "attachment_id": null, "bug_id": 51793, "is_private": false, "id": 149138, "time": "2011-09-09T21:58:19Z", "creator": "sebb@apache.org", "creation_time": "2011-09-09T21:58:19Z", "tags": [], "text": "This is not within the scope for JMeter.\n\nIf additional cookies or headers are needed to support interactions with websites - which I doubt, Flash cookies are mainly used to restore traditional cookies after users think they have deleted them - then JMeter already has the means to specify these.\n\nPlease do not re-open."}]