[{"count": 0, "tags": [], "bug_id": 51799, "attachment_id": null, "id": 149147, "time": "2011-09-10T23:37:43Z", "creator": "mike@vorburger.ch", "creation_time": "2011-09-10T23:37:43Z", "is_private": false, "text": "Tomcat (v7.0.21 at least) returns the absolute file path where a folder \"would have been\" for servletContext.getRealPath(\"/someFolderThatDoesNotExist/\").\n\nJetty (v7.3.0) returns null in such cases (so it only returns resources, or folder, that are actually available in the directory where the expanded WAR is); see also http://dev.eclipse.org/mhonarc/lists/jetty-dev/msg00773.html\n\nThe Servlet Spec doesn't clearly say either way - what Jetty does seems more logical to me... and is also the assumption made e.g. in BIRT; for more background see https://bugs.eclipse.org/bugs/show_bug.cgi?id=357315 & http://mifosforge.jira.com/browse/MIFOS-5118."}, {"count": 1, "tags": [], "bug_id": 51799, "attachment_id": null, "id": 149582, "time": "2011-09-21T12:16:09Z", "creator": "markt@apache.org", "creation_time": "2011-09-21T12:16:09Z", "is_private": false, "text": "My reading of the Servlet specification and Javadoc is that there is no requirement for the path to exist, just for the container to map the virtual path to a physical if such a mapping is possible.\n\nI'll raise a bug against the Servlet specification to get this clarified but my inclination is to resolve this as invalid."}, {"count": 2, "tags": [], "text": "See http://java.net/jira/browse/SERVLET_SPEC-11", "attachment_id": null, "id": 149584, "creator": "markt@apache.org", "time": "2011-09-21T12:21:40Z", "bug_id": 51799, "creation_time": "2011-09-21T12:21:40Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 51799, "attachment_id": null, "id": 149592, "time": "2011-09-21T14:21:13Z", "creator": "remm@apache.org", "creation_time": "2011-09-21T14:21:13Z", "is_private": false, "text": "The behavior has never changed, has always been consistent, and nowhere in the specification does it say the path needs to exist. Unlike for getResource, where the behavior for a non existent resource is clearly defined as being different. So why is there any doubt about this ?\n\nIf you didn't realize this could be used to create a file in the filesystem, then it would still be nice to not assume by default that the specification must be stupid because a user says so. And that, even if there wasn't any good reason at all, the change would *again* break plenty of existing applications."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Remy, I agree with you completely that Tomcat's behaviour is correct but having read the spec quite carefully I couldn't find anything explicit that states that the resource doesn't have to exist and there was enough ambiguity that I can understand how someone may have reached a different conclusion. I just think a few words of clarification in the spec wouldn't hurt. If you wanted to add you views to SPEC-11 that would be great.", "id": 149596, "time": "2011-09-21T16:56:19Z", "bug_id": 51799, "creation_time": "2011-09-21T16:56:19Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 51799, "text": "The EG is in agreement (including the Jetty rep) that the current behaviour is correct.", "id": 149681, "time": "2011-09-23T06:42:01Z", "creator": "markt@apache.org", "creation_time": "2011-09-23T06:42:01Z", "is_private": false, "attachment_id": null}]