[{"count": 0, "tags": [], "bug_id": 51802, "attachment_id": null, "id": 149188, "time": "2011-09-13T13:34:57Z", "creator": "robert.flaherty@oracle.com", "creation_time": "2011-09-13T13:34:57Z", "is_private": false, "text": "When update is false, the zip should always be built from scratch.  Currently it does a quick check at the top to see if the 'current' resources are up-to-date.  This does not take into account resources which are in the existing zip, but shouldn't be any more.  Also, this quick check causes no update of the zip comment or timestamp.  I think we need at least this 'doUpdate' change:\n\n\n            // quick exit if the target is up to date\n            if (doUpdate && !state.isOutOfDate()) {\n                return;\n            }\n\n\nAdditionally it would be nice if this test could also consider if the comment needs to be updated."}, {"count": 1, "tags": [], "creator": "peterreilly@apache.org", "attachment_id": null, "text": "The doupdate is meant only for in-place updating and is orthogonal to the decision of proceeding with the task.\n\nThe decision to proceed with the task is basicly the same as a copy or javac task, deleted files or metadata are not taken into account.\n\nI think that what you require would be an overwrite attribute (see the copy task).", "id": 149252, "time": "2011-09-15T09:42:40Z", "bug_id": 51802, "creation_time": "2011-09-15T09:42:40Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 51802, "text": "What Peter said.\n\nThe Compress Antlib[1]'s ZIP task has a mode attribute that can be set to \"force-create\" which is exactly what you want.  Given that the Compress Antlib's task provides a superset of features of the built-in zip task I'd encourage you to switch.\n\n[1] http://ant.apache.org/antlibs/compress/index.html", "id": 149253, "time": "2011-09-15T09:59:33Z", "creator": "bodewig@apache.org", "creation_time": "2011-09-15T09:59:33Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 51802, "text": "I'll slap a <delete> in front of the task for now, until I spy an overwite attribute.  But maybe a clarification in the docs would be helpful for others.", "id": 149276, "time": "2011-09-15T14:44:53Z", "creator": "robert.flaherty@oracle.com", "creation_time": "2011-09-15T14:44:53Z", "is_private": false, "attachment_id": null}]