[{"count": 0, "tags": [], "creator": "rich@steelezone.net", "is_private": false, "id": 149291, "creation_time": "2011-09-15T19:23:03Z", "time": "2011-09-15T19:23:03Z", "bug_id": 51829, "text": "URLResource.connect() logs the IOException thrown by URL.openConnection()  (line 376 in URLResource.java for Ant 1.8.2).  Normally, this would be OK--exception I've wrapped the URL resource in a <restrict> with an <exists> selector because in my case it can be OK if the URL isn't found.\n\nThe net result is we're getting errors logged even though the build doesn't fail.\n\nIs there really a reason to log this as an error?  Isn't the exception an indication that something might have gone wrong, but we should let the caller assume responsibility for determining if this is really an error?", "attachment_id": null}, {"count": 1, "tags": [], "creator": "pieskste@zedat.fu-berlin.de", "attachment_id": null, "id": 151422, "time": "2011-11-11T20:28:57Z", "bug_id": 51829, "creation_time": "2011-11-11T20:28:57Z", "is_private": false, "text": "Hello,\n\nI'm just trying to understand your issue.\nI created a file it can not create the issue though.\nCan you give me a sample code to show, with which it does not work out for you?"}, {"count": 2, "tags": [], "creator": "rich@steelezone.net", "attachment_id": null, "id": 151424, "time": "2011-11-11T21:15:21Z", "bug_id": 51829, "creation_time": "2011-11-11T21:15:21Z", "is_private": false, "text": "Here's a script that demonstrates the problem:\n\n<project>\n\t<import optional=\"true\">\n\t\t<url file=\"foo.x\" />\n\t</import>\n</project>\n\nWhen I run this I get:\n\nC:\\Development\\projects\\ant-playground\\url-resource-error>ant\nBuildfile: C:\\Development\\projects\\ant-playground\\url-resource-error\\build.xml\njava.io.FileNotFoundException: C:\\Development\\projects\\ant-playground\\url-resource-error\\foo.x (The system cannot find the file specified)\n\nBUILD SUCCESSFUL\nTotal time: 0 seconds\n\nI made the import optional so even though the file doesn't exist the build works.  But why print out the java.io.FileNotFoundException error message?\n\nI have users of my build script asking me that; worse, our jenkins builds flag that as some kind of critical problem."}, {"count": 3, "tags": [], "creator": "pieskste@zedat.fu-berlin.de", "attachment_id": null, "id": 151451, "time": "2011-11-13T19:54:25Z", "bug_id": 51829, "creation_time": "2011-11-13T19:54:25Z", "is_private": false, "text": "OK, I can reproduce this issue. But I am of the opinion it is correct. <import optional=\"true\"> means that the script should continue in the event of an error.\nThe manual is:\nOptional | If true, do not exist stop the build if the file does not, default is false.\n\nYou want that the script will continue running in the event of an error.\nIt does this well and you know indicates that there is an error\nwhen you import the file was foo.x.\nThe problem I see in the Tag <url>, because this would cause the error.\nFirst, by the Tag <url> trying to open a file and the error happens there. Import realize that something went wrong and continues.\nIn <import> there is one attribute that file names.\nWhy do you use <url>?\nHereby it should work:\n\n<project>\n     <import file=\"foo.x\" optional=\"true\"/>\n</ project>"}, {"count": 4, "tags": [], "creator": "rich@steelezone.net", "attachment_id": null, "id": 151478, "time": "2011-11-14T13:44:40Z", "bug_id": 51829, "creation_time": "2011-11-14T13:44:40Z", "is_private": false, "text": "This is a simplified example--I can't share the actual code--that reproduces the problem.  I'm aware of what optional on <import> means.  That's also why I use a <url> resource instead of a file attribute on <import> because the problem is with URLResource.\n\nMy complaint is only about the error message logged to the console during the build: it prints out java.io.FileNotFoundException message even though the build is fine.  The build worked, so why log this message?\n\nMy recommendation is to simply remove the log statement (or reduce its severity to DEBUG) in URLResource at line 376."}, {"count": 5, "tags": [], "text": "should be less noisy with svn revision 1203160", "is_private": false, "bug_id": 51829, "id": 151591, "time": "2011-11-17T11:57:13Z", "creator": "bodewig@apache.org", "creation_time": "2011-11-17T11:57:13Z", "attachment_id": null}]