[{"count": 0, "tags": [], "bug_id": 51835, "attachment_id": null, "id": 149319, "time": "2011-09-16T13:52:39Z", "creator": "integration@voxmobili.com", "creation_time": "2011-09-16T13:52:39Z", "is_private": false, "text": "Hello everyone, \n\nWe are facing non-closed sessions in our application, leading to heapspace reach.\nOn our live environment, we have  more than 300 sessions opened at the\nsame time.  We have added logs  telling us when a session is destroyed by\nTomcat for any cases. \n\nWe can see some correctly ended sessions with this session destroy.\nWe also see sessions which ended in timeout due inactivity with this session destroy.\nBut we have sessions where we see neither timeout, nor session destroy in logs.\n\nHow come Tomcat could possibly never kill those sessions?\n\n\nAttribution:\n    Version   Tomcat 6.0.29\n    Component   session listener\nEnvironment details:\n    Platform and OS   SunOS 5.10 Generic_142901-11 i86pc i386 i86pc\n    Java version   1.6.0_25-b06\n    Web Server   Apache/2.2.16 + mod_jk/1.2.26 \n\n\nFootnotes: \n[1]  we have set this in our webapp's web.\n<web-app>\n   [...]\n   <session-config>\n      <session-timeout>2</session-timeout>\n   </session-config>\n</web-app>\n\n\nThank you in advance, \nBest regards,\n\n-- \n Voxmobili"}, {"count": 1, "tags": [], "bug_id": 51835, "text": "1. Are you sure that it is not a bug in your logging? You are not telling much about it.\nE.g. maybe you are not taking into account that session id changes during authentication (since 6.0.21).\n\n2. Note also, that expired sessions are not evicted immediately upon expiring, but only when background processing thread finds them.  See \"backgroundProcessorDelay\" property in Configuration Reference. The default delay is 10 seconds. Though I think that the thread might be stuck somewhere, as it performs other tasks as well (e.g. autodeployment).\n\n\n3. You have to find a proof that there indeed are sessions that have \"last accessed time\" more than (your configuration + interval between background processing runs) ago. The manager webapp can be used to view the list of active sessions.\n\nIt would be much better if you'd find how to reproduce this.\n\n\n\nNote, that \"Bugzilla is not a support forum\". The questions on how to diagnose something must be directed to the users@ list.", "id": 149333, "time": "2011-09-16T16:27:14Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-09-16T16:27:14Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 51835, "is_private": false, "text": "Session expiration is tested as part of the TCK that every Tomcat release goes through including 6.0.29. This looks to be an application issue rather than a Tomcat issue and - as Konstantin points out - the users list is the place to seek help.", "id": 149579, "time": "2011-09-21T11:48:35Z", "creator": "markt@apache.org", "creation_time": "2011-09-21T11:48:35Z", "attachment_id": null}]