[{"count": 0, "tags": [], "bug_id": 51832, "attachment_id": 27505, "is_private": false, "id": 149305, "time": "2011-09-16T04:32:15Z", "creator": "trejkaz@trypticon.org", "creation_time": "2011-09-16T04:32:15Z", "text": "Created attachment 27505\nProposed patch\n\nI have about a dozen files here where WRITEPROTECT precedes FILEPASS.  I can't seem to reproduce this myself even if I turn on write protect and encryption for the same workbook, but I am attaching a fix for the issue anyway.\n\nI'm also worried about the general nature of the FILEPASS record - what if it can occur literally _anywhere_?  Is POI's approach of only looking a few records deep actually correct in general?"}, {"count": 1, "tags": [], "bug_id": 51832, "attachment_id": null, "id": 149307, "time": "2011-09-16T08:18:45Z", "creator": "apache@gagravarr.org", "creation_time": "2011-09-16T08:18:45Z", "is_private": false, "text": "Any chance you could share one of the files with the records in the other order?\n\nIn terms of where the records should live in the file, if you could look at the [MS-XLS] spec and see what it says that'd be great. Possibly much quicker is just to run the Microsofto Binary File Format validator against one of them, and see if that declares the files as valid or not?"}, {"count": 2, "tags": [], "text": "Looking on Page 162 of the June 8th 2011 Microsoft docs, it looks like WRITEPROTECT shouldn't come first\n\nBOF, FILEPASS and FILEINFO mustn't be encrypted, however WRITEPROTECT isn't in the list of \"must not encrypt\" so therefore should be encrypted. I believe that all the un-encrypted records should come first", "is_private": false, "id": 149328, "creator": "apache@gagravarr.org", "time": "2011-09-16T14:59:01Z", "bug_id": 51832, "creation_time": "2011-09-16T14:59:01Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "trejkaz@trypticon.org", "attachment_id": null, "id": 149362, "creation_time": "2011-09-17T08:43:06Z", "time": "2011-09-17T08:43:06Z", "bug_id": 51832, "text": "Is there anything in the docs that says that if a record is not documented as \"MUST NOT be encrypted\", then it MUST be encrypted?  I am having trouble finding it.  The way they have worded it seems pretty open to interpretation to me, and they haven't even used \"SHOULD\" in the area.\n\nI couldn't find anything specifically stating the order of the records either, except that in OpenOffice's documentation, they seem to lump WriteProtect, FilePass, WriteAccess and FileSharing into a \"file protection block\" at the front of the file, with no specific notes on which order they should occur in (although WriteProtect is documented first in the list, they don't specifically say whether the documented order matches the stored order for the file protection block.\n\n(The WriteProtect record itself appears to be completely empty - maybe someone assumed that since it didn't have any data in it, it didn't need to be encrypted as there was no point?)\n\nAs for test data, I don't have any which I can share.  I have been trying to create it, to no avail.  I'd need to get my hands on the same version which generated it.", "is_private": false}, {"count": 4, "tags": [], "bug_id": 51832, "attachment_id": null, "id": 149415, "time": "2011-09-17T18:47:50Z", "creator": "apache@gagravarr.org", "creation_time": "2011-09-17T18:47:50Z", "is_private": false, "text": "The page before says that the whole stream must be encrypted, except for special records (which are documented in the list on p162)"}, {"count": 5, "tags": [], "text": "Created attachment 27531\nSample file exhibiting the issue\n\nGood news - I have found some sample data.  Our own functional tests failed when I put in the fix.  I notice that the AppName is \"Microsoft Excel\" for this file as well.  Given that it's created by a guy who used to work here and appears to be a file exclusively for testing (the email it was inside had a subject to that effect), I have a greater trust in this file than the other ones I had from a client.\n\nAttaching the file.", "is_private": false, "id": 149470, "creator": "trejkaz@trypticon.org", "time": "2011-09-19T01:54:15Z", "bug_id": 51832, "creation_time": "2011-09-19T01:54:15Z", "attachment_id": 27531}, {"count": 6, "tags": [], "creator": "trejkaz@trypticon.org", "attachment_id": null, "id": 149471, "creation_time": "2011-09-19T02:00:45Z", "time": "2011-09-19T02:00:45Z", "bug_id": 51832, "text": "By the way, what section is that text in, so that I can find it in the online version (which of course doesn't use page numbers)?\n\nSection 2.2.10 is what I have been reading:\n\nhttp://msdn.microsoft.com/en-us/library/dd905723(v=office.12).aspx\n\nIt doesn't say it.  And the section immediately before it, 2.2.9, doesn't have anything about encryption in it.", "is_private": false}, {"count": 7, "tags": [], "bug_id": 51832, "attachment_id": null, "id": 149483, "time": "2011-09-19T10:08:42Z", "creator": "apache@gagravarr.org", "creation_time": "2011-09-19T10:08:42Z", "is_private": false, "text": "I'm reading section 2.2.10. My copy states that the \"Workbook Stream\" must be encrypted, with a * note. The note a page later gives the list of the very few records that aren't to be encrypted"}, {"count": 8, "tags": [], "text": "I figured a slightly simpler fix, so I've applied it in r1172575 (along with a test) rather than worrying any further about what should or shouldn't be present!", "attachment_id": null, "id": 149489, "creator": "apache@gagravarr.org", "time": "2011-09-19T11:44:40Z", "bug_id": 51832, "creation_time": "2011-09-19T11:44:40Z", "is_private": false}]