[{"count": 0, "tags": [], "creator": "gozzoo@yahoo.com", "attachment_id": null, "is_private": false, "id": 149308, "time": "2011-09-16T09:59:00Z", "bug_id": 51833, "creation_time": "2011-09-16T09:59:00Z", "text": "The url I use to access Tomcat is:\n\nhttp://localhost/bin/upload;jsessionid=CDDAB8614E1F0ACB724CC033C8300697\n\nthe result I was getting when calling request.getRequestURI() is:\n\n/bin/upload\n\nThis used to work until the latest version of tomcat 6.0.33. Now I'm getting:\n\n/bin/upload;jsessionid=CDDAB8614E1F0ACB724CC033C8300697"}, {"count": 1, "text": "As I already explained several days ago to somebody else on the users@ list, this behaviour is required by the Servlet specification.\n\nSee servlet-2_5-mrel2-spec.pdf  ch. SRV.3.1, Quote:\n[[[\nPath parameters that are part of a GET request (as defined by HTTP 1.1) are not\nexposed by these APIs. They must be parsed from the String values\nreturned by the\ngetRequestURI method or the getPathInfo method.\n]]]", "bug_id": 51833, "attachment_id": null, "id": 149317, "time": "2011-09-16T12:47:03Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-09-16T12:47:03Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 51833, "text": "This might be so, but jsessionid is tomcat specific paramater which only puprose is to provide the session id. By the time getRequestURI gets called it has been extracted and the users doesn't need to know about it. If they need  the session id they can get it from the session object.\n\nFurthermore Tomcat 6 is considered stable and not in active development any more. Changing the default behaviour because of differnt interpretation of the spcec doesn't seem very stable to me. It might be a big and very unplesent surprise for some users when they discover that their applicatoins which have been in use for years don't work any more after the latest upgrade because of such so belated change of heart.", "id": 149372, "time": "2011-09-17T14:40:15Z", "creator": "gozzoo@yahoo.com", "creation_time": "2011-09-17T14:40:15Z", "is_private": false, "attachment_id": null}, {"count": 3, "text": "Tomcat 6 is under active development. It receives security fixes, bug fixes and some new features.\n\nNon-compliance with the Servlet specification is always treated as a bug in Tomcat. Failure to return the correct value for getRequestURI() was a bug and has been fixed.\n\nAn application failure triggered by a valid - as per the specification - return value from getRequestURI() is a bug in the application, not a bug in Tomcat.\n\nWhile backwards incompatible changes are avoided where possible, the Tomcat developers can't predict how every applications may respond to each individual change and in this case specification compliance took precedence over the risk of breaking backwards compatibility which was judged to be extremely low. Where the risk of breaking compatibility is judged to be higher - or subsequently a significant compatibility problem is found - the usual approach is to add a configuration option that permits the previous - normally non-specification compliant - behaviour. In this case I do not see sufficient justification for adding such an option.", "bug_id": 51833, "attachment_id": null, "id": 149578, "time": "2011-09-21T11:45:41Z", "creator": "markt@apache.org", "creation_time": "2011-09-21T11:45:41Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "ranomail@gmail.com", "is_private": false, "count": 4, "id": 164693, "time": "2013-01-17T14:15:58Z", "bug_id": 51833, "creation_time": "2013-01-17T14:15:58Z", "text": "Sorry, but this change was registered in release notes and/or change log of 6.0.33 version?"}, {"count": 5, "text": "Yes, this is in the change log. If you have any further questions on this change, they belong on the users mailing list.", "creator": "markt@apache.org", "attachment_id": null, "id": 164696, "time": "2013-01-17T14:27:44Z", "bug_id": 51833, "creation_time": "2013-01-17T14:27:44Z", "tags": [], "is_private": false}, {"count": 6, "tags": [], "bug_id": 51833, "is_private": false, "text": "Some person is currently asking about history of this change on the users@ list, comparing behaviour of some old Tomcat 6 and current Tomcat 7 versions.\n\n(2015-07-23,\n\"Tomcat 7 (7.0.54) Login URL is Passing with JSESSION ID. | why there is different behaviour in Tomcat 6 and Tomcat 7\"\n http://markmail.org/message/jdwpyll2nl25me24\n)\n\nThis change is listed in changelog, but it does not have a bug number with it. I am taking this chance to better document it.\n\nThis change in changelog of 6.0.33:\n\n<fix>\n   Improve handling of URLs with path parameters and prevent incorrect 404\n   responses that could occur when path parameters were present. (kkolinko)\n</fix>\n\n************************************************\n\nComments:\n1. The commit for this change:\n2011-07-21\nhttp://svn.apache.org/viewvc?view=revision&revision=1149220\n\n\"Fix path parameter handling. Prevent the following URL failing with a 404: http://localhost:8080/examples/jsp/snp;x=y/snoop.jsp\"\n\n\n2. The change in behaviour of request.getRequestURI() is dictated by Servlet specification. The new behaviour (exposing the path parameters as is) is the correct behaviour. It is already mentioned above (comment 1) and have been discussed several times on our mailing lists.\n\nA request to clarify Servlet specification is [1].\n\nThe behaviour of getRequestURI is essentially clear: it is documented to return original un-decoded request URI, that is on the first line of HTTP request. [2] It is behaviour of other related methods that needs to be clarified in [1].\n\n[1] https://java.net/jira/browse/SERVLET_SPEC-18\n\n[2] http://docs.oracle.com/javaee/6/api/javax/servlet/http/HttpServletRequest.html#getRequestURI%28%29\n\n\n3. This change was backported from Tomcat 7, where it was a part of a different fix that involved refactoring of path parameter handling.\n\nThe change to getRequestURI() is a side effect of that refactoring.\n\n\n4. Original proposal for this fix is r1005192 (2010-10-06)\n\nThis proposal was discussed in \"Re: r1005192\" thread on dev@ list. After several minor improvements (r1035976) it became the change committed in r1149220.\n\nDiscussion thread \"Re: r1005192\":\nhttp://tomcat.markmail.org/thread/i3m4amzrueafgvyv\n\n\n5. Original commit that changed path parameter handling in Tomcat 7 is r944920 (2010-05-16, fix for bug 49299) with minor follow-up fixes such as r946584 and r1035973.\n\nIn Tomcat 7 this change is part of Tomcat 7.0.0, so it is not listed in changelog.\n\n\n6. This change in getRequestURI() behaviour has caused regression in FORM authentication:\n\nBug 53584 - Forms authentication without cookies requires double submission in 6.0.33\n\nThe FORM authentication issue was fixed in 6.0.36, 7.0.30.\n(r1377878 in Tomcat 6, r1370537 + r1372390 in Tomcat 7)", "id": 184142, "time": "2015-07-23T10:56:17Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-07-23T10:56:17Z", "attachment_id": null}, {"count": 7, "text": "I updated Tomcat 6 changelog in r1692377", "bug_id": 51833, "attachment_id": null, "id": 184143, "time": "2015-07-23T11:18:48Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-07-23T11:18:48Z", "tags": [], "is_private": false}]