[{"count": 0, "tags": [], "bug_id": 51843, "is_private": false, "text": "unicode codepoints outside of the BMP (base multilingual plane), i.e., whose scalar value is greater than 0xFFFF (65535), are coded as UTF-16 surrogate pairs in Java strings, which pair should be treated as a single codepoint for the purpose of mapping to a glyph in a font (that supports extra-BMP mappings);\n\nat present, FOP does not correctly handle this case in simple (non complex script) rendering paths;\n\nfurthermore, though some support has been added to handle this in the complex script rendering path, it has not yet been tested, so is not necessarily working there either;", "id": 149469, "time": "2011-09-19T01:35:24Z", "creator": "gadams@apache.org", "creation_time": "2011-09-19T01:35:24Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "gadams@apache.org", "text": "resetting P2 open bugs to P3 pending further review", "count": 1, "id": 157607, "time": "2012-04-07T01:45:16Z", "bug_id": 51843, "creation_time": "2012-04-07T01:45:16Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 51843, "is_private": false, "id": 159813, "time": "2012-06-08T09:52:57Z", "creator": "ttkkmm0608@hotmail.com", "creation_time": "2012-06-08T09:52:57Z", "tags": [], "text": "request to fix this to support surrogate pairs characters."}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "text": "(In reply to comment #2)\n> request to fix this to support surrogate pairs characters.\n\nthanks for your request; could you provide additional information:\n\n1. what specific non-BPM characters you would like to use?\n2. what specific fonts will you use for these characters?", "id": 159824, "time": "2012-06-08T13:06:44Z", "bug_id": 51843, "creation_time": "2012-06-08T13:06:44Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "gadams@apache.org", "text": "(In reply to comment #3)\n> (In reply to comment #2)\n> > request to fix this to support surrogate pairs characters.\n> \n> thanks for your request; could you provide additional information:\n> \n> 1. what specific non-BPM characters you would like to use?\n> 2. what specific fonts will you use for these characters?\n\ns/BPM/BMP/", "id": 159826, "attachment_id": null, "bug_id": 51843, "creation_time": "2012-06-08T13:17:31Z", "time": "2012-06-08T13:17:31Z", "is_private": false}, {"count": 5, "tags": [], "text": "Hello!\n\nToday, the majority of Unicode's characters are outside the BMP. This involves many alphabets and other character sets. Here are links to two of these non-BMP planes:\nhttp://www.unicode.org/roadmaps/smp/ and\nhttp://www.unicode.org/roadmaps/sip/ and more are to come because dozens of alphabets are not part of Unicode, yet.\n\nToday's FOP supports no more than a minority of Unicode's characters and this minority will become proportionally less and less in the future. I consider that there is a need to solve this problem in the long run.\n\nTrying to \"solve\" the problem for some specific non-BMP characters will lead to this problem coming back again and again ...\n\nI will use FOP *much* more often as soon as it supports non-BMP characters.\n\nRegards!\n\nSaašha,", "is_private": false, "id": 159830, "creator": "saasha@acc.umu.se", "time": "2012-06-08T14:56:41Z", "bug_id": 51843, "creation_time": "2012-06-08T14:56:41Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 51843, "text": "(In reply to comment #5)\n> Hello!\n> \n> Today, the majority of Unicode's characters are outside the BMP. This\n> involves many alphabets and other character sets. Here are links to two of\n> these non-BMP planes:\n> http://www.unicode.org/roadmaps/smp/ and\n> http://www.unicode.org/roadmaps/sip/ and more are to come because dozens of\n> alphabets are not part of Unicode, yet.\n> \n> Today's FOP supports no more than a minority of Unicode's characters and\n> this minority will become proportionally less and less in the future. I\n> consider that there is a need to solve this problem in the long run.\n> \n> Trying to \"solve\" the problem for some specific non-BMP characters will lead\n> to this problem coming back again and again ...\n> \n> I will use FOP *much* more often as soon as it supports non-BMP characters.\n> \n> Regards!\n> \n> Saašha,\n\nI'm sorry Saašha but I do not accept the rationale of your argument. First,\nFOP supports the representation of all BMP characters which is the vast\nmajority of modern usage, >99.994%.\n\nIf you cannot demonstrate to me a real, current need to use non-BMP characters\nor cannot demonstrate a font that actually supports these character mappings\nthat you need to use, then I will leave this bug prioritized low (P5).\n\nIf you wish to contribute a patch that adds non-BMP support, then the FOP\nteam would be happy to apply it. In the mean time, you shall have to wait\nuntil this enhancement gets higher in the priority queue, and that will have\nto await many other enhancements in my opinion, such as finishing support\nfor complex scripts, adding full CJK support, etc.", "count": 6, "id": 159832, "time": "2012-06-08T15:23:14Z", "creator": "gadams@apache.org", "creation_time": "2012-06-08T15:23:14Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 51843, "text": "Hello!\n\nThanks for your reply! Here are a few clarifications!\n\n> the vast majority of modern usage,\nMany, many software do not support non-BMP characters. I would like to clarify that FOP is not the only one. The fact that non-BMP characters are poorly supported is among the main reasons why non-BMP characters are seldom encoded as such. Instead, work-arounds are used. For example, non-BMP characters are often converted to parts of the so called \"private use area\" (U+E000 to U+F8FF) before being processed. Sometimes, \"font-tricks\" are used, where the glyphs of one alphabet are just copied to a BMP-alphabet's place -- reminding of the (early) nineties, where greek and cyrillic glyphs (among others) were often living in \"ASCII\"-fonts. Sometimes, they are replaced by PNG's. All these work-arounds contribute to many confusions and also contribute to the \"non-visibility\" of these alphabets and to great difficulties to find text written with these character sets.\n\nIn other words, the poor support for non-BMP characters is indeed one of the main reasons for their \"non-visibility\". It is important to avoid misinterpretations here: these characters are both used and useful.\n\n> demonstrate to me a real, current need to use non-BMP characters\nTo be accepted as part of Unicode, an alphabet or other character set (such as mathematical symbols, etc.) needs to be supported by a VERY active community during a long time. Otherwise, the Unicode consortium does not include this alphabet. The very fact that Unicode includes non-BMP alphabets and other character sets is a proof that an active community needs those characters.\n\nOn the other hand, the fact that dozens of alphabets are still absent from Unicode shall not be misinterpreted as a non-usage of these alphabets.\n\n> adding full CJK support,\nThousands of CJK characters live outside the BMP. A full CJK support requires support for non-BMP characters.\n\n> If you wish to contribute a patch that adds non-BMP support,\nI plan to try to write some kind of fix this summer.\n\nRegards!\n\nSaašha,", "count": 7, "id": 159838, "time": "2012-06-08T17:50:41Z", "creator": "saasha@acc.umu.se", "creation_time": "2012-06-08T17:50:41Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 51843, "is_private": false, "text": "(In reply to comment #7)\n> Hello!\n> \n> Thanks for your reply! Here are a few clarifications!\n> \n> > the vast majority of modern usage,\n> Many, many software do not support non-BMP characters. I would like to\n> clarify that FOP is not the only one. The fact that non-BMP characters are\n> poorly supported is among the main reasons why non-BMP characters are seldom\n> encoded as such. Instead, work-arounds are used. For example, non-BMP\n> characters are often converted to parts of the so called \"private use area\"\n> (U+E000 to U+F8FF) before being processed. Sometimes, \"font-tricks\" are\n> used, where the glyphs of one alphabet are just copied to a BMP-alphabet's\n> place -- reminding of the (early) nineties, where greek and cyrillic glyphs\n> (among others) were often living in \"ASCII\"-fonts. Sometimes, they are\n> replaced by PNG's. All these work-arounds contribute to many confusions and\n> also contribute to the \"non-visibility\" of these alphabets and to great\n> difficulties to find text written with these character sets.\n> \n> In other words, the poor support for non-BMP characters is indeed one of the\n> main reasons for their \"non-visibility\". It is important to avoid\n> misinterpretations here: these characters are both used and useful.\n> \n> > demonstrate to me a real, current need to use non-BMP characters\n> To be accepted as part of Unicode, an alphabet or other character set (such\n> as mathematical symbols, etc.) needs to be supported by a VERY active\n> community during a long time. Otherwise, the Unicode consortium does not\n> include this alphabet. The very fact that Unicode includes non-BMP alphabets\n> and other character sets is a proof that an active community needs those\n> characters.\n> \n> On the other hand, the fact that dozens of alphabets are still absent from\n> Unicode shall not be misinterpreted as a non-usage of these alphabets.\n> \n> > adding full CJK support,\n> Thousands of CJK characters live outside the BMP. A full CJK support\n> requires support for non-BMP characters.\n> \n> > If you wish to contribute a patch that adds non-BMP support,\n> I plan to try to write some kind of fix this summer.\n> \n> Regards!\n> \n> Saašha,\n\nagain you are giving me general reasons, but not specific ones that drive your immediate needs; i am extremely familiar with Unicode, having been a co-author of Unicode 2.0, a technical director of the Unicode consortium from 93-98, and Unicode's representative to the ISO SC2/WG2 IRG (Ideographic Rapporteur Group), who created the CJK encodings in Unicode;\n\ni want to know specifically what non-BMP characters *you* want to use and what specific fonts *you* will use to print these non-BMP characters; if you can demonstrate a good, real need (as opposed to generalities), then perhaps I will\nbe inclined to give non-BMP support a greater priority; if not, I will\ncontinue to assign higher priority to other features that better support\nnon-Roman scripts that use the BMP; regarding CJK and non-BMP, I agree that\nit is useful to support those characters, however, i'd like to see fonts\nthat are available for these characters first;", "id": 159839, "time": "2012-06-08T18:03:53Z", "creator": "gadams@apache.org", "creation_time": "2012-06-08T18:03:53Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 51843, "text": "Hello,\nI have used FOP library to generate PDF files for a serval years. It was a great library to perform the task. However, I found some \"?\" exist in PDF files recently. I have tried to find the root cause, the problem character byte code is not same with my previous using one. According to Microsoft document(here is the link http://www.microsoft.com/en-us/download/details.aspx?id=12080), some of the characters can be represented by both PUA or Unicode 4.1 byte code. And PUA is just a backward compatiable solution. And it seems PUA support is going to fade out in coming future. So is it possible to put this enhancment to higher priority?\nKit", "id": 159898, "time": "2012-06-12T03:20:39Z", "creator": "ngkit8828@hotmail.com.hk", "creation_time": "2012-06-12T03:20:39Z", "is_private": false, "attachment_id": null}, {"count": 10, "attachment_id": null, "bug_id": 51843, "text": "(In reply to comment #9)\n> Hello,\n> I have used FOP library to generate PDF files for a serval years. It was a\n> great library to perform the task. However, I found some \"?\" exist in PDF\n> files recently. I have tried to find the root cause, the problem character\n> byte code is not same with my previous using one. According to Microsoft\n> document(here is the link\n> http://www.microsoft.com/en-us/download/details.aspx?id=12080), some of the\n> characters can be represented by both PUA or Unicode 4.1 byte code. And PUA\n> is just a backward compatiable solution. And it seems PUA support is going\n> to fade out in coming future. So is it possible to put this enhancment to\n> higher priority?\n> Kit\n\nI don't understand your comment. You need to provide more details to know if you have a problem or not, and if you do, whether it relates to this bug or not. If you have a problem with a specific input FO file, then attach that file along with the PDF file you obtain when running FOP. Also attach any console output. Once you do these things, I can evaluate whether your problem is legitimate or not and whether it is related or not.", "id": 159899, "time": "2012-06-12T03:24:58Z", "creator": "gadams@apache.org", "creation_time": "2012-06-12T03:24:58Z", "tags": [], "is_private": false}, {"count": 11, "tags": [], "bug_id": 51843, "text": "Hello,\nThanks for your comment and sorry for my misleading message and poor English. \nHere is my problem:\nWhen XML data files contains Chinese character with byte code does not exist in PUA, \"?\" will be displayed. \nAnd here is the fonts library information\nhttp://www.microsoft.com/en-us/download/details.aspx?id=12080\nAnd here is the character I failed to generated\nUnicde code (Hex):2070E\n\nAccording to the above URL, old PUA characters have been moved to non PUA code point assignment. It seems that Chinese characters in PUA will not have any enhancement or support in coming future. So is it possible to put this enhancment (support surrogate pairs characters) to higher priority? \n\nCheers, \nKit", "id": 159900, "time": "2012-06-12T04:20:50Z", "creator": "ngkit8828@hotmail.com.hk", "creation_time": "2012-06-12T04:20:50Z", "is_private": false, "attachment_id": null}, {"count": 12, "tags": [], "text": "(In reply to comment #11)\n> Hello,\n> Thanks for your comment and sorry for my misleading message and poor\n> English. \n> Here is my problem:\n> When XML data files contains Chinese character with byte code does not exist\n> in PUA, \"?\" will be displayed. \n> And here is the fonts library information\n> http://www.microsoft.com/en-us/download/details.aspx?id=12080\n> And here is the character I failed to generated\n> Unicde code (Hex):2070E\n> \n> According to the above URL, old PUA characters have been moved to non PUA\n> code point assignment. It seems that Chinese characters in PUA will not have\n> any enhancement or support in coming future. So is it possible to put this\n> enhancment (support surrogate pairs characters) to higher priority? \n> \n> Cheers, \n> Kit\n\nIrrelevant. Characters encoded using PUA are not interchangeable. Private means Private. In any case, I'll ignore your comment unless and until you provide a sample FO/PDF pair demonstrating a problem.\n\nMay I remind you that work on FOP (or any other Apache project) is done on a volunteer or sponsorship basis. If you want the priority placed higher, then either volunteer to do the work or sponsor someone to do the work. I welcome all improvements to FOP and will do my utmost to apply patches quickly, but your request to prioritize a particular feature has no weight unless you do something concrete to assist.\n\nJust as an FYI, my personal priority is to improve support for BMP encoded scripts, and then move on to non-BMP features.\n\nRespectfully, Glenn", "is_private": false, "id": 159903, "creator": "gadams@apache.org", "time": "2012-06-12T05:03:06Z", "bug_id": 51843, "creation_time": "2012-06-12T05:03:06Z", "attachment_id": null}, {"count": 13, "tags": [], "bug_id": 51843, "text": "(In reply to comment #11)\n> Hello,\n> Thanks for your comment and sorry for my misleading message and poor\n> English. \n> Here is my problem:\n> When XML data files contains Chinese character with byte code does not exist\n> in PUA, \"?\" will be displayed. \n> And here is the fonts library information\n> http://www.microsoft.com/en-us/download/details.aspx?id=12080\n> And here is the character I failed to generated\n> Unicde code (Hex):2070E\n> \n> According to the above URL, old PUA characters have been moved to non PUA\n> code point assignment. It seems that Chinese characters in PUA will not have\n> any enhancement or support in coming future. So is it possible to put this\n> enhancment (support surrogate pairs characters) to higher priority? \n> \n> Cheers, \n> Kit\n\ni've asked once, and i'll ask again: please provide a minimal input FO file and an output PDF file demonstrating a problem; if you can't or won't do this, i can not do anything to help", "id": 159904, "time": "2012-06-12T05:16:07Z", "creator": "gadams@apache.org", "creation_time": "2012-06-12T05:16:07Z", "is_private": false, "attachment_id": null}, {"count": 14, "tags": [], "creator": "ngkit8828@hotmail.com.hk", "is_private": false, "id": 159905, "attachment_id": 28914, "bug_id": 51843, "creation_time": "2012-06-12T07:26:29Z", "time": "2012-06-12T07:26:29Z", "text": "Created attachment 28914\nSample XSL file to generate Chinese character. It use \"Mingliu\" Chinese fonts"}, {"attachment_id": 28915, "tags": [], "creator": "ngkit8828@hotmail.com.hk", "text": "Created attachment 28915\nResult PDF file\n\nXML data files contains both characters from PUA and non PUA", "count": 15, "id": 159906, "time": "2012-06-12T07:29:11Z", "bug_id": 51843, "creation_time": "2012-06-12T07:29:11Z", "is_private": false}, {"count": 16, "tags": [], "bug_id": 51843, "text": "Created attachment 28916\nSample XML file contains both PUA and non-PUA chinese character", "id": 159907, "time": "2012-06-12T07:31:14Z", "creator": "ngkit8828@hotmail.com.hk", "creation_time": "2012-06-12T07:31:14Z", "is_private": false, "attachment_id": 28916}, {"count": 17, "tags": [], "text": "Hello,\nI have uploaded XML data file, XSL template file and result PDF file. Any other information require?\nCheers,\nKit", "is_private": false, "id": 159908, "creator": "ngkit8828@hotmail.com.hk", "time": "2012-06-12T07:33:39Z", "bug_id": 51843, "creation_time": "2012-06-12T07:33:39Z", "attachment_id": null}, {"count": 18, "tags": [], "creator": "psancho.asf@gmail.com", "text": "(In reply to comment #17)\n> Hello,\n> I have uploaded XML data file, XSL template file and result PDF file. Any\n> other information require?\n> Cheers,\n> Kit\n\nHi,\nas Glenn said, you should attach the resulting XSL-FO resulting from the XML+XSLT transformation, this will be very helpful to reproduce (or not) the issue and identify what causes it.\n\nSee bug reporting guidelines at [1] for further info.\n\n[1] http://xmlgraphics.apache.org/fop/bugs.html#issues_new", "id": 159909, "attachment_id": null, "bug_id": 51843, "creation_time": "2012-06-12T07:42:11Z", "time": "2012-06-12T07:42:11Z", "is_private": false}, {"count": 19, "tags": [], "bug_id": 51843, "text": "Created attachment 28917\nSample FO file to generate PDF file", "id": 159910, "time": "2012-06-12T08:30:12Z", "creator": "ngkit8828@hotmail.com.hk", "creation_time": "2012-06-12T08:30:12Z", "is_private": false, "attachment_id": 28917}, {"count": 20, "tags": [], "creator": "ngkit8828@hotmail.com.hk", "text": "Created attachment 28918\nSample FO file to generate PDF", "id": 159911, "time": "2012-06-12T08:32:06Z", "bug_id": 51843, "creation_time": "2012-06-12T08:32:06Z", "is_private": false, "attachment_id": 28918}, {"count": 21, "tags": [], "creator": "ngkit8828@hotmail.com.hk", "text": "Created attachment 28919\nResult PDF file", "id": 159912, "attachment_id": 28919, "bug_id": 51843, "creation_time": "2012-06-12T08:32:32Z", "time": "2012-06-12T08:32:32Z", "is_private": false}, {"count": 22, "tags": [], "bug_id": 51843, "is_private": false, "text": "Hello,\nSorry, I have upload wrong files before. I have uploaded XSL-FO result file result PDF file. Any other information require?\nCheers,\nKit", "id": 159913, "time": "2012-06-12T09:15:33Z", "creator": "ngkit8828@hotmail.com.hk", "creation_time": "2012-06-12T09:15:33Z", "attachment_id": null}, {"count": 23, "attachment_id": null, "bug_id": 51843, "text": "Hi all,\n Glad to see the thread is active again as I had similiar concerns of using non-BMP characters.  The support of non-BMP characters are very important as there are Street names that no other characters can be substituted.  \n\n If FOP can support the double surrogates, I'm sure many more developers can enjoy it as the generated PDF embedded the font by default that solved many physical printing problems of printer loaded fonts.\n\nJacky", "id": 159941, "time": "2012-06-13T07:20:42Z", "creator": "jkklun@yahoo.com", "creation_time": "2012-06-13T07:20:42Z", "tags": [], "is_private": false}, {"count": 24, "tags": [], "bug_id": 51843, "attachment_id": null, "is_private": false, "id": 159993, "time": "2012-06-14T06:54:28Z", "creator": "rcwk001@yahoo.com.hk", "creation_time": "2012-06-14T06:54:28Z", "text": "Regarding above problem, we encountered same issue on my applications.\nIt looks an common issue for chinese characters applications. Hoping that fix could be provided soon. Many Thanks.\n\nRick"}, {"count": 25, "attachment_id": null, "bug_id": 51843, "is_private": false, "id": 160005, "time": "2012-06-14T11:29:15Z", "creator": "thomasyu2008@gmail.com", "creation_time": "2012-06-14T11:29:15Z", "tags": [], "text": "Great that finally searched some related information about support non-BMP characters issue with FOP, & also wanna to know if it is due to FOP, & that problem quite annoying if my APPL should finally go ahead for deploy with FOP @production.\n\nJoin thread to hear gd news.\nTY"}, {"count": 26, "tags": [], "text": "(In reply to comment #25)\n> Great that finally searched some related information about support non-BMP\n> characters issue with FOP, & also wanna to know if it is due to FOP, & that\n> problem quite annoying if my APPL should finally go ahead for deploy with\n> FOP @production.\n> \n> Join thread to hear gd news.\n> TY\n\ndon't jump to the conclusion that anything has changed in FOP: it hasn't!\n\nalso, keep in mind that adding support for non-BMP characters in FOP is only a part of the solution; the larger part of the solution is outside of the scope of FOP, namely, the availability of OpenType or TrueType fonts that contain a 'cmap' table that satisfies one of the following:\n\n* platform ID 0 (unicode), encoding ID 3 (unicode 2.0 or later),\n  format 10.0 (trimmed array)\n\n* platform ID 0 (unicode), encoding ID 3 (unicode 2.0 or later),\n  format 12.0 (segmented coverage)\n\n* platform ID 3 (windows), encoding ID 10 (ucs-4),\n  format 12.0 (segmented coverage) \n\nso far, nobody has provide me a link to or a copy of such a font, and, until i have such a font in hand, i'm not going to take any action with respect to this bug", "is_private": false, "id": 160008, "creator": "gadams@apache.org", "time": "2012-06-14T15:50:18Z", "bug_id": 51843, "creation_time": "2012-06-14T15:50:18Z", "attachment_id": null}, {"count": 27, "tags": [], "text": "Same problem here! Do you guys can provide me any work around before the bug is fixed? you know, it takes time to seek a suitable fonts to fit. Anyway, will keep an eye on the thread.\n\nCusson", "is_private": false, "bug_id": 51843, "id": 160023, "time": "2012-06-15T07:05:52Z", "creator": "cussono@gmail.com", "creation_time": "2012-06-15T07:05:52Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "ttkkmm0608@hotmail.com", "text": "Hi Glenn, \n\nSorry not understand your requested fonts clearly. Is there any software/tools\nto check the fonts supported the 'cmap' you mentioned?\nI tried Microsoft Font Properties extension tools\nhttp://www.microsoft.com/typography/TrueTypeProperty21.mspx\nto check if i got fonts that suit, but it didn't involve the cmap properties.\nThanks.\n\nThomas T.\n\n(In reply to comment #26)\n> (In reply to comment #25)\n> Great that finally searched some related\n> information about support non-BMP\n> characters issue with FOP, & also wanna\n> to know if it is due to FOP, & that\n> problem quite annoying if my APPL\n> should finally go ahead for deploy with\n> FOP @production.\n> \n> Join thread\n> to hear gd news.\n> TY\n\ndon't jump to the conclusion that anything has\n> changed in FOP: it hasn't!\n\nalso, keep in mind that adding support for\n> non-BMP characters in FOP is only a part of the solution; the larger part of\n> the solution is outside of the scope of FOP, namely, the availability of\n> OpenType or TrueType fonts that contain a 'cmap' table that satisfies one of\n> the following:\n\n* platform ID 0 (unicode), encoding ID 3 (unicode 2.0 or\n> later),\n  format 10.0 (trimmed array)\n\n* platform ID 0 (unicode), encoding\n> ID 3 (unicode 2.0 or later),\n  format 12.0 (segmented coverage)\n\n* platform\n> ID 3 (windows), encoding ID 10 (ucs-4),\n  format 12.0 (segmented coverage) \n> so far, nobody has provide me a link to or a copy of such a font, and, until\n> i have such a font in hand, i'm not going to take any action with respect to\n> this bug", "count": 28, "id": 160072, "time": "2012-06-18T10:29:30Z", "bug_id": 51843, "creation_time": "2012-06-18T10:29:30Z", "is_private": false}, {"count": 29, "tags": [], "creator": "gadams@apache.org", "is_private": false, "id": 160080, "attachment_id": null, "bug_id": 51843, "creation_time": "2012-06-18T14:42:03Z", "time": "2012-06-18T14:42:03Z", "text": "(In reply to comment #28)\n> Sorry not understand your requested fonts clearly. Is there any\n> software/tools\n> to check the fonts supported the 'cmap' you mentioned?\n> I tried Microsoft Font Properties extension tools\n> http://www.microsoft.com/typography/TrueTypeProperty21.mspx\n> to check if i got fonts that suit, but it didn't involve the cmap properties.\n\nOne option is the 'ttx' tool in the Adobe Font Development Kit for Opentype (AFDKO)"}, {"attachment_id": null, "tags": [], "creator": "ttkkmm0608@hotmail.com", "text": "Hi Glenn,\nFrom your suggested tools, i found 4 kinds of fonts bundled in windows 7 with the following cmap supported, are that what you are looking for?\nebrima.ttf\n<cmap_format_12 platformID=\"3\" platEncID=\"10\" format=\"12\" reserved=\"0\" length=\"7012\" language=\"0\" nGroups=\"583\">\n\nebrimabd.ttf\n<cmap_format_12 platformID=\"3\" platEncID=\"10\" format=\"12\" reserved=\"0\" length=\"7012\" language=\"0\" nGroups=\"583\">\n\nseguisym.ttf\n<cmap_format_12 platformID=\"3\" platEncID=\"10\" format=\"12\" reserved=\"0\" length=\"1900\" language=\"0\" nGroups=\"157\">\n\nsimsunb.ttf\n<cmap_format_12 platformID=\"3\" platEncID=\"10\" format=\"12\" reserved=\"0\" length=\"40\" language=\"0\" nGroups=\"2\">\n\nThomas T.\n\n(In reply to comment #29)\n> (In reply to comment #28)\n> Sorry not understand your requested fonts\n> clearly. Is there any\n> software/tools\n> to check the fonts supported the\n> 'cmap' you mentioned?\n> I tried Microsoft Font Properties extension tools\n>\n> http://www.microsoft.com/typography/TrueTypeProperty21.mspx\n> to check if i\n> got fonts that suit, but it didn't involve the cmap properties.\n\nOne option\n> is the 'ttx' tool in the Adobe Font Development Kit for Opentype (AFDKO)", "count": 30, "id": 160088, "time": "2012-06-19T04:47:03Z", "bug_id": 51843, "creation_time": "2012-06-19T04:47:03Z", "is_private": false}, {"count": 31, "tags": [], "creator": "ttkkmm0608@hotmail.com", "is_private": false, "id": 160232, "attachment_id": null, "bug_id": 51843, "creation_time": "2012-06-25T11:28:09Z", "time": "2012-06-25T11:28:09Z", "text": "Hi, \nIs my suggested fonts help? Or i need to find another??\n\nThomas T."}, {"count": 32, "tags": [], "creator": "gadams@apache.org", "text": "(In reply to comment #31)\n> Is my suggested fonts help? Or i need to find another??\n\nYes, it will be helpful when I am ready to start working on this bug. I do not have a schedule for when I will start. Thanks for your checking on Win fonts that support non-BMP encodings.", "id": 160234, "attachment_id": null, "bug_id": 51843, "creation_time": "2012-06-25T13:26:11Z", "time": "2012-06-25T13:26:11Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "shepardcklee@gmail.com", "text": "Hi All, \n\nI encountered the same issue on my applications using fop 1.0. \nGlad to see the issue is going to be fixed in the coming version.\nMay I know if this bug will be fixed in version 1.1 only or it will be patched in version 1.0, too?\n\nShepard", "count": 33, "id": 160460, "time": "2012-07-05T07:23:14Z", "bug_id": 51843, "creation_time": "2012-07-05T07:23:14Z", "is_private": false}, {"count": 34, "tags": [], "bug_id": 51843, "text": "(In reply to comment #33)\n> Hi All, \n> \n> I encountered the same issue on my applications using fop 1.0. \n> Glad to see the issue is going to be fixed in the coming version.\n> May I know if this bug will be fixed in version 1.1 only or it will be\n> patched in version 1.0, too?\n\nNo, this is NOT going to be fixed in the upcoming version. I have made NO statements about when this will be addressed in FOP.\n\nIn particular, it will NOT be patched in 1.0 and will NOT be addressed in 1.1. This is a POSSIBLE 1.2 (or later) fix.", "id": 160461, "time": "2012-07-05T07:29:23Z", "creator": "gadams@apache.org", "creation_time": "2012-07-05T07:29:23Z", "is_private": false, "attachment_id": null}, {"count": 35, "tags": [], "creator": "jkklun@yahoo.com", "text": "(In reply to comment #34)\n> (In reply to comment #33)\n> Hi All, \n> \n> I encountered the same issue on my\n> applications using fop 1.0. \n> Glad to see the issue is going to be fixed in\n> the coming version.\n> May I know if this bug will be fixed in version 1.1\n> only or it will be\n> patched in version 1.0, too?\n\nNo, this is NOT going to\n> be fixed in the upcoming version. I have made NO statements about when this\n> will be addressed in FOP.\n\nIn particular, it will NOT be patched in 1.0 and\n> will NOT be addressed in 1.1. This is a POSSIBLE 1.2 (or later) fix.\n\n(In reply to comment #34)\n> (In reply to comment #33)\n> Hi All, \n> \n> I encountered the same issue on my\n> applications using fop 1.0. \n> Glad to see the issue is going to be fixed in\n> the coming version.\n> May I know if this bug will be fixed in version 1.1\n> only or it will be\n> patched in version 1.0, too?\n\nNo, this is NOT going to\n> be fixed in the upcoming version. I have made NO statements about when this\n> will be addressed in FOP.\n\nIn particular, it will NOT be patched in 1.0 and\n> will NOT be addressed in 1.1. This is a POSSIBLE 1.2 (or later) fix.\n\nHi Adams,\n Nice to see you'd considered this thread.  As I knew, even mainframe has similiar issues in using supporting surrogate pairs. Is that any workaround if stick to latest FOP version, or any news on tenative rollout of v1.2?\n\nJacky", "id": 160519, "attachment_id": null, "bug_id": 51843, "creation_time": "2012-07-09T03:53:49Z", "time": "2012-07-09T03:53:49Z", "is_private": false}, {"count": 36, "attachment_id": null, "bug_id": 51843, "is_private": false, "id": 160520, "time": "2012-07-09T04:56:33Z", "creator": "gadams@apache.org", "creation_time": "2012-07-09T04:56:33Z", "tags": [], "text": "(In reply to comment #35)\n> Nice to see you'd considered this thread.  As I knew, even mainframe has\n> similiar issues in using supporting surrogate pairs. Is that any workaround\n> if stick to latest FOP version, or any news on tenative rollout of v1.2?\n\nFOP 1.1rc1 was just release, and perhaps one month later 1.1 will be released. After that, I intend to put this work item on my list for possible 1.2 features. There is no schedule for 1.2, but I'd like to do it by the end of this year."}, {"count": 37, "tags": [], "bug_id": 51843, "is_private": false, "text": "(In reply to comment #36)\n> (In reply to comment #35)\n> > Nice to see you'd considered this thread.  As I knew, even mainframe has\n> > similiar issues in using supporting surrogate pairs. Is that any workaround\n> > if stick to latest FOP version, or any news on tenative rollout of v1.2?\n> \n> FOP 1.1rc1 was just release, and perhaps one month later 1.1 will be\n> released. After that, I intend to put this work item on my list for possible\n> 1.2 features. There is no schedule for 1.2, but I'd like to do it by the end\n> of this year.\n\nHi Glenn, \nThanks for considering adding this feature in FOP 1.2 by the end of this year.\n\nWe are using FOP 1.1, and we want to have this feature as soon as it is get added.\n\nSo, we are wondering:\n- Do you think this will be done in the near future?\n- Will the solution can be patched to FOP 1.1 easily? \n\nThanks for your coordination.", "id": 163928, "time": "2012-12-06T18:03:05Z", "creator": "sayoub@ca.ibm.com", "creation_time": "2012-12-06T18:03:05Z", "attachment_id": null}]