[{"count": 0, "tags": [], "creator": "sebb@apache.org", "text": "JMeter by default uses System.nanoTime() for timing samples, as this gives greater accuracy than System.currentTimeMillis(). The latter often has a granularity of 10-20 milliseconds.\n\nAfter it was introduced, it was discovered that nanoTime can drift quite substantially from wall time over the course of a test run.\n\nFor this reason, the SampleResult class now only uses nanoTime to enhance the accuracy of currentTimeMillis. It does this by calculating the offset between nanoTime and TimeMillis, effectively resetting the nanoTime with each sample.\n\nThis ensures that individual sample times are accurate, without allowing the start and end times to drift from wall time.\n\nHowever, the nanoTime offset is affected by the TimeMillis granularity; consecutive samples may vary by 10-20 ms. This has the consequence that the current calculation of the parent sample end time may result in the parent elapsed time being shorter than the sum of its constituent elapsed times, or being noticeably greater. The difference can be 10-20 ms either way.\n\nIt's more important that elapsed times are accurate, rather than having exact start and end times (these are subject to the TimeMillis granularity anyway).\n\nOne fix is to adjust the parent sample end time by the difference in the nanoTime offsets, thus allowing for the drift.\n\nAn alternative fix would be to ensure that all the samples in the parent group used the same nanoTime offset; however the offset is currently final. Perhaps consider this for a later release.", "id": 149556, "time": "2011-09-20T23:50:43Z", "bug_id": 51855, "creation_time": "2011-09-20T23:50:43Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 149560, "time": "2011-09-21T01:03:52Z", "bug_id": 51855, "creation_time": "2011-09-21T01:03:52Z", "is_private": false, "text": "URL: http://svn.apache.org/viewvc?rev=1173443&view=rev\nLog:\nBug 51855 - Parent samples may have slightly inaccurate elapsed times\n\nModified:\n   jakarta/jmeter/trunk/src/core/org/apache/jmeter/samplers/SampleResult.java\n   jakarta/jmeter/trunk/test/src/org/apache/jmeter/samplers/TestSampleResult.java\n   jakarta/jmeter/trunk/xdocs/changes.xml"}]