[{"count": 0, "tags": [], "creator": "youngm@gmail.com", "attachment_id": null, "id": 149677, "time": "2011-09-22T23:23:49Z", "bug_id": 51879, "creation_time": "2011-09-22T23:23:49Z", "is_private": false, "text": "I'm attempting to use tomcat-jdbc with Oracle Streams AQ.  Oracle Streams AQ requires a connection of type OracleConnection.  Streams AQ will also under some circumstances close the OracleConnection it is using.  If I use unwrap to get an OracleConnection and then Streams AQ closes that connection it will leave my tomcat-jdbc pool in a messed up state since connections will be closed that tomcat-jdbc thinks are open.\n\nI can see 2 ways tomcat-jdbc may be able to help simplify this use case for developers:\n\n1.  Tomcat JDBC can proxy connections it returns from Wrapper.unwrap with the interface provided.  Currently tomcat-jdbc's ProxyConnection class will only unwrap to PooledConnection or XAConnection.  Otherwise it simply returns the physical connection.\n\nFor example, if I am using the ResetAbandonedTimer interceptor and need to take advantage of an Oracle specific method in oracle.jdbc.OracleConnection I would like to be able to invoke:\n\nOracleConnection oraCon = connection.unwrap(OracleConnection.class);\noraCon.someOracleSpecificCommand();\n\nmy use of oraCon could still invoke ResetAbandonedTimer.\n\nOr if I were to invoke oraCon.close() this should correctly return this connection to the pool.\n\nFYI, this is how Websphere's connection pool implements unwrap.\n\n\n2.  When creating the original connection in org.apache.tomcat.jdbc.pool.ConnectionPool.getProxyConstructor() include in the proxied interfaces any interfaces the native connection also implements.  That way I wouldn't need to unwrap the tomcat-jdbc provided connection since it will already implement the native connection's interfaces.\n\nFYI, this is how Oracle UCP works.\n\nThoughts?  I'd be happy to provide a patch if the functionality is desirable.\n\nMike"}, {"count": 1, "tags": [], "bug_id": 51879, "text": "patch and test cases would be helpful", "id": 155121, "time": "2012-03-20T15:49:26Z", "creator": "fhanik@apache.org", "creation_time": "2012-03-20T15:49:26Z", "is_private": false, "attachment_id": null}]