[{"count": 0, "tags": [], "creator": "ilatypov@infradead.org", "is_private": false, "text": "I could not see Apache httpd-2 reacting to my changes of DocumentRoot of its 32-bit package installed in the 64-bit Windows Server 2008 R2 SP1.  Using Process Explorer I figured that \"-k runservice\" executed the following command,\n\n\"C:\\Program Files (x86)\\Apache Software Foundation\\Apache2.2\\bin\\httpd.exe\" -d\n\"C:/Program Files (x86)/Apache Software Foundation/Apache2.2\"\n\nI saw the -f option with a path to httpd.conf originally as well.\n\nRunning httpd.exe as a regular process while residing in the Apache directory with the -f option pointing to the configuration file still worked.\n\nI suspect that Apache configuration parser could not handle brackets after\nseeing a suggestion to symlink the server directory to a simple path,\n\n http://jamesmcdonald.id.au/it-tips/32-bit-apache-on-windows-error\n\nAnother post refers to the work-around suggested in the above link describing the issue as \"annoying\",\n\n http://www.thoughtlabs.com/2011/03/25/how-to-set-up-apache-on-windows-7-to-support-facebook-secure-browsing/\n\nSo I created a directory symlink and changed all references to the \"(x86)\"\ndirectory in configuration files with \"c:/apache\".\n\n c:\n cd \\\n mklink /d apache \"c:\\Program Files (x86)\\Apache Software Foundation\\Apache2.2\"\n\nThen I stopped the service and restarted it again.\n\n C:\\apache\\conf>..\\bin\\httpd.exe -k start\n\nThis time I could see my own DocumentRoot taking its place in the browser after\ncleaning its cache.\n\nNB: I did not realize that \"-k uninstall\" followed by \"-k install\" will erase\nmy crafted configuration files.  The logs\\install.log file showed me how\nhttpd.exe copied original files on top of my modifications.  So I learned to\nsave configuration files away from the Apache directories.", "id": 149921, "time": "2011-09-28T16:48:39Z", "bug_id": 51913, "creation_time": "2011-09-28T16:48:39Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "\"Your\" changes weren't seen because you modified httpd.conf as a regular user\nwith UAC enabled and system file virtualization in effect.  \n\nhttp://en.wikipedia.org/wiki/User_Account_Control#Features\n\nNot an httpd bug, and this is not a support forum, please take further questions to the appropriate peer user support mailing list.", "is_private": false, "bug_id": 51913, "id": 149922, "time": "2011-09-28T17:28:40Z", "creator": "wrowe@apache.org", "creation_time": "2011-09-28T17:28:40Z", "attachment_id": null}]