[{"count": 0, "tags": [], "bug_id": 51928, "text": "Created attachment 27649\nUpdate unit tests to JUnit4\n\nThis is the eagerly anticipated upgrade of FOPs JUnit tests to JUnit4. There are a few notable differences:\n1) Tests can now be parameterized (I'll discuss this later).\n2) The test outputs have less meaningful names when parameterized, the layout engine tests used to be instantiated with the names of set as the name of the FO used in the test. Because these have been changed to be parameterized tests, the output is less useful. I haven't found a suitable way of changing the name of the test for a parameterized test short of overriding the org.junit.runners.Parameterized.\n\nI've tried to touch as little as possible with the layout engine tests, in terms of their reliance on the system properties being injected in. I wish to change that in a future commit, but I think it's a logically separate issue and I will create a separate patch for that.\n\nThe layout engine tests do need a little TLC, there seems to be a fair amount of code duplication in that area. I'll address these at the same time as the patch above.", "id": 149980, "time": "2011-09-30T13:41:00Z", "creator": "med1985@gmail.com", "creation_time": "2011-09-30T13:41:00Z", "is_private": false, "attachment_id": 27649}, {"count": 1, "tags": [], "bug_id": 51928, "attachment_id": null, "is_private": false, "id": 150080, "time": "2011-10-03T14:38:47Z", "creator": "vhennebert@gmail.com", "creation_time": "2011-10-03T14:38:47Z", "text": "Hi Mehdi,\n\nThe patch is missing a new LayoutEngineTestUtils class. Can you please add it to this bug report?\n\nIn the future, you can include new classes directly to patches by 'svn add'ing them before creating the patch.\n\nThanks,\nVincent"}, {"count": 2, "tags": [], "bug_id": 51928, "attachment_id": 27677, "is_private": false, "id": 150081, "time": "2011-10-03T14:46:34Z", "creator": "med1985@gmail.com", "creation_time": "2011-10-03T14:46:34Z", "text": "Created attachment 27677\npatch with LayoutEngineTestUtils"}, {"count": 3, "tags": [], "text": "Patch applied in rev. 1178747:\nhttp://svn.apache.org/viewvc?rev=1178747&view=rev\n\nI made some minor modifications relating to cosmetics and a few elements lost in the conversion.\n\nSome things could be improved in the FO Tree, Layout and Area Tree tests but since you mentioned that you will be working on them in a separate patch, I committed them as they are.\n\nThanks!\nVincent", "is_private": false, "id": 150114, "creator": "vhennebert@gmail.com", "time": "2011-10-04T10:13:25Z", "bug_id": 51928, "creation_time": "2011-10-04T10:13:25Z", "attachment_id": null}]