[{"count": 0, "tags": [], "bug_id": 51968, "attachment_id": null, "is_private": false, "id": 150215, "time": "2011-10-05T21:03:37Z", "creator": "chealer@gmail.com", "creation_time": "2011-10-05T21:03:37Z", "text": "The description of RewriteRule at http://httpd.apache.org/docs/current/en/mod/mod_rewrite.html#rewriterule contains:\n\nAs already mentioned, all rewrite rules are applied to the Substitution (in the order in which they are defined in the config file). The URL is completely replaced by the Substitution and the rewriting process continues until all rules have been applied, or it is explicitly terminated by a L flag.\n\nI do not understand what the first sentence means.\n\nThe second sentences assumes rules operate on URL-s. In reality, as the section explains earlier, it may operate on relative filesystem paths or on URL-paths. Also, the replacement is not necessarily Substitution. As the section explains earlier:\n\nWhen using the rewrite engine in .htaccess files the per-directory prefix (which always is the same for a specific directory) is automatically removed for the RewriteRule pattern matching and automatically added after any relative (not starting with a slash or protocol name) substitution encounters the end of a rule set. See the RewriteBase directive for more information regarding what prefix will be added back to relative substutions.\n\nBTW, note typo \"substutions\"."}, {"text": "Resolved in 2.2 and trunk, r1180734.", "tags": [], "bug_id": 51968, "attachment_id": null, "count": 1, "id": 150393, "time": "2011-10-10T00:18:36Z", "creator": "rbowen@apache.org", "creation_time": "2011-10-10T00:18:36Z", "is_private": false}, {"text": "Thank you Rich, this addresses very well the problem with the first sentence.\nThis report was broad, I opened a new report about the second sentence: https://issues.apache.org/bugzilla/show_bug.cgi?id=52000\nThat one has an even better number!", "tags": [], "bug_id": 51968, "attachment_id": null, "count": 2, "id": 150395, "time": "2011-10-10T00:42:51Z", "creator": "chealer@gmail.com", "creation_time": "2011-10-10T00:42:51Z", "is_private": false}]