[{"count": 0, "tags": [], "creator": "chealer@gmail.com", "text": "The description of RewriteBase at\nhttp://httpd.apache.org/docs/current/en/mod/mod_rewrite.html#rewritebase\ncontains:\n\nThe default setting is; RewriteBase physical-directory-path\n\nphysical-directory-path is not defined.\n\nBTW, the following sentence is unclear (\"When a substitution occurs for a new URL, this module has to re-inject the URL into the server processing.\"). If I understand it correctly, I suppose \"a substitution occurs for a new URL\" could be changed to \"a URL substitution occurs\".\nAlso, towards the end, the explanation of the example contains: \"In the above example, a request to /xyz/oldstuff.html gets correctly rewritten to the physical file /abc/def/newstuff.html.\". It would clarify to explain what would have happened without the RewriteBase directive.", "id": 150218, "time": "2011-10-05T21:16:11Z", "bug_id": 51969, "creation_time": "2011-10-05T21:16:11Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "id": 150372, "time": "2011-10-08T22:41:40Z", "bug_id": 51969, "creation_time": "2011-10-08T22:41:40Z", "is_private": false, "text": "I think that this has been greatly clarified in the trunk docs  - see http://httpd.apache.org/docs/trunk/en/mod/mod_rewrite.html#rewritebase and let me know if you disagree."}, {"count": 2, "text": "I agree, that's much more clear. It would still clarify to explain what would happen with the example if RewriteBase hadn't been used.", "bug_id": 51969, "attachment_id": null, "id": 150397, "time": "2011-10-10T05:23:15Z", "creator": "chealer@gmail.com", "creation_time": "2011-10-10T05:23:15Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 51969, "text": "I've reworked and simplified the example and demonstrated one of the results of not using rewritebase when an outside-the-docroot-alias is followed then a relative path is rewritten to.\n\nhttp://svn.apache.org/viewvc?view=revision&revision=1308320\n\nBackported through 2.2.x", "id": 157055, "time": "2012-04-02T13:32:58Z", "creator": "covener@gmail.com", "creation_time": "2012-04-02T13:32:58Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 51969, "attachment_id": null, "id": 157808, "time": "2012-04-10T20:59:32Z", "creator": "chealer@gmail.com", "creation_time": "2012-04-10T20:59:32Z", "is_private": false, "text": "Thank you very much.\n\nI suggest the following to be even clearer:\n\nChange the description to \"Sets the base URL for relative rewrites (in per-directory context)\"\n\nChange the second paragraph to:\n\nThis directive is required when using a relative path in a substitution in per-directory (htaccess) context, except in the following cases:\n\n    The original and new URI-s are reached via the main document tree (as opposed to reached by other means, such as Alias). This requires the affected directory to be in the DocumentRoot.\n    Very rarely, relative rewrite rules should redirect to a URL path formed by the concatenation - first - of the filesystem path to the directory containing relative rewrite rules and - second - of the substitution.\n\nHowever, I'm not sure the second case should be kept. It seems so unlikely that I can't come up with a plausible example."}]