[{"count": 0, "tags": [], "creator": "jonathan.shore@gmail.com", "text": "The mono gmcs compiler does not support later version of the C# standard (such as C# 4.0).  <csc> should now call the dmcs compiler which embodies C# 2.0 - 4.0 standards.\n\nI was unable to build C# v4.0 source code or use v4.0 libraries with the current implementation.  I made a local adjustment to the CSharp.java class to use dmcs instead of gmcs, and all is fine.\n\nPlease consider for the next release.", "id": 150220, "time": "2011-10-05T21:25:43Z", "bug_id": 51970, "creation_time": "2011-10-05T21:25:43Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "text": "On my Ubuntu 10.4 box with the default Mono installed (2.6) there is no dmcs.  Yes I know this is not exactly the latest version of Mono.\n\nIn either case we'd either need to autodetect whether dmcs is there or let the user chose explicitly using a new attribute.  The later actually already is there, you should be able to set the executable attribute.\n\nI'd be willing to change the default for Mono to dmcs in the next release.", "id": 150281, "time": "2011-10-07T04:10:40Z", "bug_id": 51970, "creation_time": "2011-10-07T04:10:40Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "jonathan.shore@gmail.com", "text": "Thanks I did not realize that there was a tag for executable as could not find the docs for csc on the web (though now can see in the source distribution).   Is csc deprecated?   Is the idea with apache-ant-dotnet to delegate to nant where possible?   Hope that csc remains with the project, as prefer to use ant over nant.", "id": 150309, "time": "2011-10-07T12:46:42Z", "bug_id": 51970, "creation_time": "2011-10-07T12:46:42Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "bodewig@apache.org", "is_private": false, "id": 150312, "attachment_id": null, "bug_id": 51970, "creation_time": "2011-10-07T14:03:32Z", "time": "2011-10-07T14:03:32Z", "text": "We have decided to move the .NEt tasks out of the main distribution into a separate jar that can have an independent release cycle long ago.\n\nThe .NET Antlib contains csc and other tasks and isn't going away anytime soon - even though it is very light on development as not many people use Ant for .NET stuff."}, {"count": 4, "tags": [], "bug_id": 51970, "attachment_id": null, "id": 179130, "time": "2014-11-16T09:21:41Z", "creator": "bodewig@apache.org", "creation_time": "2014-11-16T09:21:41Z", "is_private": false, "text": "with git commit 3d7ce89 the task defaults to dmcs now.\n\nPlease remove the links from the last comment or I'll be forced to delete the whole comment."}]