[{"count": 0, "tags": [], "bug_id": 51971, "attachment_id": null, "id": 150223, "time": "2011-10-05T21:30:44Z", "creator": "sergioteixeira1@gmail.com", "creation_time": "2011-10-05T21:30:44Z", "is_private": false, "text": "With this enhancement I was able to provide methods to insert custom properties in DOCX and XLSX file types. In addition these classes also include the methods already working for DOC and XLS files. Powerpoint case is not handled. In addition in case the properties are being used in the body text of the DOCX document, the properties are also updated in the text. This propagation funcionality has not been treted for DOC, XLS and XLSX formats (I don't even know if it is possible to provide this kind of functionality in Excel. Again, Powerpoint hasn't got any of the previous enhancements. So to summarize it should be possible for:\nDOCX -> update or insert custom properties; also propagate the updated propeties into the body text.\nXLSX -> update or insert custom properties.\nXLS -> update or insert custom properties.\nDOC -> update or insert custom properties."}, {"count": 1, "tags": [], "bug_id": 51971, "attachment_id": null, "is_private": false, "id": 150226, "time": "2011-10-05T21:37:23Z", "creator": "apache@gagravarr.org", "creation_time": "2011-10-05T21:37:23Z", "text": "Any chance you could upload the patch for this?"}, {"count": 2, "tags": [], "bug_id": 51971, "is_private": false, "text": "(In reply to comment #1)\n> Any chance you could upload the patch for this?\n\nHi Nick,\n\nI'd gladly do so, but my authentication doesn't work when svn client (Tortoise) asks for it. Have you got any indication? This is my first commit with the project...\n\nRegards", "id": 150230, "time": "2011-10-05T22:02:10Z", "creator": "sergioteixeira1@gmail.com", "creation_time": "2011-10-05T22:02:10Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "(In reply to comment #1)\n> Any chance you could upload the patch for this?\n\nI just saw I got this message in permissions tab:\n\nYou have the following permission bits set on your account:\ncanconfirm \tCan confirm a bug.\neditbugs \tCan edit all aspects of any bug.\n\nSo I guess I can't commit due to permission restrictions or something related.", "attachment_id": null, "id": 150231, "creator": "sergioteixeira1@gmail.com", "time": "2011-10-05T22:06:53Z", "bug_id": 51971, "creation_time": "2011-10-05T22:06:53Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "apache@gagravarr.org", "is_private": false, "count": 4, "id": 150232, "time": "2011-10-05T22:07:39Z", "bug_id": 51971, "creation_time": "2011-10-05T22:07:39Z", "text": "You won't be able to commit, instead please run a \"svn diff\" and post the patch\nfor review. (Add it as an attachment to this bug)"}, {"count": 5, "tags": [], "text": "Created attachment 27702\nnew classes to provide the described enhancement\n\nSource code patch only. Needs some review. I left a few comments tha could be deleted and I'm not sure anbout the logging...", "is_private": false, "id": 150234, "creator": "sergioteixeira1@gmail.com", "time": "2011-10-05T22:13:27Z", "bug_id": 51971, "creation_time": "2011-10-05T22:13:27Z", "attachment_id": 27702}, {"count": 6, "tags": [], "bug_id": 51971, "is_private": false, "text": "Let me know what you think of the patch. If necessary I can spend a couple of hours during this weekend to fine-tune according to indications you might provide.\nRegards,\nSérgio", "id": 150237, "time": "2011-10-05T22:17:47Z", "creator": "sergioteixeira1@gmail.com", "creation_time": "2011-10-05T22:17:47Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 51971, "attachment_id": null, "id": 150238, "time": "2011-10-05T22:27:20Z", "creator": "apache@gagravarr.org", "creation_time": "2011-10-05T22:27:20Z", "is_private": false, "text": "If it were me, I'd probably have this all work on an open document, rather than copying files about the place. That way, someone could do\n\n   open file\n   make changes\n   have custom properties tweaked\n   save where they want\n\nRather than having to do the custom properties in a whole separate step\n\nI'd probably also be tempted to try to push a lot of the logic into POIDocument / POIXMLDocument, and then have a hook point where specific file formats can do special things (eg word update fields in the document). That may help reduce code duplication too, and keep things working in a common way"}, {"count": 8, "tags": [], "text": "Created attachment 27748\nupdated the patch according to previous indications\n\nHere's my patch updated. I've done it according to your indications regading Docx and Xlsx; I've also changed logging to be close to the POI standards (I hope). Main classes afected are: POIXMLDocument and XWPFDocument. I didn't have time to go for the Doc and Xls cases, because the code I have uses slightly different hooks to start processing the files. If you see that changing POIDocument class is a major addition let me know, I'll try to find some more time for that upgrade. But I couldn't get to the POIDocument derived class that handles the Doc file (I think I found the one for Xls though).\n\nAny comments are most welcome. Sorry for having done only for the Docx and Xlsx but it seems to me that those 2 are the most critical for the project I guess and Doc and Xls already have examples etc.\n\n\nRegards,\nSérgio", "attachment_id": 27748, "id": 150386, "creator": "sergioteixeira1@gmail.com", "time": "2011-10-09T21:32:36Z", "bug_id": 51971, "creation_time": "2011-10-09T21:32:36Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 51971, "attachment_id": null, "id": 202962, "time": "2017-12-30T15:32:43Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2017-12-30T15:32:43Z", "is_private": false, "text": "*** Bug 61547 has been marked as a duplicate of this bug. ***"}]