[{"count": 0, "tags": [], "text": "Maybe this is related to bug 28751 or not, or if already bug submitted but don't think so.\n\nI encountered an interesting bug/use case that's not documented for JMeter (unless I overlooked the JMeter documentation somewhere).\n\nI have a test plan with 1 thread group where I only need to use and thus only want to increment a counter within a while loop. To use such, I would need to define counter prior to use in while loop, but I wanted to compact and streamline things so felt defining the counter before the while loop was unnecessary. So this is what I did:\n\nCreate the counter, increment it, and evaluate its value in a condition all at once as the while controller's condition\n\n${__javaScript( ${__counter(TRUE,cnt)} <= 10 )}\n\nthen within the while loop, samplers can reference the counter ${cnt} value as needed, which won't increment the counter.\n\nBut I found doing so incremented the counter by 2 instead of 1. It did start with a value of one as expected. And it does work on a per thread level when I tested with 2+ threads. And the loop does end after condition is false.\n\nI also tried alternative of defining a user defined variable \"cnt\" with value of 1 before and outside of the while loop then incremented it in the while condition like this\n\n${__javaScript( ${__intSum(${cnt},1,cnt)} <= 10 )}\n\nbut ended with same behavior of increment by 2.\n\nI posted to JMeter list but got no response regarding whether this is a bug or not. But a user found that if the counter is incremented within the while loop, in a sampler, etc. it will then increment correctly for the loop.\n\nBut I find that rather less optimal. I don't see why putting the counter incrementation as part of condition would be bad, same as how one uses a for loop like for(i = 0; i < count; i++){}. I would have preferred a for controller in JMeter, but there is only the While and ForEach controllers.\n\nUnless there is a valid JMeter design choice for this behavior, I would think this is a bug.", "attachment_id": null, "bug_id": 51999, "id": 150375, "time": "2011-10-09T04:51:03Z", "creator": "mangaroo@gmail.com", "creation_time": "2011-10-09T04:51:03Z", "is_private": false}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "text": "Hello,\nCan you attach your test plan ?\n\nThank you\nRegards", "id": 151359, "time": "2011-11-10T08:28:52Z", "bug_id": 51999, "creation_time": "2011-11-10T08:28:52Z", "attachment_id": null}, {"count": 2, "attachment_id": 27932, "bug_id": 51999, "text": "Created attachment 27932\nSample test plan demonstrating the bug\n\nAttached is a sample test plan demonstrating the bug. Please ignore the fact that the hyperlink regex extractor doesn't extract all links properly. What's of interest is viewing the results tree (or results table) and seeing that the counter value displayed as part of the sampler title goes from 1,3,5,7,9 for a while loop count from 0 (or 1) to 10. The even numbers are skipped, so to really loop 10 times, I had to set counter max to 20. In my case I didn't care which regex items to use as long as I'm iterating over it 10 times.\n\nI added debug sampler so can see how the regex variable is returned after extraction. The test plan was modified from original version so that it is public facing for reproducing bug.", "id": 151450, "time": "2011-11-13T19:17:24Z", "creator": "mangaroo@gmail.com", "creation_time": "2011-11-13T19:17:24Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 51999, "attachment_id": null, "is_private": false, "id": 152430, "time": "2011-12-27T22:50:46Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-12-27T22:50:46Z", "text": "Hello,\nThis is a feature of JMeter, it is due to the fact that condition is evaluated at start and end of each iteration of the while controller.\n\nI updated documentation."}, {"count": 4, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "text": "Date: Tue Dec 27 22:51:12 2011\nNew Revision: 1225046\n\nURL: http://svn.apache.org/viewvc?rev=1225046&view=rev\nLog:\nBug 51999 - Counter increments by 2 when used in while controller condition\n\nModified:\n   jmeter/trunk/xdocs/usermanual/component_reference.xml", "id": 152431, "time": "2011-12-27T22:51:53Z", "bug_id": 51999, "creation_time": "2011-12-27T22:51:53Z", "attachment_id": null}]