[{"attachment_id": null, "tags": [], "creator": "jan@unixpapa.com", "text": "First this is 2.3.14-beta, which wasn't an option on the Version select.\n\nI was trying to modify an authentication module I maintain to work with mod_authn_socache, and set up a test directory with a .htaccess file. Apache seg faulted every time I hit the directory. Eventually, I took my module out and tried mod_authn_file instead, using the .htaccess file below:\n\nAuthType Basic\nAuthName \"This is a test\"\nAuthBasicProvider socache file\nAuthUserFile /home/jan/apache2.3/htdocs/mae2/htpasswd\nAuthnCacheProvideFor file\nRequire valid-user\n\nStill crashed. So, huh, maybe not my module at fault? Looked at it under gdb. It was crashing because mod_authn_socache's check_password() function was calling\n\n   rv = socache_provider->retrieve(socache_instance, r->server,\n                                    (unsigned char*)key, strlen(key),\n                                    val, &vallen, r->pool);\n\nwhile socache_instance was NULL. This looks like it is supposed to be initialized from the authn_cache_post_config() function which is called on the \"post_config\" hook. Well, yeah, but I have the vague idea that that occurs only after reading the server config, not after reading .htaccess. So since I had no AuthnCacheProvideFor directives in the server config, it wouldn't initialize at that time. It doesn't encounter the AuthnCacheProvideFor directives in my .htaccess file until later.\n\nSo I took the configuration directives out of my .htaccess file, and stuck them in a <Directory> block in httpd.conf.  No more segmentation fault.", "count": 0, "id": 150314, "time": "2011-10-07T14:38:04Z", "bug_id": 51991, "creation_time": "2011-10-07T14:38:04Z", "is_private": false}, {"count": 1, "attachment_id": null, "creator": "nick@webthing.com", "text": "Good catch, though not 100% right.  The issue is that the post_config hook tests for \"configured\", and doesn't set anything up if there's no authn_socache configuration.\n\nSolution: an extra configuration directive that'll just say \"yes, enable me\" in post_config, together with testing \"configured\" flag in the later functions.  Bug me if I haven't committed a fix by Sunday.", "id": 150319, "time": "2011-10-07T16:05:14Z", "bug_id": 51991, "creation_time": "2011-10-07T16:05:14Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "nick@webthing.com", "is_private": false, "count": 2, "id": 150352, "time": "2011-10-08T14:54:04Z", "bug_id": 51991, "creation_time": "2011-10-08T14:54:04Z", "text": "Fixed in r1180384\n\nIntroduces AuthnCacheEnable directive to determine whether initialisation happens so it can be used in .htaccess.  If not enabled, it just fails silently from htaccess."}, {"count": 3, "tags": [], "bug_id": 51991, "text": "Do I understand correctly that to able to use authn_socache from a .htaccess file, there now needs to be this argumentless \"AuthnCacheEnable\" command someplace in the main config file? So if I'm an ISP with thousands of clients on my servers and I think one of them might someday want to use authn_socache, then I ought to put \"AuthnCacheEnable\" in my config files? This seems bizarre. If I have the mod_authn_socache module installed, then haven't I already indicated my desire that it be available? Why do I need a directive that says \"Not only do I want you to be installed, I want you to work too!\" I don't understand it.\n\nPhilosophy aside, I think there is still a problem. I haven't tested it, just looked at the code, but it looks to me like if you forget to put \"AuthnCacheEnable\" into the config file, and try to use it from a .htaccess file, then you'd still get a Segmentation Violation.  Wouldn't it be better if it generated a nice neat \"You forgot to put the meaningless AuthnCacheEnable directive into your config file so I'm going to ignore you, neener neener\" message? Or better yet, just went ahead and initialized itself?", "id": 150396, "time": "2011-10-10T02:07:48Z", "creator": "jan@unixpapa.com", "creation_time": "2011-10-10T02:07:48Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Hi, Jan, did you test and confirm that \"if you forget to put 'AuthnCacheEnable' into the config file, and try to use it from a .htaccess file, then you'd still get a Segmentation Violation\"?\n\nThanks a lot!", "is_private": false, "bug_id": 51991, "id": 154482, "time": "2012-03-04T04:44:00Z", "creator": "tixu@cs.ucsd.edu", "creation_time": "2012-03-04T04:44:00Z", "attachment_id": null}]