[{"count": 0, "tags": [], "bug_id": 52026, "attachment_id": null, "is_private": false, "id": 150556, "time": "2011-10-14T09:37:57Z", "creator": "immanuel.hayden@gmail.com", "creation_time": "2011-10-14T09:37:57Z", "text": "Hi!\n\nPlease use the system look and feel also on non-mac platforms. Metal look is exceedingly ugly.\n\nEssentially it's simply replacing this section in jmeter.properties:\n\n  # LAF can be overridden by os.name (lowercased, spaces replaced by '_')\n  # Sample os.name LAF:\n  #jmeter.laf.windows_xp=javax.swing.plaf.metal.MetalLookAndFeel\n\n  # Failing that, the OS family = os.name, but only up to first space:\n  # Sample OS family LAF:\n  #jmeter.laf.windows=javax.swing.plaf.metal.MetalLookAndFeel\n\n  # Failing that:\n  # default LAF\n  jmeter.laf=javax.swing.plaf.metal.MetalLookAndFeel\n\n  # Failing that, JMeter uses the CrossPlatform LAF.\n\n  # Mac apparently looks better with the System LAF\n  jmeter.laf.mac=System\n\nwith this:\n  # Use System LAF on all platforms\n  jmeter.laf=System\n\nand then add possible workaround for obscure platforms (though according to http://download.oracle.com/javase/tutorial/uiswing/lookandfeel/plaf.html there are not many platforms where this would apply)"}, {"count": 1, "tags": [], "bug_id": 52026, "attachment_id": null, "id": 150558, "creation_time": "2011-10-14T11:41:21Z", "time": "2011-10-14T11:41:21Z", "creator": "sebb@apache.org", "text": "What OS do you use? (what is the content of os.name?)\n\nIt's easy enough to change the jmeter.properties locally.", "is_private": false}, {"count": 2, "tags": [], "creator": "immanuel.hayden@gmail.com", "attachment_id": null, "id": 150563, "time": "2011-10-14T12:38:04Z", "bug_id": 52026, "creation_time": "2011-10-14T12:38:04Z", "is_private": false, "text": "I currently use Windows XP and Windows 7, but the issue should also exist on (GTK-based) linux systems.\n\nMy point is: The Metal LaF that is currently default for all platforms but Mac is:\n1) really ugly (and not only ugly as in \"does not match the rest of the OS theme\")\n2) does not use the default open/save dialogue of the OS.\n\nI know that these two points also annoy all my colleagues who use JMeter, so this is not only an issue for me. This leads me to two observations:\n\n1) Most probably everybody wants to use the System LaF.\n2) Most use \"Options\" -> \"Look and Feel\" every time they start JMeter until I point out the config-setting to them.\n3) People are pissed by that (Quote C# dev: \"haha, this proves why java sucks\", and I can't even blame him)\n4) If people encounter a problem with the System LaF (which I haven't found any so far in Windows) they can still add a line to the config file."}, {"count": 3, "attachment_id": 27773, "bug_id": 52026, "text": "Created attachment 27773\nCrossPlatform LAF", "id": 150569, "time": "2011-10-14T13:27:18Z", "creator": "sebb@apache.org", "creation_time": "2011-10-14T13:27:18Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "sebb@apache.org", "text": "Created attachment 27774\nSystem LAF", "id": 150570, "time": "2011-10-14T13:27:41Z", "bug_id": 52026, "creation_time": "2011-10-14T13:27:41Z", "is_private": false, "attachment_id": 27774}, {"count": 5, "tags": [], "bug_id": 52026, "is_private": false, "id": 150571, "creation_time": "2011-10-14T13:29:59Z", "time": "2011-10-14T13:29:59Z", "creator": "sebb@apache.org", "text": "On my system (Windows XP), the CrossPlatform/Metal LAF looks much better.\n\nThe System LAF is ugly.\n\nSee the attachments which I created using Shift+Control+G", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 52026, "attachment_id": 27775, "text": "Created attachment 27775\nLaF comparisons\n\nDunno, don't like the Metal look (esp. the buttons) ... anyhow, my greatest problem is the Feel part anyhow, as any app you style in Metal does not feel like being part of the rest of the system (and that is meant in a _very_ negative way).\n\nSo to come to a description of the image: \n#1 First of all the fonts are different which really annoys me as the Metal font is not nice to look at at all. Second the menu has a different layout (no dedicated space for symbols on the right).\n\n#2 shows the different open file dialogues, again of a random Win7 app (paint, i think), then the Metal one which has seriously limited functionality (no favourites on the left, no breadcrumb urls, generally different than the open file dialogues any other app uses which makes it hard to use), third the one that is shown when you activate the System LaF, which is the \"legacy\" XP-Style open dialogue (though no big deal, as many apps still use that).\n\n<rant>Anyhow, the whole Point of LaF is that you can get a native look on all platforms with minimal work, so defaulting to \"Metal\" (or any other look) on all platforms is like building a supercomputer farm to print out \"hello world\"</rant>", "id": 150578, "time": "2011-10-14T16:04:07Z", "creator": "immanuel.hayden@gmail.com", "creation_time": "2011-10-14T16:04:07Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 52026, "attachment_id": null, "is_private": false, "id": 150580, "time": "2011-10-14T17:23:37Z", "creator": "sebb@apache.org", "creation_time": "2011-10-14T17:23:37Z", "text": "(In reply to comment #6)\n> Dunno, don't like the Metal look (esp. the buttons) ... anyhow, my greatest\n\nUnfortunately the screenshots you provided for the open dialogs are all out of focus, so it's not clear how the buttons compare.\n\n> problem is the Feel part anyhow, as any app you style in Metal does not feel\n> like being part of the rest of the system (and that is meant in a _very_\n> negative way).\n\nAll I can say is that the System LAF looks terrible on my WinXP system; ugly fonts and harsh shadows.\n\nThe difference between your screen shots is minimal compared with the difference between mine - have a look.\n\nAlso, note that only the CrossPlatform/Metal LAF appears to honour the short-cut underlines.\n\n> So to come to a description of the image: \n> #1 First of all the fonts are different which really annoys me as the Metal\n> font is not nice to look at at all. Second the menu has a different layout (no\n> dedicated space for symbols on the right).\n\nHuh? I can see menu symbols in your comparison.png\n\n> #2 shows the different open file dialogues, again of a random Win7 app (paint,\n> i think), then the Metal one which has seriously limited functionality (no\n> favourites on the left, no breadcrumb urls, generally different than the open\n> file dialogues any other app uses which makes it hard to use), third the one\n> that is shown when you activate the System LaF, which is the \"legacy\" XP-Style\n> open dialogue (though no big deal, as many apps still use that).\n\nAgreed, the open files dialogue on CrossPlatform is somewhat simpler, but it is still quite usable.\n\n> <rant>Anyhow, the whole Point of LaF is that you can get a native look on all\n> platforms with minimal work, so defaulting to \"Metal\" (or any other look) on\n> all platforms is like building a supercomputer farm to print out \"hello\n> world\"</rant>\n\nAccording to the Oracle docs, Metal is equivalent to CrossPlatform.\nThe properties file should probably say so."}, {"count": 8, "tags": [], "creator": "immanuel.hayden@gmail.com", "text": "(In reply to comment #7)\n> All I can say is that the System LAF looks terrible on my WinXP system; ugly\n> fonts and harsh shadows.\nSrsly, why do you use XP then? That's how the native UI buttons look also in other apps.\n> Also, note that only the CrossPlatform/Metal LAF appears to honour the\n> short-cut underlines.\nThat's intended behaviour. They show up (as in all other native programs) only when pressing the alt-key.\n> > #1 First of all the fonts are different which really annoys me as the Metal\n> > font is not nice to look at at all. Second the menu has a different layout (no\n> > dedicated space for symbols on the right).\n> \n> Huh? I can see menu symbols in your comparison.png\nSorry, my bad, I meant to the left (in the middle image) compared to the windows standard menus.\n> Agreed, the open files dialogue on CrossPlatform is somewhat simpler, but it is\n> still quite usable.\nSorry, but i have to object. I use JMeter at work for testing a REST-API and we have a huge amount of test files. Thus i set up the favorites to point to the root location of our TC-Directory as jmeter does not remember the last location between restarts (but that's another story). No to mention that you have to get used to yet another file open dialogue which is quite annoying, too.\n> According to the Oracle docs, Metal is equivalent to CrossPlatform.\n> The properties file should probably say so.\nyeah, but metal should be the fallback when everything else fails, not the first choice (at least that's the way I see it).", "id": 150581, "time": "2011-10-14T17:41:35Z", "bug_id": 52026, "creation_time": "2011-10-14T17:41:35Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 52026, "attachment_id": null, "is_private": false, "id": 150585, "time": "2011-10-14T19:10:25Z", "creator": "sebb@apache.org", "creation_time": "2011-10-14T19:10:25Z", "text": "(In reply to comment #8)\n> > Also, note that only the CrossPlatform/Metal LAF appears to honour the\n> > short-cut underlines.\n> That's intended behaviour. They show up (as in all other native programs) only\n> when pressing the alt-key.\n\nOK, did not know that.\n\n> > Agreed, the open files dialogue on CrossPlatform is somewhat simpler, but it is\n> > still quite usable.\n> Sorry, but i have to object. I use JMeter at work for testing a REST-API and we\n> have a huge amount of test files. Thus i set up the favorites to point to the\n> root location of our TC-Directory as jmeter does not remember the last location between restarts (but that's another story). \n\nPlease file a Bugzilla enhancement request with details.\n\n> > According to the Oracle docs, Metal is equivalent to CrossPlatform.\n> > The properties file should probably say so.\n\nIt does now.\n\n> yeah, but metal should be the fallback when everything else fails, not the\n> first choice (at least that's the way I see it).\n\nThe fallback is CrossPlatform == Metal\n\nIf changing the default did not have such a bad effect on Windows XP, it might be worth changing the default.\n\nHowever, it's trivial for you to change the default.\n\nI've not yet had a chance to test it on Windows 7, but if that behaves OK, it would be possible to change the Windows default but keep the current behaviour on XP."}, {"count": 10, "tags": [], "bug_id": 52026, "attachment_id": 27780, "is_private": false, "id": 150593, "time": "2011-10-14T21:25:09Z", "creator": "sebb@apache.org", "creation_time": "2011-10-14T21:25:09Z", "text": "Created attachment 27780\nSystem LAF on Ubuntu"}, {"count": 11, "tags": [], "creator": "sebb@apache.org", "text": "Created attachment 27781\nCrossPlatform LAF on Ubuntu", "id": 150594, "time": "2011-10-14T21:25:42Z", "bug_id": 52026, "creation_time": "2011-10-14T21:25:42Z", "is_private": false, "attachment_id": 27781}, {"count": 12, "tags": [], "bug_id": 52026, "is_private": false, "id": 150595, "creation_time": "2011-10-14T21:34:22Z", "time": "2011-10-14T21:34:22Z", "creator": "sebb@apache.org", "text": "I've just tried System and CrossPlatfor LAF on Ubuntu.\n\nSystem is worse than CrossPlatform, for two reasons:\n\n1) the selected item in tree is shown by changing the background of the full row.\nIt's not obvious in the screenshot, but it obscures the element icons.\nWhen the menu dropdown is not present, the orange bar extends across the grey background as well.\n\n2) Disabled menu items are a bit difficult to read in comparison with the CrossPlatform laf.\n\nThe buttons are rounded in System but not in CrossPlatform, but generally the CrossPlatform LAF is clearer than the System LAF.", "attachment_id": null}, {"count": 13, "tags": [], "bug_id": 52026, "is_private": false, "id": 150601, "creation_time": "2011-10-15T08:34:11Z", "time": "2011-10-15T08:34:11Z", "creator": "immanuel.hayden@gmail.com", "text": "Created attachment 27783\nFedora System LaF\n\nThanks for the effort you put into this :) You are right regarding the Ubuntu theme, it really makes it hard to discern between enabled and disabled menu items [1]. The screenshot shows the situation in Fedora 15 which uses a sane theme. Sadly I'm pretty sure it's not easy/feasible to sniff that out :/\n\n\n[1]  though this is a general problem with ubuntu's theme used, they really screwed that up for many apps.", "attachment_id": 27783}, {"count": 14, "attachment_id": 27785, "bug_id": 52026, "is_private": false, "id": 150604, "time": "2011-10-15T10:04:21Z", "creator": "sebb@apache.org", "creation_time": "2011-10-15T10:04:21Z", "tags": [], "text": "Created attachment 27785\nUbuntu CrossPlatform test plan showing selected element"}, {"count": 15, "tags": [], "creator": "sebb@apache.org", "text": "Created attachment 27786\nUbuntu System Test Plan showing selected element", "id": 150605, "time": "2011-10-15T10:04:40Z", "bug_id": 52026, "creation_time": "2011-10-15T10:04:40Z", "is_private": false, "attachment_id": 27786}, {"count": 16, "tags": [], "bug_id": 52026, "attachment_id": null, "is_private": false, "id": 150606, "time": "2011-10-15T10:16:11Z", "creator": "sebb@apache.org", "creation_time": "2011-10-15T10:16:11Z", "text": "(In reply to comment #15)\n> Created attachment 27786 [details]\n> Ubuntu System Test Plan showing selected element\n\nNote how the background to the selected element obscures the icon.\nIt's not as neat as the CrossPlatform version.\n\nI think the same applies to the Fedora GTK LAF, judging by the partially obscured test plan."}, {"count": 17, "tags": [], "creator": "immanuel.hayden@gmail.com", "attachment_id": null, "text": "Ok, i see your concern, so I'll mark this as invalid. I guess the optimum would be if JMeter remembered what LaF I chose through the Options menu in some sort of config, so people won't have to edit the properties-file manually (separate config-file because it is easy to overwrite the properties when unziping a new version over an old one ;)).\n\nShould I make a new Bug for that or is there one already?", "id": 150608, "time": "2011-10-15T11:41:54Z", "bug_id": 52026, "creation_time": "2011-10-15T11:41:54Z", "is_private": false}, {"count": 18, "attachment_id": null, "bug_id": 52026, "is_private": false, "id": 150612, "time": "2011-10-15T12:26:45Z", "creator": "sebb@apache.org", "creation_time": "2011-10-15T12:26:45Z", "tags": [], "text": "(In reply to comment #17)\n> I guess the optimum would\n> be if JMeter remembered what LaF I chose through the Options menu in some sort\n> of config, so people won't have to edit the properties-file manually (separate\n> config-file because it is easy to overwrite the properties when unziping a new\n> version over an old one ;)).\n> \n> Should I make a new Bug for that or is there one already?\n\nNew bug; I don't recall there being an enhancement request.\n\nJMeter can use the Preferences class (as it does for recent file names)."}, {"count": 19, "tags": [], "creator": "immanuel.hayden@gmail.com", "text": "Ok, done, created #52037 (but I guess you got the mail already ;)). Great collaboration, thanks *thumbs up*", "id": 150615, "time": "2011-10-15T12:55:49Z", "bug_id": 52026, "creation_time": "2011-10-15T12:55:49Z", "is_private": false, "attachment_id": null}]