[{"count": 0, "tags": [], "text": "When doing a propfind on directories with many files (e.g. 100000), mod_dav consumes multiple GB of memory. The cause is that for each file, the prop_db gets opened and closed, but closing the propdb does not free any memory. There is a source code comment:\n\n    /* Currently, mod_dav's pool usage doesn't allow clearing this pool. */\n#if 0\n    apr_pool_destroy(propdb->p);\n#endif\n\nEven with the pool_destroy in place, the dav_propdb structure itself would not get destroyed, as it is not allocated from the pool.\nThe original commit that added this pool was talking about 'lifetime issues'. Are they resolved yet?\nOr, on the other hand, would it be possible to open the propdb only once for the propfind request?", "attachment_id": null, "bug_id": 52123, "id": 151130, "time": "2011-11-02T13:07:43Z", "creator": "arne@die-jansens.de", "creation_time": "2011-11-02T13:07:43Z", "is_private": false}, {"count": 1, "tags": [], "text": "IMHO the lifetime issues are not fixed and fixing them is likely to require a severe rebuild of the pool handling in mod_dav including API changes for the providers.\nAs PROPFIND possibly affects more than one resource and each resource has its own (possibly distinct) propdb it needs to be opened separately for each resource. Possibly fixable by a different design as well (one propdb for all resources).", "is_private": false, "bug_id": 52123, "id": 151180, "time": "2011-11-04T11:36:31Z", "creator": "rpluem@apache.org", "creation_time": "2011-11-04T11:36:31Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Just for info I posted a series of patches to httpd 2.2.21 in bug #48130 that fix these memory consumption problems with mod_dav_fs when a lot of files are put into a single directory. They work well in our product.", "is_private": false, "bug_id": 52123, "id": 153304, "time": "2012-01-30T15:31:04Z", "creator": "Diego.SantaCruz@spinetix.com", "creation_time": "2012-01-30T15:31:04Z", "attachment_id": null}]