[{"count": 0, "tags": [], "creator": "juliancesar@gmail.com", "attachment_id": 27897, "id": 151194, "time": "2011-11-04T14:57:18Z", "bug_id": 52137, "creation_time": "2011-11-04T14:57:18Z", "is_private": false, "text": "Created attachment 27897\nTest Plan\n\nIn revision r1196526 (02-Nov-2011 13:24) we have 3 problems, you can see in test plan attached.\n\n1. When we use the \"Use concurrent pool\" with \"HTTP Cache Manager\" the resources don't cached, this problems discribed here was related too in bug 51752, but for me don't work.\n\n2. When we use the \"HTTP Request Default\" and check \"Use concurrent pool\" we can't change the value, because when I \"Clean All\" (Ctrl +E) the value restart to 4, this only happens in the \"HTTP Request Default\" component.\n\n3. Even if the option \"Retrieve all embedded resources\" is enabled, the option \"Use concurrent pool\" is used, I know this because the function \"Retrieve all embedded resources\" only works with the \"Use concurrent pool\" disabled, and the interface (GUI) also show this.\n\nI'm considering that a resource is cached when it comes with the code \"304\" and the message does \"Not Modified\"."}, {"count": 1, "tags": [], "bug_id": 52137, "attachment_id": null, "id": 151199, "time": "2011-11-04T16:42:34Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2011-11-04T16:42:34Z", "is_private": false, "text": "(In reply to comment #0)\n> Created attachment 27897 [details]\n> Test Plan\n> \n> In revision r1196526 (02-Nov-2011 13:24) we have 3 problems, you can see in\n> test plan attached.\n> \n> 1. When we use the \"Use concurrent pool\" with \"HTTP Cache Manager\" the\n> resources don't cached, this problems discribed here was related too in bug\n> 51752, but for me don't work.\n\nThis is a regression of fix to Bug 51919, clone of Sampler cloned CacheManager whith flag useExpires set to false as testIterationStart was not called.\nI made it shared instead of cloned, because in this case Cache should be shared by sons of current thread.\n \n> \n> 2. When we use the \"HTTP Request Default\" and check \"Use concurrent pool\" we\n> can't change the value, because when I \"Clean All\" (Ctrl +E) the value restart\n> to 4, this only happens in the \"HTTP Request Default\" component.\nFixed.\n> \n> 3. Even if the option \"Retrieve all embedded resources\" is enabled, the option\n> \"Use concurrent pool\" is used, I know this because the function \"Retrieve all\n> embedded resources\" only works with the \"Use concurrent pool\" disabled, and the\n> interface (GUI) also show this.\n> \nThis is a feature , see:\nhttp://jakarta.apache.org/jmeter/usermanual/component_reference.html#HTTP_Request_Defaults\n\nNote: radio buttons only have two states - on or off. This makes it impossible to override settings consistently - does off mean off, or does it mean use the current default? JMeter uses the latter (otherwise defaults would not work at all). \n======> So if the button is off, then a later element can set it on, but if the button is on, a later element cannot set it off. \n\n> I'm considering that a resource is cached when it comes with the code \"304\" and\n> the message does \"Not Modified\"."}, {"count": 2, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "text": "Date: Fri Nov  4 16:39:07 2011\nNew Revision: 1197642\n\nURL: http://svn.apache.org/viewvc?rev=1197642&view=rev\nLog:\nBug 52137 - Problems with HTTP Cache Manager\n\nModified:\n   jmeter/trunk/src/protocol/http/org/apache/jmeter/protocol/http/config/gui/HttpDefaultsGui.java\n   jmeter/trunk/src/protocol/http/org/apache/jmeter/protocol/http/sampler/HTTPSamplerBase.java\n   jmeter/trunk/xdocs/changes.xml", "id": 151200, "time": "2011-11-04T16:42:48Z", "bug_id": 52137, "creation_time": "2011-11-04T16:42:48Z", "is_private": false}]