[{"count": 0, "tags": [], "bug_id": 52147, "is_private": false, "text": "We are using JMeter for performance testing of the application developed using Oracle ADF 11g.\n\nIn JMeter, for any request having image (jpg or png) in the response, at the time of playback of the script, proper response with the image is displayed.\nBut, after that request, the response for all subsequent requests are getting failed with error message as \n\"Because of inactivity, your session has timed out and is no longer active. The page will automatically be reloaded in 10 seconds; if not, click here.\"\n\nWe observed that when we disable the request having image, the script is working fine without any issues (all subsequent requests pass successfully).\nSo, the response time observed is without images.\n\nPlease suggest suitable solution or workaround, so that we can keep images enabled and can observe proper response time of the transaction.\n\nWe have already explored multiple options in JMeter to solve this problem, but could not find any satisfactory solution:\n• Changed HEAP values in jmeter.bat file to instruct JVM to use more memory \n• Set maximum Timeouts in HTTP request for connect and response parameters\n• Disabled image size check limit by editing view.results.tree.max_size in jmeter.properties file", "id": 151259, "time": "2011-11-07T10:12:31Z", "creator": "milan.shah16@gmail.com", "creation_time": "2011-11-07T10:12:31Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 52147, "text": "Bugzilla is not a support forum.\n\nPlease subscribe to the JMeter user list and ask there.", "id": 151271, "time": "2011-11-07T16:16:40Z", "creator": "sebb@apache.org", "creation_time": "2011-11-07T16:16:40Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 52147, "text": "*** Bug 48841 has been marked as a duplicate of this bug. ***", "id": 162524, "time": "2012-10-02T20:39:42Z", "creator": "wrowe@apache.org", "creation_time": "2012-10-02T20:39:42Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 52147, "is_private": false, "text": "(In reply to comment #2)\n> *** Bug 48841 has been marked as a duplicate of this bug. ***\n\nWrong bug; 48841 duplicates 51247, not 52417 (this bug).", "id": 162529, "time": "2012-10-02T22:43:04Z", "creator": "sebb@apache.org", "creation_time": "2012-10-02T22:43:04Z", "attachment_id": null}]