[{"count": 0, "tags": [], "bug_id": 5217, "attachment_id": null, "text": "I am trying to get the JProbe tasks working on Solaris 8 with JProbe 3.0.1.  \n\nI ran into two major problems:\n\n1. Apparently the JProbe installation directory structure differs in that the \ndirectory names are all lowercase (on Windows they are title case).\n2. The jpcovreport caused null pointer exceptions deep in the guts of Xalan.\n\nI tracked down problem (2) above to an apparent platform difference in the \ncompiler (odd since I was using the same JDK on Windows and Solaris).  On \nWindows the compilers add an attribute to the class files they generate \nindicating the name of the source file.  On Solaris, this attribute is not \npresent.\n\nI am attaching a patch to this defect report that fixes the above problems, and \ncleans up some file access a little.\n\nWith this patch, the sitraka tasks all work on Solaris, but it is very slow \n(about 25 time normal execution time).  Still working with Sitraka to figure \nthat out.", "id": 8476, "time": "2001-11-30T14:50:01Z", "creator": "garrick.olson@aceva.com", "creation_time": "2001-11-30T14:50:01Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 854\nPatch to make the Sitraka JProbe tasks work on Solaris", "attachment_id": 854, "id": 8477, "creator": "garrick.olson@aceva.com", "time": "2001-11-30T14:53:52Z", "bug_id": 5217, "creation_time": "2001-11-30T14:53:52Z", "is_private": false}, {"count": 2, "tags": [], "creator": "sbailliez@apache.org", "attachment_id": null, "text": "Fixed in HEAD.\nAbout Xalan what is the problem ? What version are you using ?\n\nI'm wondering if it is not a systemid problem. The current way to build the \nsystemid in the code is not correct on Unix (in Sitraka tasks), but not doing \nit this way caused version previous to 2.2D9 to fail miserably. The code was \nfixed in Xalan for D9 (there was inconsistencies and URI specs are far from \nbeing crystal clear but now there is some legacy code here and there)\n\nFor more info see http://marc.theaimsgroup.com/?l=xalan-dev&m=99730890710885&w=2\n\nFor now I set this bug to fixed. Thanks for the patch !\n\n", "id": 8478, "time": "2001-11-30T16:33:46Z", "bug_id": 5217, "creation_time": "2001-11-30T16:33:46Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 5217, "is_private": false, "text": "\nI am using Xalan 2.1.0.  It throws a null pointer exception when you call \nElement.setAttribute(\"blah\", null) and then transform the document to XML \n(which the jpcovreport task did when the source file attribute was missing).", "id": 8482, "time": "2001-11-30T17:36:01Z", "creator": "garrick.olson@aceva.com", "creation_time": "2001-11-30T17:36:01Z", "attachment_id": null}]