[{"count": 0, "tags": [], "creator": "fhanik@apache.org", "attachment_id": null, "text": "Invalid cookies are fairly common. Firefox has them all the time. Tomcat logs fill up very quickly with this input. Tomcat doesn't log when there is an invalid HTTP request, as that would yield the same problem.co \n\nNov 14, 2011 3:15:27 PM org.apache.tomcat.util.http.Cookies processCookieHeader\nINFO: Cookies: Invalid cookie. Value not a token or quoted value\n\nhttp://vmc-ssrc-rh56.eng.vmware.com:8080/\n\nGET / HTTP/1.1\nHost: vmc-ssrc-rh56.eng.vmware.com:8080\nUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64; rv:7.0.1) Gecko/20100101 Firefox/7.0.1\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8\nAccept-Language: en-us,en;q=0.5\nAccept-Encoding: gzip, deflate\nAccept-Charset: ISO-8859-1,utf-8;q=0.7,*;q=0.7\nConnection: keep-alive\nCookie: __utma=106857756.14479066.1321292743.1321296794.1321304211.3; __utmz=106857756.1321304211.3.2.utmcsr=communities.example.com|utmccn=(referral)|utmcmd=referral|utmcct=/community/vmtn/appplatform/testapp_fire; s_nr=1321293934221; s_vi=[CS]v1|2760A9C4851D0F77-6000010260007567[CE]\nCache-Control: max-age=0", "id": 151492, "time": "2011-11-14T22:26:00Z", "bug_id": 52184, "creation_time": "2011-11-14T22:26:00Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 52184, "attachment_id": null, "id": 151567, "time": "2011-11-16T18:29:26Z", "creator": "markt@apache.org", "creation_time": "2011-11-16T18:29:26Z", "is_private": false, "text": "I'm against this change.\n\nDropping a cookie needs to logged by default. If an application is generating a lot of invalid cookies then the log level can always be increased to WARN for that logger.\n\nArguably the log level for dropping a cookie should be WARN anyway. It has already been dropped to INFO due to the frequency that it is observed and to allow the messages to be filtered out by setting the log level to WARN."}, {"count": 2, "tags": [], "creator": "fhanik@apache.org", "attachment_id": null, "text": "I'd keep this open. As asking user to change their log level to avoid filling up their disks for invalid HTTP cookies is pretty much asking every admin to by default change the log level for a logger they've never heard of to avoid a DoS attack.\n\nIt's pretty much common sense. It's not an error in Tomcat, it's an invalid cookie. The logging of it, who does it benefit, the one admin that is looking for it, or the thousand admins getting invalid cookies?", "id": 151628, "time": "2011-11-18T17:16:46Z", "bug_id": 52184, "creation_time": "2011-11-18T17:16:46Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "markt@apache.org", "text": "Changing the default log level to DEBUG is going to cause problems for system admins trying to work out why their app isn't working. Silently dropping invalid input data is not a good idea. There needs to be a warning somewhere.\n\nAn approach we have used elsewhere is to log the first instance of the problem at one level and subsequent instances at a lower level. It is a good idea to include in the first log message that further instances of the problem will be logged at a lower (disabled by default) log level. This addresses my concern that something needs to be logged and your DOS concern.", "count": 3, "id": 151643, "time": "2011-11-18T23:45:14Z", "bug_id": 52184, "creation_time": "2011-11-18T23:45:14Z", "is_private": false}, {"count": 4, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "Tomcat should be friendly both to developers and to those using it in production. \nIts default configuration is more developer-friendly, in many places.\n\n\nI think many admins do not look at INFO messages at all. So it seems reasonable to expect that the default log level in production would be set to WARNING.\n\nFrom developer's point of view I am against dropping severity level of this message.\n\n\n> It is a good idea to include in the first log message that further\n> instances of the problem will be logged at a lower (disabled by default)\n> log level.\n\nIn this case the first and subsequent messages are likely to come from different requests. I think it is better to have some time-based threshold strategy.\n\nI wonder whether it can be dealt at the logging library level. Otherwise it would be nice to have some helper class to deal with such logging issues. (+system property to configure the threshold?)\nThis issue is wider, because this place is not the only one that produces \"useless\" INFO messages.", "id": 151654, "time": "2011-11-19T05:45:33Z", "bug_id": 52184, "creation_time": "2011-11-19T05:45:33Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 52184, "text": "The httpd project is currently demoting all errors generated for client \ndiagnostic activity to a level lower-than [warn].  The appropriate 4xx\ncode is already being sent to the client, so the administrator or the\nweb author is free to enable various debugging aids if the reason for\nthat 4xx result is desired.  But for 99.9995% of the lifespan of that\nrunning server, nobody is interested in why the client is sending a bad\nURI, etc.  Most of these are not users, but friendly or malicious probes.", "id": 151658, "time": "2011-11-20T03:59:56Z", "creator": "wrowe@apache.org", "creation_time": "2011-11-20T03:59:56Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "text": "I have implemented a solution for this that we can expand to other areas as required. The solution will be included in 7.0.24 onwards.", "attachment_id": null, "id": 152075, "creation_time": "2011-12-08T20:44:10Z", "time": "2011-12-08T20:44:10Z", "creator": "markt@apache.org", "bug_id": 52184, "is_private": false}, {"count": 7, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "REOPENing.\n\nThe new o.a.juli.logging.UserDataHelper class is missing from extras/tomcat-juli.jar.\nConsequently Tomcat fails fatally if you try to use the alternative tomcat-juli.jar from extras.\n\n\nThe DirectJDKLog class is also missing from extras. Apparently the changes applied to it have to be ported to commons-logging *.logging.impl.Jdk14Logger class. It is not fatal though and concerns only the accuracy of log messages.\n(In practice I think it is not a big concern, because the extras tomcat-juli jar is usually used to route logging to log4j. In that case the accuracy of java.util logging is irrelevant).", "id": 152086, "time": "2011-12-09T02:22:28Z", "bug_id": 52184, "creation_time": "2011-12-09T02:22:28Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 52184, "text": "Thanks for the catch. This should be fixed in trunk and 7.0.x now.", "id": 152133, "time": "2011-12-12T22:20:15Z", "creator": "markt@apache.org", "creation_time": "2011-12-12T22:20:15Z", "is_private": false, "attachment_id": null}]