[{"count": 0, "tags": [], "bug_id": 52191, "text": "The ISAPI Redirector creates a shared memory file unique to the server instance (a combination of server name, service instance id and application pool id) that it uses to share information between the redirector DLL instances in each process making up the server.\n\nWhen multiple ISAPI Redirectors are installed on a single website, this name is no longer unique for a logical ISAPI Redirector configuration, and corruption (or at least incorrect use due to size miscalculations) of the shared memory results.\n\nThe shared memory file name needs to have an additional component added to refine this scope further. Options are:\n1. use the extension_uri configuration option - this should be distinct (and consistent?) for a logical configuration\n2. provide a new configuration option to specify a unique filename component\n\n#1 is the preferred option (as it doesn't involve the user discovering this issue and finding out how to fix it).", "id": 151536, "time": "2011-11-16T02:20:33Z", "creator": "timw@apache.org", "creation_time": "2011-11-16T02:20:33Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "timw@apache.org", "attachment_id": 27960, "is_private": false, "id": 151569, "time": "2011-11-16T21:11:54Z", "bug_id": 52191, "creation_time": "2011-11-16T21:11:54Z", "text": "Created attachment 27960\nMake shm filename unique based on extension_uri\n\nAttached a patch for option 1, using the extension_uri to unique the filename."}, {"count": 2, "tags": [], "creator": "mturk@apache.org", "attachment_id": null, "text": "Have you checked the latest trunk.\nI added shmemName now has APP_POOL_ID which should allow more unique name.\n\nAlso could you explain the purpose of having multiple ISAPI redirectors's installed. I mean you can't do that for any of the integral IIS extensions/filters (or you can do that for FastCGI for example?)\n\nI tend to actually make a logic that would explicitly detect and forbid such cases instead allowing them. Redirector should be loaded once per IIS instance. We use so many static variables since design presumes we are loaded once per process.", "id": 151583, "time": "2011-11-17T07:34:49Z", "bug_id": 52191, "creation_time": "2011-11-17T07:34:49Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 52191, "attachment_id": null, "is_private": false, "id": 151615, "time": "2011-11-17T23:56:32Z", "creator": "timw@apache.org", "creation_time": "2011-11-17T23:56:32Z", "text": "> Also could you explain the purpose of having multiple ISAPI redirectors's\ninstalled.\n\nDéjà vu:) From 2005: https://issues.apache.org/bugzilla/show_bug.cgi?id=35298#c2\nI've had second thoughts about that approach since then - maybe in 1.3 we can look at modularising the configuration ala Apache conf.d directories rather than adding multiple instances, but it's a long standing feature now...\n\n> We use so many static variables since design presumes we are loaded once per\nprocess\n\nIIS seems to cope fine with loading multiple instances of the same redirector DLL into the same process. This can be seen if you configure multiple copies (separate files on disk) of the ISAPI Redirector DLL as ISAPI Filters on a site, and then inspect inetinfo.exe with something like the Sysinternals Process Explorer (DLL view).\nYou can also see it in the debug logs, where the values of the TOMCAT* headers are uniqued with the DLL handle (in DllMain).\n\nI think the extension URI is the way to go on this one at the moment - within a site, it will uniquely identify the ISAPI Redirector configuration, and we already have enough uniqueness in the filename to cover the server/site/app pool combination.\n\n\n> I added shmemName now has APP_POOL_ID which should allow more unique name.\nYeah, I noticed that.\n\nOT: I'm not sure whether that adds any uniqueness - in my (Windows 2003/IIS 6) server, you can only assign a Web Site to an Application Pool (not individual filters etc.), so the application pool name doesn't seem to add anything to the site/instance ID? i.e. since a filter is defined on the web site, and a web site can only be in one application pool, then the site/instance ID uniquely identifies the process that filter can live in?\nI haven't been brave enough to see what happens if the site application pool is not the same as the extension virtual directory application pool in worker process isolation mode. I expect it will get confused."}, {"count": 4, "tags": [], "bug_id": 52191, "attachment_id": null, "id": 151616, "time": "2011-11-18T06:41:57Z", "creator": "mturk@apache.org", "creation_time": "2011-11-18T06:41:57Z", "is_private": false, "text": "OK. Committed the patch with minor change."}]