[{"count": 0, "tags": [], "creator": "gerard.dougan@gmail.com", "is_private": false, "text": "Created attachment 27957\nsource files\n\nAdd the ability to specify a HTTP mock server, providing canned responses to predefined request types.\nAdd the ability to provide assertions predicated on a HTTP callback e.g. in the case where the system being tested should send the caller a delivery receipt.\n\nAttached is a full eclipse project zip containing all source files for the aforementioned features.  The source depends on the Java 6 com.sun.net.httpserver package as the method for exposing mock server and callback facilities.\n\nThe project also contains a MockServerSample.jmx file which illustrates usage of the mock server component.\n\nThanks\nGerard", "id": 151561, "time": "2011-11-16T15:34:23Z", "bug_id": 52199, "creation_time": "2011-11-16T15:34:23Z", "attachment_id": 27957}, {"count": 1, "tags": [], "text": "The code uses com.sun.net.httpserver.HttpServer which appears to require Java 1.6.\nIt also (presumably) requires the use of a Sun/Oracle JVM.\n\nAt present JMeter still targets Java 1.5, and is targetted at all compliant JVMs, not just Sun/Oracle.\n\nSorry, but at present it appears that the code cannot be included in JMeter.\n\n==\n\nAlso, there are some @author tags in the source code.\nThese are generally not used in ASF code.\nThis is partly because ASF code is written by the community, and partly because the tag quickly becomes meaningless when the code is updated.\n\nWe would need your permission to remove these before committing - assuming that the other issues can be solved.", "attachment_id": null, "id": 151566, "creator": "sebb@apache.org", "time": "2011-11-16T18:03:24Z", "bug_id": 52199, "creation_time": "2011-11-16T18:03:24Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 52199, "text": "Feel free to remove the @author tags. \n\nOn the http server piece, that was my bad in not checking the vm compliance of jmeter. I try to never use com.sun classes and only did so in this case as it was the path of least resistance for the project that required the features. \n\nI can have a look at refactoring that code to use the same server mechanism as the mirror server if needs be. \n\nI appreciate your patience (this is my first addition to an apache project)", "id": 151568, "time": "2011-11-16T18:39:40Z", "creator": "gerard.dougan@gmail.com", "creation_time": "2011-11-16T18:39:40Z", "tags": [], "is_private": false}]