[{"attachment_id": 27978, "tags": [], "creator": "bimargulies@gmail.com", "is_private": false, "count": 0, "id": 151744, "time": "2011-11-23T21:21:24Z", "bug_id": 52236, "creation_time": "2011-11-23T21:21:24Z", "text": "Created attachment 27978\nsome code to look at.\n\nThe attached code allows tomcat to merge in one or more partial webapps to build up the definitive webapp.\n\nI wrote this code to support a particular development/debugging methodology.\n\nI have a launcher program that uses the embedded API to launch tomcat with a webapp with the static materials sitting where they sit in my dev tree, and the classpath for the webapp taking the classes where eclipse writes them as well.\n\nThe result is live debugging. I wanted to extend this to the case where some of my static content was merged in from 'overlays' in the maven-war-plugin sense of the term, and I came up with the attached.\n\nYou may think it's nuts. You may think that it points up some modularity issues around the context classses; there are an awful lot of tests for instanceof and casts in this neighborhood.\n\nIf you have some sympathy for this idea, I would be willing to refine it and/or work on an associated patch to change the modularity around DirContext/BaseDirContext/StandardContext to make it less ugly to create."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "Personally, I am of the view that this is a build time problem rather than one that should be solved at runtime.\n\nHowever, Oracle does not agree with me and it looks like something along these lines will be required as part of the next version of the servlet spec. Until the requirements are firmed up it is hard to know what the best implementation approach will be. My preference will be for the simplest code that does the least possible amount of work \"on the fly\".", "id": 151745, "time": "2011-11-23T21:44:48Z", "bug_id": 52236, "creation_time": "2011-11-23T21:44:48Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 52236, "is_private": false, "text": "My experience is that I can get work done on webapps much, much, faster if I operate in a mode where modified files are directly read by the web server. If I have to run a build every time I want to see the results of a change, I'm sad.\n\nAs far as build-time goes, that's all covered by the maven-war-plugin.\n\nFurther, you might call this just an alternative to the setResourceJar feature that accepts multiple webapp-shaped dirs instead of one META-INF/resources.\n\nHowever, I don't expect you all to buy a bridge from me.\n\nSlightly tangentially, do you have any sympathy for my view that something like this could easier with some sort of refactoring of the Context class family? I feel somewhat presumptuous. It seems like I shouldn't have had to create a wierd subclass of FileDirContext in addition to a subclass of StandardContext -- Or maybe I should just done the MultiDirContext and passed that into setResources of an ordinary StandardContext?", "id": 151748, "time": "2011-11-23T21:54:21Z", "creator": "bimargulies@gmail.com", "creation_time": "2011-11-23T21:54:21Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 52236, "attachment_id": null, "id": 151752, "time": "2011-11-23T22:07:25Z", "creator": "markt@apache.org", "creation_time": "2011-11-23T22:07:25Z", "is_private": false, "text": "I'm a big fan of re-factoring. One of the things on my todo for Tomcat 8 is to at least look at removing all the JNDI stuff from DirContext JNDI stuff and simplify all that code.\n\nAnything that cleans-up and/or simplifies the code is welcome.\n\n7.0.x is probably beyond the point where we want to make bug changes but we have free reign in trunk.\n\nAliases are along a similar line to overlays (for static content). It may be worth extending aliases / combining your ideas with the current code (he says without having had a chance to look at your patch)."}, {"attachment_id": null, "tags": [], "bug_id": 52236, "is_private": false, "count": 4, "id": 151753, "time": "2011-11-23T22:08:59Z", "creator": "bimargulies@gmail.com", "creation_time": "2011-11-23T22:08:59Z", "text": "Aliases, if I have it right, say 'substitute in a tree of static content *here*'. The patch says, 'first look in this webapp-shaped directory, then the next, then the next, then finally the 'real' one. \n\nI'll have a look at trunk refactoring."}, {"count": 5, "text": "I have been working on bug 51741 for some time now and will commit something in a couple of days. I think it will be useful to you.", "bug_id": 52236, "attachment_id": null, "id": 151775, "time": "2011-11-24T21:56:45Z", "creator": "slaurent@apache.org", "creation_time": "2011-11-24T21:56:45Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "creator": "markt@apache.org", "is_private": false, "count": 6, "id": 165122, "time": "2013-02-07T14:50:03Z", "bug_id": 52236, "creation_time": "2013-02-07T14:50:03Z", "text": "This was implemented in Tomcat 8 as part of the resources refactoring."}]