[{"count": 0, "tags": [], "bug_id": 52257, "attachment_id": 27994, "id": 151834, "time": "2011-11-28T17:07:31Z", "creator": "med1985@gmail.com", "creation_time": "2011-11-28T17:07:31Z", "is_private": false, "text": "Created attachment 27994\npatch adding event listener to fonts package\n\nHi All,\n\nThe purpose of this patch was to add an event to handle the case of when the Unicode cmap table is missing from a TrueType font. Previously a the message went to the logger.\n\nHowever, in so doing, it forces a dependency on o.a.f.events* and o.a.f.util.DefaultErrorListener in the fop-transcoder.jar (and obviously fop-transcoder-allinone.jar). Adding these dependencies to the transcoder package is easily done, though the ramifications are less obvious to me. I have no experience using the transcoder and I just wanted to make sure everyone was happy with this and there aren't any issues that I'm missing.\n\nThanks for your help\n\nMehdi"}, {"count": 1, "tags": [], "creator": "vhennebert@gmail.com", "attachment_id": null, "text": "IIC those transcoder jars are used by Batik to convert standalone SVG files into PDF. I suppose there's no harm in adding those dependencies to the jars, although it would need to be figured out how events are being processed (output on the command line? Logged? Just swallowed (which would be bad)?).\n\nHowever, there are changes in the patch that are almost certainly problematic:\n• a new DefaultEventBroadcaster instance is being created in the following classes:\n  o/a/f/render/intermediate/IFUtil.java\n  o/a/f/render/ps/NativeTextHandler.java\n  o/a/f/svg/PDFGraphics2D.java\n  o/a/f/pdf/PDFFactory.java\n  The consequence is that at runtime it will be likely that several EventBroadcaster instances will exist in the same time and be handled inconsistently. For example, only the events from one instance may be caught and displayed in some dialog box.\n• the message added to the new fontNotSupported event will not be localizable, which defeats one of the purposes of the Event handling sub-system. It's probably best to create a more specific event.\n\nVincent", "id": 151842, "time": "2011-11-28T18:31:54Z", "bug_id": 52257, "creation_time": "2011-11-28T18:31:54Z", "is_private": false}, {"count": 2, "attachment_id": 27998, "creator": "med1985@gmail.com", "is_private": false, "id": 151859, "time": "2011-11-29T13:22:19Z", "bug_id": 52257, "creation_time": "2011-11-29T13:22:19Z", "tags": [], "text": "Created attachment 27998\nfont events part deux\n\nHow would you suggest the event-broadcaster be injected in? Consider the following:\n- In o.a.f.render.ps.NativeTextHandler, the only way a DefaultEventBroadcaster is used is if the FontInfo object, given in the constructor is null. The only time the constructor is called is in the o.a.f.render.ps.AbstractPsTranscoder, how would you get the event broadcaster when it isn't given?\n\n- in o.a.f.render.intermediate.IFUtil, the DefaultEventBroadcaster is used only if the FontInfo object is null. Again, how would you inject the broadcaster when one isn't given? Or should I remove the null check and risk an NPE?\n\n- same applies to o.a.f.svg.PDFDocumentGraphics2D, risk NPE?\n\n- o.a.f.pdf.PDFFactory, this can be piped in a bit further. This has been amended.\n\nAs for the error message, I disagree with your interpretation. The most important message to convey to the user is that the font isn't supported, we can't very well create a different message for every situation that a font isn't supported. The error here isn't in the font, it's that FOP doesn't currently support the font for whatever reason. As such I've left the error message as is."}, {"count": 3, "tags": [], "creator": "med1985@gmail.com", "attachment_id": 28000, "is_private": false, "id": 151863, "time": "2011-11-29T14:56:27Z", "bug_id": 52257, "creation_time": "2011-11-29T14:56:27Z", "text": "Created attachment 28000\nfont events\n\nChanged \"fontNotSupported\" event to \"unicodeCmapNotFound\""}, {"count": 4, "attachment_id": null, "bug_id": 52257, "text": "So I looked into what what the transcoder behaviour is like, the event is swallowed i.e. nothing is output to the command line. However, because this throws an exception (my change does not change the exception being thrown), the following is thrown (in the case of Arial):\n\nException in thread \"main\" java.lang.RuntimeException: TrueType font is not supported: file:///usr/share/fonts/truetype/msttcorefonts/Arial.ttf", "id": 151875, "time": "2011-11-30T14:23:35Z", "creator": "med1985@gmail.com", "creation_time": "2011-11-30T14:23:35Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 52257, "is_private": false, "text": "I had a quick look at the code and think the creation of a new DefaultEventBroadcaster instance can be avoided in most places: \n• In TTFReader and TTFFile it’s not necessary, a dedicated FontEventListener that logs events on the standard output would do.\n• In IFUtil: the setupFonts(IFDocumentHandler) method should be removed and restriction added that the fontInfo be not null. I don’t think that this class is an appropriate place to create new FontInfo instances. Anyway, most callers of this method probably already pass a non-null instance of FontInfo.\n• In NativeTextHandler, the only class that calls the constructor passes a non-null FontInfo instance, so the setupFontInfo method can be removed.\n• PDFDocumentGraphics2D and PDFDocumentGraphics2DConfigurator: those classes are only used by the transcoder IIC. An appropriate FontEventListener implementation should be used instead of a FontEventAdapter\n• In PDFGraphics2D.createPattern: this one is less clear. I’m not sure why a new FontInfo instance is being created while one is already available as a member. This would need to be further investigated, but it doesn’t seem that custom fonts are being configured, only the base 14 ones. So the FontEventListener can be a dedicated implementation that throws an AssertionError whenever an event occurs.\n\nVincent", "id": 151876, "time": "2011-11-30T17:16:55Z", "creator": "vhennebert@gmail.com", "creation_time": "2011-11-30T17:16:55Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 52257, "is_private": false, "text": "resetting P2 open bugs to P3 pending further review", "id": 157458, "time": "2012-04-07T01:43:11Z", "creator": "gadams@apache.org", "creation_time": "2012-04-07T01:43:11Z", "attachment_id": null}, {"count": 7, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "text": "increase priority due to presence of a patch", "id": 157684, "time": "2012-04-08T09:10:54Z", "bug_id": 52257, "creation_time": "2012-04-08T09:10:54Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 52257, "is_private": false, "text": "mehdi, what is the status of this patch? do you intend to commit it? or can it be withdrawn?", "id": 157712, "time": "2012-04-08T21:15:45Z", "creator": "gadams@apache.org", "creation_time": "2012-04-08T21:15:45Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 52257, "attachment_id": null, "id": 157716, "creation_time": "2012-04-08T21:44:58Z", "time": "2012-04-08T21:44:58Z", "creator": "med1985@gmail.com", "text": "(In reply to comment #8)\n> mehdi, what is the status of this patch? do you intend to commit it? or can it\n> be withdrawn?\n\nCan it not be left outstanding?? Basically, we don't use the transcoders here, so I'm reluctant to implement an events system for a feature I don't know anything about. Vincent has given some comments, but again it comes down to a time issue. When I get the time to look into this, then I'll amend and apply the above patch.\n\nSorry for the inconvenience.", "is_private": false}, {"count": 10, "attachment_id": null, "bug_id": 52257, "is_private": false, "id": 157717, "time": "2012-04-08T23:08:03Z", "creator": "gadams@apache.org", "creation_time": "2012-04-08T23:08:03Z", "tags": [], "text": "resolving as later due to no plans to commit; may be resurrected in the future"}, {"count": 11, "tags": [], "bug_id": 52257, "is_private": false, "text": "batch transition resolved+later to closed+later; if you have new information or a patch that addresses the issue, you may reopen", "id": 158647, "time": "2012-04-30T00:25:03Z", "creator": "gadams@apache.org", "creation_time": "2012-04-30T00:25:03Z", "attachment_id": null}]