[{"count": 0, "tags": [], "creator": "feigl@ertl-glas.at", "is_private": false, "text": "Hello,\n\ni seen this issue since years on many different versions of apache2 and php.\n\nAt the moment i've seen this with:\nApache 2.2.16, PHP 5.3.3 (Oracle as php-pear-module)\nApache 2.2.3, PHP 5.2.0 (Oracle compiled with php)\nApache 2.2.3, PHP 5.2.0 (Oracle as php-pear-module)\nand also on many older versions, but this installations has already been upgraded.\n\nthe error message is \"PHP Warning: ocilogon() [function.ocilogon]: OCIEnvNlsCreate() failed. There is something wrong with your system - please check that LD_LIBRARY_PATH includes the directory with Oracle Instant Client libraries\"\n\nwhen you take a look at google, you find a lot of reports of this issue.\n\ne.g.\nhttp://www.eckford.ca/OpenSourceDev/subjects/UbuntuServer/php-oci8.php\nhttps://bugs.php.net/bug.php?id=36355\n\nbut if you find a solution on the sites on google, everyone is telling something different... I would say there is no solution for this issue, just after changing something and restarting the mashine the issue is gone for a long time, but it is still there.\n\nSince i've seen this issue on many mashines i tested a lot of things, about setting the \"LD_LIBRARY_PATH\" in all possible files; but this issue is happing about 1 time / year.\n\nNow i've got one mashine where it is happening about once a day.\ni don't see any difference to the other mashines, just that it is a virtual mashine.\n\nWhen this problem is happening, it is not happening for every client; just \"randomly\". because this is happening that often i now know it it just happing because of ONE (or maybe also 2 at the same time) Apache childs.\n\nwhen i do a phpinfo() for this childs where is NO difference.\n\nbut the processes itself are different:\n\nUSER       PID %CPU %MEM    VSZ   RSS TTY      STAT START   TIME COMMAND\nroot     20847  0.0  0.5  55496 11572 ?        Ss   09:16   0:00 /usr/sbin/apach\nwww-data 20855  0.0  0.6 128600 13888 ?        Sl   09:16   0:00 /usr/sbin/apach\nwww-data 20856  0.0  0.6 127764 13748 ?        Sl   09:16   0:00 /usr/sbin/apach\nwww-data 20857  0.0  0.6 128520 14640 ?        Sl   09:16   0:00 /usr/sbin/apach\nwww-data 20859  0.0  0.5  58228 11128 ?        S    09:16   0:00 /usr/sbin/apach\nwww-data 20875  0.1  0.7 129832 16216 ?        Sl   09:17   0:00 /usr/sbin/apach\n\nhere the issue was with PID 20859.\nas you see this PID is using less memory (VSZ + RSS) and also is not multi-threaded (STAT is \"S\" instead of \"Sl\").\n\nso i believe this i an apache issue.\n\nthe main question is: how to find this issue; what to test when it's happening again etc.\n\nBR johannes", "id": 151997, "time": "2011-12-06T09:26:26Z", "bug_id": 52291, "creation_time": "2011-12-06T09:26:26Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 52291, "attachment_id": null, "is_private": false, "id": 151998, "time": "2011-12-06T11:23:51Z", "creator": "covener@gmail.com", "creation_time": "2011-12-06T11:23:51Z", "text": "Apache HTTP Server  Bugzilla is only for reporting bugs in Apache, not for discussion or support much less for code that's not part of our project (OCIEnvNlsCreate).\n\nPerhaps a fellow user on users@httpd.apache.org would help you understand what processes work/fail and what their differences are.  They'd probably want to know what MPM you use, how you run PHP, what strace/ltrace look like in a failing proces..."}, {"count": 2, "tags": [], "bug_id": 52291, "attachment_id": null, "is_private": false, "id": 151999, "time": "2011-12-06T11:43:40Z", "creator": "feigl@ertl-glas.at", "creation_time": "2011-12-06T11:43:40Z", "text": "are you sure this is not an apache issue?\n\nBR Johannes"}]