[{"count": 0, "tags": [], "creator": "simon.lucy@bbc.co.uk", "is_private": false, "text": "Created attachment 28068\ntar of BBC module contributions, mod_firehose, firehose, mod_combine, mod_policy\n\nOver the past few years the BBC (British Broadcasting Corporation) has developed a set of modules which it uses as part of its standard httpd configuration.  The BBC would like to contribute a number of modules which are of generic use and which could form part of the standard distribution.  Apart from helping to fulfill the BBC's public service remit it will also allow other eyes to improve and develop the modules if needed.\n\nThe three modules in this contribution are:\nmod_firehose and firehose\nmod_firehose reflects original requests over a pipe and allows them to be recorded on demand on a remote machine which means that local disk resources are not required.\n\nmod_combine\nmod_combine is an aggregator of static files such as css and javascript to combine files of the same type and eliminate duplicates.\n\nmod_policy\nmod_policy is a filter to enforce policies such as cacheing rules and the standard use of headers.\n\nEach individual directory within the tar includes a README which should cover the purpose and use of each module.", "id": 152139, "time": "2011-12-13T11:03:16Z", "bug_id": 52322, "creation_time": "2011-12-13T11:03:16Z", "attachment_id": 28068}, {"count": 1, "text": "These would of course have to be discussed on the public dev list, with a view to possible inclusion in a future release (which is extremely unlikely to be 2.2).\n\nAt a glance, licensing is right, documentation is far from right, and code could use some tidying.", "bug_id": 52322, "is_private": false, "id": 152140, "time": "2011-12-13T11:39:40Z", "creator": "nick@webthing.com", "creation_time": "2011-12-13T11:39:40Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "wrowe@apache.org", "is_private": false, "count": 2, "id": 152148, "time": "2011-12-13T17:53:44Z", "bug_id": 52322, "creation_time": "2011-12-13T17:53:44Z", "text": "Shouldn't this be three bugs, since each is distinct?  (This could become a\nparent ticket, of course)."}, {"count": 3, "tags": [], "bug_id": 52322, "attachment_id": null, "text": "Yes, the original reason for making it one rather than three is that its a single  BBC ticket.\n\nmod_firehose has been accepted http://httpd.apache.org/docs/trunk/mod/mod_firehose.html", "id": 152291, "time": "2011-12-19T15:23:11Z", "creator": "simon.lucy@bbc.co.uk", "creation_time": "2011-12-19T15:23:11Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 52322, "attachment_id": null, "is_private": false, "id": 154349, "time": "2012-02-29T06:55:09Z", "creator": "wrowe@apache.org", "creation_time": "2012-02-29T06:55:09Z", "text": "I don't really want to take this discussion to the bug tracker, however\nit's necessary correct your misstatement (or at least, premature statement);\n\n\"mod_firehose has been accepted\"\n\nThat code will be reverted in the coming days, because an IP clearance form\nwas not properly routed, and the destination to which it was committed was \nnot acceptable to the community.\n\nThe committer in this case persistently failed to honor their own proposal \nto incubate these as distinct sub-projects, so at this point the code \nsubmission is in a state of limbo, with an active veto over the manner\nin which it was contributed.\n\nHopefully that individual will correct their error, tender the contribution \nas initially proposed, including the correct code grant paperwork to the\nsecretary@apache.org, IP clearance through general@incubator.apache.org \nand creation of three sub-projects (similar to mod_mbox, mod_fcgid etc)."}, {"count": 5, "text": "Well you just did take the discussion to the bug.\nAs I'm not party to any such discussion or even aware that there was a problem I'm afraid that this just looks like typical Apache nonsense.\n\nThese are apache modules, they don't warrant I believe an incubation project.  The BBC is even willing to donate the IP of this code if that makes it simpler but to be honest this dog in the manger attitude is just another example of why it is extremely difficult to get corporations to take Apache seriously at this point.\n\nNow if there are practical steps to take please detail them with at least some evidence of authority in making those steps a requirement.", "bug_id": 52322, "is_private": false, "id": 154355, "time": "2012-02-29T10:52:25Z", "creator": "simon.lucy@bbc.co.uk", "creation_time": "2012-02-29T10:52:25Z", "tags": [], "attachment_id": null}, {"count": 6, "text": "To clarify, donation of the IP is *not* necessary.  All that is needed is the \nlicensing under the AL.  The process is here;\n\nhttp://incubator.apache.org/ip-clearance/index.html\n\nand here is one example of how this played out for a particular submission;\n\nhttp://incubator.apache.org/ip-clearance/httpd-mod_fcgid.html\n\nThe license agreement to explicitly assign the ASF the license to these works\nwould be here;\n\nhttp://www.apache.org/licenses/software-grant.txt\n\nTo further correct your misunderstanding, \"dog in the manger\" is not the issue \nhere.  There are hundreds of add-in modules for Apache httpd.  Very few become\n'core' modules in the primary distribution.  Some dozen or so are also from\nthe ASF (from httpd, tomcat, perl and other projects) and available as separate \npackages/releases.  This is not for lack of (or disrespect for) user interest.\n\nIn fact, the subprojects at httpd were initially created for edge cases which\ndidn't have broad appeal, perhaps, but enjoy a narrow and active audience.\nCode is only entertained in core upon broad acceptance by the -developers- of\nApache httpd, not so much its user audience, because those developers assume\nresponsibility for the code.  Primary antibodies in the process exist to target\n'code dumps', wherein lines of code is dumped into a project without maintainers\nto follow through, and insufficient interest/attention of the other developers.\nSubprojects provide a channel for interested users to adopt modules very early\nin their ASF-lifespan, attract patches and improvements, and demonstrate that\na group of maintainers has been established.\n\nThe actual discussion of accepting these three submissions needs to return to\ndev@, I simply needed to correct your misunderstanding in comment #3, that this\ndonation was not yet executed appropriately and therefore not yet accepted.", "creator": "wrowe@apache.org", "is_private": false, "id": 154372, "time": "2012-02-29T15:09:30Z", "bug_id": 52322, "creation_time": "2012-02-29T15:09:30Z", "tags": [], "attachment_id": null}, {"count": 7, "tags": [], "creator": "simon.lucy@bbc.co.uk", "text": "The 'dog in the manger' was in relation to the tenor and lack of content other than rejection in your comment.\n\nAll it takes is simple exposition of what is needed, something I understand that Apache as a whole finds difficult to follow.\n\nAs for my remark about acceptance being premature I imagine the existence of the documentation at that link somehow confused me.", "id": 154398, "time": "2012-03-01T09:47:08Z", "bug_id": 52322, "creation_time": "2012-03-01T09:47:08Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 52322, "attachment_id": null, "is_private": false, "id": 154418, "time": "2012-03-02T04:47:38Z", "creator": "wrowe@apache.org", "creation_time": "2012-03-02T04:47:38Z", "text": "It appears we have consensus on handling of mod_firehose, the vote continues another 2.5 days.  I'll submit clarified votes over the next two days on mod_policy, followed by mod_combine, with updates to this ticket as each is\napproved (or not).\n\nRoy Fielding confirms that the code grant process is NOT necessary per his \ninteraction with the legal committee, as the project's former chair.  There\nappears to be no further issue other than clarifying that each of these three\nmodules are independently accepted as either modules or subprojects of httpd,\nor not, and committing the code into the agreed-upon repository."}, {"count": 9, "text": "(In reply to comment #8)\n> \n> Roy Fielding confirms that the code grant process is NOT necessary per his \n> interaction with the legal committee, as the project's former chair.\n\nSpeaking as the current VP, Legal Affairs, a code grant is the preferred way of handling such situations; that being said I will confirm that an ICLA is sufficient IF the PMC is prepared to demonstrate that the conditions under sections 7 of the Individual Contributor License Agreement (\"Agreement\") V2.0 have been satisfied, and that the terms specified are acceptable to the Foundation:\n\nhttp://www.apache.org/licenses/icla.txt", "bug_id": 52322, "is_private": false, "id": 154448, "time": "2012-03-02T18:41:34Z", "creator": "rubys@intertwingly.net", "creation_time": "2012-03-02T18:41:34Z", "tags": [], "attachment_id": null}, {"count": 10, "tags": [], "creator": "minfrin@sharp.fm", "text": "Sam, can you confirm for me that the following notices in the source are sufficient? The code for both is licensed under the ASL:\n\nhttps://svn.apache.org/repos/asf/httpd/httpd/trunk/modules/test/mod_policy.c\n\n/*\n * Originally written @ BBC by Graham Leggett\n * (C) 2011 British Broadcasting Corporation\n */\n\nhttps://svn.apache.org/repos/asf/httpd/httpd/trunk/modules/debugging/mod_firehose.c\n\n/*\n * Originally written @ Covalent by Jim Jagielski\n * Modified to support writing to non blocking pipes @ BBC by Graham Leggett\n * Modifications (C) 2011 British Broadcasting Corporation\n */", "id": 154545, "time": "2012-03-05T19:45:49Z", "bug_id": 52322, "creation_time": "2012-03-05T19:45:49Z", "is_private": false, "attachment_id": null}, {"count": 11, "tags": [], "bug_id": 52322, "text": "Sam, please comment on comment #10 (added you to cc on this ticket).\n\nGraham, you claim all of this code is your own creation (at the BBC) and not\na broader effort including other (non-committer) BBC employees?  That is what\nyour copyright banner states and if so, I believe Sam's concern on 7. should\nbe satisfied.", "id": 154664, "time": "2012-03-08T00:22:22Z", "creator": "wrowe@apache.org", "creation_time": "2012-03-08T00:22:22Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "simon.lucy@bbc.co.uk", "text": "Actually the (c) notice is the British Broadcasting Corporation, I can confirm (as the responsible manager) that the portions of code relevant to the solution written for the BBC was undertaken solely by Graham under contract to the BBC.", "count": 12, "id": 154724, "time": "2012-03-09T09:54:08Z", "bug_id": 52322, "creation_time": "2012-03-09T09:54:08Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "wrowe@apache.org", "text": "Sam,\n\nthe project voted to accept two of the three submitted modules for inclusion at \nthe httpd project; firehose and policy.  The combine module was not accepted.\n\nGraham and Simon reply, and ask if their responses address all of your concerns \nas VP, legal.  Please advise us this week.\n\nWe'll go on the presumption that no further word from you means that your \nconcerns were asked-and-answered already by Graham and Simon.", "count": 13, "id": 155294, "time": "2012-03-26T21:02:57Z", "bug_id": 52322, "creation_time": "2012-03-26T21:02:57Z", "is_private": false}, {"count": 14, "text": "I am marking this for closure as needinfo.\n\nThe firehose and policy modules were voted for acceptance and the combine\nmodule was rejected.\n\nEither Graham has further comments vis a vie importing the policy module,\nor Sam has comments on IP clearance.  If nobody has comments in the coming\nweek, this ticket should be closed.  We use the issue tracker for reporting\ndefects and limited enhancement requests, but not for operations.\n\nThanks all.", "bug_id": 52322, "is_private": false, "id": 155333, "time": "2012-03-28T06:24:41Z", "creator": "wrowe@apache.org", "creation_time": "2012-03-28T06:24:41Z", "tags": [], "attachment_id": null}]