[{"count": 0, "tags": [], "bug_id": 52325, "text": "I'm looking for a lightweight version of poi-3.8.jar to use it in an Android (private) app. \nI don't seem to be able to fit the whole 1.7Mb jar in the APK for some reason (and it would be wrong to do so anyway) and since I'm only looking for the doc -> html and xls -> html functionality, I'm not quite sure I need the whole jar file. \n\nI've spent a couple hours trying to figure out how to extract WordToHtmlExtracter.java in poi/hwpf/converter but it looks like it's using a lot of other stuff. Even if this doesn't really surprise me, I was thinking that maybe someone here would know which packages I can get rid of to make the jar smaller. I'll be glad to spend more time on it, unless someone here tells me it's a waste of time and that EVERYTHING in the sources is needed to convert doc to html files.\n\nI don't need anything that displays anything, I just need the \"simple\" doc to html  (and xls to html if possible) features. I don't need anything related to PDF, powerpoint, outlook or whatever.\n\nCheers", "id": 152147, "attachment_id": null, "creator": "jhilbold@hotmail.com", "creation_time": "2011-12-13T17:25:17Z", "time": "2011-12-13T17:25:17Z", "is_private": false}, {"count": 1, "tags": [], "text": "There have been a few discussions on the mailing list about packaging POI for android, you may want to review those in the archives\n\nUnfortunately, both reading and writing require very similar sets of classes. You could probably knock out a few classes, or quite a few methods, but there's not one whole package you could ignore\n\nCould you maybe split it into two bundles, one for POIFS+HSSF, and one for POIFS+HWPF, to keep the sizes down?", "is_private": false, "bug_id": 52325, "id": 152154, "time": "2011-12-14T00:12:49Z", "creator": "apache@gagravarr.org", "creation_time": "2011-12-14T00:12:49Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 52325, "text": "I'll try that, thanks!", "id": 152156, "time": "2011-12-14T09:19:58Z", "creator": "jhilbold@hotmail.com", "creation_time": "2011-12-14T09:19:58Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "\nHere is the list of common packages used by HSSF and HWPF:\n\n// common classes \norg.apache.poi.util\norg.apache.poi\n\n// OLE2 file system and properties\norg.apache.poi.poifs\norg.apache.poi.hpsf\n\n// office drawing\norg.apache.poi.ddf\n\n\nHWPF requires everything in org.apache.poi.hwpf\n A combination of org.apache.poi.hwpf.* and the above packages should be enough to run the doc2html convertor. \n\nHSSF requires the common stuff plus two package roots: org.apache.poi.hssf and org.apache.poi.ss\n\nThat's it. \n\nP.S. I'm closing this ticket, it is more a question for poi-user than a bug in Bugzilla. \n\nYegor", "is_private": false, "id": 152211, "creator": "yegor@dinom.ru", "time": "2011-12-16T10:57:48Z", "bug_id": 52325, "creation_time": "2011-12-16T10:57:48Z", "attachment_id": null}]