[{"count": 0, "tags": [], "bug_id": 52324, "text": "Due to artifact 'org.apache.tomcat.util.net.ServerSocketFactory' changing type (from abstract class to interface) between the Tomcat 6 and 7 API:s you can no longer deploy web applications containing certain libraries (such as a bit older JBoss client libraries) when there are also web fragments (or web.xml files with a version >= 2.5) present.\n\nThis is due to web fragments / modern web.xml files triggering a scan of the entire classpath looking for annotations. The following exception is the result (the message is quite clear):\n\njava.lang.IncompatibleClassChangeError: class org.jboss.remoting.transport.coyote.ssl.RemotingServerSocketFactory has interface org.apache.tomcat.util.net.ServerSocketFactory as super class\n\nReplacing the web fragment with a web.xml of version <= 2.4 does not trigger the error (since Tomcat and other containers deem such web applications as 'legacy-style', and therefore does not scan the classpath for annotations).\n\nWas this change (quite API-breaking) of type for ServerSocketFactory deliberate? I can't seem to find anything in the general changenotes regarding this change, though it might have been noted somewhere else, or in an earlier version even.\n\nhttp://tomcat.apache.org/tomcat-6.0-doc/api/org/apache/tomcat/util/net/ServerSocketFactory.html\n\nhttp://tomcat.apache.org/tomcat-7.0-doc/api/org/apache/tomcat/util/net/ServerSocketFactory.html", "id": 152146, "time": "2011-12-13T17:02:55Z", "creator": "manadrainer@gmail.com", "creation_time": "2011-12-13T17:02:55Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 52324, "text": "There are no API guarantees between major Tomcat versions. We'll keep things the same where we can, but will change the API where it makes sense to do so. The commit concerned for this change is r1044058.\n\nFurther, the class you are referring to is, as per the release notes, part of Tomcat's internals and may change between point releases.", "id": 152152, "time": "2011-12-13T19:43:36Z", "creator": "markt@apache.org", "creation_time": "2011-12-13T19:43:36Z", "is_private": false, "attachment_id": null}]