[{"count": 0, "tags": [], "creator": "ringerc@ringerc.id.au", "attachment_id": null, "id": 152183, "time": "2011-12-15T07:32:38Z", "bug_id": 52338, "creation_time": "2011-12-15T07:32:38Z", "is_private": false, "text": "I'm using fop 1.0 and am having issues with a TrueType CID font - all the Myriad Pro family in TrueType.\n\nI can embed them in PDF and get perfect results from fop. Unfortunately, I have to include some other resources that're supplied as EPSs or PDFs. PDF-in-PDF embedding via Jeremias's fop-pdf-image ext works but has font duplication problems that mean I can't use it, so I have to use PostScript output from FOP with embedded EPSs then chuck the result through Distiller.\n\nThat's where the problem arises. All the text using CID fonts, like Myriad Pro, comes out either as \"[X]\" boxes in the final PDF with the occasional odd random glyph scattered through it.\n\nThe same fonts embed and work perfectly in FOP's PDF output.\n\nI can't attach the fonts for licensing reasons, but I can supply for testing purposes to anyone interested. The fonts were converted from OpenType versions (which fop doesn't support) using FontForge, so they're not studio originals, but they work perfectly in PDF embedding and other applications.\n\nI've filed this under \"fonts\" but it should possibly be \"ps\" instead.\n\nI'll test with latest svn trunk and report on that."}, {"count": 1, "tags": [], "bug_id": 52338, "is_private": false, "text": "Hi Craig, there is a branch for just this:\n\n..fop/branches/Temp_TrueTypeInPostScript/\n\nI also have an outstanding patch:\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=50483\n\nThat does some bug fixing, clean up etc, we are planning on merging this into trunk in the near future.\n\nTry that, if you don't have any issues could close this bug, thanks.", "id": 152189, "time": "2011-12-15T13:24:34Z", "creator": "med1985@gmail.com", "creation_time": "2011-12-15T13:24:34Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 52338, "is_private": false, "text": "resetting P2 open bugs to P3 pending further review", "id": 157603, "time": "2012-04-07T01:45:13Z", "creator": "gadams@apache.org", "creation_time": "2012-04-07T01:45:13Z", "attachment_id": null}, {"count": 3, "text": "Possibility to embed TrueType fonts in PostScript has been added in rev. 1352986:\nhttp://svn.apache.org/viewvc?rev=1352986&view=rev", "bug_id": 52338, "attachment_id": null, "id": 160187, "time": "2012-06-22T18:11:02Z", "creator": "vhennebert@gmail.com", "creation_time": "2012-06-22T18:11:02Z", "tags": [], "is_private": false}]