[{"count": 0, "tags": [], "bug_id": 52345, "attachment_id": 28078, "id": 152219, "time": "2011-12-16T14:45:04Z", "creator": "singh4jmeter@gmail.com", "creation_time": "2011-12-16T14:45:04Z", "is_private": false, "text": "Created attachment 28078\nSnapshot from JTL file showing very high response times when test executed from non-gui mode on linux\n\nProblem Description: \"Load Test Results using JMeter shows very high response times in the JTL file compared to server response\"\n\nDuring Load Testing the the load is hit on ELB (Amazon Elastic Load Balancer) which distributes the load to 4 JBoss Nodes. Protocol Used is HTTPS and HTTP.\n\nProblem Explanation:\nPerforming Load Test in distributing mode on Linux environment in non-GUI mode. Using 8 JMeter servers and 1 JMeter client (All Linux boxes).\nWith ~900 threads and 8 Thread Groups, the results are recorded very bad (see screenshot). The server response times are less than 1 second where as JMeter output log shows more than 9 seconds response times for most of the times.\n\nWhat Options Tried:\nTried with various log level in jmeter.properties file like\nmode = StrippedBatch\nnum_sample_threshold=1000\ntime_threshold=60000\n\nAlso tried running with 1 Slaves with 900 threads but still results are bad.\n\nPlease help in resolving the issue.\n\nThanks,\nSingh"}, {"count": 1, "attachment_id": null, "creator": "sebb@apache.org", "is_private": false, "id": 152220, "time": "2011-12-16T14:54:15Z", "bug_id": 52345, "creation_time": "2011-12-16T14:54:15Z", "tags": [], "text": "Try using JMeter 2.5.1 and see if that helps. \nIt has an Asych remote mode as well.\n\nAlso, are you using download embedded resources?\nOr Transaction Controller?\n\nSample elapsed times are calculated on the server, AFAIK individual response times cannot be affected by client-server response times.\n\nHowever, if the client-server link is overloaded, the effect can be to add pauses between samples; this will affect aggregated samples such as embedded resources and Transaction Controller.\n\nAs a work-round, just run the tests separately in non-GUI mode on each server and combine the results manually."}, {"count": 2, "tags": [], "bug_id": 52345, "attachment_id": null, "id": 152221, "time": "2011-12-16T15:04:19Z", "creator": "singh4jmeter@gmail.com", "creation_time": "2011-12-16T15:04:19Z", "is_private": false, "text": "Hey Sebb,\n\nThanks for your quick response.\nI tried running the JMX script separately in non-GUI mode on each server but still getting similar kind of issue.\n\nEven I tried running my JMX script using JMeter 2.5.1 but problem still persists.\n\nOther Options I tried was.. \nI copied the JMeter folder on one of the Application Server node and running my load test from App server in non-GUI mode hitting directly the same App server. Thinking there could be network latency. But still I see very high response times in the JTL file continuously for some time.\n\nI am using SPLUNK to get the results from my JBoss access log. In splunk my application response times are below 1 second. But when it comes to JMeter output file, it shows very high response times.\n\nWe are running the test on Amazon EC2 where JMeter Client and servers are of large instances.\n\nThanks\nSingh"}, {"count": 3, "tags": [], "bug_id": 52345, "attachment_id": null, "id": 152225, "time": "2011-12-16T16:10:49Z", "creator": "sebb@apache.org", "creation_time": "2011-12-16T16:10:49Z", "is_private": false, "text": "(In reply to comment #2)\n> Hey Sebb,\n> \n> Thanks for your quick response.\n> I tried running the JMX script separately in non-GUI mode on each server but\n> still getting similar kind of issue.\n\nThen the problem is nothing to do with JMeter distributed mode, is it?\n\n> Even I tried running my JMX script using JMeter 2.5.1 but problem still\n> persists.\n> \n> Other Options I tried was.. \n> I copied the JMeter folder on one of the Application Server node and running my\n> load test from App server in non-GUI mode hitting directly the same App server.\n> Thinking there could be network latency. But still I see very high response\n> times in the JTL file continuously for some time.\n\nAgain, distributed mode is irrelevant.\n \n> I am using SPLUNK to get the results from my JBoss access log. In splunk my\n> application response times are below 1 second. But when it comes to JMeter\n> output file, it shows very high response times.\n> \n> We are running the test on Amazon EC2 where JMeter Client and servers are of\n> large instances.\n\nThere's absolutely no evidence here that JMeter distributed mode is at fault, or indeed JMeter.\n\nBugzilla is not a suitable place to continue this discussion.\nPlease subscribe to the JMeter user list and post there."}]