[{"count": 0, "tags": [], "creator": "ju.vignolles@gmail.com", "attachment_id": null, "id": 152418, "time": "2011-12-27T10:22:18Z", "bug_id": 52388, "creation_time": "2011-12-27T10:22:18Z", "is_private": false, "text": ""}, {"count": 1, "tags": [], "creator": "ju.vignolles@gmail.com", "attachment_id": null, "text": "I downloaded the Apache 2.2.21 source tarball from\napache.org, built it on my OpenBSD 4.9 box with\n\n./configure --prefix=/usr/local/apache2 --with-mpm=worker\n--with-included-apr && make && sudo make install\n\nand ran it with\n\ncd /usr/local/apache2/bin; ./apachectl start\n\nStrange thing is that any client I pointed to my test instance would\nconnect and then hang. When I stopped apache with\n\n./apachectl stop\n\nthen, a few seconds later, all the waiting clients would show \"It worked!\"\n\nIt's important for me to have the worker mode. Therefore, the event mode works fine.", "id": 152419, "time": "2011-12-27T10:27:14Z", "bug_id": 52388, "creation_time": "2011-12-27T10:27:14Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 52388, "attachment_id": null, "text": "First of all, OpenBSD's pthread library is rather limited. I don't think that either MPM worker or MPM event work well with it. I recommend to use the prefork MPM, instead. There is a replacement project \"rthreads\", but I don't know its status. It's not included in OpenBSD 5.0.\n\nApart from that, a run of the apr test suite under OpenBSD shows that it hangs when trying to use the proc mutex mechanism sysvsem. You could try if disabling that one helps:\n\nTry\n\nac_cv_func_semget=no ./configure ...\n\nor \n\napr_lock_method=USE_POSIXSEM_SERIALIZE ./configure ...\n\n(not sure which one works). If it does, we could add that to the apr platform hints. But in the end, the problem is that OpenBSD does not provide suitable threading support.", "id": 153128, "time": "2012-01-24T21:17:20Z", "creator": "sf@sfritsch.de", "creation_time": "2012-01-24T21:17:20Z", "is_private": false}, {"count": 3, "tags": [], "creator": "egarreau@gmail.com", "attachment_id": null, "id": 153205, "time": "2012-01-27T08:24:06Z", "bug_id": 52388, "creation_time": "2012-01-27T08:24:06Z", "is_private": false, "text": "thanks a lot Stefan for this workaround. I'm working with Julien, and we still don't understand why the event mode works although the worker mode doesn't (we played with gdb and setup parameters a lot, but the root cause was not clear).\n\nafter some googling, we had concluded that pthread support in OpenBSD was poor, - bad surprise -, ... and we have switched our minds to FreeBSD.\n\ncheers,\n\neric"}]