[{"count": 0, "tags": [], "bug_id": 52395, "attachment_id": null, "id": 152457, "time": "2011-12-29T01:14:09Z", "creator": "paulgraydon@hotmail.com", "creation_time": "2011-12-29T01:14:09Z", "is_private": false, "text": "Server is FreeBSD based, running Apache HTTPd version 2.2.21:\n\n[notice] Apache/2.2.21 (FreeBSD) mod_ssl/2.2.21 OpenSSL/0.9.8q\n\nWe had a vhost file that was updated a week ago. Previous vhost was of form:\n\n<VirtualHost *:80>\n    ServerName foo.bar.org\n\n    ProxyPreserveHost On\n    ProxyPass / http://baz.bar.org/\n    ProxyPassReverse / http://baz.bar.org/\n</VirtualHost>\n\nIt just contained a \":80\" entry.\nA \"*:443\" entry was added of identical form, but by mistake without the line:\n\nInclude conf/ssl.conf\n\nwhich is in all our *:443 entries and does the usual standard settings for SSL (encryption format, certificate etc.)\n\nconfigtest passed it okay as it still doesn't check SSL stuff (see https://issues.apache.org/bugzilla/show_bug.cgi?id=36286).  Reload brought the changes in without any complaint.  Despite several reloads that have occurred since the mistake was made last week, not once has httpd complained about lack of SSL configuration until today when a restart, rather than a reload, was done.\n\nOn restart it threw up the expected, an error it should have been hitting ever since the mistake was made:\n\n[error] Server should be SSL-aware but has no certificate configured [Hint: SSLCertificateFile] ((null):0)\n\nTo my possibly crazy mind the same config files should result in the same end environment, regardless of whether httpd was passed a reload or a restart.  The config files should be describing an exact operating environment.  Sadly this shows it isn't the case.\n\nIt would be nice if configtest had failed, but given it's 6 years after that bug was submitted I figure that's never going to happen; but it's very disturbing that reload and restart can end up so differently.\n\nI've since tested with a working environment, setting up a vhost with a working SSL setup, commenting out the include ssl.conf entry and reloading, after which it stays running.  Restart fails.  Uncommenting the line and restarting results in it working fine."}]