[{"count": 0, "tags": [], "bug_id": 52423, "is_private": false, "text": "See https://issues.apache.org/bugzilla/show_bug.cgi?id=50789.\n\nThis issue was reported for both tomcat 6 and 7.  It was resolved in tomcat 7.0.9 and further noted to have been solved earlier by another similar issue in error pages in tomcat 7.0.5 (#49991).  Can this same issue be resolved in tomcat 6?  We are limited currently to using tomcat 6 and unlikely to be off of that this year.  It would be nice to have this resolved.  We do testing in both tomcat 6 and 7 locally on our machines.  The issue doesn't appear in tomcat 7 as this solution indicated.  The issue as I see it revolves around the error pages specifically as we use BASIC authentication in WEB.XML as a stub and another mechanism for authentication through our mainframe.  We are aware our configuration is resulting in error pages most likely through ajax where we don't really expect to see the page thrown up to the user.  However, this makes it difficult to look at logs as we are developing and fixing it might make it somewhat easier for us to catch another issue we see only in tomcat 6.\n\nWe are using WELD 1.1.4, Mojarra 2.1.6, Richfaces 4.1.0, and replaced tomcat version of EL 2.1 with 2.2 api/impl.  We have also been running with Apache Commons Daemon 1.0.8 which I see is going to be officially in the next update of tomcat 6.", "id": 152572, "time": "2012-01-05T00:28:48Z", "creator": "jeremylandis@hotmail.com", "creation_time": "2012-01-05T00:28:48Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of bug 50789 ***", "id": 152573, "time": "2012-01-05T01:00:50Z", "bug_id": 52423, "creation_time": "2012-01-05T01:00:50Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 52423, "text": "I understand this is a duplicate, but it doesn't appear to have been resolved in tomcat 6.  Has this been resolved in the upcoming version of tomcat 6?  All the bugzilla requests attached to this state is that it was resolved in tomcat 7.", "id": 152575, "time": "2012-01-05T01:14:17Z", "creator": "jeremylandis@hotmail.com", "creation_time": "2012-01-05T01:14:17Z", "is_private": false, "attachment_id": null}]