[{"count": 0, "tags": [], "bug_id": 52468, "attachment_id": 28158, "text": "Created attachment 28158\nFixes bugs 52441, 52422 and invalid offsets in local variable and line number tables\n\nLocalVariableGen objects point to the start and end InstructionHandles which indicate the variable range. However, when changing the instruction list with MethodGen.setInstructionList, the LocalVariableGen objects point to instruction handles that do not belong to the new list. When MethodGen.getMethod is called, LocalVariable objects will be created using the bytecode offsets of handles that do not belong to the current instruction list. Because bytecode instructions can have different lengths, the offsets may be invalid (i.e., do not point to an instruction, which is invalid according to the java bytecode spec).\n\nA similar problem occurs with LineNumberGens.\n\n\nOne proposed solution is to check at getLocalVariables() (and getLineNumberTable) whether the target handle belongs to the current instruction list. If not, we first search for the \"best candidate\" in the current list, i.e., the instruction with the position of the original targeted instruction, or the next one if there is no perfect match. Then we use this instruction's offset in the LocalVariable.\n\nSketch of the code:\n\npublic LocalVariableGen[] getLocalVariables() {\n    int size = variable_vec.size();\n    LocalVariableGen[] lg = new LocalVariableGen[size];\n    variable_vec.toArray(lg);\n    for (int i = 0; i < size; i++) {\n        if (lg[i].getStart() == null) {\n            lg[i].setStart(il.getStart());\n        } else {\n            lg[i].setStart(il.findHandle(lg[i].getStart().i_position));\n        }\n     ...\n}\n\nThe patch in attachment fixes this problem plus the last 2 bugs I reported ( https://issues.apache.org/bugzilla/show_bug.cgi?id=52441 and https://issues.apache.org/bugzilla/show_bug.cgi?id=52422 ).", "id": 152785, "time": "2012-01-14T17:58:38Z", "creator": "thiagobart@gmail.com", "creation_time": "2012-01-14T17:58:38Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 52468, "text": "Would be great to have a test case for this. Sounds about right though.", "id": 153451, "attachment_id": null, "creator": "tcurdt@apache.org", "creation_time": "2012-02-04T20:01:30Z", "time": "2012-02-04T20:01:30Z", "is_private": false}]