[{"count": 0, "tags": [], "creator": "calestyo@scientia.net", "attachment_id": null, "id": 153002, "time": "2012-01-22T01:31:55Z", "bug_id": 52495, "creation_time": "2012-01-22T01:31:55Z", "is_private": false, "text": "Hi.\n\nIt's already possible to set the Client Auth Requirements per directory context, which triggers a renegotiations. The same is true for the CipherSuite.\n\nI'm not an SSL/TLS expert, but some of the following suggestions might be possible to (eventually) implement:\nSSLCACertificateFile\nSSLCACertificatePath\nSSLCADNRequestFile\nSSLCADNRequestPath\nSSLCARevocationFile\nSSLCARevocationPath\nSSLCertificateChainFile\nSSLCertificateFile\nSSLCertificateKeyFile\nshould be settable per directory-context.\n\nI don't know whether SSL/TLS allows changing the server certificates, certificate chains and the proposed DNs in renegotiations...\nBut at least CACertificate should be changeable on a per directory basis, as this is only a server side verification.\n\n\nCheers,\nChris."}, {"count": 1, "tags": [], "creator": "asfbugz@velox.ch", "attachment_id": null, "id": 153434, "time": "2012-02-04T07:29:37Z", "bug_id": 52495, "creation_time": "2012-02-04T07:29:37Z", "is_private": false, "text": "(In reply to comment #0)\nShort reply: it's rather unlikely that most of this is ever going to happen (unless some future release of OpenSSL would extend its API for changing connection settings).\n\nLonger reply - looking at the directives in question:\n\n> SSLCACertificateFile\n> SSLCACertificatePath\n\nOpenSSL doesn't allow changing the list of trusted CAs once a connection has been established (there's SSL_CTX_load_verify_locations(), but no SSL_load_verify_locations()).\n\n> SSLCADNRequestFile\n> SSLCADNRequestPath\n\nThis is doable, in theory (OpenSSL provides SSL_set_client_CA_list()), but IMO of limited use as long as SSLCACertificateFile/SSLCACertificatePath can't be adjusted. It would only change the list of DNs (\"hints\") sent to the client to assist him in picking an appropriate cert, but verification would still be based on the per-vhost list of trusted CAs.\n\n> SSLCARevocationFile\n> SSLCARevocationPath\n\nThese should simply mirror the options for SSLCACertificateFile/SSLCACertificatePath (there's no point in making them configurable per directory as long as the list of trusted CAs can only be configured at the vhost level).\n\n> SSLCertificateChainFile\n> SSLCertificateFile\n> SSLCertificateKeyFile\n\nChanging the certificate when renegotiating is permitted by the spec, in theory, but it's hard to see a use case for per-directory configuration of the server cert. It would have to include the same DNS name(s) as the one configured at the VirtualHost level (ServerName/ServerAlias directives), since clients might otherwise (rightfully) reject the new cert due to name mismatches.\n\nGenerally speaking, I would recommend to separate sites with differing TLS requirements into their own virtual hosts (perhaps based on SNI, depending on the browsers you need to support). This can also reduce the number of required renegotiations, which has further performance benefits."}]