[{"count": 0, "tags": [], "creator": "lmeyer@vmware.com", "is_private": false, "id": 152989, "creation_time": "2012-01-20T22:54:21Z", "time": "2012-01-20T22:54:21Z", "bug_id": 52492, "text": "Created attachment 28182\nchunk-zip-test.pl script and chunk-test-file.txt for exercising the server; 400.trace shows results; other logs etc.\n\nWhen a client submits a request body with gzip compression and chunked transfer-encoding, and mod_deflate is directed to unzip input, if the last chunk is \"too small\" (8 bytes or smaller, as far as I can tell) the server will reject the request with a 400 error. I've observed this when it wasn't the last chunk that's small, but that doesn't seem as repeatable.\n\nAttached are the instruments to reliably produce this problem. It's a little tricky to get a client that will chunk exactly as desired, so I created one manually in Perl - open to the possibility that my script is wrong, but Wireshark seems to understand the requests made, and httpd too depending on the conditions, so I think it's right.\n\nContents:\nchunk-zip-test.pl - Perl test script; requires IO::Socket::INET and Compress::Zlib\nchunk-test-file.txt - test content to send (portion of system dictionary)\nhttpd.conf.snippet - conf to activate mod_deflate (assuming it's loaded/compiled in)\n400.trace - example packet trace demonstrating the problem\nhttpd-V.txt and system - info about my setup\nlogs.snippet - debug output from bad request\n*_log - full logs for context\n\nIf httpd is running at localhost:80 with the mod_deflate snippet in place, testing should be very simple:\n$ ./chunk-zip-test.pl -size=40\nThe script defaults gzip and send the file to localhost:80; specifying 40-byte chunks results in the packet trace above with a 400 response.\n\nThis particular bug might seem an unlikely use case, but in testing with this script I've noticed a number of possible problem areas that I'll reserve for other bugs, probably related to the central pattern of mod_deflate handling chunked requests. Since this one is relatively simple, it may be the best one to look at first.\n\nI've only tested on Linux (CentOS 5) but have observed the problem with both httpd 2.2.21 and 2.3.16 as well as earlier versions. Let me know if there's anything I can do to assist with this bug.", "attachment_id": 28182}, {"count": 1, "tags": [], "creator": "lars.tuschinski@ista.com", "attachment_id": null, "id": 164915, "time": "2013-01-28T22:10:01Z", "bug_id": 52492, "creation_time": "2013-01-28T22:10:01Z", "is_private": false, "text": "We are actually seeing this issue without having chunked transfer-encoding. There is just a TCP-packet of 8 bytes size that is not seen by mod_deflate. Those 8 bytes contain the crc and original (unzipped) lenght.\n\nI had a look at the area where I believe the problem shows up. But couldn't find a solution how to read the missing 8 bytes from the wire (as suggested in the FIXME-comment on line 944 in mod_deflate.c of httpd 2.2.23.\n\nBut if I can be of any assistance, please let me know."}, {"count": 2, "tags": [], "text": "\n\n*** This bug has been marked as a duplicate of bug 46146 ***", "is_private": false, "id": 172752, "creation_time": "2014-01-28T16:28:48Z", "time": "2014-01-28T16:28:48Z", "creator": "christian.nols@mcl-technologies.com", "bug_id": 52492, "attachment_id": null}]