[{"count": 0, "tags": [], "bug_id": 52522, "text": "", "id": 153133, "time": "2012-01-25T08:20:06Z", "creator": "ksakhare2004@yahoo.com", "creation_time": "2012-01-25T08:20:06Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 52522, "text": "I download the Oracle iplanet webserver 7.0.13 and try building the nsapi connector by pointing IPLANET_HOME. The build is failing with nsapi.h is missing.\n\nI checked in include folder of oracle webserver 7.0.13, the nsapi.h is missing in its include folder, but we have reference in jk_nsapi_plugin.c. \n\nCan some one able to build with Oracle iplanet webserver 7.0.13 ? \n\nThanks\nKiran sakhare", "id": 153134, "time": "2012-01-25T08:22:42Z", "creator": "ksakhare2004@yahoo.com", "creation_time": "2012-01-25T08:22:42Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 52522, "attachment_id": null, "id": 153154, "time": "2012-01-25T18:51:19Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2012-01-25T18:51:19Z", "is_private": false, "text": "Unfortunately Oracle doesn't provide an updated NSAPI guide for 7.0.13. The docs for 7.0.13 contain the NSAPI guide for 7.0.9, which contains in chapter 7:\n\nChapter 7 Data Structure Reference\n\nNSAPI uses many data structures that are defined in the nsapi.h header file, which is in the install-dir/include directory.\n\nThis chapter describes public data structures in nsapi.h\n\nSo here and in some other inofficial places, they say the file is in the \"include\" folder contained in the installation directory.\n\nPlease check, whether you have a complete installation of the iPlanet Webserver and whether the file can't be found. If so, I think you need to open an issue with Oracle. Sorry.\n\nNote that the NSAPI plugin isn't a first class citizen in the Tomcat connectors world. Support for the Apache webserver and ISAPI is much better. Basically it works with NSAPI, but many features available when used with Apache or IIS are not implemented for the iPlanet plugin.\n\nI will close this ticket, but feel free to reopen if you find explicit information that nsapi.h is expected to be gone and replaced by something else, hopefully that information will also tell us what to include instead.\n\nRegards,\n\nRainer"}]