[{"count": 0, "tags": [], "creator": "d.roe@cyprotex.com", "text": "Created attachment 28209\nMinimal test case\n\nI'm running into an error \"Failed to find a matching shared formula record\" when saving a spreadsheet. I've whittled it down to a minimal test case which I've attached. Simply loading and saving this file causes the error. I had to remove some sensitive stuff so there are a few formula errors but the file is still valid.\n\nI had a look at the code in org.apache.poi.hssf.record.aggregates.SharedValueManager.findFormulaGroupForCell where the exception is thrown. It mentions 15228.xls which I tried loading and saving and it worked fine.", "id": 153149, "time": "2012-01-25T18:04:55Z", "bug_id": 52527, "creation_time": "2012-01-25T18:04:55Z", "is_private": false, "attachment_id": 28209}, {"count": 1, "tags": [], "creator": "d.roe@cyprotex.com", "text": "Created attachment 28227\nMove exception from findFormulaGroupForCell to linkSharedFormulaRecord", "id": 153283, "time": "2012-01-30T10:35:15Z", "bug_id": 52527, "creation_time": "2012-01-30T10:35:15Z", "is_private": false, "attachment_id": 28227}, {"count": 2, "tags": [], "bug_id": 52527, "attachment_id": null, "text": "I've had another look at the source code and findFormulaGroupForCell is called from two places: linkSharedFormulaRecord and getRecordForFirstCell. linkSharedFormulaRecord seems to deal only with shared formulas and so I think the exception is correct in that case. However, getRecordForFirstCell deals with tables and arrays and it makes sense there for findFormulaGroupForCell to return null instead of throwing an exception. The code in getRecordForFirstCell even checks for null (which won't be possible with the current exception-throwing code).\n\nIt seems with the current code, a spreadsheet with a shared formula cannot contain any arrays or tables.\n\nI have attached a patch that moves the exception into linkSharedFormulaRecord. I think the TODO comment could also be removed as that file seems to work fine (as mentioned in my earlier comment).", "id": 153284, "time": "2012-01-30T10:35:29Z", "creator": "d.roe@cyprotex.com", "creation_time": "2012-01-30T10:35:29Z", "is_private": false}, {"count": 3, "tags": [], "creator": "yegor@dinom.ru", "attachment_id": null, "id": 153546, "time": "2012-02-07T10:47:41Z", "bug_id": 52527, "creation_time": "2012-02-07T10:47:41Z", "is_private": false, "text": "Thanks for the patch. Applied in r1241419, unit test added.\n\nYegor"}]