[{"count": 0, "tags": [], "text": "Hi!\n\nI noticed that Help -> Help opens the documentation in some sort of inbuild browser which is not really beautiful (uses metal theme *vomit*) or nice to use (eg. lacks maximize window functionality).\nTherefore I propose that the documentation is opened in the system default browser.\nThe functionality to do this already exists in java and is demonstrated here: http://johnbokma.com/mexit/2008/08/19/java-open-url-default-browser.html\nThough this method would raise the java requirement to 1.6 (but seriously, 1.6 is available since 6 years already, so imho ppl who still have not upgraded probably also won't upgrade their jmeter ;))\n\nbr,\nImm", "is_private": false, "id": 153175, "creator": "immanuel.hayden@gmail.com", "time": "2012-01-26T07:38:16Z", "bug_id": 52534, "creation_time": "2012-01-26T07:38:16Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 52534, "attachment_id": null, "text": "Does the Desktop class support subsequent navigation within the Help file?\n\nJMeter automatically opens the help file at the correct location, and subsequent help requests navigate within the same window. (The first time Help is opened, the location is not quite right - dunno whether that a JMeter or Java bug).\n\nAlso, what if the user navigates away from the original help page? Should JMeter create a new page? And how would JMeter know to do so?\n\nIt would be a seriously retrograde step if JMeter had to create a new browser window for each help request. Equally, if the user had followed some links from the original window, it could be annoying if the window suddenly reverted.", "id": 153186, "time": "2012-01-26T11:31:42Z", "creator": "sebb@apache.org", "creation_time": "2012-01-26T11:31:42Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 52534, "is_private": false, "text": "Ah, didn't know that the help is context-sensitive. I thought the function just opened the component reference page. Having control over the page once it is opened in the system browser is afaik not possible.\nI will close this issue then.", "id": 153190, "time": "2012-01-26T12:54:04Z", "creator": "immanuel.hayden@gmail.com", "creation_time": "2012-01-26T12:54:04Z", "attachment_id": null}]