[{"count": 0, "tags": [], "text": "Apache seems to be sending back a 400 Bad Request for a simple non-existing collection resource.\n\nI have a resource `/test/junit/test.bin`. I want to check if the collection `/test/junit/test.bin/` exists (i.e. a collection of the same name)---according to RFC 2518, a collection (with a slash) and a non-collection are distinct. When I issue a `PROPFIND` on `/test/junit/test.bin/`, Apache responds with a 400 Bad Request.\n\nNow, I understand that many people and implementation have blurred the lines between collections and non-collections---that is, whether a collection has to have an ending slash. But whatever the case, the collection `/test/junit/test.bin/` does not exist---issuing a `PROPFIND` on a collection that does not exist is not a \"bad request\". Shouldn't Apache simply issue a standard 404 Not Found or 410 Gone? What was \"bad\" about my request?\n\n\tPROPFIND /test/junit/test.bin/ HTTP/1.1\n\tdepth: 1\n\tcontent-length: 102\n\tauthorization: BASIC XXXXX\n\thost: example.com\n\n\t<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n\t<D:propfind xmlns:D=\"DAV:\">\n\t\t<D:allprop />\n\t</D:propfind>\n\n\tHTTP/1.1 400 Bad Request\n\tDate: Mon, 23 Jan 2012 15:30:37 GMT\n\tServer: Apache/2.2.11 (Unix) mod_ssl/2.2.11 OpenSSL/0.9.8k DAV/2 SVN/1.7.2 mod_jk/1.2.28\n\tContent-Length: 226\n\tConnection: close\n\tContent-Type: text/html; charset=iso-8859-1\n\n\t<!DOCTYPE HTML PUBLIC \"-//IETF//DTD HTML 2.0//EN\">\n\t<html><head>\n\t<title>400 Bad Request</title>\n\t</head><body>\n\t<h1>Bad Request</h1>\n\t<p>Your browser sent a request that this server could not understand.<br />\n\t</p>\n\t</body></html>\n\n\nHere's what Apache puts in the logs:\n\n\t[Mon Jan 23 14:31:09 2012] [error] [client XX.XXX.XX.XXX] Could not fetch resource information.  [400, #0]\n\t[Mon Jan 23 14:31:09 2012] [error] [client XX.XXX.XX.XXX] (20)Not a directory: The URL contains extraneous path components. The resource could not be identified.  [400, #0]\n\nYes, I understand that a resource of the same name (without the ending slash) exists and I'm asking for properties of a collection (with the slash). So yes, we can predict when Apache will return 400. But I do not believe that 400 Bad Request is a correct response, and I can find nothing in RFC 2518 to justify 400 Bad Request. I made a perfectly valid request for a collection resource that did not exist, so in my opinion Apache should send back a 404 Not Found indicating that this collection resource does not exist.\n\nThere was nothing \"bad\" about my request. So Apache found another resource (`/test/junit/test.bin`) that exists. So what? I wasn't asking about that resource. I was asking about `/test/junit/test.bin/`. The answer is (or should be) that it doesn't exist---not that I made a bad request.\n\nSee http://stackoverflow.com/questions/8976331/apache-mod-dav-400-bad-request-for-non-existent-collection-resource .", "is_private": false, "id": 153197, "creator": "garret@globalmentor.com", "time": "2012-01-26T16:56:30Z", "bug_id": 52539, "creation_time": "2012-01-26T16:56:30Z", "attachment_id": null}]