[{"attachment_id": 28215, "tags": [], "bug_id": 52540, "text": "Created attachment 28215\nSmall document containing more than one core properties element.\n\nIn order to comply with rule M4.1 (\"A format consumer shall consider\nmore than one core properties relationship for a package to be an\nerror\"), POI throws an exception when you attempt to open a Word docx\nfile that violates this rule. Unfortunately, Word 2008 and 2011 for\nMacintosh create, save, and open files with multiple core\nproperties. I do not have easy access to Windows versions of Word, so\nI don't know what happens when this file is read into Word and saved\nout again. This is using the latest 3.8beta5 version of POI. I have\nattached a small Word docx file (\"base.docx\") that demonstrates the\nproblem.\n\nI have created a patch that relaxes this compliance. Instead of\nthrowing an exception, I take the first core properties encountered in\nthe file and silently ignore any subsequent core properties in the file.\nI completely understand if this patch is not accepted. I've modified\nthe code to explicitly violate a clear rule in the standard. But I\nneed to support my users, which means I need to support these\nnon-conforming files.", "count": 0, "id": 153203, "time": "2012-01-27T05:28:25Z", "creator": "gregg.morris@gmail.com", "creation_time": "2012-01-27T05:28:25Z", "is_private": false}, {"count": 1, "tags": [], "creator": "gregg.morris@gmail.com", "attachment_id": 28216, "text": "Created attachment 28216\nPatch file generated by ant\n\nThis is a patch file generated by ant.\nThere are changes to two files, src/ooxml/java/org/apache/poi/openxml4j/opc/OPCPackage.java and src/ooxml/testcases/org/apache/poi/openxml4j/opc/compliance/TestOPCComplianceCoreProperties.java", "id": 153204, "time": "2012-01-27T05:32:19Z", "bug_id": 52540, "creation_time": "2012-01-27T05:32:19Z", "is_private": false}, {"count": 2, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "is_private": false, "id": 153213, "time": "2012-01-27T11:50:02Z", "bug_id": 52540, "creation_time": "2012-01-27T11:50:02Z", "text": "It'd be good to confirm that the first properties are the one to use, and not say the last one.\n\nFor one of these problem files, would it be possible for you to unzip the .docx file (it's a zip of XML files), and manually edit the XML for the 1st and 2nd core properties? Make some changes so that you can identify which one it's coming from, then zip up and load that file in word. Using Word 2008, 2011 and 2007, check which properties is actually seen by word.\n\nAssuming Mac and Windows see the same one, once we know which of the first or last is used, we can then apply your patch / tweak + apply it, and unit test as appropriate"}, {"count": 3, "tags": [], "creator": "gregg.morris@gmail.com", "attachment_id": null, "is_private": false, "id": 153223, "time": "2012-01-27T19:11:29Z", "bug_id": 52540, "creation_time": "2012-01-27T19:11:29Z", "text": "I tested both Word 2008 and 2011 for Mac (the only ones I have access to). In the docProps directory of the unzipped docx file, there is \"core.xml\" and \"core1.xml\". In both versions of Word, the \"core.xml\" is the \"current\" one. If I make changes via fie File -> Properties dialog, they appear in the \"core.xml\" file.\n\nInterestingly, the \"core1.xml\" file contains what looks like valid data, but it's \"old\". It appears to be from an earlier version of the document, maybe? I sure wish I knew how to tell my authors to avoid creating it!"}, {"count": 4, "tags": [], "creator": "dfisher@jmlafferty.com", "attachment_id": null, "text": "Are these versions original not updated releases of these files? If you are using templates were these created from the original release of Word 2011? If so, we did have some problems with PPTX when 2011 first came and Microsoft acknowledged the bug and made an update release one month later.", "id": 153226, "time": "2012-01-27T20:31:22Z", "bug_id": 52540, "creation_time": "2012-01-27T20:31:22Z", "is_private": false}, {"count": 5, "tags": [], "creator": "apache@gagravarr.org", "is_private": false, "text": "Fixed in r1237631, thanks. (I've tweaked some of the comments, logs and exceptions to make it clearer exactly what we're doing and why, and beefed up the tests a bit too)", "id": 153296, "time": "2012-01-30T13:00:48Z", "bug_id": 52540, "creation_time": "2012-01-30T13:00:48Z", "attachment_id": null}]