[{"count": 0, "tags": [], "bug_id": 52691, "attachment_id": null, "id": 153860, "time": "2012-02-17T08:12:26Z", "creator": "ebourg@apache.org", "creation_time": "2012-02-17T08:12:26Z", "is_private": false, "text": "The ClassFileSet doesn't retain classes used only in generic signatures. For example if the directory contains two classes Foo and Bar, Bar being only used in Foo as a return parameter such as List<Bar>, the dependency between Foo and Bar will be missed and only Foo will be retained.\n\n\nThis could be fixed by implementing org.apache.tools.ant.util.depend.AbstractAnalyzer with ASM instead of BCEL. The Maven Dependency Analyzer plugin has almost all of the code needed to do this task:\n\nhttp://maven.apache.org/shared/maven-dependency-analyzer/xref\n\nhttp://maven.apache.org/shared/maven-dependency-analyzer/xref/org/apache/maven/shared/dependency/analyzer/asm/ASMDependencyAnalyzer.html"}, {"count": 1, "tags": [], "creator": "mbenson@apache.org", "attachment_id": null, "id": 153872, "time": "2012-02-17T14:49:23Z", "bug_id": 52691, "creation_time": "2012-02-17T14:49:23Z", "is_private": false, "text": "An additional layer of indirection over ASM, such as Torsten Curdt's jdependency library, could make this even easier--this is what the maven-shade-plugin uses."}, {"count": 2, "tags": [], "bug_id": 52691, "attachment_id": null, "text": "I have an implementation based on the ASMDependencyAnalyzer from the maven-dependency-analyzer plugin. It works fine but only with classes from the file system, it doesn't support classes embedded in a jar like the current <classfileset>.\n\nIf the Ant team thinks it's the right direction I can refine the implementation and contribute a replacement of <classfileset> that's functionally equivalent.", "id": 153875, "time": "2012-02-17T15:02:35Z", "creator": "ebourg@apache.org", "creation_time": "2012-02-17T15:02:35Z", "is_private": false}, {"count": 3, "tags": [], "creator": "mbenson@apache.org", "attachment_id": null, "id": 153877, "time": "2012-02-17T15:21:05Z", "bug_id": 52691, "creation_time": "2012-02-17T15:21:05Z", "is_private": false, "text": "Emmanuel,\n  jdependency also didn't support class files in jars until recently, so  this functionality has yet to be released.  We could probably push Torsten for a new release if/when we want to use this.  You're free to rewrite and submit, certainly; I just hate to see anyone write when they can reuse.\n\nbr,\nMatt"}]