[{"count": 0, "tags": [], "bug_id": 52706, "attachment_id": 28353, "is_private": false, "id": 153921, "time": "2012-02-19T11:01:12Z", "creator": "vimilsaju@yahoo.com", "creation_time": "2012-02-19T11:01:12Z", "text": "Created attachment 28353\nA patch to implement the enhancement\n\nRight now Execute uses a static CommandLauncher instance which is\ninitialize inside the static initializer (\"class constructor\").\nCommandLauncher's responsibility is to create the Process instances.\n\nCurrently there isn't a way to make Execute use a different CommandLauncher\n\nI have attached a patch containing the changes I made to Execute java class. \nWhat I have basically done is move the code that initializes the CommandLauncher from the Execute class to to the CommandLauncher class. I have made CommandLauncher class public and all the subclasses of it public too.  I have added two static methods \ngetVMLauncher and getShellLauncher to the CommandLauncher class. These methods take a Project object as parameter and check if a reference to an existing CommandLauncher is present in the project. If present then that instance is returned. Otherwise the method checks if a system property containing the name of the launcher class has been set. If so then an instance of that class is created and returned, otherwise the default launcher is returned. I have also added setVMLauncher and setShellLauncher methods that add reference to a given CommandLauncher instance to the project. \n\nI have modified the Execute class to use these two methods to get the reference of the CommandLauncher class. I have also created a CommandLauncherTask class similar to the PropertyHelperTask that takes an instance of any CommandLauncher class and adds a reference to it to the project."}, {"count": 1, "tags": [], "bug_id": 52706, "attachment_id": null, "id": 159847, "time": "2012-06-09T17:53:18Z", "creator": "bodewig@apache.org", "creation_time": "2012-06-09T17:53:18Z", "is_private": false, "text": "Would it make sense to extract CommadLauncher into a separate class or do you need access to internals of Execute?\n\nOther than that the changes look good to me.\n\nFor the future, please provide a diff rather than complete classes since it helps with reviews and survives some code changes to the class in svn."}, {"count": 2, "tags": [], "bug_id": 52706, "attachment_id": null, "is_private": false, "id": 159871, "time": "2012-06-11T16:29:51Z", "creator": "vimilsaju@yahoo.com", "creation_time": "2012-06-11T16:29:51Z", "text": "I think CommandLauncher can be extracted to a new class. The CommandLauncher class accesses 'environmentCaseInSensitive' which is internal to Execute class, but that can be moved to a static constructor block within the Execute class itself. However the sub-classes of CommandLauncher class i.e PerlScriptCommandLauncher, ScriptCommandLauncher and VmsCommandLauncher access FILE_UTILS singleton which is internal to Execute, So I am wondering whether they should remain within the Execute class itself.\n\nI wanted to do a diff, but I couldn't find a suitable tool in windows that generates a diff? Do you know of any tool that would do that?"}, {"count": 3, "tags": [], "text": "(In reply to comment #2)\n\n> I think CommandLauncher can be extracted to a new class. The CommandLauncher\n> class accesses 'environmentCaseInSensitive' which is internal to Execute\n> class, but that can be moved to a static constructor block within the\n> Execute class itself.\n\nYes, sounds good.\n\n> However the sub-classes of CommandLauncher class i.e\n> PerlScriptCommandLauncher, ScriptCommandLauncher and VmsCommandLauncher\n> access FILE_UTILS singleton which is internal to Execute, So I am wondering\n> whether they should remain within the Execute class itself.\n\nThe FILE_UTILS is just a performance enhancement, it is backed by a Singleton instance in FileUtils so it wouldn't cause too much overhead to copy it around to each class (or add a protected one in CommandLauncher).\n\n> I wanted to do a diff, but I couldn't find a suitable tool in windows that\n> generates a diff? Do you know of any tool that would do that?\n\nSubversion ;-)\n\nsvn diff\n\ninside a working copy.", "is_private": false, "id": 159874, "creator": "bodewig@apache.org", "time": "2012-06-11T16:44:20Z", "bug_id": 52706, "creation_time": "2012-06-11T16:44:20Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 52706, "attachment_id": 28910, "is_private": false, "id": 159878, "time": "2012-06-11T17:57:14Z", "creator": "vimilsaju@yahoo.com", "creation_time": "2012-06-11T17:57:14Z", "text": "Created attachment 28910\npatch for 52706"}, {"count": 5, "tags": [], "creator": "vimilsaju@yahoo.com", "attachment_id": null, "id": 159879, "time": "2012-06-11T18:01:07Z", "bug_id": 52706, "creation_time": "2012-06-11T18:01:07Z", "is_private": false, "text": "(In reply to comment #3)\n> (In reply to comment #2)\n> \n> > I think CommandLauncher can be extracted to a new class. The CommandLauncher\n> > class accesses 'environmentCaseInSensitive' which is internal to Execute\n> > class, but that can be moved to a static constructor block within the\n> > Execute class itself.\n> \n> Yes, sounds good.\n\nI have extracted CommandLauncher, CommandLauncherProxy, Java13CommandLauncher, MacCommandLauncher, OS2CommandLauncher, PerlScriptCommandLauncher, ScriptCommandLauncher, VmsCommandLauncher and WinNTCommandLauncher to new classes under org.apache.tools.ant.taskdefs package.\n\nI faced a minor issue when extracting MacCommandLauncher, it was referring to 'antWorkingDirectory' String field in Execute class. I replaced that reference with System.getProperty(\"user.dir\")\n\n> \n> > However the sub-classes of CommandLauncher class i.e\n> > PerlScriptCommandLauncher, ScriptCommandLauncher and VmsCommandLauncher\n> > access FILE_UTILS singleton which is internal to Execute, So I am wondering\n> > whether they should remain within the Execute class itself.\n> \n> The FILE_UTILS is just a performance enhancement, it is backed by a\n> Singleton instance in FileUtils so it wouldn't cause too much overhead to\n> copy it around to each class (or add a protected one in CommandLauncher).\n> \nI've added FILE_UTILS as a static protected field in CommandLauncher.\n\n> > I wanted to do a diff, but I couldn't find a suitable tool in windows that\n> > generates a diff? Do you know of any tool that would do that?\n> \n> Subversion ;-)\n> \n> svn diff\n> \n> inside a working copy.\n\nI was able to use the svn diff tool :). It seems eclipse has built-in svn support and can generate patches.  I have attached the patch to this reply :)"}, {"count": 6, "attachment_id": null, "creator": "bodewig@apache.org", "is_private": false, "id": 159938, "time": "2012-06-13T04:39:10Z", "bug_id": 52706, "creation_time": "2012-06-13T04:39:10Z", "tags": [], "text": "Vimil, I'm working on your patch.  I want to move the launcher classes to a separate package (.... taskdefs.launcher), this is done in my working copy now.\n\nCurrently I'm fixing the style changes Eclipse has made to the Execute class so the diff becomes smaller.  I really don't want to play \"fetch me a rock\" so I'm doing this myself; will continue with this later today or tomorrow.\n\nIn the meantime, a test or two for the new task and docs would be great 8-)"}, {"count": 7, "text": "\n> Currently I'm fixing the style changes Eclipse has made to the Execute class\n> so the diff becomes smaller.  I really don't want to play \"fetch me a rock\"\n> so I'm doing this myself; will continue with this later today or tomorrow.\n> \n> In the meantime, a test or two for the new task and docs would be great 8-)\n\nSure I will work on writing tests and documentation for this enhancement.", "bug_id": 52706, "is_private": false, "id": 159974, "time": "2012-06-13T17:00:32Z", "creator": "vimilsaju@yahoo.com", "creation_time": "2012-06-13T17:00:32Z", "tags": [], "attachment_id": null}, {"text": "a slightly massaged version of your patch is in with svn revision 1350460", "tags": [], "bug_id": 52706, "is_private": false, "count": 8, "id": 160018, "time": "2012-06-15T04:29:00Z", "creator": "bodewig@apache.org", "creation_time": "2012-06-15T04:29:00Z", "attachment_id": null}, {"count": 9, "attachment_id": null, "creator": "bodewig@apache.org", "is_private": false, "id": 160019, "time": "2012-06-15T04:34:20Z", "bug_id": 52706, "creation_time": "2012-06-15T04:34:20Z", "tags": [], "text": "Sorry, forgot to save some files, the \"real\" revision is 1350461"}, {"count": 10, "tags": [], "bug_id": 52706, "attachment_id": null, "id": 160032, "time": "2012-06-15T16:06:30Z", "creator": "vimilsaju@yahoo.com", "creation_time": "2012-06-15T16:06:30Z", "is_private": false, "text": "(In reply to comment #9)\n> Sorry, forgot to save some files, the \"real\" revision is 1350461\n\nThanks for merging this patch into the trunk, the changes look good to me :)"}, {"count": 11, "tags": [], "bug_id": 52706, "attachment_id": null, "is_private": false, "id": 160115, "time": "2012-06-20T04:25:52Z", "creator": "bodewig@apache.org", "creation_time": "2012-06-20T04:25:52Z", "text": "We'd need a small manual page like we have for the other tasks and maybe a cross-reference to it from exec.\n\nAs tests I'd probably write an AntUnit test that builds a CommandLauncher which only echos a message and doesn't do anything else and then assert the message is there.\n\nThinking about it, would it be a good idea to have an option to reset the CommandLauncher to the default one if it has been changed?\n\nLet me know if you need any help."}, {"count": 12, "tags": [], "creator": "vimilsaju@yahoo.com", "text": "(In reply to comment #11)\n> We'd need a small manual page like we have for the other tasks and maybe a\n> cross-reference to it from exec.\n>\nI will work on that.\n \n> As tests I'd probably write an AntUnit test that builds a CommandLauncher\n> which only echos a message and doesn't do anything else and then assert the\n> message is there.\n\nI am not familiar with AntUnit but I can surely learn how it works :) I will let you know if I get stuck somewhere. \n \n> \n> Thinking about it, would it be a good idea to have an option to reset the\n> CommandLauncher to the default one if it has been changed?\n> \n> Let me know if you need any help.\n\nHow about an attribute called 'reset' for the CommandLauncherTask that removes the project reference and the system property if they are set?", "id": 160133, "time": "2012-06-20T12:38:19Z", "bug_id": 52706, "creation_time": "2012-06-20T12:38:19Z", "is_private": false, "attachment_id": null}, {"count": 13, "tags": [], "text": "Created attachment 28992\ncorrecting defaults.properties\n\nwhile writing the ant-unit test, I found there is a typo in defaults.properties for the commandlauncher task. It should be commandlauncher=org.apache.tools.ant.taskdefs.CommandLauncherTask\ninstead of \ncommandlaucher=org.apache.tools.ant.taskdefs.CommandLauncherTask", "is_private": false, "id": 160223, "creator": "vimilsaju@yahoo.com", "time": "2012-06-25T02:26:48Z", "bug_id": 52706, "creation_time": "2012-06-25T02:26:48Z", "attachment_id": 28992}, {"count": 14, "attachment_id": 28993, "creator": "vimilsaju@yahoo.com", "is_private": false, "id": 160224, "time": "2012-06-25T02:37:01Z", "bug_id": 52706, "creation_time": "2012-06-25T02:37:01Z", "tags": [], "text": "Created attachment 28993\ntest for commandlaunchertask"}, {"count": 15, "attachment_id": null, "creator": "bodewig@apache.org", "is_private": false, "id": 160254, "time": "2012-06-26T04:14:32Z", "bug_id": 52706, "creation_time": "2012-06-26T04:14:32Z", "tags": [], "text": "Great, thanks, patches applied with svn revision 1353811"}]