[{"count": 0, "tags": [], "creator": "psagar@zeomega.com", "attachment_id": null, "text": "OS      : Windows 2008 Server\nBrowser : IE 8 with all default settings\n\nIssues:\n\n1. We are seeing Javascripts, CSS, JSON contents(texts) in our web application  instead displaying an actual content. (not rendering html)\nWe tried looking into our application code just to make sure all our DOM structure and headers are loaded properly. Everything looks fine.\nFinally we had to look into Apache Error/Access logs to find any errors trace,\nWe got this - HTTP/1.1 200 in every lines which means all responses are completed without any errors.\n\n2. Sometimes when we try to login to our application through proper credentials, System will redirect us back to login screen which is not letting us to go inside the application. When we digged into this it pretty looks like the wrong response is being returned for a request.\n\nBoth the above issues will get resolved only when we restart the Apache services. But this is happening everyday. We are not getting any clue on identifying the root cause for this issue.\n\nPlease let me know if anything to be set in the configurations or anything to be modified in any of the modules.\n\nIs there any chance that issue only exists in 2.2.20? Reason is this was not happening when we were using 2.2.8 version.\n\nAppreciate your quick response on this.\n\nThanks,", "id": 153894, "time": "2012-02-17T20:54:26Z", "bug_id": 52700, "creation_time": "2012-02-17T20:54:26Z", "is_private": false}, {"count": 1, "text": "you'll need to describe your problem in terms of actual configurations and http responses.", "bug_id": 52700, "is_private": false, "id": 172531, "time": "2014-01-20T00:40:26Z", "creator": "covener@gmail.com", "creation_time": "2014-01-20T00:40:26Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "text": "Closing as in NEEDINFO for years and no sign of a real problem to follow up on. Please re-open if necessary (not for httpd 2.2.x because not supported anymore).\n\nThanks!", "id": 202235, "time": "2017-11-18T19:01:37Z", "bug_id": 52700, "creation_time": "2017-11-18T19:01:37Z", "is_private": false}]