[{"count": 0, "tags": [], "bug_id": 52724, "text": "The fix revision 730178 was aimed to remove an resource leak bug on the  FileInputStream object \"fis\" (created line 458), the Socket \"socket\" (created at line 477), \n\nthe OutputStream object \"stream\", and the FileInputStream object \"inputStream\" in the file \"/tomcat/tc7.0.x/trunk/java/org/apache/catalina/startup/Catalina.java\" , but \n\nit is incomplete. \n\nThere are some problems: \n1. the InputSource object \"is\" created at line 452 is not closed. \n2. when the statements at lines 455-457 throw some exception, the \"fis\" can not be closed as expected. \n3. when the statements at lines 480-483 throw some exception, the \"socket\" and the \"stream\" can not be closed as expected. \n4. when the statements at lines 574-576 throw some exception, the \"inputStream\" can not be closed as expected. \n\nThe best way to close such resource objects is putting such close operations in the finaly block of a try-catch-finally structure.", "id": 153970, "time": "2012-02-21T10:35:32Z", "creator": "lianggt08@sei.pku.edu.cn", "creation_time": "2012-02-21T10:35:32Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 52724, "is_private": false, "id": 154547, "time": "2012-03-05T20:12:51Z", "creator": "markt@apache.org", "creation_time": "2012-03-05T20:12:51Z", "tags": [], "text": "(In reply to comment #0)\nFor all of the cases raised (at least those that are valid) the JVM is about 10 lines away from shutting down which makes any possible resource leak pretty much irrelevant. This demonstrates the necessity of understanding the code before claiming that a critical bug exists.\n\nI was tempted to resolve this bug as INVALID but it is true that the code could be cleaner and that would prevent someone creating a duplicate (and similarly pointless) issue in the future.\n\nI have therefore changed this bug to an enhancement and cleaned up the code.\n\nResponding to the specific points:\n\n> 1. the InputSource object \"is\" created at line 452 is not closed. \n\nIt is an InputSource not an InputStream. There is no close() method.\n\n> 2. when the statements at lines 455-457 throw some exception, the \"fis\" can not\n> be closed as expected.\n\nAnd less than a second later the JVM shuts down. Not an issue. Cleaned up anyway.\n \n> 3. when the statements at lines 480-483 throw some exception, the \"socket\" and\n> the \"stream\" can not be closed as expected.\n\nNon-issue for the same reason as 2.\n \n> 4. when the statements at lines 574-576 throw some exception, the \"inputStream\"\n> can not be closed as expected.\n\nNon-issue for the same reason as 2.\n\nBefore raising a bug, especially a critical one, it is important to do sufficient research to be very sure of your ground. If someone can't be bothered to do the research to ensure a bug is valid, don't expect the Tomcat committers to bother to explain why they have closed a bug as INVALID."}]