[{"count": 0, "tags": [], "bug_id": 52751, "attachment_id": 28372, "is_private": false, "id": 154075, "time": "2012-02-23T17:34:32Z", "creator": "polina.genova@gmail.com", "creation_time": "2012-02-23T17:34:32Z", "text": "Created attachment 28372\nPatch in ErrorReportValve.java and docu page + 2 screenshots\n\nHi,\nHere's an enhancement patch for the system info displayed in the default error page and the way it is retrieved.  The patch makes it possible to reuse the value of the server header configuration if it is available. Thus the system information revealed in the server header and the default error page would be consistent and would be easier to maintain.  \nIt is known that system information disclosure is an easy to fix, yet serious security flaw as it opens the door to all attackers who wouldn’t resist exploiting  known vulnerabilities for the given system version. That’s why it is recommended (in all Tomcat security configuration guides) to customize both the server header and the server.info property. On the other hand, with this enhancement the protection from system information leakage can be done easier - with only one configuration and without worrying about the side effects of custom changes in the server.info property. \nExcept the patch there are also two screenshots attached: \n–Default error page when server header is configured\n-Default error page when server header is not configured\n\nBest Regards,\nPolina"}, {"count": 1, "tags": [], "bug_id": 52751, "attachment_id": 28372, "text": "Comment on attachment 28372\nPatch in ErrorReportValve.java and docu page + 2 screenshots\n\nCorrect patch MIME type so BZ doesn't try to display it.", "id": 155149, "time": "2012-03-20T21:54:42Z", "creator": "markt@apache.org", "creation_time": "2012-03-20T21:54:42Z", "is_private": false}, {"count": 2, "tags": [], "text": "It is very rare for an attacker to identify the specific Tomcat version and then target a known vulnerability. It is much more common to see every known vulnerability probed (for a range of servers) rather than the more targeted attack described in the patch. I therefore see little point in hiding the version number. I'd go further than that and say I would prefer to see the exact Tomcat version in the server header since it provides more assistance to debugging/monitoring efforts than it does harm.\n\nEven if the version number is hidden there are plenty of other clues to the exact version number, particularly the line numbers in any stack trace.\n\nRather than address this specific issue, I'd prefer to see a general solution to bug 41007 that allowed custom error pages to be specified without having to write a custom valve.", "is_private": false, "id": 155151, "creator": "markt@apache.org", "time": "2012-03-20T22:11:07Z", "bug_id": 52751, "creation_time": "2012-03-20T22:11:07Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "violetagg@apache.org", "is_private": false, "text": "Hi,\n\nI agreed with your points.\n\nUnfortunately in some installation scenarios we do not have either access to the jar files or permissions to restart the system in order to configure the default error page footer, manipulating directly the jar file. \n\nWith this small improvement Tomcat will provide convenient way for configuring default error page footer not only through the server.xml but also during runtime using provided Connectors MBeans.\n\nWhat do you think?\n\nRegards\nVioleta Georgieva", "id": 155193, "time": "2012-03-21T20:23:15Z", "bug_id": 52751, "creation_time": "2012-03-21T20:23:15Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 52751, "text": "Comment on attachment 28372\nPatch in ErrorReportValve.java and docu page + 2 screenshots\n\nCorrected patch MIME type", "id": 155194, "time": "2012-03-21T20:25:11Z", "creator": "violetagg@apache.org", "creation_time": "2012-03-21T20:25:11Z", "is_private": false, "attachment_id": 28372}, {"count": 5, "tags": [], "text": "I am OK with the patch, but there is a problem: it would not work if Tomcat is accessed through AJP protocol.  The patch relies on the use of AbstractHttp11Protocol to get the \"server\" setting.\n\nMaybe the \"server\" attribute should be exposed through AbstractProtocol or Endpoint or elsewhere.\n\nI had a fear that the default value of \"server\" attribute which is documented to be \"Apache-Coyote/1.1\" will be visible here. Actually it should not be the case here. The \"Apache-Coyote/1.1\" string (aka Constants.SERVER_BYTES) is used by AbstractHttp11Processor only if the server attribute is null.\n\n\n> I would prefer to see the exact Tomcat version in the server header\n\n+1.\n\nI wonder though how coyote can get Tomcat version. Wouldn't that add an unwanted dependency between components.\n\n\n> particularly the line numbers in any stack trace.\n\nThe stack traces can be hidden. Most error pages do not display them. One can configure a custom error page for error 500.\n\n> manipulating directly the jar file.\n\nNote, that there is no need to manipulate the jar file! One can create the following file:\nCATALINA_BASE/lib/org/apache/catalina/util/ServerInfo.properties\n\n(I thought it is mentioned in the FAQ, but cannot find it at this moment). It is written here:\nhttp://tomcat.apache.org/tomcat-7.0-doc/security-howto.html#Valves", "attachment_id": null, "id": 155221, "creator": "knst.kolinko@gmail.com", "time": "2012-03-22T13:22:16Z", "bug_id": 52751, "creation_time": "2012-03-22T13:22:16Z", "is_private": false}, {"count": 6, "tags": [], "creator": "violetagg@apache.org", "attachment_id": null, "text": "(In reply to comment #5)\n> Maybe the \"server\" attribute should be exposed through AbstractProtocol or\n> Endpoint or elsewhere.\n\nI'll check that.\n\n> Note, that there is no need to manipulate the jar file! One can create the\n> following file:\n> CATALINA_BASE/lib/org/apache/catalina/util/ServerInfo.properties\n\nUnforutnately it is not so easy for us. We (Eclipse Virgo) are embeding Tomcat. Classloaders are a bit different in OSGi environment.", "id": 155223, "time": "2012-03-22T13:37:42Z", "bug_id": 52751, "creation_time": "2012-03-22T13:37:42Z", "is_private": false}, {"count": 7, "tags": [], "creator": "polina.genova@gmail.com", "attachment_id": null, "text": "(In reply to comment #6)\n> (In reply to comment #5)\n> > Maybe the \"server\" attribute should be exposed through AbstractProtocol or\n> > Endpoint or elsewhere.\n> I'll check that.\n\nThanks for the hint!\n\nIndeed using\n    server = ((AbstractAjpProtocol) response.getConnector().getProtocolHandler()).getProperty(\"server\") \nwill right away do the job in the case of AJP connector (if there is server attribute configured for it).\n\nThe problem is that the server attribute is currently not explicitly handled for the AJP connector (unlike the HttpConnecor), meaning this attribute is not documented and its value is not read or used anywhere in the AJP connector implementation. \nDo you think we should revise this behavior and add server attribute handling for the AJP connector?", "id": 157944, "time": "2012-04-11T14:41:25Z", "bug_id": 52751, "creation_time": "2012-04-11T14:41:25Z", "is_private": false}, {"count": 8, "tags": [], "creator": "polina.genova@gmail.com", "is_private": false, "text": "Hi,\n\nWhat do you think of my previous comment – in this case should I provide server attribute handling for the AJP connector in addition to the given patch?\n\nI’m looking forward hearing from you, whatever the outcome is. \n\nThanks in advance,\nPolina", "id": 158774, "time": "2012-05-03T08:27:50Z", "bug_id": 52751, "creation_time": "2012-05-03T08:27:50Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 52751, "attachment_id": null, "text": "Hi Polina,\n\nCheck Bug 56383.\nDo you think that the enhancement solves your use case?\n\nRegards\nVioleta", "id": 174874, "time": "2014-04-25T11:19:26Z", "creator": "violetagg@apache.org", "creation_time": "2014-04-25T11:19:26Z", "is_private": false}, {"count": 10, "tags": [], "bug_id": 52751, "attachment_id": null, "id": 175105, "time": "2014-05-08T08:58:24Z", "creator": "polina.genova@gmail.com", "creation_time": "2014-05-08T08:58:24Z", "is_private": false, "text": "Hi Violeta, \n\nYes, the given solution perfectly solves my use case.\n\nThanks and regards,\nPolina"}, {"count": 11, "tags": [], "bug_id": 52751, "attachment_id": null, "text": "Ok \nThanks\n\nVioleta\n\n*** This bug has been marked as a duplicate of bug 56383 ***", "id": 175107, "time": "2014-05-08T11:32:27Z", "creator": "violetagg@apache.org", "creation_time": "2014-05-08T11:32:27Z", "is_private": false}]