[{"count": 0, "tags": [], "bug_id": 52765, "is_private": false, "id": 154132, "creation_time": "2012-02-25T03:25:57Z", "time": "2012-02-25T03:25:57Z", "creator": "charles.c.strahan@gmail.com", "text": "There are a couple aspects of this problem for me to address, so here we go. This report is based on the latest trunk of Chainsaw as of earlier today (should be revision 1178454), on Ubuntu 11.04.\n\nFirst of all, the old 2006 binary (found here: http://logging.apache.org/chainsaw/download.html) is capable of detecting appenders registered with a type of _log4j._tcp.local. This is no longer so in the latest revision (although it doesn't really hold me back, personally). I think (per this ticket: https://issues.apache.org/bugzilla/show_bug.cgi?id=48907) that _log4j._tcp.local. was supposed to be supported for backwards compatibility with the ZeroConfSocketHubAppender.\n\nSecondly, I don't think that the ZONEs are formatted correctly for the other appenders/receivers, nor in ZeroConfPlugin.java. For example, I believe that this:\n\n_log4j_xml_udp_appender.local.\n\nshould be:\n\n_log4j_xml_udp_appender._udp.local.\n\nNote the missing `._udp'. I'm not terribly familiar with ZeroConf/mDNS/Bonjour/whatever, but I do believe that the protocol (tcp or udp) is required as part of the registration. Concretely, if I make the suggested change and then try the following ruby code, the appender is correctly configured in Chainsaw:\n\n  require 'dnssd'\n  \n  name = \"My log4j appender\"\n  type = \"_log4j_xml_udp_appender._udp\"\n  domain = nil\n  port = 3689\n  \n  DNSSD.register(name, type, domain, port)\n  \n  puts \"Press enter to exit . . .\"\n  gets\n\n\nIf I wasn't clueless about Java development, I'd give fixing this a shot...\n\n-Charles", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 52765, "attachment_id": null, "text": "All of the network appenders and receiver now can advertise via Multicast DNS (which isn't as restrictive when it comes to advertised names as Bounjour) via a setting in the configuration, so the ZeroConf sockethub appender is no longer necessary.\n\nI don't mind making the change to be consistent with Bounjour naming requirements - it isn't technically required -advertising and discovery works fine with appenders and Chainsaw - but if others have tools which use Bonjour, I don't mind adding the protocol into the names.", "id": 154151, "time": "2012-02-25T21:49:51Z", "creator": "sdeboy@iname.com", "creation_time": "2012-02-25T21:49:51Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 52765, "is_private": false, "id": 154153, "time": "2012-02-25T22:10:27Z", "creator": "sdeboy@iname.com", "creation_time": "2012-02-25T22:10:27Z", "tags": [], "text": "I think I'll just make the multicast dns names configurable (with a reasonable default)."}, {"count": 3, "tags": [], "creator": "charles.c.strahan@gmail.com", "attachment_id": null, "id": 154303, "time": "2012-02-28T03:58:31Z", "bug_id": 52765, "creation_time": "2012-02-28T03:58:31Z", "is_private": false, "text": "Hey Scott,\n\nI see - so it isn't that Chainsaw has any problems, it's just that my Ruby library implements Bonjour as opposed to mDNS, which means I have to specify a protocol (TCP or UDP)... and Chainsaw isn't expecting that.\n\nPerhaps Chainsaw could support both the less restrictive names _and_ the the names + protocol, if that wouldn't be impractical and/or a pain in the ass.\n\nIf you're curious, I thought it would be nice to have Chainsaw to view my Rails logs (I already implemented the appropriate XML formatting in Log4r a while back). In fact, I thought it would be cool to be able to share a snippet of code with some of my buddies that would handle both the broadcasting of log messages _and_ the mDNS/Bondjour registration, so they could leverage the awesomeness that is Chainsaw without having to bother with manually configuring both ends.\n\n\nMy apologies for taking so long to reply - I just moved 1000 miles from Dallas, TX to Washington, DC. Thanks for your help!\n\n-Charles"}, {"count": 4, "tags": [], "bug_id": 52765, "attachment_id": null, "id": 154305, "time": "2012-02-28T06:12:06Z", "creator": "sdeboy@iname.com", "creation_time": "2012-02-28T06:12:06Z", "is_private": false, "text": "I think it'll be fine to just use bonjour style names.  I'm not sure supporting configurable names would be useful - if someone requests it I'll add it in the future.  This will require an update to log4j itself partially (at least the core socket appenders) as well as Chainsaw.  I'll see if I can get a commit in sometime this week..\n\nBy the way, if you feel like trying out the latest developer snapshot of Chainsaw is available at http://people.apache.org/~sdeboy - there are a ton of new features.\n\n(feedback always welcome)\n\nScott"}]