[{"count": 0, "tags": [], "text": "Under parallel deployment, when an older version in an application has zero sessions, shut it down automatically to release tomcat and JVM resources.\n\nChristopher Schultz suggested these approaches might be possible (on the Tomcat user list):\n\n1. Modify the parallel deployment code to register an MBean\nNotificationListener that filters for useful events (such as expiring\nsession notifications on the outgoing webapp).\n\n2. When the listener receives a notification, check the current state\n(e.g. session count=0; or, I suppose you could make this a part of\nyour filter in step #1). If session count = 0, start a new thread that\nstops the outgoing webapp and de-registers the listener.\n\nOr.\n\n1. Install a SessionEventListener that counts-down the sessions\n(you'll have to get the count from JMX, I suppose) until they equal 0,\nthen starts a new thread that ... etc.\n\nOr.\n\n1. Install a Timer thread that polls at intervals (1 minute?) to see\nif all the sessions are dead and then starts a thread ... etc.\n\nThe first idea seems the cleanest, though Tomcat might not actually\nfire MBean events for things like session count changing.", "attachment_id": null, "bug_id": 52777, "id": 154270, "time": "2012-02-27T03:30:27Z", "creator": "amaniatis@apache.org", "creation_time": "2012-02-27T03:30:27Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 155150, "time": "2012-03-20T22:02:02Z", "bug_id": 52777, "creation_time": "2012-03-20T22:02:02Z", "is_private": false, "text": "A variation of the last approach would be to get the auto deployment code to check the current session count for old context versions and undeploy them once the count is zero."}, {"count": 2, "tags": [], "creator": "markt@apache.org", "text": "This has been implemented in trunk and 7.0.x and will be included in 7.0.31 onwards. It is optional and controlled by a new attribute (undeployOldVersions) on the Host.", "id": 162028, "time": "2012-09-08T21:12:42Z", "bug_id": 52777, "creation_time": "2012-09-08T21:12:42Z", "is_private": false, "attachment_id": null}]