[{"count": 0, "tags": [], "creator": "smadden@vocera.com", "attachment_id": 28399, "id": 154340, "time": "2012-02-28T19:40:35Z", "bug_id": 52791, "creation_time": "2012-02-28T19:40:35Z", "is_private": false, "text": "Created attachment 28399\npatch for the tomcat install project file\n\nHi,\n\nI attached a patch for the tomcat nsis installer that enables the installer to read it's default values from an ini file (config.ini) instead of using the in script defined onces. If the ini file does not exist, the script values are used. The same happens if the ini file exists, but a value is not defined. E.g. maybe you want to go with all of the script defined values but one or so. Please look at the attached diff. \n\nThis is how a sample config.ini file would look like (filename must be config.ini and reside in $EXEDIR)\n\n---------------\nconfig.ini:\n---------------\n\nTomcatPortHttp=80\nTomcatMenuEntriesEnable=1\nTomcatShortcutAllUsers=1\nTomcatAdminEnable=1\n\n---------------\n\n\nIt would be great if this enhancement could be merged into the next installer :-)\n\nThanks!\nSandra"}, {"count": 1, "tags": [], "creator": "smadden@vocera.com", "attachment_id": 28400, "text": "Created attachment 28400\nsample config.ini.", "id": 154341, "time": "2012-02-28T19:42:31Z", "bug_id": 52791, "creation_time": "2012-02-28T19:42:31Z", "is_private": false}, {"count": 2, "tags": [], "text": "-1 for hard-coded filename of \"config.ini\".\n\nIMHO the name of the answer file should be passed on the command line. If no name is given then there should be no attempts to open and read the file.\n\n\n(Is is possible to read the file just once, instead of re-opening and re-scanning it for each config option?  It is not as bad if this behaviour is off by default. it is just that it does not scale well.  Maybe read the file into memory and do string scans there?)\n\nThe names: _Call, _String, _Result, _Default -- are you sure that they are unique? They look like polluting the name space.", "attachment_id": null, "id": 157117, "creator": "knst.kolinko@gmail.com", "time": "2012-04-03T20:40:29Z", "bug_id": 52791, "creation_time": "2012-04-03T20:40:29Z", "is_private": false}, {"count": 3, "tags": [], "creator": "smadden@vocera.com", "is_private": false, "text": "Created attachment 28543\nRev2 of the patch to add config file support. Incorporated changes suggested by Konstantin Kolinko\n\nThanks for the constructive feedback Konstantin. I changed the patch to only read the ini file when it is passed in on the cmdline as /C=<fully qualified path to filename>.\n\nI also improved the way the macro/function hybrid to read the values is written. I initially based it on sample code I found online, but now cleaned it all up to have less clutter and match the needs of the tomcat installer better. \n\nThe patch is still not reading in the config file at once and parse it from memory. I wanted to keep using the established macro ${ConfigRead} instead of writing something new to minimize possible introduction of bugs.\n\n-Sandra", "id": 157167, "time": "2012-04-04T18:58:31Z", "bug_id": 52791, "creation_time": "2012-04-04T18:58:31Z", "attachment_id": 28543}, {"count": 4, "tags": [], "text": "Apologies it has taken so long to get back to this and belated thanks for the updated patch.\n\nSince installation is (broadly) a one time event, I'm not to concerned about multiple reads of the config file.\n\nFixed in:\n- trunk for 9.0.0.M24 onwards\n- 8.5.x for 8.5.18 onwards\n- 8.0.x for 8.0.46 onwards\n- 7.0.x for 7.0.80 onwards\n\nThanks again.", "attachment_id": null, "id": 199551, "creator": "markt@apache.org", "time": "2017-07-04T14:19:15Z", "bug_id": 52791, "creation_time": "2017-07-04T14:19:15Z", "is_private": false}]