[{"count": 0, "text": "I am using POI's HSSF to read data from an MS excel sheet. I also use log4j in my project for logging. Here is what I do in my project:\n1. Initialize logging (log level is set to INFO in log4j.properties)\n2. Do stuff: log.info works fine here\n3. Read an excel sheet using HSSF\n4. Do stuff: log.info doesn't show output, log.warn & log.error work fine however\n\nBy reinitializing logging (reexecuting step 1 above) after step 3, log.info works fine again.\n\nThis issue is observed in build 1.7 (poi-3.7-20101029.jar) and also in the latest 1.8 beta (poi-3.8-beta5-20111217.jar).", "bug_id": 52808, "attachment_id": null, "id": 154419, "time": "2012-03-02T05:38:55Z", "creator": "srihari.ravi@gmail.com", "creation_time": "2012-03-02T05:38:55Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "yegor@dinom.ru", "attachment_id": null, "is_private": false, "id": 154430, "time": "2012-03-02T12:36:01Z", "bug_id": 52808, "creation_time": "2012-03-02T12:36:01Z", "text": "I can't reproduce it. Can you narrow it down to a simple isolated test so that we can confirm the problem? \n\nPOI does not use the log4j framework directly but can be configured to delegate logging to log4j via Apache Commons Logging. Did you set it so ? Even if you did, I don't see how it can interfere with existing log4j setup.\n\nCheck that you don't have multiple log4.properties in the classpath. \n\nTry to track the code that resets log4. The simplest way is to set a breakpoint inside log4 and see what place is actually calling it. I will very surprised if it is POI.\n\nYegor"}, {"text": "Yeah, I tried again with a simple project without any complexity. I did not see the issue.\n\nIn the earlier project I used this, there was another application (using log4j) JAR being used. It is a bit strange, but the logging level gets reset to this other application's log level only after HSSF code is invoked. I will debug further and let you know if I feel it is a bug with HSSF. I am closing this bug.\n\nThanks!", "tags": [], "bug_id": 52808, "attachment_id": null, "count": 2, "id": 154526, "time": "2012-03-05T05:26:58Z", "creator": "srihari.ravi@gmail.com", "creation_time": "2012-03-05T05:26:58Z", "is_private": false}]