[{"count": 0, "tags": [], "bug_id": 52803, "is_private": false, "id": 154402, "attachment_id": null, "creator": "pandorino.mdg@tiscalinet.it", "creation_time": "2012-03-01T16:54:40Z", "time": "2012-03-01T16:54:40Z", "text": ""}, {"attachment_id": null, "tags": [], "bug_id": 52803, "is_private": false, "count": 1, "id": 154403, "time": "2012-03-01T17:01:20Z", "creator": "pandorino.mdg@tiscalinet.it", "creation_time": "2012-03-01T17:01:20Z", "text": "Hi, \nI do not know if it is the right behavior or not, however\nwhen I set a value for the loop count in the thread group, I expect that the whole thread-group is executed and then repeated the nr. of time set in the loop count.\nInstead it happens that the nr. of \"threads\" in the thread-group is repeated.\nFor example:\nNr. Of Thread=10\nRamp-Up=10\nLoop count=2\nI expect that the whole test-case lasts 20 seconds more or less, starting one thread each second.\nInstead the whole test-case lasts 10 seconds, and 2 threads are started each seconds, like having configured the group as\nNr. Of Thread=20\nRamp-Up=10\nLoop count = 1\n\nPlease clarify.\nThanks"}, {"count": 2, "attachment_id": null, "bug_id": 52803, "text": "Bugzilla is not a support forum.\nPlease ask your question on JMeter User mailing list.", "id": 154405, "time": "2012-03-01T17:05:52Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-03-01T17:05:52Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "pandorino.mdg@tiscalinet.it", "is_private": false, "text": "Hi\nI was not requesting a support, I was reporting a strange behavior of  the loop count that for me is a bug.  But maybe in the mind of who created jmeter is not a bug.  But only who created this can answer to my question and confirm or not my expectation.  And generally who creates a program works also in fixing the bugs.\nAnyway, sorry if this has irritated you, I will address the question to the user forum.\nThanks", "id": 154409, "time": "2012-03-01T17:37:49Z", "bug_id": 52803, "creation_time": "2012-03-01T17:37:49Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 52803, "text": "Hello,\nMaybe my answer was a bit rude, in fact it's the standard answer when bug seems more like a question.\n\nI was not irritated at all.\n\nTo answer your question although it's not the place, unless I misunderstood your configuration:\n- If your test executes in around 10s it is not really an issue because I your loop takes less than one sec to execute (Loop count set to 2 will take 2s), then there is a big chance that 8 threads of the 10 have finished their job at the 10th sec, so your test will last around 12s or less depending on the time taken by one iteration.\n\n\nIf I misunderstood and you really see something weird, then please attach a simplified test plan showing your issue.\n\nRegards\nPhilippe", "id": 154411, "time": "2012-03-01T18:14:00Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-03-01T18:14:00Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "pandorino.mdg@tiscalinet.it", "is_private": false, "text": "Created attachment 28409\ntest-case", "id": 154421, "time": "2012-03-02T08:46:51Z", "bug_id": 52803, "creation_time": "2012-03-02T08:46:51Z", "attachment_id": 28409}, {"count": 6, "tags": [], "bug_id": 52803, "text": "That's fine, no problem.\nWell, my test-case is very simple: I have created a thread group which inside has a simple http-request to http://myserver/.\n\nI wanted just to verify how the combination of the three parameters Nr-of-threads, ramp-up and loop-count worked.\n\nSo in the first simulation I set:\nnr-of-threads: 5\nramp-up: 5\nloop-count: 1\n\nAfter having read the manual, I expected that jmeter launched 1 thread each second. And infact this is what I found in my Apache-log:\n[02/Mar/2012:09:40:59 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:00 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:01 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:02 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:03 +0100] \"GET / HTTP/1.1\" 404 -\n\nThen I set:\nnr-of-threads: 5\nramp-up: 5\nloop-count: 2\n\nI expected that jmeter launched 1 thread each second. After finishing the first set of launches, it had to restart again with 1 thread each second.  So, at the very minimum, the total duration of the test-case had to be more or less 10 seconds (ramp-up multitpled by loop-count).\nInstead this is what I found in my apache-log:\n[02/Mar/2012:09:41:46 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:46 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:47 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:47 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:48 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:48 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:49 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:49 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:50 +0100] \"GET / HTTP/1.1\" 404 -\n[02/Mar/2012:09:41:50 +0100] \"GET / HTTP/1.1\" 404 -\n\nBasically it has launched 2 threads each seconds, which is a bit different from the explanation of loop-count in the manual:\n------------------\nNumber of times to perform the test case. Alternatively, \"forever\" can be selected causing the test to run until manually stopped.\n------------------\nI interpret that definition as \"the number of times running the thread-group\" (the loop-count definition is referred to the test-case, not to the single thread).\n\nBasically I expected that it launches one thread each second in the first 5-seconds timeframe (the 1st loop), and then launches again one thread each second in the second 5-seconds timeframe (the 2nd loop).\n\nApparently, the simulation with \nnr-of-threads: 5\nramp-up: 5\nloop-count: 2\n\nseems identical to the simulation with\nnr-of-threads: 10\nramp-up: 5\nloop-count: 1\n\nwhen in my opinion they should be instead different.\nThat's why I consider this a bug.\n\nRegards", "id": 154422, "time": "2012-03-02T09:19:20Z", "creator": "pandorino.mdg@tiscalinet.it", "creation_time": "2012-03-02T09:19:20Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 52803, "text": "Hello,\nI think you misunderstand how JMeter works.\nYou should really ask your question on User mailing list, I can confirm there is no bug.\n\nFirst look at your Apache logs, your request returns 404, so there is a big chance request time will be of few milliseconds\n\nThen If you set nb of threads to 5 : JMeter will only launch 5 threads\nThese threads will execute the number of loop count you set\nAnd finally rampup will control how threads are created.\n\nSo what you think is a creation of 2 threads each sec is in fact the creation of 1 thread which launches 2 requests (as loop count is 2 and you didn't set any pause time and request is very fast as 404) so big chance your test will end in around 5 sec if 5 threads and 2 loop counts.\nand end in 10s if nb Threads is 10 with ramp up of 10s.\n\nSo now I can confirm there is no bug at all.", "id": 154423, "time": "2012-03-02T10:20:07Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-03-02T10:20:07Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "text": "Dear Philip\nI know that the output is HTTP-404, the web-server is in place just to accept request and track the log, nothing else.\nBut the point is not the time the HTTP request takes to be completed, the point is the concept about how the three parameters are combined.\n\nYou said:\n---\nJMeter will only launch 5 threads\nThese threads will execute the number of loop count you set\nAnd finally rampup will control how threads are created.\n---\n\nThis was not my understanding of the concept of the loop count, that's why I was thinking about a bug.  As I said before, the definition of loop count in the manual is \"Number of times to perform the test case\".\nFor me this means \"Number of times to perform the thread-group\", not the nr. of times to perform each single thread.  But this last statement is exactly what you said, and in my opinion is different from what the manual says.\n\nSo, in my understanding, the loop-count should have been applied to the entire thread-group, in your explanation the loop-count is instead applied to each single thread.\nSaying that, if the right definition of the loop-count is the one you said, what I see in the apache-log is now right and I agree with you now it is not a bug.\n\nBut you can convene with me that probably the concept of the loop count is misleading, the reason for which I was thinking to a bug.\n\nSo, thanks for having dedicated your time to this brainstorming even if in the wrong place.\nBut I'm curious, so I will surely address the point to the mailing-list, and maybe request an enhancement in the future, who never knows :-)\n\nRegards\nMauro", "is_private": false, "id": 154424, "creator": "pandorino.mdg@tiscalinet.it", "time": "2012-03-02T11:28:42Z", "bug_id": 52803, "creation_time": "2012-03-02T11:28:42Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 52803, "text": "(In reply to comment #8)\n> Dear Philip\n> I know that the output is HTTP-404, the web-server is in place just to accept\n> request and track the log, nothing else.\n> But the point is not the time the HTTP request takes to be completed, the point\n> is the concept about how the three parameters are combined.\n> \n> You said:\n> ---\n> JMeter will only launch 5 threads\n> These threads will execute the number of loop count you set\n> And finally rampup will control how threads are created.\n> ---\n> \n> This was not my understanding of the concept of the loop count, that's why I\n> was thinking about a bug.  As I said before, the definition of loop count in\n> the manual is \"Number of times to perform the test case\".\n> For me this means \"Number of times to perform the thread-group\", not the nr. of\n> times to perform each single thread.  But this last statement is exactly what\n> you said, and in my opinion is different from what the manual says.\n> \n> So, in my understanding, the loop-count should have been applied to the entire\n> thread-group, in your explanation the loop-count is instead applied to each\n> single thread.\nIt applies to the Thread group. But in your particular Test case as there is only one Request and nothing else it's as if only the request was executed number of loop.\n\n> Saying that, if the right definition of the loop-count is the one you said,\n> what I see in the apache-log is now right and I agree with you now it is not a\n> bug.\n> \nThe definition is the one you give and what happens is what I described\n\n> But you can convene with me that probably the concept of the loop count is\n> misleading, the reason for which I was thinking to a bug.\nNo it is not.\n> \n> So, thanks for having dedicated your time to this brainstorming even if in the\n> wrong place.\n> But I'm curious, so I will surely address the point to the mailing-list, and\n> maybe request an enhancement in the future, who never knows :-)\n> \n> Regards\n> Mauro", "id": 154425, "time": "2012-03-02T11:49:39Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-03-02T11:49:39Z", "is_private": false, "attachment_id": null}, {"count": 10, "tags": [], "text": "(In reply to comment #9)\n> (In reply to comment #8)\n> > Dear Philip\n> > I know that the output is HTTP-404, the web-server is in place just to accept\n> > request and track the log, nothing else.\n> > But the point is not the time the HTTP request takes to be completed, the point\n> > is the concept about how the three parameters are combined.\n> > \n> > You said:\n> > ---\n> > JMeter will only launch 5 threads\n> > These threads will execute the number of loop count you set\n> > And finally rampup will control how threads are created.\n> > ---\n> > \n> > This was not my understanding of the concept of the loop count, that's why I\n> > was thinking about a bug.  As I said before, the definition of loop count in\n> > the manual is \"Number of times to perform the test case\".\n> > For me this means \"Number of times to perform the thread-group\", not the nr. of\n> > times to perform each single thread.  But this last statement is exactly what\n> > you said, and in my opinion is different from what the manual says.\n> > \n> > So, in my understanding, the loop-count should have been applied to the entire\n> > thread-group, in your explanation the loop-count is instead applied to each\n> > single thread.\n> It applies to the Thread group. But in your particular Test case as there is\n> only one Request and nothing else it's as if only the request was executed\n> number of loop.\n> \n> > Saying that, if the right definition of the loop-count is the one you said,\n> > what I see in the apache-log is now right and I agree with you now it is not a\n> > bug.\n> > \n> The definition is the one you give and what happens is what I described\n> \n> > But you can convene with me that probably the concept of the loop count is\n> > misleading, the reason for which I was thinking to a bug.\n> No it is not.\n> > \n> > So, thanks for having dedicated your time to this brainstorming even if in the\n> > wrong place.\n> > But I'm curious, so I will surely address the point to the mailing-list, and\n> > maybe request an enhancement in the future, who never knows :-)\n> > \n> > Regards\n> > Mauro\n\n\nTo be clear a Thread Group is a number of thread to launch and that will execute the content of the Thread Group.\nEach thread inside this TG will execute the content the number of loop you set.\nAnd thread will start in the interval you set in Rampup.", "is_private": false, "id": 154426, "creator": "p.mouawad@ubik-ingenierie.com", "time": "2012-03-02T11:52:00Z", "bug_id": 52803, "creation_time": "2012-03-02T11:52:00Z", "attachment_id": null}, {"count": 11, "tags": [], "creator": "pandorino.mdg@tiscalinet.it", "is_private": false, "text": ">> It applies to the Thread group.\nSorry, maybe we have a different way of understanding the concept of a thread-group and test-case: you apply the loop-count to each thread in the thread-group.  You have clarified it better in the next sentence:\n\n>> Each thread inside this TG will execute the content the number of loop you set. And thread will start in the interval you set in Rampup.\n\nMy understanding of the loop-count instead was that it had to be applied to the thread-group as unique entity. JMETER execute the whole thread group the nr. of loop counts specified.  As consequence of my interpretation, having a configuration of\nnr-of-threads: 5\nramp-up: 5\nloop-count: 2\nwould result in 10 threads launched in more or less 10 seconds.  That does not mean to finish in 10 seconds, but to be launched in 10 seconds.\n\nThen we may argue if the definition in the manual is right or not.  For me, not :-), does not reflect what you clearly explained.\n\nRegards\nMauro", "id": 154427, "time": "2012-03-02T12:08:02Z", "bug_id": 52803, "creation_time": "2012-03-02T12:08:02Z", "attachment_id": null}]