[{"count": 0, "tags": [], "creator": "immanuel.hayden@gmail.com", "attachment_id": 28413, "is_private": false, "id": 154452, "time": "2012-03-02T19:32:38Z", "bug_id": 52814, "creation_time": "2012-03-02T19:32:38Z", "text": "Created attachment 28413\nmore typesafety proposal patch\n\nHi all!\n\nAfter finally managing to set up jmeter in eclipse (don't ask, my work eclipse setup is really messed up) I played around a little bit and noticed quite a bunch of warnings regarding type safety and generics (mostly for gui elements such as jcomboboxes and so on) ... so I fixed them ... and attached a patch ... the only changes are adding the generics and rewrite some (String[])asdf.toArray() into asdf.toArray(new String[0]) ;)\n\n\nTAKE NOTE that there are still two files with warnings left (at least here):\n- [...]protocol.http.util.WSDLHelper: the warning says the \"idx++\" in line 145 is useless (though I'm pretty sure it is not ;))\n- [...]testbeans.gui.ComboStringEditor: once we insert these UniqueObjects into the list and the other time just strings ... didn't feel comfortable to meddle with that yet ;)\n\n\nBEWARE: I didn't really much test what I did there, just check that it compiles and click around in the interface a bit after that, but as the job of generics is to provide compile-time safety it should have no impact anyhow."}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 154453, "time": "2012-03-02T19:47:47Z", "bug_id": 52814, "creation_time": "2012-03-02T19:47:47Z", "is_private": false, "text": "Thanks Immanuel, but It would be better to test the submitted patch and ensure that you enter in debug into each modified line.\n\nRegards\nPhilippe"}, {"count": 2, "text": "What compiler version are you using?\n\nI don't see the same errors in Eclipse, and I just checked that JComboBox is not generic in Java 5 (which is what JMeter currently targets) or indeed in Java 6.", "bug_id": 52814, "is_private": false, "id": 154454, "time": "2012-03-02T20:08:41Z", "creator": "sebb@apache.org", "creation_time": "2012-03-02T20:08:41Z", "tags": [], "attachment_id": null}, {"count": 3, "tags": [], "creator": "immanuel.hayden@gmail.com", "attachment_id": null, "is_private": false, "id": 154472, "time": "2012-03-03T09:03:19Z", "bug_id": 52814, "creation_time": "2012-03-03T09:03:19Z", "text": "@Sebb: jdk7u3, but tried both the compliance levels 1.5 and 1.6 and still see the same warnings. Maybe you have that specific warning disabled in eclipse? Mine is set to the default settings ...\n\n@Philippe: will see what I can do (but will have to understand where what is used first ;)) Generally adding the wrong specific types instead of the raw types should result in compile time errors as the whole purpose is that the compiler can check if everything is okay instead of having to do so at runtime ..."}, {"count": 4, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "is_private": false, "id": 154474, "time": "2012-03-03T09:20:07Z", "bug_id": 52814, "creation_time": "2012-03-03T09:20:07Z", "text": "You must install a jdk5 otherwise you Will use methods That are only available in your current Jdk.\nSetting jdk5 compliance is not enough.\nSo I am afraid the current patch Will have to wait a migration to jdk6 at least"}, {"id": 154475, "tags": [], "bug_id": 52814, "attachment_id": null, "count": 5, "text": "whoever thought that up (that is: that compliance does not take care of that): fail ;)\nwill install the jdk5 and report back, but only later today.", "time": "2012-03-03T10:00:35Z", "creator": "immanuel.hayden@gmail.com", "creation_time": "2012-03-03T10:00:35Z", "is_private": false}, {"count": 6, "tags": [], "text": "Java source and binary versions only relate to the language syntax and binary format.\n\nThese are entirely separate from the Java run-time library; however Eclipse does normally warn you if there is a discrepancy between the library version and the compiler flags.", "is_private": false, "bug_id": 52814, "id": 154476, "time": "2012-03-03T12:49:46Z", "creator": "sebb@apache.org", "creation_time": "2012-03-03T12:49:46Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 52814, "attachment_id": null, "text": "ok, just checked with the jdk5, and it doesn't like the patch (aka: it marks the lines as errors) ... way to go, Oracle :P", "id": 154485, "time": "2012-03-04T11:36:57Z", "creator": "immanuel.hayden@gmail.com", "creation_time": "2012-03-04T11:36:57Z", "is_private": false}]