[{"count": 0, "tags": [], "text": "Created attachment 28431\ntest *.fo file\n\nWhen a SVG embeds a font the text in the generated PDF/PS is being stroked as shapes even in situations where the font is present in the system and known to FOP. The attached *.fo can be used to show the issue. Looking at the generated PDF (with no flate) or PS one sees that there is no text even though one of the fonts is known to FOP.", "is_private": false, "bug_id": 52849, "id": 154638, "time": "2012-03-07T14:51:37Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-03-07T14:51:37Z", "attachment_id": 28431}, {"count": 1, "tags": [], "text": "Created attachment 28432\npatch\n\nthe attached patch addresses the issue: fonts known to FOP as stroked as text even if embedded in SVG.", "is_private": false, "bug_id": 52849, "id": 154640, "time": "2012-03-07T14:55:40Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-03-07T14:55:40Z", "attachment_id": 28432}, {"count": 2, "tags": [], "bug_id": 52849, "is_private": false, "text": "title updated.", "id": 154641, "time": "2012-03-07T14:56:11Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-03-07T14:56:11Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 52849, "text": "Hi Luis,\n\nJust thinking about this, I think maybe the FontInfo class shouldn't really be responsible for remembering that which notifications it has sent. It just just notify the FontEventListener, then the FontEventListener should decide whether to notify the user or not.\n\nJust a thought, maybe I'm missing something... I see that there's a loggedFontKeys that does something similar, maybe there's a reason for that? If anyone else has thoughts, please do chime in.\n\nMehdi", "id": 154646, "time": "2012-03-07T15:07:51Z", "creator": "med1985@gmail.com", "creation_time": "2012-03-07T15:07:51Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 52849, "attachment_id": null, "text": "I confess I did not put a lot of thought into that and instead used the same pattern that was already present in the that class in the notifyFontReplacement() method. But the remark is a good one. In a more general event framework the listener could even indicate at the time of registration of interest in a particular class of events whether to receive repeated events or just unique events. In the current event framework, yes, I think that letting the listener decide whether to notify or not the user makes sense. However, the problem I see is with the logging. If there is no listener the code falls back to log.warn() calls and I think we do not want repeated messages to clutter the logs. Maybe that is the reason it was done like this originally?", "id": 154659, "time": "2012-03-07T23:14:22Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-03-07T23:14:22Z", "is_private": false}, {"attachment_id": 28466, "tags": [], "bug_id": 52849, "text": "Created attachment 28466\nupdated patch\n\nI put some more thought into this and I think it is OK to remove the log.warn() from FontInfo (from the notify* methods) and just rely on the event listener. The decision whether to output the log messages was then moved to the LogginEventListener.", "count": 5, "id": 154910, "time": "2012-03-14T16:16:29Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-03-14T16:16:29Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "med1985@gmail.com", "text": "This has been commited in r1301445. I made a few changes fixing checkstyle issues concerning javadocs and line lengths. I also made the Set in the LoggingEventListener \"final\", there doesn't seem much point in lazy loading this member.", "count": 6, "id": 154977, "time": "2012-03-16T11:45:45Z", "bug_id": 52849, "creation_time": "2012-03-16T11:45:45Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "med1985@gmail.com", "text": "Oops, forgot to say, thanks for the good work!", "count": 7, "id": 154979, "time": "2012-03-16T11:46:40Z", "bug_id": 52849, "creation_time": "2012-03-16T11:46:40Z", "is_private": false}]