[{"count": 0, "tags": [], "bug_id": 52859, "attachment_id": null, "is_private": false, "id": 154698, "time": "2012-03-08T15:14:31Z", "creator": "william@ezpcltd.com", "creation_time": "2012-03-08T15:14:31Z", "text": "I have added the following line to a site:\n\nErrorDocument 400 /somepage.php\n\nWhen a request comes in with a 400 error code (can test by going to http:\\\\site.com\\test%test), it redirects fine. However, if there is a malformed host header, it will not go to the custom page - just the default 400 page.\n\nThis is not that easy to test. In Windows you can use Wfetch and add a bad header... for example \"Host: blablablabla.net\", not sure how to test elsewhere.\n\nIf I change from the above ErrorDocument to a string - \n\nErrorDocument 400 \"test text\"\n\nApache will print the above text in any situation - the above URL or (and most importantly) a bad host header.\n\nI have asked for help from many places and I just can't get an answer, and due to the fact that the string works on either, I can only conclude that this is a bug."}, {"count": 1, "tags": [], "bug_id": 52859, "attachment_id": null, "is_private": false, "id": 154699, "time": "2012-03-08T15:18:23Z", "creator": "covener@gmail.com", "creation_time": "2012-03-08T15:18:23Z", "text": "Marking as wontfix, when a request is malformed, the server isn't willing to do further processing to serve a custom errordocument out of the filesystem (your error page should have told you a recursive 400 was encountered)"}, {"count": 2, "tags": [], "creator": "william@ezpcltd.com", "is_private": false, "text": "Thank you for the quick reply...\n\n... Is there anything that can be done or to override this behavior?\n\nI can understand that being the default behavior, but, the fact that you allow strings shows that it does something after getting the 400 and not just end it there - so, why not forward on to a page?", "id": 154701, "time": "2012-03-08T15:27:47Z", "bug_id": 52859, "creation_time": "2012-03-08T15:27:47Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "covener@gmail.com", "is_private": false, "text": "(In reply to comment #2)\n> Thank you for the quick reply...\n> \n> ... Is there anything that can be done or to override this behavior?\n> \n> I can understand that being the default behavior, but, the fact that you allow\n> strings shows that it does something after getting the 400 and not just end it\n> there - so, why not forward on to a page?\n\nBecause a literal string doesn't require further server processing that depends on the malformed request to map a request to a file.", "id": 154703, "time": "2012-03-08T16:00:41Z", "bug_id": 52859, "creation_time": "2012-03-08T16:00:41Z", "attachment_id": null}]