[{"count": 0, "tags": [], "bug_id": 52876, "attachment_id": null, "id": 154782, "time": "2012-03-10T16:06:01Z", "creator": "qadeer786@gmail.com", "creation_time": "2012-03-10T16:06:01Z", "is_private": false, "text": "Hi,\nI have written a two new samplers along with the UI using JMeter framework. The two samplers are detailed below:\n\na. MQTT Client Sampler: This sampler uses the MQTT V3/V5 client API's to connect to a remote SCADA enabled protocol handler (eg: IBM WebSphere Message Broker or IBM MQXR etc).\n\nThis sampler is capable of sending request messages to SCADA servers and waits for a response (for a specified duration).\n\nb. IBM WebSphere MQ Sampler: This sampler uses the IBM WebSphere MQ client API to connect to Message Broker and can put/get messages based on specific configuration specified in the sampler UI. Similar to MQTT client sampler, this sampler can send request and wait for response messages for specified duration.\n\nThe sampler works for WebSphere MQ version 7.0 or higher. Since it works with the JMeter framework, it can report results both on UI and on command line.\n\nI would like to submit these two samplers to the JMeter community for inclusion in further releases of JMeter.\n\nCan you please let me know what information you would require for including these samplers into the build ?\n\nThanks,\nQadeer"}, {"count": 1, "tags": [], "bug_id": 52876, "attachment_id": null, "id": 154783, "time": "2012-03-10T16:48:13Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-03-10T16:48:13Z", "is_private": false, "text": "Hello,\nYou need to provide your code as a  patch to jmeter last trunk if possible.\nYou also have to add the Apache license header to new file and remove @author tags.\nTests or Jmx plan showing how to use feature are also welcome.\n\nWe Will look at the patch as soon as possible and if we require more infos we Will comment this issue.\nThanks for proposition.\nRegards\nPhilippe"}, {"count": 2, "tags": [], "text": "Closing as no news from reporter", "is_private": false, "id": 158494, "creator": "p.mouawad@ubik-ingenierie.com", "time": "2012-04-28T13:56:08Z", "bug_id": 52876, "creation_time": "2012-04-28T13:56:08Z", "attachment_id": null}]