[{"count": 0, "tags": [], "bug_id": 52874, "attachment_id": null, "id": 154759, "time": "2012-03-09T17:24:28Z", "creator": "vargok@yahoo.com", "creation_time": "2012-03-09T17:24:28Z", "is_private": false, "text": "Client Certificate verification expects the client to provide a full certificate chain back to a trusted root.  However, with the introduction of Cross-certification configuration, there may be multiple \"valid\" paths, of differing scope.  OpenSSL (HEAD/c.a. 1.0.2) has provided support for a Trusted First flag to verification processing, and I would like to see that make it's way back into mod_ssl.\nAs I'm using RHEL-5, I'd like to get EL-5 to update it's mod_ssl (and openssl), but I'd like to get the patch into mod_ssl's \"upstream,\" as well.\n\nBasically, when verifying the Client certificate, the chain building process should always check for the \"next\" (higher) CA Certificate to be in the \"trusted\" store on the server-side, and if it finds it there, to use it; continuing to build the chain from the server's store, ignoring the clients store where possible.  This will allow clients to provide intermediates up to a point (making it so the server needn't track all intermediates).  Once the point of cross-certification is reached, the verification will proceed only through the servers' version to the Roots/intermediates it trusts, rather than needing to trust the client-offered chain -- which will vary in trust-scope.\n\nTo reproduce:  1. Generate a CA structure that has multiple roots, and issue one of the intermediates, or one of the \"Root\" certificates through both CA structures.  2. Configuration two browser-profiles; one to use each separate chain.  3. Configure the server to trust one of the Roots, but not the other.  4.  One profile should \"work,\" and the other should result in a \"Local Issuer not found (20)\" type error.\nE.g.,\n  [Cross-Certification (CC) Root CA]\n      |\n  [Intermediate CC 1]\n      |\n  [Re-issued non-CC \"Root\" CA] <--same keys--> [Self-Signed (SS) Root CA]\n                  \\                               /\n                   \\                             /\n                    \\                           /\n             [Intermediate issued from cross-certified CA]\n                                 |\n                    [End-entity (user) certificate]"}, {"count": 1, "tags": [], "bug_id": 52874, "attachment_id": 28448, "id": 154760, "time": "2012-03-09T17:26:31Z", "creator": "vargok@yahoo.com", "creation_time": "2012-03-09T17:26:31Z", "is_private": false, "text": "Created attachment 28448\nPatch to incorporate SSLTrustedFirst (On|Off) and the X509 Flag in openssl\n\nAdds support for new Server-wide directive, SSLTrustedFirst, which enables the ctx->param->flags for openssl's TrustedFirst directive when doing client verification."}, {"count": 2, "tags": [], "text": "(In reply to comment #1)\n> Created attachment 28448 [details]\n> Patch to incorporate SSLTrustedFirst (On|Off) and the X509 Flag in openssl\n\nThis patch only includes the changes to OpenSSL, but none for mod_ssl.\n\n> Adds support for new Server-wide directive, SSLTrustedFirst, which enables the\n> ctx->param->flags for openssl's TrustedFirst directive when doing client\n> verification.\n\nIf we do this, we'll want to make it a per-vhost directive (same as SSLCACertificateFile and friends).\n\nIt's too early to consider adding support for this to mod_ssl, however (even for trunk). The X509_V_FLAG_TRUSTED_FIRST verification flag was added to OpenSSL in http://cvs.openssl.org/chngview?cn=19324 and will first appear in 1.1.0, which won't be released that soon, most likely.", "attachment_id": null, "id": 154779, "creator": "asfbugz@velox.ch", "time": "2012-03-10T06:33:48Z", "bug_id": 52874, "creation_time": "2012-03-10T06:33:48Z", "is_private": false}, {"count": 3, "tags": [], "creator": "vargok@yahoo.com", "is_private": false, "id": 154876, "attachment_id": 28460, "bug_id": 52874, "creation_time": "2012-03-13T14:59:29Z", "time": "2012-03-13T14:59:29Z", "text": "Created attachment 28460\nPatch to incorporate SSLTrustedFirst (On|Off) and the X509 Flag in openssl\n\nSorry; I attached the wrong diff, obviously.  Here's the one against mod_ssl 2.2.3 (via Centos 5)"}]