[{"count": 0, "attachment_id": null, "creator": "kean.johnston@gmail.com", "is_private": false, "id": 154832, "time": "2012-03-12T17:59:24Z", "bug_id": 52889, "creation_time": "2012-03-12T17:59:24Z", "tags": [], "text": "The change to loadable MPMs and the corresponding change to ap_mpm_query() that can now only be called after the register hooks phase has unintended consequences. At least 1 PHP extension I know of breaks as a result of this. The extension uses ap_mpm_query() to determine if the worker MPM is in use and disables the extension if this is the case (due to all the myriad issues PHP has with the worker MPM). This is done during the extension's MINIT phase, which happens as mod_php is loading and thus before register hooks phase is complete. The effect is that Apache segfaults. This is an ABI breakage and will cause lots of issues. Surely changing the ABI shouldn't happen for a minor release (I mean minor in terms of Apache version, the N in M.N.P)."}, {"count": 1, "tags": [], "bug_id": 52889, "text": "The MPM details can't be queried until after the register hooks phase because the MPM has to use that same phase to register its own hooks.  It is understood that this may require some restructuring with some third-party code.  Generally, ABI breakage is always expected with httpd when changing the N in M.N.P.  That's why a particular M.N branch is typically supported for so many years.", "id": 154840, "time": "2012-03-12T19:21:36Z", "creator": "trawick@apache.org", "creation_time": "2012-03-12T19:21:36Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "sf@sfritsch.de", "attachment_id": null, "is_private": false, "id": 154841, "time": "2012-03-12T19:29:08Z", "bug_id": 52889, "creation_time": "2012-03-12T19:29:08Z", "text": "I have now documented this change at\nhttp://httpd.apache.org/docs/2.4/developer/new_api_2_4.html"}, {"count": 3, "attachment_id": null, "creator": "kean.johnston@gmail.com", "text": "(In reply to comment #1)\n> The MPM details can't be queried until after the register hooks phase because\n> the MPM has to use that same phase to register its own hooks.  It is understood\n> that this may require some restructuring with some third-party code. \n> Generally, ABI breakage is always expected with httpd when changing the N in\n> M.N.P.  That's why a particular M.N branch is typically supported for so many\n> years.\nOk. But at the very least it shouldn't cause httpd to segfault should it?", "id": 154851, "time": "2012-03-12T22:31:45Z", "bug_id": 52889, "creation_time": "2012-03-12T22:31:45Z", "tags": [], "is_private": false}, {"count": 4, "attachment_id": null, "creator": "wrowe@apache.org", "is_private": false, "id": 154853, "time": "2012-03-12T22:49:44Z", "bug_id": 52889, "creation_time": "2012-03-12T22:49:44Z", "tags": [], "text": "It is absolutely supposed to cause old modules to segfault, yes."}]