[{"count": 0, "tags": [], "creator": "kelapure@gmail.com", "text": "org.apache.catalina.loader.WebappClassLoader.clearReferencesJdbc() is incorrectly reading org/apache/catalina/loader/JdbcLeakPrevention.class file from disk causing extra bytes in the byte[] passed to java.lang.ClassLoader.defineClass(String, byte[], int, int, ProtectionDomain).\n\nHaving extra bytes at the end of a .class file has always been illegal.  This did NOT cause any issues in the past because in previous JDK releases, the test for this condition rarely active. \n\nOracle change their behaviour in java 6 to mark this as an error consequently any extra bytes leads to errors like these\n\nCaused by: java.lang.ClassFormatError: JVMCFRE118 extra bytes after EOF; class=com/ibm/ws/runtime/component/JdbcLeakPrevention, offset=2499", "id": 154939, "time": "2012-03-15T15:37:01Z", "bug_id": 52919, "creation_time": "2012-03-15T15:37:01Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "With what exact version of Java and what exact version of Tomcat are you observing an error? Or it is just a theoretical speculation?  I assure you that many people are using Tomcat 7 with Java 6.\n\nIt does not matter whether there are extra unused bytes in the bytes array, because offset and length of the used part of the array are explicitly specified in the call. The offset is always \"0\" and the length is provided by variable named \"offset\" which counts the bytes that have been read into the classBytes array.\n\nI am closing this as INVALID, unless you can provide some evidence.", "id": 154940, "time": "2012-03-15T15:53:13Z", "bug_id": 52919, "creation_time": "2012-03-15T15:53:13Z", "is_private": false}, {"count": 2, "tags": [], "creator": "kelapure@gmail.com", "text": "Upon closer inspection of the code I have realized that this is not an issue. \nPlease cancel this defect", "id": 154941, "time": "2012-03-15T15:58:35Z", "bug_id": 52919, "creation_time": "2012-03-15T15:58:35Z", "is_private": false, "attachment_id": null}]