[{"count": 0, "tags": [], "creator": "nicholas@nicholaswilliams.net", "text": "Created attachment 28477\nSample tomcat-web.xml file, similar to glassfish-web.xml file\n\nSome of the more popular application servers (GlassFish, WebLogic and WebSphere) provide easy methods for controlling JSP configuration parameters on a per-application basis.\n\nTomcat 7, for example, can run on Java 7, but the default JSP compile level is 1.6, and in order to support compiling JSPs for Java 7, you have to change the value of compileSourceVM and compileTargetVM for the entire server in $CATALINA_BASE/conf/web.xml (affects everything) or redeclare the JspServlet in your web.xml file (not portable to other application servers).\n\nI propose a tomcat-web.xml file specification (similar to GlassFish 3.x's glassfish-web.xml file specification) that enables configuration of certain Tomcat-specific application properties. We can start off with just a few options and over time could make Tomcat much more powerful as we find other options to put in there.\n\nI propose that the first setting supported in this file be a JSP compile level (1.5, 1.6, 1.7, etc.).\n\nI propose that the second setting supported be the ability to precompile JSPs on application startup (a feature not currently supported without significant configuration/work).\n\nI have attached a sample tomcat-web.xml file that could potentially be used (very similar to GlassFish equivalent).\n\nIt would be great if this could be added to Tomcat 6 AND Tomcat 7, but if Tomcat 6 is out of the question, go ahead and move this enhancement suggestion to Tomcat 7.\n\nMaybe possible is that it supports only the JSP language level in Tomcat 6 and supports more in Tomcat 7?", "id": 154958, "time": "2012-03-15T21:36:35Z", "bug_id": 52924, "creation_time": "2012-03-15T21:36:35Z", "is_private": false, "attachment_id": 28477}, {"count": 1, "attachment_id": null, "bug_id": 52924, "is_private": false, "id": 199557, "time": "2017-07-04T19:21:30Z", "creator": "markt@apache.org", "creation_time": "2017-07-04T19:21:30Z", "tags": [], "text": "This has been implemented for Tomcat 9 and will be included in 9.0.0.M24 onwards.\n\n/WEB-INF/tomcat-web.xml has exactly the same format as /WEB-INF/web.xml and works the same way as conf/web.xml. The full order of precedence is (highest priority first):\n- /WEB-INF/web.xml\n- /WEB-INF/tomcat-web.xml\n- /conf/<engine>/<host>/web.xml.default\n- /conf/web.xml\n\nI'm not currently planning on back-porting this new feature."}]