[{"count": 0, "tags": [], "bug_id": 530, "attachment_id": null, "id": 566, "time": "2001-02-05T11:19:42Z", "creator": "brentboyer@hotmail.com", "creation_time": "2001-02-05T11:19:42Z", "is_private": false, "text": "I have an html form whose name-value pairs I want to upload to a servlet (a jsp \npage, actually).  I am using Tomcat 3.2.1 as the web server and servlet engine.\n\nOriginally the html form was written to upload the values using the http post \nmethod.  The form works totally fine when submitted using IE -- the jsp page \ngets the data and delivers a dynamic html page back.\n\nUnder Netscape 4.7.1, the following happens: the very first time that you try \nand upload stuff, nothing ever comes back -- you just see the hourglass symbol \nindicating that Netscape is waiting.\n\nI accidentally stumbled across a bizarre workaround: if you stop that first form \nsubmission, request Tomcat to load its \"home page\" (i.e. the index.html file in \nits root directory that has the cat logo on it), and go back and try the same \nform again, then it practically instantly comes back with the correct dynamic \npage.  All subsequent form uploads also work correctly.\n\nAnother workaround is to simply have the form upload data via http get.\n\nBut it is disturbing that the post operation does not seem to work the first \ntime with Netscape.\n\nAlso, there is no clue in either Tomcat's log files or the dos shell window that \nI execute Tomcat's startup.bat file in that anything is wrong the first time \nthat I attempt to post the form from Netscape.\n\nAny suggestions/bug fixes would be greatly welcomed.\n\n-Brent Boyer\n\nNote: at least 2 other people on the web who seem to have encountered similar \nproblems with older versions of Tomcat in the past (ironically, the first URL \nbelow reports a problem with IE and Tomcat):\n\nhttp://archives2.real-time.com/pipermail/tomcat-users/2000-August/007885.html\nhttp://archive.covalent.net/jakarta/tomcat-dev/2000/05/0321.xml"}, {"count": 1, "tags": [], "bug_id": 530, "attachment_id": null, "id": 1476, "time": "2001-03-20T14:42:26Z", "creator": "marc.saegesser@apropos.com", "creation_time": "2001-03-20T14:42:26Z", "is_private": false, "text": "I can't duplicate this.  I'll leave it open for evaluation in other release but \nit won't be addressed in 3.2.2."}, {"count": 2, "tags": [], "text": "I can't reproduce this in 3.3 - please attach a simple WAR file with the JSP\npage and a simple form that can reproduce it. The bug with Netscape \nsending extra chars has been resolved, and most people are able to use \nPOST without any problems, so it may be related with the code in the JSP\nor with config problems. Please also include details about platform, config,\nexact tomcat version.", "attachment_id": null, "id": 2023, "creator": "cmanolache@yahoo.com", "time": "2001-04-22T11:48:53Z", "bug_id": 530, "creation_time": "2001-04-22T11:48:53Z", "is_private": false}]