[{"count": 0, "tags": [], "bug_id": 53001, "attachment_id": null, "text": "I have discovered the the ResourceBundleELResolver from the tomcat el-api.jar behaves differently then the one from standard el-api.\n\nThe difference lays in the handling of missing properties. The tomcat version will not set the resolved property to true such that evaluation continues and finally an exception is thrown. This causes pages to crash if a property can not be found (which I think is kind of unacceptable for production sites).\n\nThe bahaviour was changed due to https://issues.apache.org/bugzilla/show_bug.cgi?id=46915.\n\nI think that changing the standard behaviour of \"resolving\" an unbound property by just returning its key is to throwing an exception was a strong decision. I would strongly recommend of reintroducing the old bahviour and fixing the issue 46915 in a different way. If someone can point my to the requirements and corner cases related to 46915, I will gladly provide an implementation.\n\nUntil then, a workaround for everybody using jsf: Subclass the ResourceBundleELResolver and override its getValue(...) method. Change it such that it sets the PropertyResolved attribute to true before any exception might occur. Register this custom resolver in the faces-config.xml with <el-resolver>", "id": 155357, "time": "2012-03-29T09:41:39Z", "creator": "b.diedrichsen@googlemail.com", "creation_time": "2012-03-29T09:41:39Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "Tomcat is no longer following the EL spec.\n\nThe behaviour prior to the fix for bug 46915 was correct.\n\nI'm not sure it is possible to fix bug 46915 and be specification compliant.\n\nI'll revert the fix for bug 46915, put together some test cases and see what I can come up with. Depending on how well things go, bug 46915 will either stay as FIXED or be changed to INVALID.", "id": 155386, "time": "2012-03-30T09:37:02Z", "bug_id": 53001, "creation_time": "2012-03-30T09:37:02Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "b.diedrichsen@googlemail.com", "text": "Thanks for the quick reply. I did not check the spec so wasn't aware that the current behaviour actually violates the el specs. Why was the fix for bug 46915 done in the first place? Did the specs change from then to now? Anyways, keep up the good work. Tomcat is an impressive and very reliable product.", "id": 155387, "time": "2012-03-30T10:09:43Z", "bug_id": 53001, "creation_time": "2012-03-30T10:09:43Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 155402, "time": "2012-03-30T15:23:19Z", "bug_id": 53001, "creation_time": "2012-03-30T15:23:19Z", "is_private": false, "text": "No change in the spec. I failed to check the EL spec before I fixed bug 46915. If I had, that would have been resolved as INVALID. It looks like EL 2.2 (Tomcat 7) has some new features that would allow the requirement in bug 46915 to be met. Time to write some unit tests."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 155406, "time": "2012-03-30T16:35:59Z", "bug_id": 53001, "creation_time": "2012-03-30T16:35:59Z", "is_private": false, "text": "Fixed in trunk and 7.0.x and will be included in 7.0.27 onwards.\n\nThe fixed has been proposed for 6.0.x."}, {"count": 5, "tags": [], "bug_id": 53001, "attachment_id": null, "text": "Thank you Mark,\nthis was really a quick resolution of the issue.", "id": 155408, "time": "2012-03-30T18:09:37Z", "creator": "b.diedrichsen@googlemail.com", "creation_time": "2012-03-30T18:09:37Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 53001, "text": "Fixed in 6.0 with r1343356 and will be in 6.0.36", "id": 159406, "attachment_id": null, "creator": "knst.kolinko@gmail.com", "creation_time": "2012-05-28T18:50:20Z", "time": "2012-05-28T18:50:20Z", "is_private": false}]