[{"count": 0, "tags": [], "bug_id": 53012, "attachment_id": null, "id": 155443, "time": "2012-03-31T15:10:58Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2012-03-31T15:10:58Z", "is_private": false, "text": "If fileA.jsp includes fileB.jspf, and the Jasper Ant task attempts to compile fileA.jsp but encounters an error in fileB.jspf, the error it outputs ONLY mentions fileB.jspf. It does not mention fileA.jsp. This can be extremely confusing, especially when fileB.jspf is included by dozens or hundreds of JSPs. The compile error in fileB.jspf may be caused by only one of those files, because it doesn't declare some variable that the rest of the files declare.\n\nWhen Jasper outputs the compile error, it should include a \"stacktrace\" of sorts, except that it's really an include trace. It shows where the error occurred (fileB.jspf, like it already does), but then which file included that file, and which file included that file, and so on until it gets to the file that the compiler is actually trying to compile (fileA.jsp).\n\nThoughts?\n\nI am interested in possibly contributing code for this feature. I will email\nthe developers' list later about it."}, {"count": 1, "tags": [], "text": "Relevant to 53011, 53012, 53031 and 53032: Per discussions with Chris Schultz in the users list, we agree that it would probably make more sense to separate the Ant task from the JspC class and place a new Ant task in the o.a.catalina.ant package (possibly o.a.catalina.ant.jasper?). Research about the state of the task needs to be completed. Further discussions about this will take place in the developer's list, and then these issues will be updated when a consensus is reached.", "attachment_id": null, "id": 157128, "creator": "nicholas@nicholaswilliams.net", "time": "2012-04-03T22:02:12Z", "bug_id": 53012, "creation_time": "2012-04-03T22:02:12Z", "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Tested with 6.0.x, 7.0.x and trunk and in all cases the error message points to the including file, not the included file.\n\nIf you still see this error then before re-opening this issue please provide the simplest test case (should be no more than one build.xml, one jsp file and one jspf file in a zipped directory structure) that demonstrates the issue.", "id": 159725, "time": "2012-06-05T21:57:41Z", "bug_id": 53012, "creation_time": "2012-06-05T21:57:41Z", "is_private": false}]