[{"count": 0, "attachment_id": null, "creator": "dsb@smart.net", "is_private": false, "id": 155453, "time": "2012-04-01T00:23:42Z", "bug_id": 53018, "creation_time": "2012-04-01T00:23:42Z", "tags": [], "text": "* \"The depend task supports an attribute, \"closure\" which controls ...\":  There\n  should be a corresponding comma after \"closure.\"\n\n* \"For example, say there are three classes, A, which depends on B, which \n  in-turn depend on C.\":  That \"depend\" should be \"depends\" (and \"in-turn\" \n  should be \"in turn\").\n\n* \"You should not include jars in this classpath which you do not expect to \n  change...\":  That seems to have a dangling modifier.  Probably re-order the\n  wording to \"You should not include in this classpath jars which you do not   \n  expect to change...\" (and that \"which\" should be \"that\").\n\n* \"There are some source dependencies which depend will not detect.\":  That\n  period should be a colon (because of the indented list that follows).\n\n* \"Non public classes cause two problems. Firstly depend cannot relate the \n  class file to a source file. In the future this may be addressed using the \n  source file attribute in the classfile. Secondly, neither depend nor the \n  compiler tasks can detect when a non public class is missing. Inner classes \n  are handled by the depend task.\":  Both occurrences of \"non public\" should\n  be \"non-public\" (\"non\" is not a word, only a prefix).\n\n* \"If you use multiple source directories you can pass this attribute a \n  path of source directories.\":  That use of \"path\" should not be abbreviated\n  like that.  (It's too ambiguous)\n\n  (Recall that there are (file/directory) pathnames and search paths (e.g.,\n  Java's classpath), both of which are (ambiguously) referred to as \"paths\".)\n\n\n* For the two examples at the end, the subject of the sentence after the\n  example is not clear.  Things would be clearer (and more grammatical) if\n  the text said \"This example:\" (or at least \"This:\") before the example\n  code. (Actually, this pattern applies all over the manual, but )"}]