[{"count": 0, "tags": [], "bug_id": 53011, "attachment_id": null, "text": "The Ant task for Jasper JSP compiling (JspC) will fail (if failOnError = true) after a single error, without looking for other errors.\n\nThis can be very challenging for large projects. For example, we have 2,487 JSPs that need compiling. If some part of the Java code is changed that breaks hundreds of JSPs (which, admittedly, means a developer didn't do his job correctly, but still), the continuous integration build for our project fails (as it should), but the log only shows one of the errors.\n\nThe Ant task should have a new property, \"failAfterAllErrors,\" that makes it log all compile failures as errors but continue compiling until every JSP compilation has been attempted.\n\nThis is similar to how the javac Ant task works. It logs ALL of the compile errors, and only after having tried to compile everything, it fails the build.\n\nThoughts?\n\nI am interested in possibly contributing code for this feature. I will email the developers' list later about it.", "id": 155442, "time": "2012-03-31T15:01:46Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2012-03-31T15:01:46Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 53011, "text": "+1 to the idea, but I'd like to see an implementation that is more in line with similar tasks like <javac> and <junit>: they use \"failOnError\" (defaults to 'true' to get current behavior) and \"errorProperty\". If you set failOnError=false and errorProperty=jasperFailed, then you can test for jasperFailed and emit any kind of warning/error you'd like from your ant target.", "id": 157080, "time": "2012-04-02T21:20:00Z", "creator": "chris@christopherschultz.net", "creation_time": "2012-04-02T21:20:00Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 53011, "attachment_id": null, "text": "Note: While I don't disagree with your suggestion, Chris, and we can certainly discuss it further, that's not how Ant's javac works. Javac failonerror defaults to true, and when it's set to true, the behavior is to try compiling everything and wait until all compile errors have happened before failing. In fact, as far as I can tell, there is actually no way to make it behave like JspC (fail after the first error).\n\nRelevant to 53011, 53012, 53031 and 53032: Per discussions with Chris Schultz in the users list, we agree that it would probably make more sense to separate the Ant task from the JspC class and place a new Ant task in the o.a.catalina.ant package (possibly o.a.catalina.ant.jasper?). Research about the state of the task needs to be completed. Further discussions about this will take place in the developer's list, and then these issues will be updated when a consensus is reached.", "id": 157129, "time": "2012-04-03T22:06:04Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2012-04-03T22:06:04Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 53011, "text": "(In reply to comment #2)\n> Javac failonerror defaults to true, and when it's set to true, the behavior\n> is to try compiling everything and wait until all compile errors have\n> happened before failing. In fact, as far as I can tell, there is actually\n> no way to make it behave like JspC (fail after the first error).\n\nFair enough. Perhaps a third setting to make it fail-fast (to emulate current behavior).", "id": 157132, "time": "2012-04-03T22:11:01Z", "creator": "chris@christopherschultz.net", "creation_time": "2012-04-03T22:11:01Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Created attachment 31555\nPatch to add an option \"failFast\"\n\nAppended is a patch that adds an option \"failFast\". Default is \"false\", so the build does not fail at the first compile error, but after the last JSP has been parsed using the following message:\n\"Failed to compile JSPS: org.apache.jasper.JasperException: Aborted due to compilation failures!\"\n\nAdditionally, a tiny statistic will be printed.\n\"JSP-compilations: 465, Errors: 20, Time elapsed: 60,777 sec\"", "attachment_id": 31555, "id": 174826, "creator": "marc.pompl@lynorics.de", "time": "2014-04-24T06:56:59Z", "bug_id": 53011, "creation_time": "2014-04-24T06:56:59Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 53011, "text": "(In reply to Marc Pompl from comment #4)\n> Patch to add an option \"failFast\"\n\nSee corresponding issue for the maven-jspc-plugin https://github.com/Jasig/jspc-maven-plugin/issues/17", "id": 174827, "time": "2014-04-24T06:58:15Z", "creator": "marc.pompl@lynorics.de", "creation_time": "2014-04-24T06:58:15Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 53011, "attachment_id": null, "text": "I have applied a variation of this patch (mainly to account for code changes) to 9.0.x and it will be included in 9.0.0.M22 onwards.", "id": 198755, "time": "2017-05-10T19:58:11Z", "creator": "markt@apache.org", "creation_time": "2017-05-10T19:58:11Z", "is_private": false}]