[{"count": 0, "tags": [], "creator": "nicholas@nicholaswilliams.net", "attachment_id": null, "is_private": false, "id": 157126, "time": "2012-04-03T21:41:35Z", "bug_id": 53032, "creation_time": "2012-04-03T21:41:35Z", "text": "One way to use bulk task definitions in Ant is to use XML namespaces:\n\n\n<project name=\"teamcity\"\n         xmlns:tomcat6=\"http://tomcat.apache.org/ant/tomcat/6\">\n\n...\n\n\n    <path id=\"tomcat.6.ant.classpath\">\n        <fileset dir=\"${my.path.library.build}/tomcat-6.0.35\">\n            <include name=\"*.jar\" />\n        </fileset>\n        <path refid=\"my.path.compile.jsp\" />\n    </path>\n\n    <typedef resource=\"org/apache/catalina/ant/antlib.xml\"\n             uri=\"http://tomcat.apache.org/ant/tomcat/6\"\n             classpathref=\"tomcat.6.ant.classpath\" />\n\n...\n\n    <target>\n        <tomcat6:list ... />\n        <tomcat6:deploy ... />\n    </target>\n\n...\n</project>\n\nThis works great for list, deploy, etc. In fact, it works great for every other Ant task as far as I can tell. But it doesn't work for the jasper/jasper2 tasks (which both point to the same class).\n\n<tomcat6:jasper ... />\n\nThis does nothing. And by “nothing” I mean that I use `ant -verbose` when running Ant, verbose=”1” within the Jasper task, and there’s no output from the Jasper task, not a single line of output/logging, and the build completes in 0 seconds with no compiled JSPs output.\n\nHowever, if I define the Jasper task explicitly, using the exact same paths (as you can clearly see):\n \n    <taskdef classname=\"org.apache.jasper.JspC\" name=\"tomcat6-jsp-compile\">\n        <classpath>\n            <path refid=\"tomcat.6.ant.classpath\" />\n        </classpath>\n    </taskdef>\n \nAnd call the Jasper task using the exact same options:\n \n<tomcat6-jsp-compile ... />\n \nEverything works. It compiles 2,487 JSPs in 275s, and outputs exactly what I expect, including 2,487 compiled JSPs and two logging messages. From what I understand about Ant, there should be absolutely no difference, and yet there apparently is, because they behave differently.\n\nThe jasper task should support namespaces like the other Tomcat Ant tasks, and like other Ant tasks in general.\n\n(Note: I have confirmed at http://ant.apache.org/faq.html that a separate classloader IS used for the taskdef, and that Jspc will not have access to conflicting classes loaded by other namespaces.)"}, {"count": 1, "tags": [], "creator": "nicholas@nicholaswilliams.net", "attachment_id": null, "is_private": false, "id": 157131, "time": "2012-04-03T22:07:09Z", "bug_id": 53032, "creation_time": "2012-04-03T22:07:09Z", "text": "Relevant to 53011, 53012, 53031 and 53032: Per discussions with Chris Schultz in the users list, we agree that it would probably make more sense to separate the Ant task from the JspC class and place a new Ant task in the o.a.catalina.ant package (possibly o.a.catalina.ant.jasper?). Research about the state of the task needs to be completed. Further discussions about this will take place in the developer's list, and then these issues will be updated when a consensus is reached."}, {"count": 2, "tags": [], "bug_id": 53032, "text": "Since JspC is the only Tomcat Ant task that doesn't work with namespaces, and JspC is also the only Tomcat Ant task that /doesn't/ extend o.a.tools.ant.Task, it seems likely that is the culprit. I don't know this for sure, but from my initial examination of all of the code involved, it appears that is the case.\n\nJspC doesn't extend or implement /any/ Ant classes. As far as Ant goes, it appears to purely be a hacked-together class that just happens to implement the minimum methods that Ant expects a task to implement, and this can run as a task. But it is not, as for as Ant is concerned, an actual Task. It seems very unlikely that something other than this fact is causing this issue.", "id": 157159, "time": "2012-04-04T15:18:54Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2012-04-04T15:18:54Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 53032, "text": "Confirmed. Extending Task does fix this.\n\nI'm not convinced that it makes sense to separate the Ant task and JspC. While the current approach isn't the one I'd select if starting from a clean sheet, I don't see a compelling argument to change it now.\n\nFixed in trunk and 7.0.x and will be included in 7.0.28 onwards.\n\nProposed for 6.0.x", "id": 159726, "time": "2012-06-05T23:02:24Z", "creator": "markt@apache.org", "creation_time": "2012-06-05T23:02:24Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "creator": "knst.kolinko@gmail.com", "is_private": false, "id": 160210, "time": "2012-06-24T11:43:54Z", "bug_id": 53032, "creation_time": "2012-06-24T11:43:54Z", "tags": [], "text": "Fixed in 6.0 with r1353247 and will be in 6.0.36."}]