[{"count": 0, "tags": [], "bug_id": 53054, "text": "The Regex Back-Reference Availability of the Apache mod_rewrite Introduction contains:\nOne important thing here has to be remembered: Whenever you use parentheses in Pattern or in one of the CondPattern, back-references are internally created which can be used with the strings $N and %N (see below). These are available for creating the strings Substitution and TestString. Figure 1 shows to which locations the back-references are transferred for expansion as well as illustrating the flow of the RewriteRule, RewriteCond matching.\nhttp://httpd.apache.org/docs/trunk/en/rewrite/intro.html#regex\n\nThen there's a figure with the caption \"The back-reference flow through a rule.\" I'm not sure how this happened, but the current figure does not illustrate the back-reference flow through a rule. The figure is the same figure as the one used in http://httpd.apache.org/docs/trunk/en/rewrite/tech.html#InternalRuleset to show how the whole rewriting process happens. The figure does not mention any back-reference. The figure used to be /images/mod_rewrite_fig2.gif until http://svn.apache.org/viewvc?view=revision&revision=895068\nhttps://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/manual/images/mod_rewrite_fig2.png\nBut I hardly find the previous image more enlightening about back-references.\n\nNothing below talks about %N or $N.", "id": 157796, "time": "2012-04-10T18:59:15Z", "creator": "chealer@gmail.com", "creation_time": "2012-04-10T18:59:15Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 53054, "attachment_id": null, "id": 157800, "creation_time": "2012-04-10T19:32:56Z", "time": "2012-04-10T19:32:56Z", "creator": "humbedooh@apache.org", "text": "Time to start drawing up some more charts I guess :)\nI have made an attempt to capture what should probably be there; http://www.humbedooh.com/apache/rewrite_backreferences.png\n\nI feel stupid to ask, but is this more what you were hoping to find? :)", "is_private": false}, {"count": 2, "tags": [], "bug_id": 53054, "attachment_id": null, "id": 157803, "creation_time": "2012-04-10T19:38:08Z", "time": "2012-04-10T19:38:08Z", "creator": "covener@gmail.com", "text": "two suggestions for completeness:\n\n* make the rewriterule something flexible enough to work in vhost context\n* find some way use $1 in the condition as well (you might have to make the example more contrived, e.g. only allow /admin on admin.example.com", "is_private": false}, {"count": 3, "tags": [], "creator": "humbedooh@apache.org", "attachment_id": null, "text": "I have updated the image I linked in my previous comment to reflect the changes proposed by Eric. All there is left, I guess, is to get some response from people on whether this new suggested chart is the way to go.", "id": 157804, "time": "2012-04-10T20:08:38Z", "bug_id": 53054, "creation_time": "2012-04-10T20:08:38Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 53054, "text": "Thanks Daniel, your proposition certainly fits a lot more what I would have expected there.\nI think the example is good. The text presenting the figure will need adaptation however.\n\nThe text of Regex Back-Reference Availability currently depends on RewriteRule Basics, presented later. But RewriteRule Basics also depends on the Regular Expressions section. One way out of this might be to move Regex Back-Reference Availability out of \"Regular Expressions\" and to move it down. In fact, it also depends on Rewrite Conditions.", "id": 157813, "time": "2012-04-10T21:16:13Z", "creator": "chealer@gmail.com", "creation_time": "2012-04-10T21:16:13Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 53054, "attachment_id": null, "id": 157932, "creation_time": "2012-04-11T07:58:29Z", "time": "2012-04-11T07:58:29Z", "creator": "humbedooh@apache.org", "text": "Yes, the big problem is that all the chapters are interdependent, so where ever we put it, it's either going to be too soon or too late.\n\nI've added the new diagram to the trunk version of the document, as well as added some text to the figure and the paragraph before it, to let the readers know, that they are not expected to understand the diagram entirely before they read the next couple of chapters on how RewriteRule and RewriteCond work. \n\nThe trunk document is at httpd.apache.org/docs/trunk/rewrite/intro.html\n\nI hope this at least resolves the initial problems outlined in this ticket, and await confirmation or declination. At some point, I guess we will have to completely rewrite the introduction, so as to not get ourselves into this interdependent mess, but for now, this kludge should work.", "is_private": false}, {"count": 6, "tags": [], "creator": "chealer@gmail.com", "attachment_id": null, "text": "I agree with you, Daniel. Congratulations for the quick resolution", "id": 157951, "time": "2012-04-11T18:13:02Z", "bug_id": 53054, "creation_time": "2012-04-11T18:13:02Z", "is_private": false}]