[{"count": 0, "attachment_id": 28582, "creator": "mgrigorov@apache.org", "text": "Created attachment 28582\nA demo app that demonstrates the problem. Issue a request to /serv1 and check the produced 'Location' response header\n\nIssuing a redirect like:\n\n  response.sendRedirect(\"./serv2\");\n\nwill lead to a response header like:\n\n  Location:http://localhost:8080/./serv2\n\nand this causes problems for some not that smart user agents like Internet Explorer and JMeter.\n\nThe problem has been reported few times in Apache Wicket's Jira.\nWicket works only with relative urls and lets the web container to make them absolute when a redirect is needed. But it seems only Tomcat produces absolute urls with '../' and/or './' inside and let the user agent to normalize them. Other web containers normalize the url at the server side and make user agents life easier.\n\nSee \nhttps://issues.apache.org/jira/browse/WICKET-2732\nhttps://issues.apache.org/jira/browse/WICKET-4260", "id": 157935, "time": "2012-04-11T12:42:29Z", "bug_id": 53062, "creation_time": "2012-04-11T12:42:29Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 53062, "text": "The demo application provides a workaround by using a custom HttpServletResponseWrapper that solves the problem but I believe this should be handled by Tomcat itself.\nIt uses the same approach as described in https://issues.apache.org/bugzilla/show_bug.cgi?id=51972", "count": 1, "id": 157936, "time": "2012-04-11T12:44:53Z", "creator": "mgrigorov@apache.org", "creation_time": "2012-04-11T12:44:53Z", "is_private": false}, {"count": 2, "attachment_id": null, "creator": "markt@apache.org", "is_private": false, "id": 158938, "time": "2012-05-09T20:29:21Z", "bug_id": 53062, "creation_time": "2012-05-09T20:29:21Z", "tags": [], "text": "The specification says relative URLs must be translated to \"fully qualified URL\". My understanding of that is that it means an absolute URL. The specification says nothing about normalizing or not normalizing the URL.\n\nGiven that Tomcat has worked this way for so long, I am surprised there haven't been more complaints given the statement that IE does not handle non-normalized redirects.\n\nI'm not against normalizing them in principle but I want to take a look at the code to see what would be involved."}, {"count": 3, "tags": [], "bug_id": 53062, "attachment_id": null, "id": 158939, "time": "2012-05-09T20:59:58Z", "creator": "markt@apache.org", "creation_time": "2012-05-09T20:59:58Z", "is_private": false, "text": "Hmm. Interesting. RFC2396 says /./ and /../ are only special in relative URLs. It implies (but does not make explicitly clear) that /./ and /../ are to be treated literally in absolute URLs. That certainly isn't what any web server I am aware of does. They would get treated the same way they would in relative URLs and be normalized.\n\nThere is certainly an argument, based on removing ambiguity, to normalize URLs generated by sendRedirect and friends."}, {"count": 4, "attachment_id": null, "creator": "mgrigorov@apache.org", "text": "I have noticed that WebLogic (not sure which version though) also produce such absolute urls.\nIf you ask me IE users should suffer just for the reason they use this browser, but except IE+Tomcat_virtual_host combination we see that other user agents like JMeter are also confused by the existence of ./ and ../ in absolute urls.", "id": 158948, "time": "2012-05-10T08:53:03Z", "bug_id": 53062, "creation_time": "2012-05-10T08:53:03Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 53062, "text": "Normalization added to trunk and 7.0.x and will be included in 7.0.28 onwards.", "count": 5, "id": 158962, "time": "2012-05-10T20:10:28Z", "creator": "markt@apache.org", "creation_time": "2012-05-10T20:10:28Z", "is_private": false}, {"count": 6, "attachment_id": null, "bug_id": 53062, "is_private": false, "id": 160542, "time": "2012-07-09T17:00:35Z", "creator": "kpreisser@apache.org", "creation_time": "2012-07-09T17:00:35Z", "tags": [], "text": "Hi,\n\nit seems that the URL normalization which has been added to Tomcat 7.0.28 includes the querystring part of the URL in the normalization process.\n\nI'm not 100% sure if the character '/' is allowed to appear unencoded in the query string part, but according to some sites which reference RFC 3986 [1], it is.\n\nAlthough most commonly used URL-encoding methods (like java.net.URLEncoder.encode()) encode the '/' character as \"%2F\", it maybe possible that some applications use that char directly in a querystring, which is then given to response.sendRedirect().\n\nImaging a servlet available at URL\n\n    http://localhost/Test/SomeServlet\n\ncalls\n\n    response.sendRedirect(\"OtherServlet?someText=A/../B\");\n\nthen the resulting HTTP 302 header will be:\n\n    Location: http://localhost/Test/B\n\ninstead of\n\n    Location: http://localhost/Test/OtherServlet?someText=A/../B\n\nso the querystring part is unintentionally modified. Maybe this needs to be fixed?\n\n\n[1] http://www.456bereastreet.com/archive/201008/what_characters_are_allowed_unencoded_in_query_strings/"}, {"attachment_id": null, "tags": [], "bug_id": 53062, "is_private": false, "count": 7, "id": 160543, "time": "2012-07-09T17:36:41Z", "creator": "markt@apache.org", "creation_time": "2012-07-09T17:36:41Z", "text": "Looking at the code, that certainly looks as if it is the case. The query string (if any) should be excluded from the normalization process. I'll add some more unit tests to confirm this is happening and then make any fixes necessary."}, {"count": 8, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Fixed in trunk and 7.0.x and will be included in 7.0.30 onwards.\n\nI think I have covered all the edge cases but if you spot an edge case you think still isn't correct, it should be easy to extend the unit tests to confirm this.", "id": 160546, "time": "2012-07-09T19:13:22Z", "bug_id": 53062, "creation_time": "2012-07-09T19:13:22Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 53062, "is_private": false, "text": "(In reply to comment #8)\n> Fixed in trunk and 7.0.x and will be included in 7.0.30 onwards.\n> \n> I think I have covered all the edge cases but if you spot an edge case you\n> think still isn't correct, it should be easy to extend the unit tests to\n> confirm this.\n\nThanks for the explanation and quick fix. May I get an estimated release date for 7.0.30 please? Our server is currently blocked on this issue. Many thanks!", "id": 161388, "time": "2012-08-14T19:22:25Z", "creator": "wanshoupu@hotmail.com", "creation_time": "2012-08-14T19:22:25Z", "attachment_id": null}, {"count": 10, "attachment_id": null, "bug_id": 53062, "is_private": false, "id": 161401, "time": "2012-08-14T22:21:38Z", "creator": "markt@apache.org", "creation_time": "2012-08-14T22:21:38Z", "tags": [], "text": "7.0.30 will be released when it is ready. As a volunteer organization, the ASF does not commit to release schedules.\n\nWhat I can say is that I try to do a Tomcat 7 release every month. The first task is clearing the current bug back-log and I am currently working on that. Once that is complete the TCKs will need to be run (takes most of a working day) and then the release candidate needs to be built (few minutes). Once we have a release candidate there will need to be a release vote and that takes a minimum of 3 days. This, of course, assumes all goes well.\n\nI would guess (based on my own schedule over the next few weeks) that 7.0.30 is at least 2-3 weeks away.\n\nIf you want 7.0.30 sooner, then providing patches to the open bugs that do not have them is the best way to help out."}]