[{"count": 0, "tags": [], "text": "Created attachment 28581\na simple test reproducing the problem\n\nWe encountered a problem during asynchronous operations (tomcat7 with servlet 3). \nDescription:  \nOne client continuously sends post requests to the server. On the server side for each request created AsyncContext with timeout 20 seconds:\nAsyncContext asyncContext = req.startAsync(req, resp);\n      asyncContext.setTimeout(20000);\nAs expected after approximately 20 sec the requests are completed. Then another client also begins to send requests to the server but in this case they are explicitly completed after 500 milliseconds. Something like this:\nAsyncContext asyncContext = req.startAsync(req, resp);\n      asyncContext.setTimeout(20000);      \n      try {\n         Thread.sleep(500);\n      } catch (Exception e) {\n      }\n\n      asyncContext.complete();\n\nThe problem is that after running the second client all requests that are waiting for timeout (from the first client) are stuck and not released (onTimeout method of AsyncEvent is not called) until the second client stops sending requests.\nIt looks like the problem occurs on Linux but not on Windows.\n\nI attached a simple test that may help to reproduce this issue. The following servlet accepts URL parameter “complete”.\nWhen “complete=1” the request will be completed after 500ms.\nOtherwise the request will wait till timeout (20 seconds).\nRun client that periodically sends requests to /servlet?complete=0. (I have tested it with 10 parallel threads that run in a loop)\nThen run another client that periodically sends requests to /servlet?complete=1 (This client can use only a single thread)\nSee that the first client does not receive any responses while the second client is running.", "attachment_id": 28581, "id": 157928, "creator": "vyacheslav.trainin@playtech.com", "time": "2012-04-11T07:30:35Z", "bug_id": 53061, "creation_time": "2012-04-11T07:30:35Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 53061, "is_private": false, "id": 157930, "time": "2012-04-11T07:46:56Z", "creator": "vyacheslav.trainin@playtech.com", "creation_time": "2012-04-11T07:46:56Z", "tags": [], "text": "Reproduced on: \n - tomcat-7.0.23, 7.0.25 and 7.0.26\n - java 64 bit 1.6.0_18 and  1.6.0_29\n - Linux CentOS release 5.6 (Final) 64 bit\n - NIO connector"}, {"count": 2, "tags": [], "text": "I extracted the key elements from this test case into my own test web application as thay as quicker than downloading Maven, installing it and figuring out how to use it.\n\nThe test worked for me on both Linux and Windows using the NIO connector.\n\nIf you still see this problem, feel free to re-open this issue but you will need to provide a ready-to-run WAR that demonstrates the issue along with the source for that WAR.", "attachment_id": null, "bug_id": 53061, "id": 158937, "time": "2012-05-09T20:24:35Z", "creator": "markt@apache.org", "creation_time": "2012-05-09T20:24:35Z", "is_private": false}, {"count": 3, "tags": [], "text": "Created attachment 28754\nwar\n\nAdded war to the provided souorce", "is_private": false, "bug_id": 53061, "id": 158945, "time": "2012-05-10T07:59:00Z", "creator": "vyacheslav.trainin@playtech.com", "creation_time": "2012-05-10T07:59:00Z", "attachment_id": 28754}, {"count": 4, "tags": [], "creator": "vyacheslav.trainin@playtech.com", "attachment_id": null, "text": "We still have this problem and it is a critical for our project. I attached a war file and reopened the issue.", "id": 158946, "time": "2012-05-10T08:03:19Z", "bug_id": 53061, "creation_time": "2012-05-10T08:03:19Z", "is_private": false}, {"count": 5, "tags": [], "text": "Thanks for that. I can now re-produce it. I can also reproduce it on Windows. The key to reproducing it is to refresh the browser more frequently then once a second - the faster the refresh the clearer the reproduction.\n\nLooking at the NIO source code, there is a test that essentially means that timeouts only get processed after one second of inactivity so under high, constant load, timeouts will never be processed.\n\nI find it hard to believe it has always been like that so I'll need to go back and research who changed it (probably me), when it changed (probably the refactoring) and why it changed (probably an error on my part). I should be able to get that done pretty quickly.", "attachment_id": null, "bug_id": 53061, "id": 158951, "time": "2012-05-10T10:30:12Z", "creator": "markt@apache.org", "creation_time": "2012-05-10T10:30:12Z", "is_private": false}, {"count": 6, "attachment_id": null, "creator": "markt@apache.org", "is_private": false, "id": 158959, "time": "2012-05-10T17:47:37Z", "bug_id": 53061, "creation_time": "2012-05-10T17:47:37Z", "tags": [], "text": "For once, it wasn't an issue triggered by the refactoring. It looks like a long standing issue that just hasn't been noticed before now.\n\nThis has been fixed in trunk and 7.0.x and will be included in 7.0.28 onwards."}]