[{"count": 0, "tags": [], "creator": "lmpmbernardo@gmail.com", "text": "Created attachment 28624\npatch\n\nIf a block-container element has the overflow attribute set to error-if-overflow and the content inside the container does overflow then FOP:\n- throws an exception if the overflow is BPD (block progression direction)\n- emits a warning if the overflow is IPD (inline progression direction)\nThe attached patch tries to fix this inconsistency in behavior by issuing an error message in both cases; also, if the overflow attribute is set to something else, a warning message is issued instead.", "id": 158135, "attachment_id": 28624, "bug_id": 53094, "creation_time": "2012-04-17T13:54:46Z", "time": "2012-04-17T13:54:46Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 53094, "text": "Created attachment 28625\ntest case and output\n\nThe attached files are:\n- a test.fo file to check the issue\n- the console output before and after the fix\n- the PDF output file", "id": 158136, "time": "2012-04-17T13:57:17Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-04-17T13:57:17Z", "is_private": false, "attachment_id": 28625}, {"count": 2, "text": "patch landed at http://svn.apache.org/viewvc?rev=1327157&view=rev\n\nthanks, and good work luis!", "bug_id": 53094, "attachment_id": null, "id": 158144, "time": "2012-04-17T16:20:44Z", "creator": "gadams@apache.org", "creation_time": "2012-04-17T16:20:44Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 53094, "attachment_id": null, "id": 158425, "time": "2012-04-25T14:49:59Z", "creator": "vhennebert@gmail.com", "creation_time": "2012-04-25T14:49:59Z", "is_private": false, "text": "The inconsistency is still there if the overflow property has been set on a region (e.g., region-before).\n\nThe overflow shouldn't be handled by LineLM at all as that class does not have the necessary information to decide whether to issue a warning or throw an error. Some overflow event should instead be triggered on its parent LM that will handle it if it can, or pass it on to its parent and so on.\n\nVincent"}, {"count": 4, "tags": [], "creator": "gadams@apache.org", "text": "(In reply to comment #3)\n> The inconsistency is still there if the overflow property has been set on a\n> region (e.g., region-before).\n> \n> The overflow shouldn't be handled by LineLM at all as that class does not have\n> the necessary information to decide whether to issue a warning or throw an\n> error. Some overflow event should instead be triggered on its parent LM that\n> will handle it if it can, or pass it on to its parent and so on.\n\nluis, can you provide a new patch to address this?", "id": 158428, "attachment_id": null, "bug_id": 53094, "creation_time": "2012-04-25T15:28:33Z", "time": "2012-04-25T15:28:33Z", "is_private": false}, {"count": 5, "tags": [], "creator": "lmpmbernardo@gmail.com", "attachment_id": null, "text": "sure, but this patch was intentionally of limited scope. as the title and the description says, it was only meant to address the inconsistency in error/warn messages in a block container with the overflow attribute set to error-if-overflow. the fact that it does not address possible similar inconsistencies when overflow happens in other elements is not a surprise. in fact I knew it didn't address that. nevertheless, I do agree that extending this patch to handle some other overflow situations is a good idea and I will look into that.\n\nfor testing purposes then, it would be helpful to have a sample FO file that causes all kinds of overflows messages meant to be handled by the new patch. so Vincent, since you raised the issue, would you like to provide the example FO file?", "id": 158458, "time": "2012-04-26T21:37:44Z", "bug_id": 53094, "creation_time": "2012-04-26T21:37:44Z", "is_private": false}, {"count": 6, "tags": [], "creator": "gadams@apache.org", "is_private": false, "id": 158461, "attachment_id": null, "bug_id": 53094, "creation_time": "2012-04-27T00:42:03Z", "time": "2012-04-27T00:42:03Z", "text": "i would rather close this bug and open a new bug to address a similar problem in region-*; that new bug can include a reference to this bug in its descriptive information"}]