[{"count": 0, "tags": [], "bug_id": 53111, "is_private": false, "text": "As the following article explains, \"Nearly 1% of websites built with a content management system (like WordPress or Joomla) are unknowingly exposing their database password to anyone who knows where to look.\"\n\nhttps://www.feross.org/cmsploit/\n\nThis is due to a complex interaction between Apache, the user's text editor, and the way those content management systems are configured.  The root problem is that if the user is editing a file like wp-config.php and the user's connection drops, then a backup file like wp-config.php~ is saved within the web root.  Apache understands that a .php file should be run, not returned in cleartext; but Apache doesn't know anything about .php~ files.  Consequently, Apache will return the entire contents of the file, in clear text -- exposing any passwords that may be stored in that file.\n\nI think there is an opportunity for Apache's default install to help protect against this sort of failure.  And, seeing as today it affects 1% of an important class of web sites, I think that would be a valuable improvement to Apache.\n\nOne plausible defense: Apache's default installation could recognize text editor backup files and could (in its default configuration) refuse to serve them.\n\nA simple approximation at this would be to add .php~, .php#, cgi~, .cgi#, .save, .swp, swo to the list of recognized extensions, and refuse to serve files with that extension (in Apache's default configuration).  Basically, this is building a blacklist of files that Apache is not going to serve (in its default configuration).\n\nAs a variant on this idea, the essay above suggests a rule like this:\n\n<Files ~ “(^#.*#|~|\\.sw[op])$”>\nOrder allow,deny\nDeny from all\n</Files>\n\nSee also:\n\nhttp://nmap.org/nsedoc/scripts/http-config-backup.html\nhttp://wordpress.org/support/topic/attack-against-wp-configphp-with-a-tilde\nhttp://blog.tigertech.net/posts/wordpress-security-thoughts/", "id": 158213, "time": "2012-04-20T06:42:17Z", "creator": "daw-bugzilla@taverner.cs.berkeley.edu", "creation_time": "2012-04-20T06:42:17Z", "attachment_id": null}]