[{"count": 0, "tags": [], "creator": "humbedooh@apache.org", "is_private": false, "text": "Created attachment 28657\npatch to allow for class tags within code elements\n\nI would like to propose we update common.dtd to be able to handle class tags inside <code> elements, so as to enable highlighting support for source code snippets without the build system complaining about undeclared tags. I have included a patch for this purpose, but I'd like some form of okay before committing this to the trunk.\n\nThis would, presumably, be accompanied by an update to the style sheet (or, if possible, the addition of a new style sheet that only applies to pages with highlighting, but I'm not sure whether this is possible at the moment)", "id": 158298, "time": "2012-04-23T09:07:02Z", "bug_id": 53132, "creation_time": "2012-04-23T09:07:02Z", "attachment_id": 28657}, {"count": 1, "attachment_id": null, "bug_id": 53132, "text": "I think you mean class attributes to the <code> tag.\n\nI don't see how this really enables syntax highlighting, since it only offers capacity to apply a single style to an entire <code> element.  Syntax highlighting beyond the trivial is surely better automated?", "id": 158299, "time": "2012-04-23T10:20:16Z", "creator": "nick@webthing.com", "creation_time": "2012-04-23T10:20:16Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "humbedooh@apache.org", "is_private": false, "text": "It doesn't in itself enable syntax highlighting, no, but it would enable me to use styles within a <code> tag without breaking from the DTD, which could then be used to highlight the code and validate the XML at the same time.\n\nSo yes, this would be for manual syntax highlighting, which is what I have had to do all along, as no one seems to be able to say \"I have a solution, this is how we do it automatically\" and actually get it done.", "id": 158300, "time": "2012-04-23T12:52:13Z", "bug_id": 53132, "creation_time": "2012-04-23T12:52:13Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 53132, "text": "I hope you don't expect these solutions magically happening within the hour. The topic is just a few days old. Also see my suggestion on the list.", "id": 158301, "time": "2012-04-23T13:26:42Z", "creator": "nd@perlig.de", "creation_time": "2012-04-23T13:26:42Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 53132, "is_private": false, "id": 158302, "attachment_id": null, "creator": "humbedooh@apache.org", "creation_time": "2012-04-23T13:35:40Z", "time": "2012-04-23T13:35:40Z", "text": "No, I don't foresee a magical change during the night, besides I don't have any spare teeth to put under my pillow :)\n\nThis is why I proposed the laxer version of common.dtd, so that it would, for the time being, be possible to allow for a manual highlighting instead, until a solution is properly evaluated and constructed at some point. I know full well that these things don't occur over night, and I'm not expecting them to do so either, I was merely being grumpy in my choice of words."}, {"count": 5, "tags": [], "text": "Closing, as we're now discussing other measures to deal with this issue :)", "is_private": false, "id": 158383, "creator": "humbedooh@apache.org", "time": "2012-04-24T16:30:45Z", "bug_id": 53132, "creation_time": "2012-04-24T16:30:45Z", "attachment_id": null}]