[{"count": 0, "tags": [], "bug_id": 53148, "text": "Created attachment 28684\npatch Patch for class o.a.f.fonts.type1.AFMParser that improves performance & java source files that points the issue.\n\nUsing Apache FOP 1.0 to create Postscript documents from xml files after upgrading the Java Virtual Machine from 1.6 update 18 to 1.6 update 19, important performance degradation was observed. The FOP execution time was increased about 25% - 35%. After investigating this, we concluded that the code that was responsible for this delay was in the method setValue of inner class BeanSetter of class o.a.f.fonts.type1.AFMParser. This method uses reflection to set the value of a bean and our tests showed that the time to execute a reflection call like this was increased in jdk6 u19. \nIn the attached files may be found a patch for class o.a.f.fonts.type1.AFMParser that improves performance. Also the attachment contains a Java file with a minimal fo and configuration that shows the issue. It contains a main class where fop converts the fo file to postscript 500 times.\n\nBelow may  be found the execution times for the provided test using the mentioned versions of Java (Windows 7 x64).\n \nJava 6 update 18 it takes 30754 msec.\nJava 6 update 19 it takes 54263 msec.\n\nAfter applying the patch: \n\nJava 6 update 18 it takes 34240 msec.\nJava 6 update 19 it takes 32501 msec.\n\nThe svn revision from which the patch was created is revision #1330050 from trunk.", "id": 158423, "time": "2012-04-25T14:02:32Z", "creator": "tcharoulis@gmail.com", "creation_time": "2012-04-25T14:02:32Z", "is_private": false, "attachment_id": 28684}, {"count": 1, "tags": [], "bug_id": 53148, "attachment_id": null, "text": "patch applied at http://svn.apache.org/viewvc?rev=1330317&view=rev\n\nplease let me know if this resolves the problem", "id": 158426, "time": "2012-04-25T14:50:25Z", "creator": "gadams@apache.org", "creation_time": "2012-04-25T14:50:25Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 53148, "is_private": false, "text": "Thank your for applying the patch. This resolves the issue.", "id": 158429, "time": "2012-04-25T15:42:21Z", "creator": "tcharoulis@gmail.com", "creation_time": "2012-04-25T15:42:21Z", "attachment_id": null}]