[{"count": 0, "tags": [], "creator": "pauljerald@gmail.com", "attachment_id": 28676, "text": "Created attachment 28676\njmx script file which explains the bug in simple manner\n\ni tried with defining two variables test1 and test2 with values 10 and 20 respectively using user defined variables. both variables are used inside the function __intSum and the variables used are resolved and expression is executed with out any error. But if i use the variable created using regular expression extractor, it is not resolved and it throws NumberFormatException in jmeter logs.\n\nI have attached a sample jmx scrript file which sends a GET request to google.com and then extracts a number from its image file name using REE and assigning that value to variable test3. This variable test3 is not resolved inside the function __intSum and it throws NumberFormatException.", "id": 158409, "time": "2012-04-25T10:42:04Z", "bug_id": 53145, "creation_time": "2012-04-25T10:42:04Z", "is_private": false}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 158413, "time": "2012-04-25T11:59:18Z", "bug_id": 53145, "creation_time": "2012-04-25T11:59:18Z", "is_private": false, "text": "The problem is that the function is being evaluated before the variable has been defined.\n\nUse the test plan toe initialise test3 as a valid number (e.g. 1) and the test will then work.\n\nHowever, this does point to a possible bug in JMeter - I'm not yet sure why the function is being executed at test startup. If it's necessary to do so, the code could perhaps be more tolerant of the error."}, {"count": 2, "tags": [], "text": "URL: http://svn.apache.org/viewvc?rev=1330236&view=rev\nLog:\nBug 53145 - HTTP Sampler - function in path evaluated too early\n\nModified:\n   jmeter/trunk/src/protocol/http/org/apache/jmeter/protocol/http/sampler/HTTPSamplerBase.java\n   jmeter/trunk/xdocs/changes.xml\n\n\nTidied up code so it only extracts the property value if it's a StringProperty.\nPreviously the debug statements were executing the function as part of building their string parameters.", "is_private": false, "id": 158418, "creation_time": "2012-04-25T12:27:02Z", "time": "2012-04-25T12:27:02Z", "creator": "sebb@apache.org", "bug_id": 53145, "attachment_id": null}]