[{"count": 0, "text": "http://httpd.apache.org/docs/trunk/en/mod/mod_rewrite.html#rewriterule says:\n\nPattern is a perl compatible regular expression. On the first RewriteRule, it is matched against the (%-decoded) URL-path (or file-path, depending on the context) of the request.\n\nI think the second parenthesis is wrong, or at least unclear. To put it simply:\nWhat is the file-path of a request?\n\nfile-path is defined as:\nThe path to a file in the local file-system beginning with the root directory as in /usr/local/apache/htdocs/path/to/file.html. Unless otherwise specified, a file-path which does not begin with a slash will be treated as relative to the ServerRoot.\n\nJust below the problematic sentence, a box expands on what is matched:\nIn Directory and htaccess context, the Pattern will initially be matched\nagainst the filesystem path, after removing the prefix that led the server to\nthe current RewriteRule (e.g. \"app1/index.html\" or \"index.html\" depending on\nwhere the directives are defined).\n\nI find this less bad, although one may ask *which* filesystem path this refers\nto.\n\nThe parenthesis was added recently (see #52000 for background).", "bug_id": 53153, "attachment_id": null, "id": 158453, "time": "2012-04-26T16:48:33Z", "creator": "chealer@gmail.com", "creation_time": "2012-04-26T16:48:33Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 53153, "attachment_id": null, "id": 182370, "creation_time": "2015-04-14T19:21:24Z", "time": "2015-04-14T19:21:24Z", "creator": "rbowen@apache.org", "text": "Resolved (I hope) in r1673529\n\nComments welcome.", "is_private": false}, {"count": 2, "tags": [], "creator": "chealer@gmail.com", "attachment_id": null, "id": 182401, "time": "2015-04-15T18:53:24Z", "bug_id": 53153, "creation_time": "2015-04-15T18:53:24Z", "is_private": false, "text": "Thank you Rich.\nJust to be clear, I have changed job since I filed this and haven't had to use mod_rewrite in 3 years, so I'm even less clear on what the documentation should read. On the other hand, I suppose my reading now resembles more that of the typical reader.\n\nThe sentence now reads:\nOn the first RewriteRule, it is matched against the (%-decoded) URL-path of the request, or, in per-directory context (see below), the URL path relative to that per-directory context.\n\nI do not find \"the URL path relative to that per-directory context\" much clear. If \"URL path\" means \"URL-path\", the documentation says URL-path is \"A DocumentRoot-relative path\", so this seems to contradict.\n\nIn https://bz.apache.org/bugzilla/show_bug.cgi?id=52000#c11 I suggested\n\"the request's path relative to the directory for which the rule is defined\" but I don't know if this is clear.\n\nI would suggest \"the part of URL-path following the path to the directory for which the rule is defined\".\n\n\nBy the way, in the sentence before, \"perl compatible regular expression\" could be replaced with \"regex\", defined in http://httpd.apache.org/docs/trunk/en/mod/directive-dict.html#Syntax"}, {"count": 3, "text": "See ticket 57911 for a follow-up about the new phrasing.", "bug_id": 53153, "attachment_id": null, "id": 182909, "time": "2015-05-09T15:56:14Z", "creator": "chealer@gmail.com", "creation_time": "2015-05-09T15:56:14Z", "tags": [], "is_private": false}]