[{"count": 0, "tags": [], "creator": "me@davidsansome.com", "text": "Created attachment 28688\nAdd a SSLCARevocationAllowMissing option\n\nIn Apache 2.3.15 the CRL validation behaviour was changed to fail with an \"unable to get certificate CRL\" error if a client tried to connect with a certificate that was signed by a CA that did not have a CRL configured.\n\nI've attached a patch that adds a SSLCARevocationAllowMissing option to restore the old behaviour.", "id": 158481, "time": "2012-04-27T13:53:08Z", "bug_id": 53156, "creation_time": "2012-04-27T13:53:08Z", "is_private": false, "attachment_id": 28688}, {"count": 1, "tags": [], "bug_id": 53156, "is_private": false, "text": "Why doesn't SSLCARevocationCheck none solve your problem (which is the default value btw)?", "id": 158485, "time": "2012-04-27T14:50:58Z", "creator": "rpluem@apache.org", "creation_time": "2012-04-27T14:50:58Z", "attachment_id": null}, {"count": 2, "text": "If I have CRLs for some CAs in the chain but not others then SSLCARevocationCheck none/chain will only let me either allow everything or deny everything - I can't tell it to check the ones that I have CRLs for but ignore the rest.\n\nThe long answer is that I'm working on an embedded appliance that uses Apache - we want to upgrade it from 2.2 to 2.4, but some users might have already added CRLs to their systems.  We could default the SSLCARevocationCheck option to None, which would lower security for the people who were using CRLs, or we could default it to Chain, which would completely lock out people who were using client certificate checking without CRLs.  Adding this option back in makes sure we don't break anybody.", "creator": "me@davidsansome.com", "attachment_id": null, "id": 158486, "time": "2012-04-27T15:10:25Z", "bug_id": 53156, "creation_time": "2012-04-27T15:10:25Z", "tags": [], "is_private": false}, {"count": 3, "text": "There's room for improvement with regards to revocation checking settings in mod_ssl, that's true.\n\nRe-introducing an additional directive which restores the behavior from 2.2 seems like the wrong approach, however. Making revocation checking optional (like the SSLCARevocationAllowMissing boolean would do) is pretty nonsensical, IMO - either you insist on clients having an unrevoked cert or you don't.\n\nConfiguring revocation setting options basically amounts to enforcing a security policy - that's why I added a separate CARevocationCheck directive in r1165056 (which no longer relies on the implicit effects of CARevocationFile/CARevocationPath as in 2.2). Instead of introducing yet another directive, we should consider extending the syntax/options of SSLCARevocationCheck.\n\nOne thing I was thinking about when working on r1165056 was to make revocation checking succeed if the \"unrevoked\" status can be determined from either the CRL or an OCSP response. Currently, if CRL and OCSP checking is enabled, *both* have to succeed.\n\nFinally, let me point out that there's an inherent issue with the proposed patch: if mod_ssl unconditionally ignores X509_V_ERR_UNABLE_TO_GET_CRL errors when \"AllowMissing\" is enabled, then it's no longer possible to reliably enforce revocation checking for those CAs which do have CRLs (mod_ssl wouldn't complain when the CRL can't be found, it would just silently proceed).", "bug_id": 53156, "attachment_id": null, "id": 158508, "time": "2012-04-29T08:26:08Z", "creator": "asfbugz@velox.ch", "creation_time": "2012-04-29T08:26:08Z", "tags": [], "is_private": false}]