[{"count": 0, "tags": [], "text": "Created attachment 28702\npatch against trunk\n\nThe attached patch disables chunking on if there is a Connection: close header, we're on HTTP 1.1 and there's no Content-Length header.\n\nThis helps to implement Server-Sent Events [1]. Server-Sent Event are conceptually similar to the forever streaming iframe in the sense that there's an \"infinite\" response from the server that always gets updated. But they're easier to use and with less issues. They are also easier to use than WebSockets if you don't need a back channel.\n\nThe specification reccoments to disable chunking. Jetty implements the same behavior, when there's a Connection: close header it doesn't do chunking.\n\nThe following discussion [2] leads me to believe that patches would be welcome. The patch comes with unit tests that verify that there is still chunking happending when there is no Connection: close header.\n\n [1] http://dev.w3.org/html5/eventsource/#notes\n [2] http://tomcat.10.n6.nabble.com/How-to-disable-chunked-encoding-for-the-Http11NioProtocol-connector-td2038448.html", "attachment_id": 28702, "bug_id": 53169, "id": 158698, "time": "2012-05-01T09:35:06Z", "creator": "kustos@gmx.net", "creation_time": "2012-05-01T09:35:06Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 53169, "is_private": false, "id": 159528, "time": "2012-05-30T14:17:11Z", "creator": "markt@apache.org", "creation_time": "2012-05-30T14:17:11Z", "tags": [], "text": "The general approach is fine although I have made a number of changes to the patch:\n- The Servlets in the unit tests should exist in the test class that uses them\n- There is no need use the test webapp for these unit tests\n- Use more of the built-in infrastructure for making a request\n- Improved the checking of the response headers \n\nThese changes identified that the Connection: close header was being set twice. It isn't illegal but it might confuse some clients. I added some additional code to prevent this.\n\nThe change has been made to trunk and 7.0.x and will be included in 7.0.28 onwards."}, {"attachment_id": null, "tags": [], "bug_id": 53169, "text": "Thanks for cleaning up an applying.", "count": 2, "id": 159581, "time": "2012-06-01T05:47:34Z", "creator": "kustos@gmx.net", "creation_time": "2012-06-01T05:47:34Z", "is_private": false}]