[{"count": 0, "tags": [], "bug_id": 53174, "attachment_id": null, "is_private": false, "id": 158712, "time": "2012-05-01T13:58:04Z", "creator": "fhanik@apache.org", "creation_time": "2012-05-01T13:58:04Z", "text": "http://svn.apache.org/viewvc?view=revision&revision=1099855\n\nThis feature automatically sets maxConnections to maxThreads. It has a negative effect for the following reasons\n\n1. It completely changes behavior from Tomcat 6 to 7, and unless one reads the fine print, one will never find out\n\n2. In servlet 3.0, with the introduction of async servlets, there is a way to keep a connection open without having a worker thread associated with it.\n\nFor case 2. the system SHOULD be able to handle this type of usage through its default configuration. \n\nReverting this fix, and correcting the documentation has no foreseeable impact on systems that get upgraded with the next release of Tomcat"}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "Read the following for background:\nhttp://tomcat.markmail.org/thread/wmirgjskvkm4x52k\n\nre point 1 - r1099855 should ensure that the behaviour is the same for both Tomcat 6 and Tomcat 7.\n\nre point 2 - That is true for write but not true for read. With maxConnections > maxThreads and blocking IO there is always the risk that a connection with data to read is unable to acquire a thread while all threads are tied up by connections without data to read.\n\nReverting the fix has significant impact since it opens up the risk of problems as described in the thread from a year ago.\n\nWith the increasing move towards async, there is an increasinglg strong argument for making NIO rather than BIO the default and potentially going as far as dropping the BIO connector all together but that is a debate that belongs on the dev list not on this issue.", "id": 158713, "time": "2012-05-01T14:09:05Z", "bug_id": 53174, "creation_time": "2012-05-01T14:09:05Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 53174, "text": "(In reply to comment #1)\n> \n> With the increasing move towards async, there is an increasinglg strong\n> argument for making NIO rather than BIO the default and potentially going as\n> far as dropping the BIO connector all together but that is a debate that\n> belongs on the dev list not on this issue.\n\nAgreed.", "count": 2, "id": 158717, "time": "2012-05-01T14:57:56Z", "creator": "fhanik@apache.org", "creation_time": "2012-05-01T14:57:56Z", "is_private": false}]