[{"count": 0, "tags": [], "creator": "rmeyer@hotmail.co.uk", "attachment_id": null, "text": "", "id": 158738, "time": "2012-05-02T13:33:56Z", "bug_id": 53177, "creation_time": "2012-05-02T13:33:56Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 28708\nCode changes applied including a test case\n\nA new dependency to Mockito has been added for the test case", "attachment_id": 28708, "id": 158739, "creator": "rmeyer@hotmail.co.uk", "time": "2012-05-02T13:38:20Z", "bug_id": 53177, "creation_time": "2012-05-02T13:38:20Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 53177, "attachment_id": null, "id": 158740, "time": "2012-05-02T14:06:51Z", "creator": "rmeyer@hotmail.co.uk", "creation_time": "2012-05-02T14:06:51Z", "is_private": false, "text": "PostScript documents are by default drawn from the bottom up, because of this FOP changes the Y axis for each generated PS file so everything on the page is inverted and can be displayed in the same way as other document types such as PDF. \n\nIf however, an SVG drawing co-ordinates were specified from the top down, a custom transform would need to be applied to counter FOP's automatic switch. The problem was that a checkTransform method prevented any new transform matching the current page transform from being applied. This original intention of this checkTransform method was to reduce the number of times the same transform is applied to the postscript file thus reducing its size. This is because if a transform is applied to an SVG drawing, for each shape being drawn the transform is applied at the shape level instead of at a drawing or subsequent svg parent level.\n\nWhere the checkTransform method fails is that it only checks for one outcome which is the initial page transform which in this case causes the problem. If you change the transform to invert the drawing by one pixel less e.g. [ ... 791 ] instead of [ ... 792 ] the transform would be applied on each shape and it would appear correctly (albeit a little off centre). This is because the transform is applied for the shape and then the graphics state is reverted meaning the current page state is never changed and the only transform it would ever ignore would be one matching the original FOP inversion transform.\n\nAs such I have removed this method and added a test unit case to prove it is now concatenating the affine transform correctly. The checkTransform method was a good idea, but due to the way Batik, Fop and XGC passing transforms onto child objects this is not currently possible to implement a fix and subsqeuent reduction in PS file sizes."}, {"count": 3, "tags": [], "bug_id": 53177, "text": "patch landed at:\n\nhttp://svn.apache.org/viewvc?rev=1333076&view=rev\nhttp://svn.apache.org/viewvc?rev=1333077&view=rev\n\nthanks rmeyer! please verify and close if satisfied", "id": 158742, "time": "2012-05-02T15:38:21Z", "creator": "gadams@apache.org", "creation_time": "2012-05-02T15:38:21Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Thanks for applying this patch Glenn, I added the Hamcrest JAR to which Mockito has a transitive dependency r1333083.", "is_private": false, "bug_id": 53177, "id": 158745, "time": "2012-05-02T15:52:42Z", "creator": "med1985@gmail.com", "creation_time": "2012-05-02T15:52:42Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 53177, "attachment_id": null, "id": 158747, "time": "2012-05-02T15:57:15Z", "creator": "gadams@apache.org", "creation_time": "2012-05-02T15:57:15Z", "is_private": false, "text": "(In reply to comment #4)\n> Thanks for applying this patch Glenn, I added the Hamcrest JAR to which\n> Mockito has a transitive dependency r1333083.\n\nthanks; i guess the current xgc junit doesn't tickle that dependency since it ran without error after i added mockito and objenesis jars"}, {"count": 6, "tags": [], "text": "Yeah, no biggy. Hamcrest is needed for some of the matchers that Mockito uses which Rob hasn't used here.", "is_private": false, "bug_id": 53177, "id": 158748, "time": "2012-05-02T15:59:51Z", "creator": "med1985@gmail.com", "creation_time": "2012-05-02T15:59:51Z", "attachment_id": null}, {"count": 7, "tags": [], "text": "Thanks for applying the patch. I have verified the changes and will now set the status to closed / fixed.", "attachment_id": null, "bug_id": 53177, "id": 158773, "time": "2012-05-03T08:21:32Z", "creator": "rmeyer@hotmail.co.uk", "creation_time": "2012-05-03T08:21:32Z", "is_private": false}]