[{"count": 0, "tags": [], "bug_id": 53206, "attachment_id": 28745, "text": "Created attachment 28745\nhttpd-ssl.conf\n\nHi,\n\nWe have requirement of reading client certificate thru the java sdk and validate the certificate\n1)I have configured all the required ssl protocol, keystore,keyStroePassword and trustStore in the java environment variables.\n-Djava.protocol.handler.pkgs=com.sun.net.ssl.internal.www.protocol \n-Djavax.net.ssl.trustStore=\"C:/clientcertificate/trustkeystore.jks\" \n-Djavax.net.ssl.keyStore=\"c:/clientcertificate/keystore\" \n-Djavax.net.ssl.keyStorePassword=test123\n\n2)When execute the url(https://hostname:443/test.php) thorugh the java sdk some reasons not able to pass the apache environment variable(SSL_CLIENT_CERT).\n\nCan you please varify the issue,in case missing anything in the configuration?\nor \nis it a bug in the apache when running thru the java sdk?\n\nHere ssl handshake is happening properly between sdk and apache webserver.\n\n3)When execute the url(https://hostname:443/test.php) thorugh the web browser prompting for the client certificate in the browser and selected the already installed client certificate and displayed all the apache environment variables including(SSL_CLIENT_CERT).\n\nI have attached ssl configuration file used.\n\nThanks\nVenkata", "id": 158913, "time": "2012-05-09T06:03:33Z", "creator": "venkata.reddy@trianz.com", "creation_time": "2012-05-09T06:03:33Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 53206, "text": "This bugzilla is for reporting suspected bugs in Apache HTTP Server, not a support forum for questions, configuration assistance, support, or systems analysis.\n  \nPerhaps someone on the Apache HTTP Server users list can help you determine what's going on with your system, and if this due diligence points to an Apache HTTP Server bug, reopen this ticket with a rigorous description that illustrates (via verbatim error messages, configurations, logs, packet captures, etc) the misbehavior in Apache HTTP Server. \n \nhttp://httpd.apache.org/userslist.html", "id": 158924, "time": "2012-05-09T10:33:39Z", "creator": "covener@gmail.com", "creation_time": "2012-05-09T10:33:39Z", "is_private": false, "attachment_id": null}]