[{"text": "Created attachment 28774\nnot working XSL\n\nAfter replacing org.apache.poi.hssf.usermodel.HSSFWorkbook by its streaming equivalent org.apache.poi.xssf.streaming.SXSSFWorkbook in \nthe AddDimensionedImage.java sample:\n\npackage org.apache.poi.ss.examples;\npublic class AddDimensionedImage {\n\tpublic static void main(String[] args) {\n\t\tWorkbook workbook = null;\n\t\t//...\n            //workbook = new HSSFWorkbook();\n            workbook=new SXSSFWorkbook(100);\n\t\t//...\n\t}\n}\n\nthe image supplied as command parameter is no longer rendered at all, i.e. the cell is resized correctly but the image is not visible.\n\nThe used POI version is the latest stable one (3.8-20120326).", "tags": [], "bug_id": 53227, "is_private": false, "count": 0, "id": 159025, "time": "2012-05-14T08:10:33Z", "creator": "edwin.roth@unycom.com", "creation_time": "2012-05-14T08:10:33Z", "attachment_id": 28774}, {"count": 1, "tags": [], "bug_id": 53227, "text": "Created attachment 28775\nworking workbook", "id": 159026, "time": "2012-05-14T08:11:11Z", "creator": "edwin.roth@unycom.com", "creation_time": "2012-05-14T08:11:11Z", "is_private": false, "attachment_id": 28775}, {"count": 2, "tags": [], "creator": "markbrdsly@tiscali.co.uk", "text": "The AddDimensionedImmage example applied to the older binary workbook format accessible through HSSF. SXSSF addresses the OOXML file format and I never tested it for that version of the file format. Can I ask you please to undertake a small test? Would you use XSSF - not SXSSF - to create a workbook and use the AddDimensionedImage approach to add an image to a sheet within a workbook? If you are still unable to see the image in that workbook when you open it with Excel then it may well be that the approach outlined in AddDimensionedImage is not applicable to OOXML workbooks.\n\nThinking about it slightly further, it is likely that you cannot use this approach as I do know that the image will be dimensioned in EMU's - English Metric Units - in the OOXML workbook. Still, I would ask you to try if you are willing please.\n\nYours\n\nMark B", "id": 159037, "time": "2012-05-14T16:11:06Z", "bug_id": 53227, "creation_time": "2012-05-14T16:11:06Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 53227, "text": "Just had a quick look at your example workbook and I am beginning to think that it is a units issue. Looking at the markup in drawing1.xml it seems as though the image has been added to the worksheet successfully - the information for the anchor is there and shows the image occupying the whoe of a cell with the offsets 255 and 1023 but I wonder if this is actually correct. I need to create a workbook with an image that occupies the whole of a cell and look at the markup for that. Will post once I find a definitive answer.\n\nMark B", "id": 159039, "time": "2012-05-14T16:54:55Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2012-05-14T16:54:55Z", "is_private": false, "attachment_id": null}, {"text": "Just had a check and it is a problem with the way the offset is specified when the image occupies the whole of a cell.\n\nThe older binary format used a different system and the values 255 and 1023 were enough to indicate the full width and height of the cell. With the move to use EMU in OOXML these values no longer hold true and I will need to amend the code to set the values appropriately. Without taking a closer look, I think that it should just be a matter of converting from the older units into EMU's but am not sure and need to take a closer look. Sadly, I do not know when I will have the time to devote to this task so it might be worthwhile taking a look at it yourself in the interim. If I make any progress I will post to this thread and would ask that you do likewise if you make any progress.\n\nMark B", "tags": [], "bug_id": 53227, "is_private": false, "count": 4, "id": 159040, "time": "2012-05-14T17:04:24Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2012-05-14T17:04:24Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 53227, "text": "If you take a look at the XSSFShape class, there is a constant defined called something like EMUS_PER_PIXEL. As a quick fix, I think all that you need to do is to multiply the offsets - the cx1, dy1, etc values - by this to see your image correctly sized.\n\nLater today, I should have the chance to get my hands on a copy of the source for AddDimensionedImage and will try this fix to prove that it does work. If it does, the updated version will be attached to this bug report later today or early tomorrow morning.\n\nThanks for bringing this problem to my attention.\n\nMark B", "id": 159057, "time": "2012-05-15T06:42:11Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2012-05-15T06:42:11Z", "is_private": false, "attachment_id": null}, {"count": 6, "attachment_id": 28780, "bug_id": 53227, "is_private": false, "id": 159062, "time": "2012-05-15T11:06:36Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2012-05-15T11:06:36Z", "tags": [], "text": "Created attachment 28780\nAddDimensionedImage modifed to work with OOXML\n\nTemporary fix for the missing image problem when working with OOXML files. The complete fix needs a modification to the way offsets are calculated and will be ready by the end of the week."}, {"count": 7, "tags": [], "creator": "markbrdsly@tiscali.co.uk", "text": "Created attachment 28799\nCorrected AddDimensionedImage.java to support XSSF/SXSSF\n\nModified AddDimensionedImage.java to support XSSF/SXSSF. It still is not quite as accurate as the HSSF version as testing has revealed discrepancies of up to 2mm when setting the size of the image. Further investigation will be needed to correct this and I do suspect a rounding issue compounded by the relatively large number of EMUs per mm (36000) compounding to create a reasonable error. Still, I feel it is satisfactory for most purposes now.", "id": 159127, "time": "2012-05-17T15:13:07Z", "bug_id": 53227, "creation_time": "2012-05-17T15:13:07Z", "is_private": false, "attachment_id": 28799}, {"count": 8, "attachment_id": null, "creator": "yegor@dinom.ru", "text": "Correction applied in r1340027\n\nThanks, Mark", "id": 159151, "time": "2012-05-18T08:22:48Z", "bug_id": 53227, "creation_time": "2012-05-18T08:22:48Z", "tags": [], "is_private": false}, {"count": 9, "tags": [], "creator": "edwin.roth@unycom.com", "text": "Thanks a lot, Mark, for the fix! The precision issue does not matter, the solution is satisfactory for our purposes. Regards Edwin", "id": 159194, "time": "2012-05-21T11:07:17Z", "bug_id": 53227, "creation_time": "2012-05-21T11:07:17Z", "is_private": false, "attachment_id": null}, {"count": 10, "attachment_id": null, "bug_id": 53227, "is_private": false, "id": 159201, "time": "2012-05-21T15:29:47Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2012-05-21T15:29:47Z", "tags": [], "text": "Good to know and thanks for that. Sorry you had the issue, I ought to have been far more through with testing the code after it had been ported to the ss.usermodel but it sort of fell through the cracks so to speak.\n\nYours\n\nMark B"}]