[{"count": 0, "tags": [], "bug_id": 53237, "text": "Created attachment 28783\ntest reproduction file\n\nWhen a TCP connection is opened to a tomcat (6 & 7) instance with tomcat-native installed, the connection is left in 'SYN_RECV' until a request is made or the connections is cleared (within 4 minutes on my system).\n\nIf tomcat-native is not installed on that same system, the TCP connection goes to the 'ESTABLISHED' state.\n\nThe client system where the connection is originating sees the connection as 'ESTABLISHED' and will get errors if it has waited longer than the time before the SYN_RECV connection is cleared to make it's request.\n\nI've attached a small program that shows the error scenario.\n\n1)  Compile and run the attached socketTest.java passing in a hostname/ip as the first argument and a port as the second argument.  i.e.  'java socketTest <host> <port>'\n2)  Run netstat on the system running tomcat/tomcat-native to see the socket connection status.  I used a bash while loop: 'while true; do date; netstat | grep 8080; sleep 10; done'.\n\nWith tomcat-native installed I would see:\ntcp        0      0 <server>:8080 <client>:62848 SYN_RECV\n\nWith no tomcat-native installed I would see:\ntcp        0      0 <server>:8080 <client>:62848 ESTABLISHED\n\ntomcat-native should not prevent these connections from moving to 'ESTABLISHED'", "id": 159076, "time": "2012-05-15T20:54:37Z", "creator": "wilbrandt@iivip.com", "creation_time": "2012-05-15T20:54:37Z", "is_private": false, "attachment_id": 28783}, {"count": 1, "tags": [], "text": "These symptoms were seen with both tomcat 6 and 7, using tomcat-native 1.1.14 and 1.1.22.  Systems were centOS 4.4 32-bit.", "attachment_id": null, "id": 159077, "creator": "wilbrandt@iivip.com", "time": "2012-05-15T21:03:02Z", "bug_id": 53237, "creation_time": "2012-05-15T21:03:02Z", "is_private": false}, {"count": 2, "tags": [], "text": "Your \"Send header\" code does not send anything, because you are using BufferedWriter, and it is named \"buffered\" for a reason. There is also another buffer inside the OutputStreamWriter class.\n\nRegarding handling of incoming connections that do not send any data - see description of \"deferAccept\" attribute in Configuration reference for HTTP connector.\n\nBugzilla is not a support forum. If you have other questions please follow on the users mailing list.", "is_private": false, "bug_id": 53237, "id": 159079, "time": "2012-05-15T21:24:57Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2012-05-15T21:24:57Z", "attachment_id": null}]