[{"count": 0, "tags": [], "bug_id": 5329, "text": "The NT Service \"tomcat.exe\" packaged with Tomcat 4.0.1 final finishes \nexcecution before Tomcat has finished starting up.\n\nWin2k allows administrators to define dependencies on system services. This \nallows admins to tell a service that it must \"wait\" for another service to \nstart before starting itself - in addition when starting a service which is \ndependent on another, the service that is depended on will be started first. \n\nThis allows the admin for instance to tell Apache Service to \"wait\" until the \nTomcat Service has finished starting. This in effect ensures that when Apache \nstarts, Tomcat is already up and running. This is important when not using \nTomcat as a standalone server, becuase Apache tries to connect to Tomcat (via \nwarp or ajp) when it starts up. Since the Tomcat Service exits before Tomcat \nhas started, Apache starts up before Tomcat is fully loaded and cannot create \nconnections to Tomcat.\n\nThis issue exists for Win2k pro and server (SP1 and SP2).", "id": 8715, "time": "2001-12-08T00:20:50Z", "creator": "B_Adept@email.com", "creation_time": "2001-12-08T00:20:50Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 5329, "text": "Many components in Tomcat are created asynchronously, but the connectors are \nnot. So when the Service startup is marked are being over, the connectors have \nalready been started.\nThe behavior of the connector may be inconsistent, in that they may return from \nthe start method before they are ready to accept connections, which in some \ncases (like yours) can cause trouble. For some other connectors, like the HTTP \nconnector, it is much less important than for the native webserver connectors, \nbut unfortunately, all of them are currently based on the same code.\nAnother solution would be to have the native code in Apache be more flexible \nwith the connection handling (and only connect on demand, or something like it).", "id": 8718, "time": "2001-12-08T14:05:42Z", "creator": "remm@apache.org", "creation_time": "2001-12-08T14:05:42Z", "is_private": false, "attachment_id": null}, {"count": 2, "text": "Although more flexible connection handling in Apache might be desireable for \nsome purposes, I do not believe that modifing the native code in Apache to only \nconnect on demand would be a desireable solution to the problem. You would \nstill run into problems for the short time that the connector is not yet ready \nto accept connections, and would also cause clients to recieve a 500 or 404 \nerrors until the connector is ready to accept connections.\n\nChanging the code in Apache (and other native webservers) to accomodate an \nissue caused by an \"inconsistency\" in the Tomcat connectors would be \nundesireable if Tomcat is to remain independent of other software. I firmly \nbelieve that a piece of software (especially services on a server) should \nonly \"claim\" to be ready if it is completly ready for all clients to access the \nservice.", "bug_id": 5329, "attachment_id": null, "id": 8762, "time": "2001-12-10T18:26:38Z", "creator": "B_Adept@email.com", "creation_time": "2001-12-10T18:26:38Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "id": 17241, "time": "2002-06-05T23:40:03Z", "bug_id": 5329, "creation_time": "2002-06-05T23:40:03Z", "is_private": false, "text": "Some additional lifecycle events have now been added in Tomcat 4.1.3\n(AFTER_START_EVENT and AFTER_STOP_EVENT), so it should now be possible to\nenhance the BootstrapService and CatalinaService classes to implement the\nbehavior suggested here."}, {"count": 4, "text": "As Remy noted some time ago, the changes are in place to implement this enhancement.\n\nAs always, proposed patches are always welcome.", "bug_id": 5329, "attachment_id": null, "id": 72720, "time": "2005-03-20T19:14:28Z", "creator": "markt@apache.org", "creation_time": "2005-03-20T19:14:28Z", "tags": [], "is_private": false}, {"count": 5, "text": "This looks like changes will be required to Commons Daemon. I have filed an enhancement request:\nhttps://issues.apache.org/jira/browse/DAEMON-189\n\nMarking as invalid since this isn't a Tomcat issue.", "bug_id": 5329, "attachment_id": null, "id": 142654, "time": "2010-12-13T14:31:53Z", "creator": "markt@apache.org", "creation_time": "2010-12-13T14:31:53Z", "tags": [], "is_private": false}]