[{"count": 0, "tags": [], "creator": "navatski@gmail.com", "attachment_id": 28853, "is_private": false, "id": 159443, "time": "2012-05-29T12:04:51Z", "bug_id": 53316, "creation_time": "2012-05-29T12:04:51Z", "text": "Created attachment 28853\nscreenshots\n\nSome words that can be fit into a one line moved to the following line. In my screenshot (line-width-problem.png) I have big space after word \"interface\". The word \"its\" can fit  in the first line of the paragraph - page witdh allows it. But as a result that word was moved to the second line.\n\nI tried to reduce word \"aaaaaaaaa-aaaaaaaa-integration-pack.zip\" in middle of the paragraph to \"pack.zip\" and as a result the word \"its\" moved to the first line from second (line-width-problem2.png)\n\nThe code of the paragraph looks like\n\n<fo:block font-size=\"10pt\">\n     For performing your tasks, you use the public Web service interface of BSS. This interface its documentation and additional resources, templates, samples, and utilities are provided in the BSS integration package (aaaaaaaaa-aaaaaaaa-integration-pack.zip file). A detailed documentation for these resources is provided as Javadoc. By opening the readme.htm file of the integration package, you can access the available Javadoc documentation as well as the resources themselves.\n</fo:block>\n\nCould you explain what affects to lines break?"}, {"count": 1, "tags": [], "text": "screenshot doesn't help to reproduce what you describe.\nPlease attach (not copy/paste in comment) a short XSL-FO and PDF output that demonstrate what you describe.", "attachment_id": null, "bug_id": 53316, "id": 159444, "time": "2012-05-29T13:08:45Z", "creator": "pascal.sancho@takoma.fr", "creation_time": "2012-05-29T13:08:45Z", "is_private": false}, {"count": 2, "tags": [], "creator": "navatski@gmail.com", "attachment_id": 28854, "is_private": false, "id": 159447, "time": "2012-05-29T13:36:39Z", "bug_id": 53316, "creation_time": "2012-05-29T13:36:39Z", "text": "Created attachment 28854\nnew samples\n\ninput1.fo contains simplified input with \"aaaaaaaaa-aaaaaaaa-integration-pack.zip\" word. input2.fo contains input with \"pack.zip\" word"}, {"count": 3, "attachment_id": null, "creator": "manuel@apache.org", "is_private": false, "id": 159452, "time": "2012-05-29T14:13:46Z", "bug_id": 53316, "creation_time": "2012-05-29T14:13:46Z", "tags": [], "text": "What you are observing is most likely the effect of the FOP linebreaking algorithm that is based on so called Knuth model (http://wiki.apache.org/xmlgraphics-fop/KnuthsModel). In a very informal description it attempts to find the most 'visually pleasing' linebreaks and as such it does not attempt to fill every line to its maximum. Instead it tries to find some optimum which leaves similar amounts whitespace on each line. It will avoid creating paragraphs with 'badly ragged' right margins if you don't use justification, or if you use justification it will result in the inter word gaps on each line to be of similar size."}, {"count": 4, "attachment_id": null, "creator": "navatski@gmail.com", "is_private": false, "id": 159454, "time": "2012-05-29T14:22:29Z", "bug_id": 53316, "creation_time": "2012-05-29T14:22:29Z", "tags": [], "text": "Thank Manuel\n\nSeems to be true. Is it possible to change linebreaking behavior from Knuth model to simple in my XSL-FO?"}, {"count": 5, "attachment_id": null, "creator": "manuel@apache.org", "is_private": false, "id": 159460, "time": "2012-05-29T14:52:57Z", "bug_id": 53316, "creation_time": "2012-05-29T14:52:57Z", "tags": [], "text": "AFAIK you cannot switch off the Knuth algorithm or fallback to a simpler algorithm. Looking at your output1.pdf it would be interesting to figure out what a first fit algorithm would produce. For example the word 'its' moves to the first line. 'in the' but probably not 'BSS' moves to the second line. That is not enough to move 'documentation' to the 3rd line. Leaving you with a very short 3rd line. My gut feel is it would look inferior to what you have now. But I could be wrong."}, {"count": 6, "tags": [], "bug_id": 53316, "attachment_id": null, "id": 159462, "time": "2012-05-29T15:37:38Z", "creator": "gadams@apache.org", "creation_time": "2012-05-29T15:37:38Z", "is_private": false, "text": "i'm closing since this is not a bug, but a feature request; if someone wants to create another bug report asking for the addition of one or more other line breaking algorithms along with a new extension property, fox:line-breaking-strategy, or, alternatively, implement the CSS3 Text Module's line-break property [1], then please do so; however, unless such a request is backed up by implementation activity leading to the submission of a patch, then there will likely be little done on such a bug report;\n\ni would prefer that no bug be filed unless it is accompanied by a patch to add new features in this area; instead, it would be better to the \"wanted features\" wiki;\n\nif you want more information about the current implementation, see [3] and [4]\n\n[1] http://dev.w3.org/csswg/css3-text/#line-break\n[2] http://wiki.apache.org/xmlgraphics-fop/MostWantedFeatures\n[3] http://wiki.apache.org/xmlgraphics-fop/KnuthsModel\n[4] http://wiki.apache.org/xmlgraphics-fop/LineBreaking"}]