[{"count": 0, "tags": [], "creator": "oliver_lloyd@hotmail.com", "attachment_id": null, "id": 159534, "creation_time": "2012-05-30T15:48:40Z", "time": "2012-05-30T15:48:40Z", "bug_id": 53330, "text": "I find that I often need to run a quick test of the test by executing each thread group once, using just one user. This tells me that there are no major issues with the testplan without actually running too much load against the AUT.\n\nTo execute such a dry run I currently have to reset a lot of values in the testplan which is time consuming and prone to error.\n\nIt would be useful to have a feature whereby the test could be executed in dry run mode. Such a mode could include:\n\n1. Run each enabled thread group once, with one user.\n2. Ignore any timers.\n3. Ignore any throughput controllers.\n4. Ignore other controllers that are designed to shape traffic.\n5. No ramp up period.\n6. Debug mode for logging(?).\n7. Possibly an option to reduce connection timeouts - in dry run mode you don't want to wait 30 seconds to find out something is not working.\n8. An option to use this mode from the command line!", "is_private": false}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 159631, "time": "2012-06-01T21:49:19Z", "bug_id": 53330, "creation_time": "2012-06-01T21:49:19Z", "is_private": false, "text": "(In reply to comment #0)\n> I find that I often need to run a quick test of the test by executing each\n> thread group once, using just one user. This tells me that there are no\n> major issues with the testplan without actually running too much load\n> against the AUT.\n> \n> To execute such a dry run I currently have to reset a lot of values in the\n> testplan which is time consuming and prone to error.\n> \n> It would be useful to have a feature whereby the test could be executed in\n> dry run mode. Such a mode could include:\n> \n> 1. Run each enabled thread group once, with one user. \nOK\n> 2. Ignore any timers.\nOK\n> 3. Ignore any throughput controllers.\nThis would kind of modify behaviour, and not test its children.\nBetter to replace by SimpleController ?\n> 4. Ignore other controllers that are designed to shape traffic.\nSame thing, Better to replace by SimpleController ?\n> 5. No ramp up period.\nOK\n> 6. Debug mode for logging(?).\nOK\n> 7. Possibly an option to reduce connection timeouts - in dry run mode you\n> don't want to wait 30 seconds to find out something is not working.\nMaybe\n> 8. An option to use this mode from the command line!\nOK"}, {"count": 2, "tags": [], "creator": "oliver_lloyd@hotmail.com", "attachment_id": null, "text": "Re: Simple Controllers. Yes, agreed. Temporarily changing a Throughput (or similar) controller to a Simple controller for Dry Run mode would achieve the desired goal of forcing the child requests to be executed.", "id": 159632, "time": "2012-06-01T21:59:47Z", "bug_id": 53330, "creation_time": "2012-06-01T21:59:47Z", "is_private": false}, {"count": 3, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "text": "I wonder if we should touch ThroughputControllers as in fact they don't control throughput.\nDo you have a case in mind where it would be needed ?", "id": 159633, "time": "2012-06-01T22:06:11Z", "bug_id": 53330, "creation_time": "2012-06-01T22:06:11Z", "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 53330, "text": "We use throughput controllers to mimic dropoff rates as people move through payment and registration journeys. We have various levels of nested controllers that restrict, using a percentage, the volume of threads that continue.\n\nThe problem is that in order to quickly verify functionality we need to change each percentage to 100%, for each controller. Then, later, we need to set them back to their correct values.\n\nBut I can see how this is a specific case and the problem might be that there are other ways to use the throughput controller (total executions, not percentage) so I appreciate this is not as simple as the other features.", "id": 159634, "time": "2012-06-01T22:23:43Z", "creator": "oliver_lloyd@hotmail.com", "creation_time": "2012-06-01T22:23:43Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 53330, "is_private": false, "id": 159665, "creation_time": "2012-06-04T05:46:33Z", "time": "2012-06-04T05:46:33Z", "creator": "p.mouawad@ubik-ingenierie.com", "text": "After discussion on mailing list , it seems it's too much work for a feature that's not likely to be much used.\n\nClosing as won't fix unless we get more arguments.", "attachment_id": null}]