[{"count": 0, "attachment_id": 28867, "creator": "sebb@apache.org", "text": "Created attachment 28867\nPatch as per bug description\n\nAs mentioned in Bug 53115, one way to avoid a recursive call to catalina.bat is to split the batch file into 2 parts.\n\nThe first part, catalina.bat, performs the input redirection for the \"run\" mode.\n\nFor all modes, it then transfers to the second part, which is named _catalina_.bat.\n\nThe patch also includes the file Y.txt which is used to answer the \"Terminate batch\" prompt.", "id": 159577, "time": "2012-05-31T22:39:51Z", "bug_id": 53340, "creation_time": "2012-05-31T22:39:51Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 53340, "attachment_id": null, "is_private": false, "id": 159578, "time": "2012-06-01T00:12:02Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2012-06-01T00:12:02Z", "text": "Having more that 1 file to handle the debug-level feature of \"catalina run\" is ridiculous. The patch makes it 3 files. ;(\n\n\nThere could be run.bat, like there is startup.bat. But even that seems too much for a debug feature.\n\nI like you idea of using \"_RECURSE_\" variable from your comment on bug 53115, but it solves only small part of complexity.\n\nI do not see a way to get rid of the temporary \"Y\" file. I tried several variants of piping \"echo Y | \" into the recursively called batch file, but all they do not work.  It gets rid of one \"Terminate this batch?\" confirmation, but second one appears.\n\n\nIf there ever are noticeable concerns with the \"^C\" handling code in catalina.bat, I think it all could be removed, reverting to the simple catalina.bat of Tomcat 6.  The current code is a bit complicated, but I cannot call it broken and worth of fixing."}, {"count": 2, "tags": [], "bug_id": 53340, "text": "The point of this was to avoid any possible problems with the TEMP variable setting.\n\nIt may require 2 extra files, but so what?\nThe result (in my view) is somewhat easier to understand.", "id": 159580, "time": "2012-06-01T01:51:09Z", "creator": "sebb@apache.org", "creation_time": "2012-06-01T01:51:09Z", "is_private": false, "attachment_id": null}]