[{"count": 0, "tags": [], "text": "Created attachment 28887\nsuggested enhancements\n\nHello,\n\nI complied a few enhancements covering shape creation in EscherAggregate:\n\n* support for HSSFChildAnchor\n* improvement for HSSFClientAnchor (col and row values are read from record)\n* creation of HSSFPolygon (points are read from record)\n* improvement for HSSFPicture (now reads original file name, if provided)\n\nBesides, I suggest a new Anchor interface to make the various HSSFAnchor and XSSFAnchor classes more coherent.\n\nThe provided test classes illustrate the new features.\n\nI also found that in EscherContainerRecord.createSpContainer(HSSFPolygon, int)\nan additional point is added to the polygon point array - probably the intention is to always have a closed polygon path. In my view, this is questionable, as Excel supports open polygon paths (see also note in test class TestHSSFPolyogn).\n\nI would be pleased if you find some of the suggestions suitable to be commited to POI.\n\nRegards,\nJoachim", "is_private": false, "bug_id": 53361, "id": 159699, "time": "2012-06-05T08:42:24Z", "creator": "j.herrmann@web.de", "creation_time": "2012-06-05T08:42:24Z", "attachment_id": 28887}, {"count": 1, "tags": [], "creator": "yegor@dinom.ru", "text": "Thanks for the patch.\n\nThere is an ongoing effort to improve drawing support in HSSF: This year Apache POI participates in the Google Summer of Code program and Evgeniy Berlog, our student, is working on this task. You can track progress in the gsoc2012  branch: http://svn.apache.org/repos/asf/poi/branches/gsoc2012/\n\nWe would like to merge your patch with the gsoc code first and then move it to trunk in the end of the gsoc program, in late August 2012. \n\nSo it will take a while to apply your patch. \n\nRegards,\nYegor", "id": 159752, "time": "2012-06-06T13:18:32Z", "bug_id": 53361, "creation_time": "2012-06-06T13:18:32Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 53361, "text": "Thanks for your patch.\n\nHi, I am the student who works at GSoC project.\nI've noticed that you modified EscherAggregate.convertRecordsToUserModel(), but the main idea in new drawing layer is to remove methods convertUserModelToRecords() and convertRecordsToUserModel(). The tree of shapes will be created after EcherAggregate.createAggregate(). Each shape will have a constructor like HSSFShape(EcherContainerRecord spRecord, ObjRecord objRecord) and each  property will be taken directly from EscherRecord. \n\nYou are welcome to send your ideas. \n\nWith best regards, Evgeniy Berlog", "id": 159801, "time": "2012-06-07T11:37:42Z", "creator": "superrubiroyd@gmail.com", "creation_time": "2012-06-07T11:37:42Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 53361, "text": "Hi Yegor and Evgeniy\n\nI was not aware that you are currently conducting more extensive changes to this code area, so my contribution may happen to stumble upon your roadworks. Sorry for that.\nYou are certainly welcome to adapt (or discard) the modifications I added, if they conflict with the broader design changes that are in progress. Feel free to fit it into your design.\n\nI also noticed that extracting all properties from the records, and storing them into member variables of the Shape object may be a waste and unnecessarily degrade performance, because most of the data may never be requested by the user. \nTherefore I also rate it a better method to give each shape a reference to the original EscherContainerRecord, and extract properties only on request, saving memory and processing time.\n\nIt also seems that this design makes the HSSF Shapes more similar to shapes in other areas of POI (but I just peeked into them superficially):\n\nHSLF: org.apache.poi.hslf.model.Shape contains the following constructor:\n  protected Shape(EscherContainerRecord escherRecord, Shape parent)\n\nHWPF: org.apache.poi.hwpf.usermodel.Picture contains the following constructor:\n  public Picture(EscherBlipRecord blipRecord)\n\nSo there are already Shape classes in other POI components that go this way, and it makes sense to me.\n\nFrom a wider perspective, it would also seem that a unified Drawing and Shape package would be very valuable.\nWhile you can currently use shapes in hssf/xssf, hslf, hwpf (and maybe some more components I didn't discover), the only way to pass shapes across component borders (say a shape in a hssf sheet to a hslf slide) is to create a corresponding shape in the target document and use getter/setter methods to copy properties. This of course only works, if\n- the source and target document support the same shape type\n- the source and target document each provide getter and setter for all properties\n- you create code to handle each different shape type explicitly, because you must use different getters/setters for each shape type\n\nit would give users great power to do instead something like:\n\n  HSSFSheet excelSheet = ...\n  HWPFDocument wordDoc = ...\n  Drawing excelDrawing = excelSheet.getDrawing();\n  for (Shape s : excelDrawing.getShapes()) {\n     wordDoc.addDrawing().addShape(s);  // implicit cloning of shape assumed\n  }\n\nor\n\n  Shape s = userMethodToConstructAVeryComplexShape();\n  // note that at shape creation time, it is unknown if the shape is \n  // going to be added to an excel sheet or a word document\n  HSSFSheet excelSheet = ...\n  excelSheet.getDrawing().addShape(s);\n  HWPFDocument wordDoc = ...\n  wordDoc.addDrawing().addShape(s);\n\n\nRegards,\nJoachim", "id": 159803, "time": "2012-06-07T13:38:05Z", "creator": "j.herrmann@web.de", "creation_time": "2012-06-07T13:38:05Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "superrubiroyd@gmail.com", "is_private": false, "text": "All of the features you proposed are included in trunk now \n\nPlease try with a nightly build - see download links on http://poi.apache.org/\nor build yourself from SVN trunk, see http://poi.apache.org/subversion.html", "id": 161437, "time": "2012-08-15T20:23:50Z", "bug_id": 53361, "creation_time": "2012-08-15T20:23:50Z", "attachment_id": null}]