[{"count": 0, "tags": [], "bug_id": 53391, "is_private": false, "id": 159843, "creation_time": "2012-06-09T06:02:47Z", "time": "2012-06-09T06:02:47Z", "creator": "lk@teamten.com", "text": "If I call CometEvent.close() from within the event() method, it works fine: the written data is flushed and the connection is closed. If I call it from a different thread (in response to a non-HTTP event), the data is flushed to the socket but the socket is not closed. This may be related to bug 51881 and this line in Http11NioProcessor.java:\n\nsocket.getSocket().getPoller().add(socket.getSocket());\n\nSimply calling response.close() doesn't work either.", "attachment_id": null}, {"count": 1, "tags": [], "creator": "lk@teamten.com", "text": "The first paragraph of this message from 2008 is what I'm seeing:\n\nhttp://bill.burkecentral.com/2008/11/12/buggybroken-tomcat-6-comet-nio-apis/", "id": 159844, "attachment_id": null, "bug_id": 53391, "creation_time": "2012-06-09T06:12:29Z", "time": "2012-06-09T06:12:29Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 53391, "is_private": false, "id": 159857, "creation_time": "2012-06-11T11:28:32Z", "time": "2012-06-11T11:28:32Z", "creator": "markt@apache.org", "text": "I'm not convinced that the behaviour you are seeing is a bug.\n\nCurrently:\na) END if called from within event() closes the connection\nb) END if called from a separate thread does not close the connection\n\nEssentially, the difference is that b) supports HTTP keep-alive whereas a) does not. While this report suggests the b) is incorrect, I am leaning towards a) being incorrect.\n\nSince from the client point of view, this is just an HTTP connection (the client may have zero knowledge of the Comet processing at the server end) then I see no reason not to support keep-alive. END should finish the response but I see no need for it to force the closing of the connection.", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 53391, "text": "This report is invalid. event.close() does not close the socket in either case a) nor case b). Nor should it. I have added some unit tests that confirm this behaviour. I have also added a unit test that confirms setting the connection: close header in the response does result in the connection being closed.\n\nWithout a test case that demonstrates otherwise, the most likely cause of the behaviour described in this bug report is an application bug.", "id": 159865, "time": "2012-06-11T14:21:32Z", "creator": "markt@apache.org", "creation_time": "2012-06-11T14:21:32Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 53391, "text": "I think I said \"close socket\" when I really meant \"close connection\". Here's the behavior I'm seeing: If I do \"curl URL\" from the command line, and in BEGIN I respond and ComentEvent.close(), the curl application shows the response and terminates. But if I do this from another thread (from from within the event() method), the curl application does not terminate. It doesn't think that the connection has finished. How do I finish the connection from another thread? That's the essence of this bug. If that's not possible to do, then this bug should be reopened and the title should be modified.", "id": 159885, "time": "2012-06-11T19:55:44Z", "creator": "lk@teamten.com", "creation_time": "2012-06-11T19:55:44Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 53391, "is_private": false, "id": 159886, "creation_time": "2012-06-11T19:56:40Z", "time": "2012-06-11T19:56:40Z", "creator": "lk@teamten.com", "text": "That should say \"NOT from within the event() method\".", "attachment_id": null}, {"count": 6, "tags": [], "creator": "markt@apache.org", "is_private": false, "id": 159887, "attachment_id": null, "bug_id": 53391, "creation_time": "2012-06-11T20:02:03Z", "time": "2012-06-11T20:02:03Z", "text": "You don't mean close connection either. You mean the client is unable to determine the end of the response. This is usually signalled by one of the following:\n- content length header plus that many bytes being written\n- no content length header and the server closing the connection\n- chunked encoding and an end chunk being sent\n\nThe Tomcat unit tests check that the end of the response is correctly signalled. You'll need to use tcpdump or similar to see exactly what is going on and why curl is not detecting the end of the response. If you can produce a test case that demonstrates that Tomcat does not end the response correctly then please re-open this bug and attach the test case."}, {"count": 7, "tags": [], "creator": "lk@teamten.com", "is_private": false, "id": 159889, "attachment_id": null, "bug_id": 53391, "creation_time": "2012-06-11T20:23:11Z", "time": "2012-06-11T20:23:11Z", "text": "Got it. You were right that this is an invalid bug. Other async web servers like Tornado must transparently buffer the output and set the content length themselves, so \"it just works\", and I expected Tomcat to do the same. But I understand why it doesn't. It'd be useful to have a sample app that does this -- it's a very common (the most common?) use case for non-blocking web serving."}, {"count": 8, "tags": [], "text": "Again, Tomcat does correctly signal the end of the response as per RFC2616. If you have a test case where it doesn't please re-open this bug.", "is_private": false, "bug_id": 53391, "id": 159890, "time": "2012-06-11T20:26:28Z", "creator": "markt@apache.org", "creation_time": "2012-06-11T20:26:28Z", "attachment_id": null}, {"count": 9, "tags": [], "bug_id": 53391, "text": "Hi Mark, I made a test servlet and it worked fine: the response was properly ended when I called event.close() from another thread. I was thrown off for hours by bug 51881, and finally when I upgraded to a fixed version of Tomcat there was leftover debugging code that made me think that close() wasn't working. Sorry to waste your time.", "id": 159902, "time": "2012-06-12T05:02:23Z", "creator": "lk@teamten.com", "creation_time": "2012-06-12T05:02:23Z", "is_private": false, "attachment_id": null}, {"count": 10, "attachment_id": null, "bug_id": 53391, "text": "Glad to hear that all is OK. It wasn't a waste of time - the new test cases I wrote for Comet are good to have.", "id": 159916, "time": "2012-06-12T09:48:00Z", "creator": "markt@apache.org", "creation_time": "2012-06-12T09:48:00Z", "tags": [], "is_private": false}]