[{"count": 0, "tags": [], "bug_id": 53395, "attachment_id": null, "text": "Installing a war that contains a META-INF/context.xml with invalid XML causes further updates to the war to be ignored.  Other wars can be deployed, it's just the broken webapp that can't be updated.  Restarting tomcat with a fixed war in place does not fix the problem, the conf/Catalina/localhost/webapp.xml is reparsed and breaks deployment again.  The only fix is to remove conf/Catalina/localhost/webapp.xml and restart with a fixed war in place.\n\nThe syntax I used for the error was a mistyped xml comment:\n\n<Context>\n  !--<Valve .... /-->\n</Context>", "id": 159862, "time": "2012-06-11T13:45:36Z", "creator": "mike.tillberg@yahoo.com", "creation_time": "2012-06-11T13:45:36Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 53395, "text": "This is working as designed.\n\nIn Tomcat 6.0.x any context.xml (valid or invalid) that ships in a WAR is extracted to CATALINA_BASE/conf/<engine-name>/<host-name> and used until such time as the WAR is undeployed.", "id": 159863, "time": "2012-06-11T14:04:49Z", "creator": "markt@apache.org", "creation_time": "2012-06-11T14:04:49Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "mike.tillberg@yahoo.com", "text": "It looks like auto deploy is implemented as a undeploy followed by deploy:\n\nJun 11, 2012 10:15:26 AM org.apache.catalina.startup.HostConfig checkResources\nINFO: Undeploying context [/webapp]\nJun 11, 2012 10:15:26 AM org.apache.catalina.startup.HostConfig deployWAR\nINFO: Deploying web application archive webapp.war\n\nThe broken context then causes:\nJun 11, 2012 10:15:26 AM org.apache.catalina.startup.HostConfig deployWAR\nSEVERE: Error deploying web application archive webapp.war\n\nSo, if the deployment failed, why is the war considered \"deployed\" for the purposes of retaining the context.xml file?  Wouldn't it be better for the failed context.xml to be removed if it can't be parsed?  Or at least (if I'm reading the code correctly) setup the deployedApp.redeployResources/addWatchedResources in HostConfig so that tomcat doesn't lose track of the app?  After a failed deploy, both modifying the war file or removing the war file do not trigger auto deploy or undeployment.", "id": 159867, "time": "2012-06-11T14:49:36Z", "bug_id": 53395, "creation_time": "2012-06-11T14:49:36Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "knst.kolinko@gmail.com", "text": "A. If context.xml is broken, replacing a war is not going to help, as context file has priority over war.\n\nNote, that\n1. in Tomcat 7 the context file is not copied to conf directory by default, so this issue is easier to solve.\n\n2. there was a patch applied to Tomcat 7 half a year ago to improve handling of failed deployments - r1201928 (included in 7.0.23).\n\nSo this issue should not exist in the current Tomcat 7.\n\n3. A similar patch is currently proposed in STATUS file for 6.0, but as a +0 vote there indicates, there seem to be some issues. I have not investigated in detail yet. It might be that it will address your issue.", "id": 159872, "time": "2012-06-11T16:35:35Z", "bug_id": 53395, "creation_time": "2012-06-11T16:35:35Z", "is_private": false, "attachment_id": null}]