[{"count": 0, "tags": [], "bug_id": 53409, "attachment_id": null, "is_private": false, "id": 159955, "time": "2012-06-13T15:00:38Z", "creator": "stasgr@gmail.com", "creation_time": "2012-06-13T15:00:38Z", "text": "Hi I did view Bug 48692 and Bug 49964 and http://markmail.org/message/opptokzqz7y6z7nk\nIt's great you've fixed it in 7.x, but the thing is there are users like me that currently have to develop REST services using Tomcat 6.0.x (which is still a supported version) sadly as I see it, marking Bug 49964 duplicate of Bug 48692 made this fix unavailable for us, Tomcat 6 users, because Tomcat.0.35 was released in the beginning of the year and both bugs were last modified in 2010 and still does not have this simple yet so important fix. So for Tomcat 6.0.x this is still a bug(or an enhancement if you wish to be strict although the RFC does not restrict it and Request.java lines 2599-2600 does :) ) and a very annoying one, that forces manual parsing of the request body and\\or other workarounds."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Note that the restriction is as a result of the Servlet specification (SRV 3.1).", "id": 160983, "time": "2012-07-29T21:35:58Z", "bug_id": 53409, "creation_time": "2012-07-29T21:35:58Z", "is_private": false}, {"count": 2, "tags": [], "text": "If you want to backport the \"parseBodyMethods\" Connectors' attribute to Tomcat 6, someone (you?) has to prepare a patch for Tomcat 6 in unified diff format (as documented elsewhere), and attach it here or better to issue 48692 of which this one is a duplicate.\n\nThe code to start is in r1041892, though there were minor changes to it later.\nhttp://svn.apache.org/viewvc?view=revision&revision=1041892", "is_private": false, "id": 160986, "creator": "knst.kolinko@gmail.com", "time": "2012-07-29T22:21:16Z", "bug_id": 53409, "creation_time": "2012-07-29T22:21:16Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "(In reply to comment #0)\n> It's great you've fixed [this] in 7.x, but the thing is there are users like me\n> that currently have to develop REST services using Tomcat 6.0.x (which is\n> still a supported version) sadly as I see it, marking Bug 49964 duplicate of\n> Bug 48692 made this fix unavailable for us, Tomcat 6 users[.]\n\nActually, it was marked as a DUPLICATE because I logged a bug that Mark had already logged. His was first (and logged against the current trunk at the time) so we went with his. Back-porting wasn't a high priority but it's not like the closing of bug 49964 has any implication that we will refuse to support Tomcat 6. Just ask for a back-port (which you have basically already done).\n\n(In reply to comment #2)\n> If you want to backport the \"parseBodyMethods\" Connectors' attribute ...\n> ...[t]he code to start is in r1041892, though there were minor changes to it\n> later.\n\nThe original patch is quite small and easily adaptable. Stas, this would be a good entry-level patch for you to submit. Care to submit one based upon my original? Feel free to discuss it on the dev list if you have questions (rather than polluting bugzilla comments).", "attachment_id": null, "id": 161178, "creator": "chris@christopherschultz.net", "time": "2012-08-09T05:10:40Z", "bug_id": 53409, "creation_time": "2012-08-09T05:10:40Z", "is_private": false}, {"count": 4, "tags": [], "text": "\n\n*** This bug has been marked as a duplicate of bug 48692 ***", "is_private": false, "id": 161193, "creator": "chris@christopherschultz.net", "time": "2012-08-09T16:44:24Z", "bug_id": 53409, "creation_time": "2012-08-09T16:44:24Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "text": "Using the original bug to mention request-for-backport.", "id": 161195, "time": "2012-08-09T16:44:46Z", "bug_id": 53409, "creation_time": "2012-08-09T16:44:46Z", "is_private": false}]