[{"attachment_id": null, "tags": [], "creator": "ajack@openbiz.biz", "is_private": false, "count": 0, "id": 8749, "time": "2001-12-10T08:55:07Z", "bug_id": 5341, "creation_time": "2001-12-10T08:55:07Z", "text": "Nothing like posting to a mailing list to *immediately* show you something \nyou'd been staring at, but missed for weeks. :-)\n\nI just noticed that I get this whenever [Thread-0] shows up also. Is thread \nzero (whatever that signifies) something special in Log4J NDC? \n\nI suspect that my app server come JSP engine is using a thread at start-up \n(which just so happens to initialise the Log4J sub-system for my components) \nand the start-up thread gets released into a thread pool. Later my JSP pages \nuse the pool -- and occasionally stumble into thread zero -- hence \nintermittently putting out all NDCs not just the one.\n\nI doubt I have *any* control over thread use/re-use, and I don't know if I can \ninitialise log4j differently (to avoid this zero thread, or if the zero thread \nis just the one log4j was initialised within).\n\nIdeas appreciated...\n\nregards,\n\nAdam\n -----Original Message-----\nFrom: \tJack, Adam  \nSent:\tSaturday, December 08, 2001 10:25 AM\nTo:\t'log4j-user@jakarta.apache.org'\nSubject:\tNDC mix-up\n\nHi,\n\nIntermittently I am seeing all the NDCs (in theoretically different threads) in \na single log entry. They seem to get mixed-up and all be displayed.\n\nI have the following scenario:\n\n1)\tJSP pages & components in a single app server (in single VM)\n\t\n\tLog4J configure to use the SocketClient to talk to a single SocketServer\n\n2)\tLog4J SocketServer configured to append to NT Event Log\n\nI do this because (1) I couldn't get the NT Event Log appender to work in the \napp server (long painful DLL story) and (2) to centralize things.\n\nNow:\n\nThe app server does manage threads (& JSP pages can re-use threads that are \nreturned to the pool) --- but if it were something like me not cleaning the NDC \nstack I'd expect one or two NDCs to get mixed-up, not all. It is all of them.\n\nI do configure the Log4J sub-system once, in a single thread [not once per \nthread], but I get my categories within the thread I am working inside (from \nthe single instance of Log4J).\n\nTo push onto the NDC I do just this --- I am (from my reading) assuming that \nthe NDC manages a stack as a ThreadLocal object and so long as I do this in my \nthread, and pop when my thread dies, then I am using NDC correctly:\n\n                NDC.push( \"Yada Yada\" );\n\nQuestions:\n\nAm I mis-understanding NDC usage somehow?\nAm I doing something obviously wrong in the code?\nAm I hitting a bug in my combination of appenders (or my usage/configuration of \nthem)?\n\nAgain -- this is intermittent, I can't quite track down what causes it & when \nexactly it happens. Any insights appreciated.\n\nregards\n\nAdam\n--\nOpen Business Interchange: <http://www.openbiz.biz>\nThe Revolutionary B2Bi Web Service ..."}, {"count": 1, "tags": [], "bug_id": 5341, "text": "\nI apologize for not having responded earlier.\n\nI would very much appreciate if you could supply a small test case showing the \nproblem. The NDC code is very well tested. I would be extremely surprised to \nsee bugs in it. Bugs are possible but your description is not enough for me to \ntackle the problem. \n\nUntil you supply a case reproducing the bug, I am going to mark your bug report \nas \"works for me\". ", "id": 10477, "time": "2002-02-07T23:01:56Z", "creator": "ceki@apache.org", "creation_time": "2002-02-07T23:01:56Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "ajack@openbiz.biz", "is_private": false, "count": 2, "id": 10499, "time": "2002-02-08T17:59:07Z", "bug_id": 5341, "creation_time": "2002-02-08T17:59:07Z", "text": "I do not have a handy test case, but I think this information might help.\n\nAssuming the bug isn't in NDC itself -- but NDC when used through a socket \nappender to a 'remote' socket server, to an NT appender. (We aren't able, in \nour app server, to easily load the DLL for NT appender, so....)\n\nI wonder if somehow the multiplexing through the socket, and de-multiplexing & \nthe socket server, somehow has a bug if the thread is zero (perhaps deamed \nunknown.)\n\nJust an idea."}, {"count": 3, "tags": [], "bug_id": 5341, "is_private": false, "id": 10500, "creation_time": "2002-02-08T18:08:28Z", "time": "2002-02-08T18:08:28Z", "creator": "ceki@apache.org", "text": "\nAs far as I know there is nothing special about thread 0. Moreover, the NDC \ndoes not use ThreadLocals. A test case reproducing the bug would be very \nhelpful at this stage. ", "attachment_id": null}]