[{"text": "", "tags": [], "bug_id": 53449, "is_private": false, "count": 0, "id": 160165, "time": "2012-06-21T14:59:42Z", "creator": "ryan.dyer@hp.com", "creation_time": "2012-06-21T14:59:42Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "ryan.dyer@hp.com", "attachment_id": null, "is_private": false, "id": 160166, "time": "2012-06-21T15:07:57Z", "bug_id": 53449, "creation_time": "2012-06-21T15:07:57Z", "text": "I am running into a problem where exec is truncating the output of the command being issued when directing it to an output property.   This does not occur 100% of the time, but it is occurring fairly often.  Below is an example of the exec task I am performing :\n  <exec executable=\"sed\" input=\"rpm.spec\" output=\"${rpm_spec}\" >\n      <arg line=\"&apos;s#&lt;PRODUCT&gt;#${product}#; s#&lt;VERSION&gt;#${VERS}#; s#&lt;RELEASE&gt;#${RELEASE}#; s#&lt;\nID&gt;#${ID}#; s#&lt;TMP_DIR&gt;#${tmp_dir}#; s#&lt;SANDBOX&gt;#${basedir}#&apos;\" />\n    </exec>\n\nthe rpm.spec file is just your standard RPM spec file for one of our products.  I don't know if the problem is with exec itself or with some combination of exec and sed.  I have also seen this problem when using exec of sh and args of find and sed to create a file.  In all the instances where I have seen this fail, sed is present, but I don't believe we have any cases of using exec where sed is not present that could potentially fail to begin with.  \n\nI have worked around this problem by using echo to have ant create a temporary script file containing the thing I want done, and then execing it without any problems."}, {"count": 2, "tags": [], "bug_id": 53449, "text": "I suspect this is similar to issues bz-58833 and bz-58451 which got fixed recently. I'll mark this as duplicate of those. Feel free to re-open if that's not the case.\n\n*** This bug has been marked as a duplicate of bug 58833 ***", "id": 203101, "time": "2018-01-05T06:47:59Z", "creator": "jaikiran@apache.org", "creation_time": "2018-01-05T06:47:59Z", "is_private": false, "attachment_id": null}]