[{"count": 0, "tags": [], "text": "Created attachment 28967\nTemplate file used for reproduction of issue\n\nWhen defining column formatting in an Excel template and populating the template using POI by creating new rows and cells, the corresponding column formatting is not respected with XSSF.\n\nSee the following example in combination with the attached xlsx template file:\n\n<---\n\nWorkbook wbx = WorkbookFactory.create(new File(\"template.xlsx\"));\n\nSheet sheet1 = wbx.getSheet(\"Sheet1\");\nSheet sheet2 = wbx.getSheet(\"Sheet2\");\n\nCell c1 = sheet1.createRow(1).createCell(1);\nc1.setCellValue(123456789.12345);\n\nCell c2 = sheet2.getRow(1).getCell(1);\nc2.setCellValue(123456789.12345);\n\nwbx.write(new FileOutputStream(\"out.xlsx\"));\n\n--->\n\nSheet1 is a sheet where column formatting has been applied to column B. On Sheet2 on the other hand, the formatting has been applied to the cells directly.\n\nWhen writing cell B2 on Sheet1, corresponding column formatting is not respected. Cell B2 on Sheet2 however is correctly formatted (obviously, since the cell style for the cell is specifically set).\n\nLooking into the underlying XML for Sheet1, it looks like the style information from  <col min=\"2\" max=\"2\" style=\"3\" width=\"9.140625\" collapsed=\"false\"/> is not applied to the cell when newly creating it. So instead of <c r=\"B2\" s=\"3\" t=\"n\"><v>10000.0</v></c> we only get <c r=\"B2\" t=\"n\"><v>10000.0</v></c> (note the missing s=\"3\").\n\nThe ECMA specification for the column formatting element <cols> says about the style attribute:\n\n\"Default style for the affected column(s). Affects cells not yet allocated in the column(s). In other words, this style applies to new columns.\"\n\nSo I guess this implies that the s=\"3\" attribute should explicitly be specified with any newly created cell.\n\nNote that the above example works fine with HSSF but not with XSSF.", "is_private": false, "bug_id": 53441, "id": 160127, "time": "2012-06-20T10:54:36Z", "creator": "martin.studer@mirai-solutions.com", "creation_time": "2012-06-20T10:54:36Z", "attachment_id": 28967}]