[{"count": 0, "tags": [], "bug_id": 53463, "is_private": false, "text": "Currently, the installed /usr/local/apache/lib/rivet2.x.y/pkgIndex.tcl file includes the following line:\n\npackage ifneeded Rivet 1.1 [list load [file join $dir librivet.so]]\n\n\nSimilarly, the source provides that same version:\n\nrivetPkgInit.c:    return Tcl_PkgProvide( interp, \"Rivet\", \"1.1\" );\n\n\nIt would be nice if the version provided for the \"Rivet\" package was kept in sync with the actual rivet version (2.0.5, or whatever).   This would provide another way of determining what version a particular librivet.so implements.", "id": 160226, "time": "2012-06-25T05:13:19Z", "creator": "jlawson-apache@bovine.net", "creation_time": "2012-06-25T05:13:19Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 53463, "is_private": false, "text": "The name Rivet had been abused quite a bit in our project and, like in many other cases in computer technology and in other fields, when words are abused they lose their meaning. Package Rivet is by no means the core of 'Rivet', it just collects a few commands (still undocumented) which basically had no modifications at all since I got into the project in 2007. When I moved the command set into the namespace ::rivet I thought I could make rivetCore.c provide also package 'rivet'. In that case it would be meaningful to assign the same version number. I can't recall now but I ran into some problem I gave up with the idea", "id": 162199, "time": "2012-09-16T09:55:04Z", "creator": "mxmanghi@apache.org", "creation_time": "2012-09-16T09:55:04Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "jlawson-apache@bovine.net", "is_private": false, "count": 2, "id": 162334, "time": "2012-09-21T17:01:03Z", "bug_id": 53463, "creation_time": "2012-09-21T17:01:03Z", "text": "Most people would reasonably consider all of the auxiliary packages that are included with a rivet release (Package Rivet, forms.tcl, dio, session, etc) to all be versioned with the same number as the core rivet itself since they downloaded it all together as a single tarball/package.\n\nIt doesn't really provide much benefit to users to continue to treat each of those packages as independently versioned items. Maybe part of the release process should be to update all of those files to ensure that the version numbers are identical between them all."}, {"count": 3, "tags": [], "bug_id": 53463, "is_private": false, "text": "I'm not convinced this would not introduce more problems than it solves and I'm not even sure the average Tcl programmer would have that sort of expectation (but I could be wrong). We probably should state it clear: Rivet comes with several components, some of them are not rigidly tied up.\n\nSome of the packages shipped with Rivet don't need mod_rivet to work, and this sounds to me like suggesting to keep their version numbers idependent. For example: we recently bumped 'form' package version number from 1.0 to 2.0, while shipping both versions of the package and giving the possibility to require the older one. If we had labelled the latter as 2.0.5 what would have been the former one? 2.0.4? As development progresses how do their version numbers supposed to evolve (notice that even an older version of a software compoment can go through a separate process of development and bugfix). \n\nIn other words having just one version number would make meaningless the very reason for having numbers marking the state of evolution of a software component.", "id": 162363, "time": "2012-09-23T23:33:06Z", "creator": "mxmanghi@apache.org", "creation_time": "2012-09-23T23:33:06Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 53463, "text": "The issue was resolved in trunk as package Rivet itself is now provided by the command core (see rivet/init.tcl) and librivet is now providing package rivetlib. The package version is now set by the preprocessor symbol RIVET_VERSION (which sets the version also in mod_rivet.c). Eventually also rivet/init.tcl will become something like rivet/init.tcl.in in order to have the symbol version set consistently.", "id": 164927, "time": "2013-01-29T15:00:16Z", "creator": "mxmanghi@apache.org", "creation_time": "2013-01-29T15:00:16Z", "is_private": false, "attachment_id": null}]