[{"count": 0, "tags": [], "bug_id": 53495, "attachment_id": 29019, "text": "Created attachment 29019\nPatch proposal\n\nHello,\n\nI'm migrating an application to Tomcat 7.0.28.\nThe application specifies its module name with web.xml and expects that this module name will be used as a context root.\n\nAccording to Java EE Platform 6 Specification:\n\n\"\nEE.8.1.2 Application Assembly\n...\nwhen a stand-alone module is deployed, the module name is used as the application name, and obeys the same rules as described above for application names. The module name can be explicitly set in the module deployment descriptor. If not set, the name of the module is the base name of the module file with any extension (.war, .jar, .rar) removed and with any directory names removed.\n...\nEE.8.4.1 Assembling a Java EE Application\n...\nIf no deployment descriptor is included in the application package, the context root of the web module will be the module name. \n...\nEE.8.5.2 Deploying a Java EE Application\n...\nAll files in the application package with a filename extension of .war are considered web modules. The context root of the web module is the module name (see Section EE.8.1.1, “Component Creation”).\n...\n\"\n\nI would like to propose a patch that will read the module-name from the web.xml and set it as context root. I believe as this is the standard way of specifying a context root for a web application and it will make the migration to Tomcat easier.\n\nI'm looking forward to your comments.\n\nRegards\nVioleta", "id": 160388, "time": "2012-07-02T07:46:29Z", "creator": "violetagg@apache.org", "creation_time": "2012-07-02T07:46:29Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "Using a context path that does not match the name of the WAR triggers all sorts of nasty edge cases in the automatic deployment code. For this reason, the Tomcat developers decided long ago that for web applications deployed in the appBase, the context path MUST be derived from the war/directory  name.", "id": 160389, "time": "2012-07-02T08:19:36Z", "bug_id": 53495, "creation_time": "2012-07-02T08:19:36Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 53495, "attachment_id": null, "text": "I would add that several parts of the specification quoted apply only to deployment of EAR files, not the deployment of stand-alone modules. Further, since these are requirements on deployment then it is the Tomcat manager app where changes - if any - should be made.\n\nIt is certainly possible to get the Manager app to scan web.xml and rename WARs/directories as required but I suspect the volume of code to do this will be significant compared to the feature it provides - particularly when the user can define the context path either directly in the Manager app or by renaming the WAR.", "id": 160390, "time": "2012-07-02T08:23:40Z", "creator": "markt@apache.org", "creation_time": "2012-07-02T08:23:40Z", "is_private": false}, {"count": 3, "tags": [], "text": "ok thanks", "attachment_id": null, "id": 160427, "creator": "violetagg@apache.org", "time": "2012-07-03T16:03:42Z", "bug_id": 53495, "creation_time": "2012-07-03T16:03:42Z", "is_private": false}]