[{"attachment_id": null, "tags": [], "bug_id": 53504, "text": "The jarsToSkip property in catalina.properties includes jstl.jar as a JAR that should be excluded while scanning for TLDs.  It's worth considering to remove that entry in the jarsToSkip property.\n\nI believe that jstl.jar was originally added as an exclusion because older versions of JSTL were composed of jstl.jar and standard.jar, and standard.jar was the JAR with the TLD.  Therefore, there was no reason to scan jstl.jar.\n\nIn newer versions of JSTL, the JARs may be named like javax.servlet.jsp.jstl-api-1.2.1.jar and javax.servlet.jsp.jstl-1.2.1.jar.  If anybody decides to rename these to, say, jstl-api.jar and jstl.jar, the latter won't be scanned.  I ran into this on my project when I was following JAR naming conventions.\n\nThe workaround is simple: either rename the JAR to not be jstl.jar, or remove the entry from catalina.properties.  However, it's worth considering removing the entry in the baseline because the newer JSTL versions don't consist of jstl.jar and standard.jar anymore.", "count": 0, "id": 160431, "time": "2012-07-04T03:14:49Z", "creator": "rksands@gmail.com", "creation_time": "2012-07-04T03:14:49Z", "is_private": false}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 160452, "time": "2012-07-04T19:46:24Z", "bug_id": 53504, "creation_time": "2012-07-04T19:46:24Z", "text": "jstl.jar is still in widespread usage.\n\nIf you are going to rename JARs then you have to expect to deal with the consequences."}, {"count": 2, "tags": [], "bug_id": 53504, "attachment_id": null, "is_private": false, "id": 168567, "time": "2013-07-12T15:57:06Z", "creator": "brendan.nolan@gmail.com", "creation_time": "2013-07-12T15:57:06Z", "text": "If using jstl version 1.2 you are not renaming the jar. The default name of the jar with the version removed will be jstl.jar. I think it is worth considering the removal of jstl.jar from the list of jarsToSkip"}, {"count": 3, "text": "I'm with rksands and Brendan. The jstl.jar exclusion makes no sense in Tomcat 7 or 8 anymore. I think it should be removed.", "bug_id": 53504, "is_private": false, "id": 168568, "time": "2013-07-12T16:04:57Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-07-12T16:04:57Z", "tags": [], "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 53504, "text": "A quick scan of the JSTL 1.2 JARs in the central Maven repo shows all of them include version numbers in their names.\n\nThe jstl.jar exclusion is there because the examples web application ships wth a JSTL 1.1 implementation where the file is named jstl.jar and that JAR should be excluded (as should any similar JARs in web applications).\n\nAgain, if a developer renames a JAR then they have to take responsibility for the consequences and update the fltering rules accordingly.", "id": 168943, "time": "2013-07-30T09:26:24Z", "creator": "markt@apache.org", "creation_time": "2013-07-30T09:26:24Z", "is_private": false, "attachment_id": null}]