[{"count": 0, "tags": [], "creator": "rmeyer@hotmail.co.uk", "attachment_id": 29026, "id": 160424, "time": "2012-07-03T15:40:44Z", "bug_id": 53502, "creation_time": "2012-07-03T15:40:44Z", "is_private": false, "text": "Created attachment 29026\nCode changes which now conform to the AFP specification for end structured fields\n\nWhen trying to use an AFP image without a matching end structured field ID, an error (Array index out of bounds) would occur. The MODCA specification [1] states that the end structured field is valid in the following three states:\n- An end structured field has no matching end tag id. In which case it will match the last tag found\n- The end tag ends with a FF FF value which, similar to no name will match any opening tag.\n- A matching id on both start and end tags which is the usual case.\n\nI have updated the code to support all three of these cases and now images are loaded successfully when generating an AFP document should one of these other two cases arise. These same rules also apply to all other structured field types and the code change will support these.\n\nI have also added four new test cases which utilize four AFP images covering each case above including a name mismatch (which is expected to throw an exception). These will be attached to this patch shortly. Please note, as listed in the patch these *.afp test files should go in test/java/org/apache/fop/afp/ along with the AFPResourceUtilTestCase.java file changes.\n\nI will also add a fail example to this patch to show an example of it breaking.\n\n[1] http://www.outputlinks.com/SpecialInterest/AFPColorConsortium/mo_dca_reference.pdf"}, {"count": 1, "tags": [], "bug_id": 53502, "text": "Created attachment 29027\nAFP test files zip attached need to be extracted to test/java/org/apache/fop/afp/", "id": 160425, "time": "2012-07-03T15:42:42Z", "creator": "rmeyer@hotmail.co.uk", "creation_time": "2012-07-03T15:42:42Z", "is_private": false, "attachment_id": 29027}, {"count": 2, "tags": [], "bug_id": 53502, "attachment_id": 29028, "id": 160426, "time": "2012-07-03T15:51:49Z", "creator": "rmeyer@hotmail.co.uk", "creation_time": "2012-07-03T15:51:49Z", "is_private": false, "text": "Created attachment 29028\nExample fail test case\n\nAdded a fail test case showing the issue. Generate AFP to see the error."}, {"count": 3, "tags": [], "bug_id": 53502, "attachment_id": null, "id": 160437, "time": "2012-07-04T07:05:57Z", "creator": "med1985@gmail.com", "creation_time": "2012-07-04T07:05:57Z", "is_private": false, "text": "This has been applied to r1357110, just an FYI for future, this is a git diff. You need to provide patches as SVN diffs as Apache hasn't adopted git yet, to our constant dismay. Thanks for the work!"}, {"text": "Robert, could you take a look at the commit, if you're happy with it could you close this bug. Thanks", "tags": [], "bug_id": 53502, "attachment_id": null, "count": 4, "id": 160438, "time": "2012-07-04T07:08:26Z", "creator": "med1985@gmail.com", "creation_time": "2012-07-04T07:08:26Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 53502, "attachment_id": null, "id": 160439, "time": "2012-07-04T07:48:52Z", "creator": "rmeyer@hotmail.co.uk", "creation_time": "2012-07-04T07:48:52Z", "is_private": false, "text": "Thanks Mehdi. I have set the status to Closed / fixed. Apologies about the git diff as well. I've been swapping over to using the repository utilizing Geritt and SVN is one of the things I still need to do. I'll make sure any future patches use SVN next time. Thanks!"}]