[{"count": 0, "tags": [], "creator": "m.coleman@uglyduckling.nl", "text": "\"Ugly Duckling focus on Software, Management and Finance. We have recently been using Apache POI to create tools for the mortgage group of ABN AMRO in the Netherlands.  During this project we created a number of what we call 'Robots' using the HSSF API. These robots run as services on the network and help automate the processing of large amounts of data. Our Robots can be used to spot problems that a human might not, and also to automate repetitive tasks. We found Apache POI to be extremely useful. We took the base API, wrapped it in a builder pattern and thus created a DSL with a fluid interface. Throughout the project we enjoyed very much working with Apache POI and found it to be very reliable.\"\n\nAnd here again in HTML so that you have the links included...\n\n<a href=\"http://uglyduckling.nl/\">Ugly Duckling</a> focus on Software, Management and Finance. We have recently been using Apache POI to create tools for the mortgage group of <a href=\"https://www.abnamro.nl/en/personal/index.html\">ABN AMRO</a> in the Netherlands. During this project we created a number of what we call 'Robots' using the HSSF API.\n\nThese <a href=\"http://uglyduckling.nl/work/robots/\">robots</a> run as services on the network and help automate the processing of large amounts of data. Our Robots can be used to spot problems that a human might not, and also to automate repetitive tasks.\n\nWe found Apache POI to be extremely useful. We took the base API, wrapped it in a builder pattern and thus created a DSL with a fluid interface. Throughout the project we enjoyed very much working with Apache POI and found it to be very reliable.", "id": 160907, "time": "2012-07-25T17:45:06Z", "bug_id": 53604, "creation_time": "2012-07-25T17:45:06Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Thanks for this, applied in r1372062\n\nRegards,\nYegor", "is_private": false, "id": 161285, "creation_time": "2012-08-12T09:50:44Z", "time": "2012-08-12T09:50:44Z", "creator": "yegor@dinom.ru", "bug_id": 53604, "attachment_id": null}]