[{"count": 0, "attachment_id": 29170, "bug_id": 53659, "text": "Created attachment 29170\nInput FO, output PDF (for reference), trace, conf\n\nIn RTF, using fo:table-cell as direct children of fo:table-header (without\nintervening fo:table-row) causes the FOPException \"... RTFHandler: startCell\nnull\". In PDF, it works flawlessly (which it should, as far as I understand the FO\nspecs).", "id": 161115, "time": "2012-08-06T14:26:40Z", "creator": "gisbert.selke@wido.bv.aok.de", "creation_time": "2012-08-06T14:26:40Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 53659, "text": "I'm running on Windows 7, using FOP 1.1rc1", "id": 161117, "time": "2012-08-06T14:38:12Z", "creator": "gisbert.selke@wido.bv.aok.de", "creation_time": "2012-08-06T14:38:12Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "rmeyer@hotmail.co.uk", "text": "Created attachment 29509\nPatch to fix mismatch between XSL:FO and RTF regarding header table-rows\n\nThis issue is happening because it is always expecting there to be a TableRow even though Gisbert correctly states that one is not required for XSL:FO. This fix tries to create the missing container element if one cannot be found. This however creates the problem that because no endRow() method is ever fired, the new TableRow will be left hanging by itself which causes table rendering issues.\n\nTo fix this, each element whether it is a writeable section or not (i.e. headers, footers) are pushed to the stack either as an RtfContainer or as their matching FObj object. When a pop event occurs, a check is made to see that what it thinks is being popped actually matches the top item on the stack. If it doesn't, then it means there is a mismatch and it is likely caused by a new table row. In this event, the item is pushed back onto the stack and a call to the method matching that class is made to close the tag pair before attempting to re-pop the original item.\n\nThe code allows for further expansion should any other tag mismatches between XSL:FO and RTF be found. I have tested this patch against the original bug FO and it works correctly. There are a couple of things which are not ideal but please feel free to post any comments or suggestions if you have them.", "id": 162935, "time": "2012-10-25T15:34:32Z", "bug_id": 53659, "creation_time": "2012-10-25T15:34:32Z", "is_private": false, "attachment_id": 29509}, {"count": 3, "tags": [], "bug_id": 53659, "text": "Created attachment 29510\nCorrected patch file\n\nSorry, that original patch was related to something else. I have now posted the correct patch file.", "id": 162936, "time": "2012-10-25T15:36:24Z", "creator": "rmeyer@hotmail.co.uk", "creation_time": "2012-10-25T15:36:24Z", "is_private": false, "attachment_id": 29510}]