[{"count": 0, "tags": [], "creator": "pere@hungry.com", "is_private": false, "text": "Created attachment 29172\nfo file triggering the bug\n\nI discovered this problem with the fop backend of xmlto when using it\nto create a PDF.  The docbook document in question is rather large,\nbut I managed to extract an except demonstrating the problem.  The\nproblem is that the footnote text and the body text overlap.  I\ninitially reported it to Debian as\n<URL: http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=683197 > but\nthought it best to report it here too.  The docbook source and the\ngenerated PDF is attached to the Debian bug report.  Notice in the\nexample how the text of the footnote on the second to last page is\noverlapping with the body.\n\nI generated the PDF using this command:\n\n  xmlto --noautosize -m xmlto-pdf.xsl --with-fop pdf bad-footnote.xml\n\nThe full document set is available from\n<URL: https://github.com/petterreinholdtsen/free-culture-lessig >, if\nyou want to check it out.\n\nWhen I investigated some more, I concluded that the problem is with\nthe fop processor, not xmlto.  The problem exist in both fop versions\n1:0.95.dfsg-11 and 1:1.0.dfsg2-6 in Debian.  The fo code generated by\nxmlto include the footnote content as it should, and when I manually\nprocess the .fo file using fop, the resulting PDF have the overlapping\ntext.\n\nI am attaching the .fo file I used to test this, to allow you to\nreproduce the problem and try to find a fix. :)\n\nCould this be the same problem reported in\n<URL: https://issues.apache.org/bugzilla/show_bug.cgi?id=51304 >\n\nThis issue make fop useless for making the PDF version of the Free\nCulture book. :(", "id": 161120, "time": "2012-08-06T17:21:39Z", "bug_id": 53662, "creation_time": "2012-08-06T17:21:39Z", "attachment_id": 29172}, {"count": 1, "tags": [], "text": "Hmm,\nTried unsuccessfully to isolate what give this issue in the attached FO.\nIMHO, a possible cause is the b-p-d conversion to millipoint that is rounded (because integer), while original values are float. But that needs to be checked deeper.\nChanging anything that impacts the b-p-d position of footnote area causes a page break at the right place.\n\nFor instance, a simple workaround here is to remove line-height-shift-adjustment from fo:root, and FOP becomes \"magic\"...", "attachment_id": null, "id": 161726, "creator": "psancho.asf@gmail.com", "time": "2012-08-27T12:08:30Z", "bug_id": 53662, "creation_time": "2012-08-27T12:08:30Z", "is_private": false}]