[{"count": 0, "tags": [], "bug_id": 53668, "text": "Created attachment 29178\nJMeter component source code - Result Uploader (listener)\n\nHi!\n\nI've been using JMeter recently for my client in London and have just implemented a web based front-end for displaying the test results.\n\nAs such I've written a component that extends the ResultCollector class and posts the results at run-time to a RESTful web service in JSON format.\n\nI would like to give this to the JMeter community so that its available for general use (see zip attached)\n\nAs I am new to JMeter development it would be fantastic if an experienced JMeter developer could review my code and integrate it into the next release.\n\nPlease don't hesitate to contact me, and I'd be very happy to help improve/further develop the code :)\n\nBest,\nIan Bisset", "id": 161136, "time": "2012-08-07T10:51:08Z", "creator": "bisseti@iabsolutions.com", "creation_time": "2012-08-07T10:51:08Z", "is_private": false, "attachment_id": 29178}, {"count": 1, "tags": [], "bug_id": 53668, "text": "Thank you for your patch.\n\nA question I have is the usage expected for this component.\nFrom my understanding it posts results to a JSON talking server which handles these.\nSo unless I misunderstand, to be useful we should have the server part.\n\nAnother question is , aren't you afraid that this listener impacts badly Test behaviour :\n- network impact from it sending the results\n- CPU, memory impact on JMeter instance which would slow down what is injected on server\n\n\nRegards\nPhilippe", "id": 161602, "time": "2012-08-21T23:05:52Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-08-21T23:05:52Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "bisseti@iabsolutions.com", "attachment_id": 29327, "text": "Created attachment 29327\nWeb app for receiving JSON POSTs from JMeter\n\nWeb app for receiving JSON POSTs from JMeter (used with the Result Uploader component).", "id": 161945, "time": "2012-09-04T16:22:05Z", "bug_id": 53668, "creation_time": "2012-09-04T16:22:05Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 53668, "text": "Hi Philippe,\n\nYou are correct, see zip attached. This is the web app that receives the json requests and submits the data to a database (db connection string defined in src/main/resources/WebResource.properties, and db tables defined in db/create-tables.sql).\n\nIt has been really useful to my client (BSkyB) and several teams are now using this JMeter framework instead of LoadRunner because of the quality of the UI. I can provide screen shots if this helps along with further explanations.  I also have the js/php front-end code if you need that?\n\nRegarding your concerns on resources, CPU is affected of course but there hasn't been any noticeable impact on test timing. On each result the data is pushed onto a Queue, so it is only this action that will inhibit the test running (negligible). The json post is handled by a background Timer thread that does not inhibit the running test.\n\nIf you think this will be of use I will of course be more than happy to help develop further if need be :)\n\nKind regards\nIan", "id": 161947, "time": "2012-09-04T16:57:55Z", "creator": "bisseti@iabsolutions.com", "creation_time": "2012-09-04T16:57:55Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "text": "A BackendListener client implementation would be now better suited since 2.13.\nClosing as WONTFIX.", "id": 187216, "time": "2015-12-29T15:44:24Z", "bug_id": 53668, "creation_time": "2015-12-29T15:44:24Z", "is_private": false}]