[{"count": 0, "tags": [], "bug_id": 53734, "text": "Created attachment 29247\nExample Excel file that contains a single cell A1 that contains a hyperlink with the URL \"javascript://\"\n\nWhen creating a Workbook (org.apache.poi.ss.usermodel.Workbook internalWorkbook = WorkbookFactory.create(inputStream)) an IllegalStateException is thrown if the Excel docuemnt contains a hyperlink of the form \"javascript://\".\n\n(Exception is thrown in method org.apache.poi.xssf.usermodel.XSSFHyperlink.XSSFHyperlink(CTHyperlink, PackageRelationship).)\n\nThough this might sound like an exotic use casem it can occur frequently in our web application when users copy & paste data from the Ajax GUI into a spreadsheet.\n\nBut as in https://issues.apache.org/bugzilla/show_bug.cgi?id=52716 or https://issues.apache.org/bugzilla/show_bug.cgi?id=53282 I really wonder why the hyperlink handling is so strict (I wouldn't mind if an error or a warning is logged, but throwing a runtime exception without giving a chance to control or correct the situation is rather harsh.)", "id": 161494, "time": "2012-08-17T14:48:12Z", "creator": "stefan.raubal@unycom.com", "creation_time": "2012-08-17T14:48:12Z", "is_private": false, "attachment_id": 29247}, {"count": 1, "text": "Fixed in r1402470. Please try with the latest build fro trunk.\n\nStrictly speaking, MS Office generates a invalid OPC package because \"javascript://\" is not a valid URI.\nOn the low level, POI uses java.net.URI to parse package relationships and this is where the exception comes from.\nThe problem can be narrowed down to a single line:\n\nnew java.net.URI(\"javascript://\");\n\nwhich failes with \"java.net.URISyntaxException: Expected authority at index 13: javascript://\" . \n \nThe URI class is defined by RFC 2396 (http://www.ietf.org/rfc/rfc2396.txt) and it requires that double slash must be immediately followed by the authority component. \n\nI added a simple workaround: append a trailing slash if authority is missing, e.g. \"javascript:///\". Java can parse such URIs without any problems.\n\nYegor", "bug_id": 53734, "attachment_id": null, "id": 162954, "time": "2012-10-26T11:40:26Z", "creator": "yegor@dinom.ru", "creation_time": "2012-10-26T11:40:26Z", "tags": [], "is_private": false}]