[{"count": 0, "tags": [], "bug_id": 53737, "attachment_id": null, "id": 161506, "time": "2012-08-18T00:54:55Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2012-08-18T00:54:55Z", "is_private": false, "text": "In Tomcat 7.0.29 in ContextConfig#webConfig() a merged web.xml file is serialized into String and is put as an attribute into ServletContext.\n\n[[[\n        String mergedWebXml = webXml.toXml();\n        sContext.setAttribute(\n               org.apache.tomcat.util.scan.Constants.MERGED_WEB_XML,\n               mergedWebXml);\n]]]\n\nThen in JspConfig#processWebDotXml() of Jasper it is parsed again from XML into objects.\n\nIt would be better to access the necessary configuration through Servlet 3.0 API methods such as ServletContext.getJspConfigDescriptor()."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "is_private": false, "id": 161709, "attachment_id": null, "bug_id": 53737, "creation_time": "2012-08-26T20:30:06Z", "time": "2012-08-26T20:30:06Z", "text": "Fixed in trunk and 7.0.x and will be included in 7.0.30 onwards."}, {"count": 2, "attachment_id": null, "bug_id": 53737, "is_private": false, "id": 161713, "time": "2012-08-26T22:48:53Z", "creator": "markt@apache.org", "creation_time": "2012-08-26T22:48:53Z", "tags": [], "text": "The fix wasn't as simple as it first appeared due to having to support JspC. The original fix has been reverted pending a re-think."}, {"count": 3, "tags": [], "creator": "jboynes@apache.org", "is_private": false, "id": 168139, "attachment_id": 30504, "bug_id": 53737, "creation_time": "2013-06-29T23:03:33Z", "time": "2013-06-29T23:03:33Z", "text": "Created attachment 30504\nAdd support for JspConfig to JspC's ServletContext\n\nRelated to r1377509 (reverted), this patch adds support for identifying the effective version of an application and for setting up a JspConfigDescriptor for JspC that would match the one returned by a container at runtime.\n\nThis should mean that Mark's original change would also work in JspC, allowing the two implementations to be consolidated.\n\nThis patch does not yet attempt to merge in web-fragment.xml files as that functionality is not supported by the current JspC implementation either. I plan to add that later if this looks like a good way to go.\n\nThere is also some duplication with implementations in o.a.c.core. Jasper does not have any dependencies on catalina so I did not reuse those. However, these could potentially be moved to o.a.tomcat.util and shared."}, {"count": 4, "tags": [], "bug_id": 53737, "attachment_id": 30533, "id": 168274, "time": "2013-07-04T18:42:14Z", "creator": "jboynes@apache.org", "creation_time": "2013-07-04T18:42:14Z", "is_private": false, "text": "Created attachment 30533\nAdd changes from r1377509\n\nUpdate previous patch to merge in changes from r1377509 that were reverted due to issues with JspC. This removes need for Jasper's compiler to parse a web.xml, instead relying on a ServletContext provided by the container or now by the JspC shell. Jasper's WebXml class was deprecated in r1377509, it is not longer referenced in Jasper and could be removed.\n\nRan test-bio with no failures, and ran JspC separately on a simple webapp to verify <jsp-config> is being handled (checked default-content-type is picked up from web.xml).\n\nPatch still has todo's to add web-fragment support when JspC builds its ServletContext."}, {"count": 5, "tags": [], "bug_id": 53737, "attachment_id": 30568, "id": 168371, "time": "2013-07-08T05:24:05Z", "creator": "jboynes@apache.org", "creation_time": "2013-07-08T05:24:05Z", "is_private": false, "text": "Created attachment 30568\nIncremental, adds merging of fragments and scanning using ServletContext\n\nIncrement on prior patch to add merging of jsp-config found in web-fragments.\n\nAlso change to JspC to scan for JSPs based on resources found in the ServletContext. This currently works just for resources in the main webapp but not for those in META-INF/resources in jars - work is still needed in JspCServletContext to map those."}, {"count": 6, "attachment_id": null, "bug_id": 53737, "is_private": false, "id": 168420, "time": "2013-07-09T14:51:51Z", "creator": "markt@apache.org", "creation_time": "2013-07-09T14:51:51Z", "tags": [], "text": "This has been partially fixed using a combination of the original fix, the patches here and patches from violetagg.\n\nweb-fragment and annotations are still TODO so the code is effectively in the same place funcitonaly as before the patch."}, {"count": 7, "tags": [], "bug_id": 53737, "text": "Support for web fragments has been added.\n\nSupport for annotations is not required as they do not affect JspC.\n\nSupport for JSPs in resource JARs is still to do.", "id": 171630, "time": "2013-12-07T21:33:49Z", "creator": "markt@apache.org", "creation_time": "2013-12-07T21:33:49Z", "is_private": false, "attachment_id": null}]