[{"count": 0, "tags": [], "bug_id": 53770, "attachment_id": null, "id": 161649, "time": "2012-08-23T19:37:51Z", "creator": "marko.asplund@gmail.com", "creation_time": "2012-08-23T19:37:51Z", "is_private": false, "text": "when org.apache.tomcat.jdbc.pool.PoolProperties logValidationErrors parameter is set to false (the default) SQL syntax errors aren't logged. It would be helpful to make a distinction between errors in SQL syntax and other validation problems so to make it easier to spot incorrectly configured validation queries."}, {"count": 1, "tags": [], "text": "Marking as wontfix. I don't have a list of the SQL error codes for a syntax error. \nThe logValidationErrors property is put in place to trap and log these errors. \n\nvalidation queries generally are so simple, and a tool, an admin or a developer would validate his/her validation query first.\n\nplease reopen if you feel strongly about this, and kindly supply list of error codes for different databases.", "attachment_id": null, "id": 176990, "creator": "fhanik@apache.org", "time": "2014-08-07T19:31:48Z", "bug_id": 53770, "creation_time": "2014-08-07T19:31:48Z", "is_private": false}, {"count": 2, "tags": [], "text": "Filip: how about a configuration property (or probably a separate interceptor) that can be configured with a list of local SQL error codes to treat as certain types of errors?\n\nThis can probably be done with a custom interceptor and probably does not need to exist in the Tomcat code.", "attachment_id": null, "id": 177010, "creator": "chris@christopherschultz.net", "time": "2014-08-08T12:34:23Z", "bug_id": 53770, "creation_time": "2014-08-08T12:34:23Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 53770, "is_private": false, "count": 3, "id": 177027, "time": "2014-08-09T01:14:58Z", "creator": "fhanik@apache.org", "creation_time": "2014-08-09T01:14:58Z", "text": "(In reply to Christopher Schultz from comment #2)\n> Filip: how about a configuration property \n\nthat can work, but you see, you can already configure a custom validator to handle validation. So there are means for those that have a dire need for it.\n\n(or probably a separate\n> interceptor) that can be configured with a list of local SQL error codes to\n> treat as certain types of errors?\n> This can probably be done with a custom interceptor and probably does not\n> need to exist in the Tomcat code.\n\ninterceptors are not involved in the validation process. a custom validator is."}]