[{"count": 0, "tags": [], "bug_id": 53805, "text": "Created attachment 29313\nOnly interpret ENDTAGs after a full command, step 1\n\nCurrently, the rivet parser terminates a block of as soon as ?> is encountered. However, there are places where this should not happen, e.g.,\n\n\n<?\n\nputs ?>  ; # ?> is a valid string in Tcl\n\n# Inside a comment like this ?> it causes problems, too \n\n# Need a real world example?\n\nputs {<?xml version=\"1.0\" encoding=\"utf-8\"?>}  ; # This raises an error..\n\n?>\n\nI propose the attached patch, which is a first step in correcting the current handling of ENDTAGs, in that it only interprets the sequence ?> as a ENDTAG after newlines or semicolons (plus optional horizontal spaces). Basically, it permits an ENDTAG where a Tcl command is expected.\n\nI understand that this change causes incompatibility, e.g.,\n\n    puts hello?>\n\nthis won't work anymore.\n\n    puts hello;?>\n\nthis will.\n\nPerhaps we want to enable this functionality only when some httpd.conf directive is set. I'm open to suggestions.\n\n\nIf the general idea is accepted, there would be a second step where we take quotes into consideration: this won't work (actually, it doesn't work now either):\n\n    puts {\n          I'd like to say \n          many things; ?> but\n          an error arises...\n    }", "id": 161867, "time": "2012-08-31T13:15:44Z", "creator": "gahr@gahr.ch", "creation_time": "2012-08-31T13:15:44Z", "is_private": false, "attachment_id": 29313}, {"count": 1, "tags": [], "bug_id": 53805, "attachment_id": null, "text": "thanks for filing this feature request. It's difficult to deal with all the possible subtletes implied by the mixing up of 2 totally unrelated languages, like in the case of embedding Tcl within HTML. As you have certainly seen, rivet's parser is simple and works in the most straightforward way. There is no Tcl parsing during the template parsing, therefore the parser is not aware of Tcl commands and comments. We probably should make it explicit. The clever yet simple example you made\n\n# Inside a comment like this ?> it causes problems, too \n\ncan be seen in a different way. How do interpret this line?\n\n# Inside a comment like this ?><b>This is real HTML!</b>\n\nis the real HTML element meant to slip into the Tcl code? How can you tell the parser where it should stop parsing Tcl and start an HTML block?\n\n -- Massimo", "id": 161874, "time": "2012-08-31T21:31:18Z", "creator": "mxmanghi@apache.org", "creation_time": "2012-08-31T21:31:18Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 53805, "attachment_id": null, "is_private": false, "id": 161875, "time": "2012-08-31T21:52:25Z", "creator": "gahr@gahr.ch", "creation_time": "2012-08-31T21:52:25Z", "text": "Ciao Massimo,\n\nI see your point, yet IMHO between STARTTAG and ENDTAG everything should be threaded as Tcl, and the rules of Tcl should apply, including the \"command terminates at \\n or ;\" rule.\n\n<?\n# Inside a comment like this ?><b>This is real HTML!</b>\n?>\n\nI personally see this as a Tcl comment line, i.e., nothing should be printed.\n\nBut I agree that this is debatable, so if you like the current behavior better I'll stick with it and print my xml header like this\n\nputs {<}\nputs {?xml version=\"1.0\" encoding=\"utf-8\"?}\nputs {>}\n\n;)"}, {"count": 3, "tags": [], "bug_id": 53805, "attachment_id": null, "is_private": false, "id": 162349, "time": "2012-09-22T23:09:11Z", "creator": "mxmanghi@apache.org", "creation_time": "2012-09-22T23:09:11Z", "text": "changing this bug as not related to a specific version of Rivet"}, {"count": 4, "tags": [], "creator": "mxmanghi@apache.org", "text": "Reviewing this bug (after 4 years it had been filed) I realized Pietro had proposed a patch. I usually don't miss to recognize and encourage contributions, so I feel terribly guilty (why didn't you insist Pietro?). I will test this patch soon (I could in case create a branch where the patched parser for anyone to try it)  I promise not to put this patch on hold for ages before considering to apply the patch to the current parser.", "id": 194141, "time": "2016-10-04T22:07:33Z", "bug_id": 53805, "creation_time": "2016-10-04T22:07:33Z", "is_private": false, "attachment_id": null}]