[{"count": 0, "tags": [], "bug_id": 53810, "text": "While upgrading our application to use Tika 1.2 (previously Tika 0.9), a few PowerPoint 97-03 (PPT) files which previously parsed correctly started failing with exceptions in NPOIFS.\n\nThe root cause appears to be a difference in the way that BAT entries are read from XBAT blocks between POIFSFileSystem and NPOIFSFileSystem. In POIFS, the header's getBATCount is used as a hard-limit for the number of BATs which are read; in NPOIFS, XBATEntriesPerBlock are read for every XBAT, even if this causes more total BAT entries to be read than header.getBATCount. In some files, the extraneous BAT blocks are all initialized to the same value, which is then detected as a possible cycle.\n\nThe attached PPT file demonstrates this problem (it was found via a web-crawler search for test content, so I can not grant a license to Apache to redistribute it). The attached patch implements similar behavior in NPOIFS to what exists in POIFS, and allows the file to parse without exception.", "id": 161876, "time": "2012-09-01T00:19:28Z", "creator": "gking@iongrid.com", "creation_time": "2012-09-01T00:19:28Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "gking@iongrid.com", "is_private": false, "id": 161877, "attachment_id": 29315, "bug_id": 53810, "creation_time": "2012-09-01T00:21:58Z", "time": "2012-09-01T00:21:58Z", "text": "Created attachment 29315\npatch fixing cycle detection in NPOI"}, {"count": 2, "tags": [], "text": "Bugzilla isn't letting me upload the file; however, the file may be downloaded from http://www.slideshare.net/jbrenman/thirst.", "is_private": false, "id": 161878, "creator": "gking@iongrid.com", "time": "2012-09-01T00:34:09Z", "bug_id": 53810, "creation_time": "2012-09-01T00:34:09Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 53810, "text": "Thanks for this, slightly modified version committed in r1442095. With that in place, I can now process that slideshare file without problems.", "id": 165049, "time": "2013-02-04T12:52:56Z", "creator": "apache@gagravarr.org", "creation_time": "2013-02-04T12:52:56Z", "is_private": false, "attachment_id": null}]