[{"count": 0, "tags": [], "creator": "markus.hoenicka@mhoenicka.de", "attachment_id": 29355, "id": 162076, "time": "2012-09-11T16:33:07Z", "bug_id": 53852, "creation_time": "2012-09-11T16:33:07Z", "is_private": false, "text": "Created attachment 29355\npatch to fix $CLASSPATH handling on Cygwin\n\nfop (the shell script, not the product) as of version 1.1rc1 did not work out of the box on WindowsXP/Cygwin:\n\nCYGWIN_NT-5.1 sbhc123 1.7.16(0.262/5/3) 2012-07-20 22:55 i686 Cygwin\n\nJava died with an exception as it was unable to locate the fop classes. Turned out that the $CLASSPATH that the script created was invalid.\n\nThere were two unrelated reasons:\n\n1. If $CLASSPATH is set to a DOS-style path outside of Cygwin, then an intermediate version of $LOCALCLASSPATH (before its final conversion to DOS-style) is a mixture of Unix- and DOS-style paths. This breaks cygpath as it can't handle mixed-style paths. Unfortunately, some badly programmed softwares like Quicktime modify $CLASSPATH globally. So any preset $CLASSPATH should be converted to Unix-style before attaching it to $LOCALCLASSPATH\n\n2. $LOCALCLASSPATH is assembled by collecting .jar files from the /lib subdir of fop. On Cygwin, the script uses Unix paths and the DOS path separator (:). This wreaks havoc on $LOCALCLASSPATH if you want to obtain a clean DOS version of the assembled path. Also, using Unix-style paths and path separators throughout obviates one conversion step (to Unix-style) before converting $LOCALCLASSPATH to DOS-style.\n\nThe attached patch attempts to fix these problems. The patched script works fine for me if I set the following environment variables, e.g. in .bashrc:\n\nFOP_HOME=/cygdrive/c/Programme/fop-1.1rc1\nJAVA_HOME=/cygdrive/c/Programme/Java/jre7"}, {"count": 1, "tags": [], "bug_id": 53852, "attachment_id": null, "is_private": false, "id": 162413, "time": "2012-09-26T13:24:46Z", "creator": "med1985@gmail.com", "creation_time": "2012-09-26T13:24:46Z", "text": "Hi Markus,\n\nThis commit looks ok, but I don't really use Windows much so I'm slightly reticent  in committing it. Could a Windows user take a look?\n\nThanks\n\nMehdi"}]