[{"count": 0, "tags": [], "creator": "lmpmbernardo@gmail.com", "is_private": false, "id": 162360, "attachment_id": null, "bug_id": 53924, "creation_time": "2012-09-23T23:19:55Z", "time": "2012-09-23T23:19:55Z", "text": "This patch adds support for retrieve-table-marker. The patch is extensive and very likely there is room for improvement, but it does what it is supposed to do and was tested with non trivial examples.\n\nThe implementation has a main constraint: the resolution of the retrieve-table-marker element needs to be an element that does not change the BPD of the containing cell. In practical terms this means that the height of the table header or footer where the retrieve-table-marker element is placed cannot change once the retrieve-table-marker is replaced by the resolved content. In the end this is not a serious constraint since in most cases the retrieve-table-marker element is meant to be replaced by a line of text (and there is already adjacent text, or the height of the cell is specified)."}, {"count": 1, "tags": [], "bug_id": 53924, "is_private": false, "text": "Created attachment 29410\npatch", "id": 162361, "time": "2012-09-23T23:20:52Z", "creator": "lmpmbernardo@gmail.com", "creation_time": "2012-09-23T23:20:52Z", "attachment_id": 29410}, {"count": 2, "tags": [], "bug_id": 53924, "is_private": false, "id": 162362, "creation_time": "2012-09-23T23:23:37Z", "time": "2012-09-23T23:23:37Z", "creator": "lmpmbernardo@gmail.com", "text": "Created attachment 29411\ntwo extensive examples\n\ntwo examples: include *.fo source and *.pdf output", "attachment_id": 29411}, {"count": 3, "tags": [], "text": "Committed to r1391502. One thing to note, I haven't changed it this time because I'm not very familiar with the layout are of code, but adding comments like:\n// mock\n<then mocking something>\ndon't really add anything. It's obvious you're mocking, because you're using the mock(...) method. Not a biggy, but just for next time.\n\nThanks for the work, keep it up!\n\nMehdi", "attachment_id": null, "bug_id": 53924, "id": 162455, "time": "2012-09-28T15:26:36Z", "creator": "med1985@gmail.com", "creation_time": "2012-09-28T15:26:36Z", "is_private": false}]