[{"count": 0, "text": "This is a feature request.  Currently installing Apache Tomcat 7 silently defaults to C:\\Program Files\\Apache Software Foundation\\Tomcat 7.0 even if a previous install was in a different directory.  I am requesting that the silent install switch (/S) installs Tomcat in the directory located in the registry key HKEY_LOCAL_MACHINE\\SOFTWARE\\Apache Software Foundation\\Tomcat\\7.0\\Tomcat7\\InstallPath, which is the location of the previous install, whether in the default location or not.\nI am aware of the install switch /D=install directory, but if that switch isn't used, it should default to the location of the previous install that is shown in the registry.\nIf you are able to fix it for 7.0 could you also fix it for every supported version of Tomcat?\nThanks -JB", "creator": "jb@bolioshot.com", "is_private": false, "id": 162427, "time": "2012-09-26T18:52:55Z", "bug_id": 53938, "creation_time": "2012-09-26T18:52:55Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 162438, "time": "2012-09-27T18:45:03Z", "bug_id": 53938, "creation_time": "2012-09-27T18:45:03Z", "is_private": false, "text": "Feature request == enhancement"}, {"count": 2, "tags": [], "bug_id": 53938, "attachment_id": null, "id": 162470, "time": "2012-09-30T09:06:32Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2012-09-30T09:06:32Z", "is_private": false, "text": "1. I think it will be counter-intuitive. You are proposing that the installer program change its behaviour based on some hidden system state.\n\n2. I do not see a merit in such feature.\n\n3. If Tomcat uninstalls, the key should be removed from the registry. So you would not be able to use this feature.\n\n4. If you consider installing over already-installed Tomcat, see bug 51496.\n\n5. You are wrong with the key name. The key name depends on parameters that are chosen during installation. It is\n\n\"SOFTWARE\\Apache Software Foundation\\Tomcat\\@VERSION_MAJOR_MINOR@\\$TomcatServiceName\""}]