[{"count": 0, "tags": [], "text": "Created attachment 29414\npatch to catalina.sh adding support for CATALINA_OUT_CMD\n\ncatalina.sh currently supports passing in a value for CATALINA_OUT. If supplied the stdout/stderr of the java process will be redirected to this file. This single file scenario makes it difficult to keep file contents for long running process separated on a per day basis as is typical for production logging scenarios.  We use cronolog (http://http://cronolog.org/) to do automatic log rolling but others may have different needs.  The attached patch adds support to catalina.sh for an optional CATALINA_OUT_CMD variable. If this variable is defined, the stdout and stderr of the java process will be piped to the command.  We use it as in:\n\nCATALINA_OUT_CMD=\"cronolog $CATALINA_BASE/logs/catalina.%Y-%m-%d.out >/dev/null 2>&1\"\nexport CATALINA_OUT_CMD\ncatalina.sh start $@\n\nOf course long-running, server-side applications should typically not be writing to stdout/stderr but sometimes this is out of your control.", "attachment_id": 29414, "id": 162377, "creator": "clucas@e-miles.com", "time": "2012-09-24T15:53:47Z", "bug_id": 53930, "creation_time": "2012-09-24T15:53:47Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 53930, "attachment_id": null, "id": 170881, "time": "2013-10-28T14:32:28Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-10-28T14:32:28Z", "is_private": false, "text": "I'm not sure if this matters a lot, but the \"touch $CATALINA_OUT\" has been dropped from this patch. Was that intentional?"}, {"count": 2, "tags": [], "text": "(In reply to Christopher Schultz from comment #1)\n> I'm not sure if this matters a lot, but the \"touch $CATALINA_OUT\" has been\n> dropped from this patch. Was that intentional?\n\nI doubt it was intentional. However, the file should only be touched if will be used - basically, around line 380.", "attachment_id": null, "id": 170886, "creation_time": "2013-10-28T16:29:14Z", "time": "2013-10-28T16:29:14Z", "creator": "clucas@e-miles.com", "bug_id": 53930, "is_private": false}, {"count": 3, "tags": [], "creator": "peterhansson_se@yahoo.com", "text": "This is a very important addition. \nIf you search the internet you'll find lots of recommendations on allowing log-rotation and all of them tell you to modify your catalina.sh file. The point here is that users really shouldn't modify catalina.sh as it breaks the upgrade path. Hence the feature should be supported in the script itself as per Casey's patch.\n\nSince this RFE was launched the catalina.sh script has been modified to also support NOHUP which means the Casey's patch no longer applies verbatim.", "id": 195335, "attachment_id": null, "bug_id": 53930, "creation_time": "2016-12-02T10:22:32Z", "time": "2016-12-02T10:22:32Z", "is_private": false}, {"count": 4, "tags": [], "creator": "peterhansson_se@yahoo.com", "text": "As a workaround: Use a copy-and-truncate strategy instead. This doesn't require changes to catalina.sh script.\n\nOn Linux: Use logrotate utility with 'copytruncate' option.\n\nOn Solaris: Use logadm utility with '-c' option. (or on Solaris 11 and later you can install logrotate by doing 'pkg install file/logrotate' if you really, really want to use logrotate instead of logadm)\n\n\n\nThe proposed change basically allows for a pipe strategy. This strategy is better than a copy-and-truncate strategy for the following reasons:\n\n- The copy-and-truncate strategy requires extra disk space when the operation is being executed.\n- The copy-and-truncate strategy has a small time gap between the copy and the truncate. During the gap messages may be lost.\n- The copy-and-truncate strategy requires changes to setup outside of the Tomcat configuration: it requires changes to logrotate/logadm tool and potentially a new entry in cron table.", "id": 195336, "attachment_id": null, "bug_id": 53930, "creation_time": "2016-12-02T15:33:04Z", "time": "2016-12-02T15:33:04Z", "is_private": false}]