[{"count": 0, "tags": [], "bug_id": 53990, "text": "hi,\n\nI am reading the excel file(.xlsx format), it is giving \"Java heap space\" error because my file contains more than 75 rows and 300 columns. So, i am using \neventusermodel and SAX parser to read the data as mentioned POI site. while fetching the values, the date is displayed as \"12/12/10\" where as in my excel sheet it is given as \"12/12/2010\". I changed the date to \"12/12/1910\" in excel, even then i am getting the date as \"12/12/10\" format. Is there a way i can fetch the date as it in excel spreadsheet using eventusermodel.\n\nAlso, using the eventusermodel i am able to fetch all the records at once. Is there any way  i can fetch particular row data.\n\nThanks in advnace,\nMani", "id": 162682, "time": "2012-10-11T07:57:46Z", "creator": "manivel.mymail@gmail.com", "creation_time": "2012-10-11T07:57:46Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 53990, "text": "The number of records is 75k rows and 300 columns", "id": 162685, "time": "2012-10-11T10:01:17Z", "creator": "manivel.mymail@gmail.com", "creation_time": "2012-10-11T10:01:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 53990, "attachment_id": null, "id": 162689, "time": "2012-10-11T11:07:21Z", "creator": "yegor@dinom.ru", "creation_time": "2012-10-11T11:07:21Z", "is_private": false, "text": "Firstly, Bugzilla is not a place to ask questions, use the @poi-user for that. And please don't abuse Bugzilla, you will get nothing by setting priority to blocker.\n\n\nPlease try XLSX2CSV from poi-examples. Does it format your data correctly ? \n\nIf it does not and you think it is a bug in POI, please attach the input file and sample Java code that demonstrates the trouble. \n\nYegor"}, {"count": 3, "tags": [], "bug_id": 53990, "text": "Apologies for asking this question in Bugzilla. I used XLSX2CSV from poi-example only and i got the solution by changing the date format(formatString variable in the example) and i got the exact date as in excel sheet.", "id": 162693, "time": "2012-10-11T12:41:09Z", "creator": "manivel.mymail@gmail.com", "creation_time": "2012-10-11T12:41:09Z", "is_private": false, "attachment_id": null}]