[{"count": 0, "tags": [], "bug_id": 54005, "is_private": false, "id": 162745, "attachment_id": null, "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-10-14T13:43:23Z", "time": "2012-10-14T13:43:23Z", "text": "It can be useful to have more control on response when using Mirror Server.\nI propose to add:\n- X-ResponseStatus to control status of response\n- X-ResponseLength to control size of response"}, {"count": 1, "tags": [], "bug_id": 54005, "attachment_id": null, "id": 162746, "time": "2012-10-14T13:53:54Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-10-14T13:53:54Z", "is_private": false, "text": "Date: Sun Oct 14 13:52:00 2012\nNew Revision: 1398084\n\nURL: http://svn.apache.org/viewvc?rev=1398084&view=rev\nLog:\nBug 54005 - HTTP Mirror Server : Add special headers \"X-\" to control Response status and response content\nBugzilla Id: 54005\n\nModified:\n    jmeter/trunk/src/protocol/http/org/apache/jmeter/protocol/http/control/HttpMirrorThread.java\n    jmeter/trunk/xdocs/changes.xml\n    jmeter/trunk/xdocs/usermanual/component_reference.xml"}, {"id": 169653, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "count": 2, "text": "Documentation says that adding a Header Manager controls the responses such as X-ResponseStatus. However, this is not strictly true.\n\nAt present the mirror server only looks for settings such as X-ResponseStatus in the headers it receives. It does not check the contents of any Header Manager that may be added to the workbench.\n\nThe only way to tell the server return the headers is to add the Header Manager to the client request.\n\nAdding a Header Manager to the Mirror Server does not work, contrary to how the docs can be read.\n\nThis is not particularly flexible - for example it cannot easily be used with browsers, only with other JMeter test elements.\n\nI suspect it will be quite difficult to add, as Header Managers need special handling in the test plan. Also again it is not particularly flexible.\n\nIt would probably be a lot easier to just add a table of settings to the Mirror Server GUI.\n\nThere should be a table for arbitrary http headers to be added verbatim.\nThe other features (length/response code etc) would need separate fields.\n\nFor compatibility, the X-headers should still be processed if found in the request.\n\nAlternatively, the docs need to be clarified.", "time": "2013-08-22T11:39:49Z", "bug_id": 54005, "creation_time": "2013-08-22T11:39:49Z", "is_private": false}]