[{"count": 0, "attachment_id": null, "bug_id": 54033, "is_private": false, "id": 162851, "time": "2012-10-21T11:20:16Z", "creator": "jmv_deb@nirgal.com", "creation_time": "2012-10-21T11:20:16Z", "tags": [], "text": "This problem has been report as Debian bug\nhttp://bugs.debian.org/288615\n\nFrom: Vincent Untz <vincent@vuntz.net>\nSubject: Issue with language negotiation exceptions\n\nLooking at http://httpd.apache.org/docs-2.0/content-negotiation.html, I\ncan read this:\n\n=======\nThe server will also attempt to match language-subsets when no other\nmatch can be found. For example, if a client requests documents with the\nlanguage en-GB for British English, the server is not normally allowed\nby the HTTP/1.1 standard to match that against a document that is marked\nas simply en. (Note that it is almost surely a configuration error to\ninclude en-GB and not en in the Accept-Language header, since it is very\nunlikely that a reader understands British English, but doesn't\nunderstand English in general. Unfortunately, many current clients have\ndefault configurations that resemble this.) However, if no other\nlanguage match is possible and the server is about to return a \"No\nAcceptable Variants\" error or fallback to the LanguagePriority, the\nserver will ignore the subset specification and match en-GB  against en\ndocuments. Implicitly, Apache will add the parent language to the\nclient's acceptable language list with a very low quality value. But\nnote that if the client requests \"en-GB; q=0.9, fr; q=0.8\", and the\nserver has documents designated \"en\" and \"fr\", then the \"fr\" document\nwill be returned. This is necessary to maintain compliance with the\nHTTP/1.1 specification and to work effectively with properly configured\nclients.\n=======\n\nThis looks good except it seems there's a small issue when Apache adds\nthe parent languages. I have a client that requests: \"fr-fr,en-us;q=0.3\"\nand the server is configured like this:\nAddLanguage fr .fr\nAddLanguage en .en\nLanguagePriority en fr\n\nSo, apache is adding the parent languages to the client request because\nthe server is not configured to deal with fr-fr and en-us.\nHowever, the client gets the english page. So it seems apache is adding\nthe parent languages in the \"en fr\" order (the one defined by\nLanguagePriority). I would expect apache to add the parent languages in\nthe order they appear in the client request, so the user can get the\nfrench page.\n\nTell me if you need more informations.\n\nThanks,\n\nVincent\n\n----------------------------------------------------------\n\nFrom: Richard Atterer <atterer@debian.org>\nSubject: Issue with language negotiation exceptions [kind-of patch]\n\nHi,\n\njust stopping by here on my search for a different bug...\n\nAs I read the docs (exactly the bit you quoted in the bug report!), Apache \nis behaving as described. However, its behaviour could be improved to be a \nbit more useful.\n\nTo the bug submitter: The only solution that I see for you ATM is to create \nsymlinks for all language subsets that are important to you. For example, \ncreate a symlink called \"index.fr-fr.html\" which points to \"index.fr.html\".\n\nTo the maintainers:\n\nThe browser requests the languages \"fr-fr,en-us;q=0.3\", which is broken \nbehaviour anyway as far as the HTTP standard is concerned; \"fr\" and \n\"en;q=0.3\" ought to be added.\n\nWhen Apache sees that Accept-Language header, it cannot match it against \nthe, say, index.en.html and index.fr.html files on disc. So the second part \nof the paragraph quoted in the bug report applies: The above list of \nlanguage preferences is turned into\n\n  \"fr-fr,en-us;q=0.3,fr;q=0.001,en;q=0.001\"\n\nThe order in this list does not matter, only the weight of each \nvariant. So - oops: Suddenly fr and en have equal priority! :-(\n\nAt this point, the two available variants are in every practical aspect \nequally well-suited. Now the algorithm described on\n<http://httpd.apache.org/docs/2.2/content-negotiation.html#algorithm>\nwill try to select one variant just to create a predictable, reproducible \nresponse. In our case, \"en\" sorts earlier alphabetically than \"fr\", so \"en\" \nis served.\n\nThe solution to this is: Do not use a quality value of 0.001 when adding \nthe non-subset languages, but multiply the (implicit) 1.0 of fr-fr and the \n0.3 of en-us with 0.001.\n\nDisclaimer: I'm not an Apache hacker, but having looked at the source for \n10 minutes, it appears the change would be inside set_language_quality() in \nmodules/mappers/mod_negotiation.c. Instead of the line\n\n  fiddle_q = 0.001f;\n  \nyou'd want something similar to\n\n  fiddle_q = 0.001f * accs[i].quality;\n\n(completely untested)\n\nCheers,\n\n  Richard\n\n----------------------------------------------------------\n\nI could reproduce the problem using a directory with index.fr.html and index.en.html\nIf I Accept-Language: fr-fr, en-gb and ask for index, I get served the english version\nThe patch fixes that."}, {"count": 1, "attachment_id": null, "bug_id": 54033, "is_private": false, "id": 162852, "time": "2012-10-21T11:48:09Z", "creator": "covener@gmail.com", "creation_time": "2012-10-21T11:48:09Z", "tags": [], "text": "Changing to enhancement"}, {"count": 2, "tags": [], "text": "Created attachment 29503\nPatch to order parent dialect according to client Accept-Language:", "is_private": false, "bug_id": 54033, "id": 162853, "time": "2012-10-21T12:10:17Z", "creator": "jmv_deb@nirgal.com", "creation_time": "2012-10-21T12:10:17Z", "attachment_id": 29503}]