[{"count": 0, "tags": [], "bug_id": 54040, "is_private": false, "text": "I found my flex application doesn't work anymore after tomcat version 7.0.28. Please help me to get through this. I tried many things without any success.\n\nHere is my configurations.\n\nBlaze - 4.x Tomcat - Latest - 7.0.28 Java 7\n\nApplication just hangs without any error or anything. It works until 7.0.27. I checked tomcat release notes (http://tomcat.apache.org/tomcat-7.0-doc/changelog.html) and isolated problem up to Coyote jar file.\n\nWhen I replace Coyote.jar and catalina.jar from version 7.0.27 to 7.0.28 it works properly. Then I checked only having catalina.jar from previous version still getting this problem. So I think it has something to do with changes done for Coyote. \n\ni.e. \n\n\t52858: Correct fix for high CPU load (fhanik)\n\t53138: Broken Sendfile on SSL introduced in 7.0.27 (fhanik)\n\t52055: Additional fix required to ensure that InputFilters are recycled between requests. (markt)\n\t53061: Fix a problem in the NIO connector whereby if the poller was under low but consistent load (>1 request/per second and always less than 1 second between requests) timeouts never took place. (markt)\n\t53063: When using an Executor with BIO, use the executor's maxThreads as the default for maxConnections. (markt)\n\t53119: Prevent buffer overflow errors being reported when a client disconnects before the response has been fully written from an AJP connection using the APR/native connector. (markt)\n\t53169: Allow developers to avoid chunked encoding for a response of unknown length by setting the Connection: close header. Based on a patch suggested by Philippe Marschall. (markt)\n\t53173: Properly count down maxConnections (fhanik)\n\t Update default value of pollerThreadCount for the NIO connector. The new default value will never go above 2 regardless of available processors. (fhanik)\n\t Allow to retrieve the current connectionCount via getter from the endpoint and as JMX attribute of the ThreadPool mbean. (rjung)\n\t Correct an edge case where Comet END events were not send to connected clients when the Tomcat connector was stopped. (markt)\n\t53406: Fix possible stack overflow on connection close when using Comet. (fhanik)\n\t Improve InternalNioInputBuffer.parseHeaders(). (kkolinko)\n\t Implement maxHeaderCount attribute on Connector. It is equivalent of LimitRequestFields directive of Apache HTTPD. Default value is 100. (kkolinko)\n\n\nPlease guide me to a solution. Thanks in advance.", "id": 162887, "time": "2012-10-23T05:53:17Z", "creator": "charith.code@gmail.com", "creation_time": "2012-10-23T05:53:17Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 54040, "attachment_id": null, "id": 162888, "time": "2012-10-23T08:11:17Z", "creator": "markt@apache.org", "creation_time": "2012-10-23T08:11:17Z", "is_private": false, "text": "There is no need to quote the change log. A link would suffice.\n\nBugzilla is not a support forum. You have not provided anywhere near enough information to demonstrate that there is a Tomcat bug here, neither have you provided any information that would enable the Tomcat developers to reproduce the issue.\n\nPlease use the Tomcat users mailing list for further assistance. If that discussion identifies a Tomcat bug then feel free to re-open this issue and provide the necessary steps to reproduce the problem."}]