[{"count": 0, "tags": [], "creator": "dan@sync.ro", "text": "When publishing DITA or Docbook to PDF (on a Windows machine) there are created FO files containing references to images. Some of the references are respecting the URI syntax, others are using the backslash: \"\\\". This is not under the control of the end users. The XSLT stylesheets from these documentation frameworks are generating these invalid URIs.\n\nFOP 1.0 translated the back-slashses to forward slashes before attempting to parse the URIs. \nFOP 1.1 kept this translation in: org.apache.fop.apps.FOURIResolver but not in:\norg.apache.fop.fo.properties.URIProperty\n\nI propose adding the following code in:\norg.apache.fop.fo.properties.URIProperty.Maker.make(PropertyList, String, FObj)\n\n....\nvalue = value.replace('\\\\', '/');\n....\n\nThis will make FOP more compatible with the Docbook and DITA output.", "id": 163174, "time": "2012-11-05T08:54:10Z", "bug_id": 54098, "creation_time": "2012-11-05T08:54:10Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "gadams@apache.org", "is_private": false, "count": 1, "id": 163188, "time": "2012-11-05T12:23:06Z", "bug_id": 54098, "creation_time": "2012-11-05T12:23:06Z", "text": "As a user, you choose what XSLT stylesheets to use. If you use one that contains broken references, then you suffer the consequences. The correct way to handle this is get those broken XSLT stylesheets fixed, and not require FOP to accept invalid input to accommodate such brokenness."}, {"count": 2, "tags": [], "bug_id": 54098, "attachment_id": null, "id": 163230, "time": "2012-11-06T13:24:15Z", "creator": "dan@sync.ro", "creation_time": "2012-11-06T13:24:15Z", "is_private": false, "text": "Thank you for the detailed answer."}, {"count": 3, "tags": [], "creator": "radu_coravu@sync.ro", "text": "For more than 6 years Apache FOP has behaved in a certain way.\n\nThis means that all projects which created XSL-FO as output could have produced references which are either local file references (like Docbook does when producing references to Note images) or URL paths which may contain \"\\\" in them like the DITA Open Toolkit does.\nSuch invalid references are still handled by commercial FO applications like RenderX XEP or Antenna House because they are more interested in generating the PDF than in breaking the XSL-FO transformation.\n\nCould you add in the FOP configuration file a special setting which would overpass this problem (show it as a warning) instead of signaling it as an error?\nThis is what the producer of the Saxon XSLT processor did when he decided to no longer handle file references to XSLT files (instead of URI references).\n\nI understand that by default FOP could fail with a fatal error but you have to give the projects which produce XSL-FO (and there could be many) some time to upgrade their handling of image references and in the meantime to have users benefit of the latest bug fixes available in Apache FOP.\n\nWe are the manufacturers on an XML Editor (Oxygen XML Editor), our editor comes bundled with a lot of open source software and is used to publish using a lot of open source software so upgrading the bundled FOP libraries to FOP 1.1 is a problem for us.", "id": 163258, "attachment_id": null, "bug_id": 54098, "creation_time": "2012-11-07T07:30:09Z", "time": "2012-11-07T07:30:09Z", "is_private": false}]