[{"count": 0, "tags": [], "creator": "sam@ims.net", "text": "We are using the auto-generated JSP session object to read and write session \nvariables.  This works under IE/Apache/Tomcat 3.3 (with the same code) but does \nnot work with IE/IIS5/Tomcat 3.3.  It is a browser-specific bug: Netscape and \nOpera work fine on IIS5/Tomcat 3.3.  IE seems to lose the session cookie, or at \nleast it does not make it to Jasper for persistence of the session object.  \nThis is ONLY with the JSP instantiation of HttpSession; the example servlet \nSessionExample does work under IE/IIS5/Tomcat 3.3.  (This servlet explicitly \ninstantiates an HttpSession object.)\n\nAlthough it looks like an IE-specific bug, not a general Jasper bug, the \npredominance of IE may make this bug worth investigating.", "id": 8893, "time": "2001-12-13T08:03:42Z", "bug_id": 5411, "creation_time": "2001-12-13T08:03:42Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "Larry.Isaacs@sas.com", "attachment_id": null, "id": 9823, "time": "2002-01-23T22:37:49Z", "bug_id": 5411, "creation_time": "2002-01-23T22:37:49Z", "is_private": false, "text": "There isn't enough information to determine how much Tomcat may be contributing\nto problem  behavior.  IE and possibly your web application are contributing as\nwell, but how much can't be determined with the information given.  As a result,\nI'm resolving this as INVALID.\n\nIf frames are involved, IE is known to be able to make multiple requests which\nwill each get a different session, causing their session objects not to be\nshared.  I can't tell if this applies to your web application.\n\nIf you can supply a web application and steps to reproduce, reopen the bug\nwith the additional information."}, {"count": 2, "tags": [], "bug_id": 5411, "attachment_id": null, "is_private": false, "id": 11945, "time": "2002-03-18T16:31:36Z", "creator": "marco.lopes@living-systems.de", "creation_time": "2002-03-18T16:31:36Z", "text": "I have installed the version 3.3a in my computer. \n\nWhen using Linux + I.E 6.0, everything ok, but when using windows 2000\n\nThe session example simply does not work, the add button replaces all the item \nall the time.\n\nI have seen this bug throughout the whole list since Tomcat 3.2, nobody seems \nto care."}, {"attachment_id": null, "tags": [], "bug_id": 5411, "is_private": false, "count": 3, "id": 12081, "time": "2002-03-20T14:34:20Z", "creator": "Larry.Isaacs@sas.com", "creation_time": "2002-03-20T14:34:20Z", "text": "AFAIK, \"session not working\" bugs in Tomcat 3.3 have all turned out to be user\nerrors with respect to using frames.  The session example works fine for me\non Win98, Win2k, and WinXP.\n\nNote that this example does not support operation without cookies.  If cookies\nare disabled in your browser or the <SessionId> entry in your server.xml has\nnoCookies=\"true\", the example will behave as you describe."}, {"attachment_id": null, "tags": [], "bug_id": 5411, "is_private": false, "count": 4, "id": 12088, "time": "2002-03-20T16:09:19Z", "creator": "sam@ims.net", "creation_time": "2002-03-20T16:09:19Z", "text": "I originated this bug, and it has nothing to do with frames.  It actually \nappears to be a bug or incompatibility between IE and isapi_redirect.dll, which \nmalforms the header it passes on to Tomcat under Win2k.  We worked around the \nproblem by switching to Apache (rather than IIS5), which does not use \nisapa_redirect.dll.  As far as I know, no one has addressed the problem reported \nhere."}, {"count": 5, "tags": [], "creator": "nacho@apache.org", "text": "I'm unable to reproduce this bug in my config, and it's exactly the same \nIE/IIS5/TC33 concretely a use the NumberGuessExample without any problem, and \nthis example makes use of sessions.. and should be falling from the report..\n\nAdd a complete test case to be able to reproduce it..", "id": 17864, "time": "2002-06-15T16:03:38Z", "bug_id": 5411, "creation_time": "2002-06-15T16:03:38Z", "is_private": false, "attachment_id": null}]