[{"count": 0, "text": "Source page/section: http://xmlgraphics.apache.org/fop/1.1/fonts.html#truetype-metrics .\nBugs|errors:\n1. Wrong libs filenames mentioned in the creating metrics files command (version of libs that are part of the libs filenames are missing).\n2. One lib filename completely missing (xmlgraphics-commons-1.5.jar).\n\nNow available:\njava -cp build\\fop.jar;lib\\avalon-framework.jar;lib\\commons-logging.jar;lib\\commons-io.jar org.apache.fop.fonts.apps.TTFReader [options] C:\\myfonts\\cmr10.ttf ttfcm.xml\n\nHow expected:\njava -cp build\\fop.jar;lib\\avalon-framework-4.2.0.jar;lib\\commons-logging-1.0.4.jar;lib\\commons-io-1.3.1.jar;lib\\commons-logging-1.0.4.jar;lib\\xmlgraphics-commons-1.5.jar org.apache.fop.fonts.apps.TTFReader [options] C:\\myfonts\\cmr10.ttf ttfcm.xml\n\nNotes:\n1. Docs for other version fop may contain the same error - wasn't checked.\n2. The same error seem to be in section http://xmlgraphics.apache.org/fop/1.1/fonts.html#type1-metrics but command wasn't checked because of absence of Type 1 fonts.", "creator": "eduard.tibet@gmail.com", "attachment_id": null, "id": 163303, "time": "2012-11-09T09:41:17Z", "bug_id": 54122, "creation_time": "2012-11-09T09:41:17Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 54122, "is_private": false, "count": 1, "id": 163414, "time": "2012-11-13T10:30:57Z", "creator": "bowditch_chris@hotmail.com", "creation_time": "2012-11-13T10:30:57Z", "text": "I think we should probably remove (instead of repairing as suggested) the section that talks about metric generation as that was deprecated since v0.95."}, {"count": 2, "tags": [], "bug_id": 54122, "attachment_id": null, "is_private": false, "id": 163415, "time": "2012-11-13T10:39:21Z", "creator": "eduard.tibet@gmail.com", "creation_time": "2012-11-13T10:39:21Z", "text": "(In reply to comment #1)\n> I think we should probably remove (instead of repairing as suggested) the\n> section that talks about metric generation as that was deprecated since\n> v0.95.\n\n2Chris: Maybe I don't fully understand the metrics files generation feature. If I'm wrong in some point, let me know this point.\n\nIMHO removing this feature would be not a good solution. The fonts auto discover works well, but it really used in small desktop or special configured environments. If someone had very strict fonts requirement based on license agreements, external despondencies, etc., he really need this feature.\n\nI.e. in my own environment the fonts/metrics are hardly linked to glyphs (fonts files) and metrics using config file. I'll never be use autodiscover, because it leads to unpredictable results on final output."}, {"attachment_id": null, "tags": [], "bug_id": 54122, "is_private": false, "count": 3, "id": 163416, "time": "2012-11-13T10:54:37Z", "creator": "bowditch_chris@hotmail.com", "creation_time": "2012-11-13T10:54:37Z", "text": "Hi Edward,\n\nThanks for your response. You don't need to create metric files to register the fonts manually in the fop.xconf file. The fonts topic definitely needs work as it does appear to imply the metrics generation step is necessary, but if you read [1] You will see the following note stating metrics files are not needed:\n\n•The \"metrics-url\" attribute is generally not necessary except if you run into problems with certain fonts.\n\nThanks,\n\nChris\n\n[1] http://xmlgraphics.apache.org/fop/1.1/fonts.html#register"}, {"count": 4, "tags": [], "creator": "eduard.tibet@gmail.com", "is_private": false, "text": "(In reply to comment #3)\n> Hi Edward,\n> \n> Thanks for your response. You don't need to create metric files to register\n> the fonts manually in the fop.xconf file. The fonts topic definitely needs\n> work as it does appear to imply the metrics generation step is necessary,\n> but if you read [1] You will see the following note stating metrics files\n> are not needed:\n> \n> •The \"metrics-url\" attribute is generally not necessary except if you run\n> into problems with certain fonts.\n> \n> Thanks,\n> \n> Chris\n> \n> [1] http://xmlgraphics.apache.org/fop/1.1/fonts.html#register\n\nYes, you are right, but I also talked about these notes:\n\n\"Font registration via XML font metrics file is still supported and may still be necessary for _some very special cases_ as fallback variant while we stabilize font auto-detection.\" [1]\n\nand\n\n\"The \"metrics-url\" attribute is generally not necessary _except if you run into problems_ with certain fonts.\" [2]\n\nNobody knows where the problems appears. But, anyway, my opinion is only FOP user opinion. You, as a FOP dev, certainly know more about FOP architecture.\n\n[1] http://xmlgraphics.apache.org/fop/1.1/fonts.html#custom\n[2] http://xmlgraphics.apache.org/fop/1.1/fonts.html#register", "id": 163417, "time": "2012-11-13T11:13:37Z", "bug_id": 54122, "creation_time": "2012-11-13T11:13:37Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 54122, "is_private": false, "count": 5, "id": 163418, "time": "2012-11-13T11:45:29Z", "creator": "bowditch_chris@hotmail.com", "creation_time": "2012-11-13T11:45:29Z", "text": "I am aware of those notes. I agree this page needs updating but we are about to switch to a new website, so I will probably update the page in the new website or wait until we switch before addressing this. Basically the special use cases are diminished in the latest versions of FOP. I believe the use case the author had in mind was related to single byte encoding but that too is now possible without creating the metrics files. The only other possible use case for metric files is as a means to modify the metrics extracted in case the original font contains errors, but that use case is very unlikely. I will bear that in mind when I come to rewrite the help topic."}, {"count": 6, "tags": [], "bug_id": 54122, "attachment_id": null, "id": 163420, "time": "2012-11-13T12:27:21Z", "creator": "bowditch_chris@hotmail.com", "creation_time": "2012-11-13T12:27:21Z", "is_private": false, "text": "I've had a go at re-organizing and re-wording the font topic on the new website that you can see here: http://xmlgraphics.staging.apache.org/fop/1.1/fonts.html"}]