[{"count": 0, "tags": [], "bug_id": 54158, "attachment_id": null, "id": 163480, "time": "2012-11-16T15:25:47Z", "creator": "henry.szablicki@budget.ny.gov", "creation_time": "2012-11-16T15:25:47Z", "is_private": false, "text": "Hello docs-project,\nI have a suggestion regarding the 2.0 to 2.2 upgrade documentation, and the mod_proxy documentation.  After upgrading we noticed a behavior change of ProxyPass, specifically in how it works when used alongside RewriteRules.  In 2.0.64 we were able to mix them, and they appeared to be processed sequentially.  However, in 2.2.23 it seems that RewriteRules are processed first, and then the ProxyPass lines.  We came to this conclusion when we saw our “catchall” rewrite rule at the bottom of our configuration getting triggered before any ProxyPass requests.  We solved this by simply using RewriteRules for everything.\n\nI found enough in the documentation to indicate that this is an intended behavior.  I found it by going to the documentation for mod_rewrite, then the “more detailed mod_rewrite documentation”, and then finally “when not to use mod_rewrite” which is here http://httpd.apache.org/docs/2.2/rewrite/avoid.html.  In the section on “Simple Proxying” after explaining ProxyPass, it has a note:\n\n\"You may need to use RewriteRule instead when there are other RewriteRules in effect in the same scope, as a RewriteRule will usually take effect before a ProxyPass, and so may preempt what you're trying to accomplish.\"\n\nI could not find mention of this at all in the mod_proxy documentation at http://httpd.apache.org/docs/2.2/mod/mod_proxy.html (which was my first stop in trying to figure this out)... having the only mention of this need to use mod_rewrite in a section titled \"when *not* to use mod_rewrite\" seems a bit awkward.\n\nSo my suggestion would be to include mention of this behavior change in the upgrade documentation at http://httpd.apache.org/docs/2.2/upgrading.html (provided that this is an intended behavior change), and possibly include the same note quoted above in the mod_proxy documentation.\n\nThank you for your time,\n-Henry S."}, {"count": 1, "tags": [], "bug_id": 54158, "attachment_id": null, "text": "my 2 cents -- The order was undefined in 2.0, and defined in 2.2 (rewrite first).", "id": 163484, "time": "2012-11-16T17:32:15Z", "creator": "covener@gmail.com", "creation_time": "2012-11-16T17:32:15Z", "is_private": false}, {"count": 2, "tags": [], "creator": "toscano.luca@gmail.com", "text": "Hi Henry,\n\nI added your suggestions to:\n\nhttp://httpd.apache.org/docs/2.2/upgrading.html#run-time\n\nhttp://httpd.apache.org/docs/2.2/mod/mod_proxy.html#proxypass\n\nClosing the bug, thanks!\n\nLuca", "id": 188296, "time": "2016-02-08T22:11:44Z", "bug_id": 54158, "creation_time": "2016-02-08T22:11:44Z", "is_private": false, "attachment_id": null}]