[{"count": 0, "tags": [], "bug_id": 54153, "attachment_id": null, "text": "Today SampleSender does not take into account SaveService configuration in remote sampling.\nThis leads SampleSender to send data to controller that is not persisted by SaveService. \nThis should be changed by maybe sending SaveService Configuration summary of Controller to servers so that they can remove non persisted fields", "id": 163464, "time": "2012-11-15T21:28:48Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-11-15T21:28:48Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 54153, "text": "At start of test, we could send a simple bean \nrepresenting what has been configured in CSVSaveService or SaveService,\nAnd we could implement a new SampleSender using that config.", "id": 163474, "time": "2012-11-16T06:37:44Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2012-11-16T06:37:44Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 54153, "is_private": false, "count": 2, "id": 163483, "time": "2012-11-16T17:15:57Z", "creator": "sebb@apache.org", "creation_time": "2012-11-16T17:15:57Z", "text": "Since the entire test plan is sent to the server (some classes are modified slightly), I would expect the configuration to be already present on the server.\n\nIt's just a question of finding the correct place plug the code in.\n\nWarning: a single sample may be processed by several different listeners, each of which may have different configuration setttings, so the original sample result must be preserved.\n\nThis means that a copy of the sample has to be created.\nMight be sensible to provide a copy method that filters based on the SaveService configuration (rather than doing a full copy and adjusting it later).\n\nIt will of course be more work to create the copy, however it should allow the amount of transmitted data to be reduced.\n\nGiven that it may place an extra load on the server, I think the behaviour should be optional."}]