[{"count": 0, "tags": [], "creator": "Brian@PingToo.com", "is_private": false, "text": "Created attachment 29621\nExtensive update to the test class to demonstrate session timeout properly\n\nWhile working on a new test case for a different Authenticator, I decided to follow the timeout test case in this class. Although all the test cases currently run successfully, I discovered three fundamental flaws in the existing timeout test case:\n\n1. The BasicAuthenticator does not create a session by default, so there was no session to actually timeout.\n2. Context.setSessionTimeout() was called with a timeout in seconds, but this method expects a timeout argument in minutes.\n3. The presence of 401 Unauthorized status was intended to confirm a session timeout, but it was erroneously succeeding because no credentials were supplied when attempting to re-access the protected resource.\n\nThe attached patch is quite extensive, but cannot easily be broken into smaller units:\n1. The AuthenticatorBase.setAlwaysUseSession variable can now be manipulated by test cases.\n2. The doTestBasic method has been reimplemented so that it only makes a single HTTP GET request (instead of two).\n3. doTestBasic can now be controlled to authenticate or not, and it will also harvest a session cookie and can also supply that cookie in subsequent requests.\n4. The doTestNonLogin method can be controlled to send a saved session cookie.\n5. The erroneous timeout test case has been reimplemented has been renamed and properly commented to explain that it is not testing a timeout.\n6. A new session persistence test case has been added.\n7. A new session persistence timeout test case has been added.\n8. Raw boolean control flags have been replaced with self-documenting constants.\n9. Helpful comments have been added in some places where the logic is not self-evident.\n\nThe enclosed patch file is backward compatible and passes checkstyle.", "id": 163600, "time": "2012-11-22T13:10:23Z", "bug_id": 54190, "creation_time": "2012-11-22T13:10:23Z", "attachment_id": 29621}, {"count": 1, "attachment_id": null, "bug_id": 54190, "text": "Sorry! I forgot to set a realistic priority to this bug.", "id": 163601, "time": "2012-11-22T13:11:57Z", "creator": "Brian@PingToo.com", "creation_time": "2012-11-22T13:11:57Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "testBasicLoginWithoutSession() seems to repeat the same pair of tests but the comments suggest that something different should happen the second time. What am I missing?", "attachment_id": null, "id": 163604, "creator": "markt@apache.org", "time": "2012-11-22T15:17:01Z", "bug_id": 54190, "creation_time": "2012-11-22T15:17:01Z", "is_private": false}, {"count": 3, "tags": [], "text": "Your logic makes sense to me so my preference would be some more comments.", "attachment_id": null, "id": 163605, "creator": "markt@apache.org", "time": "2012-11-22T16:46:06Z", "bug_id": 54190, "creation_time": "2012-11-22T16:46:06Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 54190, "attachment_id": 29641, "is_private": false, "id": 163671, "time": "2012-11-26T18:28:00Z", "creator": "Brian@PingToo.com", "creation_time": "2012-11-26T18:28:00Z", "text": "Created attachment 29641\nNew version of complete patch\n\nThis new version is a significant improvement over the previous:\n1. Numeric http status has been replaced by standard api contstants.\n2. the complex signatures of the doTestXxx methods have been simplified and made more self-documenting.\n3. more comments have been added and some comments reworded.\n4. code has been cleaned up and validation improved.\n5. several new test cases have been added with backward-compatible behaviour (i.e. they succeed at the moment) and TODO comments have been added to cross-reference suggested improvements that would make the BasicAuthenticator more tolerant in future."}, {"count": 5, "tags": [], "creator": "Brian@PingToo.com", "attachment_id": 29642, "text": "Created attachment 29642\nComplete replacement for previous patches\n\nAesthetic improvements to the inner class, which will probbaly make Mark wonder why I didn't do them before... the answer is: I hadn't gone back to review the inner class once it was working. I must leave this code alone now!", "id": 163672, "time": "2012-11-26T20:07:58Z", "bug_id": 54190, "creation_time": "2012-11-26T20:07:58Z", "is_private": false}, {"count": 6, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Thanks. Patch applied to trunk and 7.0.x and will be included in 7.0.34 onwards.\n\nApplying the patch generated a bunch of IDE warnings (we try to keep the code clean of those) which were fixed by r1415178 and r1415179.\n\nIf you start looking at the TODOs, I suggest you take a look at  org.apache.tomcat.util.http.parser.HttpParser#parseAuthorizationDigest()\n\nI suspect a new parseAuthorizationBasic() method is the way to go as that should handle the various whitespace issues noted.", "id": 163733, "time": "2012-11-29T14:37:59Z", "bug_id": 54190, "creation_time": "2012-11-29T14:37:59Z", "is_private": false}, {"count": 7, "tags": [], "text": "Created attachment 29669\nFaster detection of expired session in timeout test case\n\nReduce run time of testBasicLoginSessionTimeout() from 130 to 80 seconds, based on suggestion (b) from Konstantin Kolinko.", "is_private": false, "id": 163783, "creator": "Brian@PingToo.com", "time": "2012-12-03T11:25:42Z", "bug_id": 54190, "creation_time": "2012-12-03T11:25:42Z", "attachment_id": 29669}, {"count": 8, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Patch applied to trunk and 7.0.x and will be included in 7.0.34 onwards. Thanks again.", "id": 163788, "time": "2012-12-03T12:11:33Z", "bug_id": 54190, "creation_time": "2012-12-03T12:11:33Z", "is_private": false}]