[{"count": 0, "tags": [], "bug_id": 542, "is_private": false, "id": 604, "creation_time": "2001-02-07T08:30:51Z", "time": "2001-02-07T08:30:51Z", "creator": "bobby.woolf@brokat.com", "text": "Ant seems to be having a problem handling classpaths for EJB clients. When I \nrun the client from Ant, I get a NullPointerException from Properties.load\n(InputStream); the InputStream is null because the ClassLoader can't find the \nproperties file in the EJB client jar (generated by the EJB container, \nGemStone/J) even though it's looking for the right file name with the right \npath. I know the client jar is in the classpath; when I take it out, the client \nfails with a ClassDefNotFoundException long before trying to load the \nproperties. When I run the same clients using a .bat file (Windows NT batch \nfile), the clients work, find the properties file, and connect to the server \nproperly. So Ant seems to be causing the failure.\n\nA coworker who has used Ant more than me has reproduced the problem on his \nmachine, can't find what's wrong, and says it seems to be an Ant bug. He has \ndone this sort of thing with Ant 1.1 and it worked, so this seems to be a new \nbug.\n\nIf you want my build.xml file or the exception stack trace, contact me at \nbobby.woolf@brokat.com. Thanks for your help.", "attachment_id": null}, {"count": 1, "tags": [], "text": "Unable to reproduce and reporter's email bounced so I am closing", "attachment_id": null, "bug_id": 542, "id": 3439, "time": "2001-07-06T04:26:07Z", "creator": "conor@apache.org", "creation_time": "2001-07-06T04:26:07Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 542, "is_private": false, "id": 154391, "creation_time": "2012-03-01T08:30:03Z", "time": "2012-03-01T08:30:03Z", "creator": "josedarius@gmail.com", "text": "Cannot load Ant installer......", "attachment_id": null}, {"count": 3, "tags": [], "text": "Bugzilla vandalism?\n\nThere is no Ant installer and this issue certainly wouldn't be related to one if it existed.", "attachment_id": null, "id": 154396, "creator": "bodewig@apache.org", "time": "2012-03-01T09:07:30Z", "bug_id": 542, "creation_time": "2012-03-01T09:07:30Z", "is_private": false}]