[{"count": 0, "tags": [], "bug_id": 54228, "text": "Created attachment 29658\nFile that won't convert correctly\n\nHi,\n\nWhen trying to use the POI class to grab content from the attached xlsx sheet, the sheet.rowIterator() method is returning rows with no content.\n\n\nFor example:\n\nitrRow=sheet.rowIterator();\n\nRow      row        = itrRow.next();\n\nWhen iterating through the cells of \"row\", everything is blank and it seems to be coming from the sheet.rowIterator returning a row without the content.  Thanks", "id": 163747, "time": "2012-11-30T20:34:09Z", "creator": "james.clendennen@morningstar.com", "creation_time": "2012-11-30T20:34:09Z", "is_private": false, "attachment_id": 29658}, {"count": 1, "tags": [], "bug_id": 54228, "text": "I have just had a look ay your file and would like to ask which rows are reporting they contain nothing? I suspect that these will be the styled rows that do not contain any cells. The reason why you are seeing POI report these is that Excel will still create an entry for that row in the xml markup for the sheet so that it can record the style information for it.\n\nCan you check this please by printing out the numbers of the 'problematic' rows and then comparing them to your source file.", "id": 163751, "time": "2012-12-01T07:41:59Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2012-12-01T07:41:59Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 54228, "attachment_id": null, "is_private": false, "id": 163837, "time": "2012-12-04T10:31:20Z", "creator": "yegor@dinom.ru", "creation_time": "2012-12-04T10:31:20Z", "text": "Please try with the latest build form trunk. POI-3.7 is two years old and many bugs have been fixed since then."}, {"count": 3, "tags": [], "text": "Hi,\n\nThanks for the assistance.  I made a mistake before and we are already using 3.8.  Sorry for any confusion.  The only row it returns anything for in \"midcon-pjm\" sheet is the one with the date on it.  It doesn't return anything for rows 10 - 87.  Let me know if you need any more information and thanks again.", "is_private": false, "id": 163852, "creation_time": "2012-12-04T15:24:58Z", "time": "2012-12-04T15:24:58Z", "creator": "james.clendennen@morningstar.com", "bug_id": 54228, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 54228, "text": "Ah, I understand now after assuming that you were asking why the Iterator would returned rows that you did not expect to see; those otherwise blank styled rows on your sheet. Instead, it seems to be pretty much the whole of the populated portion of the sheet that is not returned to you. Will take a look later.", "id": 163876, "time": "2012-12-05T07:49:42Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2012-12-05T07:49:42Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 54228, "attachment_id": null, "is_private": false, "id": 163884, "time": "2012-12-05T12:23:48Z", "creator": "yegor@dinom.ru", "creation_time": "2012-12-05T12:23:48Z", "text": "The cells that are not read are missing the R attribute (A1-style cell reference). When POI reads worksheet data it collects cells into a map keyed by columnIndex and the column index is derived from the R attribute. If R is missing then columnIndex is 0 and all such cells are put into the same map entry.\n\nHere is sample xml:\n\n<row>\n    <c r=\"A1\">\n        <v>France</v>\n    </c>\n    <c>  \n       <v>93</v>\n    </c>\n  </row>\n\nThe first cell is read and the second is not. Worse, it overwrites the previosly read A1. \n\nExcel always writes R so POI assumed it is always present. It appears it is not so. Excel resolves cells with missing R relative to the leftmost cell. That is, if R is missing and the previously read cell is A2 then the R is A3, etc.\nIn the example above the cell is resolved as A2 because the previous cell is A1. \n\nI committed the fix in r1417379, you are welcome to try with the latest build from trunk. A link to daily builds is on the POI web site .\n\nYegor"}]