[{"count": 0, "tags": [], "creator": "adam@wisehippy.com", "attachment_id": 29701, "id": 163893, "time": "2012-12-05T19:37:36Z", "bug_id": 54253, "creation_time": "2012-12-05T19:37:36Z", "is_private": false, "text": "Created attachment 29701\nmod_proxy_ftp FTP rc426 handling proposed patch\n\nNoticed this problem in 2.2.22 for HTTP distribution that ties into other distribution hubs via FTP protocol, thus mod_proxy_ftp is used along with a balancer group.\n\nThe problem is when a file is being downloaded via FTP through mod_proxy_ftp, and the user cancels or stops the download, on the FTP server side, issues '426' and then an 'i' is logged for 'incomplete' download in the xferlogs (assuming you're logging with traditional xferlog style).  I am using vsftpd-2.0.5-16.\n\nHowever, on the httpd side, the data connection terminates and handles correctly (from my point of view) in the module, however, the reporting of a HTTP retval of '200' to the access_log for that request seems incorrect to me.  I feel that if it's cancelled, aborted or terminated on the client side, then it should be logged as so.  The functionality isn't broken, it just causes a big issue (in my case) when doing distribution metrics on full and complete item(s).\n\nIt looks as though in proxy_ftp_handler() on line ~1707, it's just automatically assumed that an HTTP_OK is fine all the way through, and only set once at the very top of the handler function stack.  It made sense to me to re-evaluate this later down the line around line ~1905 when the last response from the LIST or RETR commands is done.\n\nI couldn't find any HTTP retval in RFC 2616 that would make sense from a logging perspective for client-side termination, so I used what Nginx uses:  499 HTTP_CLIENT_CLOSED_REQUEST\n\nAttached are my debug logs showing the FTP client/server output and a very rough patch showing my 'solution' to it.\n\nPlease be kind; I'm a mere hack.  If there's a better way to achieve the same results, I'm certainly willing to listen."}, {"count": 1, "tags": [], "creator": "adam@wisehippy.com", "text": "Created attachment 29702\nmod_proxy_ftp - completed download debug", "id": 163894, "time": "2012-12-05T19:38:45Z", "bug_id": 54253, "creation_time": "2012-12-05T19:38:45Z", "is_private": false, "attachment_id": 29702}, {"count": 2, "tags": [], "creator": "adam@wisehippy.com", "attachment_id": 29703, "id": 163895, "time": "2012-12-05T19:39:18Z", "bug_id": 54253, "creation_time": "2012-12-05T19:39:18Z", "is_private": false, "text": "Created attachment 29703\nmod_proxy_ftp - user cancelled/aborted/terminated download debug"}]