[{"count": 0, "tags": [], "creator": "apache-bugzilla@michael-kaufmann.ch", "text": "When mod_deflate is used to inflate, it must adjust the request headers (e.g. it needs to remove the \"Content-Length\" header and adjust the \"Content-Encoding\" header).\n\nCurrently mod_deflate adjusts the headers when the request body is read. But this is too late. For example, if a content generator module needs to look at the request headers before reading the request body, the content generator module \"sees\" the old (unmodified) headers.\n\nmod_deflate should adjust the headers in an early stage, for example in a fixup hook (ap_hook_fixups).\n\nI assume that some other bugs are also caused by this issue, e.g. bug 52595.", "id": 163920, "time": "2012-12-06T12:26:29Z", "bug_id": 54255, "creation_time": "2012-12-06T12:26:29Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 54255, "attachment_id": 33774, "text": "Created attachment 33774\nProposed patch: Adjust the headers in a filter init function\n\nI have created a patch that fixes the problem. I hope that someone finds time to review it.", "id": 190327, "time": "2016-04-17T19:00:28Z", "creator": "apache-bugzilla@michael-kaufmann.ch", "creation_time": "2016-04-17T19:00:28Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 54255, "attachment_id": null, "text": "This looks like the bug I've been trying to figure out - in my case resulting in mod_proxy blowing up and returning an error because the content-length header doesn't match the (deflated) length of the actual content.\n\nIt's not immediately obvious to me why your patch fixes this - it plausibly fixes the Content-Encoding header (because that gets removed in check_gzip), but the Content-Length header (and Content-MD5, though I don't think anything much looks at that!) are still removed in the same place they were previously. Did I miss something or does the patch need to have that added?", "id": 191152, "time": "2016-05-21T03:45:49Z", "creator": "mlrsmith@gmail.com", "creation_time": "2016-05-21T03:45:49Z", "is_private": false}]