[{"count": 0, "tags": [], "text": "Created attachment 29751\nFix for this bug.\n\nWith reference to bug #46175, in the past APR failed to build if some packages were installed in the build environment.\nIn my case, the build failed because the presence of libsqlite3 and the only solution was to disable its support with --with-sqlite3=no option at configure time.\nActually the problem happens because the apr_private.h used here is not the one generated by the build scripts, but it is always the one stored in $(srcdir)/include/arch/win32\nCompared to the file generated by autotools, this apr_private.h is missing the declaration of APR_HAVE_MODULAR_DSO and its absence is causing the above troubles.\nAdding APR_HAVE_MODULAR_DSO to apr_private.h for Win32 solves this old trouble and it is also a safe addition since we are sure that LoadLibrary()/FreeLibrary() functions are always supported on Windows.\n\nAttached patch fixes the build of APR when it is building in these conditions.\n\nUnfortunately, this patch is not still enough for fixing this defect completely.\nWhile libapr-2 is built without troubles, after a while the build process is interrupted because another error:\n\n/bin/sh /d/apr/libtool --silent --mode=link gcc -no-undefined -g -O2   -Wl,--ena\nble-auto-import,--subsystem,console    -release 2 -module -rpath /home/Carlo/ins\nt_apr/lib/apr-2 -o dbd/apr_dbd_sqlite3.la dbd/apr_dbd_sqlite3.lo -lsqlite3\ndbd/.libs/apr_dbd_sqlite3.o: In function `dbd_sqlite3_select_internal':\nc:/apr/dbd/apr_dbd_sqlite3.c:107: undefined reference to `apr_palloc@8'\nc:/apr/dbd/apr_dbd_sqlite3.c:132: undefined reference to `apr_pstrdup@8'\nc:/apr/dbd/apr_dbd_sqlite3.c:128: undefined reference to `apr_palloc@8'\nc:/apr/dbd/apr_dbd_sqlite3.c:152: undefined reference to `apr_pstrmemdup@12'\n\n..etc\n\nEvidently, apr_dbd_sqlite3 depends on libapr-2 (and probably other modules will do the same), so the link step is simply missing \"-lapr-2.0\" at the end of the command line.\nI manually hacked the generated Makefile to verify that it was just missing this option and infact, after this thing has been added manually, the entire APR build has been completely finished (finally!).\n\nUnfortunately, this stuff seems generated by a Python source and I have not the knowledge to make this fix. Unless I have understood wrongly the place where this correction must be done, someone else with Python coding experience should make this last fix.\n\nSincerely,\n\nCarlo Bramini.", "is_private": false, "id": 164050, "creator": "carlo.bramix@libero.it", "time": "2012-12-13T11:21:02Z", "bug_id": 54291, "creation_time": "2012-12-13T11:21:02Z", "attachment_id": 29751}, {"count": 1, "tags": [], "bug_id": 54291, "is_private": false, "id": 201334, "attachment_id": 35404, "creator": "oyan288@gmail.com", "creation_time": "2017-10-07T18:00:35Z", "time": "2017-10-07T18:00:35Z", "text": "Created attachment 35404\nA failed attempt to hack Bugzilla"}, {"count": 2, "tags": [], "bug_id": 54291, "attachment_id": 35404, "id": 201527, "time": "2017-10-18T18:58:47Z", "creator": "markt@apache.org", "creation_time": "2017-10-18T18:58:47Z", "is_private": false, "text": "Comment on attachment 35404\nA failed attempt to hack Bugzilla\n\nApologies for previous the spam attachment to this issue.\n\nUnfortunately, there are a number of people that fail to realise that the ASF Bugzilla instances treat all text attachments as plain text regardless of the MIME type that the creator might claim.\n\nI've marked the attachment as obsolete and blocked the user that created it."}]