[{"count": 0, "tags": [], "bug_id": 5429, "attachment_id": null, "text": "ApplicationContext cannot find resources (such as web.xml) if they do not have \na \"long\" filename in lower case. In that case it considers the filename to be \nuppercase, and the resource is considered missing.\n\nThis is critical on Win9x/Me platforms as the file system is not case-\nsensitive, and standard file copy routines often omit \"long\" names if they fit \nthe \"8.3\" pattern.\n\nThis is critical if you need to distribute a preconfigured Tomcat system to \ndifferent computers with different OS's.\n\nHow-to-reproduce:\n1. Have a multiple-boot system with Windows 98 on FAT drive and Windows 2000 on \nNTFS.\n2. Boot as Windows 2000 and install Tomcat 4.0.1.\n3. Execute xcopy *.* /s/e on Tomcat directory to the FAT drive.\n4. Boot as Windows 98 and launch Tomcat.\n5. Start a browser and load the Tomcat start page. The start page loads, but \nmost applications are not available.\n6. Have a look at log files. There will be multiple complaints on \nmissing \"web.xml\" files.", "id": 8911, "time": "2001-12-14T03:18:53Z", "creator": "ushakov@int.com.ru", "creation_time": "2001-12-14T03:18:53Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 5429, "attachment_id": null, "id": 8912, "time": "2001-12-14T03:36:44Z", "creator": "martin@isallineed.org", "creation_time": "2001-12-14T03:36:44Z", "is_private": false, "text": "This is normal bahaviour, since tomcat (and java..) is fully case sensitive. \nYou have to find another way to copy your files over, so the case is not \naltered. Since I don't run win9x, I don't know an alternative for this (maybe \ndeploying by default on the FAT file system is option?)\n\n"}, {"count": 2, "tags": [], "creator": "remm@apache.org", "text": "Yes, we implemented a few mechanisms which will enforce a Unix-like case-\nsensitivity when Tomcat is run under Windows. On one hand, it may be annoying, \nbut it does make your webapps portable on non-Windows OSes.\nHere, it looks like the problem is a side-effect of this, and I can't see any \nworkaround.", "id": 8914, "time": "2001-12-14T03:56:03Z", "bug_id": 5429, "creation_time": "2001-12-14T03:56:03Z", "is_private": false, "attachment_id": null}]