[{"count": 0, "tags": [], "creator": "uday.cheera@gmail.com", "attachment_id": null, "id": 164174, "time": "2012-12-20T13:06:32Z", "bug_id": 54334, "creation_time": "2012-12-20T13:06:32Z", "is_private": false, "text": "Hi Team,\n\nDescription:-\n\n1. My Application was in Windows 2008 server R2 with Tomcat-7.0.27 as a service and MySql database.\n\n2. My application has an active directory configuration, for multiple users on particular domain based.\n\n3. So the corresponding domain user had ex:- Windows-7 operating system, then the user was take the url of app from Windows Server 2008 R2 Ex:-(http://172.55.889.230:8080/XXXXXXXXX).\n\n4. Active directory user was accessed the application using URL (http://172.55.889.230:8080/XXXXXXXXX).\n\n5. Active directory user operating system was ex:- Windows-7 now user going to upload the files from ex:-windows-7 through accessed application to data base , Data base was(MySql) was installed in Windows server 2008 R2, when the tomcat  installed and MySql data base installed on the location.\n\n6. When an Active directory user is going to upload the files from user system(ex:-Windows-7-32-bit) to database , the database location (windows-2008-R2-64-bit).\n\n7. Application had a active directory user configuration, by using this active directory user accessed application through URL in his system(ex:-windows-7).\n\n\nNow The Issue is :-\n\nWhen an active directory user was going to upload the files from his system (ex:-windows-7) to database.\nIt shows an error called \"Files path does not exist\" .\n\nIn this i am using Tomcat -7.0.27 installed in Windows -Server -R2 2008 as a windows service and JDK-6,  \n\nI run the tomcat-7.0.27 as service in Windows-server 2008 R2, and i tried latest version 7.0.34 as well.\n\nIf i stop the tomcat 7.0.27 service then i start tomcat as manually, when i click ex:- startup.bat\n\nFile uploding is successfully from active directory user(windows-7) to windows server 2008 R2 , MySql database.\n\n\nHow Should i take this uploading process working on a Tomcat service level???\n\nOther wise is there any alternative please suggest me!!\n\nThanks,\nUday"}, {"count": 1, "tags": [], "text": "Bugzilla is not a support forum. Please use the users mailing list.", "is_private": false, "id": 164176, "creator": "markt@apache.org", "time": "2012-12-20T13:15:53Z", "bug_id": 54334, "creation_time": "2012-12-20T13:15:53Z", "attachment_id": null}]