[{"count": 0, "tags": [], "bug_id": 54353, "text": "Created attachment 29795\nchart with different colors when viewed in Excel 2010 and above version\n\nGenerated Chart shows the consistency of the graph color when viewed in Excel 2007 or below version. Where as generated chart showing different colors when opened in Excel 2010 or above version. We are using poi 3.8 and 3.9 to generated the excel sheet.\n\nIs their any possible way to show the consistency of the graph color with poi 3.8 or 3.9 supporting Excel 2010 or above version.\n\nFind the attached file which shows the graphs viewed in different versions of Excel.", "id": 164260, "time": "2012-12-27T15:12:12Z", "creator": "kotvali.rajani@gmail.com", "creation_time": "2012-12-27T15:12:12Z", "is_private": false, "attachment_id": 29795}, {"count": 1, "tags": [], "bug_id": 54353, "text": "Properties like 'vary color by points', 'Mojor Gridlines', 'Scatter Chart with Smoothlines' - how they are handled for Excel 2010 using poi 3.8 or 3.9", "id": 164346, "time": "2013-01-03T08:56:21Z", "creator": "kotvali.rajani@gmail.com", "creation_time": "2013-01-03T08:56:21Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 54353, "attachment_id": 32855, "id": 183749, "time": "2015-06-25T11:54:49Z", "creator": "tallison@mitre.org", "creation_time": "2015-06-25T11:54:49Z", "is_private": false, "text": "Created attachment 32855\nDoh, wrong issue.  Ignore."}, {"count": 3, "tags": [], "text": "Chart support is still quite limited for both HSSF and XSSF. Some work has been done recently (3.17 beta), but much work is still needed.\n\nUsage questions should be asked on the mailing list.", "attachment_id": null, "id": 199678, "creator": "onealj@apache.org", "time": "2017-07-10T02:27:49Z", "bug_id": 54353, "creation_time": "2017-07-10T02:27:49Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 54353, "text": "If the file specifies to use Excel's default color palette, that depends on the document or system theme colors.  \"Automatic\" setting doesn't store the color info in the XLSX document.  Thus two different installations of Excel could have different default color schemes that apply to automatically colored elements like chart series.\n\nIf you want consistency explicitly define a default theme in the document.  Easiest I've found is to use Excel to create a theme I want, set it as the document theme, save an empty document, and use it as a template in POI - open a copy of that document and add your data/charts etc. to it every time.  Faster than figuring out how to code a theme in my experience.", "id": 199681, "attachment_id": null, "creator": "gwoolsey@apache.org", "creation_time": "2017-07-10T05:22:16Z", "time": "2017-07-10T05:22:16Z", "is_private": false}]