[{"count": 0, "tags": [], "bug_id": 54361, "attachment_id": 29799, "is_private": false, "id": 164284, "time": "2012-12-31T00:13:18Z", "creator": "david.blevins@gmail.com", "creation_time": "2012-12-31T00:13:18Z", "text": "Created attachment 29799\nVery rough cut of something that might work (not verified)\n\nDiscussed some time ago, we need the Tomcat zips in the maven repo to build TomEE.  This is also useful for tools like Arquillian which will download actual server zips and setup a server for test."}, {"count": 1, "tags": [], "bug_id": 54361, "is_private": false, "text": "+ t7 mvn plugin deploys tomcat to repo1 too so finally a lot of project do it", "id": 164288, "time": "2012-12-31T09:20:10Z", "creator": "rmannibucau@gmail.com", "creation_time": "2012-12-31T09:20:10Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 164397, "time": "2013-01-04T22:28:42Z", "bug_id": 54361, "creation_time": "2013-01-04T22:28:42Z", "text": "Putting full binaries in a Maven repo still seems wrong to me.\n\nThat said, managing the central repo is not my problem and - based on the presence of a number of binaries for a range of projects in the central repo - the folks that do maintain it appear to be quite happy with full binaries being added.\n\nSince the repo is happy hosting full binaries and there are folks that want them I have no objection to adding this to our build process. If they are going to be published, better they are published by the Tomcat PMC than a.n. other random person/org.\n\nI'll take a look at the patch."}, {"count": 3, "tags": [], "bug_id": 54361, "text": "Comment on attachment 29799\nVery rough cut of something that might work (not verified)\n\nIs there a reason so many folks add patches as \"application/octet-stream\" rather than \"plain/text\" and don't tick the patch checkbox? I seem to find myself tweaking attachment details more often than not.", "id": 164398, "time": "2013-01-04T22:30:29Z", "creator": "markt@apache.org", "creation_time": "2013-01-04T22:30:29Z", "is_private": false, "attachment_id": 29799}, {"count": 4, "attachment_id": null, "bug_id": 54361, "text": "After some experimentation with the snapshot repository, I went with a slightly different approach.\n\nThe results can be found in the snapshot repository at this url:\nhttps://repository.apache.org/content/repositories/snapshots/org/apache/tomcat/tomcat/7.0-SNAPSHOT/\n\nIf that isn't suitable, feel free to re-open this bug to request modifications.\n\nThe patch has been applied to trunk and 7.0.x and will be included in 7.0.35 onwards. That means that from 7.0.35 the Tomcat binaries will be available from the Maven repositories.", "id": 164439, "time": "2013-01-07T16:26:11Z", "creator": "markt@apache.org", "creation_time": "2013-01-07T16:26:11Z", "tags": [], "is_private": false}]