[{"count": 0, "tags": [], "text": "Hi\n\nI have implemented a web application, and it runs on Apache Tomcat 7.0.34. It works with differents databases (DB2), using JDBC connections.\n\nI have noticed that there is a \"sessions overlaping\". Sometimes, a user that is working with my program retrieves the information from other user's session, even if they are working with differents databases.\n\nI have changed the Tomcat configuration, but the problem is still persisting.\n\nThe machine is a Windows server 2003, Service Pack 2, with 2 GB RAM. It has no more application servers installed.\n\nThank in advance", "attachment_id": null, "id": 164570, "creator": "antonio_palomares@yahoo.es", "time": "2013-01-10T16:07:40Z", "bug_id": 54405, "creation_time": "2013-01-10T16:07:40Z", "is_private": false}, {"count": 1, "tags": [], "text": "Bugzilla is not a support forum.\n\nIssues such as the ones you describe are nearly always application issues, not Tomcat issues.\n\nYou should use the Tomcat users mailing list to debug this issue further.\n\nIf, and only if, that debugging identifies a Tomcat bug as the root cause should you re-open this issue.", "attachment_id": null, "id": 164571, "creator": "markt@apache.org", "time": "2013-01-10T16:10:21Z", "bug_id": 54405, "creation_time": "2013-01-10T16:10:21Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 54405, "is_private": false, "id": 164573, "time": "2013-01-10T17:20:51Z", "creator": "antonio_palomares@yahoo.es", "creation_time": "2013-01-10T17:20:51Z", "tags": [], "text": "An application can access to the information from differents sessions of Tomcat, or it is possible to swap sessions? How?\n\nSince i have changed the configuration of the Tomcat, the number of \"overlaping sessions\" has decreased, but the problem still persists.\n\nI have been using Tomcat during several years, and this problem only occurs with versions 7.0.27 and 7.0.34.\n\nI have looked for something similar in google. There were only a few references, and all of them pointed to a memory problem.\n\nThanks\n\n(In reply to comment #1)\n> Bugzilla is not a support forum.\n> \n> Issues such as the ones you describe are nearly always application issues,\n> not Tomcat issues.\n> \n> You should use the Tomcat users mailing list to debug this issue further.\n> \n> If, and only if, that debugging identifies a Tomcat bug as the root cause\n> should you re-open this issue."}, {"count": 3, "tags": [], "bug_id": 54405, "text": "(In reply to comment #2)\n\nTo repeat: bugzilla is NOT a support forum.  Post your queries on the Tomcat users' mailing list.", "id": 164574, "time": "2013-01-10T17:35:14Z", "creator": "chuck.caldarale@unisys.com", "creation_time": "2013-01-10T17:35:14Z", "is_private": false, "attachment_id": null}]