[{"count": 0, "tags": [], "text": "The NIO and BIO connectors share (most of) a JSSE based SSLImplementation, but differ in their handling of the ciphers and sslEnabledProtocols attributes.\n\nThe NIO connector sets the configured values for both attributes directly on the SSLEngine, which will fail immediately if any of them are unsupported. This makes creating a portable/superset collection of ciphers impossible - i.e. IBM JDKs do not support many of the cipher suite names used by JSSE and vice versa (usually TLS_ vs SSL_ prefixes differ) and the supported options differ between Java 6/7 etc.\n\nThe BIO connector attempts to filter the specified values down to those supported by the SSL implementation, but has issues as well: if none of the specified ciphers/protocols are supported it will silently use the defaults of the SSL implementation, which can lead to unexpectedly (and unwittingly) insecure configurations.\n\nI propose to:\n - modify the NIO connector to use the same logic as the BIO connector to filter requested ciphers/protocols to supported values (by placing these operations on the SSLUtil interface). \n - modify the ciphers/protocols filtering logic to treat an explicit list of unsupported options as setting no supported ciphers/protocols and warn when this is done (it will also fail visibly with errors if SSL connections are attempted).", "is_private": false, "id": 164576, "creator": "timw@apache.org", "time": "2013-01-10T21:09:19Z", "bug_id": 54406, "creation_time": "2013-01-10T21:09:19Z", "attachment_id": null}, {"count": 1, "text": "+1\n\nThere was a post to the users' list recently where a user attempted to configure JSSE using OpenSSL-style cipher names. The result was evidently that the Connector used the default list of ciphers. I assert that this is a security problem.", "creator": "chris@christopherschultz.net", "attachment_id": null, "id": 164587, "time": "2013-01-11T16:55:24Z", "bug_id": 54406, "creation_time": "2013-01-11T16:55:24Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "Fixed in trunk and in 7.0.x and will be included in 7.0.36 onwards.\n\nThe change involved a modification to the org.apache.tomcat.util.net.SSLUtil interface, which will require updates to custom SSLImplementations.", "is_private": false, "id": 164615, "creator": "timw@apache.org", "time": "2013-01-13T22:10:20Z", "bug_id": 54406, "creation_time": "2013-01-13T22:10:20Z", "attachment_id": null}]