[{"attachment_id": null, "tags": [], "creator": "shmulikk@gmail.com", "text": "I have a response assertion on the root of my test plan.\nI have setup a transaction controller and inside it an http sampler.\nThe assertion works just fine for the http sampler, but it also asserting the transaction controller and failing it with a \"Response was null\" error.\n\nThis now forcing me to duplicate the assertion as a child of each relevant http sampler instead of having just one, at the root of the test plan.\n\nI don't see any reason for assertions to assert logic controller.", "count": 0, "id": 164873, "time": "2013-01-24T21:02:52Z", "bug_id": 54481, "creation_time": "2013-01-24T21:02:52Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 54481, "attachment_id": 29893, "id": 164874, "time": "2013-01-24T21:06:06Z", "creator": "shmulikk@gmail.com", "creation_time": "2013-01-24T21:06:06Z", "is_private": false, "text": "Created attachment 29893\nTestplan to reproduce the issue"}, {"count": 2, "tags": [], "creator": "milamber@apache.org", "attachment_id": null, "id": 164942, "time": "2013-01-30T12:24:47Z", "bug_id": 54481, "creation_time": "2013-01-30T12:24:47Z", "is_private": false, "text": "The transaction controller haven't response data, thus Response Assertion can't check in this data.\n\nIn Response Assertion, you can change option \"Apply to:\" Sub-samples only to work."}, {"count": 3, "tags": [], "text": "I am not sure it is invalid.\nIn more complex cases, I have both Transaction Controllers and (HTTP) Samplers (which are not in Transaction Controllers) in the same level in a thread group.\n\nThe solution you suggested will not work in such cases.", "attachment_id": null, "id": 164944, "creator": "shmulikk@gmail.com", "time": "2013-01-30T13:58:34Z", "bug_id": 54481, "creation_time": "2013-01-30T13:58:34Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "milamber@apache.org", "text": "Perhaps we need to disable assertion test on Transaction controller when a Assertion Response passes inside.\nThus, when we have some TC and HTTP Requests at same level than a Assertion Response with Apply to \"Main and Subsamplers\" there haven't errors (null data on tc)  (and if no errors on req http)", "count": 4, "id": 164946, "time": "2013-01-30T16:44:55Z", "bug_id": 54481, "creation_time": "2013-01-30T16:44:55Z", "is_private": false}, {"count": 5, "tags": [], "creator": "sebb@apache.org", "text": "There is something odd happening here.\n\nIf the TC is set to not generate a parent sample, then the RA works.\n\nAdding an Assertion Results Listener shows two entries.\n\nThe RA should fail when applied to the TC sample result as that is empty.\nHoewever it does not fail; looks like the RA somehow runs against the wrong data here. Yet the AR Listener shows TC in its list.", "id": 164947, "time": "2013-01-30T19:25:18Z", "bug_id": 54481, "creation_time": "2013-01-30T19:25:18Z", "is_private": false, "attachment_id": null}]