[{"count": 0, "tags": [], "bug_id": 54498, "attachment_id": null, "text": "I have problem with regular crash my apache / whole server because of out of memory. \n\nAfter investigating I found somebody sends requests to any .cgi script with this header [HTTP_ACCEPT] => !!mUiX6BaBHCeqIoxmNSdGa/XC2O8YisRs3w03aglTIw0A\nI have only certain group of scripts installed, but i think it will crash with any script. \n\nAs a result it generates thousand httpd proccesses and it eat all resourses.\nIn log \n212.117.160.93 - - [08/Jan/2013:17:41:19 -0600] GET /cgi-bin/a2/out.cgi HTTP/1.1 \"200\" 56695613 \"http://cut.../cgi-b\nin/a2/out.cgi\" \"Mozilla/4.0 (compatible; MSIE 5.01; Windows NT 5.0)\" \"-\"\n\nThis is 56695613 answer size. It looks like while it return this answer all scripts are locked and because new requests are incoming - in couple of minutes there are accumulated thousand httpd proccesses.\n\nI verified and simulated it - it crashes apache every time when I send this headers. It works on Freebsd server. I tried send this request to other OS - it doesnt crash. \nBefore I found this problem I tried reinstall OS from freebsd 8 to freebsd 9. I also tried all versions of Apache, including last one, and all mysql, php, nginx.\n\nCould you fix this please. This person changes ip and I need catch his ip and add to blacklist. But time of time my server crashes.\n\nThanks", "id": 164916, "time": "2013-01-28T22:23:00Z", "creator": "franktraffic@gmail.com", "creation_time": "2013-01-28T22:23:00Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "franktraffic@gmail.com", "text": "rdtfgyuhijkl;'\nwertyui\n\n\n\nany one read this and going to fix??", "count": 1, "id": 165256, "time": "2013-02-15T00:16:28Z", "bug_id": 54498, "creation_time": "2013-02-15T00:16:28Z", "is_private": false}, {"count": 2, "tags": [], "creator": "covener@gmail.com", "text": "You'll need to provide some more detail if anyone is going to have a serious look. The detail you provided didn't have any effect on a sample CGI on Linux, AIX, or Solaris.", "id": 165257, "time": "2013-02-15T00:47:42Z", "bug_id": 54498, "creation_time": "2013-02-15T00:47:42Z", "is_private": false, "attachment_id": null}, {"attachment_id": 29957, "tags": [], "creator": "franktraffic@gmail.com", "text": "Created attachment 29957\nthis show what happen", "count": 3, "id": 165262, "time": "2013-02-15T11:25:46Z", "bug_id": 54498, "creation_time": "2013-02-15T11:25:46Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 54498, "attachment_id": null, "text": "(In reply to comment #2)\n> You'll need to provide some more detail if anyone is going to have a serious\n> look. The detail you provided didn't have any effect on a sample CGI on\n> Linux, AIX, or Solaris.\n\nPlease specify what info can I provide more? I have attached screenshot.\nI send simple request with this tool http://soft-net.net/send-http-tool/\nThis 276 processes are generated after 5 seconds. It will be 1,5k+ in minute and server will be out of memory if not restart apache.\n\nThis happens on FreeBsd server. I have reinstalled it from clean and it happens again. \n\nI am interested this to be fixed, because somebody disturb my server with this.\n\nPlease try it. Or should I make script and crash all freebsd servers for make you interesting.\n\nThanks.", "id": 165263, "time": "2013-02-15T11:27:21Z", "creator": "franktraffic@gmail.com", "creation_time": "2013-02-15T11:27:21Z", "is_private": false}, {"count": 5, "tags": [], "creator": "covener@gmail.com", "text": "Can you get a backtrace of the CGI and httpd processes?  It would be best if you reproduced with a simple \"hello world\" CGI. Also details of your version and configuration.", "id": 165264, "time": "2013-02-15T12:54:33Z", "bug_id": 54498, "creation_time": "2013-02-15T12:54:33Z", "is_private": false, "attachment_id": null}]