[{"count": 0, "tags": [], "bug_id": 54503, "attachment_id": 29906, "id": 164929, "creation_time": "2013-01-29T15:30:00Z", "time": "2013-01-29T15:30:00Z", "creator": "toby.hobson@cloudseal.com", "text": "Created attachment 29906\nUnified diff including new and changed files\n\nSAML2 is a standard for cross-domain single sign on and federation. We have developed a Tomcat authenticator which acts as a SAML2 service provider i.e. it allows Tomcat applications to delegate authentication to a single sign on server (identity provider). We already offer this authenticator to our customers but we would now like to contribute it to the wider Tomcat community.\n\nWhilst Tomcat already offers single sign on between webapps, SAML2 allows SSO between different platforms (.NET, PHP etc) and different hosts so we feel it's a useful contribution.\n\nThe authenticator we have developed supports the most common SAML2 profiles and binding i.e. the Web browser SSO profile using the redirect/post binding. We have tested it with our own SSO server and also with a PHP implementation (Simple SAML PHP). It should also work with other SAML2 implementations although this has not been tested.\n\nI've attached quite a large patch which includes couple of changes to the core code and several additions:\n\n- A new authenticator (SamlAuthenticator)\n- An example webapp which demonstrates some of the features\n- Various tests (which make use of the example webapp)\n- Updates to the build.xml script\n- Updates to the documentation, explaining how to use the new authenticator. We still need to add some more detail here\n- Minor changes to Realm and RealmBase (see below)\n\nThe SamlAuthenticator always retrieves the username from the IDP (SSO server) and it can retrieve the Principal's roles one of two ways: 1) The IDP can pass the roles across to Tomcat along with the username. 2) Tomcat can lookup the roles from a configured Realm. To achieve this we had to make a change to Realm to allow allow \"authentication\" using a username alone.\n\nThe authenticator has 4 dependencies:\n\n- saml2-core (our general saml2 library, in maven central with an Apache 2 license)\n- log4j (required by saml2-core)\n- commons-codec (required by saml2-core)\n- commons-io (required by saml2-core)\n\nThis patch should be applied at p0 i.e. \"patch -p0 < saml2.diff\".\n\nI'm sure there will be plenty of questions which I'm happy to answer\n\nToby", "is_private": false}, {"count": 1, "tags": [], "bug_id": 54503, "is_private": false, "text": "I'm floored: a great idea, backed-up with a complete set of diffs including test cases and examples. I'm looking forward to diving-into the code further when I get some time.\n\nI did have two initial reactions when doing a (very) brief overview of the patch:\n\n1. Is the term \"Cloudseal\" a requirement? I see that, for instance, the type of authentication is registered as CLOUDSEAL instead of, say, SAML2. I think we'd prefer to use the generic name (SAML2) rather than a particular service (Cloudseal).\n\n2. I noticed that you changed CombinedRealm.getPrincipal(). Can you explain why that needed to change? I don't see any of your code that calls Realm.getPrincipal.\n\nAgain, thanks for the great contribution.", "id": 164935, "time": "2013-01-29T18:47:50Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-01-29T18:47:50Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "toby.hobson@cloudseal.com", "attachment_id": null, "is_private": false, "id": 164937, "time": "2013-01-29T21:08:21Z", "bug_id": 54503, "creation_time": "2013-01-29T21:08:21Z", "text": "Hi Christopher\n\n\"Cloudseal\" is certainly not a requirement, SAML2 would indeed be a better name. I think the term is a hangover from our current implementation of the authenticator which we offer with our product (we describe it as a \"Cloudseal Authenticaor). The only thing I would point out is that the code uses a class called CloudsealPrincipal. This would have to remain because CloudsealPrincipal is defined in our saml2-core library. We may refactor this class at some stage but there's nothing SAML specific about it (and we also use it for our OAUTH2 implementation)\n\nThere's a transitive dependency on CombinedRealm.getPrincipal(String) - As mentioned in the bugzilla comments the SamlAuthenticator can lookup roles against a configured realm. We modified Realm to add authenticate(String). RealmBase.authenticate(String) calls getPrincipal(String) and CombinedRealm extends RealmBase. The modification allows a developer to use CombinedRealm with the SamlAuthenticator if he wants."}, {"count": 3, "tags": [], "bug_id": 54503, "attachment_id": null, "id": 167929, "creation_time": "2013-06-20T14:43:21Z", "time": "2013-06-20T14:43:21Z", "creator": "markt@apache.org", "text": "That is a big patch.\n\nI have one immediate concern with the proposed patch with is the unknown licensing of the new JAR file.\n\nLooking more broadly, I think it would be worth (re-)considering adding JASPIC to Tomcat. Most of the code should be available in TomEE. That would then provide a standard mechanism to plug-in additional authentication mechanisms such as SAML2. At the moment, I'd be happier with SAML2 as an optional extra rather than as a core component.", "is_private": false}, {"count": 4, "tags": [], "text": "(In reply to Mark Thomas from comment #3)\n> That is a big patch.\n> \n> I have one immediate concern with the proposed patch with is the unknown\n> licensing of the new JAR file.\n> \n> Looking more broadly, I think it would be worth (re-)considering adding\n> JASPIC to Tomcat. Most of the code should be available in TomEE. That would\n> then provide a standard mechanism to plug-in additional authentication\n> mechanisms such as SAML2. At the moment, I'd be happier with SAML2 as an\n> optional extra rather than as a core component.\n\nWhich jar? saml2-core is licensed under Apache 2", "is_private": false, "bug_id": 54503, "id": 167936, "time": "2013-06-20T17:19:03Z", "creator": "toby.hobson@cloudseal.com", "creation_time": "2013-06-20T17:19:03Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 54503, "is_private": false, "text": "This isn't going to be added to the core Tomcat distribution but as of Tomcat 9 (9.0.0.M4 onwards) Tomcat supports JASPIC which provides a pluggable mechanism for authentication.\n\nGiven the relatively low level of interest, a 3rd-party JASPIC module looks like the way to go for SAML. If you do go this route then do let the Tomcat team know if you find any issues in the JASPIC implementation and we'll get them fixed.", "id": 188485, "time": "2016-02-16T21:46:51Z", "creator": "markt@apache.org", "creation_time": "2016-02-16T21:46:51Z", "attachment_id": null}]