[{"count": 0, "tags": [], "bug_id": 54517, "attachment_id": 29914, "id": 164984, "creation_time": "2013-02-01T15:47:24Z", "time": "2013-02-01T15:47:24Z", "creator": "bpkroth@gmail.com", "text": "Created attachment 29914\nA patch to provide failonbadgateway setting and functionality to the mod_proxy_balancer.\n\nHello,\n\nWe have a setup for a semi-busy site using mod_proxy_balancer together with sticky sessions and keepalives to map clients to various backends.\n\nIn one odd case, one backend would accept connections, but some local IO was broken (of course in the middle of the night), so it would continuously timeout until someone kicked it.  The timeout is setup ridiculously high for edge case application reasons, so that wasn't the issue.\n\nI was suprised to learn that the balancer did not mark that node as in error state so that it backed off of it.\n\nBasically it was the partial failure, but not complete failure that was the problem.  Had there been a complete failure, the connection checks would have marked the node in error state, and had the node returned a status line (or really anything) the failonstatus configuration could have possibly caught it.\n\nInstead, since we were using byrequests at the time, the node handled fewer and fewer requests and was selected more and more over time to service new requests.\n\nInstead, I propose the following patch.  It provides a \"failonbadgateway\" option that will mark a node as in error state if the handler returns a HTTP_BAD_GATEWAY response (in looking through the various modules this seems like a reasonable way to consolidate the case of timeouts as well as other backend worker protocol violations across several modules, and not just the mod_proxy_http one).\n\nPlease let me know if you have any comments or questions.\n\nThanks,\nBrian", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 54517, "is_private": false, "id": 164985, "time": "2013-02-01T16:57:56Z", "creator": "christophe.jaillet@wanadoo.fr", "creation_time": "2013-02-01T16:57:56Z", "tags": [], "text": "Hi,\n\nr1438130 must be wrong.\nIt seems completely unrelated.\n\nCan you update it please ?"}, {"count": 2, "attachment_id": null, "bug_id": 54517, "is_private": false, "id": 164989, "time": "2013-02-01T19:27:57Z", "creator": "bpkroth@gmail.com", "creation_time": "2013-02-01T19:27:57Z", "tags": [], "text": "Yeah, that was just the place my local repo was at when I did the svn diff.  It's not related at all.\n\nBrian"}]