[{"count": 0, "tags": [], "bug_id": 54521, "is_private": false, "text": "Concerned components:\norg.apache.catalina.authenticator.DigestAuthenticator\norg.apache.catalina.authenticator.DigestAuthenticator.NonceInfo\n\nScenario:\nA multithreaded client sends two requests within one millisecond. The DigestAuthenticator creates for each request a nonce as well as a NonceInfo instance. The two nonces are equal, as they were created within the same millisecond. When writing data into the cache (method generateNonce()), the second NonceInfo instance overwrites the first one (same key!).\n\nProblem:\nThe two client threads then send a second request with a digest authentication header. In both requests, “nc” (nonce count) is equal “1”, as the nonce has been newly created. In the NonceInfo of the first request, array “seen” is set to “true” for index ((nonceCount + offset) % seen.length). In the second request the same NonceInfo instance is used, as the instance is retrieved from map “nonces” using “nonce” as a key, that is, in both requests the same key is used. Consequently, method “nonceCountValid()“ returns „false“, as  seen[(nonceCount + offset) % seen.length)] has already been set to „true“.  Therefore the authentication fails, although the client has sent a valid digest authentication header.\n\nConclusion:\nWorking with multi-threaded clients with many requests, digest authentication does not function reliably.", "id": 165045, "time": "2013-02-04T10:54:16Z", "creator": "sven.stieber@traveltainment.de", "creation_time": "2013-02-04T10:54:16Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 54521, "is_private": false, "id": 165115, "creation_time": "2013-02-07T11:03:58Z", "time": "2013-02-07T11:03:58Z", "creator": "markt@apache.org", "text": "Thanks for the report.\n\nThis has been fixed in trunk and 7.0.x and will be included in 7.0.37 onwards.", "attachment_id": null}, {"count": 2, "tags": [], "creator": "sven.stieber@traveltainment.de", "text": "Thank you for fixing this that quick. One additional question: Will this fix be included into the next Tomcat 6 Release, too?", "id": 165131, "time": "2013-02-08T08:41:43Z", "bug_id": 54521, "creation_time": "2013-02-08T08:41:43Z", "is_private": false, "attachment_id": null}]