[{"count": 0, "tags": [], "bug_id": 54543, "attachment_id": null, "id": 165163, "time": "2013-02-10T17:20:33Z", "creator": "david@ols.es", "creation_time": "2013-02-10T17:20:33Z", "is_private": false, "text": "Regular expressions are compiled (with ap_pregcomp) when parsing the configuration regardless if they will end being used or not.\n\nIf it makes sense i can submit a patch that will not compile the regex and substitute the calls to ap_regexec to calls to a function that will compile the regex if x->regex is null so only really need regex will be compiled\n\nI think this could improve performance a bit, specially when using END/L flags and when the request matches the first rules, and will not affect performance in other cases. Anyway i could implement this as an option if you guys think that it will be better that way."}, {"count": 1, "tags": [], "bug_id": 54543, "attachment_id": 29945, "id": 165224, "time": "2013-02-13T09:49:30Z", "creator": "david@ols.es", "creation_time": "2013-02-13T09:49:30Z", "is_private": false, "text": "Created attachment 29945\nPatch that add NPC new RewriteRule flag\n\nWhen a RewriteRule has the NPC flag the rule will not be regex-compiled until the rule needs to be applied.\n\nThis flag only have sense and will only work for rules inside .htaccess files. Also the affected rule will be compiled each time is need so it should not be applied to rules that could be re-evaluated on the same request, usually this means that it should only be used when you are sure that the rule will not be evaluated again in the same request.\n\nfor example, if we are using some kind of php based CMS that resides on the root of the server and handles dynamic requests through index.php and uses SEO url's using mod_rewrite in a .htaccess file like this:\n\n# avoid applying more rules to static content\nRewriteRule ^(css|js|i)/.+   - [L,QSA]\n\n# dinamic content\nRewriteRule ^([a-z]+)/([0-9]+)$ /index.php?section=$1&id=$2 [END,NS,QSA]\n\n# and a lot of similar rules ...\n\nNow, all rules in the .htaccess file are always compiled, even for static content requests. We can avoid this and even avoid in many cases having to compile all rules for dinamic content using the NPC flag:\n\n# avoid applying any rule to static content\nRewriteRule ^(css|js|i)/.+   - [L,QSA]\n\n# dinamic content\nRewriteRule ^([a-z]+)/([0-9]+)$ /index.php?section=$1&id=$2 [END,NS,QSA,NPC]\n\nin this case for static content matched by the first rule no other rule having NPC will be compiled thus saving the time need for regex compilation"}]