[{"attachment_id": 29946, "tags": [], "creator": "david@ols.es", "is_private": false, "count": 0, "id": 165226, "time": "2013-02-13T12:16:47Z", "bug_id": 54556, "creation_time": "2013-02-13T12:16:47Z", "text": "Created attachment 29946\nPatch that add CDEF new RewriteRule flag\n\nThe CDEF flag marks the rule as the default rule for a rule chain.\n\nIf the rule does not match it acts as if it has the CHAIN flag and makes the engine skip all chained rules.\n\nIf the rule matches the result is saved as the default result for the rule chain and the rule is ignored as if it didn't match, then engine continues testing rules in the chain. If one of the chain rules matches then the default is discarded and the matching rule is used. If none of the chained rules matches, then the default is used.\n\nIt converts the rule tagged with CDEF as a sort of RewriteCond that can be used with more than one rule and provides a default result, but it also actually prevents the chained rules to be tested if it does not match:\n\nFor example:\n\nRewriteRule ^example$\t/index.php?action=foo [L,NS,QSA]\nRewriteRule ^(login|lostpw|logout|expired)$\t/index.php?page=$1 [L,NS,QSA]\nRewriteRule ^([a-z]+)$ /index.php?section=$1 [L,NS,QSA]\n\nThe first two rules are exceptions to the last one and in a normal setup a uri that does not match any of this rules will triger a test on every rule. Using CDEF it can be written that way;\n\nRewriteRule ^([a-z]+)$ /index.php?section=$1 [L,NS,QSA,CDEF]\nRewriteRule ^example$\t/index.php?action=foo [L,NS,QSA,C]\nRewriteRule ^(login|lostpw|logout|expired)$\t/index.php?page=$1 [L,NS,QSA]\n\nthis way non-matching uri's will only trigger a test on the first rule and all the other two will be skipped"}, {"count": 1, "tags": [], "bug_id": 54556, "attachment_id": 29947, "is_private": false, "id": 165227, "time": "2013-02-13T12:18:34Z", "creator": "david@ols.es", "creation_time": "2013-02-13T12:18:34Z", "text": "Created attachment 29947\nPatch that add CDEF new RewriteRule flag\n\nis the same patch, is just that submitting it when opening the request does not allow to see the diff"}]