[{"count": 0, "tags": [], "bug_id": 54583, "is_private": false, "text": "We have a number of processor-only <javac> tasks, but that is specified as a compiler arg as there's no attribute for this setting. With 1.8.x the <javac> task now generates empty package-info.class files if the compiler didn't, but if we're running processor-only, no class files should be generated. I can workaround it by adding a destdir attribute on the affected <javac> calls, but natively recognizing this compiler argument to disable package-info.class generation would be preferred.", "id": 165379, "time": "2013-02-19T18:57:57Z", "creator": "jgeorgeson@lgc.com", "creation_time": "2013-02-19T18:57:57Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 54583, "is_private": false, "id": 165593, "creation_time": "2013-03-03T10:15:40Z", "time": "2013-03-03T10:15:40Z", "creator": "bodewig@apache.org", "text": "Doesn't it work if you use createMissngPackageInfoClass=\"false\"?\n\nI'm a bit reluctant to adding special handling for the proc flag when there may be other args that would also have an effect and createMissngPackageInfoClass has been introduced just for cases like yours.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 54583, "text": "That option does work for us. When I searched the Ant manual I was looking for processor related options and completely glossed over this one. However I still think it would be nice to not have to specify both. The javac compiler invoked directly with -proc:only doesn't produce class files, so it's counter-intuitive to have to remember this individual case.", "id": 165809, "time": "2013-03-13T20:01:11Z", "creator": "jgeorgeson@lgc.com", "creation_time": "2013-03-13T20:01:11Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 54583, "text": "Agreed with reporter that <javac> should try to follow CLI javac’s behavior unless there is a reason to differ.", "id": 165812, "time": "2013-03-13T20:17:28Z", "creator": "jglick@apache.org", "creation_time": "2013-03-13T20:17:28Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 54583, "is_private": false, "id": 165825, "creation_time": "2013-03-14T08:02:02Z", "time": "2013-03-14T08:02:02Z", "creator": "bodewig@apache.org", "text": "Well, my reason would be that we'd have to understand several compiler args by several compilers to ensure we do the right thing.\n\nThat being said, I certainly won't block anybody who'd attempt to implement such logic ;-)", "attachment_id": null}]