[{"count": 0, "tags": [], "bug_id": 54591, "attachment_id": 29972, "text": "Created attachment 29972\nUse this class to generate files that will not open in Excel under Windows 7\n\nI have attached a very simple example class that produces the most simple xls file possible that illustrates this problem.  The problem is that when I try to use Excel on Windows 7 to open the file generated using POI, Excel will not open it and shows an error (unreadable content error).  The same file can be opened in Excel 2008 for Mac.\n\nThe following MS article explains an issue that may be the issue here:\nhttp://support.microsoft.com/kb/2411912\n\nTo replicate, compile the attached java class with poi 3.9.  Run it to produce the xls.  Then under windows 7, try to open the file in Excel.  You should see the error.  I also observe the issue back poi 3.0.1.", "id": 165407, "time": "2013-02-20T18:02:34Z", "creator": "eric.pias@frevvo.com", "creation_time": "2013-02-20T18:02:34Z", "is_private": false}, {"attachment_id": 29980, "tags": [], "creator": "markbrdsly@tiscali.co.uk", "is_private": false, "count": 1, "id": 165434, "time": "2013-02-22T11:45:22Z", "bug_id": 54591, "creation_time": "2013-02-22T11:45:22Z", "text": "Created attachment 29980\nExcel workbook that opens successfully."}, {"count": 2, "tags": [], "bug_id": 54591, "text": "Hm, looks like I was able to upload the attachment but my comments were lost.\n\nAnyway, I was unable to re-create the problem. Currently, I am running under Windows 7, 64 bit Home Premium and the class I wrote was compiled and run against version 1.6.0_33 of Sun's (Oracle's) Java implementation and version 3.9 of POI. I did not use the exact code you posted - forgot to save the code to my PC - but wrote my own class to perform the test:\n\nimport java.io.*;\nimport org.apache.poi.hssf.usermodel.*;\n\n/**\n *\n * @author Mark Beardsley\n */\npublic class OpenError {\n    \n    public OpenError(String filename) throws IOException {\n        HSSFWorkbook workbook = null;\n        HSSFSheet sheet = null;\n        FileOutputStream fos = null;\n        \n        try {\n            workbook = new HSSFWorkbook();\n            sheet = workbook.createSheet(\"In Error.\");\n            \n            fos = new FileOutputStream(filename);\n            workbook.write(fos);\n        }\n        finally {\n            if(fos != null) {\n                fos.close();\n            }\n        }\n        \n    }\n}\n\nThe only difference between the two being that I did not flush the output stream but I cannot imagine that will make a profound difference. Some time ago, I do remember problems with building the api with version 1.7 of Java but know that Yegor planned to address this and am fairly certain that he has.\n\nCould you try to open the attached Excel workbook using your version of Excel and see what happens please? It may well be that it is the version of Excel you are using which is important rather than the operating system.", "id": 165435, "time": "2013-02-22T11:59:07Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2013-02-22T11:59:07Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 54591, "is_private": false, "text": "needinfo based on previous comment", "id": 167514, "time": "2013-05-30T16:16:17Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2013-05-30T16:16:17Z", "attachment_id": null}, {"count": 4, "tags": [], "creator": "eric.pias@frevvo.com", "is_private": false, "id": 167517, "attachment_id": null, "bug_id": 54591, "creation_time": "2013-05-30T18:06:19Z", "time": "2013-05-30T18:06:19Z", "text": "This issue was definitely seen in our testing.  Unfortunately, we are currently unable to replicate this issue anymore after much trying.  There are a number of different factors involved that make it difficult.  I hate to see anyone burning cycles on this, so I will attempt to close/resolve it."}]