[{"count": 0, "tags": [], "creator": "pmcgover@gfs.com", "attachment_id": null, "is_private": false, "id": 165440, "time": "2013-02-22T16:46:01Z", "bug_id": 54600, "creation_time": "2013-02-22T16:46:01Z", "text": "Description: \nThe client JMeter Run options, \"Remote Start\" and \"Remote Start All\" will start a jmeter test run on a running remote JMeter grid node(s).  However, the \"Remote Exit\" and \"Remote Exit All\" options will kill the test run *AND* the grid node process(es).  Why would the JMeter client allow users to shutdown the grid server nodes?\n\nInitial setup: \n1. Install JMeter server on 2 machines (nodes) (version 2.9) on Windows or Linux servers.\n2. Install JMeter client on a users (testers) machine (version 2.9).\n3. Configure the client to run a simple jmeter test against the server nodes.\n4. Verify that the Jmeter grid nodes are running (ps -ef|grep -w jmeter) and watch the logs (tail -f jmeter-server.log).\n\nSteps to Reproduce: \n1. With the client GUI, load a simple jmeter test and use the command: run->Remote Start All. \n2. After the test completes, with the client GUI do the command:  run->Remote Exit All. \n3. Verify that the Jmeter grid nodes are still running (ps -ef|grep -w jmeter).\n\nActual Results:\nThe remote grid node JMeter process(es) was killed.\n\nExpected Results:\nWhen a client user selects \"Remote Exit All\", it should kill the test run on the remote server, but *NOT* the server process(es) under any circumstances. \n\nNote:\n- This behavior also exists on 2.3.4\n- The Run options, \"Remote Start\" will NOT restart a remote server."}, {"count": 1, "tags": [], "text": "Bugzilla is not a support forum; please use the JMeter user list.\n\nRemote Exit is performing as intended; perhaps you meant remote stop?", "is_private": false, "bug_id": 54600, "id": 165441, "time": "2013-02-22T17:05:56Z", "creator": "sebb@apache.org", "creation_time": "2013-02-22T17:05:56Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "pmcgover@gfs.com", "attachment_id": null, "id": 165447, "time": "2013-02-22T17:58:04Z", "bug_id": 54600, "creation_time": "2013-02-22T17:58:04Z", "is_private": false, "text": "The real problem is that when the remote server is down, the \"Remote Start\" option won't start then node (or the test)."}]