[{"text": "Created attachment 30000\nThe actual filter\n\nThe specification for HTTP Strict Transport Security (HSTS) has now been published (RFC 6797). Tomcat should include a filter implementing the specification to make it easy to add to web applications.\n\nI have attached an implementation suggestion.", "tags": [], "bug_id": 54618, "is_private": false, "count": 0, "id": 165530, "time": "2013-02-28T12:24:54Z", "creator": "jens.borgland@gmail.com", "creation_time": "2013-02-28T12:24:54Z", "attachment_id": 30000}, {"id": 165531, "tags": [], "bug_id": 54618, "attachment_id": 30001, "count": 1, "text": "Created attachment 30001\nA test", "time": "2013-02-28T12:25:28Z", "creator": "jens.borgland@gmail.com", "creation_time": "2013-02-28T12:25:28Z", "is_private": false}, {"id": 165532, "tags": [], "bug_id": 54618, "is_private": false, "count": 2, "text": "Created attachment 30002\nNew error message property", "time": "2013-02-28T12:25:57Z", "creator": "jens.borgland@gmail.com", "creation_time": "2013-02-28T12:25:57Z", "attachment_id": 30002}, {"count": 3, "attachment_id": 30003, "bug_id": 54618, "text": "Created attachment 30003\nProposed implementation as unified diff", "id": 165533, "time": "2013-02-28T12:47:40Z", "creator": "jens.borgland@gmail.com", "creation_time": "2013-02-28T12:47:40Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 165547, "time": "2013-02-28T14:37:22Z", "bug_id": 54618, "creation_time": "2013-02-28T14:37:22Z", "text": "HSTS has a fairly major hole: the bootstrap MITM problem. There are suggested solutions but the current pre-loaded lists contain a very small number of sites. Further, the practicalities of trying to build a reasonable pre-loaded list mean that a pre-loaded list is very unlikely to resolve the bootstrap MITM problem.\n\nPersonally, I not convinced of the usefulness of this feature at this point in time."}, {"count": 5, "tags": [], "bug_id": 54618, "text": "I agree that the bootstrapping is a problem (and it's recognized in the RFC as well) but I still think that HSTS helps reduce the attack window quite drastically and therefore has significant benefits.\n\nTomcat is also often used for more or less internal applications within organizations where a pre-loaded list (perhaps configured using a group policy) may very well be a viable solution.", "id": 165548, "time": "2013-02-28T15:18:28Z", "creator": "jens.borgland@gmail.com", "creation_time": "2013-02-28T15:18:28Z", "is_private": false, "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 54618, "text": "Is there a reason to implement this at the container level? Since it's a Filter, it can be installed directly into the web application. I think this protection is better done at the application level and not at the container. Perhaps your code could be put into the wiki for anyone who wants to use it.", "id": 165585, "time": "2013-03-02T18:14:44Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-03-02T18:14:44Z", "tags": [], "is_private": false}, {"count": 7, "attachment_id": null, "bug_id": 54618, "text": "My thought was to make it easy for both developers and, more importantly, admins to enable HSTS without having to write or compile code. The actual implementation itself is quite trivial but I think that having the functionality available out of the box adds significant value (just like the CSRF Prevention and Expires filter for example).\n\nHSTS is also done per host so using the filter for all applications in a container makes sense to me.\n\nAnother option could be to create a more general filter or similar that simply adds one or more configured headers (possibly based on some condition) - like mod_headers for Apache.", "id": 165619, "time": "2013-03-03T17:43:53Z", "creator": "jens.borgland@gmail.com", "creation_time": "2013-03-03T17:43:53Z", "tags": [], "is_private": false}, {"count": 8, "tags": [], "creator": "steve@sether.org", "attachment_id": null, "text": "I think this is an important feature for Tomcat to support out of the box. \n\nFurthermore though, headers like this should be insanely easy to just add to all the headers of a domain hosted on a machine.  Apache solves this very easily with a single configuration line:\n\nHeader add Strict-Transport-Security \"max-age=15768000\"\n\nSo this is incredibly trivial to do in Apache since adding headers is very, very easy.  It's far harder to do this on Tomcat since it requires code modifications.  Why can't Tomcat have a similar feature?\n\nIMO the solution should be broader than just this one header, and should be a simple config option that an admin can add or subtract rather than having to implement this on every web application.\n\nI think it's vitally important that the admin should be able to control this, since the security feature it implements crosses multiple applications on a server, not just one.  That's something a good administrator can implement quickly, and would be far harder and more error prone to add at the application level.", "id": 175688, "time": "2014-06-05T21:08:15Z", "bug_id": 54618, "creation_time": "2014-06-05T21:08:15Z", "is_private": false}, {"count": 9, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "is_private": false, "id": 175701, "time": "2014-06-06T14:44:21Z", "bug_id": 54618, "creation_time": "2014-06-06T14:44:21Z", "text": "(In reply to Steve Sether from comment #8)\n> I think this is an important feature for Tomcat to support out of the box. \n\nThen vote for it: there are currently 5 votes from a single person for this issue. More votes = more attention.\n\n> So this is incredibly trivial to do in Apache since adding headers is very,\n> very easy.  It's far harder to do this on Tomcat since it requires code\n> modifications.  Why can't Tomcat have a similar feature?\n\nAdding a Filter (assuming it's already been written/compiled) only requires configuration, just like Apache httpd. If you don't have mod_headers, it \"requires a code change\" just as this does.\n\nThe Filter is attached to this issue. Feel free to download it and use it. It just hasn't made it into Tomcat's distribution yet.\n\n> IMO the solution should be broader than just this one header, and should be\n> a simple config option that an admin can add or subtract rather than having\n> to implement this on every web application.\n\nThe Filter can be added to conf/web.xml and will apply to all web applications hosted by the container. I'm not sure in what order it will be applied, though. My wild guess without trying is that everything in conf/web.xml will be applied first, then all the filters defined in the application's WEB-INF/web.xml.\n\n> I think it's vitally important that the admin should be able to control\n> this, since the security feature it implements crosses multiple applications\n> on a server, not just one.  That's something a good administrator can\n> implement quickly, and would be far harder and more error prone to add at\n> the application level.\n\nAdmins have the ability to modify conf/web.xml."}, {"count": 10, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "text": "I think there is a bug in the Filter implementation provided by Jens:\n\nThe filter calls chain.doFilter() and then adds the header afterward. This isn't going to work for any request that generates output that exceeds the buffer size, or that explicitly calls getOutputStream().flush (or getWriter().flush).\n\nIs anyone using this Filter implementation anywhere, or was it a proof-of-concept?", "id": 175702, "time": "2014-06-06T14:46:31Z", "bug_id": 54618, "creation_time": "2014-06-06T14:46:31Z", "is_private": false}, {"count": 11, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "id": 175703, "time": "2014-06-06T14:57:58Z", "bug_id": 54618, "creation_time": "2014-06-06T14:57:58Z", "is_private": false, "text": "(In reply to Christopher Schultz from comment #9)\n> \n> The Filter can be added to conf/web.xml and will apply to all web\n> applications hosted by the container. I'm not sure in what order it will be\n> applied, though. My wild guess without trying is that everything in\n> conf/web.xml will be applied first, then all the filters defined in the\n> application's WEB-INF/web.xml.\n\nTo clarify: the order is the opposite in Tomcat 7 onwards. The WEB-IND/web.xml filters are first, the ones in conf/web.xml are second. This is documented in Migration Guide.\n\nhttp://tomcat.apache.org/migration-7.html#Processing_of_conf/web.xml_file"}, {"count": 12, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "(In reply to Steve Sether from comment #8)\n> \n> Furthermore though, headers like this should be insanely easy to just add to\n> all the headers of a domain hosted on a machine.  Apache solves this very\n> easily with a single configuration line:\n> \n> Header add Strict-Transport-Security \"max-age=15768000\"\n\nIf it is that simple, maybe just use the well-known UrlRewriteFilter, as linked here:\nhttp://wiki.apache.org/tomcat/AddOns#UrlRewrite\n\nA <set type=\"response-header\" /> rule will set a response header.", "id": 175704, "time": "2014-06-06T15:02:17Z", "bug_id": 54618, "creation_time": "2014-06-06T15:02:17Z", "is_private": false}, {"id": 175725, "tags": [], "bug_id": 54618, "is_private": false, "count": 13, "text": "The filter I wrote was intended as a suggestion, I haven't used this actual implementation anywhere. I agree that the header should be set before calling chain.doFilter() so if the filter is to be included in Tomcat (or used anywhere else) the order needs to be reversed.\n\nSomething like the UrlRewriteHeader or a filter providing somehting similar to mod_headers could of course be used as well. One benefit of having a more specific filter like the one I provided would be that it makes it easier for an administrator to avoid spelling or syntactic errors.", "time": "2014-06-07T07:31:50Z", "creator": "jens.borgland@gmail.com", "creation_time": "2014-06-07T07:31:50Z", "attachment_id": null}, {"count": 14, "attachment_id": null, "bug_id": 54618, "text": "I agree that this is something that should be able to be implemented without having to edit application code, particularly if it prevents the issues regarding ordering that Konstantin Kolinko mentioned", "id": 176637, "time": "2014-07-24T08:17:40Z", "creator": "mdedetrich@gmail.com", "creation_time": "2014-07-24T08:17:40Z", "tags": [], "is_private": false}, {"count": 15, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 182892, "time": "2015-05-08T12:33:17Z", "bug_id": 54618, "creation_time": "2015-05-08T12:33:17Z", "text": "I've just added an HTTP header security filter that adds the HSTS header by default for 9.0.x. I plan to expand the set of headers this filter adds/"}, {"count": 16, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 183009, "time": "2015-05-18T11:37:45Z", "bug_id": 54618, "creation_time": "2015-05-18T11:37:45Z", "is_private": false, "text": "Added to 8.0.x for 8.0.23 onwards and 7.0.x for 7.0.63 onwards."}, {"count": 17, "attachment_id": null, "bug_id": 54618, "is_private": false, "id": 190795, "time": "2016-05-10T00:43:27Z", "creator": "ilatypov@infradead.org", "creation_time": "2016-05-10T00:43:27Z", "tags": [], "text": "A web application using Spring hijacked the global filter configuration (did not add the header)."}, {"count": 18, "attachment_id": null, "bug_id": 54618, "is_private": false, "id": 196386, "time": "2017-01-25T07:26:41Z", "creator": "hauser@acm.org", "creation_time": "2017-01-25T07:26:41Z", "tags": [], "text": "Interesting client side discussions in \nhttps://bugzilla.mozilla.org/show_bug.cgi?id=572803#c10"}, {"count": 19, "tags": [], "creator": "hauser@acm.org", "attachment_id": null, "text": "add a \"preload\" init-param as per https://hstspreload.org/\n\nand https://bugzilla.mozilla.org/show_bug.cgi?id=1334764", "id": 197062, "time": "2017-02-16T11:11:33Z", "bug_id": 54618, "creation_time": "2017-02-16T11:11:33Z", "is_private": false}, {"count": 20, "attachment_id": null, "bug_id": 54618, "is_private": false, "id": 197584, "time": "2017-03-10T14:04:42Z", "creator": "markt@apache.org", "creation_time": "2017-03-10T14:04:42Z", "tags": [], "text": "Support for preload has been added (hstsPreload init param on Filter)\nFixed in:\n- trunk for 9.0.0.M19 onwards\n- 8.5.x for 8.5.13 onwards\n- 8.0.x for 8.0.43 onwards\n- 7.0.x for 7.0.77 onwards"}]