[{"count": 0, "attachment_id": 30005, "creator": "tm@del.bg", "is_private": false, "id": 165546, "time": "2013-02-28T14:33:14Z", "bug_id": 54622, "creation_time": "2013-02-28T14:33:14Z", "tags": [], "text": "Created attachment 30005\nLet apachectl cleanup stale shm and pid files\n\nIf httpd dies for some reason (see bellow) it leaves shared memory segments behind, and won't start until shm is cleaned up manually.\n\nOne of the reasons for unclean shutdown might be bug in the apache itself (or some module like mod_php etc.).\n\nAnother reason might be Linux oom killer.\n\nYet another reason might be: shared hosting environment, heavy server load (maybe incoming DoS), you want to restart apache — execute httpd -k stop, wait several seconds or even a minute, finally give up and kill -9.\n\nThe error mod_auth_digest spits is:\n\n[Sun Feb 17 04:28:02.765535 2013] [auth_digest:error] [pid 17934] (17)File exists: AH01762: Failed to create shared memory segment on file /apache/logs/authdigest_shm.17934\n[Sun Feb 17 04:28:02.765580 2013] [auth_digest:error] [pid 17934] (17)File exists: AH01760: failed to initialize shm - all nonce-count checking, one-time nonces, and MD5-sess algorithm disabled\n[Sun Feb 17 04:28:02.765588 2013] [:emerg] [pid 17934] AH00020: Configuration Failed, exiting\n\nMy solutions for now is patched apachectl (see attached patch).\n\nOur best case scenario is if apache could improve on this, so we don't have to do it ourselves.\n\nIf that cannot be done, at least changing owner of shm segments to apache, so that we could more easily / safely select them for cleanup.\n\n\nRelated issues:\n * https://issues.apache.org/bugzilla/show_bug.cgi?id=7838 (Apache leaves shared memory segments and dies after unclean shutdown)\n * https://issues.apache.org/bugzilla/show_bug.cgi?id=16056 (Shared memory & mutex ownership not correctly established for SysV mutexes)\n\n\nBest regards,\nTeodor"}, {"count": 1, "tags": [], "bug_id": 54622, "attachment_id": null, "id": 196856, "creation_time": "2017-02-08T14:11:44Z", "time": "2017-02-08T14:11:44Z", "creator": "jorton@redhat.com", "text": "Fixed in r1782175 for 2.4.x.", "is_private": false}]