[{"count": 0, "tags": [], "bug_id": 54665, "is_private": false, "id": 165743, "attachment_id": null, "creator": "giovanni.dalloglio@addvalue.it", "creation_time": "2013-03-11T11:22:08Z", "time": "2013-03-11T11:22:08Z", "text": "At the moment, the URL resource is not provided via JNDI.\n\nThis is very useful while installing your application in different environments (test / integration / live).\n\nOf course, you can write an ObjectFactory, but this requires a \"not standard\" installation of tomcat.\n\nPlease, view a use-case and a possible solution here: http://codelevain.wordpress.com/2010/12/18/url-as-jndi-resource/\n\n\nThanks in advance.\n\nG.D."}, {"count": 1, "tags": [], "text": "The primary reason for rejecting this enhancement request is that it is unnecessary. Simply use an environment entry of type String [1] and use that to construct a URL if you really need a URL. That has the added advantage of being more likely to be portable between servlet containers.\n\nA secondary issue is that there is no clear license for the referenced code and no indication that the author is willing to submit it to the ASF.\n\n\n[1] http://tomcat.apache.org/tomcat-7.0-doc/config/globalresources.html#Environment_Entries", "is_private": false, "id": 165843, "creator": "markt@apache.org", "time": "2013-03-14T16:06:35Z", "bug_id": 54665, "creation_time": "2013-03-14T16:06:35Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 54665, "text": "I'm sorry for this decision.\n\nAn other reason (that I not mentioned before) is the cross-platform portability: we'd like to develop our software in a \"minimalistic\" way, developed and tested with Tomcat, but installable and usable also in other application servers (we can't force our customers to adopt the Tomcat, as you understand...).\n\nAs far as I know, the URL is managed by everybody else...\nWe'll try with the other containers. But honestly I hope that you rethink this decision...\n\n\nFor the second issue (licensing), I can re-write the class, or you can see the (probably better) org.ow2.easybeans.naming.url.URLFactory of library easybeans-naming (that is LGPL)", "id": 165855, "time": "2013-03-15T09:33:19Z", "creator": "giovanni.dalloglio@addvalue.it", "creation_time": "2013-03-15T09:33:19Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 54665, "text": "I'm not sure why String -> URL wouldn't be cross-platform.\n\nWRT licenses, LGPL is incompatible with AL2, so you'd have to get the author to grant the code to the ASF under a different license.", "count": 3, "id": 166061, "time": "2013-03-21T01:48:25Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-03-21T01:48:25Z", "is_private": false}]