[{"count": 0, "text": "Created attachment 30081\nPatch that doesn't work #1\n\nMore information in http://tomcat.markmail.org/thread/wsvablpkzagyrg6g.\n\nSpec change discussed here: http://java.net/projects/servlet-spec/lists/jsr340-experts/archive/2012-11/message/9\n\nAs discussed in Servlet spec mailing list, Shing's idea was:\n\n<quote>\nAnd we will require that the class passed in has a no ops constructor. In this case, the user can configure the HttpUpgradeHandler instance before upgrade processing and will be benefited by dependency injection.\n</quote>\n\nIn the Proposed Final Draft of the spec, this was further defined:\n\n<quote>\nWhen an upgrade request is received, the servlet can invoke the HttpServletRequest.upgrade method, which starts the upgrade process. This method instantiates the given HttpUpgradeHandler class. The returned HttpUpgradeHandler instance may be further customized. The application prepares and sends an appropriate response to the client. After exiting the service method of the servlet, the servlet container completes the processing of all filters and marks the connection to be handled by the HttpUpgradeHandler. It then calls the HttpUpgradeHandler's init method, passing a WebConnection to allow the protocol handler access to the data streams.\n</quote>\n\nThere are some fundamental problems here, and this may need to be escalated to the spec level (in my opinion, this change was a significant DISimprovement of the spec):\n\n1) In Tomcat, specifically, this change shakes the foundation of how WebSockets has been implemented. The HttpUpgradeHandler's init() method is supposed to be called AFTER the Servlet's service() method returns. But how? Who is supposed to call this? The constructor for AbstractProcessor is the only thing currently calling init(). I tried to dive into how to refactor that, and my eyes started bleeding. It goes deep into event dispatching in the Nio, Bio and Ajp processors. I don't see a clean way (I don't see ANY way) to change this. At the very least, someone with MUCH more Tomcat expertise than I will have to tackle that.\n\n2) The original purpose of the upgrade() method, supposedly, is to upgrade the request. But, according to the paragraph above, the only purpose of the upgrade() method now is to construct an instance of the class you pass into it and return that instance...as if you couldn't do that more easily by simply using the constructor. It sounds like the request doesn't ACTUALLY get upgraded until LATER.\n\nWhat it boils down to is that you need a fully-wired HttpUpgradeHandler in order to actually upgrade the request, so either init() cannot be called from upgrade() (in which case the upgrade() method is now pointless, IMO), or an already-wired instance of HttpUpgradeHandler (not a class) needs to be passed in to upgrade, like it was before.\n\nI took two approaches to this. The first (obvious) one was to create an doAfterUpgrade() method on WsUpgradeHandler to be called by WsServlet after it calls upgrade(). This method took the parameters originally passed to the constructor. Unfortunately, by the time execution got to the doAfterUpgrade() method, the socket was already trying to read/write data and it had no endpoint to do it to. NullPointerExceptions abounded (in o.a.coyote.http11.upgrade.AbstractProcessor#upgradeDispatch()). It compiles, but it doesn't upgrade. I've attached that patch.\n\nI then tried a trick to achieve wiring-before-instantiation using a local class, but Java was too smart for me. It replaced my no-arg constructor with an arg constructor, and it couldn't be instantiated. I'll attach that patch in a comment to follow this up.", "bug_id": 54728, "is_private": false, "id": 166021, "time": "2013-03-20T00:11:19Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-03-20T00:11:19Z", "tags": [], "attachment_id": 30081}, {"count": 1, "text": "Created attachment 30082\nPatch that doesn't work #2", "bug_id": 54728, "attachment_id": 30082, "id": 166022, "time": "2013-03-20T00:12:02Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-03-20T00:12:02Z", "tags": [], "is_private": false}, {"count": 2, "text": "This has been fixed in trunk.\n\nYour first patch isn't far off. I dropped o.a.catalina.websocket as the old implementation needed to be dropped at some point and now was a good a time as any.\n\nThe other differences were:\n- leave init() as is\n- move most of the constructor to preInit() (similar to your doAfterUpgrade())\n- call preInit() from the Servlet immediately after calling HttpServletRequest.upgrade()\n\nThe actual upgrade is performed by the container once the Servlet.service() method exits. The upgrade() call doesn't trigger the upgrade it just tells the container which object is to handler the connection once the current HTTP request completes.", "bug_id": 54728, "is_private": false, "id": 166028, "time": "2013-03-20T10:02:17Z", "creator": "markt@apache.org", "creation_time": "2013-03-20T10:02:17Z", "tags": [], "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 54728, "is_private": false, "id": 166034, "creation_time": "2013-03-20T15:48:32Z", "time": "2013-03-20T15:48:32Z", "creator": "nicholas@nicholaswilliams.net", "text": "Okay, I see where my mistake was. Wow. *rubs eyes*\n\nI think I need to go back to bed. Lol.\n\nThanks.", "attachment_id": null}]