[{"count": 0, "tags": [], "bug_id": 54722, "attachment_id": 30077, "id": 165978, "time": "2013-03-18T22:28:12Z", "creator": "philip.persad@gmail.com", "creation_time": "2013-03-18T22:28:12Z", "is_private": false, "text": "Created attachment 30077\nContains text in table\n\nWhen calling PowerPointExtractor.getText on a .ppt file, all text contained within a table is not extracted.  I've created and attached a simple document that demonstrates the behaviour in question.\n\nUpgraded from 3.5 to 3.9.  I cannot guarantee that this issue did not exist in 3.5 as the version that I upgraded from was an internal branch with a mostly undocumented patch history.  I've assumed that the issue did not exist in the 3.5 POI release and hence have classified as regression bug."}, {"count": 1, "tags": [], "bug_id": 54722, "attachment_id": 30226, "text": "Created attachment 30226\nPatch for reading text from tables\n\nApparently, this is caused during the construction of PPDrawing objects, specifically, the portion where the textboxWrappers field is populated.\n\nThe first EscherContainerRecord of type 0xf003 (SpgrContainer) is found within the container of type 0xf002.  Then all containers of type 0xf004 are found within the SpgrContainer.  However, it is possible that the SpgrContainer might also have other containers of type 0xf003, which in turn contain 0xf004s which eventually contain text.  This is the case when a slide contains a table which contains text.\n\nI've written a patch which traverses an additional layer by looking for 0xf004s within 0xf003s within the SpgrContainer.  I was torn between specifically going one layer deeper and performing a recursive search.  While I suspect that the recursive search may be more correct, the former approach is safer (particularly as I'm not an expert on the data format).  Some feedback on which approach is preferable would be appreciated.", "id": 166862, "time": "2013-04-25T16:59:17Z", "creator": "philip.persad@gmail.com", "creation_time": "2013-04-25T16:59:17Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 54722, "attachment_id": null, "id": 166922, "time": "2013-04-28T23:53:51Z", "creator": "trejkaz@trypticon.org", "creation_time": "2013-04-28T23:53:51Z", "is_private": false, "text": "*** Bug 54736 has been marked as a duplicate of this bug. ***"}, {"count": 3, "tags": [], "bug_id": 54722, "attachment_id": null, "id": 170314, "time": "2013-09-27T15:46:58Z", "creator": "tallison@mitre.org", "creation_time": "2013-09-27T15:46:58Z", "is_private": false, "text": "Fixed r1526960.\n\nAdded attached file as test case.\n\nThank you!"}]