[{"count": 0, "tags": [], "bug_id": 54745, "attachment_id": 30097, "text": "Created attachment 30097\nPatch to resolve issue\n\nAs long as you correctly structure your JARs and call setParentClassLoader() with the current thread class loader on the Engine, Host, Server and Service, you can run Embedded Tomcat using Java Web Start. It's actually pretty neat.\n\nThe only problem is that JarScanning doesn't work. In Java Web Start, all JAR URLs obtained from the class loader are the full http(s) URLs from where they were downloaded. Java has them cached locally, so accessing them is just as efficient because they're really coming from the local file system. However, the StandardJarScanner ignores JAR URLs that don't start with \"file:\" or \"jndi:\".\n\nThis was an easy patch and everything else appears to still work normally. I propose that the patch be applied to trunk AND 7.0.", "id": 166108, "time": "2013-03-22T23:07:06Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-03-22T23:07:06Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 54745, "text": "I disagree with categorizing this as an enhancement. I believe this is a major bug. The facts are very simple: In an environment in which Tomcat otherwise runs without issue, JAR scanning incorrectly excludes some JARs that are validly on the classpath and that do not match the excluded JARs patterns, and it does so without any errors, warnings, infos, etc. I fail to see how this isn't a bug.\n\nSemantics aside, the patch is extraordinarily trivial. Does anyone see any downsides to it?", "id": 166345, "time": "2013-04-02T23:10:14Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-04-02T23:10:14Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 54745, "is_private": false, "count": 2, "id": 166475, "time": "2013-04-08T13:45:05Z", "creator": "markt@apache.org", "creation_time": "2013-04-08T13:45:05Z", "text": "Using Tomcat via web start is so far away from normal usage I view this as an enhancement.\n\nThe patch may be trivial but I think some time needs to be spent thinking about the security aspects of this change with respect to loading of JARs from remote locations. It may be a non-issue but it needs to be thought about first."}, {"count": 3, "tags": [], "bug_id": 54745, "text": "Having looked at this more closely, the JARs must already be on the class path so I don;t see any issues.\n\nThe patch has been applied to trunk and 7.0.x and will be included in 7.0.42 onwards.", "id": 167931, "time": "2013-06-20T15:11:00Z", "creator": "markt@apache.org", "creation_time": "2013-06-20T15:11:00Z", "is_private": false, "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 54745, "is_private": false, "id": 167933, "time": "2013-06-20T15:14:30Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-06-20T15:14:30Z", "tags": [], "text": "Excellent! Thanks!"}]