[{"count": 0, "tags": [], "text": "Created attachment 30101\nContains a patch for SXSSFWorkbook and SXSSFSheet to allow template sheet cells to be modified.\n\nThe attached patch allows SXSSFWorkbook users to transparantly access and modify rows and cells in a template workbook. Newly created rows are added through a sliding window as before. This means the following limitations as documented in SXSSFWorkbook are removed:\n\n     * Access initial cells and rows in the template. After constructing\n       SXSSFWorkbook(XSSFWorkbook) all internal windows are empty and\n       SXSSFSheet@getRow and SXSSFRow#getCell return null.\n\n     * Override existing cells and rows. The API silently allows\n       that but the output file is invalid and Excel cannot read it.\n\n\nWith this patch applied, SXSSF workbooks with existing cells that have been\nmodified can be opened in Excel 2007 and earlier without producing an error message like this:\n\n\"Excel found unreadable content in 'NewBook.xlsx'.\"\n\nI created this patch back in January but as of last week the affected files hadn't changed in the trunk. We've used this in production since then without any problems. There's no new test cases included with this patch. The existing tests pass (or passed, back in January).\n\nHere's a description of the modifications made by the patch.\n\nModified file: src/ooxml/java/org/apache/poi/xssf/streaming/SXSSFSheet.java\n\nModified methods:\n\nremoveRow\n  Removes the row from the template if it originated in the template worksheet.\n\ngetRow\n  Returns the row from the template if the row number exists in the template\nworksheet.\n\ngetPhysicalNumberOfRows\n  Includes the number of rows from the template in the total.\n\ngetFirstRowNum\n  Returns the number of the first row of the template if that number is lower\n  than the first row number of the sliding window (which should be the case\nunless the  template is empty).\n\ngetLastRowNum\n  Returns the number of the last row of the template unless the row number of\nthe last\n  row in the sliding window is higher.\n\nrowIterator\n  JavaDoc change only. This still only iterates over rows in the sliding window\nand not\n  over rows in the template.\n\ngroupRow\n  Also increases the group level of rows in the template, if applicable.\n\n\nModified file: src/ooxml/java/org/apache/poi/xssf/streaming/SXSSFWorkbook\n\nRemoved a JavaDoc segment that describes the limitation that has been removed\nby the patch to SXSSFSheet.\n\nThanks,\n   Omer van der Horst Jansen", "attachment_id": 30101, "bug_id": 54750, "id": 166138, "time": "2013-03-25T15:30:00Z", "creator": "omerhj@yahoo.com", "creation_time": "2013-03-25T15:30:00Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 54750, "attachment_id": null, "text": "Hi,\n\nWhen can this changes will be available in a POI stable version?\n\n\nThanks, \nRahul", "id": 180560, "time": "2015-01-26T11:29:08Z", "creator": "rahuljain4500@gmail.com", "creation_time": "2015-01-26T11:29:08Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 54750, "is_private": false, "id": 194260, "time": "2016-10-09T06:42:06Z", "creator": "onealj@apache.org", "creation_time": "2016-10-09T06:42:06Z", "tags": [], "text": "Ideally, additional functionality and bugfixes should be covered by unit tests to demonstrate that the new behavior is correct. This also reduces the chance of a regression in the future.\n\nIf someone is willing to rebase the patch to the trunk and write unit tests that cover the new functionality, I would be happy to review and commit these changes."}, {"count": 3, "tags": [], "creator": "loris.boiteux@fr.thalesgroup.com", "text": "Hi,\n\nI work for Thales Avionics and I'm using SXSSF Workbooks to manipulate very large sheets. This bug is really critical to me ;)\nCould we have any information about a new release coming and including this fix?\n\nCheers,\n\nLoris", "id": 198803, "time": "2017-05-16T12:14:18Z", "bug_id": 54750, "creation_time": "2017-05-16T12:14:18Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 54750, "attachment_id": null, "text": "POI is a volunteer project developed in people's spare time. If you have an interested or a pressing need for a particular bug, the quickest way to resolution is to develop a patch yourself and submit it.\n\nThe patch from comment 0 cannot be applied to the trunk as is. If you have time, rebase the patch, add appropriate unit tests, and test your changes against the unit test suite to make sure the changes don't break another part of POI.\n\nFor bugs that affect software projects at my day job, I sometimes as my manager if I can use company time to develop a fix. You might try this route if you don't want to sink your personal time into this.\n\nWe plan on releasing POI 3.17 beta 1 this summer and 3.17 final will likely be Q4 2017 or Q1 2018, depending on developers availability and volume of user contributions. YAs soon as a suitable patch for this bug is submitted and a developer has time to review the patch, the changes will be applied to trunk and included in the following release.", "id": 198810, "time": "2017-05-17T17:41:34Z", "creator": "onealj@apache.org", "creation_time": "2017-05-17T17:41:34Z", "is_private": false}]