[{"count": 0, "text": "Created attachment 30140\npcap with subversion 1.6 which works\n\nThis is a bug I posted on both the mod_wsgi as well on the Apache user mailing list:\n\nmod_wsgi:\n\nhttp://groups.google.com/group/modwsgi/browse_thread/thread/f7171b7442965c78#\n\nApache:\n\nhttp://thread.gmane.org/gmane.comp.apache.user/99368\n\nI repeat the issue here with updated versions of all components involved:\n\nI run trac and subversion in the same configuration and on the same vhost, see http://ktk.netlabs.org/misc/svn.netlabs.conf for my configuration.\n\nThe configuration starts with the SVN repositories residing on /repos and then configures trac with mod_wsgi. So far this used to work just fine for many years. As you can see on http://svn.netlabs.org I run a lot of TRAC repositories for several OSS projects.\n\nA few weeks ago I upgraded subversion on the server to version 1.7, since then I can still checkout and commit to svn repositories with clients which are below version 1.7 (I tested 1.6.x), everything works as expected. However, any subversion client >= 1.7 cannot _commit_ anymore, checkout works as before though.\n\nAfter dumping with tcpdump I could see the following packet (decoded TCP stream via wireshark, Subversion 1.7.x client):\n\n-- \nPOST /repos/sandbox/!svn/me HTTP/1.1\nUser-Agent: SVN/1.7.3 neon/0.29.6\nConnection: TE\nTE: trailers\nHost: svn.netlabs.org\nContent-Type: application/vnd.svn-skel\nDAV: http://subversion.tigris.org/xmlns/dav/svn/depth\nDAV: http://subversion.tigris.org/xmlns/dav/svn/mergeinfo\nDAV: http://subversion.tigris.org/xmlns/dav/svn/log-revprops\nContent-Length: 14\nAccept-Encoding: gzip\n\n( create-txn )HTTP/1.1 404 Not Found\nDate: Thu, 22 Mar 2012 20:38:39 GMT\nServer: Apache\nContent-Length: 21\nContent-Type: text/plain\n\nEnvironment not found\n-- \n\nfull decoded TCP stream: http://pastebin.com/4bAT2TMA\ntcpdump: http://ktk.netlabs.org/misc/subversion-commit_17.dmp\n\nThis \"Environment not found\" is definitely an error message from TRAC in case there is no trac environment found. So for some reason mod_wsgi hits in at this point instead of the DAV handler. Again, this works just fine with subversion 1.6.x (it does not do a POST there though):\n\nfull decoded TCP stream: http://pastebin.com/X9J3k7kE\ntcpdump: http://ktk.netlabs.org/misc/subversion-commit_16.dmp\n\nFrom the subversion changelog I can see that they changed the way subversion interacts with the server:\n\nhttp://subversion.apache.org/docs/release-notes/1.7.html#httpv2\n\n-- \nSubversion 1.7 offers a simpler HTTP protocol variant that can be used when connecting to supported servers. This simpler protocol (sometimes referred to as HTTPv2) requires fewer client-server round trips to establish a connection, making Subversion much more performant on high-latency network connections.\n\nAs mentioned in the compatibility table, Subversion 1.7 will only use HTTPv2 when connecting with a 1.7 (or greater) server, but will continue to use existing protocols when communicating with earlier versions of Subversion. Likewise, older clients will only use the old protocol when connecting to a Subversion server, regardless of version.\n-- \n\nSo the only explanation I have is that with 1.7 clients subversion tries to do HTTPv2 and for some reason mod_wsgi decides to take over even if it's not its job because the post goes to /repos, which should be the DAV handler. Note that I can \"fix\" the issue if I deactivate mod_wsgi or mod_fcgid with the current subversion configuration so the subversion module itself seems to work fine with new clients as well.\n\nI first suspected a bug in mod_wsgi, for that reason I changed the configuration to mod_fcgid. Unfortunately it behaves exactly like that so my next guess (with the limited understanding of Apache internals I have) would be a bug in the internal processing of Apache.\n\nSoftware versions (running on FreeBSD 9.1):\nap22-mod_wsgi-3.4 or ap22-mod_fcgid-2.3.6_1\napache22-2.2.24\npy27-subversion-1.7.8\nsubversion-1.7.8\ntrac-0.12.3\npython27-2.7.3_6\n\ncontent of trac-netlabs.wsgi (looks a bit different for mod_fcgid but as\nI said same bug):\n\n-- \n#!/usr/local/bin/python2.6\n# -*- coding: utf-8 -*-\nimport os\ndef application(environ, start_request):\n  os.environ['TRAC_ENV_PARENT_DIR'] = '/data/trac/netlabs.org'\n  os.environ['PYTHON_EGG_CACHE'] = '/tmp/egg-cache'\n  from trac.web.main import dispatch_request\n  environ['trac.locale'] = 'sv_SE.UTF-8'\n  return dispatch_request(environ, start_request)\n-- \n\nIf someone wants to try committing, there is a sandbox repository which is world read/writable at:\n\nhttp://svn.netlabs.org/repos/sandbox/\n\nI'm more than happy to run more tests if someone has some ideas, I ran out of them.\n\nthanks\n\nAdrian", "bug_id": 54794, "is_private": false, "id": 166351, "time": "2013-04-03T12:02:16Z", "creator": "ktk@netlabs.org", "creation_time": "2013-04-03T12:02:16Z", "tags": [], "attachment_id": 30140}, {"count": 1, "text": "Created attachment 30141\npcap with subversion 1.7 which fails", "bug_id": 54794, "is_private": false, "id": 166352, "time": "2013-04-03T12:02:42Z", "creator": "ktk@netlabs.org", "creation_time": "2013-04-03T12:02:42Z", "tags": [], "attachment_id": 30141}, {"count": 2, "tags": [], "creator": "rainer.jung@kippdata.de", "attachment_id": null, "is_private": false, "id": 166360, "time": "2013-04-03T17:19:55Z", "bug_id": 54794, "creation_time": "2013-04-03T17:19:55Z", "text": "Your configuration maps \"/\" via WSGIScriptAlias. This is documented in mod_wsgi to be problematic, because the result will depend on module load order.\n\nIs there a chance to install TRAC in a way, such that the svn repos (/repos) and TRAC do not overlap in URI space (e.g. using /trac)?\n\nRegards,\n\nRainer"}, {"attachment_id": null, "tags": [], "creator": "ktk@netlabs.org", "is_private": false, "count": 3, "id": 166361, "time": "2013-04-03T17:28:39Z", "bug_id": 54794, "creation_time": "2013-04-03T17:28:39Z", "text": "Hi Rainer,\n\nAh I see what you mean with module order. Yeah I could do something like that, I thought about moving TRAC to trac.netlabs.org and using svn.netlabs.org uniquely for SVN repos. With a rewrite rule I could rewrite the old URIs to the new one.\n\nBut thought I will report first, is there a chance this gets solved or is this hard to fix? In this case I would propose to close the issue then."}, {"count": 4, "tags": [], "bug_id": 54794, "attachment_id": null, "id": 166362, "time": "2013-04-03T18:34:45Z", "creator": "ktk@netlabs.org", "creation_time": "2013-04-03T18:34:45Z", "is_private": false, "text": "One argument against module loading order issues is the fact that it works with 1.6 in this configuration."}]