[{"count": 0, "tags": [], "bug_id": 54808, "attachment_id": 30159, "text": "Created attachment 30159\nPatch to add number of versions attribute\n\nSample patch (still somewhat rough, no translations yet) to add the ability to keep a certain number of prior versions.\n\nThis also adds a bit more logging of when undeployOldVersions is true and what's going on.", "id": 166422, "time": "2013-04-05T19:08:02Z", "creator": "mcintoshj@gmail.com", "creation_time": "2013-04-05T19:08:02Z", "is_private": false}, {"attachment_id": 30198, "tags": [], "bug_id": 54808, "is_private": false, "count": 1, "id": 166636, "time": "2013-04-15T22:04:59Z", "creator": "mcintoshj@gmail.com", "creation_time": "2013-04-15T22:04:59Z", "text": "Created attachment 30198\nUpdated patch with a few fixes, cleaned up tabs\n\nSome more cleanup to remove tabs and instead use whitespace, added JMX references."}, {"count": 2, "tags": [], "bug_id": 54808, "attachment_id": null, "text": "I'm not convinced of the usefulness of this feature.\n\nThe stated purpose is fall-back. Consider an application on version 1 and version 2 is deployed. If a system admin wants the ability to fall-back to version 1 if problems are noticed with version 2:\n- With this option implemented, falling back would require deleting version 2 which will break the session for every user currently using version 2. That may not be the desired behaviour.\n- Once version 2 is considered stable version 1 would need to be manually removed. This makes the undeployOldVersions feature unnecessary which in turn makes this feature unnecessary.\n\nUsers wanting the ability to fall-back to version 1 after version 2 has been deployed would be better following a different process:\n- leave undeployOldVersions=\"true\"\n- deploy version 2\n- if fall back is required\n  - deploy a copy of version 1 labelled as version 3\n  - delete version 2 if it is necessary to force users of version 2\n\nI'd be happy to commit this new feature if there is a use case that cannot easily be met by the current features but fallback does not appear to be it.", "id": 167301, "time": "2013-05-20T09:10:52Z", "creator": "markt@apache.org", "creation_time": "2013-05-20T09:10:52Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 54808, "attachment_id": null, "text": "It has been a month without any further feedback so I am resolving this as WONTFIX.", "id": 167932, "time": "2013-06-20T15:12:35Z", "creator": "markt@apache.org", "creation_time": "2013-06-20T15:12:35Z", "is_private": false}]