[{"count": 0, "tags": [], "creator": "knst.kolinko@gmail.com", "text": "Steps to reproduce - see bug 54801\n\nIt causes an exception to be thrown by\norg.apache.jasper.compiler.JspDocumentParser.checkScriptingBody()\n\nThe issue is that the exception in bug 54801 does not provide any information on the file where it occurred. It does not show in which tag file it happened, and thus it is hard to follow.\n\nThere are four places in JspDocumentParser where it throws a \"SAXException\" without any location information.  I propose to replace\n\n  throw new SAXException(msg);\n\nwith\n\n  throw new SAXParseException(msg, locator);\n\nI am not sure that line numbers will be correct in all four cases, but at least it will provide the name of the file. This is better than nothing.", "id": 166399, "time": "2013-04-04T22:41:48Z", "bug_id": 54802, "creation_time": "2013-04-04T22:41:48Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": 30154, "id": 166400, "time": "2013-04-04T22:52:38Z", "bug_id": 54802, "creation_time": "2013-04-04T22:52:38Z", "is_private": false, "text": "Created attachment 30154\nText of Error page shown for bug 54801 by current trunk\n\nText of error page. The tag file name is nowhere to be found.\n\nIn the \"localhost.date.log\" file only the inner org.xml.sax.SAXException is printed. The outer ones are shown by the error page only."}, {"count": 2, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": 30155, "id": 166401, "time": "2013-04-04T23:16:28Z", "bug_id": 54802, "creation_time": "2013-04-04T23:16:28Z", "is_private": false, "text": "Created attachment 30155\nText of Error page shown for bug 54801 by trunk with r1464781\n\nFixed in trunk by r1464781\n\nHere is what is now displayed by the error page. The \"localhost.date.log\" contains the same JasperException as shown by error page.\n\nThe good point is that the message includes the file name, as desired.\n\nThe bad point is that the original SAXParseException and its stack trace are not displayed and are not logged. The \"JspDocumentParser.checkScriptingBody()\" method where the original exception were thrown is not mentioned."}, {"count": 3, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": 30157, "id": 166415, "time": "2013-04-05T15:10:56Z", "bug_id": 54802, "creation_time": "2013-04-05T15:10:56Z", "is_private": false, "text": "Created attachment 30157\n2013-04-05_tc8_54802_1.patch\n\nA patch that improves information shown by error page and logged.\n\n> but at least it will provide the name of the file\n\nFirst, the above assumption is actually incorrect. A locator does not provide the file name. It knows line and column numbers only  (and systemId, publicId of the resource).\n\nThe name was provided by  catch(SAXParseException) clause  at\nJspDocumentParser.parse(JspDocumentParser.java:205)\n\nStill, I would say that line numbers are useful.\n\n\nSecond, the original exception was lost in the same place (JspDocumentParser.java:205). It is easy to fix by adding a new method to jasper.compiler.DefaultErrorHandler. See the patch.\n\nThird, the logging is done in StandardWrapper.invoke(). It logged only the innermost exception in ex.getCause() chain. I am saying that it is wrong as\n 1. A usual rule is that outer exceptions provide additional contextual information.\n 2. The error page shows the full exception chain. Omitting it in the log message is inconsistent and leaves administrator without a clue.\n\n\nThough one of my assumptions was wrong, as I mention above, I plan to leave r1464781 as is and go on with changes outlined in this patch."}, {"count": 4, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": 30158, "id": 166416, "time": "2013-04-05T15:14:10Z", "bug_id": 54802, "creation_time": "2013-04-05T15:14:10Z", "is_private": false, "text": "Created attachment 30158\nText of Error page shown for bug 54801 by trunk with r1464781 + patch"}, {"count": 5, "tags": [], "bug_id": 54802, "attachment_id": null, "text": "Jasper part of this is fixed in 7.0.x by r1466122 and will be in 7.0.40.\n\n\n> Third, the logging is done in StandardWrapper.invoke(). It logs only the\n> innermost exception in ex.getCause() chain. I am saying that it is wrong as\n>  1. A usual rule is that outer exceptions provide additional contextual\n> information.\n>  2. The error page shows the full exception chain. Omitting it in the log\n> message is inconsistent and leaves administrator without a clue.\n\n\nThe StandardWrapper part of this has not been resolved yet.", "id": 166492, "time": "2013-04-09T16:58:12Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2013-04-09T16:58:12Z", "is_private": false}]