[{"count": 0, "tags": [], "creator": "a.augustin@ceyoniq.com", "attachment_id": null, "id": 8989, "time": "2001-12-18T04:20:37Z", "bug_id": 5483, "creation_time": "2001-12-18T04:20:37Z", "is_private": false, "text": "Overview Description:\nI18N of web app based on ACCEPT_LANGUAGE header fails with AJP 1.3 and Tomcat \n4.01 final / Apache 1.3.22. ACCEPT_LANGUAGE value is *ignored* instead the \ndefault location of the Java runtime Tomcat is running in seems to be used \nresulting in the deliverance of always the same language regardless of the \nbrowser´s HTTP request.\n\nSteps to reproduce:\nJust create a minimal web app consisting of one JSP which *prints* the language \nsettings. Regardless of the HTTP request it seems to be always the Java runtime \ndefault setting.\n\nActual results:\nWeb app always delivers its contents in the same language regardless of the \nrequested language and the available language resources.\n\nExpected result:\nWeb app should deliver its content in the requested language falling back to \nits default language if no suitable language resources were found.\n\nBuild date & platform:\nTomcat 4.01 final / AJP 1.3 / Apache 1.3.22 running on NT 4 SP 6\nIE 4.0 to IE 6 with latest respective SPs and NN 4.78, NN 6.01 and NN 6.02 as \nbrowser platforms.\n\nAdditional information:\nWe *cross-tested* the mentioned minimal web app with all mentioned browsers \n(vendors and versions) and the described behaviour was ALWAYS reproducible."}, {"count": 1, "text": "Quoting Costin:\n\nThere are 2 issues:\n- extracting the language from the Accept-Language: header.\nThat should be implemented in tomcat ( and the servlet container ) -\nas with the charset detection, that's at a higher level than the\nconnector.\n\n- serving the 'right' page based on the accept-language header.\nI believe there is a patch for 3.x, not sure if it was ever ported.\nIn the context of Apache+tomcat, all static files will support\nthe language header, using the apache convention and settings.\nI'm not sure this is the same as the standalone impl ( apache\nis based on extensions, index.html.en, while in 3.x it's based\non dirs en/index.html - but I haven't checked ).\nRegadless of what's happening for static pages, there is no\nrule defined for jsps AFAIK, the jsp itself should use one of the\nexisting taglibs or whatever to get the right language.\n\nA workaround - for jsps - is to use the header directly. For static\nfiles apache should deal with that without problems.\n\nA bigger problem, which is not easy to fix in jk1.x, is charset\ndetection and setting, especially for the jni connector. That's going\nto improve a lot in jk2 and o.a.jk, almost the same code used\nfor 3.3 will be used there too.\n\nI would mark this bug as LATER for now.\n", "creator": "remm@apache.org", "is_private": false, "id": 10067, "time": "2002-01-30T10:17:51Z", "bug_id": 5483, "creation_time": "2002-01-30T10:17:51Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 5483, "is_private": false, "count": 2, "id": 35228, "time": "2003-04-15T16:08:58Z", "creator": "remm@apache.org", "creation_time": "2003-04-15T16:08:58Z", "text": "JK 2 normalizes behavior between the HTTP/1.1 connector and the AJP connector, \nso this should no longer be an issue."}, {"count": 3, "tags": [], "creator": "medthomas@ntlworld.com", "text": "Clearing resolution so I can change this back to RESOLVED-FIXED.", "id": 45099, "time": "2003-10-05T18:00:41Z", "bug_id": 5483, "creation_time": "2003-10-05T18:00:41Z", "is_private": false, "attachment_id": null}]