[{"count": 0, "tags": [], "bug_id": 5486, "attachment_id": null, "id": 9002, "time": "2001-12-18T08:54:50Z", "creator": "sam.cooper@scisys.co.uk", "creation_time": "2001-12-18T08:54:50Z", "is_private": false, "text": "I'm not sure what is causing this problem, whether it is the Standard taglib implementation or a \nbug in Tomcat 4.0.1 but the taglib people pointed the finger this way ;-)\n\nBasically, I am \ntrying to use the new Standard taglib to perform XSL\ntransformations. What my pages do is use \nthe core:import tag to load an XSL from a local resource file and pass it to a \nxml:transform.\n\nThis works fine under IE 5.5 and Netscape but under Opera\n5 and 6 I get very \nstrange behaviour.\n\nThe first time I visit the page it works fine, but if I visit the page from \nanother page the import does not happen. The attribute in the page context has\nbeen created but \nit is empty.\n\nI have created a small web archive to demostrate this and have attached it. You \nwill need to put the EA3 jars in the WEB-INF lib directory before it works.\n\nTo get this strange \nbehaviour you have to vist the two pages using the links provided. After a couple of visits the \nimported text on the first page does not get displayed unless you do a refresh on that page.\n\nI \nhave also included a request/response dump from catalina which shows this\nprocedure first \ndone with IE and then using Opera. The only major difference that I can see is the if-modified-since \nfield.\n\nAfter further testing it seems it is definiately to do with the if-modified-since \nfield, something that Opera always provides once it has seen a page but IE does not seem to.\n\nI \nhave created a little Java program to do this, you will have to edit it to provide the correct \nURL!\n\nThanks.\nSam."}, {"count": 1, "tags": [], "bug_id": 5486, "attachment_id": 916, "id": 9003, "time": "2001-12-18T08:56:09Z", "creator": "sam.cooper@scisys.co.uk", "creation_time": "2001-12-18T08:56:09Z", "is_private": false, "text": "Created attachment 916\nRequest response debug output from Tomcat 4.0.1"}, {"count": 2, "tags": [], "bug_id": 5486, "attachment_id": 917, "id": 9004, "time": "2001-12-18T08:57:05Z", "creator": "sam.cooper@scisys.co.uk", "creation_time": "2001-12-18T08:57:05Z", "is_private": false, "text": "Created attachment 917\nExample web archive which shows problem"}, {"count": 3, "tags": [], "bug_id": 5486, "attachment_id": 918, "text": "Created attachment 918\nJava http request code that shows the same problem.", "id": 9005, "time": "2001-12-18T08:57:27Z", "creator": "sam.cooper@scisys.co.uk", "creation_time": "2001-12-18T08:57:27Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 5486, "attachment_id": null, "text": "After reading your bug report three times (and running the attached sample), I'm \nstill a little dense.  I can repeatedly run your test client program, and \nrepeatedly get exactly the same output data (with the line that says \"This \nshould be shown if working correctly\") against the latest code in the HEAD \nbranch of Tomcat 4 (i.e. what you'd get with nightly builds).\n\nIn particular, you did not state what is supposed to be different in the \nresponse, so it's not clear if I'm interpreting your report correctly.  \nTherefore, I'm going to close this with WORKSFORME.  Feel free to reopen this if \nyou can provide more info to help me understand what's going wrong from your \nperspective.\n\nYou will note that every response from Tomcat includes a \"Date\" header.  If \nyou've configured your browser to do so, it will use this date value in a \nsubsequent \"If-Modified-Since\" header for the same request URI.  The fact that \nthis seems to make a difference, and that the problem only happens to you in \nOpera, points to Opera's caching as a potential problem.\n\nYou could try configuring Netscape to send the If-Modified-Since header (it's \ncontrolled by the settings on the Advanced -> Cache page) and see if you can \nobserve the same results.\n", "id": 9064, "time": "2001-12-19T18:27:26Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-12-19T18:27:26Z", "is_private": false}, {"count": 5, "tags": [], "text": "I can't see how the bug can be in Opera as Opera can only cache what is \nreturned to it. So Opera will either display the cached copy or the new copy, \neither way it can't modify the output.\n\nI downloaded the latest nightly build (18th of Dec) to see if that made any \ndifference. It didn't.\n\nThe problem is that the line of text \"This should be shown if working \ncorrectly.\" is output by the import tag. Looking inside the tag library source \ncode it seems to do this by using a javax.servlet.RequestDispatcher.include \ncall to get the contents of the local resource.\n\nFurther tests seem to show that the time in the header field 'if-modified-\nsince' is what makes the difference. Using the java program I modified the time \nand ran the test several times changing the time passed in. One thing to note \nis that the string specified must be valid, specifying Tue the 20th of December \nis not correct so this field will then get ignored.\n\nIf the time is in the future, relative to the timestamp of the .java file in \nthe tomcat/work directory, then the line is missing.\nIf the time is in the past by more than approx 2000 seconds (strange I know) \nthen you get the imported line appearing correctly.\nIf the time is less than this 2000 seconds then you don't get the line.\n\nI don't know if this makes any more sense to you.\n\nSam.\n", "attachment_id": null, "id": 9082, "creator": "sam.cooper@scisys.co.uk", "time": "2001-12-20T04:14:29Z", "bug_id": 5486, "creation_time": "2001-12-20T04:14:29Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 5486, "attachment_id": null, "text": "Your problem looks similar to bug 5497. Although I'll fix it, it really is a \nbrowser problem, since the browser shouldn't submit the if-modified-since \nheader in that case (it never got a last-modified or an etag).", "id": 9085, "time": "2001-12-20T05:04:41Z", "creator": "remm@apache.org", "creation_time": "2001-12-20T05:04:41Z", "is_private": false}, {"count": 7, "text": "After checking the code of the webapp, I'm almost certain it's the same issue \nas in bug 5497, which should be fixed in the new Tomcat 4.0.2-b1.\n\n*** This bug has been marked as a duplicate of 5497 ***", "bug_id": 5486, "attachment_id": null, "id": 9104, "time": "2001-12-20T13:35:51Z", "creator": "remm@apache.org", "creation_time": "2001-12-20T13:35:51Z", "tags": [], "is_private": false}, {"count": 8, "tags": [], "creator": "sam.cooper@scisys.co.uk", "attachment_id": null, "id": 9112, "time": "2001-12-21T01:39:03Z", "bug_id": 5486, "creation_time": "2001-12-21T01:39:03Z", "is_private": false, "text": "I've tried this with Opera and it now works! I can now go back to using a decent browser ;-\n)\n\nThankyou.\n"}]