[{"count": 0, "tags": [], "text": "According to the Servlet specification and also documentation, this method should return the part of this request's URL from the protocol name up to the query string.\n\nBut if the URL is e.g. \"http://localhost/test.html#fragment\", the returned string contains also fragment \"test.html#fragment\", which is wrong, because fragment is after the query (which is now empty).", "is_private": false, "id": 166805, "creation_time": "2013-04-24T08:52:38Z", "time": "2013-04-24T08:52:38Z", "creator": "adrian.rakovsky@gratex.com", "bug_id": 54882, "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 166807, "time": "2013-04-24T09:25:44Z", "bug_id": 54882, "creation_time": "2013-04-24T09:25:44Z", "is_private": false, "text": "User agents should not be sending URLs that include fragments. Any fragment should be removed by the user agent prior to making the request and processed solely on the client side.\n\nWhich user agent(s) is(are) sending fragments to the server?"}, {"count": 2, "tags": [], "creator": "adrian.rakovsky@gratex.com", "attachment_id": null, "is_private": false, "id": 166808, "time": "2013-04-24T09:32:23Z", "bug_id": 54882, "creation_time": "2013-04-24T09:32:23Z", "text": "XmlHttpRequest made from IE (8/9/10) will send also fragment. It is definitely bug of IE, but anyway, I think that getRequestURI should strip it as well."}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 166809, "time": "2013-04-24T09:52:37Z", "bug_id": 54882, "creation_time": "2013-04-24T09:52:37Z", "text": "Generally, Tomcat doesn't provide work-arounds for bugs in third-party software components unless all of the following conditions have been met:\na) The issue affects a large proportion of the Tomcat user base\nb) The issue has a significant negative impact on users of affected applications\nc) An application level work-around is not viable\nd) The issue has been reported to the vendor of the third-party software\ne) The vendor of the third-party software has indicated that a fix will not be available for an extended period of time (many months)\n\nIn this case my current view of the above is:\na) Not demonstrated. Tomcat hasn't handled fragments for as long as I can remember. The only reference I can find in the archives was a query on the users list as to why the server wasn't seeing the fragment.\nb) Not demonstrated.\nc) A Filter could fix this.\nd) Not demonstrated.\ne) Not demonstrated.\n\nThere have been cases where we have provided a work-around but they are few and far between. At the moment this bug is heading towards being closed as INVALID or maybe WONTFIX."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 166854, "time": "2013-04-25T13:25:08Z", "bug_id": 54882, "creation_time": "2013-04-25T13:25:08Z", "text": "I'm resolving this as INVALID since the bug is in a third party product. If there is a case for implementing a work-around for this in Tomcat feel free to re-open this bug and state the case."}, {"count": 5, "tags": [], "text": "One could argue that the request URI is invalid, thus Tomcat should reject the request with a 404.", "is_private": false, "id": 166856, "creation_time": "2013-04-25T13:35:10Z", "time": "2013-04-25T13:35:10Z", "creator": "julian.reschke@gmx.de", "bug_id": 54882, "attachment_id": null}, {"count": 6, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 166857, "time": "2013-04-25T13:39:44Z", "bug_id": 54882, "creation_time": "2013-04-25T13:39:44Z", "is_private": false, "text": "You could, but if Tomcat did that it would be a lot harder for users to work-around the issue until the UA is fixed.\n\nBy allowing the request to continue, users that see this issue can work-around it with a filter until the UA is fixed."}, {"count": 7, "tags": [], "text": "Hi,\n\nnote that IIS (7.5) does reject requests where the URL contains a fragment (but no query string) like \"/test.html#fragment\" with a \"400 Bad Request\" response.\n\nI'm guessing you use the XmlHttpRequest for Ajax requests. While it is a bug of IE to include a fragment in the request to the server, I wonder why you pass a URL that includes a fragment to XmlHttpRequest. Does the fragment influence the result returned from the XmlHttpRequest?\n\nIf not, then I think the workaround should be in the client instead of the server: The JavaScripts should not pass a URL with a fragment to the XmlHttpRequest.", "is_private": false, "bug_id": 54882, "id": 166863, "time": "2013-04-25T17:16:10Z", "creator": "kpreisser@apache.org", "creation_time": "2013-04-25T17:16:10Z", "attachment_id": null}, {"count": 8, "tags": [], "text": "To follow-up on this report:\n\nI tested with current IE 10 and old IE 8 and cannot reproduce the behavior described in this report.\n\nWhen I submit a URL like \"test.html#fragment\" to a XMLHttpRequest in Javascript, IE will send the following request to the server:\n\nGET /test.html%23fragment HTTP/1.1\n... [other headers]\n\nwhich should be a valid URL (it would request a file called \"test.html#fragment\").\n\nHttpServletRequest.getRequestURI() on Tomcat 7.0.40 correctly returns \"/test.html%23fragment\" in such a case.\n\n\nSo I don't think there is a IE bug here - maybe it could be called a \"feature\" as it seems that IE's XMLHttpRequest treats a \"#\" as a character that was forgotten to be encoded, since a fragment would not make sense for the XMLHttpRequest, and therefore encodes it. This, however, does not match behavior of other browsers like Firefox and Chrome, where the XMLHttpRequest remove the \"#\"-part of the URL.", "is_private": false, "bug_id": 54882, "id": 167082, "time": "2013-05-07T22:23:31Z", "creator": "kpreisser@apache.org", "creation_time": "2013-05-07T22:23:31Z", "attachment_id": null}, {"count": 9, "tags": [], "creator": "kpreisser@apache.org", "attachment_id": null, "is_private": false, "id": 167083, "time": "2013-05-07T22:42:14Z", "bug_id": 54882, "creation_time": "2013-05-07T22:42:14Z", "text": "Sorry - there is a bug in IE, as the W3C working draft for XMLHttpRequest [1] says that the \"open() method\" must run the following step when resolving the URL:\n\n  9. Drop <fragment> from url.\n\nwhich IE doesn't follow, as it encodes the \"#\" character as \"%23\" instead of removing the fragment part. However, I think the workaround in this case still should be that the Javascript should not pass a URL with a fragment to the XMLHttpRequest.\n\n\n[1] http://www.w3.org/TR/XMLHttpRequest/#the-open%28%29-method"}]