[{"count": 0, "tags": [], "creator": "snatzke@codecentric.de", "attachment_id": 30227, "id": 166876, "time": "2013-04-26T16:43:22Z", "bug_id": 54897, "creation_time": "2013-04-26T16:43:22Z", "is_private": false, "text": "Created attachment 30227\nJMeter test case for a problem with the regular expression extractor\n\nIn the attechment the \"Regular Expression Extractor” is used to extract a variable from the response of the last sampler, the debug sampler. The content of the extracted variable could be used just  in the very next sampler. The content was already gone in the next sampler thereafter, It also was not transferable to other variables or structures. I tried a whole bunch of different workarounds, none was working.\n\nOne note to what we did in this load test: We had to provide a filename to the String constructor of the JUnit test case. This file contained the test data for one execution of a JUnit test method. We had thousands of different files, and we wanted to choose it by random. So we wrote all the file names in a text file, loaded the content of the text file in the variable ${testfallDateiXMLTestCases}, displayed it with the Debug-Sampler (yeah, we know, that's not what this sampler is originally designed for) and chose one the lines (i.e. the name of one of the thousands of files with different test data) by random with the \"Regular Expression Extractor\". This line - the name of the test-data file - was put into the variable ${testfall}. It was this variable, that lost its content so quickly. \n\nActually, this seems to be the very same bug as no. 28.600 from 2004... As this bug is so old and seemingly fixed, I create a new bug for this behaviour."}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 166878, "time": "2013-04-26T18:27:12Z", "bug_id": 54897, "creation_time": "2013-04-26T18:27:12Z", "is_private": false, "text": "PostProcessors are applied to every sample in scope, not just the one they follow.\n\nBugzilla is not a support forum.\n\nPlease read [1]\nIf this does not solve your problem, please subscribe to the user list and ask there.\n\n[1] http://jmeter.apache.org/usermanual/test_plan.html#scoping_rules"}]