[{"count": 0, "tags": [], "bug_id": 54898, "attachment_id": 30228, "id": 166877, "time": "2013-04-26T16:58:18Z", "creator": "snatzke@codecentric.de", "creation_time": "2013-04-26T16:58:18Z", "is_private": false, "text": "Created attachment 30228\njmx-file with a lot of JUnit samplers\n\nIf a JMeter testplan contains several JUnit samplers, JMeter sometimes changes the test classes and test methods of the other samplers to the class and method of the current JUnit sampler. I have no idea what triggers this particular bug.\n\nThe attachment shows an extreme case of this. In the thread group \"Zufaelliger JUnit-Testfall\" you see some 100 different JUnit samplers. It happened several times, while we were adding the next JUnit sampler with another JUnit test class and/or another JUnit test method, that all other JUnit samplers suddenly lost their original test classes and test methods and instead contained the same class and method as the new sampler. What we did, basically, was to save the jmx-file after entering ten new samplers (always with a new name) in order not to lose the work already done.\n\nBTW: Regards to Philippe M. who suggested to not just complain about JMeter issues in a blog (http://blog.codecentric.de/en/2013/03/from-a-mathematicians-point-of-view-jmeter-beloved-crap-tool/) but also enter them here.\n\nGeorg"}, {"count": 1, "tags": [], "bug_id": 54898, "attachment_id": null, "text": "First thanks for report.\nI am not able to reproduce issue.\nAre you sure you faced it with recent version of JMeter ?\nCould you try to give a simpler test plan with detailed steps to reproduce issue ?\n\nThanks", "id": 166944, "time": "2013-04-29T20:39:10Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2013-04-29T20:39:10Z", "is_private": false}, {"count": 2, "tags": [], "creator": "snatzke@codecentric.de", "text": "It was JMeter version 2.9 r1437961 or later.\n\nUnfortunately, the problems occurred at a customer's site, I have no access to the system any more. But the issue happened consistently. It was no \"effort\" to recreate it, it just happened again and again.", "id": 167014, "time": "2013-05-03T16:15:09Z", "bug_id": 54898, "creation_time": "2013-05-03T16:15:09Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 54898, "attachment_id": null, "id": 168387, "time": "2013-07-08T20:21:56Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2013-07-08T20:21:56Z", "is_private": false, "text": "I tried playing a lot with provided test plan without success, so closing issue as WORKSFORME.\nNext time it happens provide jmeter.log file , test plan and exact scenario."}]