[{"count": 0, "tags": [], "creator": "ericleecarroll@yahoo.com", "attachment_id": 30250, "text": "Created attachment 30250\nUnit Test\n\nXSSFDrawing.createCellComment calls CommentsTable.newComment, which creates a temporary \"A1\" cell reference, and then updates the cell reference with the proper row and column.  But that temporary \"A1\" is placed in the commentRefs map, and can overwrite a legitimate comment in \"A1\".\n\nI've attached a unit test that shows the issue.  There are a pair of 'NOTES' in the source that show the required steps to reproduce.", "id": 166999, "time": "2013-05-02T16:56:59Z", "bug_id": 54920, "creation_time": "2013-05-02T16:56:59Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 54920, "text": "Created attachment 30322\nUpdated unit-test which shows the problem more clearly, i.e. comment in A1 is there before and gone after comment in B2 is set", "id": 167413, "time": "2013-05-25T14:19:51Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2013-05-25T14:19:51Z", "is_private": false, "attachment_id": 30322}, {"count": 2, "tags": [], "bug_id": 54920, "attachment_id": 30323, "id": 167414, "time": "2013-05-25T14:25:41Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2013-05-25T14:25:41Z", "is_private": false, "text": "Created attachment 30323\nProposed fix for\n\nCommentsTable is dangerous as it overwrites comments in A1 because it uses this column as default reference in newComment(). \n\nThis proposed patch changes this so a reference is always passed to newComment() and thus can be set immediately. This also avoids having to adjust the shape later on in the setCol()/setRow() columns.\n\nAdjusted tests and the original test in this bug run fine then.\n\nI am not sure if this breaks API compatibility, is newComment() exported to the outside? We could add a second newComment(String ref) to fix this in a compatible way, but this keeps a method which is dangerous to use anyway...\n\nAnother option to fix this would be to use a reference which does not exist in normal sheets, e.g. something like A0, but I did not look into this yet, any thoughts?"}, {"count": 3, "tags": [], "bug_id": 54920, "text": "We normally try to maintain binary compatibility, unless there's a very good reason\n\nIf some situations will work fine with the current method signature, then I'd suggest we @deprecate it, add a note about the new one, and change all POI code to use the new call\n\nIf the old method signature will never work, then remove it, add the new one, and add something to the release notes.", "id": 167906, "time": "2013-06-18T22:37:14Z", "creator": "apache@gagravarr.org", "creation_time": "2013-06-18T22:37:14Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "text": "Fixed with revision 1495894, we now deprecated the newComment() method without arguments and added a new one which receives the target reference for the comment as parameter. All uses in POI itself are adjusted accordingly.", "id": 167980, "time": "2013-06-23T21:34:55Z", "bug_id": 54920, "creation_time": "2013-06-23T21:34:55Z", "is_private": false}]