[{"count": 0, "tags": [], "bug_id": 54925, "attachment_id": 30253, "is_private": false, "id": 167022, "time": "2013-05-03T20:35:37Z", "creator": "dustin@virtualroadside.com", "creation_time": "2013-05-03T20:35:37Z", "text": "Created attachment 30253\nPatch that truncates text size if it's larger than the parent\n\nIn some of my PPT files (which unfortunately I can't post), the StyleTextPropAtom contains paragraph and character runs which have incorrect text sizes in them (e.g., they are much larger than the parent text atom). A warning is logged (\"Problem reading paragraph style runs: ... \"), but because the incorrect text size is stored in the text properties, a StringIndexOutOfBoundsException is thrown when calling RichTextRun.getText(). Examination shows that it is calling substring on the parent text without validating the actual text length. \n\nI wasn't able to create a standalone file with this type of problem in it. The files that I do have all validate correctly with Microsoft's binary file format checker, and Microsoft Office is able to open them also without any complaints. The files do have additional warnings saying \"Found a TextHeaderAtom not followed by a TextBytesAtom or TextCharsAtom: followed by 4002\", but I don't feel this is related. \n\nThe attached patch fixes this problem by modifying StyleTextPropAtom to truncate the text size if it is larger than the parent text size. This fixes my problem, passes all current unit tests."}, {"count": 1, "tags": [], "text": "4002 is a BaseTextPropAtom, which we don't currently have support for. As of r1496518 we should no longer give a warning for this. \n\nIf you have a file handy that showed this, any chance you could share it, or at least the list of records around the BaseTextPropAtom? I'm interested to know if it goes in instead of a StyleTextPropAtom, or before it, as that would affect our detection logic", "is_private": false, "bug_id": 54925, "id": 168044, "time": "2013-06-25T15:41:28Z", "creator": "apache@gagravarr.org", "creation_time": "2013-06-25T15:41:28Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 54925, "attachment_id": null, "is_private": false, "id": 168045, "time": "2013-06-25T15:50:10Z", "creator": "apache@gagravarr.org", "creation_time": "2013-06-25T15:50:10Z", "text": "Hopefully fixed in r1496520, but without a unit test it's hard to be sure - could you confirm please?"}, {"count": 3, "tags": [], "bug_id": 54925, "attachment_id": null, "id": 170353, "time": "2013-09-29T20:30:31Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2013-09-29T20:30:31Z", "is_private": false, "text": "Should be fixed, but unconfirmed for some time, therefore setting to RESOLVED, please reopen if this is still a problem with current builds."}]