[{"count": 0, "tags": [], "bug_id": 54939, "text": "Recent versions of tomcat 6 & 7 added the maxHeaderCount parameter to the connector configuration with a default value of 100. When this limit is hit Tomcat returns a HTTP 400 response with a blank page and in the default configuration nothing is logged by the server. The org.apache.coyote.ajp.AjpProcessor class logs the error at DEBUG level but that doesn't get written anywhere using the default configuration.\n\nThe use case for more than 100 headers is the use of SSO systems that provide user attributes via HTTP headers. The Internet2 Shibboleth project is one good example, it is quite common to have well over 100 headers getting passed to Tomcat when using these systems.\n\nI'd like to propose one of the following fixes:\n\n- Write a message to the response explaining why the 400 response was returned. This would make it much easier for application deployers to determine the cause of the non-functional application.\n\n- Have a default logger setup for the AJP connector and change the log level to INFO. Perhaps this gets treated as a one time warning and the first request that hits this limit is logged as WARN and the subsequent requests are logged at DEBUG to avoid log clutter.\n\n- Increase the default value of maxHeaderCount to 1000 which would more easily accommodate the use of HTTP headers to pass user attributes.\n\n\n\nI'd be happy to provide a patch for any of these solutions or other proposed ideas.", "id": 167093, "time": "2013-05-08T14:21:16Z", "creator": "eric.dalquist@doit.wisc.edu", "creation_time": "2013-05-08T14:21:16Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 54939, "text": "An IllegalStateException should be thrown in this case. Are you not seeing that in any log? I would expect IllegalStateException to propagate back to the error page including a stack trace, etc. Is that not happening?", "id": 167096, "time": "2013-05-08T16:19:02Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-05-08T16:19:02Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "eric.dalquist@doit.wisc.edu", "attachment_id": null, "id": 167097, "time": "2013-05-08T16:34:53Z", "bug_id": 54939, "creation_time": "2013-05-08T16:34:53Z", "is_private": false, "text": "The IllegalStateException is getting thrown but the try/catch that handles it sets the response to 400, logs the request and sets an error flag. No stack trace shows up in any log or on the rendered response.\n\nSee:\nhttp://svn.apache.org/viewvc/tomcat/tc7.0.x/tags/TOMCAT_7_0_39/java/org/apache/coyote/ajp/AjpProcessor.java?revision=1459741&view=markup#l177\n\nprepareRequest(); is the call that results in the IllegalStateException which is handled by the catch block starting at line 178. The exception is logged but at DEBUG level and to a logger that has no logging configuration in the default configuration."}, {"count": 3, "attachment_id": null, "bug_id": 54939, "text": "Hmm. Sounds like using a new kind of exception type is appropriate: that could be logged specially. I wonder why Adapter.log() isn't actually logging anything...", "id": 167104, "time": "2013-05-09T01:14:49Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-05-09T01:14:49Z", "tags": [], "is_private": false}, {"count": 4, "attachment_id": null, "bug_id": 54939, "text": "Adapter.log() logs the request so you see an entry in the localhost_access log that looks like:\n\n128.104.17.46 - - [07/May/2013:15:50:44 -0500] \"GET /portal/layout.json HTTP/1.1\" 400 -\n\nThat doesn't really give you any more information than what you see in the browser though.\n\n\n\nIs this something you'd be interested in seeing an external patch for? If you have some ideas on how you'd like to see it fixed I could take a pass at implementation.", "id": 167105, "time": "2013-05-09T01:17:57Z", "creator": "eric.dalquist@doit.wisc.edu", "creation_time": "2013-05-09T01:17:57Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "text": "Great. Here are some (short) pointers.\n\n1. Patches should be against https://svna.apache.org/repos/asf/tomcat/trunk and attached to this issue in \"diff -u\" format\n\n2. o.a.tomcat.util.log.UserDataHelper is the way to handle this. Use it in the catch (Throwable t) block in AbstractHttp11Processor\n\nLook at how UserDataHelper is used elsewhere for examples on how to use it.\n\nAsk on the dev list if you need help.", "attachment_id": null, "id": 167450, "creator": "markt@apache.org", "time": "2013-05-28T09:53:46Z", "bug_id": 54939, "creation_time": "2013-05-28T09:53:46Z", "is_private": false}, {"count": 6, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I'd like to see this issue resolved for the 7.0.41 so I will be fixing it shortly.", "id": 167655, "time": "2013-06-04T12:55:28Z", "bug_id": 54939, "creation_time": "2013-06-04T12:55:28Z", "is_private": false}, {"count": 7, "attachment_id": null, "bug_id": 54939, "is_private": false, "id": 167656, "time": "2013-06-04T13:43:53Z", "creator": "markt@apache.org", "creation_time": "2013-06-04T13:43:53Z", "tags": [], "text": "This has been fixed in trunk and 7.0.x and will be included in 7.0.41 onwards."}]