[{"count": 0, "tags": [], "bug_id": 54969, "attachment_id": 30284, "id": 167199, "creation_time": "2013-05-14T15:36:44Z", "time": "2013-05-14T15:36:44Z", "creator": "sanewell92@gmail.com", "text": "Created attachment 30284\nClass demonstrating the bug\n\nSee semi-solved Stack Overflow question : \n\nhttp://stackoverflow.com/questions/16529787/how-to-change-font-on-xssftextbox\n\n\nSo two things, one has a fairly easy work-around and the other is just annoying: Firstly (easy work-around but limiting) I have to retrieve the underlying CTTextCharacterProperties object to actually change the font, which is strange in the first place; as the other guy on SO said, it seems like the XSSFSimpleShape.applyAttributes method doesn't deal with Fonts correctly, but rather only Font Families, which is not what is expected when applying a Font to a RichTextField to use it as the text for an XSSFTextBox; I expect that applied Font to be correctly and fully applied, not to mention that the only colors that seem to be applied are Font.COLOR_NORMAL and Font.COLR_RED enums. Unless this is what you want us to use, which documentation never says to; I would normally simply create a new XSSFColor(java.awt.Color.BLACK) like I do with fonts and styles for cells, but that does not work here (I always would get white color default font when I try and do it intuitively).\n\nSecond, with Excel 2010 when I call setFillColor on an XSSFTextBox object upon opening the spreadsheet Excel tells me that it found unreadable content and then it repairs xml, specifically\n\"Repaired Records: Drawing from /xl/drawings/drawing1.xml part (Drawing shape)\"\n\nIf I comment out setFillColor I don't get this bit. I've also tried using the underlying CTTextCharacterProperties Object to fill the TextBox, making a reference Object rpr from a XSSFTextBox instance call getCTShape().getTxBody().getPArray(0).getRArray(0).getRPr(), I then do this :\nColor col = Color.PINK; and invoke\nrpr.addNewSolidFill().addNewSrgbClr().setVal(); and pass in a new byte array from values from col. This does not fill the XSSFTextBox, and it makes excel find unreadable content as well, so at the moment I use setFillColor, but I can't have excel finding unreadable content as the users who will be using my program won't know what is happening and think something went wrong.\n\n\nThanks for taking the time to read this! I'm not sure if this is an Excel 2010 specific thing, or if I'm calling/dealing with XSSFTextBox incorrectly, or what; attaching source code.", "is_private": false}, {"count": 1, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "attachment_id": 30603, "id": 168672, "time": "2013-07-19T14:30:40Z", "bug_id": 54969, "creation_time": "2013-07-19T14:30:40Z", "is_private": false, "text": "Created attachment 30603\nPatch which fixes the font issue and implements unit test verifying that the font and color attributes are passed through correctly\n\nI've attached a patch which fixes the font issue and implements unit test verifying that the font and color attributes are passed through correctly.\n\nI suspect your other problem is related to shape groups - do you see the same issue if you create the textboxes as indivdual entities?"}, {"count": 2, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "id": 185020, "time": "2015-09-07T20:09:26Z", "bug_id": 54969, "creation_time": "2015-09-07T20:09:26Z", "is_private": false, "text": "This seems to have been applied since a long time already via bug 55292\n\n*** This bug has been marked as a duplicate of bug 55292 ***"}]