[{"count": 0, "tags": [], "bug_id": 54987, "attachment_id": null, "is_private": false, "id": 167254, "time": "2013-05-16T22:24:27Z", "creator": "sdeboy@iname.com", "creation_time": "2013-05-16T22:24:27Z", "text": "I am working on implementing support for RFC5878 in OpenSSL and mod_ssl.  I am in the process of contributing the OpenSSL work back to the project, and I would like to do the same for my mod_ssl changes.\n\nPrevious support for RFC5878 was committed and then backed out.  See http://www.mail-archive.com/dev@httpd.apache.org/msg56660.html\n\nMy specific requirements are to implement support for DTCP-based authorization through RFC5878 in mod_ssl, and that work is in-progress but functional.  My work didn't require me to add support for the AuthzDataFormats defined in RFC5878, as we are defining a new RFC to add support for DTCP-based authorization using RFC5878, however, the OpenSSL API would not need to change to implement support for the AuthzDataformats specified in RFC5878.\n\nThe OpenSSL changes can be seen here:\nhttps://bitbucket.org/cvp2ri/openssl/compare/dtcp-plus-supp-data..master#diff\n\nThe mod_ssl changes can be seen here:\nhttps://bitbucket.org/cvp2ri/apache-http-server/compare/dtcp-support..mirror/apache-http-server:2.4.x#diff\n\nI'm filing this issue in order to request feedback on the changes to mod_ssl linked above.  If additional work is required in order to improve the chances of this contribution being accepted, please let me know.\n\nThe OpenSSL API is almost exclusively callback-based, and RFC5878 requires TLS extensions to be examined by both sides and supplemental data sent, possibly by both sides, during the TLS handshake.  I don't believe the OpenSSL configuration command support recently added in http://svn.apache.org/viewvc?view=revision&revision=r1421323 would support these requirements, as what is sent in the TLS extension and supplemental data is dependent on what is sent by the other side.\n\nAny feedback is welcome.\n\nScott"}, {"count": 1, "tags": [], "text": "Attached contribution is no longer relevant as the OpenSSL API has changed.  Will file a new issue.", "attachment_id": null, "bug_id": 54987, "id": 169643, "time": "2013-08-21T20:59:43Z", "creator": "sdeboy@iname.com", "creation_time": "2013-08-21T20:59:43Z", "is_private": false}]