[{"count": 0, "tags": [], "bug_id": 54994, "attachment_id": null, "id": 167318, "time": "2013-05-21T05:24:21Z", "creator": "u-2031@hotmail.com", "creation_time": "2013-05-21T05:24:21Z", "is_private": false, "text": "Fixed in Apache httpd 2.2.6:\n\nmoderate: mod_proxy crash CVE-2007-3847\nA flaw was found in the Apache HTTP Server mod_proxy module. On sites where a reverse proxy is configured, a remote attacker could send a carefully crafted request that would cause the Apache child process handling that request to crash. On sites where a forward proxy is configured, an attacker could cause a similar crash if a user could be persuaded to visit a malicious site using the proxy. This could lead to a denial of service if using a threaded Multi-Processing Module. \nmoderate: mod_status cross-site scripting CVE-2006-5752\nA flaw was found in the mod_status module. On sites where the server-status page is publicly accessible and ExtendedStatus is enabled this could lead to a cross-site scripting attack. Note that the server-status page is not enabled by default and it is best practice to not make this publicly available. \nmoderate: Signals to arbitrary processes CVE-2007-3304\nThe Apache HTTP server did not verify that a process was an Apache child process before sending it signals. A local attacker with the ability to run scripts on the HTTP server could manipulate the scoreboard and cause arbitrary processes to be terminated which could lead to a denial of service. \nmoderate: mod_cache information leak CVE-2007-1862\nThe recall_headers function in mod_mem_cache in Apache 2.2.4 did not properly copy all levels of header data, which can cause Apache to return HTTP headers containing previously used data, which could be used by remote attackers to obtain potentially sensitive information. \nmoderate: mod_cache proxy DoS CVE-2007-1863\nA bug was found in the mod_cache module. On sites where caching is enabled, a remote attacker could send a carefully crafted request that would cause the Apache child process handling that request to crash. This could lead to a denial of service if using a threaded Multi-Processing Module."}, {"count": 1, "tags": [], "text": "What the point with this report ?\nThe goal of bugzilla is to track *new* bug reports.\n\nDid I miss something ?", "is_private": false, "id": 167322, "creator": "christophe.jaillet@wanadoo.fr", "time": "2013-05-21T08:53:27Z", "bug_id": 54994, "creation_time": "2013-05-21T08:53:27Z", "attachment_id": null}]