[{"count": 0, "tags": [], "text": "Have a function in OO Calc that allows a cell with a formula to be indirectly evaluated.  This will allow a single formula to be referenced in multiple other cells with any changes in the reference formula being reflected in the other cells.\n\nSheet1.A1 has formula =SUM(D4:D9;E4:E6)\nSheet2.C9 has a pointer to Sheet1.A1\nSheet3.C9 has a pointer to Sheet1.A1\nSheet4.H3 has a pointer to Sheet1.A1\n\nDesired evaluation result for cell Sheet2.C9 is =SUM(Sheet2.D4:D9;Sheet2.E4:E6)\nDesired evaluation result for cell Sheet3.C9 is =SUM(Sheet3.D4:D9;Sheet2.E4:E6)\nDesired evaluation result for cell Sheet4.H3 is =SUM(Sheet4.D4:D9;Sheet2.E4:E6)\n\nOptional function feature would be to allow a row and column offset that would offset non-absolute value formula references.", "attachment_id": null, "id": 167359, "creation_time": "2013-05-22T16:37:07Z", "time": "2013-05-22T16:37:07Z", "creator": "golfjunobravo@gmail.com", "bug_id": 55007, "is_private": false}, {"count": 1, "tags": [], "bug_id": 55007, "text": "Slightly confused about what you are asking for here. Are you saying that you want a new function within Excel itself that exhibits this feature? If so, then you really need to post this request to Microsoft as POI is only used to create/edit files that are compatible with the application, it cannot be used to modify the application itself.\n\nAlternativly, you need to create a user defined function - these can be included into the application - but I am not at all sure you could call it SUM as I suspect that is a reserved word or name within the application. To do so, you will be writing the VBA code again within Excel and this is another question best asked on an Excel users forum.\n\nFinally, you might be asking if it is possible to make POI's formula evaluator work in the manner you describe. If so, this might be possible as you can create functions outside of Excel and have POI use these during it's evaluation of the workbook. Again though, I suspect you will fall foul of naming issues if you still want to call it the SUM function.", "id": 167412, "time": "2013-05-25T07:21:00Z", "creator": "markbrdsly@tiscali.co.uk", "creation_time": "2013-05-25T07:21:00Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 55007, "text": "How does Excel handle a workbook saved by OO Calc with \"function pointers\"?\n\nIf it's not in the BIFF or OOXML spreadsheet specs, it would be difficult to implement this in a cross-application compatible way.\n\nClosing due to no progress in several years. If this functionality is still needed, please reopen, provide a workbook with \"function pointers\" saved by OO Calc, and a patch that implements this behavior in POI in a standards-compatible way.", "id": 189981, "time": "2016-04-05T17:03:03Z", "creator": "onealj@apache.org", "creation_time": "2016-04-05T17:03:03Z", "is_private": false, "attachment_id": null}]