[{"count": 0, "tags": [], "creator": "evgeni_kisel@epam.com", "attachment_id": 30318, "id": 167398, "time": "2013-05-24T14:09:14Z", "bug_id": 55016, "creation_time": "2013-05-24T14:09:14Z", "is_private": false, "text": "Created attachment 30318\nxlsx file with named cell.\n\nHi,\n\n\nUnfortunately I'm not able to get cell name using XSSF event model API. Please see the B2 column in the attached xlsx file.\n\nThe expected result that I expect to receive is cell id (B2 according to attached file) and cell name (COLUMN_NAME according to attached file)\n\n\nThanks,\nEvgeni"}, {"count": 1, "tags": [], "text": "I am assuming that you are using an SAX parser and a content handler to read the raw xml for the sheet but do need to be clear on this point so, may I ask how you are going about trying to retrieve the cell's name?\n\nIf you take a look at the raw xml markup for a workbook, then the names are usually stored in the workbook.xml file in an element called definedNames. This  element have children - each called definedName - which identifies the cell or cells the name refers to and specifies the name applied to that range of cells. If you are using the SAX parser/handler approach to process the sheet's contents, then I then you will also need to handle this extra wrinkle and parse the workbook.xml file also.", "is_private": false, "id": 167401, "creation_time": "2013-05-24T16:24:45Z", "time": "2013-05-24T16:24:45Z", "creator": "markbrdsly@tiscali.co.uk", "bug_id": 55016, "attachment_id": null}, {"count": 2, "tags": [], "creator": "evgeni_kisel@epam.com", "attachment_id": null, "id": 167430, "time": "2013-05-27T11:41:41Z", "bug_id": 55016, "creation_time": "2013-05-27T11:41:41Z", "is_private": false, "text": "Thank you for explanation. It's quite useful for me. It seems like my fault. I've not parsed workbook.xml. But I have already spent a lot of time trying to find anything related to this issue. \n\nCould you share the example if you have one, please?\n\n\nThanks,\nEvgeni"}, {"count": 3, "tags": [], "bug_id": 55016, "attachment_id": null, "text": "Finally i've found everything!\n\nThanks a lot for assistance!", "id": 167432, "time": "2013-05-27T11:59:58Z", "creator": "evgeni_kisel@epam.com", "creation_time": "2013-05-27T11:59:58Z", "is_private": false}]