[{"count": 0, "tags": [], "creator": "oliver_lloyd@hotmail.com", "attachment_id": null, "id": 167481, "time": "2013-05-29T16:54:53Z", "bug_id": 55028, "creation_time": "2013-05-29T16:54:53Z", "is_private": false, "text": "It would be useful if there were an option to save the currently open testplan as a template that can be reused later as a time saving measure.\n\nA template testplan might have the suffix .jmt (not .jmx) and live in a special folder such that, when jmeter is loaded, it reads this folder and populates a sub menu with available options.\n\nIe.:\nFile > Save As Template - would create a new template.\nFile > Open Template > - would show a sub menu of previously saved templates.\n\n\nThis would help individuals save and access their own custom templates but you could also have standard templates baked into jmeter to help reduce the steep learning curve for new users of JMeter. A standard web template (using dummy values) with obvious things like cookie management and assertions would very likely save a lot of people a lot of time.\n\nYes, baking in templates like this would be opinionated but hey, there really are some basic use cases where a template would work very well and it's also a superb way to give users quick and obvious access to feature examples."}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 167482, "time": "2013-05-29T16:58:57Z", "bug_id": 55028, "creation_time": "2013-05-29T16:58:57Z", "is_private": false, "text": "In what way would a template be different from a test plan?\n\nWhat's wrong with \"Save As ...\" ?"}, {"attachment_id": null, "tags": [], "bug_id": 55028, "text": "I think Oliver idea is something like this maybe:\n- Create a folder used for template in which we would put sample test plans like:\n* Http Web Test plan\n* Ldap Test Plan\n* JDBC Test Plan\n\n- We would have somewhere a Menu \"create from templates\", that would let use choose what kind of Test he wants to do and we would only open this\n\n- Users could create new \"model\" plan (which would be a regular Test plan) and have an option to name this model (for example : HTTP with Basic Auth)\n\n\nThis would be useful for new users to JMeter as sometimes kickstart could be improved.\n\nOliver is this your idea ?", "count": 2, "id": 167627, "time": "2013-06-03T20:06:30Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2013-06-03T20:06:30Z", "is_private": false}, {"count": 3, "tags": [], "text": "I find this a very good idea for new users !", "attachment_id": null, "bug_id": 55028, "id": 167628, "time": "2013-06-03T20:07:12Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2013-06-03T20:07:12Z", "is_private": false}, {"count": 4, "tags": [], "creator": "oliver_lloyd@hotmail.com", "text": "Yes, exactly. Actually Phillipe's definition is even better as it includes both some standard kickstart templates for new users and also allows established users to save their own custom templates.\n\nThe more I think about this the more it feels right. It's true, you can use Save As but it's amazing how easy it is for a work flow like this to fail. All I have to do is forget to save my 'template' testplan using a new name and the process is broken, I have to re-create the template testplan again...\n\nIf there were a 'special' template type of testplan and if, when I opened it, I were not able to overwrite it, then suddenly my world becomes better, easier.", "id": 167631, "time": "2013-06-03T20:19:28Z", "bug_id": 55028, "creation_time": "2013-06-03T20:19:28Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 55028, "text": "(In reply to oliver lloyd from comment #4)\n> \n> If there were a 'special' template type of testplan and if, when I opened\n> it, I were not able to overwrite it, then suddenly my world becomes better,\n> easier.\n\nJust mark it read-only.", "count": 5, "id": 167632, "time": "2013-06-03T20:31:37Z", "creator": "sebb@apache.org", "creation_time": "2013-06-03T20:31:37Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 55028, "attachment_id": null, "text": "OK, so yes, it's true that it IS possible to get this functionality by using a process of save as and marking the file as read only. \n\nBut you know, maybe this is the reason why JMeter is so hard for new users to learn. Just because it is possible to achieve something that's not a reason why we should not make it easier and more intuitive to do. UX is not exactly JMeter's strongest feature but why not try and improve that? Why not implement some enhancements to UX?", "id": 167709, "time": "2013-06-07T09:50:16Z", "creator": "oliver_lloyd@hotmail.com", "creation_time": "2013-06-07T09:50:16Z", "is_private": false}, {"count": 7, "tags": [], "creator": "sebb@apache.org", "text": "This has been fixed in 55085", "id": 168413, "time": "2013-07-09T13:24:39Z", "bug_id": 55028, "creation_time": "2013-07-09T13:24:39Z", "is_private": false, "attachment_id": null}]