[{"attachment_id": null, "tags": [], "bug_id": 55039, "text": "Hello,\n\nFirst of all, let me give you some context. The Apache 2.2's webpage which describes mod_headers' \"RequestHeader\" directive says (specifically for the \"edit\" action):\n\n\tRequestHeader edit header value replacement [early|env=[!]variable]\n\tIf this request header exists, its value is transformed according to a regular expression search-and-replace. The value argument is a regular expression, and the replacement is a replacement string, which may contain backreferences. Both a value and a replacement are a regular expression and a replacement string respectively.\n\nThat's fine, but I faced a situation in my production environment where I had two JSESSIONIDs defined in the \"Cookie\" header (don't ask me why) and this was confusing the load balancing algorithm (mod_proxy_balancer). Without getting into too much details, what I had to do was to clean up the \"Cookie\" header to leave there only the JSESSIONID that I need. This is how I thought I could do that:\n\n\tSetEnvIf Cookie \"JSESSIONID=([^;]+\\.server.)\" MYSESSIONID=$1\n\tRequestHeader edit* Cookie \"(^JSESSIONID=[^;]+; |; JSESSIONID=[^;]+)\" \"\"\n\tRequestHeader edit Cookie \"(.*)\" \"$1; JSESSIONID=%{MYSESSIONID}e\" env=MYSESSIONID\n\nThe first two lines above work fine, but unfortunately the last one doesn't because the \"RequestHeader edit\" directive cannot reference environment variables in its replacement string (why?). :~(\n\nIf I understood correctly what the webpage mentioned above says, the replacement string is just that (a fixed string) which may also contain backreferences to groups in the value's regular expression, however, since I was trying to append the content of an environment variable there (in this case MYSESSIONID), I ended up with, for instance, the following result (which is not what I wanted):\n\n\tCookie: language=en; JSESSIONID=KKb2Ry1NJTw8tWznLH2hLCkSTkq0nnyKwSys0MbSxLvymKb89Cgn!-253102450; customer_type=Residential; JSESSIONID=%{MYSESSIONID}e\n\nI was looking for something like this:\n\n\tCookie: language=en; JSESSIONID=KKb2Ry1NJTw8tWznLH2hLCkSTkq0nnyKwSys0MbSxLvymKb89Cgn!-253102450; customer_type=Residential; JSESSIONID=60685FA3BC4F0345196D00BFBFBFFC79.server2\n\nPlease, would it be possible to add this capability to the \"RequestHeader edit\" directive so we would be able to use environments variables inside the replacement string as well?\n\nThanks a lot!\n\nPS: I'm running Apache 2.2.3 on RHEL 5.7", "count": 0, "id": 167542, "time": "2013-05-31T20:59:42Z", "creator": "felix.almeida@rci.rogers.com", "creation_time": "2013-05-31T20:59:42Z", "is_private": false}, {"count": 1, "tags": [], "text": "*** Bug 47066 has been marked as a duplicate of this bug. ***", "attachment_id": null, "id": 167546, "creator": "felix.almeida@rci.rogers.com", "time": "2013-05-31T21:22:19Z", "bug_id": 55039, "creation_time": "2013-05-31T21:22:19Z", "is_private": false}]