[{"count": 0, "text": "Specifying a \"Listen\" directive which results in binding to the IPV6 wild card address will cause Apache HTTPD to not bind to the IPV4 address. On hosts where IPV6 data is not routed to corresponding IPV4 ports, this causes HTTPD to be unreachable by IPV4.\n\nWhen the IPV4 address is the wild card address, no error is emitted and the server runs.\n\nWhen the IPV4 address is a specific address, an error is emitted and the server ends without fully starting service. The latter address is excluded by the former.\nAn example error message is:\n\n(98)Address already in use: AH00072: make_sock: could not bind to address 127.0.0.1:80\nno listening sockets available, shutting down\n\nAn example combination of directives causing that error is\n\nListen [::]:80\nListen 127.0.0.1:80\n\nAn example combination of directives for the wild card addresses is\n\nListen 0.0.0.0:80\nListen [::]:80\n\nOn Linux, setting\nsysctl net.ipv6.bindv6only=1\ncauses the IPV6 and IPV4 protocols not to be bridged.\nnet.ipv6.bindv6only=0\n, which is the default, causes them to be bridged.", "bug_id": 55098, "is_private": false, "id": 167801, "time": "2013-06-13T09:18:03Z", "creator": "hohyeis@eml.cc", "creation_time": "2013-06-13T09:18:03Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "creator": "jorton@redhat.com", "attachment_id": null, "is_private": false, "id": 167810, "time": "2013-06-13T18:58:26Z", "bug_id": 55098, "creation_time": "2013-06-13T18:58:26Z", "text": "You need to be more precise about what you think the bug is.\n\nBy default httpd enables v4mapped connections on inet6 sockets on Linux.  This is a configure-time option, --disable-v4-mapped disables it.\n\nWhen v4mapped support is enabled, the v6only option is turned off on listening inet6 sockets.\n\nIn this case, with the configuration you specify, the kernel will fail to bind().  That is expected."}, {"count": 2, "tags": [], "creator": "hohyeis@eml.cc", "attachment_id": null, "id": 167813, "time": "2013-06-13T20:21:45Z", "bug_id": 55098, "creation_time": "2013-06-13T20:21:45Z", "is_private": false, "text": "Looking at\napachectl -V\n, it appears that\n--disable-v4-mapped\nwas not used at compile time, as there is no '-D' set for it.\n\nIn the environment and configuration I write about, bridging from IP6 to IP4 does not happen by default because\nsysctl net.ipv6.bindv6only=1\nis set.\n\nI have just tried to see whether apache setting those socket options caused the connections to be bridged or mapped. It does not. That is a good thing because if it did, it would be a security hole.\n\nSince, as desired, incoming IP4 connections are not connected to IP6 listening ports in this configuration,\nthe network addresses for IP4 and IP6 are effectively fully separated (presuming there is no bug in Linux).\n\nAs a consequence, a TCP connection attempting to connect to 127.0.0.1:80 will not reach a listener on [::]:80."}, {"count": 3, "text": "httpd does always override the sysctl setting on Linux.  I don't remember why...  It doesn't seem particularly desirable, at least on Linux, especially since the Linux default is the same as the httpd default and httpd has no run-time override.", "bug_id": 55098, "attachment_id": null, "id": 167816, "time": "2013-06-14T08:38:14Z", "creator": "jorton@redhat.com", "creation_time": "2013-06-14T08:38:14Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "text": "> httpd does always override the sysctl setting on Linux.\n\nThat is not working or causing Linux to receive IPV4 connections to an IPV6 socket. If it were working that way or is under some circumstances, it would be better to change it.\n\nBetter would be either to use default behaviour for the OS or, \nif Apache does set behaviour for IPV 4 to 6 mapping,\nto set it to not bridge/map between the two.\n\nCurrently it is working neither as mapped nor as unmapped. \n(with the described system configuration.)", "is_private": false, "bug_id": 55098, "id": 167890, "time": "2013-06-18T09:44:52Z", "creator": "hohyeis@eml.cc", "creation_time": "2013-06-18T09:44:52Z", "attachment_id": null}]