[{"count": 0, "attachment_id": 30435, "bug_id": 55101, "is_private": false, "id": 167825, "time": "2013-06-15T15:01:40Z", "creator": "Brian@PingToo.com", "creation_time": "2013-06-15T15:01:40Z", "tags": [], "text": "Created attachment 30435\nnew inner class to parse credentials\n\nNow that tomcat uses a single Base64 decoder, I returned to the issues discussed in https://issues.apache.org/bugzilla/show_bug.cgi?id=54729.\n\nMark's change to the primitive Basic parser in svn commit: r1459289 was my starting point, but I wanted to write a comprehensive set of unit tests that examined all the relevant edge cases under the new Base64 decoder.\n\nI felt the most sympathetic approach would be to mirror the way DigestAuthenticator uses an inner class which encapsulates the parsing logic and provides trivial accessor methods for the authentication tokens. A suitable signature for the inner class would allow me to instantiate and test it exhaustively without having to haul up a tomcat instance for each test case. I accept the previous advice that the best framework for testing authentication is by running tomcat and examining the output to the client, but this overhead is not necessary in every single edge case.\n\nAs I developed the code, I quickly realised there would be no benefit in splitting the parser code (as DigestAuthenticator does), where some of it would have been moved to a new HttpParser.parseAuthorizationDigest method. The logic for parsing a Basic header seemed to be more clear when it was performed entirely by the new inner class. In particular, following Konstantin's comments, it would be unecessarily complex and slow to convert the ByteChunk to a StringReader for the required simple parsing process, and then returning the tokens as a HashMap. Having decided there was no point in slavishly following the parseAuthorizationDigest model, I have closed bz54729.\n\nAt this stage, I only made two small changes to TestNonLoginAndBasicAuthenticator. Some of the tests will eventually be removed as redundant, but there is no harm keeping them initially to demonstrate backward compatibility. Two of the test cases in this suite now \"fail\" because they anticipate rejection from the old parser, while the new parser is more tolerant - exactly as described in the existing TODOs (which are now removed).\n\nMy new test suite org.apache.catalina.authenticator.TestBasicAuthParser has three checkstyle errors that I am not sure how to resolve. I followed the \"normal\" junit style to have static imports for my two hamcrest assertions, but they are flagged with errors, e.g. \"Using a static member import should be avoided - org.hamcrest.MatcherAssert.assertThat\". Now that hamcrest core is no longer shipped within junit, do we need another checkstle rule?\n\nI hope you find these changes acceptable."}, {"count": 1, "tags": [], "bug_id": 55101, "attachment_id": 30436, "text": "Created attachment 30436\nremove TODOs with more tolerant parser", "id": 167826, "time": "2013-06-15T15:05:07Z", "creator": "Brian@PingToo.com", "creation_time": "2013-06-15T15:05:07Z", "is_private": false}, {"count": 2, "tags": [], "creator": "Brian@PingToo.com", "text": "Created attachment 30437\nnew test class for Basic authorization parser and Base64 decoder", "id": 167827, "time": "2013-06-15T15:06:08Z", "bug_id": 55101, "creation_time": "2013-06-15T15:06:08Z", "is_private": false, "attachment_id": 30437}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "Thanks for the patches. They have been applied to trunk and will be included in Tomcat 8.0.0 onwards.", "id": 167947, "time": "2013-06-20T20:36:38Z", "bug_id": 55101, "creation_time": "2013-06-20T20:36:38Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "Brian@PingToo.com", "is_private": false, "text": "Created attachment 30636\nremove redundant test cases for unusual but valid credentials\n\nr1495169 introduced a new BasicAuthenticator inner class to encapsulate parsing and decoding of Base64 credentials. It also added TestBasicAuthParser, which examines a far wider set of edge cases. This new change removes three tests that have now become complete duplicates of cases in TestBasicAuthParser. Also, the class-level comment has been expanded to explain the relationship between the two test classes.", "id": 168850, "time": "2013-07-28T13:32:49Z", "bug_id": 55101, "creation_time": "2013-07-28T13:32:49Z", "attachment_id": 30636}, {"count": 5, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "Thanks. Applied to trunk.", "id": 168916, "time": "2013-07-29T16:38:21Z", "bug_id": 55101, "creation_time": "2013-07-29T16:38:21Z", "attachment_id": null}]