[{"count": 0, "tags": [], "text": "Oracle has announced a Javadoc vulnerability (CVE-2013-1571 [1], VU#225657 [2]) whereby Javadoc generated with Java 5, Java 6, or Java 7 < 7u25 is vulnerable to a frame injection attack. Oracle has provided a repair-in-place tool for Javadoc that cannot be easily regenerated, but is urging developers to regenerate whatever Javadoc they can using Java 7u25. For all practical purses, the vulnerability really only applies to publicly-hosted Javadoc, so the Javadoc in our existing Maven artifacts, downloads, and archived downloads really doesn't have to be worried about (not that we could do anything about it). My thoughts on this:\n\n1) We should apply the repair-in-place tool ASAP to the Javadoc on the website for Tomcat 6 and Tomcat 7.\n\n2) Future Tomcat 6 and 7 Javadoc should be generated with 7u25 or better. There will be no fix for Java 5 or 6. Thankfully, generating Javadoc using a different JDK than you used to compile is quite easy in both Maven and Ant. In fact, I personally prefer it that way, because the Javadoc is much more visually attractive in Java 7.\n\nI will file an issue about this two, but I wanted to go ahead and make the list aware.\n\nNick\n\n[1] http://www.oracle.com/technetwork/topics/security/javacpujun2013-1899847.html\n[2] http://www.kb.cert.org/vuls/id/225657", "is_private": false, "bug_id": 55119, "id": 167910, "time": "2013-06-18T23:43:42Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-06-18T23:43:42Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 55119, "attachment_id": null, "id": 167975, "time": "2013-06-23T19:25:54Z", "creator": "markt@apache.org", "creation_time": "2013-06-23T19:25:54Z", "is_private": false, "text": "Reducing severity to normal. There is nothing here that is going to trigger a release.\n\nThis has not and will not be fixed in trunk. Tomcat 8 builds with Java 7 and can use a fixed JDK.\n\nThis has been fixed for 7.0.x and will be included in 7.0.42 onwards. The fix is based on https://issues.apache.org/jira/browse/LUCENE-5072."}, {"count": 2, "attachment_id": null, "bug_id": 55119, "is_private": false, "id": 172329, "time": "2014-01-13T14:15:39Z", "creator": "markt@apache.org", "creation_time": "2014-01-13T14:15:39Z", "tags": [], "text": "Fixed in 6.0.x for 6.0.38 onwards."}]