[{"attachment_id": 30466, "tags": [], "creator": "doubiman@gmail.com", "text": "Created attachment 30466\nFile giving the cited error.\n\nHello,\n\nI'm getting the following error when trying to open files from a particular client:\n\njava.io.IOException: block[ 2 ] already removed - does your POIFS have circular or duplicate block references?\n        at org.apache.poi.poifs.storage.BlockListImpl.remove(BlockListImpl.java:89)\n        at org.apache.poi.poifs.storage.RawDataBlockList.remove(RawDataBlockList.java:34)\n        at org.apache.poi.poifs.storage.BlockAllocationTableReader.fetchBlocks(BlockAllocationTableReader.java:221)\n        at org.apache.poi.poifs.storage.BlockListImpl.fetchBlocks(BlockListImpl.java:123)\n        at org.apache.poi.poifs.storage.RawDataBlockList.fetchBlocks(RawDataBlockList.java:34)\n        at org.apache.poi.poifs.filesystem.POIFSFileSystem.processProperties(POIFSFileSystem.java:528)\n        at org.apache.poi.poifs.filesystem.POIFSFileSystem.<init>(POIFSFileSystem.java:163)\n        at org.apache.poi.hssf.usermodel.HSSFWorkbook.<init>(HSSFWorkbook.java:322)\n        at org.apache.poi.hssf.usermodel.HSSFWorkbook.<init>(HSSFWorkbook.java:303)\n        at org.apache.poi.ss.usermodel.WorkbookFactory.create(WorkbookFactory.java:70)\n        at excelmunger.XLSParser.parse(XLSParser.java:37)\n        at excelmunger.Main.main(Main.java:34)\n\nI'm aware this problem has reared its ugly head before:\n\n#42941 was a non-bug\n\n#45290 was meant to have been fixed in v3.2 back in 2008\n\n#46904 was fixed in 2009, despite being for an old, unsupported file format.\n\n#52915 has NEEDEDINFO from the requestor for over a year and should probably be closed, and in any case on the face of it seems to be related to network issues.\n\n\nI've seen some other supposed fixed for this issue around the web:\n\n\"Move the file to be parsed into the same dir as the .jar doing the work\": http://mail-archives.apache.org/mod_mbox/poi-user/201011.mbox/%3C1289246829453-3255661.post@n5.nabble.com%3E . I didn't even want to try this as it seemed so cargo-cultish, but did anyway, and it didn't work.\n\n\"Switch from POIFSFileSystem to NPOIFSFileSystem\": http://stackoverflow.com/questions/13689843/jxl-poi-incompatibility .\nThis sounds promising, but the setup of the POIFSFileSystem object seems to happen sufficiently far down inside the POI call chain that I'm reticent to go poking about blindly in that way.\n\nI got back to the client and found out that the files they're sending are generated with PHPExcel, version 2012-05-19 (v1.7.7).\n\nWe were able to parse these spreadsheets with Perl's Spreadsheet::ParseExcel, but tried to standardise on using POI for efficiency. I didn't want to suddenly refuse to accept them any more without being able to tell the customer exactly what it is that's wrong, so we've fallen back to Ss::PE in the mean time.\n\nNot knowing what's wrong, I don't know if a workaround is appropriate in this case.\n\nIf you could at least tell me in some detail what the problem is though, I'd be happy to go raise the issue with the PHPExcel project.\n\nI've attached as minimal as an example as I can lay my hands on.\n\nBest regards,\n\n--doubi", "count": 0, "id": 167938, "time": "2013-06-20T18:44:13Z", "bug_id": 55124, "creation_time": "2013-06-20T18:44:13Z", "is_private": false}, {"count": 1, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "id": 168071, "time": "2013-06-26T13:22:39Z", "bug_id": 55124, "creation_time": "2013-06-26T13:22:39Z", "is_private": false, "text": "WorkbookFactory will take a NPOIFSFileSystem just as easily as a POIFSFileSystem, so I'd suggest you just switch your code to using the former instead of the latter. With NPOIFSFileSystem I can open your file without issues.\n\nThe POIFSFileSystem has one or two very hard baked assumptions about the file format that are almost, but not quite always correct. I think your file has hit one of those. NPOIFSFileSystem takes a slightly different approach, which avoids this class of problem, and also has the advantage of needing less memory. \n\nThe plan was to switch everything to NPOIFSFileSystem one release after write support was finished in it, but there hasn't been any drive/funding/need of late to complete the write support..."}]