[{"count": 0, "tags": [], "bug_id": 55120, "attachment_id": 30462, "text": "Created attachment 30462\nPatch in PojoMethodMapping\n\nWhen there is ServerEndpoint annotated Pojo with OnOpen method accepting two parameters\n@OnOpen\npublic void onOpen(Session session, EndpointConfig config)\n\nISA is thrown. The case is valid according the javadoc\nhttp://docs.oracle.com/javaee/7/api/javax/websocket/OnOpen.html\n\nThe problem is in the getPathParams of PojoMethodMapping as it considers only Session for valid type that could not have PathParam annotation. When EndpointConfig parameter is checked current implementation require presence of PathParam annotation. Here is the patch and extended test TestPojoEndpointBase case", "id": 167912, "time": "2013-06-19T10:10:35Z", "creator": "nickytd@gmail.com", "creation_time": "2013-06-19T10:10:35Z", "is_private": false}, {"count": 1, "tags": [], "creator": "nickytd@gmail.com", "text": "Actually the problem is bigger. The EndpointConfig parameter is not propagated when the annotated OnOpen method is invoked. There is NPE in buildArgs method of PojoMethodMapping. Here I propose new patch handling both issues and corresponding test case extension.", "id": 167913, "time": "2013-06-19T11:46:55Z", "bug_id": 55120, "creation_time": "2013-06-19T11:46:55Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "nickytd@gmail.com", "text": "Created attachment 30463\nhandling of EndpointConfig param\n\nchanges in PojoEndpointBase PojoMethodMapping and TestPojoEndpointBase to accommodate passing of EndpointConfig parameter in OnOpen annotated method.", "id": 167914, "time": "2013-06-19T11:50:23Z", "bug_id": 55120, "creation_time": "2013-06-19T11:50:23Z", "is_private": false, "attachment_id": 30463}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 167951, "time": "2013-06-20T22:27:51Z", "bug_id": 55120, "creation_time": "2013-06-20T22:27:51Z", "is_private": false, "text": "Thanks for the patch. It has been applied to trunk and will be included in 8.0.0 onwards. I did make a number of changes:\n\n1. I did some refactoring in r1495208 the meant the patch needed some small tweaks.\n\n2. The patch always looked for an EndpointConfig parameter rather than only on OnOpen methods.\n\n3. We always use spaces instead of tabs.\n\n4. I changed a few line breaks.\n\n5. I fixed a typo in a test method name.\n\n6. I amended the test to check that the config was actually passed."}]