[{"text": "Created attachment 30506\nPatch\n\nThis patch enables adding new slide notes into presentations without any notes (where no Notes Master slide and its relations are available). \nIt uses a default Notes Master, the content of which is then imported into newly created notes slides. All new objects are linked accordingly.", "tags": [], "bug_id": 55164, "is_private": false, "count": 0, "id": 168150, "time": "2013-06-30T16:03:33Z", "creator": "jan.tosovsky.cz@gmail.com", "creation_time": "2013-06-30T16:03:33Z", "attachment_id": 30506}, {"count": 1, "tags": [], "creator": "jan.tosovsky.cz@gmail.com", "is_private": false, "text": "A default Notes Master is provided as XML file in the resources folder. It is parsed and then copied completely (using a new constructor) into a new Notes Master object. Actually this template should be replaced with the 'EN' variant (I run on CZ locale).\n\nFor creating Note Slides I am reusing Notes Master content directly as there is no Layout analogy as in case of standard slides.\n\nImportant relation is between the Notes Master and the Theme object as some font properties are required during the processing. For the Notes Master I use the theme of the first slide.\n\nBut I had to use one nasty hack in the XSLFTextParagraph class. It supposes there are text styles defined in the Master, but these are not present in the Notes Master. I haven't found a way how to determine the kind of the Master so I placed another try into the exception fallback. It works, but...\n\nAs there is only one placeholder on the Notes Slide, we could consider placing the following verbose lookup code directly into the Note Slide class and call notesSlide.setNote(\"My Note\") instead.\n\nInputStream is = new FileInputStream(\"D:/test_multi.pptx\");\nXMLSlideShow slideShow = new XMLSlideShow(is);\nfor (XSLFSlide slide : slideShow.getSlides()) {\n    XSLFNotes notesSlide = slideShow.createNotesSlide(slide);\n    for (XSLFTextShape shape : notesSlide.getPlaceholders()) {\n        if (shape.getTextType() == Placeholder.BODY) {\n            shape.setText(\"My Note\\nMy Note\");\n            break;\n        }\n    }\n}            \nFileOutputStream out = new FileOutputStream(\"D:/test_multi_notes.pptx\");\nslideShow.write(out);\nout.close();\n\nI would also prefer renaming XSLFNotes class into XSLFNotesSlide as it confused me many times in the beginning.", "id": 168151, "time": "2013-06-30T16:32:49Z", "bug_id": 55164, "creation_time": "2013-06-30T16:32:49Z", "attachment_id": null}, {"text": "Comment on attachment 30506\nPatch\n\nMy code tested with Office 2003 files fails for files created in version 2010. I suppose it is caused by that injected Notes Master which can contain version dependent content. I'll investigate it later.", "tags": [], "bug_id": 55164, "attachment_id": 30506, "count": 2, "id": 168195, "time": "2013-07-01T19:33:53Z", "creator": "jan.tosovsky.cz@gmail.com", "creation_time": "2013-07-01T19:33:53Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 55164, "text": "Created attachment 30761\nEnhanced patch\n\nThis patch can add new slide notes into a new presentation as well as into the existing one. This functionality is covered by three basic tests.\n\nProblem in Office 2010 was caused by a lower tolerance when reusing the theme. Notes Master has to be linked to the different theme than the slides (but the theme itself can be the same, just with a different name).\n\nSo for the Notes Master, if not already specified, the theme of the first slide is reused (cloned). I don't know if my method is the best. There were no answers:\nhttp://osdir.com/ml/dev-poi.apache.org/2013-08/msg00154.html\n\nThere are also issues in validation tool. They are caused by invalid 'Notes Slide' relations in presentation.xml.rels. They are created automatically. Maybe a new option for such cases will be needed. Discussed here:\nhttp://osdir.com/ml/dev-poi.apache.org/2013-08/msg00155.html\n\nIn two places I work with the index of targetURis (e.g. 2 in /theme2.xml path). For this purpose I created a new helper method in POIXMLRelation class:\npublic Integer getFileNameIndex(POIXMLDocumentPart part)\n\nMost of comments above is still valid.", "id": 169698, "time": "2013-08-25T18:58:41Z", "creator": "jan.tosovsky.cz@gmail.com", "creation_time": "2013-08-25T18:58:41Z", "is_private": false, "attachment_id": 30761}, {"text": "Thank you for the patch - applied with small changes in r1635010\n\nRegarding your two issues, I don't have recent MS-Office version available, but it works ok with Libre Office and the api is also ok - so if problems arise, there will be someone to announce/fix it ;)", "tags": [], "bug_id": 55164, "attachment_id": null, "count": 4, "id": 178804, "time": "2014-10-29T00:16:06Z", "creator": "kiwiwings@apache.org", "creation_time": "2014-10-29T00:16:06Z", "is_private": false}]