[{"count": 0, "tags": [], "bug_id": 55215, "text": "Created attachment 30569\npatch to docs/logging.xml\n\nI decided to make a fresh start with my log4j configuration because it hasn't changed much since tc5. Naturally, I chose http://tomcat.apache.org/tomcat-7.0-doc/logging.html as my starting point.\n\nThe sample configuration seems to suffer from the same kind of problem - log4j was quite picky about syntax in \"the old days\" and so the current version seemd to be worth a spring clean.\n\n1. The File properties cause the \"live\" log files to be created with names that have a trailing dot. Further, as these files are renamed by the Rolling Appender they end up with a double dot in the middle of the new file name.\n\n2. The \"live\" files also acquire an additional \".log\" suffix when Rolled. This is superfluous when the configuration quite sensibly puts all the files into a subdirectory called \"logs\".\n\n3. Following log4j best practices (http://juliusdavies.ca/logging.html), I have extracted three error-prone substrings which are used many times, and defined them at the top of the configuration as local log4j symbolic variables.\n\n4. I have consistently used white space around the property equals signs to improve readability. Some of the older properties did not use white space, while the newer ones did.\n\nThe patch is directed at tc8 trunk, although the generated html sample configuration is a subset of that currently working on my production tc7 system.", "id": 168383, "time": "2013-07-08T17:58:14Z", "creator": "Brian@PingToo.com", "creation_time": "2013-07-08T17:58:14Z", "is_private": false, "attachment_id": 30569}, {"count": 1, "tags": [], "bug_id": 55215, "text": "(In reply to Brian Burch from comment #0)\n> Created attachment 30569 [details]\n> patch to docs/logging.xml\n> \n> I decided to make a fresh start with my log4j configuration because it\n> hasn't changed much since tc5. Naturally, I chose\n> http://tomcat.apache.org/tomcat-7.0-doc/logging.html as my starting point.\n> \n> The sample configuration seems to suffer from the same kind of problem -\n> log4j was quite picky about syntax in \"the old days\" and so the current\n> version seemd to be worth a spring clean.\n> \n> 1. The File properties cause the \"live\" log files to be created with names\n> that have a trailing dot. Further, as these files are renamed by the Rolling\n> Appender they end up with a double dot in the middle of the new file name.\n> \n\nSo it boils down to removing the trailing dot from\nlog4j.appender.CATALINA.File=${catalina.base}/logs/catalina.\nto be\nlog4j.appender.CATALINA.File=${catalina.base}/logs/catalina\n\nand so on, because the dot is already contained in DatePattern property.\n\n> 2. The \"live\" files also acquire an additional \".log\" suffix when Rolled.\n> This is superfluous when the configuration quite sensibly puts all the files\n> into a subdirectory called \"logs\".\n\nI think this should be kept as is.\n\n1). The .log suffix might be needed e.g. to assign mime types when serving those files through HTTP.\n\nIt may be also useful when transferring such files between systems. Some clients automatically do LF<->CRLF according to file types.\n\n2). This configuration is supposed to match the default (JULI) one.\n\n> 3. Following log4j best practices (http://juliusdavies.ca/logging.html), I\n> have extracted three error-prone substrings which are used many times, and\n> defined them at the top of the configuration as local log4j symbolic\n> variables.\n\nInteresting, but I suspect that it will be harder for newbies to read such configuration.\n \n> 4. I have consistently used white space around the property equals signs to\n> improve readability. Some of the older properties did not use white space,\n> while the newer ones did.\n> \n> The patch is directed at tc8 trunk, although the generated html sample\n> configuration is a subset of that currently working on my production tc7\n> system.", "id": 168384, "attachment_id": null, "creator": "knst.kolinko@gmail.com", "creation_time": "2013-07-08T19:55:19Z", "time": "2013-07-08T19:55:19Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 55215, "text": "Thanks for the patch.\n\nI've applied changed 1 & 4 but not 2 & 3 for the reasons Konstantin outlined below.", "id": 168451, "time": "2013-07-10T11:54:19Z", "creator": "markt@apache.org", "creation_time": "2013-07-10T11:54:19Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "When I was working through the install instructions, I was puzzled by the instruction to put the log4j version of tomcat-juli.jar into a directory called bin in ${CATALINA_BASE}. It took me a while to figure out. I checked catalina.properties and confirmed the path was not specified for the common.loader. I then found some relevant comments in class-loader-howto.html. When I looked at the logic in catalina.sh, all became clear.\n\nI suppose a tomcat expert would know about this already, but it might not be so obvious to everyone else. My proposed change would help someone configuring global log4j to see why \"/bin\" is not a typo, understand something important and move on quickly with confidence.", "attachment_id": null, "bug_id": 55215, "id": 168504, "time": "2013-07-11T08:45:58Z", "creator": "Brian@PingToo.com", "creation_time": "2013-07-11T08:45:58Z", "is_private": false}, {"count": 4, "text": "Created attachment 30579\npatch to clarify use of ${CATALINA_BASE}/bin", "bug_id": 55215, "is_private": false, "id": 168505, "time": "2013-07-11T08:48:01Z", "creator": "Brian@PingToo.com", "creation_time": "2013-07-11T08:48:01Z", "tags": [], "attachment_id": 30579}, {"count": 5, "tags": [], "bug_id": 55215, "text": "Further clarificartion added but with different, expanded wording.", "id": 168513, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2013-07-11T15:28:11Z", "time": "2013-07-11T15:28:11Z", "is_private": false}, {"count": 6, "tags": [], "text": "Created attachment 30657\nclarify log4j and AccessLog issues\n\nFollowing Konstantin's explanation of the design of AccessLog, I have linked the various sections of this page, clarified some phrases and added some new information. The intent is to assist readers coming at this subject from any of several directions to not overlook this important exception.", "attachment_id": 30657, "bug_id": 55215, "id": 169019, "time": "2013-08-01T15:36:21Z", "creator": "Brian@PingToo.com", "creation_time": "2013-08-01T15:36:21Z", "is_private": false}, {"count": 7, "text": "Created attachment 30658\nclarify log4j and AccessLog issues", "bug_id": 55215, "is_private": false, "id": 169020, "time": "2013-08-01T15:38:53Z", "creator": "Brian@PingToo.com", "creation_time": "2013-08-01T15:38:53Z", "tags": [], "attachment_id": 30658}, {"count": 8, "text": "Documentation changes to explain log4j not capturing AccessLogValve events. Also, several clarifications and phrasing changes.", "bug_id": 55215, "is_private": false, "id": 169021, "time": "2013-08-01T15:41:26Z", "creator": "Brian@PingToo.com", "creation_time": "2013-08-01T15:41:26Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 55215, "is_private": false, "count": 9, "id": 169791, "time": "2013-08-29T08:29:05Z", "creator": "markt@apache.org", "creation_time": "2013-08-29T08:29:05Z", "text": "Thanks. Patch applied and will be included in 8.0.0-RC2 onwards."}, {"count": 10, "tags": [], "bug_id": 55215, "attachment_id": null, "text": "Documentation patches backported to Tomcat 7 in r1590521 and r1590522 , will be in 7.0.54.", "id": 174911, "time": "2014-04-27T23:27:10Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2014-04-27T23:27:10Z", "is_private": false}]