[{"count": 0, "tags": [], "bug_id": 55213, "text": "Hi, i am able to create sockethubreceiver in my local system and sockethubappender at server side and i am able to view current log files only that are rotating after chainsaw connects to server,\n\nhow to view old log files, please suggest.\n\n-Subbu", "id": 168369, "time": "2013-07-08T03:25:47Z", "creator": "subramanyam.aregala@gmail.com", "creation_time": "2013-07-08T03:25:47Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 55213, "text": "Team, kindly let me know if there is any updates on this, i am not able to see old log files.", "id": 168527, "time": "2013-07-12T01:32:48Z", "creator": "subramanyam.aregala@gmail.com", "creation_time": "2013-07-12T01:32:48Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 55213, "attachment_id": null, "id": 168542, "time": "2013-07-12T07:24:40Z", "creator": "grobmeier@gmail.com", "creation_time": "2013-07-12T07:24:40Z", "is_private": false, "text": "Hi Subbu,\n\nit's usually better if you send your support request to our mailing list first:\nhttp://logging.apache.org/chainsaw/mail-lists.html"}, {"count": 3, "tags": [], "bug_id": 55213, "attachment_id": null, "id": 168569, "time": "2013-07-12T17:58:05Z", "creator": "sdeboy@iname.com", "creation_time": "2013-07-12T17:58:05Z", "is_private": false, "text": "As you mentioned, SocketHubAppender/Receiver are for processing 'live' events.  \n\nThe latest developer snapshot of Chainsaw supports Apache Commons-VFS file systems, which means you can process (and tail) log files accessible via ssh/sftp, and remove the need to use SocketHubAppender and SocketHubReceiver (assuming those log files are accessible via ssh).\n\nHere's how:\nUse the 'File, Load Chainsaw configuration' menu item, select 'process a log file', change the Log file format type to 'PatternLayout format' and provide the patternLayout used by your log file.  Provide the URL to your log file.  If the log file is on a remote server accessible via ssh, use an sftp:// URL.  See the Commons-VFS docs for more info on the format of sftp:// URLs.\n\nCheck the 'always start Chainsaw with this configuration if you'd like, but I would recommend saving the configuration off through the 'save configuration as' button.\n\nApache Commons-VFS and its support for ssh via the SFTP file system: \nhttp://commons.apache.org/proper/commons-vfs/filesystems.html#SFTP\n\nLocation of the latest developer snapshot of Chainsaw:\nhttp://people.apache.org/~sdeboy/\n\nSince this isn't a bug, I'm going to close the issue."}]