[{"count": 0, "tags": [], "bug_id": 55227, "attachment_id": 30573, "id": 168440, "time": "2013-07-09T23:47:01Z", "creator": "m4e35wr02@sneakemail.com", "creation_time": "2013-07-09T23:47:01Z", "is_private": false, "text": "Created attachment 30573\nPatch to fix with unit test.\n\nI found a regression when moving from Ant 1.7.1 to 1.9.1.\n\nIt is common for people with existing JUnit 3 tests to start using JUnit 4 annotations on them.  Once such test uses the @Ignore annotation on the entire test.   Ant 1.7.1 correctly ignores the test class, but 1.9.1 incorrectly runs the class.\n\nI tracked this down to a change done with revision 953761 where, \"You can now specify a list of methods to run in a JUnit test case.\"\n\nLine 408 of the JUnitTestRunner (trunk) has the comment:\n                        // Do not use JUnit 4 API for running JUnit 3.x\n                        // tests - it is not able to run individual test\n                        // methods.\n\nHowever, this would only apply when test methods are specified.   If test methods are not specified, then using the JUNIT_4_TEST_ADAPTER is possible.  In fact, it is preferred since the prior revision used it by default.\n\nA simple patch is attached with a test that will prevent this from happening again."}, {"count": 1, "tags": [], "bug_id": 55227, "attachment_id": null, "text": "This scenario mixes JUnit 3 (extends TestCase) and JUnit 4 (annotations) which isn't valid - the JUnit 3 runner doesn't recognise annotations and the JUnit 4 runner wouldn't run for any class not containing @Test annotations. Our current functionality is consistent with most (possibly all?) IDEs, so I'm proposing closing this as a 'WONT FIX', even though we have a patch that would work round the issue.", "id": 184841, "time": "2015-08-29T11:27:26Z", "creator": "mclarke@apache.org", "creation_time": "2015-08-29T11:27:26Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 55227, "attachment_id": null, "id": 199891, "time": "2017-07-20T14:08:25Z", "creator": "schlm3@gmail.com", "creation_time": "2017-07-20T14:08:25Z", "is_private": false, "text": "Just lost hours of research because of this bug.\nPlease note that it is completely ok to extend TestCase AND use @Ignore. We have a huge Testbase and refactoring it to not extend TestCase will take weeks."}]