[{"count": 0, "tags": [], "creator": "japgolly@gmail.com", "is_private": false, "text": "Hello. I have a Scala Lift application, packaged as a WAR, that expands to the following structure:\n\nfoo.html\nfoo/star.html\nWEB-INF/web.xml\nWEB-INF/classes/...\n...\n\nThe servlet matches against /foo and /foo/xxx differently.\nIf /foo is matched it loads the foo.html resource and transforms it.\nIf /foo/(anything-or-nothing) is matched, it loads the foo/star.html resource and transforms it.\n\nThe problem is Tomcat is seeing that a foo directory exists and redirecting /foo to /foo/ which is breaking Lift's routing rules. I can confirm this by renaming the directory (which fixes Tomcat redirecting but then breaks the app).\n\nIs there a way to tell Tomcat that it's ok, the servlet knows how to process /foo without a trailing slash and can be trusted to do so? Over 2 hours of searching and head-scratching has yielded a 'no' so far, hence this bug.", "id": 168396, "time": "2013-07-09T07:55:58Z", "bug_id": 55220, "creation_time": "2013-07-09T07:55:58Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 55220, "text": "FYI: Seemingly related to bug 32424.", "id": 168397, "time": "2013-07-09T07:57:11Z", "creator": "japgolly@gmail.com", "creation_time": "2013-07-09T07:57:11Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "text": "You need to map your servlet explicitly to /foo else the rules for welcome files will be applied which trigger the redirect to /foo/", "id": 168399, "time": "2013-07-09T08:30:18Z", "bug_id": 55220, "creation_time": "2013-07-09T08:30:18Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "japgolly@gmail.com", "text": "My servlet is mapped to /* so shouldn't that pickup /foo?\n\nWhen you say \"the rules for welcome files will be applied\" can you help me understand where/how that happens? Ideally I'd like a way to disable or preempt those rules in my Tomcat instance. I'm asking because there are many frameworks these days that expect to catch all requests in a single servlet and route internally. This isn't an isolated use case.\n\nIf someone had a large application surely they wouldn't be expected to have to hand-edit their web.xml adding potentially hundreds of lines of explicit URL mappings to the same servlet as /*. That would be a significant deterrent coming from other web servers like Jetty.", "id": 168439, "time": "2013-07-09T23:25:18Z", "bug_id": 55220, "creation_time": "2013-07-09T23:25:18Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 55220, "attachment_id": null, "text": "(In reply to japgolly from comment #3)\n> My servlet is mapped to /* so shouldn't that pickup /foo?\n\nIt depends what other mappings are present. The mapping rules are set out in section 12 of the Servlet 3.0 spec but there are also additional rules for welcome files in section 10.10.\n\n\n> When you say \"the rules for welcome files will be applied\" can you help me\n> understand where/how that happens? Ideally I'd like a way to disable or\n> preempt those rules in my Tomcat instance.\n\nHaving re-read the relevant parts of the spec and Tomcat's source code I think my welcome file suggestion is wrong.\n\nMapping requests to servlets happens in the Mapper fairly early on in the request processing and is defined by the sections of the servlet spec quoted above. There is no way to disable a specific rule short of writing your own Mapper component.\n\n> I'm asking because there are many\n> frameworks these days that expect to catch all requests in a single servlet\n> and route internally. This isn't an isolated use case.\n\nIndeed - which is why this is a little odd. I'd have expected to have seen a lot more complaints.\n\nHaving looked at this again, I don't currently underdstand why you are seeing the behaviour your are given the information you have provided. I can't reproduce it and neither can I see how it might happen by looking at the code.\n\nFor an app with a context path of '/context', a servlet mapped to '/*' and a directory foo the following will happen (see [1] for the code) for a request to /foo:\n\n1. Rule 1 doesn't match since there are no exact matches.\n2. Rule 2 matches since /* matches.\n\nThe redirect from /foo to /foo/ doesn't occur until rule 7.\n\nGiven the behaviour you are seeing there is clearly soemthing else going on. Can you provide the simplest possible test web application that demonstrates this issue?\n\n\n\n[1] http://svn.apache.org/viewvc/tomcat/tc7.0.x/trunk/java/org/apache/tomcat/util/http/mapper/Mapper.java?view=annotate", "id": 168450, "time": "2013-07-10T11:19:59Z", "creator": "markt@apache.org", "creation_time": "2013-07-10T11:19:59Z", "is_private": false}, {"count": 5, "attachment_id": null, "bug_id": 55220, "text": "I have the same problem.\nI am using Tuckey rewriting engine to map my URLs:\n\n\t<rule>\n\t<from>^/?([a-z-/]+)$</from>\n\t\t<to>/$1.xhtml</to>\n\t</rule>", "id": 175015, "time": "2014-05-04T23:27:21Z", "creator": "dwayne.dsouza@gmail.com", "creation_time": "2014-05-04T23:27:21Z", "tags": [], "is_private": false}, {"count": 6, "tags": [], "bug_id": 55220, "text": "I have the same problem.\nI am using Tuckey rewriting engine to map my URLs:\n\n\t<rule>\n\t<from>^/?([a-z-/]+)$</from>\n\t\t<to>/$1.xhtml</to>\n\t</rule>\n\nSo if a user looks at mysite.com/test it gets redirected internally to mysite.com/test.xhtml.\n\nHowever if there is directory called test, Tomcat redirects the user to mysite.com/test/\n\nThis is causing issues when I have query paramaters.\n\ne.g.  mysite.com/test?x=123\nTomcat redirects to mysite.com/test/?x=123\n\nI'm not sure why Tomcat is adding the trailing slash here.", "id": 175016, "time": "2014-05-04T23:33:41Z", "creator": "dwayne.dsouza@gmail.com", "creation_time": "2014-05-04T23:33:41Z", "is_private": false, "attachment_id": null}, {"count": 7, "attachment_id": null, "bug_id": 55220, "text": "(In reply to Deelo from comment #5)\n> I have the same problem.\n\n\nBugzilla is not a support forum. Please ask you question on the Tomcat users mailing list.", "id": 175017, "time": "2014-05-04T23:42:49Z", "creator": "markt@apache.org", "creation_time": "2014-05-04T23:42:49Z", "tags": [], "is_private": false}]