[{"count": 0, "tags": [], "bug_id": 55221, "attachment_id": null, "is_private": false, "id": 168410, "time": "2013-07-09T12:39:48Z", "creator": "s.boshev@gmail.com", "creation_time": "2013-07-09T12:39:48Z", "text": "I am trying to retest the scenario described in bug#55200 after that bug was fixed. Now I can see the session is being silently closed without any notification after several thousands messages were sent. \nI could not find any errors in the logs as well."}, {"count": 1, "tags": [], "text": "I think I found where the problem is. \nThe bug is in WsSession.sendCloseMessage(). \nThis method creates a ByteBuffer with size 125, but the closeReason which is added in this buffer may be way beyond this limit. In such case it will throw BufferOverflowException and cause the handlers not being notified.\nPerhaps the close reason needs to be truncated in order to fit the maximum limit of the buffer.\n\nIn my case the close reason was \"Unable to complete read due to destination buffer overflow. Destination is [8,192] bytes in size and currently contains [0] bytes.\"", "attachment_id": null, "id": 168422, "creator": "s.boshev@gmail.com", "time": "2013-07-09T14:59:56Z", "bug_id": 55221, "creation_time": "2013-07-09T14:59:56Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 55221, "attachment_id": null, "text": "I've fixed the immediate issue in trunk and provided some more information in the message. I'll look into truncating overly long close reasons.", "id": 168434, "time": "2013-07-09T20:22:16Z", "creator": "markt@apache.org", "creation_time": "2013-07-09T20:22:16Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "I've added truncation of the close reason phrase. Any reason > 123 bytes in length (the first two bytes are the clse code) is truncated at a character boundary to 120 characters or less and an ellipsis is appended to indicate that the message has been truncated.", "id": 168435, "time": "2013-07-09T21:02:53Z", "bug_id": 55221, "creation_time": "2013-07-09T21:02:53Z", "attachment_id": null}]