[{"count": 0, "tags": [], "bug_id": 55249, "text": "JspC has a option \"compile\" which determines if the generated .java should be compiled to .class files. This flag is not honoured when a tag file is referenced from a JSP. The generated Java is always generated even if this flag is false.", "id": 168534, "time": "2013-07-12T03:34:27Z", "creator": "jboynes@apache.org", "creation_time": "2013-07-12T03:34:27Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "markt@apache.org", "text": "The report doesn't make much sense (I haven't looked at the source code to try and clarify it). I wouldn't expect a compile flag to control whether or not a .java file is created. Should the last sentence have been \"The generated Java file is always compiled even if this flag is false.\"?", "id": 168690, "time": "2013-07-21T14:48:52Z", "bug_id": 55249, "creation_time": "2013-07-21T14:48:52Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "Sorry, yes it should.\n\nJspC always attempts to compile the Java source generated for tag files even if the \"compile\" option is set \"false\" to indicate that operation should not be performed.\n\nThe call into the Compiler comes a JspServletWrapper:\n  http://svn.apache.org/viewvc/tomcat/trunk/java/org/apache/jasper/servlet/JspServletWrapper.java?view=markup#l240\nthat was created by the TagFileProcessor visiting that node. The value of the \"compile\" option is not available at that point of the code and is not passed in.", "attachment_id": null, "id": 168691, "creator": "jboynes@apache.org", "time": "2013-07-21T15:49:08Z", "bug_id": 55249, "creation_time": "2013-07-21T15:49:08Z", "is_private": false}, {"count": 3, "tags": [], "text": "I took a look at this but the assumption that tag files are compiled runs through a considerable portion of the Jasper code. I started to try and untangle it and got so far (the compilation step, the dependencies) but building the TagHandlerInfo from source is non-trivial. It could be done but I am not convinced it is worth doing.", "attachment_id": null, "id": 170541, "creator": "markt@apache.org", "time": "2013-10-10T14:48:33Z", "bug_id": 55249, "creation_time": "2013-10-10T14:48:33Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 55249, "attachment_id": null, "id": 170556, "time": "2013-10-10T20:49:33Z", "creator": "jboynes@apache.org", "creation_time": "2013-10-10T20:49:33Z", "is_private": false, "text": "Adding context in case anyone looks at this. This seemed like odd behaviour for me for someone using JspC. Better would be if JspC either consistently handled JSP and Tag files - either compiling both or compiling neither.\n\nIf it has to have a compiler to handle the tags, then it could use that to go directly from JSP source to bytecode and eliminate the need to run <javac> after pre-compilation. However, if someone wanted more control over the compilation process (e.g. using a different compiler or combining that step with non-JSP source) then they would want that to apply to both JSP and Tag code."}]