[{"count": 0, "tags": [], "bug_id": 55267, "text": "Did some load test and thread got stuck, see dump.\n\nBasically I just simulate 100 users that connect and disconnect.", "id": 168603, "time": "2013-07-15T11:38:25Z", "creator": "pavel.rekun@gmail.com", "creation_time": "2013-07-15T11:38:25Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "There is no thread dump attached to this issue. The bug will get resolved as INVALID without one.", "attachment_id": null, "id": 168605, "creator": "markt@apache.org", "time": "2013-07-15T12:08:58Z", "bug_id": 55267, "creation_time": "2013-07-15T12:08:58Z", "is_private": false}, {"count": 2, "tags": [], "text": "Created attachment 30595\ndump", "attachment_id": 30595, "id": 168606, "creator": "pavel.rekun@gmail.com", "time": "2013-07-15T12:51:34Z", "bug_id": 55267, "creation_time": "2013-07-15T12:51:34Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 55267, "attachment_id": null, "is_private": false, "id": 168716, "time": "2013-07-22T17:24:04Z", "creator": "markt@apache.org", "creation_time": "2013-07-22T17:24:04Z", "text": "Thanks for the thread dump. I'm going to assume that other information provided elsewhere is unchanged. i.e. the thread is not stuck but configured to use an excessively long timeout of 30 minutes.\n\nI have not been able to recreate this issue - even with a debugger - but I think I have got close enough to figure out what is going on and I believe I have a solution.\n\nI believe the following is happening:\n- Atmosphere is setting a 30 minute timeout for Comet connections\n- That timeout is used to set the socket read/write timeout\n- When the client disconnects Atmosphere closes the comet event\n- That triggers a write to the socket and at this point the timeout is still 30 mins\n- Something about the exact timing and state means that an exception is not thrown\n\nOne could argue several root causes:\n 1 Tomcat should only apply the Comet timeout to reads, not writes\n 2 Atomsphere should reset the timeout once an error occurs\n 3 Tomcat should reset the timeout once an error occurs\n 4 Tomcat should reset the timeout as soon as close is called on the comet event\n\nWe might be able to do something about 1 but 3 and/or 4 look like simpler solutions. Looking at implementing a solution is next on my TODO list."}, {"count": 4, "tags": [], "bug_id": 55267, "text": "Great - waiting for the fix (I'm trying to figure out this issue for months, but it's indeed very hard to replicate locally.)", "id": 168726, "time": "2013-07-23T08:02:57Z", "creator": "pavel.rekun@gmail.com", "creation_time": "2013-07-23T08:02:57Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "text": "I believe I have fixed this in trunk. In the end, option 1 was simpler to implement. You'll need to build from svn to test this. Let us know how you get on. If you still see the problem, feel free to re-open this issue.", "attachment_id": null, "id": 168736, "creator": "markt@apache.org", "time": "2013-07-23T14:28:30Z", "bug_id": 55267, "creation_time": "2013-07-23T14:28:30Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 55267, "attachment_id": null, "is_private": false, "id": 168763, "time": "2013-07-24T15:02:59Z", "creator": "pavel.rekun@gmail.com", "creation_time": "2013-07-24T15:02:59Z", "text": "Great - quick question - can I build and use the tomcat on prod? or do I need to do some optimizations to use the trunk version on prod?"}]