[{"count": 0, "tags": [], "bug_id": 55289, "is_private": false, "text": "Created attachment 30610\nAdjusts the OSGi configuration to prevent it from copying the classes from Log4J.\n\nAlthough it looks like you tried to remove the duplicate classes from Log4J from the extras jar in <a href=\"http://svn.apache.org/viewvc?view=revision&revision=1481778\">commit 1481778</a>, the attempt was unsuccessful.  After poking around I've found that the felix-maven-bundle plugin is still copying in all of the classes from the original Log4J jar.\n\nThis is because the underlying BND tool is trying to unify the split packages between the two different jars.  The enclosed patch will prevent BND from doing this while still behaving properly in an OSGi environment.", "id": 168707, "time": "2013-07-22T00:21:04Z", "creator": "nojspam@losgibsons.us", "creation_time": "2013-07-22T00:21:04Z", "attachment_id": 30610}, {"count": 1, "tags": [], "bug_id": 55289, "text": "The problem is still there. The current download of apache-log4j-extras-1.2.17-src.zip, for example, does not contain the AsyncApender class, but the apache-log4j-extras-1.2.17-bin.zip does.\n\nAnd what's worse, it contains some older version, with a bug from 2002 still not fixed (this one: https://issues.apache.org/bugzilla/show_bug.cgi?id=5932).\n\nI worked it around by compiling it by myself from the source distribution.", "id": 180315, "attachment_id": null, "creator": "a6537691@bofthew.com", "creation_time": "2015-01-16T09:26:03Z", "time": "2015-01-16T09:26:03Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 55289, "attachment_id": null, "id": 180317, "time": "2015-01-16T11:57:13Z", "creator": "jessh@ptc.com", "creation_time": "2015-01-16T11:57:13Z", "is_private": false, "text": "There was a 1.2.17.1 that addressed this issue.\n\nBut it was never officially released.  Looking back at the mail archives it looks like this got 1 vote and then no more because some folk saw failures on 1 automated test on Windows with Java 7.  The thread appears to just fizzle out, rather than anyone getting to the bottom of that 1 test failure and releasing something.  For myself I just use 1.2.17.1 -- released or not.\n\n(In reply to Viliam Anirud from comment #1)\n> The problem is still there. The current download of\n> apache-log4j-extras-1.2.17-src.zip, for example, does not contain the\n> AsyncApender class, but the apache-log4j-extras-1.2.17-bin.zip does.\n> \n> And what's worse, it contains some older version, with a bug from 2002 still\n> not fixed (this one:\n> https://issues.apache.org/bugzilla/show_bug.cgi?id=5932).\n> \n> I worked it around by compiling it by myself from the source distribution."}]