[{"count": 0, "tags": [], "text": "I have an Excel file with dates in them. The internal numeric value can be retrieved correctly, but DateUtil.isCellDateFormatted does not recognize it as a date format.\n\nDebugging, it fails at\n\npublic static boolean isADateFormat(int formatIndex, String formatString) {\n\nwhere formatString is \"reserved-0x1c\"\n\nI could find no good documentation on that format string (and unfortunately cannot share the file in question), but it seems to be a date format used by Chinese versions of Excel.\n\nLibreOffice correctly shows it as a date (but OS X Preview does not -- shows up as a number).", "is_private": false, "id": 168724, "creator": "thilo@cpan.org", "time": "2013-07-23T07:27:05Z", "bug_id": 55295, "creation_time": "2013-07-23T07:27:05Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 55295, "attachment_id": null, "is_private": false, "id": 168728, "time": "2013-07-23T09:15:28Z", "creator": "apache@gagravarr.org", "creation_time": "2013-07-23T09:15:28Z", "text": "Are you able to give us a few examples of the formats it produces?"}, {"count": 2, "tags": [], "creator": "thilo@cpan.org", "attachment_id": null, "text": "The original file (with formatString \"reserved-0x1c\") is a customer file and I cannot share that. \n\nI tried editing it down to cut out everything except the date cells, but it seems that this changed how the dates are being represented. I used Microsoft Excel 2003 on Windows XP (I do not know which version of Windows or Office the original was made with).\n\nI am attaching this edited file anyway, because it does not parse with POI either. It still displays as a date in LibreOffice (07/23/2013) and now also in OS X Preview (as AD2013年7月23日, whereas in the original file it displayed as 41478).", "id": 168729, "time": "2013-07-23T10:13:23Z", "bug_id": 55295, "creation_time": "2013-07-23T10:13:23Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 55295, "attachment_id": 30614, "is_private": false, "id": 168730, "time": "2013-07-23T10:15:34Z", "creator": "thilo@cpan.org", "creation_time": "2013-07-23T10:15:34Z", "text": "Created attachment 30614\nstripped down version of the problematic file, edited with Excel 2003 on XP. Now shows a different behaviour (but still not working properly with POI)."}]