[{"count": 0, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "text": "XSSFTextBox is currently very limited functionality wise compared to TextBoxes in HSSF and XSLF. For example it currently only allows you to set a single paragraph of text (when multiples should be allowed) and provides no functionality for manipulating that paragraph without manually amending the internal structure.\n\nI am implementing enhancements to address this and will upload patches when available.", "id": 168713, "time": "2013-07-22T14:03:53Z", "bug_id": 55292, "creation_time": "2013-07-22T14:03:53Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "attachment_id": 30617, "id": 168734, "time": "2013-07-23T13:24:10Z", "bug_id": 55292, "creation_time": "2013-07-23T13:24:10Z", "is_private": false, "text": "Created attachment 30617\nPatch which implements extended functionality for XSSFTextBox and unit tests for major features\n\nFirst pass at the enhanced XSSFTextBox functionaility.\n\nNote that the new functionlaity does not currently support bullets or hyperlinks. I will look at adding these later. Unit tests have been implemented in TestXSSFDrawing for the major features (text setting/extraction, font and color setting and retrieval). I will look at implementing additional unit tests in time."}, {"count": 2, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "text": "Created attachment 30618\nXlsx test file for the unit tests\n\nLives in test-data/spreadsheet folder.", "id": 168735, "time": "2013-07-23T13:25:52Z", "bug_id": 55292, "creation_time": "2013-07-23T13:25:52Z", "is_private": false, "attachment_id": 30618}, {"count": 3, "tags": [], "creator": "tallison@mitre.org", "attachment_id": null, "is_private": false, "id": 168737, "time": "2013-07-23T14:39:38Z", "bug_id": 55292, "creation_time": "2013-07-23T14:39:38Z", "text": "Darren,\n  Thank you very much for submitting this.  If an experienced committer is willing to back me up, I'd like to take this as my first review+commit.  I should have feedback by tomorrow.\n  This should solve (https://issues.apache.org/jira/browse/TIKA-1100)."}, {"count": 4, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "attachment_id": null, "id": 168738, "time": "2013-07-23T15:06:29Z", "bug_id": 55292, "creation_time": "2013-07-23T15:06:29Z", "is_private": false, "text": "Great, thanks Tim.\n\nThrough further testing in my actual project I have identified a number of other small things that need to be addressed - for example the defaults for a new XSSFSimpleShape set the background to blue which is at odds with Excel (white), and also if you don't explicitly specify the text color then I'm getting it coming through as white by default although I seem to recall seeing this was an issue elsewhere? I'll take a look at them anyway."}, {"count": 5, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "text": "Created attachment 30620\nReplacement patch which tidies up some code and removes redundant style setting in default shape constructor.", "id": 168745, "attachment_id": 30620, "bug_id": 55292, "creation_time": "2013-07-23T20:08:31Z", "time": "2013-07-23T20:08:31Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 55292, "attachment_id": null, "text": "I made a few small cosmetic changes.\n\nIn XSSFTextParagraph what should this javadoc read:\n\n/**\n     * Specifies the particular level text properties that this paragraph will follow.\n     * The value for this attribute formats the text according to the corresponding level\n     * paragraph properties defined in the SlideMaster.\n\nSlideMaster?", "id": 168796, "time": "2013-07-26T00:30:56Z", "creator": "tallison@mitre.org", "creation_time": "2013-07-26T00:30:56Z", "is_private": false}, {"count": 7, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "attachment_id": null, "id": 168798, "time": "2013-07-26T05:32:53Z", "bug_id": 55292, "creation_time": "2013-07-26T05:32:53Z", "is_private": false, "text": "Ah, a remnant from the presentation side. I think this function could be removed at the moment as I believe from the docs that level only has any relevance when it comes to bullets (to determine the style of bullet to use at a given indentation level), and since this enhancement doesn't support bullet properties yet it's a moot point. \n\nIf you could upload your modified patch so I can apply your changes to my copy, I can probably find a few hours over the weekend to look at incorporating the missing bullet functionality."}, {"count": 8, "tags": [], "creator": "tallison@mitre.org", "is_private": false, "id": 168817, "attachment_id": 30632, "bug_id": 55292, "creation_time": "2013-07-26T14:23:28Z", "time": "2013-07-26T14:23:28Z", "text": "Created attachment 30632\nReplacement patch with small mods\n\nOnly a few cosmetic changes.  The initial patch was in great shape!\n\nLet me know which you'd prefer:\nPlan A: You add back in the bullets.  I review and then allow a few days for the community to review it, and then I commit.\nPlan B: We leave until Monday for the community to review the current patch.  I commit that and then you submit a separate issue.\n\nThank you, again, for contributing this."}, {"count": 9, "tags": [], "bug_id": 55292, "attachment_id": null, "text": "No problem, I needed some of it's capabilities for my own project which was my primary driver!\n\nI'm easy, obviously I don't want to hold up any release. Probably the best thing to do is see how I get on over the weekend - naturally I'll merge your patch with my source so I retain your modifications and then if I get round to finishing the bullets I'll upload a new patch for review.\n\nIf not, commit your patch and when the new release is done I'll just have to update and merge my source, generate a new patch and attach it to a new issue for review.", "id": 168823, "time": "2013-07-26T16:30:17Z", "creator": "robertsdjguard-poidev@yahoo.com", "creation_time": "2013-07-26T16:30:17Z", "is_private": false}, {"count": 10, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "attachment_id": 30637, "id": 168854, "time": "2013-07-28T16:14:19Z", "bug_id": 55292, "creation_time": "2013-07-28T16:14:19Z", "is_private": false, "text": "Created attachment 30637\nReplacement patch which includes bullet properties and associated unit test\n\nThis patch has the bullet properties included and a unit test for that functionality. It includes all mods done in attachments 30632.\n\nI have also added a method to XSSFSimpleShape to add a new paragraph from a string (alongside the rich text string it already supported), and updated the XSSFSimpleShape getText method to replicate bullets and autonumbering, along with tabbed indentation for each level. Note that these do not replicate the format of the bullets, the getText method is just a quick way to get all the text in the shape in a semi-representative plain text format. If the developer wants an exact representation they should access the list of paragraphs and manually construct it from them."}, {"count": 11, "tags": [], "text": "Created attachment 30646\ntestAddBulletParagraphs result\n\nExcel is throwing an \"unreadable content; want to recover\" message when I try to open the wb created in testAddBulletParagraphs.  Excel is able to recover, but can you tell what's causing this?  To generate this attachment, I added the following at the end of testAddBulletParagraphs:\n\n try{\n  OutputStream os = new FileOutputStream(new File(\"C:/data/testbullets.xlsx\"));\n  wb.write(os);\n  os.flush();\n  os.close();\n } catch (IOException e){\n  e.printStackTrace();\n }", "attachment_id": 30646, "bug_id": 55292, "id": 168906, "time": "2013-07-29T13:26:02Z", "creator": "tallison@mitre.org", "creation_time": "2013-07-29T13:26:02Z", "is_private": false}, {"count": 12, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "attachment_id": null, "is_private": false, "id": 168910, "time": "2013-07-29T14:38:04Z", "bug_id": 55292, "creation_time": "2013-07-29T14:38:04Z", "text": "(In reply to Tim Allison from comment #11)\n> Created attachment 30646 [details]\n> testAddBulletParagraphs result\n> \n> Excel is throwing an \"unreadable content; want to recover\" message when I\n> try to open the wb created in testAddBulletParagraphs.  Excel is able to\n> recover, but can you tell what's causing this?  To generate this attachment,\n> I added the following at the end of testAddBulletParagraphs:\n> \n>  try{\n>   OutputStream os = new FileOutputStream(new\n> File(\"C:/data/testbullets.xlsx\"));\n>   wb.write(os);\n>   os.flush();\n>   os.close();\n>  } catch (IOException e){\n>   e.printStackTrace();\n>  }\n\nAh, I have been able to figure out what it is that Excel doesn't like - by default in the code when you set a paragraph as a bullet using setBullet(true) it sets a character to use as the bullet, but Excel doesn't like this being defined if you then set the bullet to use auto-numbering. Remove the buChar from the XML for the auto-number bullets and it loads without issue (almost, the arbitrary size text box actually needs to be bigger).\n\nInterestingly the spec makes no mention of the buAutoNum and buChar elements being exclusive, so presumably it is an Excel-ism. LibreOffice Calc loads without complaint, but doesn't appear to support bullets in the textbox (just displays them as normal paragraphs) so that doesn't help as far as testing goes.\n\nSo two options, I can either remove the automatic setting of the buChar (in which case Excel does not display anything, it does not substitutes a value), or set it and remove it if you call setBulletAutoNumbering?"}, {"count": 13, "tags": [], "text": "Created attachment 30647\nReplacement patch which fixes invalid content in unit test output\n\nAdded checks to remove the buChar element if a bullet is set as auto-number which should solve the problem of invalid content when opened with Excel. \n\nAlso fixed unit-test TextBox size so it should now fully contain the content.", "is_private": false, "bug_id": 55292, "id": 168912, "time": "2013-07-29T15:11:34Z", "creator": "robertsdjguard-poidev@yahoo.com", "creation_time": "2013-07-29T15:11:34Z", "attachment_id": 30647}, {"count": 14, "tags": [], "creator": "tallison@mitre.org", "is_private": false, "id": 168914, "attachment_id": null, "bug_id": 55292, "creation_time": "2013-07-29T15:26:56Z", "time": "2013-07-29T15:26:56Z", "text": "Would overriding setBullet like this work:\n\nsetBullet(boolean flag)\nsetBullet(ListAutoNumber scheme)\nsetBullet(ListAutoNumber scheme, int startAt)\n\n\n(In reply to Darren Roberts from comment #13)\n> Created attachment 30647 [details]\n> Replacement patch which fixes invalid content in unit test output\n> \n> Added checks to remove the buChar element if a bullet is set as auto-number\n> which should solve the problem of invalid content when opened with Excel. \n> \n> Also fixed unit-test TextBox size so it should now fully contain the content."}, {"count": 15, "text": "So close.  Thank you for bearing with me.  The numbering in the created xlsx (as interpreted by Excel) differs from the test case:\n\n3. Second bullet (level 1)\n1. Third bullet (level 1)\n\nIs there an easy fix?", "bug_id": 55292, "is_private": false, "id": 168918, "time": "2013-07-29T17:21:41Z", "creator": "tallison@mitre.org", "creation_time": "2013-07-29T17:21:41Z", "tags": [], "attachment_id": null}, {"count": 16, "tags": [], "text": "Not really as there doesn't appear to be any documentation regarding how Excel treats auto-numbering. The OOXML specification for the startAt attribute only say this:\n\nSpecifies the number that starts a given sequence of automatically numbered bullets. When the numbering is alphabetical, the number should map to the appropriate letter. For instance 1 maps to 'a', 2 to 'b' and so on. If the numbers are larger than 26, then multiple letters should be used. For instance 27 should be represented as 'aa' and similarly 53 should be 'aaa'.\n\nEven the MS docs here say nothing more than the specification:\nhttp://msdn.microsoft.com/en-us/library/documentformat.openxml.drawing.autonumberedbullet%28v=office.14%29.aspx\n\nAt the weekend I did a file in Excel that had two bullets at level 1 and on the first bullet I set the startAt as 5. This got me 5 and 6 in Excel which is what you'd expect. When I took a look at the drawing.xml file what it actually had was startAt set on both buAutoNum elements as 5. To my mind, and by the above that means both should be 5. That's the way I implemented the simple shape getText method - if it has startAt set then it sets the starting number for the level as that and increments from there for each following bullet. If the second bullet also has startAt as 5 it will use 5.\n\nI wonder if Excel actually uses the startAt as a linking value, so if all the buAutoNum elements at a given level have startAt as say 5 then they are considered as a releated group and so the first element uses 5, and the rest are incremented. \n\nIf anyone can point me to documentation on how Excel calculates the auto number then that would be great, otherwise I think we're in best guess territory.\n\nWith regards to your previous reply I did respond but it doesn't appear to have gone through. I'm leaning towards overriding setBullet as it seems cleaner, although it does little to actually simplify the problem.", "attachment_id": null, "bug_id": 55292, "id": 168921, "time": "2013-07-29T18:34:00Z", "creator": "robertsdjguard-poidev@yahoo.com", "creation_time": "2013-07-29T18:34:00Z", "is_private": false}, {"count": 17, "tags": [], "text": "Ah, ok. Would it make sense to leave out the setBulletAutoNumber functionality for now?  Someone can add that functionality on a later patch? \n\nI did get your message about overloading setBullet().  I tried the no-thinking process of just replacing setBulletAutoNumber with setBullet(...), and I wasn't getting any numbers out in your test case.", "attachment_id": null, "bug_id": 55292, "id": 168922, "time": "2013-07-29T19:24:28Z", "creator": "tallison@mitre.org", "creation_time": "2013-07-29T19:24:28Z", "is_private": false}, {"count": 18, "tags": [], "text": "But what happens when someone loads a file containing numbered bullets in a TextBox? The other way to look at it is as I said in an earlier response the getText method is a simple way to get the basic text out, for anything more complicated the developer would need to parse the paragraphs manually which means they have the headache of working this out for themselves anyway.\n\nI see no reason to exclude setBulletAutoNumber as that caters to the dev's like me who are creating xlsx files with POI more than reading them. \n\nBut since the current missing piece of information is how Excel calculates the numbers, perhaps in the getText method instead of calulating (guessing) what the number should be then we should just output something identifiable like \"[autonum] bullet text\" or \"? bullet text\". That way we've informed the dev that there should be a number or something there, but it's up to them how to handle it?\n\nIt would be so much easier if the schema just stored the value Excel assigned the bullet, even if it was just a hint... <sigh>", "is_private": false, "bug_id": 55292, "id": 168923, "time": "2013-07-29T19:44:35Z", "creator": "robertsdjguard-poidev@yahoo.com", "creation_time": "2013-07-29T19:44:35Z", "attachment_id": null}, {"count": 19, "tags": [], "creator": "robertsdjguard-poidev@yahoo.com", "attachment_id": null, "id": 168924, "time": "2013-07-29T19:59:10Z", "bug_id": 55292, "creation_time": "2013-07-29T19:59:10Z", "is_private": false, "text": "(In reply to Darren Roberts from comment #18)\n> But what happens when someone loads a file containing numbered bullets in a\n> TextBox? The other way to look at it is as I said in an earlier response the\n> getText method is a simple way to get the basic text out, for anything more\n> complicated the developer would need to parse the paragraphs manually which\n> means they have the headache of working this out for themselves anyway.\n> \n> I see no reason to exclude setBulletAutoNumber as that caters to the dev's\n> like me who are creating xlsx files with POI more than reading them. \n> \n> But since the current missing piece of information is how Excel calculates\n> the numbers, perhaps in the getText method instead of calulating (guessing)\n> what the number should be then we should just output something identifiable\n> like \"[autonum] bullet text\" or \"? bullet text\". That way we've informed the\n> dev that there should be a number or something there, but it's up to them\n> how to handle it?\n> \n> It would be so much easier if the schema just stored the value Excel\n> assigned the bullet, even if it was just a hint... <sigh>\n\nActually, I've just found something online which gives a little bit more information regarding rules for calculating the numbers which actually makes sense of the two startAt=\"5\" elements I saw. I'll try modifying the getText method to use these rules and see if that gets us any closer to Excel."}, {"count": 20, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "is_private": false, "id": 168928, "time": "2013-07-29T21:04:59Z", "bug_id": 55292, "creation_time": "2013-07-29T21:04:59Z", "text": "(In reply to Darren Roberts from comment #16)\n> Even the MS docs here say nothing more than the specification:\n> http://msdn.microsoft.com/en-us/library/documentformat.openxml.drawing.\n> autonumberedbullet%28v=office.14%29.aspx\n\nIf the Microsoft documentation is missing something, the first place is to ask on the relevant Open Specifications Community forum for the document, see <http://www.microsoft.com/openspecifications/en/us/applied-interoperability/support/default.aspx> for the links to the forums\n\nIf that doesn't get an answer in a sensible amount of time, let me know and I'll give you the email address of the docs team and you can ask them directly. (They do check the forums though, so you might well get an answer from there) The Interoperability Specification Team at Microsoft are very keen for their documentation to be complete and useful, so they do want to know if there is a problem or noticable gap in the docs they publish!"}, {"count": 21, "tags": [], "bug_id": 55292, "attachment_id": 30651, "text": "Created attachment 30651\nReplacement patch which implements getText() auto-numbering according to Excel rules\n\nI've implemented the auto-numbering rules I found in a document on the openxmldeveloper.org website and the getText() auto-numbering does now tally now with what I see in Excel 2010.\n\nAlso expanded XSSFSimpleShape getText() so that auto-numbered bullets will now appear according to their type/scheme - so you will get alpha (a,b,c), arabic (1,2,3) or roman (i, ii, iv) along with the various options for brackets and periods. In the case of the wingdings scheme I use the default bullet character since we getText returns a string rather than a rich text string.\n\nNormal bullets will also use the bullet character if it has been explicitly set in the getText() output. \n\nI think this is just about as complete as I can make this function (even if the code isn't pretty). I have contemplated a method on the XSSFTextParagraph which would calculate that paragraphs auto-number (for dev's manually parsing the paragraphs) but I think that can wait and be implemented as a seperate patch.", "id": 168953, "time": "2013-07-30T19:29:52Z", "creator": "robertsdjguard-poidev@yahoo.com", "creation_time": "2013-07-30T19:29:52Z", "is_private": false}, {"count": 22, "tags": [], "text": "> I think this is just about as complete as I can make this function (even if\n> the code isn't pretty). I have contemplated a method on the\n> XSSFTextParagraph which would calculate that paragraphs auto-number (for\n> dev's manually parsing the paragraphs) but I think that can wait and be\n> implemented as a seperate patch.\n\nAlmost forgot, I also implemented the setBullet override.", "is_private": false, "bug_id": 55292, "id": 168954, "time": "2013-07-30T19:30:54Z", "creator": "robertsdjguard-poidev@yahoo.com", "creation_time": "2013-07-30T19:30:54Z", "attachment_id": null}, {"count": 23, "tags": [], "creator": "tallison@mitre.org", "text": "Created attachment 30652\nfinal (?) patch\n\nWow and wow.  This is fantastic.  I made one small change to your code and added one test case.", "id": 168959, "time": "2013-07-31T00:36:11Z", "bug_id": 55292, "creation_time": "2013-07-31T00:36:11Z", "is_private": false, "attachment_id": 30652}, {"count": 24, "tags": [], "creator": "tallison@mitre.org", "attachment_id": null, "id": 168960, "time": "2013-07-31T00:38:24Z", "bug_id": 55292, "creation_time": "2013-07-31T00:38:24Z", "is_private": false, "text": "Committed as of r1508692.  Thank you, Darren!"}, {"count": 25, "tags": [], "bug_id": 55292, "attachment_id": null, "text": "*** Bug 54969 has been marked as a duplicate of this bug. ***", "id": 185021, "time": "2015-09-07T20:09:26Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-09-07T20:09:26Z", "is_private": false}]