[{"count": 0, "attachment_id": null, "bug_id": 55310, "is_private": false, "id": 168800, "time": "2013-07-26T08:08:34Z", "creator": "abishek.bb@gmail.com", "creation_time": "2013-07-26T08:08:34Z", "tags": [], "text": "I am using Asynchronous servlet with Tomcat 7 and also jersey APIs in my \napplication.\n\nI see request body of one request forming a part of other request which happens to be jersey API.\nAnd in turn, the jersey API request becomes a bad request and returns 405.\n\nThis is blocker for my work as I could not use my application.\n\nPlease let me know if there needs to be a configuration change.\n\nOr Please let me know if its a bug in tomcat.\n\nI see similiar bugs reported which say request body exposed in some tomcat versions.  Then I took latest version(7.0.42) where it is fixed.  But I see the issue in that version.\n\nPlease let me know if you need more info."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "In the significant majority of cases this turns out to be an application issue not a Tomcat one. Please debug this on the Tomcat users mailing list.\n\nFeel free to re-open this issue if you reach either of the following points:\n\n- you have a repeatable test case that demonstrates the issue\n\n- you have identified a code path within Tomcat that could lead to request mix-up", "id": 168803, "time": "2013-07-26T08:23:10Z", "bug_id": 55310, "creation_time": "2013-07-26T08:23:10Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "abishek.bb@gmail.com", "text": "(In reply to Mark Thomas from comment #1)\n> In the significant majority of cases this turns out to be an application\n> issue not a Tomcat one. Please debug this on the Tomcat users mailing list.\n> \n> Feel free to re-open this issue if you reach either of the following points:\n> \n> - you have a repeatable test case that demonstrates the issue\n> \n> - you have identified a code path within Tomcat that could lead to request\n> mix-up\n\nThanks Mark.\n\nI will check my application.  I did not get any clue though.\n\nLet me give you more info.\nRequest body of requests using asynchronous servlets are mixing up with jersey API requests.\n\nShould I close request using async servlets somewhere ? No clue whatsoever. Please help me.", "id": 168804, "time": "2013-07-26T08:32:07Z", "bug_id": 55310, "creation_time": "2013-07-26T08:32:07Z", "is_private": false, "attachment_id": null}]