[{"count": 0, "tags": [], "creator": "richard.begg@identity-solutions.com.au", "attachment_id": null, "text": "The getPrincipal(context,username,gssCredential) method in JNDIRealm is designed to allow delegated credentials to be applied to the directory server connection as part of SPNEGO authentication.\n\nThis is done by manipulation of a number of the directory context's environment parameters.\n\nHowever, as currently implemented, these environment parameters are forcibly cleared after the getUser() call regardless of whether the values were even changed (i.e. if isUseDelegatedCredential() returned false).\n\nIf the container realm is defined to use GSSAPI authentication, only the first SPNEGO authentication request will succeed.  All subsequent requests will fail with this exception:\njavax.naming.NamingException: [LDAP: error code 1 - 000004DC: LdapErr: DSID-0C0906DC, comment: In order to perform this operation a successful bind must be completed on the connection., data 0, v1db0 \n\nThe exception is due to the Context.SECURITY_AUTHENTICATION being cleared by getPrincipal() - resulting in a attempted \"simple\" bind with no username/password (i.e. anonymous).\n\nA workaround is to ensure that the connectionName and connectionPassword parameters are specified in the realm definition - however, if one is using GSSAPI - this shouldn't be necessary and certainly defeats the purpose of using GSSAPI in the first place.\n\nThe code should preserve pre-existing environment parameters in the context before changing them, then restore those values afterwards - rather than just clearing the settings completely.", "id": 169098, "time": "2013-08-05T02:53:29Z", "bug_id": 55354, "creation_time": "2013-08-05T02:53:29Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 30671\nPatch to restore context params\n\nHere is a proposed patch for JNDIRealm.java which resolves the issue for me.", "is_private": false, "id": 169099, "creator": "richard.begg@identity-solutions.com.au", "time": "2013-08-05T03:48:51Z", "bug_id": 55354, "creation_time": "2013-08-05T03:48:51Z", "attachment_id": 30671}, {"count": 2, "text": "Thanks for the report and the patch.\nFixed in trunk and 7.0.x and will be included in 7.0.43 onwards.", "creator": "violetagg@apache.org", "attachment_id": null, "id": 169488, "time": "2013-08-16T06:00:23Z", "bug_id": 55354, "creation_time": "2013-08-16T06:00:23Z", "tags": [], "is_private": false}]