[{"count": 0, "tags": [], "text": "Created attachment 30684\nThe test to reproduce the error. The log file.\n\nSee attached a simple jmx file to reproduce the stackoverflow. There is no problem when i start the test in GUI mode. \n\nIn Non-GUI i have the following output.\n\nAn error occurred: null\nerrorlevel=1\nDrücken Sie eine beliebige Taste . . .\n\nHere is how i start the test in Non-GUI mode.\n\njmeter -n -t d:\\development\\workspaces\\2.11.3\\apache-jmeter-latest\\bin\\temp\\stackoverflow\\stackoverflow.jmx -l d:\\development\\workspaces\\2.11.3\\apache-jmeter-latest\\bin\\temp\\stackoverflow\\stackoverflow.jtl -j d:\\development\\workspaces\\2.11.3\\apache-jmeter-latest\\bin\\temp\\stackoverflow\\stackoverflow.log \n\nIn the log (also attached) the last entry is the stacktrace of the java.lang.StackOverflowError.\n\n2013/08/07 10:04:45 FATAL - jmeter.JMeter: An error occurred:  java.lang.StackOverflowError\n\tat java.util.HashMap.containsKey(HashMap.java:335)\n\tat org.apache.jorphan.collections.ListedHashTree.add(ListedHashTree.java:163)\n\tat org.apache.jmeter.control.ModuleController.getReplacementSubTree(ModuleController.java:170)\n\tat org.apache.jmeter.JMeter.convertSubTree(JMeter.java:883)\n\tat org.apache.jmeter.JMeter.convertSubTree(JMeter.java:885)\n\tat org.apache.jmeter.JMeter.convertSubTree(JMeter.java:885)\n...", "is_private": false, "bug_id": 55375, "id": 169218, "time": "2013-08-07T08:18:36Z", "creator": "christopher.roscoe@braintribe.com", "creation_time": "2013-08-07T08:18:36Z", "attachment_id": 30684}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 169220, "time": "2013-08-07T08:36:31Z", "bug_id": 55375, "creation_time": "2013-08-07T08:36:31Z", "is_private": false, "text": "Work-round is to rename the Module Controller so it has a different name from the target controller.\n\nMay perhaps be related to Bug 47165?"}, {"count": 2, "text": "Thanks for the original report and Test Case.\n\nTurned out that the Module Controller (MC) was finding itself rather than the proper target node. Fixed by not allowing the target node to be a Module Controller.\n\n\nURL: http://svn.apache.org/r1511236\nLog:\nStackOverflowError with ModuleController in Non-GUI mode if its name is the same as the target node\nBugzilla Id: 55375\n\nAdded:\n    jmeter/trunk/bin/testfiles/Bug55375.csv   (with props)\n    jmeter/trunk/bin/testfiles/Bug55375.jmx   (with props)\n    jmeter/trunk/bin/testfiles/Bug55375.xml   (with props)\nModified:\n    jmeter/trunk/build.xml\n    jmeter/trunk/src/components/org/apache/jmeter/control/ModuleController.java\n    jmeter/trunk/xdocs/changes.xml", "bug_id": 55375, "attachment_id": null, "id": 169224, "time": "2013-08-07T10:22:49Z", "creator": "sebb@apache.org", "creation_time": "2013-08-07T10:22:49Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "text": "Created attachment 30686\nTest Plan showing another way for issue to occur", "is_private": false, "bug_id": 55375, "id": 169230, "time": "2013-08-07T12:43:32Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2013-08-07T12:43:32Z", "attachment_id": 30686}, {"count": 4, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "is_private": false, "id": 169258, "time": "2013-08-07T14:30:08Z", "bug_id": 55375, "creation_time": "2013-08-07T14:30:08Z", "text": "It's picking the wrong parent controller.\n\nIf you look in the drop-down list in the GUI, there are two instances of the target:\n\nTest Plan > Thread Group > reload\n\nSelecting the second one in the GUI results in a stack overflow error when running the GUI test.\n\nIt looks like the non-GUI code happens to choose the wrong target - correct name, wrong instance.\n\nNote: the Test Plans that are created are identical, so the GUI test must be using additional information to identify the target controller.\n\nNot sure if it makes sense to allow multiple MC targets with the same name.\n\nIf it does, then the JMX file (and drop-down list) will need to contain extra information to identify the instance. It may just be simpler to complain if the Test Plan contains multiple targets with the same name."}, {"count": 5, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": 31131, "id": 171819, "time": "2013-12-18T19:59:39Z", "bug_id": 55375, "creation_time": "2013-12-18T19:59:39Z", "is_private": false, "text": "Created attachment 31131\nPatch proposal to detect recursivity"}, {"count": 6, "tags": [], "text": "The patch effectively converts the stack overflow into an illegal state exception.\nThe benefit is that the message reports the name offending test element (though this may not be unique).\n\nHowever it does not solve the issue that the non-GUI code behaves differently from the GUI code.\n\nIdeally any fix should address the different behaviour and prevent recursive calls.\n\nIf the MC refused to allow multiple controllers with the same name, that should solve the behaviour difference, but it could affect some test plans. Given that at present the non-GUI code does not have sufficient information to choose the correct controller in the case of duplicates, that change is probably acceptable.\n\nThe other issue is that the user may choose a target which is a parent of the MC, causing stack overflow. If controller names must be unique then this should be less likely to occur. Since such targets are useless, ideally they should be excluded from the list. This would need to be done after duplicate checking.", "is_private": false, "bug_id": 55375, "id": 171826, "time": "2013-12-19T02:24:20Z", "creator": "sebb@apache.org", "creation_time": "2013-12-19T02:24:20Z", "attachment_id": null}, {"count": 7, "tags": [], "text": "(In reply to Sebb from comment #6)\n> The patch effectively converts the stack overflow into an illegal state\n> exception.\n> The benefit is that the message reports the name offending test element\n> (though this may not be unique).\nShall I commit it ?\n> \n> However it does not solve the issue that the non-GUI code behaves\n> differently from the GUI code.\n\nIn fact both GUI and Non GUI behave identically except that sometimes GUI picks the first element instead of picking the second one. But if you fix it then you get a StackOverflow.\n> \n> Ideally any fix should address the different behaviour and prevent recursive\n> calls.\n\nFix prevents recursive calls.\n\n> \n> If the MC refused to allow multiple controllers with the same name, that\n> should solve the behaviour difference, but it could affect some test plans.\n> Given that at present the non-GUI code does not have sufficient information\n> to choose the correct controller in the case of duplicates, that change is\n> probably acceptable.\n\nNot sure \n> \n> The other issue is that the user may choose a target which is a parent of\n> the MC, causing stack overflow. If controller names must be unique then this\n> should be less likely to occur. Since such targets are useless, ideally they\n> should be excluded from the list. This would need to be done after duplicate\n> checking.\n\nCould be next step.", "is_private": false, "bug_id": 55375, "id": 171833, "time": "2013-12-19T17:10:53Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2013-12-19T17:10:53Z", "attachment_id": null}, {"count": 8, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 171834, "time": "2013-12-19T17:13:30Z", "bug_id": 55375, "creation_time": "2013-12-19T17:13:30Z", "is_private": false, "text": "To be clear, I think the GUI may have in fact changed the saved reference value of Module Controller. So I suspect another bug in GUI mode which gets confused when there are duplicated."}, {"count": 9, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "is_private": false, "id": 171835, "time": "2013-12-19T18:07:50Z", "bug_id": 55375, "creation_time": "2013-12-19T18:07:50Z", "text": "I don't see any point in applying a temporary fix.\n\nThe GUI seems to remember the correct instance whilst it is active.\ni.e. it will run which ever is selected from the list.\n\nHowever, when the JMX is saved, only the name is stored.\nSo when the JMX is reloaded, it cannot possibly know which one was previously selected.\nThis is a fundamental problem for both GUI and non-GUI test runs.\n\nOne way to fix this is to insist that controller names are unique.\nAnother way would be to store the instance number.\nThis could either be done for every case, or only done where there are multiple matches, or the instance number could default to the first (i.e. only store it if not the first or only instance).\n\nRequiring unique names would be more likely to break existing test plans, as the default names are not unique, so I now think it would be better to store an instance number. Making the instance default to 1 would reduce the number of test plans that needed to be updated. However it would make it more difficult to determine whether the choice was deliberate or accidental, unless the test plan version is also taken into account. So it might be better to insist that the instance number was always saved.\n\nThe question then arises - what should JMeter do if the user adds another controller with the same name after the MC entry has been selected?"}, {"count": 10, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 171841, "time": "2013-12-19T20:58:30Z", "bug_id": 55375, "creation_time": "2013-12-19T20:58:30Z", "is_private": false, "text": "(In reply to Sebb from comment #9)\n> I don't see any point in applying a temporary fix.\nOk, let's wait for a better implementation\n\n> \n> The GUI seems to remember the correct instance whilst it is active.\n> i.e. it will run which ever is selected from the list.\n> \n> However, when the JMX is saved, only the name is stored.\n> So when the JMX is reloaded, it cannot possibly know which one was\n> previously selected.\n> This is a fundamental problem for both GUI and non-GUI test runs.\nOk, that's what I was saying.\n> \n> One way to fix this is to insist that controller names are unique.\n> Another way would be to store the instance number.\n\nMaybe but could be tricky to develop and maintain. \n\n> This could either be done for every case, or only done where there are\n> multiple matches, or the instance number could default to the first (i.e.\n> only store it if not the first or only instance).\n> \n> Requiring unique names would be more likely to break existing test plans, as\n> the default names are not unique, so I now think it would be better to store\n> an instance number. Making the instance default to 1 would reduce the number\n> of test plans that needed to be updated. However it would make it more\n> difficult to determine whether the choice was deliberate or accidental,\n> unless the test plan version is also taken into account. So it might be\n> better to insist that the instance number was always saved.\n> \n> The question then arises - what should JMeter do if the user adds another\n> controller with the same name after the MC entry has been selected?"}, {"count": 11, "text": "*** Bug 57392 has been marked as a duplicate of this bug. ***", "bug_id": 55375, "attachment_id": null, "id": 181093, "time": "2015-02-15T18:00:26Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2015-02-15T18:00:26Z", "tags": [], "is_private": false}]