[{"count": 0, "tags": [], "text": "Hi,\n\nI am using Tomcat 5.5.23 on RHEL5 and I am facing the same issue. The cookie we use is encrypted and looks like:\n\n\"gAAAAQDAgEBAAAAvAIAAAAAAAAsAAAABABTaGRyAk4Aawg4AC4AMQAwABT+Np6GOVSAJB8Qx02==\"\n\nWhen the cookie is retrieved it looses the \"==\" at the end. \n\nWe are also using \nTomcat 4.1.24, Tomcat 6.0.14 on Solaris machines\nTomcat 6.0.2 on Windows \nand the same piece of code is working fine there and the cookie is retrieved correctly. I wanted to know if there is a fix for this in Tomcat 5.5.x version or will I need to upgrade to higher versions of Tomcat. This step is critical in our application.\n\nThank you,\nRS", "attachment_id": null, "id": 169195, "creator": "raginiSingh.2006@gmail.com", "time": "2013-08-06T18:03:25Z", "bug_id": 55371, "creation_time": "2013-08-06T18:03:25Z", "is_private": false}, {"count": 1, "tags": [], "creator": "nicholas@nicholaswilliams.net", "attachment_id": null, "text": "Tomcat 4.1.x is 9 years old and hasn't been supported for years. Any system running it is extremely vulnerable and must upgrade immediately. We cannot help you with it.\n\nTomcat 5.5 is 9 years old and 5.5.23 is 5 years old. Supported ended for the 5.5 line in September of 2012. Any system running it is extremely vulnerable and must upgrade immediately.\n\nTomcat 6.0.2 and 6.0.14 are both 6 years old. Any system running them is extremely vulnerable and must upgrade immediately. The latest Tomcat 6 version is 6.0.37. You should be running it or, better, 7.0.42.\n\nThere have been thousands of bugs fixed since the versions you are using, and the problem you are indicating is likely one of them. Please upgrade.", "id": 169196, "time": "2013-08-06T18:14:10Z", "bug_id": 55371, "creation_time": "2013-08-06T18:14:10Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 55371, "attachment_id": null, "id": 169197, "time": "2013-08-06T18:19:31Z", "creator": "raginiSingh.2006@gmail.com", "creation_time": "2013-08-06T18:19:31Z", "is_private": false, "text": "Thank you Nick for the response. We are in process of upgrade and I was wanting to know which latest version of Tomcat would resolve this issue.\n\nRS"}, {"count": 3, "tags": [], "text": "Your cookie is invalid. The specifications do not permit the equals character in a cookie value unless the value is correctly quoted.\n\nNewer versions of Tomcat support the  org.apache.tomcat.util.http.ServerCookie.ALLOW_EQUALS_IN_VALUE system property but be aware allowing equals characters may introduce security issues.\n\nThe users list is the place to ask if you need more help.", "attachment_id": null, "id": 169198, "creator": "markt@apache.org", "time": "2013-08-06T18:41:50Z", "bug_id": 55371, "creation_time": "2013-08-06T18:41:50Z", "is_private": false}]