[{"count": 0, "tags": [], "text": "The current implemenation of the Manager (at least the GUI) has a design flaw.\n\nActions like undeployment and stop/reload/etc. are performed with a GET request. HTTP standard mandates that unsafe operations should not use a GET. What can happen in such a case (at least for me once in a while)? Undeploy a webapp through Manager GUI, re-deploy through a shell, close browser. Reopen browser, hit that reopened tab, BANG your app gets undeployed again.\n\nSuch operations must be implemented with the Post/Redirect/Get idiom. Since this is a breaking change, it can be introduced in Tomcat 8.", "is_private": false, "bug_id": 55373, "id": 169201, "time": "2013-08-06T19:26:00Z", "creator": "1983-01-06@gmx.net", "creation_time": "2013-08-06T19:26:00Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 55373, "attachment_id": null, "is_private": false, "id": 169202, "time": "2013-08-06T19:27:37Z", "creator": "nicholas@nicholaswilliams.net", "creation_time": "2013-08-06T19:27:37Z", "text": "+1"}, {"count": 2, "tags": [], "text": "The GUI interface (/manager/html) already requires POST for any operation that is not idempotent.\n\nThe text interface (/manager/text) does not enforce this restriction as it easier for automated tools to use GET.\n\nThe use of POST for non-idempotent operations was introduced in Tomcat 7.", "attachment_id": null, "id": 169205, "creation_time": "2013-08-06T20:08:12Z", "time": "2013-08-06T20:08:12Z", "creator": "markt@apache.org", "bug_id": 55373, "is_private": false}, {"count": 3, "tags": [], "bug_id": 55373, "attachment_id": null, "text": "Mark, \n\nthanks for the input. I am coming from Tomcat 6, so I did not know about the changes in the GUI.\n\nAbout the text interface, though it might be easier, it is a violation (imho). Shouldn't we employ a correct standard-compliant implementation?", "id": 169206, "time": "2013-08-06T20:28:14Z", "creator": "1983-01-06@gmx.net", "creation_time": "2013-08-06T20:28:14Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "chris@christopherschultz.net", "text": "While the use of GET for non-idempotent operations may be considered a bad idea, it violates nothing. RFC 2616 uses RFC-SHOULD-NOT verbiage and not RFC-MUST-NOT. Note that HTTP also says that PUT should be idempotent, so switching from GET to PUT changes nothing as far as RFC 2616 is concerned.\n\nWe could invent our own HTTP verbs (which his perfectly valid) but that doesn't seem necessary: you should be using the web (HTML) interface for browsers (which have to make decisions like which resources can be re-retrieved without user confirmation) and a scripting-interface for the /text interface.", "count": 4, "id": 169209, "time": "2013-08-06T22:02:14Z", "bug_id": 55373, "creation_time": "2013-08-06T22:02:14Z", "is_private": false}]