[{"count": 0, "text": "I was asked to raise this as a bug: http://article.gmane.org/gmane.comp.jakarta.poi.user/19987\n\nIssues with the implementation of the text auto fit function\navailable in POI. I have a code snipplet here, where I want that the\noverflow text ( greater than the size of the anchor ) gets resized to a\nsmaller font and fit within the TextBox bounds. However, it doesnt do that.\nBUT if you manually try to resize it, meaning if you try to increase or\ndecrease the size of the textbox by even a very small amount, the text gets\nreduced to the size of the font that it should be, to fit within that text\nbox.\n\n\n\npublic static void main (String[] args) throws FileNotFoundException,\nIOException {\n\n    XMLSlideShow ppt = new XMLSlideShow();\n\n    XSLFSlide slide1 = ppt.createSlide();\n    XSLFTextBox shape1 = slide1.createTextBox();\n    Rectangle anchor = new Rectangle(170, 100, 300, 100);\n    shape1.setAnchor(anchor);\n\n    XSLFTextParagraph p1 = shape1.addNewTextParagraph();\n    XSLFTextRun r1 = p1.addNewTextRun();\n    r1.setText(\"The Apache POI Project's mission is to create and maintain\nJava APIs for manipulating various file formats based upon the Office Open\nXML standards (OOXML) and Microsoft's OLE 2 Compound Document format\n(OLE2). In short, you can read and write MS Excel files using Java. In\naddition, you can read and write MS Word and MS PowerPoint files using\nJava. Apache POI is your Java Excel solution (for Excel 97-2008). We have a\ncomplete API for porting other OOXML and OLE2 formats and welcome others to\nparticipate.OLE2 files include most Microsoft Office files such as XLS,\nDOC, and PPT as well as MFC serialization API based file formats. Office\nOpenXML Format is the new standards based XML file format found in\nMicrosoft Office 2007 and 2008. This includes XLSX, DOCX and PPTX.\nMicrosoft opened the specifications to this format in October 2007. We\nwould welcome contributions.\");\n\n    shape1.setTextAutofit(TextAutofit.NORMAL);\n\n    FileOutputStream out = new FileOutputStream(\"text.pptx\");\n    ppt.write(out);\n    out.close();\n    }", "creator": "apoorva.chaudhari@gmail.com", "attachment_id": null, "id": 169312, "time": "2013-08-08T14:06:50Z", "bug_id": 55391, "creation_time": "2013-08-08T14:06:50Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 55391, "is_private": false, "text": "I encounter the same bug for same things.\n\nIf the PPTX document already contains \"TextAutofit.NORMAL\" (build by PowerPoint option) the rendered PPTX is good but not the PNG from the PPTX.", "id": 170154, "time": "2013-09-18T11:45:51Z", "creator": "isontheline@gmail.com", "creation_time": "2013-09-18T11:45:51Z", "attachment_id": null}]