[{"count": 0, "tags": [], "text": "I am observing that mod_mime sets the mimetype based on the results that mod_negotation returns from a type-map.  I would expect that mod_negotation would force the headers set by the type-map (especially so for mime-type).\n\nSpecific case is for gzipped content.  I.e. my type map \"foo.var\" lists two variants: \"bar.css\" and \"bar.css.gz\"\n\nI observed that \"bar.css.gz\" is being served with a mime-type based on the .gz extension instead of the \"text/css\" explicitly listed in the \"foo.var\" type map.  I would expect that mod_negotation force the \"text/css\" mimetype.\n\nIs this intentional?", "is_private": false, "bug_id": 55431, "id": 169500, "time": "2013-08-16T13:23:37Z", "creator": "wgordonw1@gmail.com", "creation_time": "2013-08-16T13:23:37Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "calestyo@scientia.net", "is_private": false, "text": "First .gz shouldn't be a Content-Type, but a Content-Encoding... check your mod_mime config ;)\n\n\n2nd, isn't this similar/the same than bug #41130?", "id": 169547, "time": "2013-08-18T03:51:52Z", "bug_id": 55431, "creation_time": "2013-08-18T03:51:52Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "wgordonw1@gmail.com", "text": "(In reply to Christoph Anton Mitterer from comment #1)\n> First .gz shouldn't be a Content-Type, but a Content-Encoding... check your\n> mod_mime config ;)\n> \n\n\n\nHrm, yes I guess I suppose so.  However, it appears that \"application/gzip\" or \"application/x-gzip\" is the actual mimetype for gzipped files.  A quick google search turned up this: http://tools.ietf.org/id/draft-levine-application-gzip-03.html  and  this http://en.wikipedia.org/wiki/Gzip  although I realize one source is a draft and the other is wikipedia...\n\nBut this was set automatically on Amazon Linux it seems.\n\nThat aside, the whole point is that it would make the most sense that the Content-Type listed in the type-map takes priority, otherwise, what is the point in listing it anyways?  Since I am explicitly listing a mime-type it would seem that my knowledge of whats in the file should have greater weight than a extension mapping.\n\n\n\n\n> \n> 2nd, isn't this similar/the same than bug #41130?\n\n\nWow, yes.  From 2006...\n\nI guess that means I am overlooking something obvious because nobody has been interested in fixing it for 7 years.  Is the recommended solution here not to have file extensions on the files a type map points to or something?", "id": 169551, "time": "2013-08-18T04:09:03Z", "bug_id": 55431, "creation_time": "2013-08-18T04:09:03Z", "is_private": false, "attachment_id": null}]