[{"count": 0, "text": "Using mod_proxy as a reverse proxy, if a client sends a request with Expect: 100-continue, mod_proxy forwards the Expect header upstream. Even if the upstream server responds with a final status code (e.g. 401 Unauthorized, or 413 Request Entity Too Large) instead of a 100 Continue, mod_proxy continues to send data to the upstream server. If the upstream server closes the connection after sending the final status code, httpd responds to the client with a 502 Bad Gateway message instead of the origin server's final status code.\n\nRFC 2616 (sec. 8.2.3) says that: \n\n>>   If [a server] responds with a final status code, it MAY close\n>>   the transport connection or it MAY continue to read and discard\n>>   the rest of the request.\n\nhttpd does not appear to be doing \"the right thing\" in the event that the origin server closes the upstream connection. If the upstream server continues to consume the request, then httpd will correctly return the final status code.\n\nFurthermore, sec. 8.2.4 says that:\n\n>>   If at any point an error status is received, the client\n>>       - SHOULD NOT continue and\n>>       - SHOULD close the connection if it has not completed sending the request message.\n\nIt seems that mod_proxy is not doing either of these things. And because mod_proxy does not send the final status code from the origin server to the client as it is received, the client also cannot abide by the requirements of 8.2.4.\n\nI've verified this behaviour in the Redhat-supplied httpd 2.2.15, but not in the latest httpd release.", "creator": "jon.abourbih@gmail.com", "is_private": false, "id": 169508, "time": "2013-08-16T16:46:16Z", "bug_id": 55433, "creation_time": "2013-08-16T16:46:16Z", "tags": [], "attachment_id": null}, {"count": 1, "text": "I should clarify a couple of points:\n\n* Apache httpd will only return the final status code if the upstream server consumes the entire request *before* sending its response. If the response is sent before the input stream is consumed, httpd will discard the upstream response and return 502 Bad Gateway.\n\n* httpd returns a 100 Continue immediately to the client when it sees the Expect header, rather than waiting for the upstream server to respond.", "creator": "jon.abourbih@gmail.com", "is_private": false, "id": 169568, "time": "2013-08-19T11:14:27Z", "bug_id": 55433, "creation_time": "2013-08-19T11:14:27Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 55433, "attachment_id": null, "id": 182541, "time": "2015-04-21T20:55:46Z", "creator": "onebrianparker@gmail.com", "creation_time": "2015-04-21T20:55:46Z", "is_private": false, "text": "Seeing this in 2.2.22.  I would be curious for any workarounds.  Thank you!"}, {"count": 3, "tags": [], "creator": "jrwren@xmtp.net", "is_private": false, "text": "I'm experiencing this in 2.4.23 and 2.4.18", "id": 194759, "time": "2016-11-01T17:21:40Z", "bug_id": 55433, "creation_time": "2016-11-01T17:21:40Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 55433, "text": "\n\n*** This bug has been marked as a duplicate of bug 60330 ***", "id": 195123, "time": "2016-11-21T20:25:22Z", "creator": "jim@apache.org", "creation_time": "2016-11-21T20:25:22Z", "is_private": false, "attachment_id": null}]