[{"count": 0, "tags": [], "bug_id": 55443, "is_private": false, "text": "Hi.\n\n\nThere seems to something fishy with the static negotiation algos for languages/mime types etc.\n\nSending\nAccept: image/gif\nwhile having\nfile.png\nfile.jpeg\ncorrectly gives the 406 with the HTML and a list of alternatives\n\nSending\nAccept: image/png, image/jpeg\nwhile having\nfile.png\nfile.jpeg\nthough,\ngives the jpeg (as this is smaller).\n\nWell while this may be reasonable for some people, it breaks standards as one should probably get the 300 mutliple choices.\n\n\nSo apache needs a flag to allow having standards compliant behaviour, i.e. something like ForceLanguagePriority.\n\nBut now,\nhen setting\nForceLanguagePriority none\nwhich should be the default btw, as all others more or less break the RFCs.\none also doesn't get at 300.\n\nE.g. sending\nAccept: en, de\nwhile having\nfile.en.txt\nfile.de.txt\nagain gives the smaller of the two.\nAccept: fr\nwould again give a correct 406\n\nInterestingly, having:\nAccept: fr\nwhile having\nfile.en.txt\nfile.de.txt\nfile.gif\nreturns the GIF... I'm not sure whether this breaks standards,... but definitely sounds like a bad thing.\n\n\nCheers,\nChris.", "id": 169537, "time": "2013-08-17T21:34:19Z", "creator": "calestyo@scientia.net", "creation_time": "2013-08-17T21:34:19Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "text": "(In reply to Christoph Anton Mitterer from comment #0)\n> Hi.\n> \n> \n> There seems to something fishy with the static negotiation algos for\n> languages/mime types etc.\n> \n> Sending\n> Accept: image/gif\n> while having\n> file.png\n> file.jpeg\n> correctly gives the 406 with the HTML and a list of alternatives\n> \n> Sending\n> Accept: image/png, image/jpeg\n> while having\n> file.png\n> file.jpeg\n> though,\n> gives the jpeg (as this is smaller).\n> \n> Well while this may be reasonable for some people, it breaks standards as\n> one should probably get the 300 mutliple choices.\n\nCan you include references to the spec requirements broken here?  From a quick check, mod_negotiation only sends 300s when the browser sends a Negotiate: header (rfc2296), among other conditions.\n\nI could not find anything in 2616 with a requirement or suggestion to do client-driven negotiation / send 300.", "id": 169538, "time": "2013-08-17T22:44:07Z", "bug_id": 55443, "creation_time": "2013-08-17T22:44:07Z", "is_private": false}, {"count": 2, "tags": [], "creator": "calestyo@scientia.net", "attachment_id": null, "text": "Hey Eric...\n\nWell...\n\n1) We definitely have some documentation problem as https://httpd.apache.org/docs/current/mod/mod_negotiation.html#forcelanguagepriority implies 300 would be sent if it is set to None...\nBut actually, what I just found out,... if it is set to None... it will simply not use LanguagePriority but rather fall back to the other steps in the Apache algo (e.g. smalles file, alphabetically first, etc.) if multiple possibilities remain.\n\n\n2) The main idea of this request was: implement some flag, that actually makes Apache give 300's back, if there are multiple choices... i.e. not following the \"Apache algo\"...\n\n\n3) Why breaking the RFC... well I'd simply say the existence of the 300 mutiple choices status already implies that it should be used for that.\nOf course, the reality is that the browsers are broken, e.g. they usually never send \"*\" as an accepted language... thus webservers came along with things like the fallback... and now no one gives up...\nSo I guess you cannot simply drop the \"legacy\" behaviour... but regardless of whether it's a strict RFC breakage or not (respectively whether it \"just\" breaks the intentions of the RFC)... users should at least have the possibility to get the behaviour that if nothing matches what the client explicitly specified as Accept, Accept-Language, etc. ... he'll get at 406 (that already works, well at least for MIME type and language).... and if there are multiple equal matches, a 300.", "id": 169539, "time": "2013-08-17T23:24:55Z", "bug_id": 55443, "creation_time": "2013-08-17T23:24:55Z", "is_private": false}, {"count": 3, "tags": [], "creator": "calestyo@scientia.net", "attachment_id": null, "text": "wrt 1) Wrong documentation about 300s is also found here: https://httpd.apache.org/docs/current/content-negotiation.html#better", "id": 169540, "time": "2013-08-18T00:12:28Z", "bug_id": 55443, "creation_time": "2013-08-18T00:12:28Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 55443, "is_private": false, "text": "(In reply to Christoph Anton Mitterer from comment #3)\n> wrt 1) Wrong documentation about 300s is also found here:\n> https://httpd.apache.org/docs/current/content-negotiation.html#better\n\nYou'll have to elaborate (universal diff is best).  You may also want to split your bug report from the enhancement request.", "id": 169544, "time": "2013-08-18T01:50:52Z", "creator": "covener@gmail.com", "creation_time": "2013-08-18T01:50:52Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 55443, "attachment_id": null, "id": 169545, "time": "2013-08-18T01:54:41Z", "creator": "covener@gmail.com", "creation_time": "2013-08-18T01:54:41Z", "is_private": false, "text": "AFAICT, The format of the 300 response is not defined by HTTP/1.1, so Apache requires that the client signal it understands the subsequent (abandoned?) transparent renegotiation related RFCs.  \n\nI assume that to get someone interested in adding some other mechanism (or output format?) for the 300 response, some more context would be needed to justify/test its usefulness."}, {"count": 6, "tags": [], "bug_id": 55443, "attachment_id": null, "text": "Hey Eric.\n\nWRT to the diffs thingy...  until now I always found it hard to contribute with such minor improvements to the documentation, as you were using SVN, but I just saw there is also a git repo for httpd at Github?\n\nIs someone taking care on pull requests there, and is that kept in sync with SVN?\nThat way it would be much easier to propose you guys some small changes and see whether they got merged without making one big patch to the documentation,.. which may in the end be rejected.", "id": 169554, "time": "2013-08-18T15:58:28Z", "creator": "calestyo@scientia.net", "creation_time": "2013-08-18T15:58:28Z", "is_private": false}]