[{"count": 0, "text": "Hi.\n\nIn it's current status, type-maps seem to work like the following:\nif I have a type map, named foo.var, then browsers MUST access it as foo.var to get anything done at all (i.e. negotiation).\nAccessing the resource as just \"foo\" (as all the documentation here https://httpd.apache.org/docs/current/content-negotiation.html and https://httpd.apache.org/docs/current/mod/mod_negotiation.html seem to imply it would work) seems to cause nothing but 404 errors... but when accessing \"foo.var\" the negotiation kicks in.\n\nThis is highly ugly though (and I guess that's one of the tow major reasons, why type-maps aren't used much), since nobody wants to have all his resource URIs (and thus links) ending in \".var\".\n\n\nSo please make type-maps behave as MultiViews, i.e. if \"foo\" doesn't exist, but a foo.<something>, for which type-map is the handler, let it kick in.\n\n\nFurther, it should be possible to have foo.var used by the server for negotiation, but not served, e.g. I'd like to be able to say something like\n<Files ?*.var>\nDeny from all\n</File>\nbut still having negotiation work when I access foo (for which foo.var, and e.g. foo.svg, foo.png, foo.gif) exist.\n\n\nCheers,\nChris.", "bug_id": 55447, "attachment_id": null, "id": 169560, "time": "2013-08-18T23:11:53Z", "creator": "calestyo@scientia.net", "creation_time": "2013-08-18T23:11:53Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 55447, "text": "> In it's current status, type-maps seem to work like the following:\n> if I have a type map, named foo.var, then browsers MUST access it as foo.var\n> to get anything done at all (i.e. negotiation).\n\n1)\n\nThe browser can access /foo if other apache configuration maps the URI to the .var file (alias, rewrite, multiviews, ...)\n\nChanging this PR to an enhancement since this request is the bulk of the issue.  This would not seem to be a backportable change in behavior.\n\n2)\nThe doc for type map negotiation under question:\n\n\"A request for document.html in this directory will result in document.html.var being consulted, and the variant chosen which most closely matches the language preference specified in the user's Accept-Language request header.\"\n\nI think think this is referring to using multiviews to find the .var file, but this only happens by default on 1.3, or in later releases with MultiviewsMatch Any\"", "id": 169561, "time": "2013-08-19T00:14:12Z", "creator": "covener@gmail.com", "creation_time": "2013-08-19T00:14:12Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "\n> I think think this is referring to using multiviews to find the .var file,\n> but this only happens by default on 1.3, or in later releases with\n> MultiviewsMatch Any\"\n\n\"handlers\" is sufficient", "attachment_id": null, "bug_id": 55447, "id": 169562, "time": "2013-08-19T00:19:41Z", "creator": "covener@gmail.com", "creation_time": "2013-08-19T00:19:41Z", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 55447, "text": "Hi.\n\nWell first... let's keep this as an enhancement as you proposed...\n\n\nThe ways you suggested me now, rather seems like workarounds,... since one will always want to get access via foo and not via some other path.... so it seems reasonable that mod_negotiate by itself does already everything necessary.\n\n- Alias is IMHO not really a solution if at all, only AliasMatch... as that's the whole point IMHO about the type-maps => not having the need to change the webserver config.\n\n- both rewrite and AliasMatch, seem to be rather error prone ways IMHO...\n\n- I do not quite understand how it should work with MultiViews... tried that, but it produced ambiguous results... and AFAIU. Perhaps the MultiViewsMatch thingy was missing for that.\n\n\n\nIn prciniple MultiViewsMatch handlers comes close to a real solution of the problem, but:\n- AFAIU, it will accept all handlers,... which can lead to unexpected side effects\n- it will still include NegotiatedOnly, so \"normal\" MutliViews are still in place and again, could lead to side effects.\n\n\n\nCheers,\nChris.", "id": 169563, "time": "2013-08-19T00:30:46Z", "creator": "calestyo@scientia.net", "creation_time": "2013-08-19T00:30:46Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 55447, "attachment_id": null, "text": "trunk and 2.4 doc updated http://svn.apache.org/viewvc?view=revision&revision=r1515245 to require multiviews/multiviews match to go from document.html to document.html.var", "id": 169564, "time": "2013-08-19T00:33:25Z", "creator": "covener@gmail.com", "creation_time": "2013-08-19T00:33:25Z", "is_private": false}]