[{"count": 0, "attachment_id": null, "creator": "billricardi@gmail.com", "is_private": false, "id": 169900, "time": "2013-09-04T15:22:11Z", "bug_id": 55522, "creation_time": "2013-09-04T15:22:11Z", "tags": [], "text": "Preface: Ladies and gentlemen of the Apache JMeter open source community, thank you for taking the time to read my enhancement request! It is an honor to be using such a robust and well cared for product. You should all be proud of the work you've done.\n\n\nBackground: When having to specify a Proxy Setting that is used when JMeter makes HTTP or HTTPS requests itself (User Manual, section 2.4.2), four different command line specifications need to be specified (in one way or another): --proxyHost, --proxyPort, --username, and --password.\n\n\nIssue: This kind of command line specification has two potential impacts. One impact is on the level of Usability. The other impact is on the level of Security. I will explain these impacts individually.\n\n\nUsability Impact: Your typical user in a corporate setting often has to deal with a corporate proxy server. If one simply follows the start up guide ( http://jmeter.apache.org/usermanual/get-started.html#proxy_server ), the method of accomplishing this is clear. However, anything that involves repetitive extra typing and reference to a separate text file (as modification to a batch file has security implications, see next section) tends to turn off corporate and casual users (no citation available, only my 18 years of observation in an IT/Test environment).\n\nUsability might be improved if these functions could be configured within the GUI, in such a way that the user feels secure about entering and saving such information (see next section regarding options like Hash/Salt). Broader understanding and adoption by trainees in the corporate environment might encourage test departments and organizations to adopt JMeter over the likes of HP and Soasta performance offerings.\n\n\nSecurity Impact: If your typical user simply followed the start up guide ( http://jmeter.apache.org/usermanual/get-started.html#proxy_server ), the command line method of entering these proxy settings might open them up to an unexpected insecurity. If a novice user enters the --proxyHost, --proxyPort, --username, and --password parameters in a fresh CMD shell referencing the jmeter.bat file, they might not notice that the shell is sitting in the background displaying their network and/or proxy username and password to passers-by. There are workarounds to this issue; however a secure GUI interface obviates the need for workarounds by providing a safe bastion to enter this sensitive information.\n\nThere are many potential forms that such a secure data entry method might take. It might be a pop up that you can request that encrypts the proxy and login information in memory and never stores it to disk at all. Or it might encompass a Save feature that includes a salted hash of this information. Or any number of interface options that provide a more secure medium than (worst case) a command line window displaying the information in clear text as the jmeter.bat file runs.\n\n\nConclusion: I rely on the JMeter open source community to determine the exact execution of a GUI solution to the above issues and impacts. They will know far better than I what is practical an realistic, while maintaining look, fell, and theme. A secure, non-command-line option that is documented in the Getting Started guide would seem to tick all of the right boxes, insofar as my particular enhancement request is concerned. I hope that this fully articulates the enhancement request, and I extend my gratitude in advance to any efforts put forth to fulfill my humble inquiry."}, {"count": 1, "tags": [], "creator": "sebb@apache.org", "attachment_id": null, "id": 170054, "time": "2013-09-11T22:35:28Z", "bug_id": 55522, "creation_time": "2013-09-11T22:35:28Z", "is_private": false, "text": "The proxy settings can be defined on the HTTP Request Defaults GUI screen, as well as on individual HTTP Request samplers."}]