[{"count": 0, "tags": [], "text": "Created attachment 30822\nPatch for RemoteIpValve.java\n\nI've created a patch for org.apache.catalina.valves.RemoteIpValve which will allow configuring the Valve to set requests as secure based on the protocolHeader and protocolHeaderHttpsValue when RemoteAddr is the actual IP for the client and not a known Proxy.\n\nThis is useful when having a transparent SSL termination proxy which is only setting an x-forwarded-proto header and is not changing RemoteAddr or adding an x-forwarded-for header.", "attachment_id": 30822, "id": 170057, "creator": "knut@ytterhaug.com", "time": "2013-09-12T07:50:04Z", "bug_id": 55553, "creation_time": "2013-09-12T07:50:04Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 55553, "attachment_id": null, "id": 170058, "time": "2013-09-12T09:20:02Z", "creator": "markt@apache.org", "creation_time": "2013-09-12T09:20:02Z", "is_private": false, "text": "In that case why can't you just set secure on the connector?"}, {"count": 2, "tags": [], "bug_id": 55553, "text": "We need our tomcats to be able to serve the same content both on http and https and would like our applications to be able to use request.isSecure() to handle redirects etc accordingly.", "id": 170060, "time": "2013-09-12T10:07:53Z", "creator": "knut@ytterhaug.com", "creation_time": "2013-09-12T10:07:53Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 55553, "text": "Then the solution is to configure two http connectors on separate ports: one for direct http traffic and one for http traffic that has been processed by the transparent proxy.\n\nIf you want the http and https requests to share a common thread pool then an executor can be configured.\n\nThe proposed patch would result in the the valve processing headers when no trusted proxy had been configured and I am concerned that some users may be caught out by this and end up with an insecure configuration - even if this behavior is documented.", "id": 170062, "time": "2013-09-12T10:25:37Z", "creator": "markt@apache.org", "creation_time": "2013-09-12T10:25:37Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 55553, "text": "Thanks for the quick answers. Unfortunately (for us) we're unable to configure using different connectors depending on if it's been processed or not.\n\nWould a patch adding a boolean property making the valve process headers when no trusted proxy had been configured be considered?", "id": 170063, "time": "2013-09-12T10:43:31Z", "creator": "knut@ytterhaug.com", "creation_time": "2013-09-12T10:43:31Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "(In reply to Knut Ytterhaug from comment #4)\n> Thanks for the quick answers. Unfortunately (for us) we're unable to\n> configure using different connectors depending on if it's been processed or\n> not.\n>\n> Would a patch adding a boolean property making the valve process headers\n> when no trusted proxy had been configured be considered?\n\nUnlikely.\n\nAs an aside, any changes to the Valve need to mirrored to the Filter.\n\nThe users list is the best place to figure out a solution that works for you. I'd be surprised if one wasn't available with existing configuration. Saying which proxy you are using would help.", "id": 170064, "time": "2013-09-12T10:48:54Z", "bug_id": 55553, "creation_time": "2013-09-12T10:48:54Z", "is_private": false}]