[{"count": 0, "tags": [], "bug_id": 55581, "attachment_id": null, "is_private": false, "id": 170207, "time": "2013-09-22T01:05:20Z", "creator": "ezyang@mit.edu", "creation_time": "2013-09-22T01:05:20Z", "text": "Currently, it appears that mod_fcgid's behavior when receiving a request is to take a FastCGI process out of the pool, send it the request, and then put the process back in the pool. While the request is being serviced, the application is not available for other requests. If mod_fcgid notices that there are no more processes left, it will spin up new processes.\n\nThis is not good behavior when the process is multithreaded, and can handle concurrent requests. In such cases, mod_fcgid should *not* spawn new processes, and just concurrently deliver them to the existing process. This allows the server in the backend to take advantage of shared resources. Obviously this should be configurable.\n\nHere is an example of another user who wants this functionality: http://stackoverflow.com/questions/15623422/mod-fcgid-multithreaded-fastcgi-now-or-in-a-planned-future\n\nI would just like to get confirmation that this is indeed a enhancement the core developers would take; our team is considering implementing this for our own needs."}, {"count": 1, "tags": [], "text": "Have you considered mod_proxy_fcgi in httpd 2.4?  It doesn't yet support Unix sockets in the 2.4.x branch.  You have to manage the application processes but you can have multiple simultaneous connections.\n.\nAcceptance of a patch to let mod_fcgid route multiple requests to the same process would presumably depend mostly on how clean the new feature could be added as well as the generality to multiple uses cases.", "attachment_id": null, "id": 170214, "creator": "trawick@apache.org", "time": "2013-09-22T14:02:21Z", "bug_id": 55581, "creation_time": "2013-09-22T14:02:21Z", "is_private": false}, {"count": 2, "tags": [], "text": "We have, and you've pointed out the two reasons we don't want to use mod_proxy_fcgi: (A) it doesn't support Unix domain sockets (a big problem when you are trying to host multiple websites and don't want to coordinate port assignments to the idling servers), and (B) it does not manage the processes for you, which is a big win from mod_fcgid.", "attachment_id": null, "id": 170215, "creator": "ezyang@mit.edu", "time": "2013-09-22T14:05:04Z", "bug_id": 55581, "creation_time": "2013-09-22T14:05:04Z", "is_private": false}]