[{"count": 0, "tags": [], "bug_id": 55618, "text": "Hi,\n\nI'm looking at the Tomcat 8.0.0-RC3 release and trying to make sure that our product (ZeroTurnaround's JRebel) still works nicely against it.\n\nWhile testing out framework integrations, I came across an issue with JBoss Seam 2 (present for all 2.0, 2.1 and 2.2). Yes, sorry, of course you are not Seam support forum, but I have reasons to believe that the error I'm getting is a symptom of some sort of a regression in Tomcat 8 as compared to Tomcat 7.. something not specific to Seam, although I cannot put my finger on it right now.\n\nThe application I'm attaching is basically our integration test that we run for numerous containers. It is a very simple maven build.. you'll get it deployed in 60 seconds. Yes, Seam is mainly meant to be run on JBoss itself, but it has been running quite well across a whole bunch of containers. This application works in our integration test suite against numerous webspheres, glassfishes, weblogics, etc, and also on various versions of Tomcat 6.x and 7.x. If you run it on Tomcat 8 RC3, you'll get\n\n/../\n\n02-Oct-2013 15:30:09.879 WARNING [localhost-startStop-2] org.jboss.seam.jsf.SeamPhaseListener.<init> There should only be one Seam phase listener per application\n\n/../\n\n\n02-Oct-2013 15:30:12.539 WARNING [http-nio-8080-exec-2] org.jboss.seam.jsf.SeamPhaseListener.afterPhase uncaught exception, passing to exception handler\n java.lang.IllegalStateException: No phase id bound to current thread (make sure you do not have two SeamPhaseListener instances installed)\n\tat org.jboss.seam.contexts.PageContext.getPhaseId(PageContext.java:163)\n        ...\n\n\nIt is a Seam-specific error that happens quite typically (if you google for it).. when people forget 2 seam libraries into the classpath or something like that. In current case, you can obviously see that there is just 1 seam library in classpath.\n\nYes this is just a symptom, but I have a feeling that something in the way classes get loaded or in your class loader hierarchies is .. at least not how it used to be. Maybe your implementation is 100% compatible with the JEE spec and maybe just Seam guys are taking advantage of something non-standard. But.. maybe not, as this application is not suffering from this issue in 20+ other web containers we test against in our company.\n\nI'd be happy if you could take a quick look into this or at least give me some hint where to start from... have you changed something in the way classes get loaded since tomcat 7? (Read changelog, didn't find much). Thanks if you can look into this! :)", "id": 170383, "time": "2013-10-02T12:57:30Z", "creator": "sander.sonajalg@gmail.com", "creation_time": "2013-10-02T12:57:30Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "sander.sonajalg@gmail.com", "text": "Created attachment 30900\nmaven seam2.2 test app that fails on request to \"/\" on tomcat 8 rc3", "id": 170384, "time": "2013-10-02T12:58:12Z", "bug_id": 55618, "creation_time": "2013-10-02T12:58:12Z", "is_private": false, "attachment_id": 30900}, {"count": 2, "tags": [], "bug_id": 55618, "is_private": false, "text": "I haven't looked at this yet but what are the chances that you are seeing a double initialization because the library ships with an ServletContainerInitializer that does one init and the web.xml has configured a ServletContextListener that attempts to do a second init?", "id": 170385, "time": "2013-10-02T13:11:51Z", "creator": "markt@apache.org", "creation_time": "2013-10-02T13:11:51Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "sander.sonajalg@gmail.com", "text": "Hi,\nThanks for suggestion,\nThis is indeed possible, but would this also explain the different behavior on Tomcat8-RC3 vs Tomcat 7.x? This same app is okay elsewhere.\n\nSander.", "id": 170386, "time": "2013-10-02T13:21:21Z", "bug_id": 55618, "creation_time": "2013-10-02T13:21:21Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Tomcat 8 has refactored the SCI discovery process.", "is_private": false, "bug_id": 55618, "id": 170387, "time": "2013-10-02T13:26:59Z", "creator": "markt@apache.org", "creation_time": "2013-10-02T13:26:59Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "sander.sonajalg@gmail.com", "text": "Hi,\nyeah that sounds like a possible explanation.. I'll look into this. Thanks!", "id": 170388, "time": "2013-10-02T13:40:49Z", "bug_id": 55618, "creation_time": "2013-10-02T13:40:49Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "text": "Hi,\nI'm now quite sure that it is the <listener> definition in web.xml. I'll do some more research.. it seems that tomcat 6.x/7.x detected the duplicate Listener instance and didn't execute it, while tomcat 8.x starts a duplicate Listener (I'm far from being competent enough here to say which approach is more desired.. you probably know it better). I'll test some more on my own... I just hope that the situation is not that old containers *require* <listener> element to be there and new ones *require it not to be there*, which would lead to a backwards compatibility problem. I'll research some more ..\n\nThanks!", "is_private": false, "id": 170414, "creator": "sander.sonajalg@gmail.com", "time": "2013-10-04T15:18:08Z", "bug_id": 55618, "creation_time": "2013-10-04T15:18:08Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 55618, "is_private": false, "text": "This is the change that caused this:\nhttp://svn.apache.org/viewvc?view=revision&revision=1492307\n\nPrior to this change, duplicate listeners with the same name were ignored. Now, only duplicate instances are ignored.\n\nArguably, no duplicates should be ignored. The specification discusses how duplicates should be handled when merging fragments but makes no comment on deliberate duplicate listener definition (e.g. same listener twice in web.xml, listener once in web.xml and once via an SCI)", "id": 170415, "time": "2013-10-04T16:35:56Z", "creator": "markt@apache.org", "creation_time": "2013-10-04T16:35:56Z", "attachment_id": null}, {"count": 8, "tags": [], "text": "Then there's the fun case where your application behaves completely differently based upon which (maximum) version of the servlet spec your container supports. No annotation support? Then you need to use web.xml. Uses Tomcat 8's SCI strategy? Need to remove from web.xml. Want to deploy anywhere? Forget it.\n\nI really think the servlet EG made a terrible mistake when they didn't let the deployment descriptor (i.g. web.xml) direct the features that would be available/enabled for a webapp. </soapbox>", "is_private": false, "id": 170416, "creator": "chris@christopherschultz.net", "time": "2013-10-04T18:54:36Z", "bug_id": 55618, "creation_time": "2013-10-04T18:54:36Z", "attachment_id": null}, {"count": 9, "tags": [], "text": "(In reply to Mark Thomas from comment #7)\n> This is the change that caused this:\n> http://svn.apache.org/viewvc?view=revision&revision=1492307\n> \n> Prior to this change, duplicate listeners with the same name were ignored.\n> Now, only duplicate instances are ignored.\n\nWould it be worth logging a warning when the behaviour is different from before?", "is_private": false, "id": 170420, "creator": "sebb@apache.org", "time": "2013-10-04T20:13:11Z", "bug_id": 55618, "creation_time": "2013-10-04T20:13:11Z", "attachment_id": null}]