[{"count": 0, "tags": [], "creator": "racezhang@gmail.com", "attachment_id": null, "id": 170406, "time": "2013-10-03T16:51:16Z", "bug_id": 55623, "creation_time": "2013-10-03T16:51:16Z", "is_private": false, "text": "Hi all,\n\nI was using JMeter for a while, but found JMeter does not handle misconfiguration well in many cases.\n\nSpecifically, when users provide a wrong configuration option and JMeter produces a wrong result (or crashes), JMeter should explicitly dump error message pointing to the mis-configured option, rather than failing silently, or dumping stack traces, or simply restoring to the default behavior.\n\nI have found many places in JMeter which can be improved, to give users better experience.\n\nAs a very simple example, JMeter permits users to specify the output file format via: \"jmeter.save.saveservice.output_format\"   option (the legal values can be \"xml\" or \"csv\").\n\nHowever, if a careless user types \"jmeter.save.saveservice.output_format = xxxml\" or other unsupported file format, JMeter will automatically restore to using \"CSV\" format without notifying users that they provide a wrong configuration option value. This occurs to me a few times, and makes me really confused.\n\nI believe such places should be further improved to make JMeter more user-friendly.\n\nI found a couple of such places. and wondering whether JMeter developers would like to know them, and how do you think about such \"mis-handling\"?\n\nThanks\n\n-Sai"}, {"attachment_id": null, "tags": [], "bug_id": 55623, "is_private": false, "count": 1, "id": 170412, "time": "2013-10-04T14:11:43Z", "creator": "sebb@apache.org", "creation_time": "2013-10-04T14:11:43Z", "text": "If there are other configuration items where you consider JMeter does not handle invalid/unexpected input gracefully, please document them in Bugzilla.\n\nWe cannot promise to fix them all, but they will be considered and fixed as appropriate.\n\nNote that it may not always be possible to change the behaviour as it could affect existing installations. In such cases however, a warning (or error) message can be logged."}, {"count": 2, "tags": [], "bug_id": 55623, "attachment_id": null, "id": 170413, "creation_time": "2013-10-04T14:43:42Z", "time": "2013-10-04T14:43:42Z", "creator": "sebb@apache.org", "text": "URL: http://svn.apache.org/r1529171\nLog:\nInvalid/unexpected configuration values should not be silently ignored\nLog warning for jmeter.save.saveservice.output_format\nBugzilla Id: 55623\n\nModified:\n    jmeter/trunk/src/core/org/apache/jmeter/samplers/SampleSaveConfiguration.java\n    jmeter/trunk/xdocs/changes.xml", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 55623, "text": "Date: Sun Mar 23 14:10:47 2014\nNew Revision: 1580502\n\nURL: http://svn.apache.org/r1580502\nLog:\nBug 55623 - Invalid/unexpected configuration values should not be silently ignored\nBugzilla Id: 55623\n\nModified:\n    jmeter/trunk/src/core/org/apache/jmeter/util/JMeterUtils.java", "id": 174031, "time": "2014-03-23T14:11:58Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2014-03-23T14:11:58Z", "tags": [], "is_private": false}]