[{"count": 0, "tags": [], "bug_id": 55674, "attachment_id": null, "text": "ThreadLocal memory leak detection code is fine, but when it tries to clean-up ThreadLocal maps, it prints something like this in catalina.out:\n\nOct 18, 2013 2:32:59 PM org.apache.catalina.loader.WebappClassLoader checkThreadLocalMapForLeaks\nSEVERE: The web application [/...] created a ThreadLocal with key of type [...] (value [...]) and a value of type [java.text.SimpleDateFormat] (value [java.text.SimpleDateFormat@6b2ed43a]) but failed to remove it when the web application was stopped. Threads are going to be renewed over time to try and avoid a probable memory leak.\n\nNow, if the object contained in the ThreadLocal is very big and the toString method dumps all the data of that object, log could become very huge. Eg, in our application, we store a big HashMap in ThreadLocal and the trace above is about 700Mb because it recursively calls toString methods of all objects contained in the map.\n\nIs it necessary to log values contained in ThreadLocal maps during clean-up process?\nAdditionaly, log level for that message is set to SEVERE and there's no way to specify logging details for that message.", "id": 170683, "time": "2013-10-18T21:53:00Z", "creator": "ugo.scaiella@gmail.com", "creation_time": "2013-10-18T21:53:00Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 55674, "attachment_id": null, "text": "The attribute names and values are logged to assist with the identification of the cause of the memory leak.\n\nMemory leaks are logged at SEVERE as they represent a serious bug that could eventually lead to an OOME. Tomcat's leak detection and prevention code should reduce the chances of an OOME but it may not eliminate it.\n\nSince neither the severity level nor the use of toString() is going to change, I am resolving this as WONTFIX.\n\nThat said, there is a long standing enhancement request (bug 50715) to modify the leak detection code so the warnings are skipped / logged at a lower level when the leaks don't matter (e.g. when the JVM is shutting down).\n\nSome recent work on a unrelated issue means I have some useful info to add to that bug so I'll do that shortly. I'll add 50715 to my TODO list as the features it requires are likely to be useful elsewhere.", "id": 170688, "time": "2013-10-19T09:58:59Z", "creator": "markt@apache.org", "creation_time": "2013-10-19T09:58:59Z", "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 170689, "time": "2013-10-19T09:59:47Z", "bug_id": 55674, "creation_time": "2013-10-19T09:59:47Z", "is_private": false, "text": "Whoops, I mean bug 50175."}]