[{"count": 0, "tags": [], "text": "Upon graceful restart the CGI processes get forcefully killed before they end and you don't get the output to the browser.\n\nWhat is the setup:\n\nCentOS 6.4 x86_64 minimal installation\nmod_fcgid.x86_64 2.3.7-1.el6 \nhttpd.x86_64 1:2.2.15-29.el6.vm.1\nphp.x86_64 5.3.3-23.el6_4\n\nSingle virtual domain, running under mod_fcgid execution mode, with 90 sec PHP execution time and fcgid IO wait.\n\nSingle test.php file containing (just sleep loop):\n\n<?php\nfor($i = 1; $i <= 30; $i++) {\n    echo $i.\"\\n\";\n    sleep(1);\n    file_put_contents(\"test.txt\", \"test run for: \".$i.\" seconds\");\n}\n?>\n\nWhat is the error:\n\nRun the script via browser, then go and do a graceful restart on Apache (service httpd graceful). After around 12 seconds you are going to see \"No data received\" error in you browser (Chrome) and the following in the Apache error log:\n\n(22)Invalid argument: mod_fcgid: can't lock process table in pid [some_pid]\n\nExamining test.txt shows that this script gets forcefully killed before ending.\n\nIf you reduce the time the script executes to 5 seconds ($i <= 4), you'll get the same result, this time after 5 seconds.\n\nExamining test.txt shows this process completes, but you still get the errors both in the browser and the error log.\n\nSo why 12 seconds and where is this set. After some time I discovered that increasing FcgidErrorScanInterval to 60 will let the process with 30 sec loop to complete (but still you get the errors).\n\nThe error in the log \"can't lock process table in pid...\" probably means that some information about the process is destroyed immediately upon the graceful restart (I assume it is something with the mutex).\n\nEven if we get around the early termination of the processes increasing FcgidErrorScanInterval the second problem is actually bigger - the script output never gets back.", "is_private": false, "id": 170792, "creator": "georgi.petrov@seocreativebrain.com", "time": "2013-10-24T10:12:14Z", "bug_id": 55698, "creation_time": "2013-10-24T10:12:14Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "creator": "tom@webdrive.co.nz", "is_private": false, "id": 177125, "time": "2014-08-13T04:39:07Z", "bug_id": 55698, "creation_time": "2014-08-13T04:39:07Z", "tags": [], "text": "Has there been any progress on this?"}]