[{"count": 0, "text": "Created attachment 30958\ntomcat request parsing bug\n\nHello.\n\nFrom time to time we see that Tomcat can't properly parse parameters from request. That's kind of a big annoying bug, cause we can't find any essential reason for such bug to appear.\nI have a screen for proovements.", "creator": "johnny90b@mail.ru", "attachment_id": 30958, "id": 170772, "time": "2013-10-23T16:21:40Z", "bug_id": 55695, "creation_time": "2013-10-23T16:21:40Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "That is an application generated error message (even if it is using Tomcat's default 400 response page).\n\nThe the error is application generate suggests that the bug is an application bug too,=.\n\nAbsent any evidence that this is a Tomcat bug, I am closing this as invalid.", "is_private": false, "id": 170774, "creator": "markt@apache.org", "time": "2013-10-23T16:26:56Z", "bug_id": 55695, "creation_time": "2013-10-23T16:26:56Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 55695, "attachment_id": null, "id": 170790, "time": "2013-10-24T06:50:30Z", "creator": "johnny90b@mail.ru", "creation_time": "2013-10-24T06:50:30Z", "is_private": false, "text": "Do you really think that it could be a bug in application?\n\nI don't think so. We are using Spring framework, but the bug appears in spring controllers and in tipycal servlets..\n\nCorrect me pls, if I'm not right, but, for example,  when the client send GET-request to the server, the application receives the HttpServletRequest, parsed first of all by tomcat engine (i don't really know how it's doing it), and then only, in case of spring controller there could be later changes in HttpServletRequest. I suppose that spring can do nothing that is able to clear some parameters that are present in request object.\n\nThe most strange fact about that story is that after refreshing the page (read - sending the request again) nothing bad happens. The request proceeds correctly.\n\nThere is no any logic in application connected with filling ServletRequest object's parameters by parsing the request.\nAlso, we didn't define any special settings for tomcat, which can influence on how it processes the request.\n\nIt's a pity, if it's really the bug in application, cause we don't have any idea about where it could come from and when :("}, {"count": 3, "tags": [], "bug_id": 55695, "text": "There is nothing in the bug report that suggests a Tomcat bug. You have an error message that is not Tomcat-related (\"required String parameter 'code' is not present\"). Spring is a part of your application, not Tomcat. So yes, this is an application problem.\n\nSpring or any other component in your web application can, in fact, modify the request (at least from the perspective of the code running in your web application). Just because you can see the parameter \"code\" in your URL and your application is saying that \"code\" is not in the request doesn't mean that Tomcat is doing something wrong. Perhaps your application (or Spring?) is not reading the value properly. Perhaps the value is not properly-formatted (e.g. it looks like it could be encrypted, but maybe it's broken) and the error message is not good (i.e. problem is value-format not value-missing).", "id": 170805, "time": "2013-10-24T12:35:46Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-10-24T12:35:46Z", "is_private": false, "attachment_id": null}]