[{"count": 0, "tags": [], "bug_id": 55703, "attachment_id": null, "text": "http://tomcat.apache.org/tomcat-7.0-doc/jndi-resources-howto.html#Generic_JavaBean_Resources\n\nIn this page of the Tomcat 7 documentation - but this is true for all versions - there is the following statement:\n\n\"The resource factory will create a new instance of the appropriate bean class every time a lookup() for this entry is made.\"\n\nBut that seems not true. I created an example foo.bar.Bean, which simply increment a static int at each creation. Then, I configured a BeanFactory in the global resources section of server.xml, and I deployed a servlet which simply lookup 1000 thousand times for the bean and print its string representation in the response. \n\nTo reproduce, follow the steps below using the targz attached:\n\n1) configure a resource with a BeanFactory, as in the server.xml attached;\n2) put the bean-factory-bug-bean.jar in the common classpath of the container;\n3) start the container;\n4) deploy the bean-factory-bug-web.war file in the appbase folder;\n5) open http://localhost:8080/bean-factory-bug-web/BeanServlet\n\nAs for one can read from the documentation, the expected output is \n\nBean #1\nBean #2\nBean #3\n...\nBean #999\nBean #1000\n\nBut the actual output is\n\nBean #1\nBean #1\nBean #1\n...\nBean #1\nBean #1\n\nI think that the actual behaviour of the container is the most advisable behaviour, but would be better to update the documentation to match it and avoid misleading.\n\nThanks.\n\nGiulio Quaresima (Ph.D) - Perugia - Italy", "id": 170836, "time": "2013-10-25T11:50:00Z", "creator": "giulio.quaresima@gmail.com", "creation_time": "2013-10-25T11:50:00Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 55703, "text": "Created attachment 30969\nserver.xml and the test classes in maven format", "id": 170837, "time": "2013-10-25T11:51:33Z", "creator": "giulio.quaresima@gmail.com", "creation_time": "2013-10-25T11:51:33Z", "is_private": false, "attachment_id": 30969}, {"count": 2, "tags": [], "bug_id": 55703, "text": "This behavior is controlled by the singleton attribute of the factory. The default is to create singleton resources as that is what users expect even though the J2EE spec suggests that a new object should be created on each lookup.\n\nI'll go through the JNDI docs and expand any statements like the one you quote below so that the full picture is available.", "id": 170907, "time": "2013-10-29T14:14:56Z", "creator": "markt@apache.org", "creation_time": "2013-10-29T14:14:56Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 55703, "attachment_id": null, "id": 170909, "time": "2013-10-29T14:32:05Z", "creator": "giulio.quaresima@gmail.com", "creation_time": "2013-10-29T14:32:05Z", "is_private": false, "text": "OK, this is true for Tomcat 7 but it's not, as I can see, for the still supported 6.x version.\n\nMoreover, I think it would be better to mention the 'singleton' option also in the documentation page I refer to, in order do avoid misunderstanding.\n\nThanks\n\n(In reply to Mark Thomas from comment #2)\n> This behavior is controlled by the singleton attribute of the factory. The\n> default is to create singleton resources as that is what users expect even\n> though the J2EE spec suggests that a new object should be created on each\n> lookup.\n> \n> I'll go through the JNDI docs and expand any statements like the one you\n> quote below so that the full picture is available."}, {"count": 4, "tags": [], "bug_id": 55703, "attachment_id": null, "id": 170910, "time": "2013-10-29T14:36:17Z", "creator": "markt@apache.org", "creation_time": "2013-10-29T14:36:17Z", "is_private": false, "text": "JNDI how-to updated in 7.0.x for 7.0.48 onwards and 8.0.x for 8.0.0-RC6 onwards."}]