[{"count": 0, "attachment_id": 30972, "bug_id": 55708, "is_private": false, "id": 170848, "time": "2013-10-25T19:42:10Z", "creator": "pierre.boudreau@t4g.com", "creation_time": "2013-10-25T19:42:10Z", "tags": [], "text": "Created attachment 30972\nScreen shot of Visual Studio debugging the crash dump\n\nEnvironment:\n-Windows Server 2003 R2 SP2\n-Running in a VMWare VM with 4 Intel Xeon CPUs @2.00Ghz with 3.8 GB of RAM\n-See attached manifest.txt and appcompat.txt from one of the crash dumps for a listing of the applications and libraries running at the time of the crash.\n\nError as seen in the Windows Application Event Viewer:\nFaulting application httpd.exe, version 2.2.22.0, faulting module msvcrt.dll, version 7.0.3790.3959, fault address 0x00027d70.\n\nProblem description and analysis:\nUnder load, we are experiencing access violation errors in msvcrt.dll running under the Apache httpd.exe process.  Analysis of two heap dumps that have been collected from two different servers running the same application shows that the access violation happens in calls to the getenv() function on line 184 of util_script.c.  These are rare occurrences in the order of one in many thousands of calls.  In both the heap dumps that we have collected, the call is exactly the same.\ngetenv(“PATH”).\n\nAttached are two screen shots of Visual Studio debugging each of the crash dumps we have analyzed.  The line of code highlighted is the last line of httpd code before it falls into the msvcrt library.   This is where the call to getenv(“PATH”) is made.\n\nThe access violation happens two calls deeper inside msvcrt.dll in __getenv_lk() as seen in the call stack in the bottom right of the screen shots.\n\nWhat we see leads us to believe that there must be some kind of race condition or something that is somehow not thread safe in that function that results in an access violation in some rare cases.  We have reproduced the error in a test environment.  It happened once in a 1.5 hour test at a sustained rate of close to 1000 hits per second on the Apache httpd server.  It has also happened in our production environment at a lower load of around 100 hits per second.  Under that load, it can run for several days before we see an occurrence of it.\n\nIn both cases, the request were quite different from one another.  They were both requests that Apache passes through to back end servers via mod_jk.  In one case the backend server is a Tomcat 7 instance and in the other case it is an entirely other application running in JBoss 4.3.  And both those requests are successful most of the time, so it doesn't look like the crash is specific to any particular type of request.  But I wouldn't rule out that mod_jk is somehow involved since it does appear in the call stack of the crash dump.\n\nSome thoughts:\nIs the getenv() function being called supposed to be thread safe?\nShould the code calling it be locking around it if it isn't thread safe?\n\nI can provide the crash dump files for analysis privately."}]