[{"count": 0, "tags": [], "text": "Created attachment 31026\nPPT Slideshow with single molfile embedded\n\nI have attached the code used for this prototype and both files although one is an empty ppt file which is pointless.  The file of interest is a mol file which is readable from accelerys draw version 4.1 (You may be able to d/l and install a trial of this software).  The object created from accelerys is called a mol file which is a representation of a molecule.  If you copy the mol file and paste it into a ppt slideshow it creates a ole object in the ppt file.  I have also attached(no I haven't only one attachement allowed) some java code which is based on PoiOleXlsInPpt a proof of concept out on the internet at \nhttp://stackoverflow.com/questions/2849102/embedding-hssfexcel-into-hslfppt-using-apache-poi/16879830#16879830.\nThe code uses an ppt/mol file and creates a new ppt and then attempts to create the ole object using poi's internals to embed the mol file and saves the new ppt file.  Based on our work with the code, the ppt file gets created, but then when trying to open the saved file with ppt. the application complains that the ppt file is corrupt and tries to repair but can't manange to repair the file and can't open the file.  So the ppt slideshow gets created but then can't be opened by ppt which suggests some is incorrect in the creation of the new file. Of course this use case works without a problem when the code which embeds the ole object is commented out.  So there's something in the embedding code which is not creating the object properly. Thanks.  I was going to try and attach the code but it doesn't look like multiple attachments are allowed so you got the ppt slideshow with a molfile embedded in it. I can provide our code if it makes things easier but I'm just trying to create a new ppt ss with the molfile embedded in it much like a copy and paste would do in windoze.  My real work is to get the molefile and embed into ppt but I can do that if we can just fix the issue with embedding the molefile into ppt. I can provide any additional info if needed.  Andreas Beeker was helping me on the user group and this bug is reported based on his suggestion.", "attachment_id": 31026, "id": 171123, "creation_time": "2013-11-07T15:40:05Z", "time": "2013-11-07T15:40:05Z", "creator": "petera@deltasoftinc.com", "bug_id": 55758, "is_private": false}, {"count": 1, "tags": [], "bug_id": 55758, "attachment_id": 31076, "text": "Created attachment 31076\nOLE-implementation for Accelrys Draw .mol-file embedding\n\nThe attachment contains a c# project to process a .mol file and generated\nthe neccessary ole object to be embedded by the also included java class.\n\nAn Accelrys Draw (AD) ole objects contains two streams.\n1. \"Contents\": the bigger one, which is a concatenation of the following formats:\n   - a mol-file\n   - a skc-file\n   - a mol-file, an ASCII-file, same as the 1st file, but with a line\n     length (byte) as first char of the line\n   - a emf-file\n   - a wmf-file\n   each file is prefixed with little endian integer, which specifies the file length\n2. \"\\1Ole10Native\": a \"malformed\" Ole10Native object, which is a subset of the\n   Contents stream\n\nas it works out, it's enough to embed the Contents stream\n\nIn the trial version, AD provides a few .net libraries and\nJNI-Bridge consisting out of jar and two dlls. Although it's\npossible to produce a few files of the mentioned above with\nthe bridge, it lacks emf/wmf support. There's a function\nto copy data to and from the clipboard, which has the format \nof the contents stream, but it's not working.\n\nAfter a bit of decompiling of the .net and .jar files,\nI've started a small workaround c# project and it became visible\nthat the clipboard function always throws a \"coinitialize hasn't\nbeen called\" error, no matter if I called coinitialize manually\nor tweaked around the appartment model of the calling code.\nThe other functions work as designed.\n\nSo finally the solution is that c# helper, which generates the\ncontents stream and an emf preview image, and the embedding code\nbased on #55579.\n\nIt took a bit until the ensemble worked on Peters environment,\nso in the rare case, that anybody else uses this code ;) ...\nyou might need to change the .net dll references and/or copy\nvarious AD dlls to the local working dir.\n\nAs for the POI part this is only a very specific test, I'll\n(try to) close this bug as \"won't fix\"", "id": 171440, "time": "2013-11-25T22:32:45Z", "creator": "kiwiwings@apache.org", "creation_time": "2013-11-25T22:32:45Z", "is_private": false}]