[{"count": 0, "tags": [], "bug_id": 55798, "text": "", "id": 171329, "time": "2013-11-19T23:03:23Z", "creator": "bjchip@computer.org", "creation_time": "2013-11-19T23:03:23Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "bjchip@computer.org", "attachment_id": null, "text": "Using Ubuntu 12.04 and Sun Java (so installed Java and Tomcat by hand) - this was required because another app requires the Sun Java.  Did NOT do this with the default Ubuntu installer. \n\nTomcat is installed in /usr/local/apache-tomcat-7.0.47  Java is the latest from Oracle-Sun.  \n\nThe following is the problem.  \n\n1.  In server.xml the \n\n<Resource name=\"UserDatabase\" auth=\"Container\"\n              type=\"org.apache.catalina.UserDatabase\"\n              description=\"User database that can be updated and saved\"\n              factory=\"org.apache.catalina.users.MemoryUserDatabaseFactory\"\n              pathname=\"conf/tomcat-users.xml\" />\n\n- had to be changed to - \n\n<Resource name=\"UserDatabase\" auth=\"Container\"\n              type=\"org.apache.catalina.UserDatabase\"\n              description=\"User database that can be updated and saved\"\n              factory=\"org.apache.catalina.users.MemoryUserDatabaseFactory\"\n              pathname=\"/usr/local/apache-tomcat-7.0.47/conf/tomcat-users.xml\" />\n\nWhere a softlink was used ( CATALINA_HOME=/usr/local/tomcat ) and tomcat is the softlink to /usr/local/apache-tomcat-7.0.47 - giving this line  \n\n       pathname=\"/usr/local/apache-tomcat-7.0.47/conf/tomcat-users.xml\"\n\n  it also failed. \n\nThe failure is simply a repetition of the request for authentication.  Nothing actually wrong with that part of the process.  I am curious what sort of debugging might enable a check of the login processing itself as enabling debug  down to \"fine\" still left me with no information that the file was not being found. \n\nThis was discovered by trial and educated guesswork. There is no indication in the doc that it should be looked at. \n\nA wide range of useless information is out there on the web now, as a lot of people have this problem in some form.  My tomcat-users.xml  (when it finally worked) looks like this:  \n\n<role rolename=\"manager\"/>\n<role rolename=\"manager-gui\"/>\n<role rolename=\"admin-gui\"/>\n<role rolename=\"admin-script\"/>\n<role rolename=\"manager-script\"/>\n<role rolename=\"manager-xml\"/>\n<role rolename=\"manager-status\"/>\n\n  <role rolename=\"tomcat\"/>\n  <role rolename=\"role1\"/>\n  <user username=\"tomcat\" password=\"tomcat\" roles=\"tomcat\"/>\n  <user username=\"both\" password=\"tomcat\" roles=\"tomcat,role1\"/>\n  <user username=\"role1\" password=\"tomcat\" roles=\"role1\"/>\n  <user username=\"admin\" password=\"tomcat\" roles=\"tomcat,manager,manager-gui,manager-status,manager-xml,manager-script,admin-gui,admin-script\"/>\n\n\nI have no doubt that a lot of that can be pruned away. \n\nThe process in the manual, no matter how carefully followed, does not result in a working login for the manager.  \n\nThere may be something more to this.  I currently have started tomcat as \"root\" which troubles me... but I haven't gotten to the security doc yet and there is no discussion I've seen that says that manager won't work if you start as \"root\" either. \n\nrespectfully \nBJ", "id": 171331, "time": "2013-11-19T23:33:54Z", "bug_id": 55798, "creation_time": "2013-11-19T23:33:54Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 55798, "text": "As I expected, using the documented roles only does work properly. \n\n<role rolename=\"manager-gui\"/>\n<role rolename=\"manager-script\"/>\n<role rolename=\"manager-xml\"/>\n<role rolename=\"manager-status\"/>\n\n\n  <role rolename=\"tomcat\"/>\n  <role rolename=\"role1\"/>\n  <user username=\"tomcat\" password=\"tomcat\" roles=\"tomcat\"/>\n  <user username=\"both\" password=\"tomcat\" roles=\"tomcat,role1\"/>\n  <user username=\"role1\" password=\"tomcat\" roles=\"role1\"/>\n  <user username=\"admin\" password=\"tomcat\" roles=\"manager-gui,manager-status\"/>\n\n\n The issue is solely with the ability to access the file in the first instance, with the pathname in server.xml not being correct in some way.  This is almost sure to be linux version, Java version,  user or shell dependent, as it would not have been \"incorrect\" as written.  The fact that it did not follow links surprises and suggests that it has to do with the identity starting tomcat.  If root it may not behave... but as an ordinary user it did not start.  \n\nSome sort of discussion of this (if it is the case) would be a useful hint to someone looking at the document but not able to reach the manager page.  \n\nrespectfully \nBJ", "id": 171332, "time": "2013-11-19T23:56:38Z", "creator": "bjchip@computer.org", "creation_time": "2013-11-19T23:56:38Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 55798, "is_private": false, "id": 171339, "attachment_id": null, "creator": "knst.kolinko@gmail.com", "creation_time": "2013-11-20T07:19:44Z", "time": "2013-11-20T07:19:44Z", "text": "(In reply to BJ Chippindale from comment #1)\n> \n> 1.  In server.xml the \n> \n> <Resource name=\"UserDatabase\" auth=\"Container\"\n>               type=\"org.apache.catalina.UserDatabase\"\n>               description=\"User database that can be updated and saved\"\n>               factory=\"org.apache.catalina.users.MemoryUserDatabaseFactory\"\n>               pathname=\"conf/tomcat-users.xml\" />\n> \n> - had to be changed to - \n> \n> <Resource name=\"UserDatabase\" auth=\"Container\"\n>               type=\"org.apache.catalina.UserDatabase\"\n>               description=\"User database that can be updated and saved\"\n>               factory=\"org.apache.catalina.users.MemoryUserDatabaseFactory\"\n>              \n> pathname=\"/usr/local/apache-tomcat-7.0.47/conf/tomcat-users.xml\" />\n> \n\nThere is no need for such a change. When the value of the pathname attribute is a relative path, it is interpreted as relative to ${catalina.base}.\n\nThe code is in org.apache.catalina.users.MemoryUserDatabase#open().\n\nI am keeping this issue open, as I think the open() method may be improved to log a message when the file is missing.  It may be a warning if(this.readonly==true) and an info message otherwise.\n\nCurrently it just returns silently.\n\n>\n> A wide range of useless information is out there on the web now,\n\nhttp://tomcat.apache.org/findhelp.html\nhttp://tomcat.apache.org/lists.html#tomcat-users\n\n>  If root it may not behave... but as an ordinary user it did not start. \n>\n\nA tip in advance: Do not forget to apply \"chown\" to all log and temporary files that were created when you started Tomcat as root. Those are in $CATALINA_BASE/logs and $CATALINA_BASE/work.\n\nIf those are not accessible, things will go wrong. And if log files are not writable, you will get no logging.\n\nIf you have further questions, ask on the mailing list."}, {"count": 4, "tags": [], "bug_id": 55798, "is_private": false, "id": 171343, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2013-11-20T10:12:49Z", "time": "2013-11-20T10:12:49Z", "text": "I logged it as an error since failing to find the file is an issue that really needs to be fixed but is not fatal."}, {"count": 5, "tags": [], "bug_id": 55798, "attachment_id": null, "is_private": false, "id": 171431, "time": "2013-11-24T20:08:17Z", "creator": "bjchip@computer.org", "creation_time": "2013-11-24T20:08:17Z", "text": "Gentlemen\n\nI know you may THINK I made a mistake here, but in the configuration I listed here the execution did not follow the $CATALINA_BASE with the softlink when starting as root.  \n\nThere are other configurations I have not checked and do not now care about as I have other problems of my own to fix.  This is/was a sideshow, and it is quite certainly minor as I noted, but there is room for improvement in the document, not the software.   It needs to give some further clues, either a link to a separate section about what to look at when things go wrong or a brief paragraph outlining the places to go looking. \n\nThe problem is that the documentation which does NOT help find a problem of this nature nor provide any indications.  I followed the instructions QUITE exactly, and varied them rationally more than a dozen times before isolating this path issue.  This wasted a large amount of very valuable time and THAT is what good documents can avoid.  \n\nI note  that I chown'd everything in the process. I checked the simple things.   Everything WAS accessible. Logs were being written.  I followed the manual. \n\nThe fact that this file isn't discovered on an attempted manager login does not appear at \"fine\".  Had I not worked it out prior I would have tried \"all\" and waded through the results but neither process is appropriate to something that, by all the documentation will tell me, \"just works\". \n\nVery few packages are so robust as they cannot be started in a configuration that is ever so subtly wrong that they do NOT \"just work\".  \n\nDocumentation exists so that those of us starting without knowledge of how it works can learn how it does AND figure out why it did not when it doesn't.   You provided part 1 quite admirably but part 2 wants some work.  Not much.  Probably a couple of hours of a couple of people's time (one has to check the other). More if the section on what to look for when it doesn't work doesn't actually exist in any form, but I have no doubt that it does... somewhere.\n\nI won't argue this should be re-opened, marked unresolved or anything else.  I personally do not care what you do as I have fulfilled MY responsibilities with respect to this process.  \n\nrespectfully \nBJ Chippindale"}]