[{"count": 0, "tags": [], "creator": "fedor.brunner@azet.sk", "attachment_id": null, "id": 171384, "time": "2013-11-21T20:27:03Z", "bug_id": 55808, "creation_time": "2013-11-21T20:27:03Z", "is_private": false, "text": "On the download page\nhttps://httpd.apache.org/download.cgi\nyou are providing PGP, MD5 and SHA1 signatures for released files. The MD5 algorithm was broken, SHA1 algorithm is showing weaknesses. Your own developer recommendations contain this information:\nhttps://www.apache.org/dev/openpgp.html#sha1\n\nPlease remove the MD5 and SHA1 signatures. You can replace them with SHA2-256 or SHA2-512 signatures. The PGP signature is already using SHA2-512 algorithm.\n\nPractical examples of MD5 attacks\nhttp://www.win.tue.nl/hashclash/rogue-ca/\nhttps://blogs.technet.com/b/srd/archive/2012/06/06/more-information-about-the-digital-certificates-used-to-sign-the-flame-malware.aspx?Redirected=true\n\nNIST required many applications in federal agencies to move to SHA-2 after 2010 because of the weakness.\nhttp://csrc.nist.gov/groups/ST/toolkit/secure_hashing.html"}, {"count": 1, "tags": [], "bug_id": 55808, "attachment_id": null, "text": "PGP signature has been added, md5 is indeed a bit weak. I'll try to follow up with the devs to understand how to proceed.", "id": 187176, "time": "2015-12-28T12:01:00Z", "creator": "toscano.luca@gmail.com", "creation_time": "2015-12-28T12:01:00Z", "is_private": false}, {"count": 2, "tags": [], "creator": "toscano.luca@gmail.com", "text": "I followed up with the httpd-dev IRC channel and sent an email to docs@, the general feeling is summarised in the following answer:\n\n\"\"\"\nMD5 and SHA1 still have use cases. You can still use them to check easily that your download is complete and wasn't\ncorrupted by any accidental network foo. Of course they are not save for verifying that no one tampered the downloads on\npurpose. This is what the PGP signature is for.\n\"\"\"\n\nFor the moment I am inclined to close this bug as won't fix, please re-open it if you need further follow ups :)\n\nThanks!\n\nLuca", "id": 187356, "time": "2016-01-04T00:20:41Z", "bug_id": 55808, "creation_time": "2016-01-04T00:20:41Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 55808, "text": "The notion in this bugreport that MD5 and SHA1 are too weak shows a complete lack of understanding of what the threat scenario really is. If you choose to use these checksums for anything cryptographic you would have to be insane. Upgrading these checksums would be security theater. If anything I would suggest weakening them, as their real value, as suggested by Rüdiger, are to guard against network errors and similar errors. For this purpose the currently used algorithms are overkill, since this could be done by non-cryptographic hashes that are better suited, however these two algorithms are useful since they already are present as shell commands in just about any system you would be likely to use.\n\nShould you as suggested by the reporter increase the cryptographic strength of these hashes, there would be no real benefit. A possible attack would be a MitM attack. Let's assume that someone is able to pull this off, since we are on a single channel, the attacker would with no significant extra effort be able to change the hashes, for any cryptograhical strength, there would be no added benefit.\n\nOn the other hand, with PGP, there are many possibilities for transmitting the key, both in band, but time-shifted, and out-of-band using keyservers, providing security against malicious MitM.\n\nIf you upgrade them, you risk loosing compatibility again for no real benefit.\nIn my not so humble opinion, I would have closed this issue as invalid, but that's just me.", "count": 3, "id": 187357, "time": "2016-01-04T00:40:20Z", "creator": "bfg-dev@blenning.no", "creation_time": "2016-01-04T00:40:20Z", "is_private": false}, {"count": 4, "tags": [], "creator": "bfg-dev@blenning.no", "attachment_id": null, "id": 187358, "time": "2016-01-04T00:42:57Z", "bug_id": 55808, "creation_time": "2016-01-04T00:42:57Z", "is_private": false, "text": "It may or may not however be a good thing to point out explicitly that these hashes are used to guard against network errors and nothing more."}, {"count": 5, "tags": [], "creator": "toscano.luca@gmail.com", "text": "Thanks for the clarification, I should have added more context to the bug's resolution, my bad. I am also resolving it as INVALID (should work) as you suggested, still making some confusion with wontfix.\n\nA warning banner might be good to clarify once for all the meaning of the signatures to download, I am in favour (I could create a patch and re-open this bug if anybody agrees).\n\nLuca", "id": 187359, "time": "2016-01-04T04:36:45Z", "bug_id": 55808, "creation_time": "2016-01-04T04:36:45Z", "is_private": false, "attachment_id": null}, {"count": 6, "text": "I agree that PGP is much better solution.\n\nThe scenario I was thinking of was:\n1. User opens TLS secured page https://httpd.apache.org/download.cgi\n2. There he finds unsecured download\nhttp://apache.lauf-forum.at//httpd/httpd-2.2.31.tar.gz\n3. He should now check the integrity using PGP. But if he doesn't use PGP, or know how to use PGP, he could check the SHA-1 hash downloaded from:\nhttps://www.apache.org/dist/httpd/httpd-2.2.31.tar.gz.sha1\n\nSo the integrity of the downloaded file would be tied to the TLS security of apache.org and SHA-1 security.", "bug_id": 55808, "attachment_id": null, "id": 187614, "time": "2016-01-13T13:45:23Z", "creator": "fedor.brunner@azet.sk", "creation_time": "2016-01-13T13:45:23Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "creator": "bfg-dev@blenning.no", "text": "Actually this is a valid bug, but it's a different bug from what you described, this is a degradation attack. Both the SHA-1 checksums and the download are linked to http addresses, but the equivalent https addresses are available.\n\nIt just so happens that the https addresses do not have a valid security certificate which is a second bug.\n\nI'm still convinced that the resolution for this issue is correct, but the two other bugs should be reported, would you like to do so Fedor, or should I do it?", "id": 187622, "time": "2016-01-13T17:18:01Z", "bug_id": 55808, "creation_time": "2016-01-13T17:18:01Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "creator": "ylavic.dev@gmail.com", "text": "(In reply to fedor.brunner from comment #6)\n> \n> So the integrity of the downloaded file would be tied to the TLS security of\n> apache.org and SHA-1 security.\n\nThe user is expected to trust TLS for the route to apache.org, apache.org from the integrity of /dist/ (where the original and its digests/signature land), and finally MD5/SHA1/PGP for the integrity of the tarball.\n\nSo a tarball from any other location should still be verified against digest/signatures from apache.org/dist/, not mirror's.", "id": 187638, "time": "2016-01-13T22:54:33Z", "bug_id": 55808, "creation_time": "2016-01-13T22:54:33Z", "is_private": false, "attachment_id": null}, {"count": 9, "text": "(In reply to Tom Fredrik Blenning from comment #7)\n> Both the SHA-1 checksums and the\n> download are linked to http addresses, but the equivalent https addresses\n> are available.\n\nNo digest/signature is \"linked\" to any address, to the tarball only.\n\n> \n> It just so happens that the https addresses do not have a valid security\n> certificate which is a second bug.\n\nCould you elaborate?\nNo alert when I access https://www.apache.org/dist/httpd/httpd-2.4.18.tar.bz2.sha1 from here.\n\n> \n> I'm still convinced that the resolution for this issue is correct, but the\n> two other bugs should be reported, would you like to do so Fedor, or should\n> I do it?\n\nThis PR is definitively not the place to discuss this and the bugs are not clear to me, would you continue on either the docs@ or users@ mailing list first?", "bug_id": 55808, "attachment_id": null, "id": 187639, "time": "2016-01-13T22:56:41Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2016-01-13T22:56:41Z", "tags": [], "is_private": false}, {"count": 10, "tags": [], "creator": "bfg-dev@blenning.no", "text": "Continuing discussion on docs@", "id": 187640, "time": "2016-01-13T23:07:26Z", "bug_id": 55808, "creation_time": "2016-01-13T23:07:26Z", "is_private": false, "attachment_id": null}]