[{"count": 0, "tags": [], "creator": "kimptoc_mail@yahoo.com", "attachment_id": null, "text": "Hi,\n\nI am using an Oracle backed JDBCContentStore with slide 1.0.16.\n\nEverytime we download a document - eg through the webapp.\n\nA new cursor is being opened - but this never seems to be being\nreleased.\nWe found this out because we hit the \"ORA-01000 maximum open cursors\nexceeded\" error from oracle.\nI am guessing that the above class/method is the likely candidate -\nas it seems to be the method that gets the content.  It also does not\nseem to release the prepared statement it creates.\nLooking at it, I presume we cannot just close it in the method - as\nthe input stream for the binary object won't have been read at that\npoint.\nSo - should it read the whole object in and then close the connection\nhere?\nOr should some finaliser code in the NodeRevisionContent object close\nthe connection? Although this option does not sound right...\n\nOr perhaps wrap the InputStream so that when it is closed, the underlying JDBC \nstatement is closed too.\n\nComments - I will probably go for the last option in my code.  I will submit \nthe patch here.\n\nRegards,\nChris", "id": 9150, "time": "2001-12-24T04:50:54Z", "bug_id": 5582, "creation_time": "2001-12-24T04:50:54Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 5582, "attachment_id": 958, "id": 9173, "time": "2001-12-27T01:07:40Z", "creator": "kimptoc_mail@yahoo.com", "creation_time": "2001-12-27T01:07:40Z", "is_private": false, "text": "Created attachment 958\nProposed patch to resolve this bug - uni and context diff and new file."}, {"count": 2, "tags": [], "creator": "kimptoc_mail@yahoo.com", "attachment_id": null, "text": "Attached is a patch that wraps the InputStream provided from the ResultSet so \nthat when it is told to close, it passes the close call to the statement and \nresult set.  The patch is a ZIP file format - should be readable using jar too.", "id": 9174, "time": "2001-12-27T01:08:24Z", "bug_id": 5582, "creation_time": "2001-12-27T01:08:24Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 5582, "attachment_id": null, "is_private": false, "id": 9293, "time": "2002-01-02T13:21:38Z", "creator": "dirk.verbeeck@pandora.be", "creation_time": "2002-01-02T13:21:38Z", "text": "Patch applied and solves problem"}]