[{"count": 0, "tags": [], "creator": "geniodella@gmail.com", "attachment_id": null, "id": 171473, "creation_time": "2013-11-27T21:02:40Z", "time": "2013-11-27T21:02:40Z", "bug_id": 55823, "text": "I was testing the capabilites of tomcat comparing the traditional http 1.1\nand the new NIO protocol, i tried to load tomcat with 2000 calls\nand after a few minutes tomcat stops accepting requests and even if \ni wait sometimes tomcat doesn't revert to the normal states,\nin a few words i have to restart it. This doesn't happen with the NIO\nprotocol which works perfectly.", "is_private": false}, {"count": 1, "tags": [], "creator": "knst.kolinko@gmail.com", "is_private": false, "id": 171475, "creation_time": "2013-11-28T05:30:36Z", "time": "2013-11-28T05:30:36Z", "bug_id": 55823, "text": "Apparently you mean the NIO implementation of AJP protocol. It is relatively new, but is considered ready for production use.\n\nIf it hangs, take thread dumps to see what is actually going on.\n(See \"Troubleshooting\" chapter in the FAQ on how to take a thread dump).\n\nJust saying \"it hangs\" lacks specifics.\n\nMajority of similar issues were caused by wrong configurations.\nYou are likely hitting some limit that you have configured by yourself.\n\nSearch the mailing list archives and ask on the users mailing list.\nBugzilla is not a support forum.\n\nThus I am closing this as INVALID, unless it is confirmed that this is not a configuration issue.", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 55823, "attachment_id": null, "id": 171476, "time": "2013-11-28T05:35:22Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2013-11-28T05:35:22Z", "is_private": false, "text": "(In reply to Konstantin Kolinko from comment #1)\n> Apparently you mean the NIO implementation of AJP protocol. It is relatively\n> new, but is considered ready for production use.\n> \n\nHuh, you are saying about HTTP/1.1.\n\nThe NIO HTTP/1.1 connector is there for a long time, and will be the default in Tomcat 8. It is widely used and tested. I wouldn't refer to is as \"the new NIO protocol\".\n\nThe statements below are still true.\n\n> If it hangs, take thread dumps to see what is actually going on.\n> (See \"Troubleshooting\" chapter in the FAQ on how to take a thread dump).\n> \n> Search the mailing list archives and ask on the users mailing list.\n> \n> Thus I am closing this as INVALID, unless it is confirmed that this is not a\n> configuration issue."}]