[{"attachment_id": null, "tags": [], "bug_id": 55841, "is_private": false, "count": 0, "id": 171554, "time": "2013-12-04T03:13:50Z", "creator": "chealer@gmail.com", "creation_time": "2013-12-04T03:13:50Z", "text": "The news items announcing bugfix releases such as 2.2.26 and 2.4.7 are written from a misleading template. For example, 2.2.26's reads:\n\n\nApache httpd 2.2.26 Released 2013-11-18\n\nThe Apache HTTP Server Project is proud to announce the release of version 2.2.26 of the Apache HTTP Server (\"httpd\"). This version is principally a bugfix release.\n\nThis version of httpd is a major release of the 2.2 legacy branch. New features include Smart Filtering, Improved Caching, AJP Proxy, Proxy Load Balancing, Graceful Shutdown support, Large File Support, the Event MPM, and refactored Authentication/Authorization.\n\nDownload | New Features in httpd 2.2 | ChangeLog for 2.2.26 | Complete ChangeLog for 2.2\n\n\nWhen I upgraded a 2.0 install to 2.2 the other day, I chose 2.2.25 rather than 2.2.26 because the changes in 2.2.26 looked too dangerous (although I did suspect this was a formulation problem). I realized this was a bug reading 2.4.7's announcement. The wayback machine shows this is not a new problem.\n\nIt is legitimate to try including information about both the latest major releases and the latest minor releases. People running 2.4.6 will wonder what they're missing from 2.4.7, while those who didn't manage to go beyond 2.2 will wonder what's new in 2.4. However, \"This version of httpd is a major release of the 2.2 legacy branch.\" makes it look like the news item is only talking about 2.x.y specifically.\n\nAlthough that's very far from the current formulation, \"The 2.2 legacy branch was a major release of httpd.\" is about my guess on what the author meant.\n\n\nApologies for the wrong metadata. I couldn't find an appropriate way to file a ticket about httpd.apache.org."}, {"count": 1, "tags": [], "creator": "toscano.luca@gmail.com", "text": "Hi Filipus,\n\nsorry to get back to you after 3 yrs. I re-read the issue several times but I didn't fully get the issue that you were describing, I believe that it might be a bit too generic. I am not seeing a lot of +1 or discussions so I would be inclined to close it, but please re-open it if you feel that we are missing something important.\n\nThanks!\n\nLuca", "id": 187592, "time": "2016-01-13T04:12:10Z", "bug_id": 55841, "creation_time": "2016-01-13T04:12:10Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "No problem Luca.\n\nI do not understand what you mean when you say the issue \"might be a bit too generic\". The issue seems to apply to all minor release announcements, but I am not going to report each individually.\n\nI do not see how this would be invalid. The latest announcement (2.4.18's) features the same issue:\nThis version of httpd is a major release of the 2.4 stable branch, and represents the best available version of Apache HTTP Server. New features include Loadable MPMs, major improvements to OCSP support, mod_lua, Dynamic Reverse Proxy configuration, Improved Authentication/Authorization, FastCGI Proxy, New Expression Parser, and a Small Object Caching API.", "is_private": false, "id": 187695, "creator": "chealer@gmail.com", "time": "2016-01-15T01:01:35Z", "bug_id": 55841, "creation_time": "2016-01-15T01:01:35Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 55841, "text": "Adding also a comment from the docs@ mailing list:\n\n2016-01-13 1:21 GMT-08:00 Vincent Bray wrote:\nThe bug report seems quite clear to me. It's saying that by having a description of all the new features in the 2.4 branch as a whole under a title that names a specific minor release is misleading. To this day the project home page implies that \"Loadable MPMs, major improvements to OCSP support\" and so forth, are features newly introduced in 2.4.18.\n\nThe issue could be fixed simply be reworking this sentence:\n\nThis version of httpd is a major release of the 2.4 stable branch, and represents the best available version of Apache HTTP Server. New features include Loadable MPMs, major improvements to OCSP support, mod_lua, Dynamic Reverse Proxy configuration, Improved Authentication/Authorization, FastCGI Proxy, New Expression Parser, and a Small Object Caching API.\n\n.. as ..\n\nThis version of httpd is a *patch level* release of the 2.4 stable branch, and represents the best available version of Apache HTTP Server. New features *in the 2.4 branch* include Loadable MPMs, major improvements to OCSP support, mod_lua, Dynamic Reverse Proxy configuration, Improved Authentication/Authorization, FastCGI Proxy, New Expression Parser, and a Small Object Caching API.", "id": 187698, "time": "2016-01-15T04:40:47Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-15T04:40:47Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 55841, "is_private": false, "text": "Hi Filipus,\n\nI have probably not stated my point correctly, apologies for the confusion. What I wanted to say was that in my opinion it was a clear message, and that it is responsibility of who downloads/update the new version of httpd to check the changelog for the new minor release (not relying only on the email message). Moreover I didn't see any other comment on this bug supporting the issue during the past three yrs so I thought to close it as invalid.\n\nHaving said that, I can see your point that a better and more precise documentation is always welcome. I'll try to follow up in the docs@ mailing list to raise your point and figure out if there is a way to change the format of the email sent.\n\nThanks!\n\nLuca", "id": 187699, "time": "2016-01-15T04:45:56Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-15T04:45:56Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 55841, "text": "I do not exactly agree with Vincent's message. This ticket is not \"saying that by having a description of all the new features in the 2.4 branch as a whole under a title that names a specific minor release is misleading.\" What this ticket says is that the precise wording used (\"This version of httpd is a major release of the 2.2 legacy branch.\") is misleading. I think that is also what Vincent meant since he proposes rewording as a solution himself.\n\nI do agree with Vincent on the fact that the bug is quite clear though. I do not understand how one can claim that the message is clear. To understand what the news items are trying to say, one would need to resolve \"This version of httpd\" to httpd 2.2 in the sentence quoted above. The question is therefore how likely is it for someone unaware of this bug to do that, given that all the item contains before that sentence is:\n\n>Apache httpd 2.2.31 Released 2015-07-17\n\n>The Apache HTTP Server Project is proud to announce the release of version 2.2.31 of the Apache HTTP Server (\"httpd\"). This version is a security and bugfix release.\n\nIn fact, the sentence right before the problematic sentence contains \"This version\" referring to 2.x.y. So I cannot see how a reader could figure out the intended meaning without realizing that the sentence makes no sense otherwise. Calling this \"misleading\" is to put it mildly.\n\nThe fact that no comment \"supports the issue\", as you describe it, does not make a ticket invalid. A ticket is only invalid if its claim is incorrect.\n\nI disagree about it being the \"responsibility of who downloads/update the new version of httpd to check the changelog for the new minor release (not relying only on the email message).\" Users should be able to trust email sent by the foundation. And they should certainly be allowed to trust the homepage of http://httpd.apache.org. Besides, it is not about the changelog. This bug can cause 2 mistaken decisions:\n1. An administrator updating from 2.x.y to 2.x.z in order to obtain features which are already present in 2.x.y.\n2. An administrator choosing not to update from 2.x.y to 2.x.z to avoid breakage caused by changes which were not introduced between 2.x.y and 2.x.z.\n\nAs I wrote, the scenario which prompted me to report this is the second.", "id": 187774, "time": "2016-01-17T16:57:38Z", "creator": "chealer@gmail.com", "creation_time": "2016-01-17T16:57:38Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "creator": "ljgbpfeiffer@googlemail.com", "is_private": false, "text": "Hello:\nI know i'm new on here but, from my point of view, i get what he says, i mean every release(major release) or patch (minor/bug fix) should get an explanation on what have been changed; it is indeed of course matter of who is installing / patching the apache installation to read those changes and  whether if he prefers to upgrade or not to that mayor or patch version.\nbut what i want to point, that it is better for a sysadmin to know if there was, for example let's say a security patch, or if some minor bug fixes are made, in order to give better support to whom is installing it. \nI might be wrong but, this should make it useful and more easy way to get \"updates\" on what have change.", "id": 187775, "time": "2016-01-17T17:30:21Z", "bug_id": 55841, "creation_time": "2016-01-17T17:30:21Z", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 55841, "attachment_id": null, "text": "Hi Filipus,\n\nfollowing up on your last message:\n\n>  Calling this \"misleading\" is to put it mildly.\n\nWould you mind to put an example of how the email message should look like to not be \"misleading\"? Do you have a proposal to make a change in the email's format? If so please add it to this bug so we'll be able to discuss it :)\n\n> The fact that no comment \"supports the issue\", as you describe it, does not make a ticket invalid. A ticket is only invalid if its claim is incorrect.\n\nI'd like to clarify this point. I am trying to clear old bugs in the huge (~1500) buglist of httpd and for this one I thought that the absence of traction/support, together with the fact that I didn't really shared your point of view, was an indicator that the email content wasn't misleading. This was my bad since I should have probably added a comment with my thoughts before closing the bug and marking it as invalid, lesson learned for the future and my apologies :)\n\n> I disagree about it being the \"responsibility of who downloads/update the new version of httpd to check the changelog for the new minor release (not relying only on the email message).\" Users should be able to trust email sent by the foundation.\n\nI agree with you partially. The emails from the foundation should be trusted but it is indeed a best practice (at least in my opinion) for a sysadmin/maintainer to check the Changelog to have a full and precise/complete view of what will end up in production. \n\nThanks!\n\nLuca", "id": 187786, "time": "2016-01-18T07:16:59Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-18T07:16:59Z", "is_private": false}, {"count": 8, "attachment_id": null, "bug_id": 55841, "text": "IMO the complaint is legitimate and the txt could be improved (marginally).\n\nThe \"templates\" are in https://dist.apache.org/repos/dist/release/httpd", "id": 187799, "time": "2016-01-18T14:19:24Z", "creator": "covener@gmail.com", "creation_time": "2016-01-18T14:19:24Z", "tags": [], "is_private": false}, {"count": 9, "tags": [], "text": "Going to the main Apache httpd page (https://httpd.apache.org) as well as the announcement itself refer to the CHANGES_2.2 and CHANGES_2.2.X pages:\n\n\"Please see the CHANGES_2.2 file, linked from the download page, for a full list of changes. A condensed list, CHANGES_2.2.31 includes only those changes introduced since the prior 2.2 release. A summary of all of the security vulnerabilities addressed in this and earlier releases is available:\"\n\nIncluding the list of changes in the Announcement itself seems like overkill. The announcement is to describe *that patch release* and not the entire Major/Minor release itself, which is adequately described elsewhere.\n\nWould it be possible for the bug submitter (or someone who groks what the actual issue actually is) to create a sample Announcement that would \"fix\" the \"problem\"?", "is_private": false, "bug_id": 55841, "id": 187800, "time": "2016-01-18T14:29:20Z", "creator": "jim@apache.org", "creation_time": "2016-01-18T14:29:20Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 55841, "is_private": false, "count": 10, "id": 187815, "time": "2016-01-19T04:28:31Z", "creator": "chealer@gmail.com", "creation_time": "2016-01-19T04:28:31Z", "text": "Dear Luca,\n\n(In reply to Luca Toscano from comment #7)\n> Hi Filipus,\n> \n> following up on your last message:\n> \n> >  Calling this \"misleading\" is to put it mildly.\n> \n> Would you mind to put an example of how the email message should look like\n> to not be \"misleading\"? Do you have a proposal to make a change in the\n> email's format? If so please add it to this bug so we'll be able to discuss\n> it :)\n\nI have suggested a replacement for the misleading sentence in the Description. Comment 3 includes a superior proposal from Vincent Bray which goes further.\n\nThat being said, I have to agree with Comment 9 - there is an even simpler solution. Just get rid of the 2.x changes description. At 2.2.31, the current approach gets ridiculous. At most 2% of httpd users are still using 2.0. Mentioning specific changes of 2.2 in 2.2.31's announcement while failing to mention specific change of 2.2.31 is itself misleading, though not on the same scale as the misleading sentence I reported.\n\nTherefore, I would recommend to either start with a list of specific changes in each patch release, or to remove the list of specific changes of 2.x.\n \n> > The fact that no comment \"supports the issue\", as you describe it, does not make a ticket invalid. A ticket is only invalid if its claim is incorrect.\n> \n> I'd like to clarify this point. I am trying to clear old bugs in the huge\n> (~1500) buglist of httpd and for this one I thought that the absence of\n> traction/support, together with the fact that I didn't really shared your\n> point of view, was an indicator that the email content wasn't misleading.\n> This was my bad since I should have probably added a comment with my\n> thoughts before closing the bug and marking it as invalid, lesson learned\n> for the future and my apologies :)\n\nApologies as convincing as these cannot be rejected.\n\n> > I disagree about it being the \"responsibility of who downloads/update the new version of httpd to check the changelog for the new minor release (not relying only on the email message).\" Users should be able to trust email sent by the foundation.\n> \n> I agree with you partially. The emails from the foundation should be trusted\n> but it is indeed a best practice (at least in my opinion) for a\n> sysadmin/maintainer to check the Changelog to have a full and\n> precise/complete view of what will end up in production.\n\nSure."}, {"count": 11, "attachment_id": null, "bug_id": 55841, "is_private": false, "id": 187893, "time": "2016-01-22T08:18:25Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-22T08:18:25Z", "tags": [], "text": "Hi Filipus,\n\nI took a look to https://dist.apache.org/repos/dist/release/httpd/Announcement2.4.txt (that is basically the last email sent for the httpd release) and the formulation is a bit different from the one that we are discussing:\n\n\"\"\"\n                Apache HTTP Server 2.4.18 Released\n\n   The Apache Software Foundation and the Apache HTTP Server Project\n   are pleased to announce the release of version 2.4.18 of the Apache\n   HTTP Server (\"Apache\").  \n\n>>>>  This version of Apache is our latest GA release of the new generation 2.4.x branch \n\n   of Apache HTTPD and represents fifteen years of innovation by the project,\n   and is recommended over all previous releases. This release of Apache is\n   principally a feature and bug fix release.\n\n\"\"\"\n\nThe version suggested by you and Vincent were:\n\n1) The 2.2 legacy branch was a major release of httpd.\n2) This version of httpd is a *patch level* release of the 2.4 stable branch, and represents the best available version of Apache HTTP Server.\n\nIs the latest format clearer and closer to what you would like to see?\n\nAlso, your second comment:\n\n> That being said, I have to agree with Comment 9 - there is an even simpler solution. Just get rid of the 2.x changes description.\n\nThe last format has two sections:\n\n1)\n\"\"\"   \n   Apache 2.4 offers numerous enhancements, improvements, and performance\n   boosts over the 2.2 codebase.  For an overview of new features\n   introduced since 2.4 please see:\n\n     http://httpd.apache.org/docs/trunk/new_features_2_4.html\n\"\"\"\n\nSo no lists of features added, just a link. The section follows:\n\n\"\"\"\n   Please see the CHANGES_2.4 file, linked from the download page, for a\n   full list of changes. A condensed list, CHANGES_2.4.18 includes only\n   those changes introduced since the prior 2.4 release.  A summary of all \n   of the security vulnerabilities addressed in this and earlier releases \n   is available:\n\n     http://httpd.apache.org/security/vulnerabilities_24.html\n\"\"\"\n\nDo you still see inconsistencies in this format? If so, can you please rewrite a proposal of this latest updated version?\n\nSorry for the long thread, but I really want to make sure that we all agree about what to change :)\n\nThanks!\n\nLuca"}, {"count": 12, "tags": [], "creator": "chealer@gmail.com", "text": "Hi Luca,\nI do not see problems in Announcement2.4.txt. However, I wonder how that file is used. I have never received Apache httpd announcements via email. My complaint was about the news items on the website, specifically on the homepage, which apparently differ from emails if I understand your message correctly.\n\nIf the above does not answer your questions, let me know.", "id": 187897, "time": "2016-01-22T12:40:34Z", "bug_id": 55841, "creation_time": "2016-01-22T12:40:34Z", "is_private": false, "attachment_id": null}, {"count": 13, "tags": [], "creator": "toscano.luca@gmail.com", "is_private": false, "text": "Hi Filipus,\n\nI feel an idiot, now I get why we weren't understanding each other. I was thinking about the email, not the main page of the httpd website. \n\nI am going to send a patch for the index page during the weekend, after that I'll send an email to the dev channel to alert them about the change. \n\nThanks!\n\nLuca", "id": 187900, "time": "2016-01-22T13:08:14Z", "bug_id": 55841, "creation_time": "2016-01-22T13:08:14Z", "attachment_id": null}, {"count": 14, "attachment_id": null, "bug_id": 55841, "is_private": false, "id": 187977, "time": "2016-01-26T21:35:50Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-26T21:35:50Z", "tags": [], "text": "Hi Filipus and all the followers of this thread,\n\nI pushed a new proposal for the httpd front page:\n\nhttp://httpd.staging.apache.org\n\nI removed the 2.4 and 2.2 misleading parts, leaving the choice of the user about what changes to check (2.x branch, 2.x.y release, etc..).\n\nLet me know your thoughts, if we have an agreement I'll publish the page :)\n\nLuca"}, {"count": 15, "tags": [], "bug_id": 55841, "text": "Thanks Luca.\n\nIn the case of Apache 2.2.31, there seems to be a translation error. Unless 2.2.31 will be the last Apache 2.2.x, \"last\" should read \"latest\" in \"This version is the last security and bugfix release of the 2.2 legacy branch.\"\n\nIn the case of Apache 2.4.18, the reported problem partly persists. The announcement contains:\n>This version of httpd is a major release of the 2.4 stable branch, and represents the best available version of Apache HTTP Server.\n\nhttpd 2.4.18 is not a major release of the 2.4 stable branch.\n\n\nNote: the homepage refers to httpd as either \"Apache HTTP Server\", \"Apache HTTPD\", \"httpd\", \"Apache httpd\" or \"Apache\". I do not know if all of these are accepted terms, but if so, an explanation to that effect might be warranted.", "id": 187988, "time": "2016-01-27T12:31:47Z", "creator": "chealer@gmail.com", "creation_time": "2016-01-27T12:31:47Z", "is_private": false, "attachment_id": null}, {"count": 16, "tags": [], "creator": "toscano.luca@gmail.com", "text": "Fixed, thanks for the comments! Can you please re-check?\n\nMoreover, I'd like to have a bit more details about:\n\n\"Note: the homepage refers to httpd as either \"Apache HTTP Server\", \"Apache HTTPD\", \"httpd\", \"Apache httpd\" or \"Apache\". I do not know if all of these are accepted terms, but if so, an explanation to that effect might be warranted.\"\n\nWould you like to see a note somewhere about these terms used as synonyms?\n\nLuca", "id": 187989, "time": "2016-01-27T14:02:11Z", "bug_id": 55841, "creation_time": "2016-01-27T14:02:11Z", "is_private": false, "attachment_id": null}, {"count": 17, "tags": [], "creator": "chealer@gmail.com", "is_private": false, "text": "Hi Luca,\n\n(In reply to Luca Toscano from comment #16)\n> Fixed, thanks for the comments! Can you please re-check?\n\nYour proposal fixes the bug reported here, thank you.\nRegarding the sentence:\n>This version of Apache is our latest GA release of the new generation 2.4.x branch of Apache HTTPD and represents fifteen years of innovation by the project, and is recommended over all previous releases.\n\nWhy does this specify \"latest GA release\"? Is there a latest non-GA release of the 2.4 branch which is not 2.4.18?\nAlso, how does this version represent fifteen years of innovation by the project?\n\n> \n> Moreover, I'd like to have a bit more details about:\n> \n> \"Note: the homepage refers to httpd as either \"Apache HTTP Server\", \"Apache\n> HTTPD\", \"httpd\", \"Apache httpd\" or \"Apache\". I do not know if all of these\n> are accepted terms, but if so, an explanation to that effect might be\n> warranted.\"\n> \n> Would you like to see a note somewhere about these terms used as synonyms?\n\nThe first step is to determine which of these terms are proper ways to refer to Apache HTTP Server. \"Apache HTTP Server\" is fine, but I do not think the foundation would condone using \"Apache\" as a synonym. Those terms which are considered improper should just be removed from the page.\n\nThose who are considered fine should indeed be mentioned. The introduction already contains one:\n> The Apache HTTP Server (\"httpd\")", "id": 188010, "time": "2016-01-28T13:00:55Z", "bug_id": 55841, "creation_time": "2016-01-28T13:00:55Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 55841, "text": "All right, I updated again http://httpd.staging.apache.org, I believe that we should have the final version now.\n\nPlease let me know what you think!\n\nLuca", "count": 18, "id": 188025, "time": "2016-01-29T07:42:58Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-29T07:42:58Z", "is_private": false}, {"count": 19, "tags": [], "bug_id": 55841, "is_private": false, "text": "Regarding:\n> This version is our GA (General Availability) release of the new generation 2.4.x branch of Apache httpd and it is recommended over all previous releases.\n\nAll 2.4.x versions (2.4.0, 2.4.1, etc.) are GA releases of the 2.4 branch. And in fact, unless the 2.4 branch includes 2.3.x, all releases of the 2.4 branch are GA releases.\n\nAlso, I think it is superfluous to call the 2.4 branch \"new generation\". Apache 2.4 was released nearly 4 years ago.", "id": 188056, "time": "2016-01-29T23:21:12Z", "creator": "chealer@gmail.com", "creation_time": "2016-01-29T23:21:12Z", "attachment_id": null}, {"count": 20, "tags": [], "bug_id": 55841, "attachment_id": null, "is_private": false, "id": 188062, "time": "2016-01-30T09:15:03Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-30T09:15:03Z", "text": "Hi Filipus!\n\nI published the staging page: http://httpd.apache.org/\n\nThe last issue seems to be related to the \"GA release\" wording: would you mind to specify how you would like to see it? \n\nThanks! \n\nLuca"}, {"count": 21, "tags": [], "creator": "chealer@gmail.com", "text": "Thank you Luca.\nI suggest:\n>This version is the latest release of the new generation 2.4.x branch of Apache httpd and it is recommended over all previous releases.\nOr simply:\n>This version is the latest release of the 2.4.x branch of Apache httpd and it is recommended over all previous releases.\nOr even more simply, without jargon:\n>This version is the latest release of Apache httpd 2.4. It is recommended over all previous releases.", "id": 188067, "time": "2016-01-30T13:47:00Z", "bug_id": 55841, "creation_time": "2016-01-30T13:47:00Z", "is_private": false, "attachment_id": null}, {"count": 22, "attachment_id": null, "bug_id": 55841, "is_private": false, "id": 188068, "time": "2016-01-30T15:26:19Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-30T15:26:19Z", "tags": [], "text": "Simplified everything to:\n\n\"\"\"\nThe Apache Software Foundation and the Apache HTTP Server Project are pleased to announce the release of version 2.4.18 of the Apache HTTP Server (\"httpd\").\n\nThis version of Apache httpd is principally a security and bug fix release of the 2.4.x stable branch and it represents the best available version of Apache HTTP Server.\n\"\"\"\n\nLess cumbersome, simple and informative. \n\nThanks a lot for improving the home page! \n\nLuca"}, {"count": 23, "attachment_id": null, "bug_id": 55841, "text": "I agree the previous version was redundant. Thanks", "id": 188070, "time": "2016-01-30T17:38:57Z", "creator": "chealer@gmail.com", "creation_time": "2016-01-30T17:38:57Z", "tags": [], "is_private": false}]