[{"count": 0, "tags": [], "creator": "arunav.sanyal91@gmail.com", "attachment_id": 31098, "text": "Created attachment 31098\nContains GNU unified diff of SpnegoAuthenticator and its modified format\n\nHi\n\nProblem report:-\n\nIn bug report 55760, a change was made in which system property javax.security.auth.useSubjectCredsOnly is no longer set to false. So it naturally follows that GSSAPI AcceptSecContext method is wrapped in a PrivilegedExceptionAction. It is found in IBM JDK that it fails otherwise.\n \nCause of failure:-\n\nWhen IBM JDK tries to fetch credential in GSSAPI AcceptSecContext method, it does so from JAAS Subject. Since this call is not performed in Subject.doAs, the call fails as IBM JDK does not have access to a JAAS subject and cannot fetch a credential.\n \nPlease find attached:-\n\n1. File containing gnu unified diff format of SpnegoAuthenticator with its modified version. PLEASE NOTE THIS DIFF IS ON TOP OF BUG FIX REPORTED IN 55760. This file now also contains AcceptAction class which wraps GSSAPI AcceptSecContext as a PrivilegedExceptionAction.\n\nThis fix solves the issue by allowing IBM JDK to fetch credential from JAAS Subject. \n\nYours sincerely\nArunav Sanyal", "id": 171606, "time": "2013-12-06T08:56:41Z", "bug_id": 55851, "creation_time": "2013-12-06T08:56:41Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 55851, "text": "Thanks for the patch. A variation of it has been applied to 8.0.x and 7.0.x and will be included in 8.0.0-RC6 and 7.0.48 onwards.\n\nThe changes I made were:\n- remove @author tag (the ASF strongly discourages their use)\n- made the inner class static and private\n- added a missing @override\n\nSo basically a handful of minor bits and pieces.\n\nThanks again for the patch.", "id": 171615, "time": "2013-12-06T19:46:47Z", "creator": "markt@apache.org", "creation_time": "2013-12-06T19:46:47Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 55851, "attachment_id": null, "id": 171665, "time": "2013-12-09T11:23:48Z", "creator": "arunav.sanyal91@gmail.com", "creation_time": "2013-12-09T11:23:48Z", "is_private": false, "text": "Thanks\n\nI tried searching for recent changes to SpnegoAuthenticator and I cant seem to find the bug report in which this issue was first reported.\n\nCan you please point me to the bug report in which this fix is made? Or is this a change which is not tracked by ASF bugzilla?\n\nYours sincerely\nArunav Sanyal"}, {"count": 3, "tags": [], "bug_id": 55851, "attachment_id": null, "id": 171666, "time": "2013-12-09T11:26:44Z", "creator": "markt@apache.org", "creation_time": "2013-12-09T11:26:44Z", "is_private": false, "text": "(In reply to Arunav Sanyal from comment #2)\n> Thanks\n> \n> I tried searching for recent changes to SpnegoAuthenticator and I cant seem\n> to find the bug report in which this issue was first reported.\n\nHuh? This is the bug report in which this issue was first reported.\n\n> Can you please point me to the bug report in which this fix is made? Or is\n> this a change which is not tracked by ASF bugzilla?\n\nHuh? Bugzilla is not a source code control system. It doesn't track source code changes? Are you looking for a link to the svn revisions where this issue was fixed?"}]