[{"attachment_id": null, "tags": [], "bug_id": 55863, "is_private": false, "count": 0, "id": 171671, "time": "2013-12-09T20:22:18Z", "creator": "alexander.klimetschek@googlemail.com", "creation_time": "2013-12-09T20:22:18Z", "text": "Create a Mac OSX app bundle distribution of JMeter. This can be easily done using Oracle's appbundler ant task [0].\n\nI added this in my github fork of jmeter, see [1] and [2] for a patch file. This will put the appbundler-1.0.jar into libs/, not sure if it can be downloaded like all other jars. The bundled app only includes the minimum (jmeter jar, libs, and bin/*.properties).\n\nRequires Java 1.7 at least. I assume that the ant task should run on all platforms, but I have only tested it on a Mac.\n\n[0] http://docs.oracle.com/javase/7/docs/technotes/guides/jweb/packagingAppsForMac.html\n[1] https://github.com/alexkli/jmeter/commit/6a1c1f99e69dfb3fb95c1947daf2c4418ee2dc41\n[2] https://github.com/alexkli/jmeter/commit/6a1c1f99e69dfb3fb95c1947daf2c4418ee2dc41.patch"}, {"count": 1, "tags": [], "bug_id": 55863, "text": "The appbundler jar is licensed under GPL2.0, so cannot be included in any builds or automatic downloads.\n\nHowever, *if* it is only needed at build time, it should be OK to use it to create the package.\n\nThe build.xml script will need to be adjusted accordingly.\nSomething like:\n- if the jar is not present, display a message and explain how to get the jar (and that the jar is GPL2.0).\n- if the jar is present, generate the MacOSX package\n- add a separate task to download the jar", "id": 176802, "time": "2014-07-31T13:48:51Z", "creator": "sebb@apache.org", "creation_time": "2014-07-31T13:48:51Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 55863, "attachment_id": null, "text": "The appbundler jar copies parts of itself to the target app, in particular it copies the file JavaAppLauncher.\n\nUnless the copied elements have a different, AL2.0-compatible license (which seems highly  unlikely) this unfortunately means that the ASF cannot distribute the bundle.\n\nSorry.", "id": 176803, "time": "2014-07-31T14:18:09Z", "creator": "sebb@apache.org", "creation_time": "2014-07-31T14:18:09Z", "is_private": false}]