[{"count": 0, "tags": [], "bug_id": 55867, "attachment_id": null, "text": "When Cookie value is empty, double quotes are added. Example if cookie is following -\n\nname = test\nvalue = \n\nthe resultant cookie in the client is test = \"\"\n\nTried using org.apache.tomcat.util.http.ServerCookie.ALLOW_NAME_ONLY property, but it has no effect.", "id": 171700, "time": "2013-12-12T07:15:00Z", "creator": "shilpik@adobe.com", "creation_time": "2013-12-12T07:15:00Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 55867, "is_private": false, "count": 1, "id": 171709, "time": "2013-12-12T14:30:20Z", "creator": "chris@christopherschultz.net", "creation_time": "2013-12-12T14:30:20Z", "text": "RFC2109 says that values are tokens or quoted-values, and whitespace is allowed around tokens, equals signs, etc. Using value=\"\" seems entirely appropriate.\n\nRFC2109 also says that the cookie value is opaque to the client and only has meaning to the server. Since the server decided to add the double-quotes, it should be able to handle the cookie value coming back to it.\n\nWhy is this a bug?"}, {"count": 2, "tags": [], "creator": "shilpik@adobe.com", "is_private": false, "text": "This creates a problem if the cookie value is validated or checked in some other system/server/component. As there an empty cookie was expected. \n\norg.apache.tomcat.util.http.ServerCookie.ALLOW_NAME_ONLY property is honored while reading request cookies, Can we also not use the same while setting cookies?", "id": 171723, "time": "2013-12-13T03:28:12Z", "bug_id": 55867, "creation_time": "2013-12-13T03:28:12Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 55867, "attachment_id": null, "text": "Generally Tomcat follows the principle of being flexible in what it accepts and strict about what it sends. This means that some bending of the specifications is permitted when processing input where there is no risk of any harm being done but anything sent by Tomcat will always be specification compliant.\n\nNone of the cookie specs I am aware of allow name only cookies so while Tomcat can optionally be configured to accept them, Tomcat will never send one. Note that even RFC6265 states that such a cookie should be ignored. I'll also mention at this point that Tomcat takes a slightly less tolerant view of non-compliant cookies (requiring an explicit option to be set to process them) due to past security issues involving malformed cookies.\n\nIf some other system can't handle a specification compliant cookie with a name-value pair of test=\"\" then that is a bug in that system. The Tomcat project generally avoids adding workarounds for 3rd party components that can't process specification compliant responses.", "id": 171732, "time": "2013-12-13T11:52:55Z", "creator": "markt@apache.org", "creation_time": "2013-12-13T11:52:55Z", "is_private": false}]