[{"count": 0, "tags": [], "creator": "michael.suedkamp@docware.de", "attachment_id": null, "is_private": false, "id": 171727, "time": "2013-12-13T11:15:44Z", "bug_id": 55879, "creation_time": "2013-12-13T11:15:44Z", "text": "We had the problem that a JUnit test hung due to a very simple reason (issue with database connection). We would have found the reason very quickly if all stdout messages would be logged immediately when they occur.\nHowever, the Ant Junit task will not log any stdout message unless the test suite is finished, which actually never happens for a 'hang' situation. This requires guessing the reason. I also tried already to derive my own formatter from JUnitResultFormatter, but realized that this restriction comes from the base class (at least in my understanding)."}, {"count": 1, "tags": [], "creator": "mclarke@apache.org", "text": "This is caused by the PlainJUnitResultFormatter not calling flush following each print, although that in itself isn't a bad thing as it prevents blocking on every action whilst any underlying output stream is flushed.\n\nYou can overcome this if you want by duplicating the PlainJUnitResultFormatter and calling flush after each write or writeln, or by creating a wrapper that intercepts the setOuput and setError calls and either flushes them on timer, or also intercepts the various reporting calls and calling flush on the output streams after calling the original (super) reporting methods.", "id": 171751, "time": "2013-12-15T11:35:35Z", "bug_id": 55879, "creation_time": "2013-12-15T11:35:35Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "michael.suedkamp@docware.de", "text": "As I tried to explain, I already tried to write my own class that implements JUnitResultFormatter (like the PlainJUnitResultFormatter). There are some sample implementations around but none spots immediate log flushing. The earliest time to log things I found was in the endTest() method. But the out stream I assigned in setSystemOutput() was always empty there. Only endTestSuite() contained a non empty out stream - but this would be then like PlainJUnitResultFormatter.\n\nMaybe I'm missing something.", "id": 171762, "time": "2013-12-16T07:28:24Z", "bug_id": 55879, "creation_time": "2013-12-16T07:28:24Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "michael.suedkamp@docware.de", "text": "Recently I found the JUnit task option \"showoutput\". When set to \"true\" I see the expected output on the console. Without this option only a brief test summary was logged there.\n\nActually, that's what I needed.", "id": 172058, "time": "2014-01-03T12:33:42Z", "bug_id": 55879, "creation_time": "2014-01-03T12:33:42Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "bodewig@apache.org", "text": "Thanks Michael", "id": 172108, "time": "2014-01-06T15:09:17Z", "bug_id": 55879, "creation_time": "2014-01-06T15:09:17Z", "is_private": false, "attachment_id": null}]