[{"count": 0, "tags": [], "bug_id": 55917, "is_private": false, "text": "Some popular JavaScript libraries have started to set cookie values in the browser directly and include ISO-8859-1 (Latin-1) characters in the range 0xA0-0xFF. When the Cookie header is parsed by Tomcat, the request fails with an IllegalArgumentException[1] from the connector without giving the application an opportunity to validate the cookie value received.\n\nRFC2616 (HTTP/1.1) allows header field-values to contain ISO-8859-1 characters which includes the range 0xA0-0xFF. RFC2109 (cookies) allows for \"quoted-string\" values which can contain TEXT octets (which includes those characters). This is different to cookie names which are defined as the more restricted \"token\" which only allows USASCII values. The original Netscape spec does not mention character encodings.\n\n[1] http://svn.apache.org/viewvc/tomcat/tc7.0.x/trunk/java/org/apache/tomcat/util/http/CookieSupport.java?revision=1200183&view=markup#l190", "id": 171859, "time": "2013-12-20T20:22:13Z", "creator": "jboynes@apache.org", "creation_time": "2013-12-20T20:22:13Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "jboynes@apache.org", "attachment_id": 31139, "is_private": false, "id": 171860, "time": "2013-12-20T20:30:17Z", "bug_id": 55917, "creation_time": "2013-12-20T20:30:17Z", "text": "Created attachment 31139\nFix to allow chars in the range 0xa0-0xff\n\nPatch allows characters in the range 0xA0-0xFF (so it continues to exclude controls both <0x20 and 0x80-0x9F). Added testcase for a Latin-1 character and test-suite passes.\n\nTo keep it simple, this patch does not attempt to differentiate between quoted and unquoted values. It also does not attempt to deal with values containing UTF-8 encoded data."}, {"count": 2, "tags": [], "bug_id": 55917, "text": "This simple patch is not acceptable as it does not retain the limitation that cookie names must be tokens.\n\nNow might be the time to re-write the cookie parsing using the HttpParser.\n\nGiven the 'fun' we have had with cookie processing in the past we need to be very careful about any changes we introduce. Now could be a good time to do this in 8.0.x and then back-port it once it is stable.", "id": 171861, "time": "2013-12-20T20:55:47Z", "creator": "markt@apache.org", "creation_time": "2013-12-20T20:55:47Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "If we do revisit cookie parsing we should keep RFC6265 in mind as well as the fact that Tomcat moved to a strict adherence to the cookie specs in order to avoid a number of potential security issues.", "attachment_id": null, "bug_id": 55917, "id": 171862, "time": "2013-12-20T20:58:00Z", "creator": "markt@apache.org", "creation_time": "2013-12-20T20:58:00Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 55917, "attachment_id": null, "text": "I agree that this would be a good time for a larger cleanup. To keep things incremental I'll start with refining the patch (against trunk) to handle names and values separately.", "id": 171864, "time": "2013-12-20T21:28:24Z", "creator": "jboynes@apache.org", "creation_time": "2013-12-20T21:28:24Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 55917, "text": "Created attachment 31140\nAllow 0xa0-0xff in V0 values only\n\nMinimal patch allowing ISO-8859-1 characters in the range 0xa0-0xff for V0 values only.\n\nThis refactors the check when processing tokens to allow 8-bit characters just for V0 values. They will still trigger an IllegalArgumentException if they appear in a name or in a V1 unquoted value.\n\nV1 quoted values already support them via a different code path. I discovered an issue (#55918) there where CTLs will not cause an IAE and will appear in the returned value. I've tagged the tests for that as @Ignored to be resolved in a different fix.", "id": 171876, "time": "2013-12-21T21:20:43Z", "creator": "jboynes@apache.org", "creation_time": "2013-12-21T21:20:43Z", "is_private": false, "attachment_id": 31140}, {"count": 6, "tags": [], "bug_id": 55917, "text": "Patch applied to trunk as r1553187 to be included in release 8.0.0", "id": 171913, "time": "2013-12-23T19:16:45Z", "creator": "jboynes@apache.org", "creation_time": "2013-12-23T19:16:45Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 55917, "is_private": false, "text": "The patch for this has been reverted from trunk", "id": 171919, "time": "2013-12-24T15:36:55Z", "creator": "jboynes@apache.org", "creation_time": "2013-12-24T15:36:55Z", "attachment_id": null}, {"count": 8, "text": "The new RFC6265 cookie parser (that also includes a new RFC2109 parser) correctly handles these values. I don't propose fixing the old parser.", "creator": "markt@apache.org", "is_private": false, "id": 177503, "time": "2014-09-02T15:13:54Z", "bug_id": 55917, "creation_time": "2014-09-02T15:13:54Z", "tags": [], "attachment_id": null}]