[{"count": 0, "tags": [], "bug_id": 55920, "attachment_id": null, "id": 171884, "time": "2013-12-22T21:19:21Z", "creator": "jboynes@apache.org", "creation_time": "2013-12-22T21:19:21Z", "is_private": false, "text": "When a Cookie header is passed in \"Netscape\" format (with no RFC2109 $Version specified), quotation marks around the cookie value are stripped by Cookies#processCookieHeader.\n\nAs I read RFC2109, the user-agent is required to send a \"cookie-version\" at the start of the header. The \"value\" is defined by what was received in the SetCookie header from the server:\n   The value of the cookie-version attribute must be the value from the\n   Version attribute, if any, of the corresponding Set-Cookie response\n   header.  Otherwise the value for cookie-version is 0.\nRFC2965 has equivalent language.\n\nRFC6265 (proposed) and Netscape do not require a \"cookie-version\" to be sent. RFC6265 defines \"cookie-value\" as including the DQUOTE characters and such a interpretation is consistent with Netscape.\n\nUser-agent support for RC2109/2965 seems limited. Initial testing with Chrome shows that it appears to retains quotation marks around cookie values even when RFC2109 Version=1 cookies are set."}, {"count": 1, "tags": [], "bug_id": 55920, "is_private": false, "text": "As an example, a cookie with value «\"value\"» (I'm using angled quotes in this comment for clarity) that is set using:\n  Cookie cookie = new Cookie(\"test\", \"\\\"value\\\"\");\n  response.addCookie(cookie);\nwill correctly set a cookie in the browser with the value «\"value\"»  that will then be returned to the server. However, when the value is retrieved using getCookies() and getValue() the string returned is just «value» \n\nHowever, if the value supplied is «a\"b» then the value set in the browser becomes «\"a\\\"b\"» which does not match the value set. This will be returned to servers using the header:\n  Cookie:test=\"x\\\"y\"\nTomcat removes the leading and trailing quotes resulting a self-consistent round trip but other servers that treat this correctly as a V0 header will include those quotes in the value resulting in inconsistency.", "id": 172074, "time": "2014-01-04T18:59:41Z", "creator": "jboynes@apache.org", "creation_time": "2014-01-04T18:59:41Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "markt@apache.org", "text": "Fixed if using the Rfc6265CookieProcessor. I do not propose changing the LegacyCookieProcessor due to the risk of triggering regression issues for applications that rely on Tomcat's current behaviour.", "id": 178317, "time": "2014-10-07T08:43:51Z", "bug_id": 55920, "creation_time": "2014-10-07T08:43:51Z", "is_private": false, "attachment_id": null}]