[{"count": 0, "attachment_id": 31150, "bug_id": 55928, "text": "Created attachment 31150\nfix POSIX shared memory support, conditioned by --enable-posix-shm\n\nWhen APR's configure script tries to decide which mechanism to use for named shared memory, it probes for POSIX.1 shm_open support first, but then it checks for SysV shared memory support and overrides the earlier decision.  Systems that support POSIX shared memory also support the older SysV shared memory API, so in practice POSIX shared memory is never selected.  If it were selected, it would not work because the apr_shm_attach function lacks the implementation for that case.\n\nThe advantage to the user that the POSIX shared memory API offers over the SysV shared memory API on systems that support both, such as Linux, is that the former refers to shared memory objects by name, whereas the latter refers to them by a 32-bit key_id.  The ID is prone to collisions.  The fix in [bug 53996] presumably reduces the probability of colliding on this ID, but the shm_open API does not have an ID collision problem in the first place.\n\nThe attached patch moves the probe for shm_open (POSIX shm) after the probe for shmget (SysV shm), but also makes the shm_open probe conditioned by a new configure option: --enable-posix-shm, so that this does not change the decision in practice for people who do not opt into the change.\n\nThe patch also corrects a few problems that were preventing the existing implementation from working correctly when the named shared memory decision was to use the POSIX shared memory API.  In particular, the names of shared memory objects should not contain slashes after the leading slash, and therefore this patch encodes the passed-in shm name to comply with the API requirement.\n\n\nDescription header for the patch:\n\nfix POSIX shared memory support, conditioned by --enable-posix-shm\n\n* Probe for POSIX shared memory after probing for SysV IPC because\n  otherwise SysV IPC always takes over.\n* Only do this if --enable-posix-shm was passed to configure.\n  This is to maintain backwards compatibility with before this change\n  when the probe was never effective.\n* Fix apr_shm_attach for when POSIX shared memory is used.\n* Encode the shm name passed to shm_open and shm_unlink to comply\n  with the functions' requirement on the format.  Without this,\n  apache httpd fails trying to create shm with slashes in the name.\n* create the POSIX shared memory with mode 0600, instead of 0644\n* destroying an unlinked POSIX shm is ok, just like for a SysV shim", "id": 171912, "time": "2013-12-23T18:24:02Z", "creator": "jh-asf@skrt.org", "creation_time": "2013-12-23T18:24:02Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "jim@apache.org", "attachment_id": null, "id": 172691, "time": "2014-01-25T04:34:40Z", "bug_id": 55928, "creation_time": "2014-01-25T04:34:40Z", "is_private": false, "text": "Thanks! I have some slight changes but will fold into 2.0-dev and 1.5-dev"}, {"count": 2, "attachment_id": null, "bug_id": 55928, "text": "This is fixed in apr 1.5.1, which is being rolled out now and will be announced in a couple of days.", "id": 174725, "time": "2014-04-19T12:21:16Z", "creator": "trawick@apache.org", "creation_time": "2014-04-19T12:21:16Z", "tags": [], "is_private": false}]