[{"count": 0, "tags": [], "text": "Hello all,\n\nThis is my first ever bug report with you guys so bare with me. To give you a bit of a background, I am currently hosting an application on a WAMP stack. For redundancy and portability I chose to move the application onto a Hyper-V Virtual Machine. I went about my business and installed the WAMP stack and made my configurations. I was careful to keep every configuration precise so I didn't cause any anomalies. \n\nUpon finalizing the move onto the new VM, I decided to try it. The operation of the Application seemed fine on both the un-secure and secure (SSL) vitrualhost. The problem however is the Apache webserver responding to SSL POST requests. The server either responds with 400 - BAD REQUEST or with nothing at all. \n\nMy first steps were to verify my configs. In the end, comparing the configurations from my old server to this new VM and literally copying the installation over to the VM yield no improvements. So my next step was to look through the logs. I threw the server into debug mode and observed the logs. Something I came across was this weird corruption with the POST request. Almost 90% of all POST requests had this corruption which I'll leave an example of below:\n\nXXX.XXX.XXX.XXX - - [28/Dec/2013:12:00:58 -0500] \"3\\xebPOST /client/v1/ HTTP/1.1\" 200 12\nXXX.XXX.XXX.XXX - - [28/Dec/2013:12:00:58 -0500] \"EFPOST /client/v1/ HTTP/1.1\" 200 12\nXXX.XXX.XXX.XXX - - [28/Dec/2013:12:00:57 -0500] \"1\\x18POST /client/v1/ HTTP/1.1\" 200 12\nXXX.XXX.XXX.XXX - - [28/Dec/2013:12:00:53 -0500] \"E=POST /client/v1/ HTTP/1.1\" 200 12\nXXX.XXX.XXX.XXX - - [28/Dec/2013:12:00:52 -0500] \"C\\x85POST /client/v1/ HTTP/1.1\" 200 12\n\nAlong with these errors core would push an error like the one below:\n\n[Fri Dec 27 22:18:47.803022 2013] [core:error] [pid 1680:tid 4516] [client XXX.XXX.XXX.XXX:49948] AH00126: Invalid URI in request t\\x0cPOST /client/v1/ HTTP/1.1\n\n\nNow this only seems to be an issue with POSTs over the SSL-connection. The POSTs over unsecure connections seems fine however. \n\nIn the end, I've pretty much isolated every variable I could think of. The only thing I see changing is the difference of running the WAMP stack on a physical machine as opposed to a Hyper-V Virtual Machine. So after a week of digging around the interwebs, consulting my more tech-literate friends, and spending hours troubleshooting, I am at a loss. \n\nAny help would be much appreciated!\n\n\n\n\n\nMy configurations are below:\n\nPhysical Box (that works perfectly)\n\nIntel Core i3-3217U\n2x4GB of RAM (8 total)\n120GB Muschkin SSD \nIntel Gigabit NIC\nWindows 7\n\nVirtualization Machine\nIntel Core i5-4430\n2x4GB of RAM (8 total)\n128 SSD\nInttel Gigabit NIC\nWindows Server 2012\n\nVirtualization Box\n4 GB RAM\n80 GB Disk Space\nMicrosoft Virtual Switch NIC\nWindows 7\n\n[I have tried countless operating systems and other Virtualization boxes. All which have had the consistent issue]\n[Other OSes I have tried for the Virtual Machine]\n[Windows 7]\n[Windows 8]\n[Windows 8.1]\n[Windows Server 2008 R2]\n[Windows Server 2012]\n[Windows Server 2012 R2]\n\n[Other OSes I have tried with HyperV host]\n[Windows Server 2012]\n[Windows Server 2012 R2]\n\n[Again I have tried a totally different box for hosting these VMs as well]", "attachment_id": null, "id": 171987, "creation_time": "2014-01-01T04:58:26Z", "time": "2014-01-01T04:58:26Z", "creator": "ev5unleash@gmail.com", "bug_id": 55942, "is_private": false}]