[{"count": 0, "tags": [], "bug_id": 56005, "attachment_id": null, "is_private": false, "id": 172367, "time": "2014-01-14T15:46:52Z", "creator": "ringzero@nym.hush.com", "creation_time": "2014-01-14T15:46:52Z", "text": "All:\nIt looks like the path checking to determin if the ISAPI redirector is serving up something from the WEB-INF or META-INF directories is either broken again, or Ranier's solution from Bug 51769 wasn't committed / carried forward.\n\nPersonally, I used Chris Schultz's patch on 1.2.32, just upgraded to 1.2.37 and found the problem had returned.\n\nNote that this does not necessarily affect mod_jk, I suspect this has more to do with how IIS enumerates path components.  Apache sends a relative path to mod_jk on windows which (in my situation) does not include WEB-INF.  IIS sends an absolute pathname, which does include WEB-INF in the path to isapi_redirect and isapi_redirect generates a 404 error.\n\nFor various purposes, I'd like to nominate that a mechanism to disable the default behavior: \nIn handle_notify_event (line 1994) -\nAdd a check before 'if (uri_is_web_inf(uri))' to see if a variable has been set via isapi_redirect.properties that defines whether URI path checking for WEB-INF / META-INF should be done.\n\nThat way, the server admin can decide whether IIS, Tomcat or the redirector should do path checking (or all three).  This will also aid in webapp debugging and backward compatibility.\n\nSystem:\nWindows Server 2008R2 x64\nIIS 7.5\nTomcat 7.0.35 x64\nisapi_redirector.dll version 1.2.37 x64"}, {"count": 1, "tags": [], "text": "Note that PR 51769 was about erroneously rejecting a request as invalid, because not only requests to objects underneath web-inf and meta-inf were blocked, but also requests to resources that contained web-inf or meta-inf as substrings in their uri, like /a/b/c/web-inf.xml. Such requests are allowed though and after fixing 51769 should work. Only requests to metra-inf or web-inf or any resource underneath them must be rejected.\n\nCan you please clarify:\n\n- which URL are you using when you observe a problem\n- what is the expected response\n- what is the actual response\n- what are the contents of access and error logs (iis, tomcat) if any\n\nThanks!", "is_private": false, "id": 172416, "creator": "rainer.jung@kippdata.de", "time": "2014-01-16T10:33:54Z", "bug_id": 56005, "creation_time": "2014-01-16T10:33:54Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 56005, "is_private": false, "text": "Can we please get any feedback on the open questions? I need some more details about your test case.", "id": 180200, "time": "2015-01-07T10:22:35Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2015-01-07T10:22:35Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "rainer.jung@kippdata.de", "text": "No feedback providedfor 1.5 years. I can't see any error with web-inf / meta-inf handling currently. So closing as INVALID.", "id": 185060, "time": "2015-09-09T18:29:55Z", "bug_id": 56005, "creation_time": "2015-09-09T18:29:55Z", "is_private": false, "attachment_id": null}]