[{"attachment_id": null, "tags": [], "creator": "simone.bordet@gmail.com", "is_private": false, "count": 0, "id": 172437, "time": "2014-01-17T08:23:30Z", "bug_id": 56025, "creation_time": "2014-01-17T08:23:30Z", "text": "The current order of invocation (from http://svn.apache.org/repos/asf/tomcat/trunk/java/org/apache/tomcat/websocket/server/UpgradeUtil.java) is:\n\ncheckOrigin()\ngetNegotiatedSubprotocol()\ngetEndpointInstance()\nmodifyHandshake()\n\nJSR 356 is guilty for not specifying this order, but I believe a different order is more useful. \nBelow I refer to \"the application\" as a subclass of the ServerEndpointConfig.Configurator implemented by end users.\nI'd like to propose this new order:\n\nmodifyHandshake() as first: this allows applications to query/store information about the upgrade request (for example, the URI);\n\ncheckOrigin() as second: this allows applications to check the origin with more information available, because the request/response are available from the previous call and therefore checks of the origin against the request URI and/or other HTTP headers will be possible;\n\ngetNegotiatedSubprotocol() as third: this should be always invoked, while right now it is not invoked if the client does not specify the Sec-WebSocket-Protocol header; this is not ideal since the server may have been configured with a sub-protocol, but the application is never called to check what the client has sent;\n\ngetEndPointInstance() as last: there is no point in creating the endpoint if the other methods returned a failure, nor there is point to invoke any other method if this one returned null.\n\nThe current order also does not invoke method getNegotiatedExtensions(), but as far as I understand extensions are not yet supported.\nI believe this method should be eventually invoked as fourth, before getEndPointInstance().\n\nThanks !"}, {"attachment_id": null, "tags": [], "creator": "markt@apache.org", "text": "JSR356 specifies at least some of the order. Unfortunately, JSRs have a nasty habit (one I have tried and failed to stop) of splitting information between the spec doc and the Javadoc. You have to read both.\n \nThe Javadoc for ServerEndpointConfig.Configurator.modifyHandshake() has some information on ordering. It requires that modifyHandshake() is called after checkOrigin(), getNegotiatedExtensions() and getNegotiatedSubprotocol()\n\nThe discussion on this topic on the EG mailing list did mention getEndpointInstance() happening after modifyHandshake() and I agree that makes sense.\n\nI also agree that getNegotiatedSubprotocol() should always be called.\n\nYou are correct that Tomcat doesn't support any extensions at the moment. That said, I hope to be adding compression support so I'll add the call to getNegotiatedExtensions() while I am making changes here.", "count": 1, "id": 172441, "time": "2014-01-17T11:41:41Z", "bug_id": 56025, "creation_time": "2014-01-17T11:41:41Z", "is_private": false}, {"count": 2, "text": "Fixed in trunk for 8.0.0. I opted not to add the extension header handling as that requires a little more work to parse the headers.\n\nI also back-ported the changes to 7.0.x for 7.0.51 onwards.", "bug_id": 56025, "attachment_id": null, "id": 172442, "time": "2014-01-17T12:00:21Z", "creator": "markt@apache.org", "creation_time": "2014-01-17T12:00:21Z", "tags": [], "is_private": false}]