[{"count": 0, "tags": [], "text": "We are trying to use FarmWarDeployer at the moment, however it fails ocassionally on the \"slave\" nodes with the following log message:\n\nJan 22, 2014 11:00:23 AM org.apache.catalina.ha.deploy.FarmWarDeployer messageReceived\nSEVERE: Application [/xxx] is being serviced. Touch war file [xxx.war] again!\n\nIt occurs sporadically and after touching the war the deployment usually works in a second try. However it is pretty annoying because we always have to check if deployment might have failed or not on individual nodes.\n\n-----------------\n\nEmail Feedback from Mark:\n\nIt usually means that the manager application or the auto deployment code is doing something (starting, stopping, deploying, undeploying etc) the web application.\n\nThe Javadoc looks like it could do with some fixes.\n\nLooking at the docs and the code, the problem is that the FarmWarDeployer writes the WAR to the appBase and then marks it is serviced. This means that the auto deployment code may get there first which confuses the FarmWarDeployer.\n\nI'd say this is a bug in the FarmWarDeployer. Please open a Bugzilla entry.\n\nAs a work-around, you should be able to disable automatic deployment (untested).", "is_private": false, "bug_id": 56051, "id": 172615, "time": "2014-01-22T12:29:01Z", "creator": "m.gloegl@gmail.com", "creation_time": "2014-01-22T12:29:01Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 56051, "is_private": false, "id": 172687, "time": "2014-01-24T21:00:51Z", "creator": "markt@apache.org", "creation_time": "2014-01-24T21:00:51Z", "tags": [], "text": "I've come back to this and looked at the code more carefully. I mis-read it the first time around and I can't see a potential bug here. I can see how you might be able to trigger this issue with certain configurations. Can you provide the config you are using for the FarmWarDeployer and include details of any directories that might be shared between machines."}, {"text": "Tomcat7.0.28 seems a little old.\nThis looks like the same thing as following.\nhttp://marc.info/?t=131921184900047&r=1&w=2\n\nIn addition to this bug, FarmWarDeployer has been significantly modified in Tomcat7.0.40.\nhttp://svn.apache.org/viewvc?view=revision&revision=1471259\nhttp://svn.apache.org/viewvc?view=revision&amp;revision=1468290\n\nYou can try again with the latest Tomcat.\nThe latest Tomcat7 is 7.0.50.", "tags": [], "creator": "kfujino@apache.org", "attachment_id": null, "count": 2, "id": 172707, "time": "2014-01-27T08:20:49Z", "bug_id": 56051, "creation_time": "2014-01-27T08:20:49Z", "is_private": false}, {"count": 3, "tags": [], "creator": "m.gloegl@gmail.com", "attachment_id": null, "id": 172709, "time": "2014-01-27T12:28:37Z", "bug_id": 56051, "creation_time": "2014-01-27T12:28:37Z", "is_private": false, "text": "Old version might be a thing :( Unfortunately 7.0.28 is what is currently available in Debian wheezy, I will try and figure out if we can get to 7.0.50"}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I can't reproduce this with the current 7.0.x trunk.\n\nIf you are able to recreate this with the latest 7.0.x release then please feel free to re-open this bug and provide the configuration you are using.", "id": 174517, "time": "2014-04-12T20:27:38Z", "bug_id": 56051, "creation_time": "2014-04-12T20:27:38Z", "is_private": false}]