[{"count": 0, "tags": [], "bug_id": 56060, "is_private": false, "text": "Tomcat Version: 7.0.29\n\nMy server is handling requests in parallel.(Almost 50 requests per second)\n\nI can tell the parameter is intermittently missing, which is very annoying.\n\nTo be specific, the parameter key is \"app_code\" and corresponding value is \"xxxxx\" \n\nAt most time,  I can get the value by invoking method request.getParameter(\"app_code\").  However, sometimes, when the request load is high, I did get null.\n\nCould you please inform me of how to trouble shoot this issue?", "id": 172669, "time": "2014-01-24T12:00:29Z", "creator": "haperkelu@gmail.com", "creation_time": "2014-01-24T12:00:29Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 56060, "is_private": false, "id": 172670, "creation_time": "2014-01-24T12:02:02Z", "time": "2014-01-24T12:02:02Z", "creator": "markt@apache.org", "text": "Bugzilla is not a support forum. Please use the Tomcat users mailing list. What you are describing sounds like a thread safety issue with the application.", "attachment_id": null}, {"count": 2, "tags": [], "creator": "sharmasiddharth@hotmail.com", "is_private": false, "text": "Hi Mark/Pie,\n\nJust checking if there is any known issue around this in Tomcat 7.0.22\n\nWe're encountering the same issue. Few of our requests have no values in parameters map even though query string is proper.\n\n-Sid", "id": 175136, "time": "2014-05-09T23:52:35Z", "bug_id": 56060, "creation_time": "2014-05-09T23:52:35Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 56060, "text": "I had one such case -- and it was traced down to another thread making calls against a ServletRequest object.  There are all sorts of nasty race conditions around this -- ServletRequest objects are explicitly not guaranteed to be thread safe by the serlvet spec and Tomcat's most certainly are not.  So I'd first be absolutely certain that you're making no use of ServletRequest objects from other threads than the request handling threads.  [And if you absolutely must, then you'll need to be super careful to do all sorts of things just right -- and I'd assume you didn't...]\n\nAnd as others have stated, Bugzilla is not a support forum.  Asking about the bug on the mailing lists would be more appropriate than adding comments to it.", "id": 175243, "attachment_id": null, "creator": "jessh@ptc.com", "creation_time": "2014-05-15T11:48:58Z", "time": "2014-05-15T11:48:58Z", "is_private": false}]