[{"count": 0, "tags": [], "bug_id": 56073, "attachment_id": null, "id": 172728, "time": "2014-01-28T10:51:26Z", "creator": "hanno@hboeck.de", "creation_time": "2014-01-28T10:51:26Z", "is_private": false, "text": "I have a server which should have the following setup:\n* The server has a default certificate with an intermediate certificate set via SSLCertificateChainFile\n* Several virtual hosts with different certificate settings, some of them without an intermediate cert\n\nHowever, it is impossible to set this correctly with current apache httpd. The SSLCertificateChainFile global setting will affect all virtual hosts and there is no way to set a virtual host to \"no chain\". When SSLCertificateChainFile is set to an empty file, httpd will complain \"file [...] does not exist or is empty\". That's a bogus error, because it's completely valid to have an empty certificate chain.\n\nEither SSLCertificateChainFile should accept empty files as an argument (which could also be /dev/null) or there should be another way to set it to \"empty\"."}, {"count": 1, "tags": [], "bug_id": 56073, "attachment_id": null, "id": 172793, "time": "2014-01-29T16:39:12Z", "creator": "asfbugz@velox.ch", "creation_time": "2014-01-29T16:39:12Z", "is_private": false, "text": "(In reply to hanno from comment #0)\n> Either SSLCertificateChainFile should accept empty files as an argument\n> (which could also be /dev/null) or there should be another way to set it to\n> \"empty\".\n\nIt's not obvious but there is actually such a way: create a non-zero size file which does not include any BEGIN/END CERTIFICATE block. This will get you past the \"does not exist or is empty\" check, and ssl_engine_init.c:ssl_init_ctx_cert_chain() will simply skip the configuration of a chain, as it will receive zero certs when reading from such a dummy file.\n\nThat being said, I have just proposed a backport of what I consider a more systematic way of configuring certificate chains in 2.4.x - see r1562500. It was added to trunk about a month ago, and while it will no longer allow setting a global SSLCertificateChainFile, it has the advantage of being able to configure per-certificate chains when multi-algorithm certs are configured (needs OpenSSL 1.0.2)."}, {"count": 2, "tags": [], "bug_id": 56073, "text": "fully agree\n\nfor all VHosts I create (using a template for a full TLS setup), I copy a default chain file which contains an explicit comment line like '# please add the certificate chain here if needed'\n\nI think it's simpler than editing my templatized config file and make a dirty comment on the 'SSLCertificateChainFile' line when no chain is needed", "id": 172805, "time": "2014-01-30T09:27:40Z", "creator": "egarreau@gmail.com", "creation_time": "2014-01-30T09:27:40Z", "is_private": false, "attachment_id": null}]