[{"count": 0, "attachment_id": null, "creator": "markt@apache.org", "text": "I am currently evaluating a code-signing service for the ASF using Tomcat as a test case. It would help if folks who use Tomcat on Windows could provide use cases where they currently receive a warning so I can figure out what needs to be signed and test those use cases with signed versions.\n\nSo far the only test case I have is:\n- Windows 7 Pro. Install Tomcat 8.0.0-RC10 form the installer.\n  Attempting to use tomcat8w.exe triggers a warning if it is not\n  signed. When it is signed there is still a warning but one that\n  is less severe and includes the information that it has been signed\n  by the ASF.\n\nMore test cases welcome. Please provide OS version details and steps to re-create from a clean Tomcat install.\n\nPlease add your test cases here.", "id": 172755, "time": "2014-01-28T17:12:48Z", "bug_id": 56079, "creation_time": "2014-01-28T17:12:48Z", "tags": [], "is_private": false}, {"count": 1, "attachment_id": 31260, "bug_id": 56079, "text": "Created attachment 31260\nScreenshot 1 - UAC warning for a signed executable", "id": 172758, "time": "2014-01-28T19:37:10Z", "creator": "kpreisser@apache.org", "creation_time": "2014-01-28T19:37:10Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": 31261, "bug_id": 56079, "text": "Created attachment 31261\nScreenshot 2 - UAC warning for a non-signed executable", "id": 172759, "time": "2014-01-28T19:37:31Z", "creator": "kpreisser@apache.org", "creation_time": "2014-01-28T19:37:31Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 56079, "text": "Created attachment 31262\nScreenshot 3 - Explorer warning for a signed downloaded file", "id": 172760, "time": "2014-01-28T19:37:56Z", "creator": "kpreisser@apache.org", "creation_time": "2014-01-28T19:37:56Z", "is_private": false, "attachment_id": 31262}, {"count": 4, "tags": [], "text": "Created attachment 31263\nScreenshot 4 - Explorer warning for a non-signed downloaded file", "attachment_id": 31263, "id": 172761, "creator": "kpreisser@apache.org", "time": "2014-01-28T19:38:14Z", "bug_id": 56079, "creation_time": "2014-01-28T19:38:14Z", "is_private": false}, {"count": 5, "tags": [], "creator": "kpreisser@apache.org", "text": "Created attachment 31264\nScreenshot 5 - IE warning for a non-signed downloaded executable", "id": 172762, "time": "2014-01-28T19:38:37Z", "bug_id": 56079, "creation_time": "2014-01-28T19:38:37Z", "is_private": false, "attachment_id": 31264}, {"count": 6, "tags": [], "text": "Hi Mark,\n\nI wanted to provide some general information on when Windows will show a warning when running an signed or non-signed executables.\n\nSince Windows Vista, Windows has UAC (User Account Control) which ensures that a user which is a member of the Administrators group normally runs programs with non-admin rights, but only when the user explicitely runs a program as Administrator (either because he right-clicked on it and selected \"Run as Administrator\", or because the EXE has a manifest that requests admin-level access), the programm will run with administrative rights.\n\n\n1) If the user is an Administrator and UAC is enabled, or the user is not an Administrator, and he wants to start an executable with administrative rights from a program that runs with non-admin rights (e.g. explorer.exe), Windows will show the warning from Screenshot 1 if the executable is signed, and a warning from Screenshot 2 if the executable is not signed.\n\nNote that this does not happen when the executable is started from a process that runs already with admin rights (e.g. when running cmd.exe as Admin), or if you use the integrated Administrator account that is the default account on Server editions of Windows (e.g. Windows Server 2012), as in this case even if UAC is enabled, the integrated Administrator account always runs with admin rights. This does not happen with other Admin accounts that have been created by a user.\n\n\n2) If the user wants to start a process with the same level (a non-admin explorer starts a process as non-admin, or an admin explorer starts a process as admin), and the file has been downloaded by a browser like Internet Explorer so that is has been marked as downloaded, then Windows will show the warning from Screenshot 3 if the file is signed, and the warning from Screenshot 4 if it is not signed.\n\nYou can see if a file is marked as downloaded, when right-clicking on it, selecting \"Properties\" and then looking at the bottom of the file dialog.\nIf it shows \"Security: This file came from another computer and might be blocked to help protect this computer.\", then it is marked as downloaded, but you can remove that mark by clicking on \"Unblock\".\n\nThis warning does only seem to show when the process is started by Explorer.\n\nWhen you downloaded a .zip file (e.g. downloading Tomcat 8 as .zip), most extractor programs like WinRAR or Windows Explorer will retain the \"downloaded\" status of the .zip file for every extracted file. I.e. if you extract apache-tomcat-8.0.0-RC10-windows-x64.zip with WinRAR and the zip as been marked as downloaded, then also Tomcat8w.exe will have that mark, so the warning will show when you start Tomcat8w.exe with UAC disabled or from the integrated Administrator account.\n\nNote that with my testing, IE and Chrome both marked .exe and .zip files with this \"downloaded\" flag, but Firefox only marked .exe files, but not .zip ones.\n\nAdditionally, IE shows a warning when downloading a non-signed .exe file, as shown on Screenshot 5.\n\n\n\nI tried following use case for installing a Tomcat 8 service on Windows Server 2012 R2 with a newly created administrator account (but with UAC enabled):\n\n1) Downloading the \"64-bit Windows zip\" with IE and extracting it with Windows Explorer.\n2) Opening cmd.exe with non-admin rights (in the explorer window, click menu \"File\", \"Open command prompt\".\n3) Change to the Tomcat\\bin directory, then running \"service install\"\n4) I get the warning from screenshot 3, that \"Tomcat8.exe\" is from an unknown publisher and wants to to administrative changes on the computer.\n5) If I click Yes, this warning disappears, but then displays again two times. So, overall this warning displayed three times when running \"service install\". (If the Tomcat8.exe was signed, the warnings would show that it is signed, but still would appear three times - I think this install script should be changed so that Tomcat8.exe is only called once).\n6) Running Tomcat8w.exe, from the explorer, I get the warning that it is not signed and wants to be run with admin rights.\n7) From the cmd.exe, I run \"service uninstall\", I get the warning for Tomcat8.exe, but only one time.\n\nNote that when running an elevated cmd.exe (\"File\" -> \"Open command prompt\" -> \"Open command prompt as administator\"), I do not get any of the warnings.\n\n\nWhen trying the use case with the Windows Service installier (apache-tomcat-8.0.0-RC10.exe), then I get warnings when\n1) Running the installer,\n2) after installation is complete, run \"Configure Tomcat\" or \"Monitor Tomcat\" from the Start screen which both run \"tomcat8w.exe\".\n\nWhen I uninstall Tomcat from Control Panel -> Programs and Features, it shows some certificate from Windows or the Windows installer, so there is no warning here that it is unsigned.\n\nSo for me, the files where Windows showed a warning that they are not signed, were:\n1) apache-tomcat-8.0.0-RC10.exe\n2) tomcat8.exe\n3) tomcat8w.exe", "attachment_id": null, "id": 172763, "creator": "kpreisser@apache.org", "time": "2014-01-28T19:39:00Z", "bug_id": 56079, "creation_time": "2014-01-28T19:39:00Z", "is_private": false}, {"count": 7, "tags": [], "text": "(In reply to Konstantin Preißer from comment #6)\n> 4) I get the warning from screenshot 3, that \"Tomcat8.exe\" is from an\n> unknown publisher and wants to to administrative changes on the computer.\n\nSorry, that should read \"I get the warning from screenshot 2\".", "attachment_id": null, "id": 172764, "creator": "kpreisser@apache.org", "time": "2014-01-28T19:43:31Z", "bug_id": 56079, "creation_time": "2014-01-28T19:43:31Z", "is_private": false}, {"count": 8, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 172765, "time": "2014-01-28T19:44:19Z", "bug_id": 56079, "creation_time": "2014-01-28T19:44:19Z", "is_private": false, "text": "Many thanks. That is all incredibly useful."}, {"count": 9, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "is_private": false, "id": 172766, "time": "2014-01-28T19:55:15Z", "bug_id": 56079, "creation_time": "2014-01-28T19:55:15Z", "text": "Using signature to verify integrity of files,\non example of TortoiseSVN installer (a *.msi file)\nhttp://tortoisesvn.net/msiverify.html\n\nLooking at files in an installed TortoiseSVN, all *.exe and *.dll files there are signed as well."}, {"count": 10, "attachment_id": null, "bug_id": 56079, "text": "I've fixed the issue with service.bat calling tomcat8.exe three times. It now calls it once.", "id": 172942, "time": "2014-02-07T19:59:58Z", "creator": "markt@apache.org", "creation_time": "2014-02-07T19:59:58Z", "tags": [], "is_private": false}, {"count": 11, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 173691, "time": "2014-03-07T16:50:10Z", "bug_id": 56079, "creation_time": "2014-03-07T16:50:10Z", "is_private": false, "text": "*** Bug 49161 has been marked as a duplicate of this bug. ***"}, {"count": 12, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "This has been fixed for Tomcat 8.0.14 onwards.\n\nThe service runner (tomcat8.exe), the service manager (tomcat8w.exe) and the Windows installer are all now signed.\n\nThe uninstaller is not signed. Since it is generated automatically by NSIS and embedded in the installer, I haven't yet figured out a way to sign this.\n\nThe other question is do we want to back-port this to 7.0.x?", "id": 178091, "time": "2014-09-24T20:48:55Z", "bug_id": 56079, "creation_time": "2014-09-24T20:48:55Z", "is_private": false}, {"count": 13, "tags": [], "creator": "knst.kolinko@gmail.com", "text": "(In reply to Mark Thomas from comment #12)\n> \n> The uninstaller is not signed. Since it is generated automatically by NSIS\n> and embedded in the installer, I haven't yet figured out a way to sign this.\n\nThere is the following article at their site:\nhttp://nsis.sourceforge.net/Signing_an_Uninstaller\n\n> The other question is do we want to back-port this to 7.0.x?\n\nI think yes, but we may wait until we get real feedback for using this feature in Tomcat 8.", "id": 178092, "time": "2014-09-24T21:22:05Z", "bug_id": 56079, "creation_time": "2014-09-24T21:22:05Z", "is_private": false, "attachment_id": null}, {"count": 14, "tags": [], "bug_id": 56079, "attachment_id": null, "id": 178106, "time": "2014-09-25T08:38:41Z", "creator": "markt@apache.org", "creation_time": "2014-09-25T08:38:41Z", "is_private": false, "text": "Thanks for the uninstaller pointer. I think I can see a way to make that work but, as I suspected, we will need to signing events."}, {"count": 15, "attachment_id": null, "bug_id": 56079, "text": "The build script and installer script have been modified to sign the uninstaller. This change has been made in 8.0.x and will be included in 8.0.15 onwards.", "id": 178370, "time": "2014-10-09T16:12:22Z", "creator": "markt@apache.org", "creation_time": "2014-10-09T16:12:22Z", "tags": [], "is_private": false}, {"count": 16, "attachment_id": null, "bug_id": 56079, "text": "(In reply to Konstantin Kolinko from comment #13)\n> (In reply to Mark Thomas from comment #12)\n> > The other question is do we want to back-port this to 7.0.x?\n> \n> I think yes, but we may wait until we get real feedback for using this\n> feature in Tomcat 8.\n\n+1 to back-porting, +1 to waiting for feedback", "id": 178384, "time": "2014-10-10T17:43:14Z", "creator": "chris@christopherschultz.net", "creation_time": "2014-10-10T17:43:14Z", "tags": [], "is_private": false}]