[{"count": 0, "attachment_id": null, "creator": "stimmins@wiley.co.uk", "text": "Compiling httpd v2.2.x (have tried 2.2.11, 2.2.22 and 2.2.26) on an Oracle T4 we get an occational SSL error in a seemingly random fashion.\n\nI have tried a couple of different versions of openssl as well.\n\nIf I compile on an Oracle SPARC V445 and then copy mod_ssl.so into the install compiled on the T4 the the error does not occur.\n\nThe differences in the source tree after running the same configure on both machines are minor. Consisting of\n\n1) config.log and config.status files \n2) HAVE_FDATASYNC is set to 1 in srclib/apr/include/arch/unix/apr_private.h on the T4 compile\n3) A minor difference in srclib/apr-util/include/apu.h, srclib/apr-util/include/private/apu_config.h and srclib/apr-util/Makefile because an sqlite3 compatible library is on one of the machines and not the other.\n\ngcc version used v3.4.6 (without GNU binutils)\nopenssl versions tried 0.9.8 and 1.0.0\nOS: Solaris 10\n\nFrom the error log we do not usually get any entries at all. In testing we sometimes get the following line, but there is no evidence it is related.\n\n\"[warn] (45)Deadlock situation detected/avoided: Failed to acquire SSL session cache lock\"\n\nIt is possible the error occurs more often during higher load, as it happenes very rarely under low load, but this eveluation is more than a little subjective at the moment.\n\nThe SSL error as seen in the browser is:\n\n\"An error occurred during a connection to sp.onlinelibrary.wiley.com. SSL received an unexpected New Session Ticket handshake message. (Error code: ssl_error_rx_unexpected_new_session_ticket)\n\n The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.\n  Please contact the web site owners to inform them of this problem. Alternatively, use the command found in the help menu to report this broken site.\"\n\nI realise this may not be an apache httpd problem, but I have to start somewhere.", "id": 172810, "time": "2014-01-30T13:13:02Z", "bug_id": 56091, "creation_time": "2014-01-30T13:13:02Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "text": "There are a lot of variations and more than one symptom.  I don't have a magic answer, but some hints below should help eliminate some of the search space.\n>HAVE_FDATASYNC\nUnless you have third-party modules that use apr_file_datasync(), this won't affect httpd.\n> sqlite3\nI think you would have had to explicitly configure the use of such a db in httpd (e.g., for session cache) for this to have made a difference.\nYou can eliminate this variation by adding \"--without-sqlite3\" to the configure options.\n> (45)Deadlock situation detected/avoided: Failed to acquire SSL session cache lock\nYou need to configure a different SSL mutex.  Unless you have child process crashes (messages with \"exit signal\" in your error log), set \"SSLMutex pthread\".  This happens due to a poor default mutex choice for Solaris (fixed in apr 1.3.10) *OR* from your configuration of \"SSLMutex fcntl\".  (Or I'm confused.)  If you have process crashes (\"exit signal\"), you need to get cores and backtraces.  Please let us know if that is happening.\n.\nPerhaps somebody recognizes the session ticket error.\n.\nWhat level of APR is being compiled with and used at runtime?  (This is displayed from \"httpd -V\".)", "is_private": false, "bug_id": 56091, "id": 172811, "time": "2014-01-30T13:26:43Z", "creator": "trawick@apache.org", "creation_time": "2014-01-30T13:26:43Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "stimmins@wiley.co.uk", "attachment_id": null, "text": "The version os of APR are those that come with the particular version of the source. From the outpout of httpd -V:\n\nhttpd v2.2.11 -> apr v1.3.3, apr-util v1.3.4\nhttpd v2.2.22 -> apr v1.4.5, apr-util v1.4.1\nhttpd v2.2.26 -> apr v1.4.8, apr-util v1.5.2\n\nThe configure line used to build all three versions was:\n\n./configure \\\n    --prefix=/apps/wps/common/httpd-2.2.26 \\\n    --enable-so \\\n    --with-mpm=worker \\\n    --enable-cgid \\\n    --with-ssl=/usr/local/ssl \\\n    --enable-mods-shared=\"all ssl cache proxy authn_alias mem_cache file_cache charset_lite dav_lock disk_cache\"\n\nBut no other changes to the configure environment were made. We don't actually use sqlite3.\n\nWe are getting both \"exit signal Bus error (10)\" and \"exit signal Segmentation fault (11)\" but no cores at the moment, I'll find out what is happening to them and get a backtrace. We are only getting these on the production server which is running the shibboleth apache module.\n\n\"SSLMutex pthread\" got rid of the Deadlock warning on the server we are testing this on (which is not producing any cores). And I can generate the SSL error without any core messages in the error log on the production server.\n\nI'll continue digging", "id": 172813, "time": "2014-01-30T14:28:04Z", "bug_id": 56091, "creation_time": "2014-01-30T14:28:04Z", "is_private": false}, {"text": "Since you have a working setup with the same httpd version on a v445, you could build the webserver on that system against the same OpenSSL-Version as on the T4. That would allow you to simply swap the OpenSSL binary library file (so file) on the T4 and replace it with the file from the V445 to check, whether the OpenSSL lib itself makes the difference (which I suspect).\n\nRegards,\n\nRainer", "tags": [], "bug_id": 56091, "is_private": false, "count": 3, "id": 172814, "time": "2014-01-30T15:25:55Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2014-01-30T15:25:55Z", "attachment_id": null}]