[{"count": 0, "tags": [], "creator": "rwilson.2@gmail.com", "attachment_id": null, "is_private": false, "id": 172873, "time": "2014-02-03T15:54:02Z", "bug_id": 56103, "creation_time": "2014-02-03T15:54:02Z", "text": "In the \"HTTP Request Defaults\" configuration, you have the option to set the default value for \"Retrieve All Embedded Resources\" for your test case. This works great from the GUI mode, since all you have to do to alter the way your testcase works is to check or uncheck the box next to the setting.\n\nBut, if you want to override a default value of \"false\" when running in non-gui mode, there doesn't appear to be any way to accomplish this. It would be easy enough to write a script to look for the XML value, and switch it from 'false' to 'true' - but the line is omitted from the saved 'jmx' file if the saved value is 'false', so you can't even easily alter it that way.\n\nIdeally, this would be a jmeter property value that would be overridden with a \"-Jjmeter.httpsampler.parse_images=false\" command line switch."}, {"count": 1, "tags": [], "bug_id": 56103, "attachment_id": null, "id": 177456, "time": "2014-08-30T13:45:17Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2014-08-30T13:45:17Z", "is_private": false, "text": "Maybe this should be tackled by a concept similar to Profiles in Maven/Gradle.\n\nI think it would be great to be able to have a Profile component that references a set of Properties of 1 environment.\n\nAnd also be able to associate Config elements to a named profile.\n\nExample but it would be a solution for all  checkbox, radio box or select box config elements:\n\nProfile (TEST_WITHOUT_IMAGES) : enabled\nProfile (TEST_WITH_IMAGES) : Disabled\n\nHttpRequestDefault associated to profile TEST_WITHOUT_IMAGES\nHttpRequestDefault associated to profile TEST_WITH_IMAGES\nThe rest of the test plan\n\nDepending on the enabled profile(s) the config elements would be enabled or disabled.\n\nOpinions ?\n\nAnyway changing this to enhancement as it is not a bug."}]