[{"count": 0, "tags": [], "bug_id": 56126, "attachment_id": 31299, "text": "Created attachment 31299\nSource of the test app\n\nHi,\n\nReporting regression with Spring LTW with AspectJ Load-Time Weaving.\n\nSpring framework version 3.0.7\nAspectJ version 1.6.12\n\nI've attached the test application. \nPlease note that it is confirmed working with older Tomcat 8 versions and Tomcat 7.0.29, Tomcat 7.0.50\n\n\nThe expected output of the test app when accessing app root: 'one'\nThe actual output of the test app: 'none'\n\ndeployready / compiled app available:\nhttp://www.speedyshare.com/7zYst/springLtw30-aspect1.zip\n\nadded source as an attachment", "id": 172978, "time": "2014-02-10T12:02:08Z", "creator": "joonas.wali@gmail.com", "creation_time": "2014-02-10T12:02:08Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 56126, "attachment_id": null, "is_private": false, "id": 172981, "time": "2014-02-10T15:45:07Z", "creator": "markt@apache.org", "creation_time": "2014-02-10T15:45:07Z", "text": "Please do not use speedy share to share files. Not only does it require developers to download their \"special\" download manager which is annoying, that download manager attempts to install a whole pile of garbage at the same time. There are plenty of other ways to share files of a few MB at zero cost."}, {"count": 2, "tags": [], "bug_id": 56126, "attachment_id": null, "is_private": false, "id": 172982, "time": "2014-02-10T17:30:27Z", "creator": "markt@apache.org", "creation_time": "2014-02-10T17:30:27Z", "text": "Spring is loading the bean before it has configured the Transformer for the class loader.\n\nThis will have worked in previous versions as Spring used a different mechanism to weave the classes."}, {"count": 3, "tags": [], "creator": "nicholas@nicholaswilliams.net", "attachment_id": null, "id": 172984, "time": "2014-02-10T18:41:13Z", "bug_id": 56126, "creation_time": "2014-02-10T18:41:13Z", "is_private": false, "text": "Joonas, hopefully this information will help you some:\n\nTraditionally, Spring Framework has provided the TomcatInstrumentableClassLoader  (which extends Tomcat's standard WebappClassLoader) that enables load time weaving in Tomcat. In order to use Spring Framework's load time weaving, you had to configure Tomcat to use the TomcatInstrumuntableClassLoader instead of Tomcat's standard WebappClassLoader. Undoubtedly this is what you are used to.\n\nSignificant changes were made to the WebappClassLoader in Tomcat 8.x. Many of these changes are incompatible with Spring's TomcatInstrumentableClassLoader. For example, the new WebappClassLoader is now instrumentable on its own, without being extended. How WebappClassLoader handles resources has also changed significantly, which may also have broken the TomcatInstrumentableClassLoader. To resolve these problems, you should not use the TomcatInstrumentableClassLoader anymore.\n\nIf you want to use Tomcat 8.0, you need to upgrade to Spring Framework 4.0 and remove the TomcatInstrumentableClassLoader from the context file. Spring will automatically detect the instrumentable WebappClassLoader, and it will then automatically configure the new TomcatLoadTimeWeaver as a result.\n\nI hope this helps."}, {"count": 4, "text": "Hi Mark and Nick,\n\nThank you for the detailed explanation, that helps. Our application requires testing different frameworks on many containers. Since the use case with those library versions is valid on many other containers, including older tomcat 8 versions, we just assumed that it should run there correctly and therefore is a regression if it does not. We don't really need to run it, if it is considered an invalid use case with these library versions.\n\nAnd sorry for the bad choice of filesharing site. Since it popped out as the first one in the google for me, I assumed it was a popular one.\n\nThanks!", "bug_id": 56126, "attachment_id": null, "id": 172985, "time": "2014-02-10T18:55:53Z", "creator": "joonas.wali@gmail.com", "creation_time": "2014-02-10T18:55:53Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 56126, "attachment_id": null, "is_private": false, "id": 173029, "time": "2014-02-13T16:04:17Z", "creator": "larrys@apache.org", "creation_time": "2014-02-13T16:04:17Z", "text": "Would it be worth noting this specific case on the migration page? \nhttp://tomcat.apache.org/migration-8.html"}, {"count": 6, "tags": [], "creator": "riyaskt25@gmail.com", "attachment_id": null, "is_private": false, "id": 186468, "time": "2015-11-21T12:03:58Z", "bug_id": 56126, "creation_time": "2015-11-21T12:03:58Z", "text": "Hi,\n\nAs part of migration form tomcat7 to 8 When I removed the spring instrument load time weaver from context.xml file of my spring  web application\n\n>> All beans loaded under the dispatcher serverlet are weaved properly \nbut\nBean declared in application context loaded by contextLoaderListner is not weaved \n\nIt this tomcat8 class loader issue ?\nPlease suggest any possible alternatives.."}, {"count": 7, "tags": [], "bug_id": 56126, "attachment_id": null, "is_private": false, "id": 189895, "time": "2016-04-01T16:30:54Z", "creator": "mdavis@emergencycallworx.com", "creation_time": "2016-04-01T16:30:54Z", "text": "We are using spring-instrumentation on load using spring-instrument-tomcat-4.2.4\n\nBased on what I'm reading, TomcatInstrumentableClassLoader is no longer required in context.xml.\n\nHowever up until 8.033, the following worked in context.xml: \n<Loader loaderClass=\"org.springframework.instrument.classloading.tomcat.TomcatInstrumentableClassLoader\"/>\n\nTomcatInstrumentableClassLoader does not work as of 8.033.\n\nThis is more of a note that something has changed between 8.032 and 8.033 that impacts spring load time weaving.\n\nFor our application, TomcatInstrumentableClassLoader is required to work correctly in 8.032, TomcatInstrumentableClassLoader needs to be pulled to work correctly in 8.033."}, {"count": 8, "text": "Did a quick test on 8.0.33 and I can confirm the regression.\nBut I guess we need a new issue for this.", "bug_id": 56126, "attachment_id": null, "id": 189931, "time": "2016-04-04T08:17:37Z", "creator": "andrei.ivanov@gmail.com", "creation_time": "2016-04-04T08:17:37Z", "tags": [], "is_private": false}, {"count": 9, "tags": [], "bug_id": 56126, "attachment_id": null, "text": "(In reply to Andrei Ivanov from comment #8)\n> Did a quick test on 8.0.33 and I can confirm the regression.\n> But I guess we need a new issue for this.\n\nPlease do so.\n\nRegards,\nVioleta", "id": 189932, "time": "2016-04-04T08:35:51Z", "creator": "violetagg@apache.org", "creation_time": "2016-04-04T08:35:51Z", "is_private": false}, {"count": 10, "tags": [], "creator": "andrei.ivanov@gmail.com", "attachment_id": null, "is_private": false, "id": 189935, "time": "2016-04-04T10:18:54Z", "bug_id": 56126, "creation_time": "2016-04-04T10:18:54Z", "text": "Done, see 59270"}]