[{"count": 0, "tags": [], "text": "Hi all,\n\nForgive me if this has been fixed since 1.4.1 but I couldn't find anything \nabout this in bugzilla.\n\nFor some reason if I have a class with an inappropriate package name (that does \nnot match it's directory structure), ant doesn't seem to catch any error from \nthe compiler (i've tested on jikes 1.14 and Sun's javac 1.3.1 on win2k and \njikes 1.15 and Sun's javac 1.3.1 on debain linux 2.2.19).  When not in ant, the \ncompiler normally will spit out an error that the package name does not match \nthe directory structure.  Ant does not give me an error, yet instead, compiles \nand places into my classes directory based upon the package name (instead of \nthe directory structure).  I'm assuming this bug passed any lots of testing b/c \nin my particular case, it didn't break any of my import statements by luck \nsince anything using my misnamed package name imported the full classpath to \nwhere it got incorrectly compiled, also.  I was not able to get any strange \noutput in ant's verbose mode, either.\n\nRegardless somehow ant 1.4.1 seems to not catch these standard compilation \nerrors.  Has anyone else experienced this?  If not, please lemme know (i can \nduplicate this if someone wants into a simple project for testing.  i figure i \nowe the jakarta team that much after the sheer number of hours I've saved using \na tool as cool as Ant!!).\n\nThanks,\nMark", "attachment_id": null, "bug_id": 5613, "id": 9192, "time": "2001-12-28T14:37:38Z", "creator": "marksmithurbana@yahoo.com", "creation_time": "2001-12-28T14:37:38Z", "is_private": false}, {"count": 1, "tags": [], "creator": "umagesh@apache.org", "attachment_id": null, "text": "I created the following dir structure r/s/t and created a java file d.java in \nit.  However, d.java's package was defined as a.b.c\nWhen I compile it using javac, I get no errors, contrary to what you claim\njavac does (ie., it does not spit out any error messages saying package name\ndoes not match directory structure).  So, I am going to mark this as invalid.\nIf you do not agree, please attach an example java file and instructions on\nhow to repeat the problem you report.\n\n", "id": 10206, "time": "2002-02-02T07:19:07Z", "bug_id": 5613, "creation_time": "2002-02-02T07:19:07Z", "is_private": false}]