[{"count": 0, "tags": [], "creator": "andre.gebers@yahoo.de", "attachment_id": 31306, "is_private": false, "id": 173018, "time": "2014-02-13T05:44:51Z", "bug_id": 56132, "creation_time": "2014-02-13T05:44:51Z", "text": "Created attachment 31306\nadd support to ignore missing workbooks on formula evaluation\n\nCurrently formula evaluation with external references throw a RuntimeException (not implemented yet XSSFEvaluationWorkbook:128) but I'd like POI to use the cached value in this case. HSSFFormulaEvaluator already provides setIgnoreMissingWorkbooks(boolean ignore). The attached patch adds this functionality to the XSSFFormulaEvaluator."}, {"count": 1, "tags": [], "creator": "apache@gagravarr.org", "text": "I'd much rather someone implemented the external references support in XSSF, rather than just hiding the problem!", "id": 173023, "time": "2014-02-13T12:29:18Z", "bug_id": 56132, "creation_time": "2014-02-13T12:29:18Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "t.dettrick@uq.edu.au", "text": "Andre and I would ideally like to implement external references support too, as we're currently doing this at the application level in an incomplete way. If we do, then we'll certainly submit another patch.\n\nFor now, this patch replicates the HSSF functionality to ignore external references, which is simpler than ForkedEvaluator for developers who are happy to ignore external references but still want to evaluate local cells.\n\nThe previous behaviour is a runtime exception of \"not implemented yet\" with no easy workaround, so this is an improvement.", "id": 173037, "attachment_id": null, "bug_id": 56132, "creation_time": "2014-02-14T01:06:21Z", "time": "2014-02-14T01:06:21Z", "is_private": false}, {"count": 3, "tags": [], "creator": "apache@gagravarr.org", "text": "There is now some XSSF Formula support for external references in trunk\n\nAny chance you could review that, then either make some changes to your patch if needed, or comment that no further changes are needed if the patch is fine as-is?", "id": 176668, "attachment_id": null, "bug_id": 56132, "creation_time": "2014-07-24T17:02:35Z", "time": "2014-07-24T17:02:35Z", "is_private": false}, {"count": 4, "tags": [], "text": "As of r1614729, FormulaEvaluator now has the setIgnoreMissingWorkbooks method, and XSSF uses it. Unit tests added based on the existing HSSF case, by switching in a different base workbook to evaluate against", "is_private": false, "bug_id": 56132, "id": 176777, "time": "2014-07-30T18:09:49Z", "creator": "apache@gagravarr.org", "creation_time": "2014-07-30T18:09:49Z", "attachment_id": null}]