[{"count": 0, "attachment_id": null, "creator": "amund.elstad@gmail.com", "is_private": false, "id": 173411, "time": "2014-02-21T09:53:40Z", "bug_id": 56172, "creation_time": "2014-02-21T09:53:40Z", "tags": [], "text": "Tomcat sometimes fails to read the request body when using the AjpNioProtocol \nconnector. The symptom of this is the log message\n\nERROR org.apache.coyote.ajp.AjpMessage - Invalid message received with \nsignature  ...\n\nThe cause of this problem is the fact that the read-method in  AjpNioProcessor may read more than the requested number of bytes, if more than one readSocket call is required.\n\nThus, reading of an ajp-message can also wrongly read some or all of the next message(s) (if any). Reading of the next messages will then most likely fail with a signature error, or the content will be corrupt.\n\nThis problem is unlikely to happen unless the FORWARD_REQUEST message is larger than a network packet, and there is a request body with Content-Length > 0, so that first body chunk message immediately follows the FORWARD_REQUEST message.\n\nI have reproduced and solved this problem with Tomcat 7.0.42, but looking at the source code I believe the problem should be present in trunk as well.\n\nDescription of patch to fix the problem:\n\nThe read-method may have to make several calls to readSocket to read the\nrequested number of bytes. Alter the maximum bytes read per call so that \nthe total bytes read is never more than requested.\n\nIndex: org/apache/coyote/ajp/AjpNioProcessor.java\n===================================================================\n--- org/apache/coyote/ajp/AjpNioProcessor.java  (revisjon 1570107)\n+++ org/apache/coyote/ajp/AjpNioProcessor.java  (arbeidskopi)\n@@ -155,7 +155,7 @@\n         boolean block = blockFirstRead;\n\n         while (read < n) {\n-            res = readSocket(buf, read + pos, n, block);\n+            res = readSocket(buf, read + pos, n - read, block);\n             if (res > 0) {\n                 read += res;\n             } else if (res == 0 && !block) {"}, {"count": 1, "tags": [], "bug_id": 56172, "attachment_id": null, "text": "Thanks for the high quality bug report. A good description of the problem, analysis of the root cause and a patch. We couldn't really ask for more. Thanks!\n\nThe patch has been applied to 8.0.x and will be included in 8.0.4 onwards. It has also been applied to 7.0.x for 7.0.53 onwards.", "id": 173415, "time": "2014-02-21T12:14:11Z", "creator": "markt@apache.org", "creation_time": "2014-02-21T12:14:11Z", "is_private": false}]