[{"count": 0, "tags": [], "bug_id": 56192, "attachment_id": null, "text": "using \"SSLUseStapling On\" on a SNI vhost does not work if the first ssl-enabled vhost has \"SSLUseStapling Off\" for example if the first one has a self-signed certificate\n\nyou can verify that behavior with https://www.ssllabs.com/ssltest/\nProtocol Details -> OCSP stapling: No\n\nverified with the developer of the ssl-test where i first reported a SNI problem of the test\n\n-------- Original-Nachricht --------\nBetreff: Re: [ssllabs-discuss] incorrect SNI usage\nDatum: Tue, 04 Feb 2014 21:29:30 +0000\nVon: Ivan Ristic <ivan.ristic@gmail.com>\nAn: ssllabs-discuss@lists.sourceforge.net\n\nOn 04/02/2014 18:21, Reindl Harald wrote:\n> hi\n>\n> i just realized \"OCSP stapling No\" one one of our servers\n> well, the reason is \"SSLUseStapling Off\" on the default\n> host which is more or less a honeypot\n>\n> the vhost which was checkd has this value enabled\n> after enable it on the default host -> Yes\n>\n> both a working fine even with MSIE6 because they use\n> the same wildcard-certificate and are in the same domain\n\nMy OCSP stapling checks do use SNI, but it's possible that the SNI \ninformation does not match the virtual host.\n\nIf you can, please disable OCSP stapling in the default server and send \nme the hostname; I will check it\n______________________________________\n\n$ openssl s_client -connect secure.thelounge.net:443 -status -servername \nsecure.thelounge.net | grep OCSP\nOCSP response: no response sent\n\nI've heard of an Nginx bug that requires OCSP Stapling to be enabled in \nthe main server and not in a virtual host, but maybe Apache has the same \nproblem?", "id": 173502, "time": "2014-02-27T01:59:55Z", "creator": "h.reindl@thelounge.net", "creation_time": "2014-02-27T01:59:55Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 56192, "attachment_id": null, "text": "Should be addressed with the fix for this OpenSSL issue:\n\nhttp://rt.openssl.org/Ticket/Display.html?user=guest&pass=guest&id=3178\n\nIt's not yet in any released version of 1.0.0 or 1.0.1, but you could try 1.0.2 Beta 1 (if that doesn't fix the problem, feel free to reopen this bug).", "id": 173571, "time": "2014-03-02T14:44:26Z", "creator": "asfbugz@velox.ch", "creation_time": "2014-03-02T14:44:26Z", "is_private": false}]