[{"count": 0, "tags": [], "bug_id": 56206, "attachment_id": 31359, "id": 173574, "time": "2014-03-03T09:17:57Z", "creator": "bobruto@gmail.com", "creation_time": "2014-03-03T09:17:57Z", "is_private": false, "text": "Created attachment 31359\nPython echo server and Jmeter config\n\nA single tcp sampler within a thread group is run a few times in a row (re-use connection option is off).\nIt sends request to an echo service which has a more or less fixed response delay\nWith just 1 thread, response times reported by jmeter match up with the echo server.\nIf you increase the number of threads, response times reported by Jmeter scale in direct proportion with that number.\n\nTest scenario also includes a timer alongside the sampler which one can play with (as well as with the thread group's ramp up time) to observe various effects (2 threads, 1sec ramp up time, 200ms timer = 800ms sample times instead of 1000 without the timer)\n\n\nSteps to reproduce:\njust run the attached echo server (Python) and the Jmeter test plan with various thread group settings\n\n\nExpected results:\nSample times around 500ms regardless of the number of threads (at least until the echo server gets overwhelmed)\n\n\n\nObserved on both Windows 7 x64 and Ubuntu 13.10\njava version \"1.7.0_10\"\nJava(TM) SE Runtime Environment (build 1.7.0_10-b18)\nJava HotSpot(TM) 64-Bit Server VM (build 23.6-b04, mixed mode)\n\nJmeter 2.11.r1554548"}, {"count": 1, "tags": [], "creator": "bobruto@gmail.com", "is_private": false, "text": "...And I'll be the first to notice that the echo server attached is single-threaded. The fact that the tcp client can write the request to socket output stream before the server accepts the connection can throw one off, but otherwise Jmeter seems to behave as it should.\nNow the real question is why the actual software we're testing with JMeter demonstrates similarly serial nature when it's supposed to handle incoming requests in parallel, but that's for another issue tracker", "id": 173578, "time": "2014-03-03T11:52:20Z", "bug_id": 56206, "creation_time": "2014-03-03T11:52:20Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 56206, "attachment_id": null, "id": 173597, "time": "2014-03-03T18:11:01Z", "creator": "sebb@apache.org", "creation_time": "2014-03-03T18:11:01Z", "is_private": false, "text": "This is clearly not a JMeter problem.\n\nAs already noted on the user list, multiple threads running a TCP request against a multi-threaded HTTP server show that the TCP sampler behaves correctly."}, {"count": 3, "attachment_id": 31361, "bug_id": 56206, "is_private": false, "id": 173598, "time": "2014-03-03T18:13:22Z", "creator": "sebb@apache.org", "creation_time": "2014-03-03T18:13:22Z", "tags": [], "text": "Created attachment 31361\nSample TCP text plan with different thread counts\n\nThe attached plan shows the TCP Sampler with thread counts of 1,2,20.\n\nThe average response time is approx the same for all the thread groups."}]