[{"count": 0, "tags": [], "text": "Created attachment 31396\n[PATCH]prefork_mpm patch\n\nThis patch is originally part of the patch# 55897. Based on the feedback from httpd developer community, we decided to separate the original patch into two different patches. The SO_REUSEPORT patch and this bucket patch. Here is the information on this bucket patch: \n\nOur analysis of Apache httpd 2.4.7 prefork mpm, on 32 and 64 thread Intel Xeon 2600 series systems, using an open source three tier social networking web server workload, revealed performance scaling issues.  In current software single listen statement (listen 80) provides better scalability due to un-serialized accept. However, when system is under very high load, this can lead to big number of child processes stuck in D state. On the other hand, the serialized accept approach cannot scale with the high load either.  In our analysis, a 32-thread system, with 2 listen statements specified, could scale to just 70% utilization, and a 64-thread system, with signal listen statement specified (listen 80, 4 network interfaces), could scale to only 60% utilization. \n \nBased on those findings, we created this prototype patch for prefork mpm which extends performance and thread utilization. We modified the \"multiple listen statement case\" by creating 1 listen record for each listen statement and partitioning the child processes into different buckets. Each bucket listens to 1 IP:port. \n \nQuick tests of the patch, running the same workload, demonstrated a 10% throughput increase with 32-threads system and 2 listen statements and 20% throughput increase with 48-threads system and 2 listen statements. Both testing systems are from Intel Xeon 2600 series and Linux kernel version is 3.13.6. We also observed big reduction in response time, in addition to the throughput improvement gained in our tests 1.\n\nPlease help us review it and let us know if there is anything we might revise to improve it. Your feedback is very much appreciated.\n\nConfiguration:\n<IfModule prefork.c>\n    ListenBacklog 105384\n    ServerLimit 105000\n    MaxClients 1024\n    MaxRequestsPerChild 0\n    StartServers 64\n    MinSpareServers 8\n    MaxSpareServers 16\n</IfModule>\n \n1. Software and workloads used in performance tests may have been optimized for performance only on Intel microprocessors. Performance tests, such as SYSmark and MobileMark, are measured using specific computer systems, components, software, operations and functions. Any change to any of those factors may cause the results to vary. You should consult other information and performance tests to assist you in fully evaluating your contemplated purchases, including the performance of that product when combined with other products.\n\nThanks,\nYingqi Lu", "attachment_id": 31396, "bug_id": 56279, "id": 173884, "time": "2014-03-17T20:18:38Z", "creator": "Yingqi.Lu@intel.com", "creation_time": "2014-03-17T20:18:38Z", "is_private": false}, {"count": 1, "tags": [], "creator": "Yingqi.Lu@intel.com", "attachment_id": 31617, "is_private": false, "id": 175187, "time": "2014-05-13T19:52:41Z", "bug_id": 56279, "creation_time": "2014-05-13T19:52:41Z", "text": "Created attachment 31617\nmpm patch\n\nThis newer version of the patch extends from original prefork mpm to all three mpms for Linux OS (prefork, worker and event)"}, {"count": 2, "tags": [], "bug_id": 56279, "attachment_id": 31682, "id": 175589, "creation_time": "2014-06-02T08:18:18Z", "time": "2014-06-02T08:18:18Z", "creator": "Yingqi.Lu@intel.com", "text": "Created attachment 31682\n[PATCH]mpm patch\n\nBased on the feedback received from the developer community, I keep the ap_mpm_pod_signal() and ap_mpm_pod_killpg() exactly the same as the original ones. I modify dummy_connection() instead.", "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 56279, "is_private": false, "id": 180526, "time": "2015-01-23T10:27:02Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-01-23T10:27:02Z", "tags": [], "text": "\n\n*** This bug has been marked as a duplicate of bug 55897 ***"}]