[{"count": 0, "tags": [], "text": "I am a developer of the tool named Plumbr, which detects memory leaks in user applications. Quite a few of our clients got reports about WebappClassLoader being retained after application undeploy. Classloader is retained in \"clBindings\" static field of org.apache.naming.resources.DirContextURLStreamHandler class. This prevents application's class loader from being garbage collected and eventually leads to OutOfMemoryError: PermGen.\n\nUnfortunately, I have no steps to reproduce the issue.", "attachment_id": null, "bug_id": 56275, "id": 173867, "time": "2014-03-17T09:14:26Z", "creator": "nikita@plumbr.eu", "creation_time": "2014-03-17T09:14:26Z", "is_private": false}, {"count": 1, "tags": [], "text": "Hmm. For this to happen an exception would have to be thrown during web application stop that prevented the code that de-registers the associated class loader from being called.\n\n8.0.x is immune to this issue because the registration and deregistration code has been removed as part of the refactoring of resource handling.\n\nI've been through the 7.0.x code and I can't see any obvious way to trigger this. All the obvious exceptions that could trigger the problem are caught, logged and not re-thrown. The only exceptions excluded from the process are fatal to the JVM anyway.\n\n\nI do see a possible way to trigger this memory leak in 6.0.x but I need to do some testing to confirm it.", "attachment_id": null, "id": 173955, "creation_time": "2014-03-19T21:42:14Z", "time": "2014-03-19T21:42:14Z", "creator": "markt@apache.org", "bug_id": 56275, "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "text": "Confirmed. A filter that throws an unchecked exception on destroy can trigger this. This issue has been fixed in 7.0.x. I'll look at putting together a proposal to back-port the changes to 6.0.x", "id": 173958, "time": "2014-03-19T22:02:20Z", "bug_id": 56275, "creation_time": "2014-03-19T22:02:20Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 56275, "is_private": false, "id": 173959, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2014-03-19T22:36:16Z", "time": "2014-03-19T22:36:16Z", "text": "I've back-ported the fix and tested that it works. The fix has been proposed for 6.0.x."}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 174029, "time": "2014-03-23T09:36:51Z", "bug_id": 56275, "creation_time": "2014-03-23T09:36:51Z", "is_private": false, "text": "This has been fixed in 6.0.x and will be included in 6.0.40 onwards."}]