[{"count": 0, "tags": [], "bug_id": 56288, "is_private": false, "id": 173952, "creation_time": "2014-03-19T21:22:09Z", "time": "2014-03-19T21:22:09Z", "creator": "micha@lenk.info", "text": "Created attachment 31412\nRewrite URLs in HTML style attributes too\n\nIn HTML you can have <div> tags that have a background image by providing a style attribute. E.g. this can be done by something fancy like this:\n\n<div style=\"background:url(http://www.example.com/fancy-background.png) right 0px no-repeat; height:325px;\">\n\nCurrently mod_proxy_html doesn't rewrite the URL in such style attributes.\n\nThe attached patch tries to fix that by applying the configured string replacements also on style attributes.\n\nAdditionally it tries to make the code a bit more readable by renaming the function dump_content() to apply_urlmap(). This is what it actually does, especially after the call to AP_fwrite() has been moved outside of this function.\n\nPlease note that this patch requires the patch from issue #56284 to be applied first. Otherwise the last chunk will not apply.", "attachment_id": 31412}, {"count": 1, "tags": [], "bug_id": 56288, "attachment_id": null, "is_private": false, "id": 175580, "time": "2014-06-01T17:15:37Z", "creator": "nick@webthing.com", "creation_time": "2014-06-01T17:15:37Z", "text": "What are you trying to do that isn't supported by adding style to ProxyHTMLEvents and applying a suitable regexp?"}, {"count": 2, "tags": [], "bug_id": 56288, "attachment_id": null, "id": 177954, "time": "2014-09-18T14:44:32Z", "creator": "christophe.jaillet@wanadoo.fr", "creation_time": "2014-09-18T14:44:32Z", "is_private": false, "text": "*** Bug 56992 has been marked as a duplicate of this bug. ***"}, {"count": 3, "tags": [], "bug_id": 56288, "is_private": false, "id": 177955, "creation_time": "2014-09-18T14:56:06Z", "time": "2014-09-18T14:56:06Z", "creator": "modir@huanga.com", "text": "Can you write in the documentation in this case an example of such a regex. As you can see in my bug report I tried it with ProxyHTMLLinks which didn't work. And from reading the documentation it seems to me that it should work as well.\n\nAs a side note. I did add \"style\" to the list of ProxyHTMLEvents. And somehow it still didn't work. Could it be that only one attribute is parsed per element?", "attachment_id": null}, {"count": 4, "text": "One other thing. I did test this on an older machine with apache httpd 2.2.16 with the mod_proxy_html version 3.0.1. And there the style attribute gets parsed. So I would consider this as a bug.", "bug_id": 56288, "is_private": false, "id": 177961, "time": "2014-09-18T20:03:04Z", "creator": "modir@huanga.com", "creation_time": "2014-09-18T20:03:04Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "nick@webthing.com", "text": "(In reply to Raffael Luthiger from comment #3)\n> Can you write in the documentation in this case an example of such a regex.\n\nI'm adding ProxyHTMLLinks and ProxyHTMLEvents usage examples in the docs - thanks for the suggestion.\n\n> As a side note. I did add \"style\" to the list of ProxyHTMLEvents. And\n> somehow it still didn't work. Could it be that only one attribute is parsed\n> per element?\n\n\"didn't work\"?  Have you sorted it yet?  If not, I suggest asking on the users list: the issue is probably a problem with your matching regexp, or with your options/flags.", "count": 5, "id": 202811, "time": "2017-12-16T20:52:10Z", "bug_id": 56288, "creation_time": "2017-12-16T20:52:10Z", "is_private": false}, {"count": 6, "text": "Nick, closing a bug with a patch with a clear example of what I expect to get rewritten, but doesn't get rewritten, pretty much looks like you didn't even try. Come on, please give it a try.", "bug_id": 56288, "attachment_id": null, "id": 202826, "time": "2017-12-17T21:04:45Z", "creator": "micha@lenk.info", "creation_time": "2017-12-17T21:04:45Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "bug_id": 56288, "is_private": false, "id": 202891, "creation_time": "2017-12-22T23:14:14Z", "time": "2017-12-22T23:14:14Z", "creator": "nick@webthing.com", "text": "I tested it when I closed the bug.\n\nI just retested today with a cut-and-paste of your \n<div style=\"background:url(http://www.example.com/fancy-background.png) right 0px no-repeat; height:325px;\">\n\nBoth times, the link got rewritten exactly as I'd expect.  I don't see what else I'm supposed to do here.  So I'll leave this and suggest anyone having similar problems seek help on the mailinglist.", "attachment_id": null}]