[{"count": 0, "tags": [], "creator": "micha@lenk.info", "is_private": false, "text": "Created attachment 31409\nSkip documents smaller than 4 bytes\n\nApparently there is a bug that causes mod_proxy_html to add some random characters (+html code) to the current document if the whole document is smaller than 4 bytes. It looks like the output is from some kind of uninitialized memory. The added string sometimes matches part of a previously delivered request. Also, it looks like this only happens when doing multiple HTTP requests with the same browser and using HTTP Keep Alive.\n\nThe root cause is that the charset guessing with xml2enc needs to consume at least 4 bytes from the document to come to a conclusion. The consumed bytes are buffered so that they can later get prepended to the output again. But apparently it is assumed that there are always at least 4 bytes available, which in some cases is not the case. In these cases the buffer may contain some random bytes, probably left behind from the previous request on the same connection.\n\nThe attached patch fixes that issue by simply skipping documents smaller than 4 bytes. The rationale behind this is, that for HTML rewriting to do something useful, it needs to work on an absolute URL (i.e. including a schema). But as the schema \"http\" is already 4 bytes, there would be nothing to rewrite.\n\nThe patch is based on httpd trunk, rev. 1579365.", "id": 173949, "time": "2014-03-19T20:56:39Z", "bug_id": 56286, "creation_time": "2014-03-19T20:56:39Z", "attachment_id": 31409}, {"attachment_id": null, "tags": [], "bug_id": 56286, "is_private": false, "count": 1, "id": 175579, "time": "2014-06-01T17:12:45Z", "creator": "nick@webthing.com", "creation_time": "2014-06-01T17:12:45Z", "text": "Thanks.  Fixed locally, will commit this evening."}, {"count": 2, "tags": [], "text": "Fixed in trunk in r1599012", "is_private": false, "id": 201836, "creator": "christophe.jaillet@wanadoo.fr", "time": "2017-11-01T18:00:28Z", "bug_id": 56286, "creation_time": "2017-11-01T18:00:28Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "christophe.jaillet@wanadoo.fr", "text": "Backported in 2.4.x in r1821073 (with some other improvements)\nWill be part of 2.4.30", "id": 203253, "time": "2018-01-13T17:01:57Z", "bug_id": 56286, "creation_time": "2018-01-13T17:01:57Z", "is_private": false, "attachment_id": null}]