[{"count": 0, "text": "Created attachment 31408\nLet mod_proxy_html keep the doctype and fix empty tag ending in XHTML documents\n\nCurrently mod_proxy_html removes any <!doctype> tags from the beginning of HTML and XHTML documents. This <!doctype> tag is needed by some browsers to correctly render XHTML documents.\n\nAdditionally mod_proxy_html doesn't terminate empty tags in XHTML documents correctly unless \"ProxyHTMLDoctype XHTML\" is explicitly configured. So, unless you have ProxyHTMLDoctype configured correctly, XHTML documents are invalid after passing mod_proxy_html.\n\nThe attached patch fixes the first issue by using the internalSubset hook of the libxml2 SAX parser to parse and output the <!doctype> tag. To address the second issue, the same hook is used to automatically detect whether the current document is an XHTML document or not. In case of an XHTML document the XHTML-style for closing empty tags is enabled for the current request. In my opinion the suggested patch makes the directive ProxyHTMLDoctype more or less obsolete. Of course it is kept for backwards compatibility.\n\nThe patch is based on httpd trunk, rev. 1579365.", "bug_id": 56285, "is_private": false, "id": 173948, "time": "2014-03-19T20:48:04Z", "creator": "micha@lenk.info", "creation_time": "2014-03-19T20:48:04Z", "tags": [], "attachment_id": 31408}, {"count": 1, "text": "You mean automatic doctype detection?  Dammit, thought I'd done something more-or-less equivalent years ago, but I guess that must've been in another module.  Will check your patch - thanks.", "bug_id": 56285, "is_private": false, "id": 175578, "time": "2014-06-01T17:07:09Z", "creator": "nick@webthing.com", "creation_time": "2014-06-01T17:07:09Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "creator": "nick@webthing.com", "text": "I've adapted your patch a little, and made \"auto\" a configuration option.  Committed in r1599027 .  Thanks for the patch.", "id": 175582, "time": "2014-06-01T21:22:24Z", "bug_id": 56285, "creation_time": "2014-06-01T21:22:24Z", "is_private": false, "attachment_id": null}]