[{"count": 0, "tags": [], "bug_id": 56304, "attachment_id": 31429, "id": 174027, "time": "2014-03-23T06:11:07Z", "creator": "rstoyanchev@yahoo.com", "creation_time": "2014-03-23T06:11:07Z", "is_private": false, "text": "Created attachment 31429\nExtract from thread dump\n\nStart a WebSocket server on one computer.\nConnect from aonther using a browser.\nStarts sending messages from server to client periodically.\n\nTurn off wifi or unplug network cable on client side. Initially Tomcat appears \nto be sending messages but eventually one of the sends hangs indefinitely.\n\nThe 20 second timeout as documented on the WebSocket FAQ does not occur and attempts to close the WebSocket session from another thread also locks that thread as well.\n\nIf you now turn the wifi back on or plug the network cable, at last the two threads that are stuck are released and the WebSocket handler gets a notification of the session closing.\n\nIn the attachment, the first two stack traces are of (1) the thread trying to send and (2) the thread that attempted to close. The 3rd stack trace is of another hung thread.\n\nNOTE that this does not occur on Tomcat 8 where the timout does occur and also attempts to close a session do succeed.\n\nAlso I am told that the timeout does occur on Windows but I haven't verified it myself. I am using Linux."}, {"count": 1, "text": "Are you sure you used the same connector on Tomcat 7 and Tomcat 8? The default connector on Tomcat 7 is BIO whereas it is NIO on Tomcat 8.\n\nWhen you refer to Windows or Linux is that client side, server side or both?", "bug_id": 56304, "attachment_id": null, "id": 174028, "time": "2014-03-23T08:48:22Z", "creator": "markt@apache.org", "creation_time": "2014-03-23T08:48:22Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "rstoyanchev@yahoo.com", "attachment_id": null, "text": "The reference to Windows is for the server.\n\nI am using default server configuration on both Tomcat 7 and 8 so I guess that probably accounts for the different behavior. I can try Tomcat 7 with NIO connector to confirm what the behavior is.\n\nThat said is the BLOCKING_SEND_TIMEOUT property not supported with default Tomcat 7 configuration? This is not reflected in the WebSocket FAQ.\n\nAlso should an attempt to close the session from a separate thread block as well? It would be difficult then (or rather not possible) for an application not to lose two threads to a client that disconnected abnormally.\n\nIf that is indeed the case then perhaps it should probably be recommended prominently in the FAQ to switch to the NIO connector if using Tomcat 7 with WebSockets.", "id": 174032, "time": "2014-03-23T14:34:24Z", "bug_id": 56304, "creation_time": "2014-03-23T14:34:24Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 56304, "attachment_id": null, "id": 174049, "time": "2014-03-24T09:55:32Z", "creator": "markt@apache.org", "creation_time": "2014-03-24T09:55:32Z", "is_private": false, "text": "For the record, I can reproduce this with 8.0.x using:\n- Unbuntu 12.04.04 LTS VM as the server (fully patched)\n- Latest 8.0.x code\n- Oracle 1.7.0_45 64-bit JVM\n- Snake WebSocket example\n- Firefox on OSX (fully patched) as the client\n\nSimply turning off the WiFi on the OSX client leads to a read thread (http-bio-8080-exec-NN) and a write thread (SnakeTimer) blocking indefinitely. I'm looking into what can be done about this now."}, {"count": 4, "tags": [], "bug_id": 56304, "attachment_id": null, "id": 174051, "time": "2014-03-24T12:01:18Z", "creator": "markt@apache.org", "creation_time": "2014-03-24T12:01:18Z", "is_private": false, "text": "Add info from the users list that the timeout does occur after approx 15 minutes.\n\nThis is - believe it or not - working as designed! See this thread from SO (it is off topic for SO but spot on for this problem)\nhttp://stackoverflow.com/questions/15484906/change-the-tcp-timeout-for-a-linux-network-device\n\nIt would appear that the only way to handle this if you want to continue to use the BIO connector is is to reduce /proc/sys/net/ipv4/tcp_retries2 \n\nI'll add some information about this to the WebSocket docs."}, {"count": 5, "tags": [], "bug_id": 56304, "attachment_id": null, "id": 174052, "time": "2014-03-24T12:40:21Z", "creator": "rstoyanchev@yahoo.com", "creation_time": "2014-03-24T12:40:21Z", "is_private": false, "text": "Thanks, when you say it's expected to work this way, does it also mean the send timeout cannot be enforced with the BIO connector? \n\nCan anything meaningful be done if an application can detect a timeout situation? Currently trying to close the session from another thread locks up that thread too."}, {"count": 6, "tags": [], "bug_id": 56304, "attachment_id": null, "id": 174053, "time": "2014-03-24T12:50:20Z", "creator": "markt@apache.org", "creation_time": "2014-03-24T12:50:20Z", "is_private": false, "text": "There is no Java API available for setting a write timeout.\n\nClosing the socket may or may not be possible - it depends on the locking implemented by the JRE. I've taken a look at the Java side and there is a lock on close but not on write. However, a lock could occur on the same object in the native code.\n\nGiven your experience, it looks like tweaking the kernel network parameters are the best (only?) option if you want to run WebSocket + HTTP BIO + Linux.\n\nI have added some appropriate notes to the WebSocket docs for 8.0.x (8.0.5+) and 7.0.x (7.0.53+)"}, {"count": 7, "tags": [], "bug_id": 56304, "attachment_id": null, "id": 174055, "time": "2014-03-24T15:02:11Z", "creator": "rstoyanchev@yahoo.com", "creation_time": "2014-03-24T15:02:11Z", "is_private": false, "text": "I guess that makes the combination of WebSocket and BIO pretty unusable. Good to know in any case. I have to double check the behavior with Servlet 3 async in the same scenario with NIO. \n\nBTW while you're in the FAQ, it says that the buffer size limit is for incoming messages. However an exception is raised also when trying to send messages larger than 8K. I suspect it is an issue with the FAQ?"}, {"count": 8, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "If you have an issue sending more than 8k then that is a separate question for the users mailing list. Tomcat imposes no such limitation as it has no need to buffer then entire message.", "id": 174060, "time": "2014-03-24T16:01:54Z", "bug_id": 56304, "creation_time": "2014-03-24T16:01:54Z", "is_private": false}, {"count": 9, "text": "Okay thanks Mark.", "bug_id": 56304, "attachment_id": null, "id": 174064, "time": "2014-03-24T16:37:27Z", "creator": "rstoyanchev@yahoo.com", "creation_time": "2014-03-24T16:37:27Z", "tags": [], "is_private": false}]