[{"count": 0, "tags": [], "creator": "scott@03sq.net", "attachment_id": null, "id": 174524, "time": "2014-04-13T06:14:49Z", "bug_id": 56407, "creation_time": "2014-04-13T06:14:49Z", "is_private": false, "text": "This helpful warning appeared to me when I was checking some config:\nAH02559: The SSLCertificateChainFile directive (/etc/httpd/conf.d/ssl.conf:133) is deprecated, SSLCertificateFile should be used instead\nIt appears to be incorrect, it should say “SSLCACertificateFile should be used instead” shouldn’t it? Or do I misunderstand? I tried using SSLCertificateFile and nothing worked."}, {"count": 1, "tags": [], "bug_id": 56407, "is_private": false, "id": 174547, "creation_time": "2014-04-14T04:32:34Z", "time": "2014-04-14T04:32:34Z", "creator": "asfbugz@velox.ch", "text": "(In reply to Scott van Looy from comment #0)\n> This helpful warning appeared to me when I was checking some config:\n> AH02559: The SSLCertificateChainFile directive\n> (/etc/httpd/conf.d/ssl.conf:133) is deprecated, SSLCertificateFile should be\n> used instead\n> It appears to be incorrect, it should say “SSLCACertificateFile should be\n> used instead” shouldn’t it?\n\nNo, SSLCACertificateFile is about configuring CA certificates you trust for client authentication, which is different from the (intermediate) CA certificates you configure for the server's own certificate.\n\n> I tried using SSLCertificateFile and nothing worked.\n\nNote that the file pointed to by SSLCertificateFile needs to have both the server certificate and the intermediate CA certificates. Quoting from http://httpd.apache.org/docs/2.4/mod/mod_ssl.html#sslcertificatefile:\n\n\"This directive points to a file with certificate data in PEM format. At a minimum, the file must include an end-entity (leaf) certificate. Beginning with version 2.4.8, it may also include intermediate CA certificates, sorted from leaf to root, and obsoletes SSLCertificateChainFile.\"\n\nI.e., to update your configuration to no longer rely on SSLCertificateChainFile, you need to append the contents of the chain file to those already in SSLCertificateFile.\n\nI'm closing this bug, as the warning message itself is correct. If there's something in the documentation which could be improved, then let us know.", "attachment_id": null}]