[{"count": 0, "tags": [], "text": "Created attachment 31535\nCrash error log\n\nHi,\n\nRecently, we encountered Tomcat crash on EXCEPTION_ACCESS_VIOLATION. I attached error log. \n\nWe've seen this issue few times and it always seems to be related to \"JavaThread \"http-apr-80-Poller\" daemon\". To be honest, I don't know how to simulate this. It happens quite randomly. \n\nDue to \n   # Problematic frame:\n   # C  [tcnative-1.dll+0x6db6]\nand\n   =>0x3b9a3400 JavaThread \"http-apr-80-Poller\" daemon [_thread_in_native, id=912, stack(0x3fd20000,0x3fd90000)]\n\nI assume that this is Tomcat error. We use Tomcat to run our own simple web app and Infinispan REST server.", "attachment_id": 31535, "id": 174618, "creator": "martin.hanus@ysoft.com", "time": "2014-04-16T10:33:51Z", "bug_id": 56415, "creation_time": "2014-04-16T10:33:51Z", "is_private": false}, {"count": 1, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "text": "Is use of tcnative important for you? You could switch to the NIO connector which won't crash your JVM.\n\nIt appears that you are on Windows, yes? What version of tcnative are you using? Tomcat 7.0.47 ships with 1.1.29. tcnative 1.1.30 is newly available and not vulnerable to Heartbleed as well. Could you test with 1.1.30?", "id": 174651, "time": "2014-04-16T18:57:15Z", "bug_id": 56415, "creation_time": "2014-04-16T18:57:15Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 56415, "attachment_id": null, "id": 174664, "time": "2014-04-17T06:33:25Z", "creator": "martin.hanus@ysoft.com", "creation_time": "2014-04-17T06:33:25Z", "is_private": false, "text": "(In reply to Christopher Schultz from comment #1)\n> Is use of tcnative important for you? You could switch to the NIO connector\n> which won't crash your JVM.\n> \n> It appears that you are on Windows, yes? What version of tcnative are you\n> using? Tomcat 7.0.47 ships with 1.1.29. tcnative 1.1.30 is newly available\n> and not vulnerable to Heartbleed as well. Could you test with 1.1.30?\n\nWe are running on Windows Server 2008 R2 Standard. We really don't case whether we use tcnative or NIO Connector. Important thing is that it's working. \n\nDoes usage of NIO Connector over tcnative have any noticable performance hit that we should be aware of? We put quite a load on Infinispan REST server deployed inside Tomcat.\n\nWe are using tcnative which ships in default Tomcat 7.0.47 package. We didn't changed/upgraded any Tomcat dependency. Therefore, we use Tomcat tcnative 1.1.29."}, {"count": 3, "tags": [], "bug_id": 56415, "text": "Can you please advise how we can change to NIO Connectors?", "id": 174763, "time": "2014-04-22T13:55:50Z", "creator": "martin.hanus@ysoft.com", "creation_time": "2014-04-22T13:55:50Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 56415, "attachment_id": null, "id": 174775, "time": "2014-04-22T19:35:40Z", "creator": "chris@christopherschultz.net", "creation_time": "2014-04-22T19:35:40Z", "is_private": false, "text": "There are two performance-related items of note when switching from APR to NIO.\n\nThe first is with SSL. If you are having Tomcat terminate SSL, you will see a noticeable drop in performance when compared to OpenSSL (which APR uses). Something like a 25% drop wouldn't surprise me. It will depend upon your load profile.\n\nThe second is that you will notice CPU usage on the server increase a bit over use of APR. You may notice CPU usage triple or quadruple when compared to running APR without any other load on the server. PLEASE NOTE THAT I'M COMPARING ONLY THE OVERHEAD OF TOMCAT'S CONNECTORS, HERE. That means that if your server is running at 60% CPU load most of the time, I'm not claiming that you'll suddenly need 240% of your CPU in order to keep up. Remember that Tomcat's connector only uses a tiny slice of the CPU compared to whatever your own web application is doing.\n\nTo switch to the NIO connector, please read Tomcat's user guide. There is a section on Connectors which for some reason does not link to the Connectors section in the \"Configuration\" guide. The configuration guide is what you want."}, {"count": 5, "tags": [], "bug_id": 56415, "attachment_id": null, "id": 174936, "time": "2014-04-30T07:17:17Z", "creator": "martin.hanus@ysoft.com", "creation_time": "2014-04-30T07:17:17Z", "is_private": false, "text": "Is there any chance that this issue will be closed in short term (few weeks)? We still have crashes of Tomcat in our customer environments due to this. It's always \"http-apr-80-Poller\" problem as seen in provided attachment. Could someone take a look at it? We are still not able to simulate this issue with certainty though."}, {"count": 6, "tags": [], "bug_id": 56415, "attachment_id": null, "id": 174943, "time": "2014-04-30T12:26:52Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2014-04-30T12:26:52Z", "is_private": false, "text": "(In reply to Martin Hanus from comment #5)\n1. Unlikely. There is no clue what the error is, and how to reproduce it.\n\n2. I would suggest you to add the following setting to the catalina.properties file:\n\norg.apache.catalina.connector.RECYCLE_FACADES=true\n\nhttp://tomcat.apache.org/tomcat-7.0-doc/config/systemprops.html#Security\nThat is better from security POV and protects connector from mis-behaving web applications.\n\n3. Tomcat-Native 1.1.30 is available."}, {"count": 7, "tags": [], "bug_id": 56415, "attachment_id": null, "text": "As far as I can tell from the provided information, this is a duplicate.\n\nIf you still see this issue (or something like it) with the latest stable 1.2.x\nrelease and the latest stable release of a supported Tomcat version, please\nopen a new bug. What we really need are steps to reproduce. Even if it doesn't\nreproduce reliable, a script that will trigger then problem (the quicker the\nbetter) is very helpful.\n\n*** This bug has been marked as a duplicate of bug 56313 ***", "id": 200431, "time": "2017-08-23T21:56:32Z", "creator": "markt@apache.org", "creation_time": "2017-08-23T21:56:32Z", "is_private": false}]