[{"count": 0, "tags": [], "text": "I went through the same process as many others migrating to Tomcat 7. My simple war application took orders of magnitude longer to load than in Tomcat 3.3, and root cause was new Tomcat 7 / Servlet 3.0 jar scanning to look for context config fragments.\n\nThis is a very painful process. I had to use FINE log level, parse thousands of Tomcat log messages, and google the various messages. This was a waste of time. All Tomcat 7 needed to do was log a message when the jar scan did not find anything in a jar, and recommend adding that jar to one of the filters in catalina.properties.\n\n  tomcat.util.scan.DefaultJarScanner.jarsToSkip\n  org.apache.catalina.startup.ContextConfig.jarsToSkip\n  org.apache.catalina.startup.TldConfig.jarsToSkip.\n\n\nAs an enhancement, please add a log message recommending adding a jar if scanning does not find anything. I would recommend setting the log level to FINE, and explicitly putting a logging.properties override for that message in logging.properties. Anyone new to Tomcat 7 can fix these messages by either following the recommendation, or commenting out the logging.properties override for the message.\n\nThis is low hanging fruit. It should be straight forward to add, and would be a huge help for anyone new to Tomcat 7 who are unaware of the performance impact of Servlet 3.0 jar scanning. It could even help Tomcat 7 veterans too, when they add/upgrade/replace existing jar files that unknowingly affect jar scanning performance.\n\nThank you.", "is_private": false, "bug_id": 56438, "id": 174748, "time": "2014-04-21T17:36:50Z", "creator": "justincranford@hotmail.com", "creation_time": "2014-04-21T17:36:50Z", "attachment_id": null}, {"count": 1, "text": "Correction: I migrated from Tomcat 5.5. I wrote Tomcat 3.3 which was a type-o.", "bug_id": 56438, "attachment_id": null, "id": 174749, "time": "2014-04-21T17:37:56Z", "creator": "justincranford@hotmail.com", "creation_time": "2014-04-21T17:37:56Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "text": "I manually added these two overrides in Tomcat 7 logging.properties to make is easy to diagnose and fix slow start performance. Consider adding these to the defaults, or even just add them as commented out. I think they would benefit a wider audience.\n\n*** conf/logging.properties ***\n   org.apache.tomcat.util.scan.StandardJarScanner.level = FINE\n   org.apache.catalina.startup.Catalina.level = INFO\n\n\nRegarding catalina.properties, these are the filters I had to add for my specific application. Note that some of them should have been filtered by Tomcat 7 default filters tomcat.util.scan.DefaultJarScanner.jarsToSkip. The first 4 should definitely be fixed in the default filters of Tomcat 7, and the rest you can consider on a case-by-case basis:\n\nVarious JARs\n- jdom.jar (Default filter \"jdom-*jar\" missed this jar name)\n- commons-discovery*.jar (Missing Apache Commons jar filter)\n- commons-net*.jar (Missing Apache Commons jar filter)\n- commons-el*.jar (Missing Apache Commons jar filter)\n- quartz*.jar\n- el-ri.jar\n- kxml2.jar\n- jsch-*.jar\n- iText-*.jar\n- jasperreports-*.jar\n- httpcore-4.1.jar\n- protomatter-*.jar\n- stax-api-*.jar\n- xpp3_min-*.jar\n- xstream-*.jar\n- openspml2-toolkit.jar\n- vijava*.jar\n- jt400.jar\n- jsf-api-*.jar\n\nVarious JDBC JARs\n- mysql-connector-*.jar\n- ojdbc*.jar\n- jtds*.jar\n- h2-*.jar\n- ha-jdbc-*.jar\n- sqljdbc4.jar\n- db2jcc4.jar\n\nVarious Application Clustering JARs\n- jgroups-*.jar\n- hazelcast-*.jar", "is_private": false, "bug_id": 56438, "id": 174751, "time": "2014-04-21T19:25:49Z", "creator": "justincranford@hotmail.com", "creation_time": "2014-04-21T19:25:49Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "Created attachment 32639\nFix for Tomcat7 TldConfig and ContextConfig scan\n\nAttached patch contains below fixes:\n1) If any jar is scanned for TLDs and it does not contain any TLDs, add a debug message \"No TLDs were found in JAR\".  A overall summary INFO message is added to inform that \"Atleast one JAR was scanned unnecessarily\". \n\n2) If any JAR or FILE is scanned for fragments and it did not contain any fragment, add a debug message \"No fragments were found in JAR/File\". A overall summary INFO message is added to inform that \"Atleast one JAR/File was scanned unnecessarily\".\n\nPlease review my patch and let me know in case of any problems.", "attachment_id": 32639, "id": 182279, "creator": "reachme.valli@gmail.com", "time": "2015-04-09T07:28:16Z", "bug_id": 56438, "creation_time": "2015-04-09T07:28:16Z", "is_private": false}, {"count": 4, "text": "The patch sounds great. Three small suggestions to make it just a little better:\n\n1) Can you add a debug message to show positive matches? Logging negative matches is very useful since Tomcat's configuration uses exclusion filters, but in hindsight I think showing the positive matches too gives the developer more visibility into how many jars contain newer servlet 3.0 pieces. For example, if they notice multiple jars with fragments but offering similar functionality, they could decide to refactor their application to eliminate a few of those jars for a little more start up performance.\n\n2) Is it possible to log a message at the end of scanning to show positive/negative match totals? I would recommend warning log level if either negative match total is >0, otherwise info or debug level. A warning seems appropriate here since unnecessary jar scanning has such a huge negative impact on startup performance. It would not overwhelm a new user, it gives them valuable feedback to optimize startup times using your new debug messages, and it would disappear automatically after they add all the necessary exclusion filters.\n\n3) If you just added 1) and 2) that would be more than enough. However, you could go a step further and use your code to identify common jar files that should be filtered. If you added some of them to the default exclusion filters in catalina.properties then new users would get greater performance out of default installs.", "bug_id": 56438, "is_private": false, "id": 182287, "time": "2015-04-09T13:11:49Z", "creator": "justincranford@hotmail.com", "creation_time": "2015-04-09T13:11:49Z", "tags": [], "attachment_id": null}, {"count": 5, "attachment_id": null, "creator": "markt@apache.org", "is_private": false, "id": 182293, "time": "2015-04-09T14:41:45Z", "bug_id": 56438, "creation_time": "2015-04-09T14:41:45Z", "tags": [], "text": "(In reply to VIN from comment #3)\n\n> Please review my patch and let me know in case of any problems.\n\nPart 1 looks generally OK. You need to use 4 spaces rather than tabs and I agree with the idea in comment #4 to delog log matches and non-matches. I'm less sure about a message with the counts. I think it is too noisy for info and it the summary is debug then why bother since the individual messages are there.\n\nPart 2 needs works. Pluggability scans are more than just fragments and the patch needs to take that into account.\n\nAlso keep in mind the changes are made to trunk first and then back-ported so if the festure you are implementing isn't in trunk or 8.0.x then patches are required for those versions too.\n\nYou might find it easier to deal with part 1 first and then part 2."}, {"count": 6, "tags": [], "text": "(In reply to Justin Cranford from comment #4)\n> The patch sounds great. Three small suggestions to make it just a little\n> better:\n> \n> 1) Can you add a debug message to show positive matches? Logging negative\n> matches is very useful since Tomcat's configuration uses exclusion filters,\n> but in hindsight I think showing the positive matches too gives the\n> developer more visibility into how many jars contain newer servlet 3.0\n> pieces. For example, if they notice multiple jars with fragments but\n> offering similar functionality, they could decide to refactor their\n> application to eliminate a few of those jars for a little more start up\n> performance.\n> \n[Pravallika]: Do you mean \"adding a log message to tell which JAR contains the fragments or TLDs\"? If multiple JARs contains them, then too many log messages will be added to the log file which may also slow down the start time. Please think of and let me know so that i can add a INFO message for them.\n\n> 2) Is it possible to log a message at the end of scanning to show\n> positive/negative match totals? I would recommend warning log level if\n> either negative match total is >0, otherwise info or debug level. A warning\n> seems appropriate here since unnecessary jar scanning has such a huge\n> negative impact on startup performance. It would not overwhelm a new user,\n> it gives them valuable feedback to optimize startup times using your new\n> debug messages, and it would disappear automatically after they add all the\n> necessary exclusion filters.\n\n> \n> 3) If you just added 1) and 2) that would be more than enough. However, you\n> could go a step further and use your code to identify common jar files that\n> should be filtered. If you added some of them to the default exclusion\n> filters in catalina.properties then new users would get greater performance\n> out of default installs.\n[Pravallika]:  In the bug itself there are several JARs mentioned which does not contain any TLds or fragments. Hence i can add them in catalina.properties. Please let me know your opinion.", "attachment_id": null, "id": 182326, "creator": "reachme.valli@gmail.com", "time": "2015-04-13T07:08:45Z", "bug_id": 56438, "creation_time": "2015-04-13T07:08:45Z", "is_private": false}, {"count": 7, "tags": [], "creator": "reachme.valli@gmail.com", "attachment_id": null, "is_private": false, "id": 182328, "time": "2015-04-13T07:29:08Z", "bug_id": 56438, "creation_time": "2015-04-13T07:29:08Z", "text": "(In reply to Mark Thomas from comment #5)\n> (In reply to VIN from comment #3)\n> \n> > Please review my patch and let me know in case of any problems.\n> \n> Part 1 looks generally OK. You need to use 4 spaces rather than tabs and I\n> agree with the idea in comment #4 to delog log matches and non-matches. I'm\n> less sure about a message with the counts. I think it is too noisy for info\n> and it the summary is debug then why bother since the individual messages\n> are there.\n[Pravallika]:  I have changed my eclipse settings in such a way that only spaces will be used rather tabs. Not sure why tabs are coming in patch.\n\nI also felt that adding count gives too much info to the user.\n\n> \n> Part 2 needs works. Pluggability scans are more than just fragments and the\n> patch needs to take that into account.\n[Pravallika]:  I assume other than JARs only folders will be scanned(.class files). Is it OK to add them to JARsToSkip property in catalina.properties? If yes, I may need your help to do that.\n\n\n> Also keep in mind the changes are made to trunk first and then back-ported\n> so if the festure you are implementing isn't in trunk or 8.0.x then patches\n> are required for those versions too.\n> \n> You might find it easier to deal with part 1 first and then part 2.\n[Pravallika]:  Part1 (TLD scanning) is already available in 8.0 and recent trunks. Only 7.0 is not having. Part2 is not part of all 7, 8, 9 trunks. Based on your confirmation, i will give patch for Part1 to Tomcat7. Then i will giev individual patches for Part2 for all 3 versions.\nLet me know if this is OK."}, {"count": 8, "attachment_id": null, "bug_id": 56438, "text": "A patch to bring Tomcat 7 in to line with 8.0.x and trunk for TLD scanning is a good first step. I'd suggest the second step is adding debug logging for TLD matches.\n\nWe can think about pluggability once the TLD aspects are fixed.", "id": 182598, "time": "2015-04-23T15:32:35Z", "creator": "markt@apache.org", "creation_time": "2015-04-23T15:32:35Z", "tags": [], "is_private": false}, {"count": 9, "attachment_id": 32694, "creator": "reachme.valli@gmail.com", "is_private": false, "id": 182683, "time": "2015-04-28T09:22:44Z", "bug_id": 56438, "creation_time": "2015-04-28T09:22:44Z", "tags": [], "text": "Created attachment 32694\nFix for TLD scan in Tomcat7.0\n\nThis is the first patch to make Tomcat7.0 to make it in line with 8.0 and recent trunks. It has fix for only TLD scans. It does not include fix for context configs."}, {"count": 10, "attachment_id": null, "creator": "markt@apache.org", "text": "Thanks for the patch. It has been applied to 7.0.x/trunk for 7.0.62 onwards with the following changes:\n- renamed objCallBack to tldCallBack\n- fixed TldJarScannerCallback so it only reported no TLD was found if it actually looked for a TLD and didn't find one.", "id": 182711, "time": "2015-04-28T21:23:56Z", "bug_id": 56438, "creation_time": "2015-04-28T21:23:56Z", "tags": [], "is_private": false}, {"count": 11, "tags": [], "creator": "reachme.valli@gmail.com", "attachment_id": 32702, "text": "Created attachment 32702\nFix for adding debug log message for positive matches of tld-Tomcat7\n\nThis patch contains fix Tomcat7 for for below things:\n\n1) Added debug log messages to print positive matches when tld files are found\n2) Added info log message to print both negative and positive tld matches in tldScanResourcePaths(Web_Inf). But did not mention that \"Consider adding this path to ...\".  \n\nSummary message \"At least one resource path was scanned for TLDs yet contained no TLDs\"  is also not added because 8.0 and trunk are not having this.", "id": 182753, "time": "2015-04-30T08:47:11Z", "bug_id": 56438, "creation_time": "2015-04-30T08:47:11Z", "is_private": false}, {"count": 12, "tags": [], "bug_id": 56438, "attachment_id": null, "text": "All looks good. Since this is a new feature it needs to be added to trunk first and then back-ported so patches are required for trunk and 8.0.x as well.", "id": 182781, "time": "2015-05-01T10:51:56Z", "creator": "markt@apache.org", "creation_time": "2015-05-01T10:51:56Z", "is_private": false}, {"count": 13, "tags": [], "creator": "reachme.valli@gmail.com", "attachment_id": 32719, "text": "Created attachment 32719\nFix for adding debug log message for positive matches of tld-trunk\n\nThis patch contains fix for Tomcat recent trunk:\n\n1) Added debug log message when positive tld match was found\n2) Added debug log messages for both positive and negative matches of tld at resource path scan(previously it has only for JAR scanning). Summary message is not added.\n3) Added debug log messages for both positive and negative matches of tld at directory level scan like Web-Inf/classes. Summary message is not added.\n\nPlease verify the fix and let me know.\n\nThanks,\nPravallika(VIN)", "id": 182864, "time": "2015-05-07T09:53:35Z", "bug_id": 56438, "creation_time": "2015-05-07T09:53:35Z", "is_private": false}, {"count": 14, "tags": [], "bug_id": 56438, "attachment_id": 32720, "is_private": false, "id": 182865, "time": "2015-05-07T09:54:23Z", "creator": "reachme.valli@gmail.com", "creation_time": "2015-05-07T09:54:23Z", "text": "Created attachment 32720\nFix for adding debug log message for positive matches of tld-Tomcat8\n\nThis patch contains fix for Tomcat8:\n\n1) Added debug log message when positive tld match was found\n2) Added debug log messages for both positive and negative matches of tld at resource path scan(previously it has only for JAR scanning). Summary message is not added.\n3) Added debug log messages for both positive and negative matches of tld at directory level scan like Web-Inf/classes. Summary message is not added.\n\nPlease verify the fix and let me know.\n\nThanks,\nPravallika(VIN)"}, {"count": 15, "attachment_id": null, "bug_id": 56438, "text": "I've applied the 9.0.x patch with some minor tweaks. Many thanks.\nFor reference, the minor tweaks were:\n- removed trailing whitespace from one line to keep checkstyle happy\n- made spacing around if/else blocks consistent with the rest of the code\n- changed \"if(!x){foo()}else{bar()}\" to \"if(x){bar()}else{foo()}\"\n\nI'll take a look at the 8.0.x patch next.", "id": 182924, "time": "2015-05-11T09:27:57Z", "creator": "markt@apache.org", "creation_time": "2015-05-11T09:27:57Z", "tags": [], "is_private": false}, {"count": 16, "attachment_id": null, "creator": "markt@apache.org", "text": "8.0.x was a straight back-port of the 9.0.x commit so that has been applied to.", "id": 182925, "time": "2015-05-11T09:49:15Z", "bug_id": 56438, "creation_time": "2015-05-11T09:49:15Z", "tags": [], "is_private": false}, {"count": 17, "attachment_id": null, "bug_id": 56438, "text": "Thanks Mark. \n\nBelow are the pending items to close this bug:\n1) Adding debug log messages for both negative and positive matches of Pluggbility scan for all 3 versions(as trunk/8.0/7.0 are not having this)\n2) Identify the default jars that can be added to JarsToSkip property and add them under all 3 versions.\n\nPlease let me know if i miss any thing.\n\nThanks,\nPravallika(VIN)", "id": 182926, "time": "2015-05-11T09:58:45Z", "creator": "reachme.valli@gmail.com", "creation_time": "2015-05-11T09:58:45Z", "tags": [], "is_private": false}, {"count": 18, "tags": [], "text": "Created attachment 32746\nFix for printing log messages in case of contextconfig scan-trunk\n\nThis patch contain fixes for below:\n\n1) Log positive and negative matches when Jars/files scanned for fragments. Add summary message if atleast one JAR or file is scanned unnecessarily(with out having fragments).\n\n2) Log positive and negative matches when files/jars scanned for annotations\n3) Log positive and negative matches when files/jars scanned for static resource paths\n\nDid slight modification to TLDScanner as well to fix below:\nPreviously though Jars/files both are scanned, summary message used to print only for Jars. Now added fix to print summary message even when files are also scanned unnecessarily.\n\nPlease review the patch and let me know if any changes are required.\n\nThanks,\nPravallika(VIN)", "is_private": false, "bug_id": 56438, "id": 183058, "time": "2015-05-21T05:44:04Z", "creator": "reachme.valli@gmail.com", "creation_time": "2015-05-21T05:44:04Z", "attachment_id": 32746}, {"count": 19, "tags": [], "creator": "reachme.valli@gmail.com", "attachment_id": 32747, "text": "Created attachment 32747\nFix for printing log messages in case of contextconfig scan-trunk\n\nMissed one line while creating the patch. Hence please check the attached one.", "id": 183059, "time": "2015-05-21T06:29:21Z", "bug_id": 56438, "creation_time": "2015-05-21T06:29:21Z", "is_private": false}, {"count": 20, "attachment_id": 32748, "creator": "reachme.valli@gmail.com", "is_private": false, "id": 183061, "time": "2015-05-21T09:03:29Z", "bug_id": 56438, "creation_time": "2015-05-21T09:03:29Z", "tags": [], "text": "Created attachment 32748\nFix for printing log messages in case of contextconfig scan-Tomcat8\n\nPatch for Tomcat8 with below fixes:\n1) Log positive and negative matches when Jars/files scanned for fragments. Add summary message if atleast one JAR or file is scanned unnecessarily(with out having fragments).\n\n2) Log positive and negative matches when files/jars scanned for annotations\n3) Log positive and negative matches when files/jars scanned for static resource paths\n\nDid slight modification to TLDScanner as well to fix below:\nPreviously though Jars/files both are scanned, summary message used to print only for Jars. Now added fix to print summary message even when files are also scanned unnecessarily.\n\nPlease review the patch and let me know if any changes are required.\n\nThanks,\nPravallika(VIN)"}, {"count": 21, "attachment_id": null, "creator": "markt@apache.org", "text": "The proposed patch treats the annotation scan and the fragment scan as independent scans. Unfortunately this is not the case. The patch also ignores the scanning for @HandlesType matches.\n\nTake a look at the comment at the start of ContextConfig.webConfig().\n\nSome things to keep in mind:\n- The annotation scan and the @HandleTypes scan are done at the same time.\n- The annotation scan can be disabled via metadata-complete\n- metadata-complete has no impact on @HandleTypes scan\n- exclusion via absolute ordering excludes a JAR from all three scans\n\nI think there are two options.\n\n1. Log a message suggesting the JAR is skipped if it has no hits for all three scans.\n\n2. As 1 but also log a message for JARs that have unnecessary annotation scans that they could use metadata-complete. (Your current patch pretty much does this already.)", "id": 183111, "time": "2015-05-26T20:01:20Z", "bug_id": 56438, "creation_time": "2015-05-26T20:01:20Z", "tags": [], "is_private": false}]