[{"count": 0, "attachment_id": null, "bug_id": 56513, "is_private": false, "id": 175157, "time": "2014-05-12T12:11:51Z", "creator": "mgainty@hotmail.com", "creation_time": "2014-05-12T12:11:51Z", "tags": [], "text": "In NIO Connector documentation\ncompression is mentioned\nsendfile use is mentioned\nbut the 2 clearly do not work together in a NIO Connector\n\nhttps://tomcat.apache.org/tomcat-7.0-doc/aio.html states\n\n    When APR or NIO is enabled, Tomcat supports using sendfile to send large static files. These writes, as soon as the system load increases, will be performed asynchronously in the most efficient way. Instead of sending a large response using blocking writes, it is possible to write content to a static file, and write it using a sendfile code. A caching valve could take advantage of this to cache the response data in a file rather than store it in memory. Sendfile support is available if the request attribute org.apache.tomcat.sendfile.support is set to Boolean.TRUE.\n\n    Any servlet can instruct Tomcat to perform a sendfile call by setting the appropriate request attributes. It is also necessary to correctly set the content length for the response. When using sendfile, it is best to ensure that neither the request or response have been wrapped, since as the response body will be sent later by the connector itself, it cannot be filtered. Other than setting the 3 needed request attributes, the servlet should not send any response data, but it may use any method which will result in modifying the response header (like setting cookies).\n\n  org.apache.tomcat.sendfile.filename: Canonical filename of the file which will be sent as a String\n  org.apache.tomcat.sendfile.start: Start offset as a Long\n  org.apache.tomcat.sendfile.end: End offset as a Long\n\nNeeds to state:\n\nNIO works with either sendfile OR compression\nNIO with Sendfile:\n\nNIO with Compression:\n\nhttp://tomcat.apache.org/tomcat-7.0-doc/config/http.html#NIO_specific_configuration states\n\n(with regards to compression)\nNote: There is a tradeoff between using compression (saving your bandwidth) and using the sendfile feature (saving your CPU cycles). If the connector supports the sendfile feature, e.g. the NIO connector, using sendfile will take precedence over compression. The symptoms will be that static files greater that 48 Kb will be sent uncompressed. You can turn off sendfile by setting useSendfile attribute of the connector, as documented below, or change the sendfile usage threshold in the configuration of the DefaultServlet in the default conf/web.xml or in the web.xml of your web application. \n\nNeeds to say:\n\nNIO works with sendfile feature OR compression\nNIO with Sendfile:\n\nNIO with Compression:"}, {"count": 1, "tags": [], "bug_id": 56513, "is_private": false, "text": "(In reply to Martin Gainty from comment #0)\n> Needs to state:\n> \n> NIO works with either sendfile OR compression\n> NIO with Sendfile:\n> \n> NIO with Compression:\n> \n> http://tomcat.apache.org/tomcat-7.0-doc/config/http.\n> html#NIO_specific_configuration states\n\nAlso for the APR connector.\n\n> (with regards to compression)\n> Note: There is a tradeoff between using compression (saving your bandwidth)\n> and using the sendfile feature (saving your CPU cycles). If the connector\n> supports the sendfile feature, e.g. the NIO connector, using sendfile will\n> take precedence over compression. The symptoms will be that static files\n> greater that 48 Kb will be sent uncompressed. You can turn off sendfile by\n> setting useSendfile attribute of the connector, as documented below, or\n> change the sendfile usage threshold in the configuration of the\n> DefaultServlet in the default conf/web.xml or in the web.xml of your web\n> application. \n> \n> Needs to say:\n> \n> NIO works with sendfile feature OR compression\n> NIO with Sendfile:\n> \n> NIO with Compression:\n\nSeems reasonable.\n\nCare to submit a documentation patch?", "id": 175165, "time": "2014-05-12T14:25:36Z", "creator": "chris@christopherschultz.net", "creation_time": "2014-05-12T14:25:36Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Fixed for 8.0.6 onwards.", "is_private": false, "id": 175168, "creator": "markt@apache.org", "time": "2014-05-12T16:12:39Z", "bug_id": 56513, "creation_time": "2014-05-12T16:12:39Z", "attachment_id": null}]