[{"count": 0, "tags": [], "text": "Created attachment 31612\nAdd GlobalLog directive\n\nA virtualhost can specify its own CustomLog directives, but when this is done, the vhost no longer uses the parent CustomLog directives. From a comment in the source, this was apparently done purposefully. However, it seems that there should be some mechanism for allowing virtualhosts to inherit the CustomLog of the parent configuration.\n\nAt first, I tried to add another optional parameter to CustomLog, but it turned out to be somewhat more complicated than I'd anticipated; CustomLog already has an optional parameter, and the AP_INIT_TAKE macros only go up to 3 parameters. As an alternative, the patch attached introduces a new directive, GlobalLog, which is essentially equivalent to CustomLog except that all child virtualhosts also inherit the log.", "attachment_id": 31612, "bug_id": 56517, "id": 175177, "time": "2014-05-12T20:25:17Z", "creator": "Chaosed0@gmail.com", "creation_time": "2014-05-12T20:25:17Z", "is_private": false}, {"count": 1, "tags": [], "text": "Why override CustomLog in the vhost at first?\nAll httpd's vhost directives are based on this override logic, why would it be different for CustomLog?\n\nIf you want the vhost to use the parent's CustomLog, simply don't declare one for it.", "is_private": false, "bug_id": 56517, "id": 175210, "time": "2014-05-14T14:34:40Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2014-05-14T14:34:40Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "I expressed the requirement off-line to Ed.\n\nI often I want to give a user a copy/pasteable logging directive with all sorts of custom formats early during problem determination.  It would be handy if they could append it to their configuration and have it used for all of their responses, rather than having them update N+1 contexts with n+1 filenames or determine what vhost is having the problem [and hope the problem is not related to vhosts]", "is_private": false, "bug_id": 56517, "id": 175214, "time": "2014-05-14T15:04:17Z", "creator": "covener@gmail.com", "creation_time": "2014-05-14T15:04:17Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "GlobalLog available in 2.4.19 and later", "attachment_id": null, "bug_id": 56517, "id": 195753, "time": "2016-12-31T00:36:37Z", "creator": "covener@gmail.com", "creation_time": "2016-12-31T00:36:37Z", "is_private": false}]