[{"count": 0, "tags": [], "bug_id": 56601, "attachment_id": null, "text": "IOException intermittently thrown when repeatedly writing cells, cell.setCellValue( sValue ), or creating new .xlsx.\n\nThe specific exception type is FileNotFoundException with a message of \"The requested operation cannot be performed on a file with a user-mapped section open\" which is bizarre because the file does exist, is not open elsewhere, and the code works most of the time.", "id": 175712, "time": "2014-06-06T19:15:12Z", "creator": "jamie.singer@gmail.com", "creation_time": "2014-06-06T19:15:12Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 31693\nlogical flow to recreate\n\nThe code attached has wrapped functions that are not included, but the implementations simply wrap the POI calls with exception handling. The attachment demonstrates the logical flow.\n\nSometimes the test runs 1000s of time without problem until I kill it. Other times it blows up quickly with the exception in bug report.", "is_private": false, "id": 175713, "creator": "jamie.singer@gmail.com", "time": "2014-06-06T19:29:18Z", "bug_id": 56601, "creation_time": "2014-06-06T19:29:18Z", "attachment_id": 31693}, {"count": 2, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "is_private": false, "id": 175744, "time": "2014-06-09T16:42:49Z", "bug_id": 56601, "creation_time": "2014-06-09T16:42:49Z", "text": "Does it always trigger in the same place in the code, or does it differ? A stacktrace might help, especially if it's the same each time"}, {"count": 3, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "is_private": false, "id": 176157, "time": "2014-07-02T14:37:23Z", "bug_id": 56601, "creation_time": "2014-07-02T14:37:23Z", "text": "Also which operating system is this on? We had cases where Windows reported such types of errors sometimes, so this may be the same thing..."}, {"count": 4, "tags": [], "creator": "jamie.singer@gmail.com", "attachment_id": null, "id": 176163, "time": "2014-07-02T15:08:51Z", "bug_id": 56601, "creation_time": "2014-07-02T15:08:51Z", "is_private": false, "text": "Windows 8 Pro with Microsoft Office Professional Plus 2010"}, {"count": 5, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "text": "Without a stacktrace and a clear reproducing unit-test this is very hard to work on. Intermittent exceptions often hint at multi-threading issues or other problems that are only appearing on single machines, not others. \n\nThe sample code does not perform any suspicious thing and similar things run well on many machines without any such intermittent exceptions.\n\nTherefore I don't think we can find out more with the amount of information provided right now and thus need to close it WORKSFORME for now, please reopen the bug if you can provide more information here, especially a self-sufficient piece of code without any \"wrappers\" and some stacktraces of the exceptions could give some hints about the problem.", "id": 185201, "time": "2015-09-13T20:11:57Z", "bug_id": 56601, "creation_time": "2015-09-13T20:11:57Z", "is_private": false}]