[{"count": 0, "tags": [], "bug_id": 56607, "text": "Created attachment 31699\noutput of step 4\n\nTomcat is not completely shut down yet when shutdown.bat exits.\n\nThis makes it difficult for our system to quickly stop and uninstall a temporary Tomcat.\n\nSteps to Reproduce:\n1. Unzip apache-tomcat-6.0.41-windows-x86\n2. startup.bat\n3. Find Tomcat PID with JPS.\n4. shutdown.bat & jstack <PID> & jstack <PID> & jstack <PID>\n\nThe actual results are attached as console output of step 4.\n\nThe expected result is a single \"no such process\" output from the first run of Jstack after shutdown.bat exits.\n\nI reproduce this with JDK 1.7.0_60", "id": 175738, "time": "2014-06-09T12:06:24Z", "creator": "Elias.Wulcan@apptus.com", "creation_time": "2014-06-09T12:06:24Z", "is_private": false, "attachment_id": 31699}, {"count": 1, "tags": [], "creator": "chris@christopherschultz.net", "text": "\"shutdown.bat|catalina.bat stop\" does not actually stop Tomcat, but instead sends a signal to the running JVM process to shut down gracefully.\n\nNote that catalina.sh does allow for a \"stop N\" where N is the maximum number of seconds you'd like the script to wait for the Tomcat process to actually stop. That has not been implemented in the DOS .bat version due to lack of interest.\n\nSleeping in the DOS world is possible through a variety of means, but there is no \"sleep\" command for that purpose so the *NIX fix won't work on DOS/win32/etc. without modification. It's also awkward to check for a process's status, but honestly its a bit awkward on *NIX, too.\n\nShort-term fix is to use Cygwin and a UNIX-like shell. I'm making this an enhancement request rather than a bug because the behavior described is expected.\n\nI'll see if I can make up a patch for catalina.bat that can replicate the catalina.sh feature of \"stop N\". Would you be willing to test a candidate patch for me?", "id": 175743, "attachment_id": null, "bug_id": 56607, "creation_time": "2014-06-09T15:02:12Z", "time": "2014-06-09T15:02:12Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 56607, "is_private": false, "id": 175752, "creation_time": "2014-06-10T07:09:36Z", "time": "2014-06-10T07:09:36Z", "creator": "Elias.Wulcan@apptus.com", "text": "I would be happy to test a patch for you but I do not want you to toil with DOS scripts if there is a better solution.\n\nAll I need is an official interface for doing this, not necessarily a DOS script and not one depending on a Cygwin installation.", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 56607, "text": "Windows doesn't make this easy and there doesn't appear to have been much interest in implementing this so I am going to resolve this as WONTFIX.\n\nFor the benefit of anyone that comes back to this in the future, the solution is likely to look something like:\n- use TITLE to set a unique window title\n- use something based on https://serverfault.com/questions/126502/how-to-get-own-process-pid-from-the-command-prompt-in-windows to get the pid\n- and something based on (the very similar) http://stackoverflow.com/questions/162291/how-to-check-if-a-process-is-running-via-a-batch-script to see if the process with that pid is still running", "id": 198712, "time": "2017-05-07T18:43:57Z", "creator": "markt@apache.org", "creation_time": "2017-05-07T18:43:57Z", "is_private": false, "attachment_id": null}]