[{"attachment_id": null, "tags": [], "creator": "stevebread@yahoo.com", "text": "The web.xml contains\n<jsp-config>\n  <jsp-property-group>\n    <url-pattern>*.jsp</url-pattern>\n    <trim-directive-whitespaces>true</trim-directive-whitespaces>\n  </jsp-property-group>\n</jsp-config>\n\nGiven a person John Doe:\n${person.first} ${person.last} -> \"JohnDoe\"\n${person.first} x ${person.last} -> \"John x Doe\"\n\nRemoving the web.xml config produces the correct result\n${person.first} ${person.last} -> \"John Doe\"\n\nPer the JSP 2.2 spec, template text that does not contain only whitespaces should be preserved as-is", "count": 0, "id": 175847, "time": "2014-06-17T07:41:10Z", "bug_id": 56634, "creation_time": "2014-06-17T07:41:10Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 56634, "attachment_id": null, "id": 175866, "time": "2014-06-18T11:40:33Z", "creator": "markt@apache.org", "creation_time": "2014-06-18T11:40:33Z", "is_private": false, "text": "The key question here is whether the expressions are part of the template text or not. If they are, this bug is valid. If they are not, this bug is invalid.\n\nThe parser currently separates template text and expressions - hence the current behaviour.\n\nI need to have a close read of the JSP spec - particularly JSP.1.3.10.1, the EBNF grammar for JSP syntax (section number taken from JSP 2.3 spec)."}, {"count": 2, "tags": [], "text": "Having searched the JSP 2.3[1] specification for \"template\" and reviewed all the occurrences this isn't as clear cut as I would like.\n\nThere are quite a few references to EL being \"in\" template text which suggests that the EL is part of the template text.\n\nThere are also several places that are explicit that EL is not template text as well as several places that are explicit that template text is passed straight through to the output without any processing - clerarly not the case for EL.\n\nOn balance, while the number of references to EL being \"in\" template text out-number the number of references that state EL is not part of template text, my assessment of the intention of the JSP EG is that EL is not part of template text as all the explicit statements are that EL is not part of template text.\n\nI am therefore resolving this bug as INVALID. The simplest workaround is probably to use ${' '}.\n\nThis is a matter of judgement and it is posisble that the JSP EG had the opposite intention. You may wish to raise an issue with the the JSP EG to seek clarification. If such clarification is forthcoming and it supports the validity of this bug then please feel free to re-open this bug (referencing the clarification) and we'll take another look.\n\n[1] The 2.3 specification is very, very similar to 2.2.", "attachment_id": null, "id": 175868, "creator": "markt@apache.org", "time": "2014-06-18T16:36:17Z", "bug_id": 56634, "creation_time": "2014-06-18T16:36:17Z", "is_private": false}, {"count": 3, "tags": [], "creator": "knst.kolinko@gmail.com", "attachment_id": null, "text": "There is an example in article\n\"Summary of New Features in JSP 2.1 Technology\"\non Sun/Oracle site.\n\nAddress of an archived copy:\n[1] http://web.archive.org/web/20060314005142/http://java.sun.com/developer/technicalArticles/J2EE/jsp_21/\n\nThe official current address is the following:\n[2] http://www.oracle.com/technetwork/articles/javaee/jsp-21-136414.html\n\n(I do not recommend [2], as code samples formatting there is broken and is hard to read.)\n\nThe example shows how whitespace is removed between <c:forEach> and ${conf}.\n\nTemplate text between ${conf} and </c:forEach> is preserved, though there is a discrepancy that there should have been one additional space between ${conf} and &lt;br&gt;, and several more spaces before </c:forEach>. I think it is an editor's glitch.\n\n\n\nBTW, a related enhancement request - bug 45931.", "id": 175883, "time": "2014-06-18T23:00:26Z", "bug_id": 56634, "creation_time": "2014-06-18T23:00:26Z", "is_private": false}, {"count": 4, "tags": [], "creator": "stevebread@yahoo.com", "attachment_id": null, "text": "I can see how the behavior could be context dependent i.e.\n<c:forEach items=\"${persons}\" var=\"person\">\n  ${person.first} ${person.last}\n</c:forEach>\nseems acceptable to produce \"JohnDoe\" based on Mark's comments\n\nThe JSP example linked to by Konstantin could also be explained if the template text is not considered to start until the opening tag of the <br> after the ${conf}, ignoring the space before it.\n\nI'm less clear on\n<span>${person.first} ${person.last}</span>\nwhich also produces \"JohnDoe\". This would imply that the EL expressions are delimiting template text. The JSP spec allows EL expressions to be part of template text so it seems open to interpretation.\n\nHowever,\n<c:url value=\"http://xyz.com\">\n  <c:param name=\"daddr\">${person.first} ${person.last}</c:param>\n</c:url>\nalso loses the space and this I believe should not since the directive only applies to whitespace in the response output. So I'm reopening the defect.", "id": 175924, "time": "2014-06-20T08:56:35Z", "bug_id": 56634, "creation_time": "2014-06-20T08:56:35Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 56634, "attachment_id": null, "id": 175925, "time": "2014-06-20T09:04:04Z", "creator": "markt@apache.org", "creation_time": "2014-06-20T09:04:04Z", "is_private": false, "text": "See comment #2 on whether EL is part of the template text or not. Without some clarification from the EG or a reference to the exisiting spec that has been missed this issue is going to remain invalid."}, {"count": 6, "tags": [], "creator": "stevebread@yahoo.com", "attachment_id": null, "text": "Since the <c:param> value is not being written to response output, should the directive apply to it?", "id": 175928, "time": "2014-06-20T09:23:01Z", "bug_id": 56634, "creation_time": "2014-06-20T09:23:01Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 56634, "text": "trimDirective-Whitespaces applies to template text. I believe that is irrespective of whether the template text is copied to the response or not.\n\nChecking the EBNF it takes a while but if you work your way through you'll find that the \"${person.first} ${person.last}\" in <c:param name=\"daddr\">${person.first} ${person.last}</c:param> is an ELExpression followed by TemplateText followed by another ELEXpression. Therefore the empty template text is correctly trimmed if trimDirective-Whitespaces is enabled.\n\nI also found this in JSP.1.3.10:\n<quote>\nThis section presents a simple EBNF grammar for the JSP syntax. The grammar\nis intended to provide a concise syntax overview and to resolve any syntax ambiguities present in this specification. Other sections may apply further restrictions to this syntax, for example to restrict what represents a valid attribute value for a page directive. In all other cases the grammar takes precedence in resolving syntax questions.\n</quote>\n\nGiven that EL has a separate and distinct production from template text I am satisfies that the current behaviour is correct.", "id": 175931, "time": "2014-06-20T10:36:53Z", "creator": "markt@apache.org", "creation_time": "2014-06-20T10:36:53Z", "is_private": false, "attachment_id": null}]