[{"count": 0, "tags": [], "text": "I try to save the output file of a listener (doesn't seem to matter which kind of listener, but I try the 'View Results Tree' listener) as xml. I can check the 'Save as Xml' flag, and when I then run the jmeter plan, without closing the gui, I get an xml output. As soon as I close the gui and I try again the output changes to csv, but in the jmx file itself there is still an xml element true for that ResultCollector. I have the same issue when I run headless.\n\nI tried changing the jmeter.properties to\njmeter.save.saveservice.output_format=xml\nand that seems to do the trick, but that would likely mean that I cannot output csv format anymore. \n\nhttp://stackoverflow.com/questions/24365570/jmeter-save-listener-configuration-as-xml-not-working\n\nSomebody answered here that he thought there was a regression in the versions 2.10 and 2.11 that triggered this.", "attachment_id": null, "id": 175999, "creator": "kasper.janssens.android@gmail.com", "time": "2014-06-24T07:08:09Z", "bug_id": 56662, "creation_time": "2014-06-24T07:08:09Z", "is_private": false}, {"count": 1, "tags": [], "text": "Works fine for me using JMeter 2.10 and 2.11 on MacOs.\n\nMake sure you save the JMX file before exitting.\n\nIf you are still having problems, create a JMX file containing just the Listener and attach to this issue.", "attachment_id": null, "id": 176004, "creator": "sebb@apache.org", "time": "2014-06-24T10:58:51Z", "bug_id": 56662, "creation_time": "2014-06-24T10:58:51Z", "is_private": false}, {"count": 2, "tags": [], "creator": "kasper.janssens.android@gmail.com", "is_private": false, "text": "Created attachment 31746\nTest jmx plan as requested", "id": 176005, "time": "2014-06-24T11:21:06Z", "bug_id": 56662, "creation_time": "2014-06-24T11:21:06Z", "attachment_id": 31746}, {"count": 3, "tags": [], "text": "I agree that something has gone wrong with 2.11 - and 2.10\nThey both fail to preserve most of the settings.\n\nThis does seem to have been fixed in the current code; if you are willing to try a nightly build it would be interesting to know if it fixes the issue for you.\n\nWhen I tested earlier, I created the test plan with the current test code and tried it in 2.11. This worked. However, when I retested by creating the plan in 2.11 it failed.\n\nThe difference is very subtle.\n\nIn 2.9 (and current code) the config section starts as follows:\n\n<objProp>\n<name>saveConfig</name>\n<value class=\"SampleSaveConfiguration\">\n\nHowever in 2.10 and 2.11 the <name> line is missing; this causes the problem.\n\nUnfortunately it looks like test plans created in 2.10 and 2.11 will not be upwards compatible. Maybe there is a way to detect the missing tag. If it cannot be automatically added, then JMeter could provide a warning.", "attachment_id": null, "id": 176019, "creator": "sebb@apache.org", "time": "2014-06-25T01:07:40Z", "bug_id": 56662, "creation_time": "2014-06-25T01:07:40Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 56662, "is_private": false, "count": 4, "id": 176022, "time": "2014-06-25T07:52:04Z", "creator": "kasper.janssens.android@gmail.com", "creation_time": "2014-06-25T07:52:04Z", "text": "Confirmed that the dev version solves the problem, however, I don't feel so comfortable with everybody switching over to a development version. Is there any chance of having this patch retrofitted on the 2.11 version, in a short timeframe? Or is there something else we can do?"}, {"count": 5, "tags": [], "bug_id": 56662, "attachment_id": null, "id": 176035, "time": "2014-06-25T13:50:10Z", "creator": "sebb@apache.org", "creation_time": "2014-06-25T13:50:10Z", "is_private": false, "text": "(In reply to Kasper Janssens from comment #4)\n> Confirmed that the dev version solves the problem, however, I don't feel so\n> comfortable with everybody switching over to a development version. \n\nFair enough.\nThatnks for confirming it fixes the issue.\n\n> Is there\n> any chance of having this patch retrofitted on the 2.11 version, in a short\n> timeframe?\n\nWe don't do retrofits; the fix will be in the next release (2.12) which will be produced from the current trunk - i.e. the dev version - when we have time.\n\n> Or is there something else we can do?\n\nIf the JMX files are created and maintained in 2.9 (or current dev) they should work OK in 2.11.\n\nOr you can fix up the JMX file manually to add the missing line.\nHowever 2.10 and 2.11 will lose the line if the plan is re-saved after editting."}, {"count": 6, "tags": [], "bug_id": 56662, "attachment_id": null, "id": 176038, "time": "2014-06-25T13:56:16Z", "creator": "kasper.janssens.android@gmail.com", "creation_time": "2014-06-25T13:56:16Z", "is_private": false, "text": "So, do I interpret your statement correctly when I say that the current code in the trunk IS the 2.12 version (in the future)? Because in that case we might consider using the dev version of course, I'm just a bit reluctant to use it if there would still be considerable code flux. \n\nDo I also understand correctly that you don't really have a strict release date planned for 2.12 (important factor when we considering using the dev version, if it's still quite some time away we might have to go for the dev version as it's a bit of an annoying bug.)?\n \nI recall we had problems using the 2.9 version (don't recall which ones anymore) so that's not really an option right now.\n\nThanks for the clarification."}, {"count": 7, "tags": [], "bug_id": 56662, "attachment_id": null, "id": 176043, "time": "2014-06-25T14:54:02Z", "creator": "sebb@apache.org", "creation_time": "2014-06-25T14:54:02Z", "is_private": false, "text": "(In reply to Kasper Janssens from comment #6)\n> So, do I interpret your statement correctly when I say that the current code\n> in the trunk IS the 2.12 version (in the future)?\n\nNot exactly. There may be additional changes before 2.12 is released.\n\n> Because in that case we\n> might consider using the dev version of course, I'm just a bit reluctant to\n> use it if there would still be considerable code flux. \n> \n> Do I also understand correctly that you don't really have a strict release\n\nThis is an all-volunteer effort; releases are done when there are resources available.\n\n> date planned for 2.12 (important factor when we considering using the dev\n> version, if it's still quite some time away we might have to go for the dev\n> version as it's a bit of an annoying bug.)?\n\nNote that the nightly builds are not formal releases, and are not guaranteed.\n\n> I recall we had problems using the 2.9 version (don't recall which ones\n> anymore) so that's not really an option right now.\n\nI was only suggesting using 2.9 to maintain the test plans, not run them.\n \n> Thanks for the clarification.\n\nHaving said tah, I have just been ahving a look at what changes could have caused the problem.\n\nIt looks like it might not be a JMeter code problem, but it might be the version of XStream.\n\nIt so happens that 2.10 and 2.11 switched to using XStream 1.4.4 (from 1.4.2); the current dev code uses 1.4.6. This appears to be the culprit.\n\nSo try replacing lib/xstream-1.4.4.jar with version 1.4.6\n\nIt seemed to help when I just tested it.\n\nYou can get the jar from http://xstream.codehaus.org/ or Maven\nhttp://repo1.maven.org/maven2/com/thoughtworks/xstream/xstream/\n\nIt looks like there is 1.4.7 also available; not yet tried."}, {"count": 8, "tags": [], "text": "I wasn't trying to rush you guys for releasing, I realize it's a volunteer effort,  that's all good, just trying to find out which way to go. But thanks for the effort, because indeed, swapping in the 1.4.6 library does the trick. So I guess we'll be doing that and are going to stick with the 2.11 branch right now. Thanks for the help, issue can be closed now as far as I'm concerned.", "attachment_id": null, "id": 176045, "creator": "kasper.janssens.android@gmail.com", "time": "2014-06-25T15:10:28Z", "bug_id": 56662, "creation_time": "2014-06-25T15:10:28Z", "is_private": false}, {"count": 9, "text": "Affects 2.10 and 2.11.\n\nDate: Sat Jul  5 13:04:19 2014\nNew Revision: 1608012\n\nURL: http://svn.apache.org/r1608012\nLog:\nBug 56662 - Save as xml in a listener is not remembered\nFixed by upgrade of xstream to 1.4.6\nBugzilla Id: 56662\n\nModified:\n    jmeter/trunk/xdocs/changes.xml", "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "id": 176221, "time": "2014-07-05T13:05:38Z", "bug_id": 56662, "creation_time": "2014-07-05T13:05:38Z", "tags": [], "attachment_id": null}]