[{"count": 0, "tags": [], "creator": "raul.wegmann@qrr.es", "attachment_id": 31825, "id": 176448, "time": "2014-07-17T06:35:36Z", "bug_id": 56735, "creation_time": "2014-07-17T06:35:36Z", "is_private": false, "text": "Created attachment 31825\nPatch that allows to optionally specify a custom temporary file directory in SXSSF\n\nThe temporary files generated when using a SXSSFWorkbook are stored in the default system temp directory. \n\nAs our application is deployed together with other applications on the same application server, we are not allowed to change the java.io.tmpdir system property. Further, subclassing the SXSSFWorkbook and related classes is made difficult because many methods are package protected.\n\nTherefore we would like you to consider the inclusion of the attached patch, which optionally allows to set a temp file directory property on the SXSSFWorkbook. The API changes are backward compatible."}, {"count": 1, "tags": [], "text": "We already have temp file helpers in POI, so it's a surprise to see that sxssf isn't apparently using that - org.apache.poi.util.TempFile\n\nI'd probably rather we get SXSSF following the rest of POI in using that, then think about ways to allow you to override where that stores its files", "attachment_id": null, "id": 176456, "creator": "apache@gagravarr.org", "time": "2014-07-17T13:09:09Z", "bug_id": 56735, "creation_time": "2014-07-17T13:09:09Z", "is_private": false}, {"count": 2, "tags": [], "text": "Thanks for pointing out the existing infrastructure. I will work on a new set of patches for you to review.", "attachment_id": null, "id": 176488, "creator": "raul.wegmann@qrr.es", "time": "2014-07-18T12:21:58Z", "bug_id": 56735, "creation_time": "2014-07-18T12:21:58Z", "is_private": false}, {"count": 3, "tags": [], "text": "Please see the pull request at https://github.com/apache/poi/pull/10 for a set of changes that would implement this feature using the org.apache.poi.util.TempFile class and let me know what you think.", "attachment_id": null, "id": 176521, "creator": "raul.wegmann@qrr.es", "time": "2014-07-18T21:22:25Z", "bug_id": 56735, "creation_time": "2014-07-18T21:22:25Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 56735, "text": "Thanks for this, patch applied in r1613246.\n\nIf you could review and close the GitHub pull request, that'd be great!", "id": 176671, "time": "2014-07-24T18:59:31Z", "creator": "apache@gagravarr.org", "creation_time": "2014-07-24T18:59:31Z", "is_private": false, "attachment_id": null}]