[{"count": 0, "tags": [], "creator": "zmaximz@gmail.com", "attachment_id": null, "text": "DETAILS:\n\nThe recommended/default mod_reqtimeout configuration allows a remote attacker to consume all Apache connections while sending part of the post body in time intervals (AKA SlowPost attack) with a byte-rate greater than the configured MinRate (500 by default).\n\nExample: Sending 10Kb of the body each 5 seconds will bypass recommended configuration.\n\nReferences to recommended conf:\n1. http://publib.boulder.ibm.com/httpserv/manual60/mod/mod_reqtimeout.html\n2. http://docs.cpanel.net/twiki/bin/view/EasyApache/Apache/SlowlorisAttacks\n3. http://blog.spiderlabs.com/2011/07/advanced-topic-of-the-week-mitigating-slow-http-dos-attacks.html#Mitigating Slow Request Attacks with Mod_Reqtimeout and ModSecurity\n\nIMPACT:\n\nVulnerable are most of the Apache users who rely on the mod_reqtimeout module to mitigate the SlowPost DoS attack.\n\nSOLUTION:\nAdd to the default configuration an upper bound (maxtimeout) for the \"body\" parameter.", "id": 176544, "time": "2014-07-20T17:13:25Z", "bug_id": 56751, "creation_time": "2014-07-20T17:13:25Z", "is_private": false}, {"count": 1, "attachment_id": null, "creator": "covener@gmail.com", "text": "http://httpd.apache.org/docs/2.4/mod/mod_reqtimeout.html\n\nThe first and fourth examples in the manual use a maxtimeout on the body (if I'm understanding the syntax correctly). \n\nNet, if you want a maxtimeout, you have to configure one. \n\nIs it the manual you want updated? \nOr some default configuration? \nOr the way the module behaves if you load it and don't configure it at all?\n\nDo you have an argument for a reasonable (doesn't break normal clients) and effective (actual benefit to a client that reconnects) body maxtimeout?", "id": 176545, "time": "2014-07-20T18:30:57Z", "bug_id": 56751, "creation_time": "2014-07-20T18:30:57Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "creator": "zmaximz@gmail.com", "text": "As I understand from the module's behavior, \"timeout\" refers to \"time to first byte\" of the header/body and \"maxtimeout\" refers to \"time to last byte\" of the header/body.\n\n\"type=timeout-maxtimeout,MinRate=data_rate\" \n\nWhat I believe that is missing is the \"maxtimeout\" for the body:\nRequestReadTimeout header=20-40,MinRate=500 body=20-40,MinRate=500\n\nInstead of:\nRequestReadTimeout header=20-40,MinRate=500 body=20,MinRate=500\n\nThe missing \"maxtimeout\" for the body makes the described attack effective.\nI believe 40 seconds is a reasonable time for \"maxtimeout\".\n\nI think editing the example might be the first step, so future mod_reqtimeout users won't be vulnerable.\n\nIs there a common channel to inform all the distributions that ship with Apache httpd, so they could consider changing their default configuration?", "id": 176549, "time": "2014-07-20T20:26:31Z", "bug_id": 56751, "creation_time": "2014-07-20T20:26:31Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 56751, "attachment_id": null, "id": 176550, "time": "2014-07-20T21:43:37Z", "creator": "covener@gmail.com", "creation_time": "2014-07-20T21:43:37Z", "is_private": false, "text": "> I think editing the example might be the first step, so future\n> mod_reqtimeout users won't be vulnerable.\n\nIs what you're referring to as \"the example\" the text next to the word \"Default\" in the manual?  The default is not an example, it's what you get by default when you don't use the directive.  In other words, the compiled-in defaults for the module. Is that what you're lobbying for to be 40 seconds?\n\nAs I said before, there are plenty of examples that use a timeout for the body. But the user has to select one.\n\nPlease start a thread over on dev@httpd.apache.org if you want to discuss a change to the defaults in the 2.4 or 2.2 maintenance stream -- I am personally not in favor, but that is the proper place for discussion.\n\n> Is there a common channel to inform all the distributions that ship with\n> Apache httpd, so they could consider changing their default configuration?\n\nNot really."}]