[{"count": 0, "tags": [], "bug_id": 56763, "text": "The src/core/org/apache/jmeter/images directory contains icons from the venerable Java Look-And-Feel Graphics Repository [1] (the *24.gif files) but unlike the files from the Open Icon Library these icons are not credited in the LICENSE/NOTICE files.\n\nAlso it is worth noting that the license doesn't allow modifications, but JMeter contains several modified icons from this collection (the *24.over.gif and *24.down.gif files, the .on.gif and .off.gif files look unmodified).\n\nHere is the copyright notice included with the icon collection:\n\nLICENSE FOR SOFTWARE GRAPHICS ARTWORK\n\nORACLE AMERICA, INC. (\"ORACLE\"), FOR AND ON BEHALF OF ITSELF AND ITS SUBSIDIARIES AND AFFILIATES UNDER COMMON CONTROL, IS WILLING TO LICENSE THE SOFTWARE GRAPHICS ARTWORK TO YOU ONLY UPON THE CONDITION THAT YOU ACCEPT ALL OF THE TERMS CONTAINED IN THIS LICENSE AGREEMENT (\"AGREEMENT\"). PLEASE READ THE AGREEMENT CAREFULLY. BY SELECTING THE \"ACCEPT\" (OR THE EQUIVALENT) BUTTON AND/OR BY DOWNLOADING AND/OR USING THE SOFTWARE GRAPHICS ARTWORK, YOU ACKNOWLEDGE THAT YOU HAVE READ THE TERMS AND AGREE TO THEM. IF YOU ARE AGREEING TO THESE TERMS ON BEHALF OF A COMPANY OR OTHER LEGAL ENTITY, YOU REPRESENT THAT YOU HAVE THE LEGAL AUTHORITY TO BIND THE LEGAL ENTITY TO THESE TERMS. IF YOU DO NOT HAVE SUCH AUTHORITY, OR IF YOU DO NOT WISH TO BE BOUND BY THE TERMS, THEN SELECT THE \"DECLINE\" (OR THE EQUIVALENT) BUTTON AND YOU MUST NOT DOWNLOAD OR USE THE SOFTWARE GRAPHICS ARTWORK ON THIS SITE OR ANY OTHER MEDIA ON WHICH THE SOFTWARE GRAPHICS ARTWORK IS CONTAINED.\n\nCopyright Notice for the Software Graphics Artwork: Copyright 2000 Oracle and/or its affiliates. All Rights Reserved.\n\nSubject to the terms and conditions of this agreement, Oracle grants you, the individual or entity that executes this agreement by clicking “accept” and downloading the software graphics artwork, a non-exclusive, non-transferable, royalty-free, limited right to use, reproduce, display or distribute this software graphics artwork, as individual graphics or as a collection, as part of software code or programs that you develop, provided that i) this license and the copyright notice above accompany the software graphics artwork; and ii) you do not utilize the software graphics artwork in a manner that is disparaging to Oracle. Unless the enforcement of a restriction against modification is prohibited by applicable law, you may not modify the graphics, and must use them true to color and unmodified in every way.\n\nThe software graphics artwork is subject to copyright. Title to the software graphics artwork and all associated intellectual property rights is retained by Oracle and/or its licensors. This software graphics artwork is provided \"AS IS,\" without a warranty of any kind. ORACLE FURTHER DISCLAIMS ALL WARRANTIES, EXPRESS AND IMPLIED, INCLUDING WITHOUT LIMITATION, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NONINFRINGEMENT.\n\nIN NO EVENT WILL ORACLE OR ITS LICENSORS BE LIABLE FOR ANY INDIRECT, SPECIAL, CONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, OR DAMAGES FOR LOSS OF REVENUE, PROFITS, DATA, OR DATA USE, INCURRED BY YOU OR ANY THIRD PARTY, HOWEVER CAUSED AND REGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF THIS AGREEMENT OR THE USE OF OR INABILITY TO USE THE SOFTWARE GRAPHICS ARTWORK, EVEN IF ORACLE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. ORACLE’S ENTIRE LIABILITY FOR DAMAGES HEREUNDER SHALL IN NO EVENT EXCEED ONE THOUSAND DOLLARS (U.S. $1000.00).\n\nThis agreement is effective until terminated. You may terminate this agreement at any time by ceasing all use of the software graphics artwork. This agreement will terminate immediately without notice from Oracle if you fail to comply with any provision of this agreement. Either of us may terminate this agreement immediately should the software graphics artwork become, or in either party’s opinion, be likely to become, the subject of a claim of infringement of any intellectual property right. Upon termination, you will promptly cease using the software graphics artwork.\n\nIf any term of this agreement is found to be invalid or unenforceable, the remaining terms will remain effective, and such term will be replaced by a term consistent with the purpose and intent of this agreement.\n\nYou represent and warrant that you have not in any way unilaterally modified the terms of this agreement as provided by Oracle.\n\nThis agreement is governed by the substantive and procedural laws of the state of California and controlling U.S. federal law and you and Oracle agree to submit to the exclusive jurisdiction of, and venue in, the courts in San Francisco or Santa Clara counties, California, in any dispute arising out of or relating to this agreement.\n\nThis agreement is our complete agreement for your use of the software graphics artwork, and this agreement supersedes all prior or contemporaneous agreements or representations, written or oral, regarding the software graphics artwork.\n\nFor inquiries please contact: Oracle America, Inc., 500 Oracle Parkway, Redwood Shores, California 94065, USA.\n\n[1] http://www.oracle.com/technetwork/java/repository-140393.html", "id": 176623, "time": "2014-07-23T12:47:17Z", "creator": "ebourg@apache.org", "creation_time": "2014-07-23T12:47:17Z", "is_private": false, "attachment_id": null}, {"count": 1, "text": "\nJMeter does not uses these icons in any part.\nThe removing of all *24*.gif will solve this issue, I suppose? and no needs to add the Oracle licence?", "bug_id": 56763, "is_private": false, "id": 176646, "time": "2014-07-24T13:28:57Z", "creator": "milamber@apache.org", "creation_time": "2014-07-24T13:28:57Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "creator": "ebourg@apache.org", "text": "Indeed, removing these icons is also a good solution.", "id": 176647, "attachment_id": null, "bug_id": 56763, "creation_time": "2014-07-24T13:31:51Z", "time": "2014-07-24T13:31:51Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 56763, "text": "\nDone.\n\nURL: http://svn.apache.org/r1613506\nLog:\nRemoving the Oracle icons, not used by JMeter (and missing license)\nBugzilla Id: 56763\n\nRemoved:\n    jmeter/trunk/src/core/org/apache/jmeter/images/Delete24.down.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Delete24.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Delete24.off.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Delete24.on.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Delete24.over.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Edit24.down.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Edit24.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Edit24.off.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Edit24.on.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Edit24.over.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/New24.down.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/New24.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/New24.off.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/New24.on.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/New24.over.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Open24.down.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Open24.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Open24.off.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Open24.on.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/Open24.over.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/SaveAll24.down.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/SaveAll24.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/SaveAll24.off.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/SaveAll24.on.gif\n    jmeter/trunk/src/core/org/apache/jmeter/images/SaveAll24.over.gif\nModified:\n    jmeter/trunk/xdocs/changes.xml", "id": 176690, "time": "2014-07-25T19:38:59Z", "creator": "milamber@apache.org", "creation_time": "2014-07-25T19:38:59Z", "is_private": false, "attachment_id": null}]