[{"count": 0, "tags": [], "text": "Tomcat JDBC Enhanced Attribute initSQL is a string documented as \" A custom query to be run when a connection is first created.\"  Often multiple statements (not really \"queries\") need to be executed to initialize a connection, and you only want to do this once.  There are rather involved workarounds to pass a single \"statement\" which executes multiple statements, but the interface would be improved if more than one statement could be specified. See DBCP2 BasicDataSource.setConnectionInitSqls(Collection<String> connectionInitSqls).", "is_private": false, "id": 176714, "creator": "wclark@guidewire.com", "time": "2014-07-28T17:22:40Z", "bug_id": 56779, "creation_time": "2014-07-28T17:22:40Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 56779, "text": "The problem with putting multiple statements into the \"initSQL\" attribute value is that tomcat-pool then needs to basically implement a SQL statement parser in order to determine where each statement starts and ends.\n\nIf a special character could be used between statements that is extremely unlikely to be used in one of the SQL statements (for instance, vertical tab) such statements could be separated by that instead of something more natural such as a semicolon.", "id": 176722, "attachment_id": null, "creator": "chris@christopherschultz.net", "creation_time": "2014-07-28T19:22:38Z", "time": "2014-07-28T19:22:38Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 56779, "attachment_id": null, "id": 176724, "time": "2014-07-28T19:40:15Z", "creator": "fhanik@apache.org", "creation_time": "2014-07-28T19:40:15Z", "is_private": false, "text": "well, I like the idea of copying the API\nBasicDataSource.setConnectionInitSqls(Collection<String> connectionInitSqls)\n\nafter all, the copied the idea of init SQL from us :)\nthat way programmatically it works, and more sophisticated DI frameworks have no problems injecting collections.\n\nIn Tomcat server.xml, we can still use a single string, like the work around\nBEGIN\n  statement1;\n  statement2;\n  statement3;\nEND\n\nthat folks have been using today"}]