[{"count": 0, "tags": [], "bug_id": 56787, "attachment_id": 31855, "id": 176748, "time": "2014-07-29T09:48:09Z", "creator": "xshao@ebay.com", "creation_time": "2014-07-29T09:48:09Z", "is_private": false, "text": "Created attachment 31855\nPatch\n\nTomcat uses JNDI to look up resource. The name of a resource needs to be parsed into a Name object. By default it is a CompositeName. \nParsing a string to a CompositeName is low performance due to the following reason,\n\n1. Call too many times of the method \"String.startsWith\"\n2. Create StringBuffer instance for each component\n\nThe patch provides a simplified Name implementation. The parsing is around 6 times faster than the default one. The result was get on my Macbook Pro by running TestSimpleName.testAB().\n\nThe issue is impacting the start up of tomcat server. Because there are many resource looking up when server is starting.\n\nThe patch can improve the server start time."}, {"count": 1, "tags": [], "bug_id": 56787, "attachment_id": 31856, "id": 176749, "time": "2014-07-29T09:49:53Z", "creator": "xshao@ebay.com", "creation_time": "2014-07-29T09:49:53Z", "is_private": false, "text": "Created attachment 31856\nScreenshot got from JProfiler where tomcat is starting"}, {"count": 2, "tags": [], "bug_id": 56787, "attachment_id": null, "id": 176918, "time": "2014-08-05T11:33:31Z", "creator": "markt@apache.org", "creation_time": "2014-08-05T11:33:31Z", "is_private": false, "text": "Marking this as an enhancement.\n\nThe profiler results appear to show that this is a fairly small part of the overall start time. I do have some concerns about the size of the patch compared to the expected benefit.\n\nCould you provide some insight into: size of the application; start time without this patch; and start time with this patch?"}, {"count": 3, "tags": [], "bug_id": 56787, "text": "One of our application contains around 1800 jar files, and the benefit from the patch in this application is 300 ms faster on server startup.\n\n(In reply to Mark Thomas from comment #2)\n> Marking this as an enhancement.\n> \n> The profiler results appear to show that this is a fairly small part of the\n> overall start time. I do have some concerns about the size of the patch\n> compared to the expected benefit.\n> \n> Could you provide some insight into: size of the application; start time\n> without this patch; and start time with this patch?", "id": 177900, "time": "2014-09-16T02:16:46Z", "creator": "hzhang9@ebay.com", "creation_time": "2014-09-16T02:16:46Z", "is_private": false, "attachment_id": null}]