[{"count": 0, "tags": [], "creator": "romeara@live.com", "text": "XSSFName.validateName(String) (and HSSFName.validateName(String)) each validate name input for named ranged (when set via \"setNameName(String)'). This validation only checks that the first character is an underscore or letter, and that there are no spaces in the name. \n\nThis does not prevent other invalid characters (such as '-') from being used within the body of the name. Upon opening the file in Excel 2010, excel claims there is corrupted data and attempts repair (which consists of removing the offending named range(s), after which the file is readable without issue)\n\nBoth of these validation methods should check the full length of the name for invalid characters. \n\nThere is a forum post in the excel forums with someone asking what the valid useable chracters are. The most relevant response was:\n\n\"From Excel Help:\n\nWhat characters are allowed? The first character of a name must be a letter, an underscore character (_), or a backslash (\\).\nRemaining characters in the name can be letters, numbers, periods, and underscore characters.\"\n\nThere are additional restrictions documented in the javadoc of HSSFName.setNameName and XSSFName.setNameName, such as maximum length.", "id": 176729, "time": "2014-07-28T21:55:00Z", "bug_id": 56781, "creation_time": "2014-07-28T21:55:00Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 56781, "attachment_id": null, "text": "Side note: If I manage to get the POI environment setup, I'd be willing to take a crack at a patch for this", "id": 176730, "time": "2014-07-28T21:55:45Z", "creator": "romeara@live.com", "creation_time": "2014-07-28T21:55:45Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 56781, "text": "http://poi.apache.org/howtobuild.html and http://poi.apache.org/guidelines.html should hopefully cover you on getting started to contribute\n\nFormulaParser currently has logic for deciding if a sequence of characters is a valid (anything) for a formula, my first hunch is it might be possible to perhaps re-use the name validating parts of that?", "id": 176732, "time": "2014-07-28T22:08:31Z", "creator": "apache@gagravarr.org", "creation_time": "2014-07-28T22:08:31Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "onealj@apache.org", "attachment_id": null, "id": 191832, "time": "2016-06-20T10:29:26Z", "bug_id": 56781, "creation_time": "2016-06-20T10:29:26Z", "is_private": false, "text": "That Excel help forum may not be reputable (for example, unicode characters are allowed, allowing backslash as the first character but not subsequent characters raises flags).\n\nBetter would be documentation from Microsoft on allowed names in Excel 97-2003 and 2007+. This would need to be verified using Excel (preferably these files could be used for POI unit tests).\n\nI made up a regular expression that validates the entire string in r1749293. This regular expression will likely need tweaking to match Excel's rules."}, {"count": 4, "tags": [], "bug_id": 56781, "attachment_id": null, "text": "Reverted back to using Character.isLetter in r1749305 because Regular Expressions \\p{IsAlphabetic} metaclass is not supported in Java 6.", "id": 191838, "time": "2016-06-20T11:28:56Z", "creator": "onealj@apache.org", "creation_time": "2016-06-20T11:28:56Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 56781, "attachment_id": null, "text": "Fixed in r1764854.", "id": 194419, "time": "2016-10-14T10:12:05Z", "creator": "onealj@apache.org", "creation_time": "2016-10-14T10:12:05Z", "is_private": false}]