[{"count": 0, "tags": [], "creator": "mpetropo@cs.ucsd.edu", "is_private": false, "text": "I'm using the \"manager\" application to re-deploy a web application. First, I\nuse the \"remove\" operation to remove the web app and then I use the\n\"install\" operation to deploy a new web app with the same name. I use a WAR\nfile and the \"unpackWARs\" attribute of the \"Host\" element in the\n\"server.xml\" is set to true.\n\nThe problem is that the files in the web app directory do not get updated.\nThe \"remove\" operation does not delete the web app directory under the\n\"webapps\" directory, and the \"install\" operation does not overwrite the old\nfiles.\n\nI located the problem in:\n\n\"org.apache.catalina.core.StandardHost.java\",\n\nwhere the method:\n\n\"public void remove(String contextPath);\" (line 772)\n\nthat implements the \"remove\" operation does not delete the web app directory\nunder the \"webapps\" directory. Even though there is the method:\n\n\"protected void remove(File dir);\" (line 1008)\n\nthat does exactly that, it is never used. Then the method:\n\n\"public void install(String contextPath, URL war);\" (line 644)\n\nthat implements the \"install\" operation calls the method:\n\n\"protected String expand(URL war);\" (line 901)\n\nthat expands the provided WAR file and checks if there is already a\ndirectory, under the \"webapps\" directory, named after the web app to be\ninstalled:\n\n    if (docBase.exists()) {\n        // War file is already installed\n        return (docBase.getAbsolutePath());\n    }\n\nIf there is, then it returns without doing anything, which causes the files\nin the web app directory not to get updated.", "id": 9328, "time": "2002-01-03T13:33:55Z", "bug_id": 5680, "creation_time": "2002-01-03T13:33:55Z", "attachment_id": null}, {"count": 1, "text": "I may be wrong, but I think that's what was being done in the past, but IMO it's\ntoo dangerous to just delete the files, as the user could have modified some\nwebapp settings by editing some configuration file.", "creator": "remm@apache.org", "attachment_id": null, "id": 9347, "time": "2002-01-04T06:04:29Z", "bug_id": 5680, "creation_time": "2002-01-04T06:04:29Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 5680, "attachment_id": null, "text": "According to my previous comments, I think it is too dangerous to implement the\nbehavior you suggest.", "id": 9867, "time": "2002-01-24T16:34:09Z", "creator": "remm@apache.org", "creation_time": "2002-01-24T16:34:09Z", "is_private": false}]