[{"count": 0, "tags": [], "bug_id": 56831, "attachment_id": 31889, "text": "Created attachment 31889\nMaven project to reproduce the issue - its simplified RichFaces project to contain only JSF dependencies\n\nWhen I deploy a JSF application (Mojarra 2.2.7), which .war name contains dash (deployed context root contains dash as well), javax.faces.application.ViewExpiredException is being in the first Ajax request from such application.\n\nThe same application works if its .war does not contain dash (the context root is without dash).\n\nAnother important thing to reproduce this is, that the error is thrown only when you get to the app via redirect. If the application is loaded directly, everything works. More info in steps to reproduce.\n\nI have tried different Tomcat versions - 8.x, 7.0.30, etc. - still the same.\nI have tried different JSF Mojarra versions, newer or older.\n\nHere are the steps to reproduce:\n1. download attached maven project\n2. issue \"mvn clean package\" from its root directory\n3. deploy simple-app.war to Tomcat\n4. load localhost:8080 and then Tomcat Gui manager\n5. click on the context root to load actual app\n6. try to write something into input and see the ViewExpiredException", "id": 177015, "time": "2014-08-08T14:28:24Z", "creator": "jhuska@redhat.com", "creation_time": "2014-08-08T14:28:24Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 56831, "attachment_id": null, "text": "FYI original issue report in RichFaces issue management:\nhttps://issues.jboss.org/browse/RF-13731", "id": 177016, "time": "2014-08-08T14:32:03Z", "creator": "jhuska@redhat.com", "creation_time": "2014-08-08T14:32:03Z", "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 177017, "time": "2014-08-08T14:37:12Z", "bug_id": 56831, "creation_time": "2014-08-08T14:37:12Z", "is_private": false, "text": "Some explanation of why you think this is a Tomcat bug would be helpful."}, {"count": 3, "tags": [], "bug_id": 56831, "attachment_id": null, "text": "Hello,\n\nthanks for quick response. IMHO it is a Tomcat bug because it is the only servlet container/application container I am able to reproduce this issue on. It works on e.g. JBoss AS 7.1.1.Final or Wildfly 8.1.0.Final.\n\nAdditionally, I managed to reproduce it without Tomcat manager as well. The key to reproduce it is to access the JSF app (localhost:8080/simple-app) from a link with following code:\n\n<a href=\"/simple%2Dapp\">simple-app</a>\n\nThe issue is occurring only when href attribute contains dash as a URL encoded character.", "id": 177065, "time": "2014-08-11T11:09:38Z", "creator": "jhuska@redhat.com", "creation_time": "2014-08-11T11:09:38Z", "is_private": false}, {"text": "That you only see this bug on Tomcat could mean that Tomcat is following a strict interpretation of the spec whereas other containers are being more lenient. Given that you know the application far better than the Tomcat developers, it makies things a lot simpler if the bug is presented in the form:\n\n- the attached app calls method X with parameters Y\n- as per the Servlet/JSP/EL/WebSocket/HTTP/etc. spec, Tomcat should return A but instead returns B\n\nrather than the Tomcat developers having to dig their way through an app they have no knowledge of to try and work out which API call (that might be returning a completely valid result) is causing the problem.\n\nIt isn't that we aren't going to look into this bug - I'm going to start on it now - but you could really help move things along by providing a more specific bug report than \"The attached app throws an expception when I do this.\"", "tags": [], "bug_id": 56831, "attachment_id": null, "count": 4, "id": 177080, "time": "2014-08-11T19:31:19Z", "creator": "markt@apache.org", "creation_time": "2014-08-11T19:31:19Z", "is_private": false}, {"count": 5, "tags": [], "creator": "markt@apache.org", "text": "I can confim that this is not a Tomcat bug.\n\nThe issue is triggered by HttpServletRequest.getContextPath() returning \"/simple%2dapp\" rather than \"/simple-app\". I have confirmed this by:\n1. Confirming I can reproduce the issue using the provided steps.\n2. Using a debugger, change the return value of getContextPath() from \"/simple%2dapp\" to \"/simple-app\" and confirming that the exception no longer occurs.\n\nThe Javadoc for getContextPath() [1] is clear. The container does NOT decode this method.\n\nThe simplest fix is probably for RichFaces to use ServletContext.getContextPath()\n\nThat you don't see this bug on other containers suggests that those containers are not following the specification for HttpServletRequest.getContextPath().\n\n[1] http://docs.oracle.com/javaee/7/api/javax/servlet/http/HttpServletRequest.html#getContextPath%28%29", "id": 177082, "time": "2014-08-11T20:08:01Z", "bug_id": 56831, "creation_time": "2014-08-11T20:08:01Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "creator": "knst.kolinko@gmail.com", "text": "1) Guessing with a crystal ball I think ViewExpiredException means that you rely on cookies for session management and the session cookie has not been sent by the browser.\n\n2) The RF-13731 issue mentioned that behaviour differs between browsers. (Firefox has the issue, Chrome does not).\nIs that true? Why are you not mentioning it?\n\n\nI am experimenting with the following configuration:\n- current Tomcat 7.0.x (~7.0.55)\n- Using the default examples webapp renamed to \"ex-amples\"\n- Firefox 31.0\n- I am using built-in Network tool in Firefox to inspect HTTP headers of requests and responses (Tools menu > Web development > Network).\n\nThe scenario is as following:\n1. Access SessionExample page as\n[1] http://localhost:8080/ex%2Damples/servlets/servlet/SessionExample\n\n2. I observe the following:\n1) Firefox displays the URL in address bar as\nhttp://localhost:8080/ex-amples/servlets/servlet/SessionExample\n\n2) Tomcat sends the following header:\nSet-Cookie: JSESSIONID=727BF492DC0D245BD0AD2D749EB1BD6D; Path=/ex-amples/; HttpOnly\n\n3. If I access [1] again in either of the following ways:\na) copy-pasting the above URL into the address bar\nb) refreshing the page (pressing F5 key on keyboard or clicking green reload button in the address bar)\nFirefox does not send Cookie header with the request.\n\n4. If I go to address bar and press 'Enter' (Ctrl+L, Enter), Firefox uses '-' character in the request and sends Cookie header with the request.\n\n\n1). The browser behaviour seems odd to me, but to properly judge it one has to look into applicable specifications and test with other browsers. It might be a browser bug. It might be different interpretation of a specification.\n\nDoes the behaviour differ between browsers?\n\n2). A well-known recommendation for web application authors is to apply HttpServletResponse.encodeURL() to their URLs. That is to ensure that their applications that require sessions can operate with browsers that do not support cookies.", "id": 177088, "time": "2014-08-11T20:32:06Z", "bug_id": 56831, "creation_time": "2014-08-11T20:32:06Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "jhuska@redhat.com", "attachment_id": null, "id": 177102, "time": "2014-08-12T11:50:13Z", "bug_id": 56831, "creation_time": "2014-08-12T11:50:13Z", "is_private": false, "text": "Thanks for your input and guidance. My unhelpful issue description was caused by my lack of expertise. Now I have a bit bigger understanding what is going on, and I will dig in deeper and provide you some more information."}]