[{"count": 0, "text": "I'm running apache with mod_ratelimit, using the following in config file:\nSetOutputFilter RATE_LIMIT\nSetEnv rate-limit 0\n\nThis way I activate Rate-Limit output filter but disable it by setting rate-limit env variable to 0, so all downloads go in full speed. When any particular file is to be sent in a slower manner, a php scripts sets apache_setenv(\"rate-limit\",30) in order to activate the rate limit.\n\nSometimes I notice in apache log the following line:\n[Sat Aug 09 08:20:02.914169 2014] [ratelimit:error] [pid 10795] [client XXXXX:51962] AH01457: rl: brigade pass failed., referer: XXXX\n\nI've reviewed the source code and I tried to understand how brigades work.\nThe error message comes from mod_ratelimit.c, when return value of ap_pass_brigade() is not equal to APR_SUCCESS.\n\nFirst of all I would like to better understand what happens. Do I understand it right that once the break is called, so it looks like the file is sent in full speed, right? Does it interrupt the connection or download?\n\nIs the error \"recoverable\", I mean, is the user still getting the file he tries to download? If not, can we make some code adjustments in order to try to \"fix\" the problem on the fly, eg. by retrying ap_pass_brigade() call? If the error is recoverable, can we silence the error message?\n\nThank you", "creator": "tomas@slax.org", "is_private": false, "id": 177031, "time": "2014-08-09T21:01:32Z", "bug_id": 56832, "creation_time": "2014-08-09T21:01:32Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 56832, "attachment_id": null, "is_private": false, "id": 177032, "time": "2014-08-09T21:13:50Z", "creator": "covener@gmail.com", "creation_time": "2014-08-09T21:13:50Z", "text": "I notice this message does not pass \"rv\". You might want to rebuild with it adde and also log %X and trace1 logging and see if these are just occasional routine client disconnects\n\nBut more importantly, I think the severity of ERROR is too high. 9 times out of 10 it's going to mean the core output filter couldn't write out to the client (this will occasionally happen when a client disconnects. That error is logged at INFO in 2.2 and trace1 in 2.4/trunk.\n\nIf you find a bug, feel free to re-open -- but for discussion, please use users@httpd.apache.org rather than the bug reporting database."}, {"count": 2, "tags": [], "bug_id": 56832, "attachment_id": null, "is_private": false, "id": 177033, "time": "2014-08-09T21:16:15Z", "creator": "covener@gmail.com", "creation_time": "2014-08-09T21:16:15Z", "text": "On second thought, repurposing this bug to remove those messages from mod_ratelimit. Most other filters simply do not bother logging an error received in ap_pass_brigade much less at ERRROR level."}, {"count": 3, "tags": [], "bug_id": 56832, "attachment_id": null, "is_private": false, "id": 177036, "time": "2014-08-10T06:27:43Z", "creator": "tomas@slax.org", "creation_time": "2014-08-10T06:27:43Z", "text": "I was able to track down that the error message in apache log appears if the client forcibly disconnects. So it is not that the message would cause disconnect, but contrary the disconnection of client causes the error message.\n\nI think this shouldn't be logged."}, {"count": 4, "tags": [], "bug_id": 56832, "attachment_id": 31926, "is_private": false, "id": 177235, "time": "2014-08-18T08:22:28Z", "creator": "tomas@slax.org", "creation_time": "2014-08-18T08:22:28Z", "text": "Created attachment 31926\nModify log level of errors so they are no longer reported in error_log\n\nI am proposing a patch for mod_ratelimit.\nIt modifies the error messages level to APLOG_TRACE1.\nI have no deep understanding of logging in Apache but I assume that once the errors are marked as trace1, it won't fill up apaches error_log file any more.\n\nIf I am wrong, feel free to modify it in any other way to silence the error messages, they are useless anyway! I don't really want to see in error_log all users who disconnected the connection and so on.\n\nPlease consider this patch for httpd 2.4.11 !\n\nThank you"}, {"count": 5, "tags": [], "bug_id": 56832, "attachment_id": null, "id": 177271, "time": "2014-08-19T15:45:13Z", "creator": "covener@gmail.com", "creation_time": "2014-08-19T15:45:13Z", "is_private": false, "text": "this was fixed in trunk last week and is proposed for 2.4.x backport\n\nhttp://svn.apache.org/r1617018\n\nI only modified the pass_brigade messages, because those will have already been reported."}, {"count": 6, "tags": [], "bug_id": 56832, "attachment_id": null, "id": 180523, "time": "2015-01-23T10:19:46Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-01-23T10:19:46Z", "is_private": false, "text": "Backported to 2.4.11 in r1622708."}]