[{"count": 0, "attachment_id": null, "bug_id": 56854, "text": "The XMLBeans recommendation is that when accessing long XML documents, or\nwhen performance matters, one should use XmlCursor and not getXXXList().\n\nIn order to provide a short-term solution, I propose we sweep the\ncode and replace all usages of getXXXList() with getXXXArray() -  which is\nmuch faster since it creates a snapshot of the xml data instead of a live\nview.\n\nThis will be trivial for read-only operations (e.g. bug #56556) and easy\nfor write operations – just read the array, work on it or create a new one,\nand set the result back to the proxy.\n\nAlso, some attempts to minimize this – using toArray() on the returned\nlist, can be reduced to getXXXArray(), since toArray() iterates over the\nelements, which is very inefficient in the XmlBeans impl.\n\nWe should decide how to document the new (and old) usages of getXXXArray(), which are deprecated (and probably will be as long as the XMLBeans project is dead) -\neither by ignoring it altogether, or by adding @SuppressWarnings(\"deprecation\") on all usages (thus always using a variable) optionally with a comment describing why the deprecated method is used (e.g. a link to this bug).\n\nIn addition, other methods (e.g. CTCol.getMax()) are sometimes called several times in the same scope when their result is not changing, which is another redundant piece of XMLBeans code being called.", "id": 177164, "time": "2014-08-14T14:06:00Z", "creator": "yaniv@kundas.net", "creation_time": "2014-08-14T14:06:00Z", "tags": [], "is_private": false}, {"count": 1, "text": "Created attachment 31921\n56854-1\n\nThis is a first sweep of proxy method usages, which includes mostly usage of array-based proxy methods instead of list-based when appropriate, and other repeat calls of methods inlined.\n\ntest-all runtime dropped from ~80 seconds to ~60 on my machine, mostly due to the changes in XSSF and ColumnHelper.", "bug_id": 56854, "is_private": false, "id": 177207, "time": "2014-08-17T14:27:04Z", "creator": "yaniv@kundas.net", "creation_time": "2014-08-17T14:27:04Z", "tags": [], "attachment_id": 31921}, {"count": 2, "tags": [], "bug_id": 56854, "text": "Thank you for the patch - applied with r1620997\n\nMost changes were trivial and the tests for ColumnHelper were successful, so should be ok. Added a few deprecation-ignores.\n\nfor the time being, I'll leave the bug entry open, waiting for the next diff.", "id": 177412, "time": "2014-08-28T00:12:47Z", "creator": "kiwiwings@apache.org", "creation_time": "2014-08-28T00:12:47Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 56854, "text": "Created attachment 32020\n56854-2\n\nAdditional optimizations, mainly in XSSFSheet", "id": 177854, "time": "2014-09-14T10:31:18Z", "creator": "yaniv@kundas.net", "creation_time": "2014-09-14T10:31:18Z", "is_private": false, "attachment_id": 32020}, {"count": 4, "attachment_id": null, "bug_id": 56854, "text": "Thank you for the second patch - applied with r1624922\nXSSFSheet.removeMergedRegion(int) looked too complicated, I haven't seen a reason, why not to use the default remove-element-by-index impl.", "id": 177865, "time": "2014-09-14T23:03:47Z", "creator": "kiwiwings@apache.org", "creation_time": "2014-09-14T23:03:47Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 56854, "text": "You're right - sometimes it takes development to visit the \"complicated\" station when travelling from \"a mess\" to \"elegant\" :-)\n\nNote: the patch for XSSFSheet.removeMergedRegion/s is what I originally done in https://issues.apache.org/bugzilla/attachment.cgi?id=31960&action=diff\nfor issue 55280 (https://issues.apache.org/bugzilla/show_bug.cgi?id=55280)\n\n(In reply to Andreas Beeker from comment #4)\n> Thank you for the second patch - applied with r1624922\n> XSSFSheet.removeMergedRegion(int) looked too complicated, I haven't seen a\n> reason, why not to use the default remove-element-by-index impl.", "id": 177886, "time": "2014-09-15T14:45:40Z", "creator": "yaniv@kundas.net", "creation_time": "2014-09-15T14:45:40Z", "is_private": false, "attachment_id": null}, {"count": 6, "text": "Thanks for linking the other bug - I've already had a quick look yesterday where these XSSFSheet.removeMergedRegion(s) methods came from ... :)\n\nI haven't setup a profile environment for the test cases, yet (... the builds are now faster, when looking at builds.apache.org, but this only a very rough estimation ...)\n\nYaniv, in case you already have it in place (and also have some old stats to compare to), it would be good, if you also validate/profile the derivation from your patch - sometimes it's hard to decide if something is just refurbished old code or if it's like this on purpose.", "bug_id": 56854, "is_private": false, "id": 177887, "time": "2014-09-15T15:48:41Z", "creator": "kiwiwings@apache.org", "creation_time": "2014-09-15T15:48:41Z", "tags": [], "attachment_id": null}, {"count": 7, "attachment_id": null, "bug_id": 56854, "text": "It seems the things discussed here are mostly done and applied since some time already, I think it best to open new bugs for any additional optimizations that are proposed.", "id": 185204, "time": "2015-09-13T20:18:11Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-09-13T20:18:11Z", "tags": [], "is_private": false}]