[{"count": 0, "tags": [], "text": "In XWPFSDTContent object I can read the text, but I can not change it.\nIn debug mode, I saw that a XWPFParagraph list in the content object is present and over this object I could change the text then.\nPlease provide a way to change the text.", "attachment_id": null, "bug_id": 56885, "id": 177347, "time": "2014-08-25T08:15:19Z", "creator": "rico.stodko@wilken.de", "creation_time": "2014-08-25T08:15:19Z", "is_private": false}, {"count": 1, "tags": [], "text": "As the javadoc states these classes are currently read-only, likely until someone steps in and provides patches with accompanying unit-tests that verify the changes.", "attachment_id": null, "bug_id": 56885, "id": 190103, "time": "2016-04-10T10:32:35Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-04-10T10:32:35Z", "is_private": false}, {"count": 2, "tags": [], "text": "We found this feature highly important. Can you give it a priority? At least give raw access to the inner objects so we can change them...\n\nDominik, can you give a guidance how to do the patch to support that?", "attachment_id": null, "bug_id": 56885, "id": 195003, "time": "2016-11-15T11:55:23Z", "creator": "nadavbenedek@gmail.com", "creation_time": "2016-11-15T11:55:23Z", "is_private": false}, {"count": 3, "tags": [], "text": "Check out the trunk from the repository\n\nInformation about the repository is here: https://poi.apache.org/subversion.html\n\nBuild the project. Information Here: https://poi.apache.org/howtobuild.html\n\nMake sure you can successfully run all the tests, the ant jenkins task is good for determining that everything is configured properly. You can tell if tests are currently passing for us by looking here: https://builds.apache.org/job/POI/\n\nIf you are getting deifferent results, then you need to fix your environment before you do anything else. Not the ant tasks should download all dependencies.\n\nThen you are ready to develop your patch. Once you have a patch complete and all jenkins tasks run successfully, see the contribution guidelines here: https://poi.apache.org/guidelines.html\n\nPlease realize that XWPF is not a stable interface. I am just starting a plan to clean it up, and move it forward into a consistent interface. Initial ideas can be found here: https://github.com/JMarkMurphy/poi/wiki, they are totally incomplete and a work in progress. The point is the entire XWPF interface is a jumble of individually designed pieces and parts thrown together into a big pile. Things will be changing though. Try to keep as much CT code in org.apache.poi.xwpf.model as you can, and only put user interface stuff in org.apache.poi.xwpf.usermodel. This will be a challenge as currently usermodel is not much more than a surrogate for the CT classes, and model contains very little that is useful (or even used?).", "is_private": false, "bug_id": 56885, "id": 195004, "time": "2016-11-15T13:38:19Z", "creator": "jmarkmurphy@apache.org", "creation_time": "2016-11-15T13:38:19Z", "attachment_id": null}]