[{"count": 0, "tags": [], "bug_id": 56935, "attachment_id": null, "id": 177671, "time": "2014-09-09T14:19:35Z", "creator": "frederic.roudaut@orange.com", "creation_time": "2014-09-09T14:19:35Z", "is_private": false, "text": "I use a special client (a proxy may have such behavior also) that handles HTTP/1.1 persistent connection. I use the default configuration on Apache 2.4.4\n\nIt does not use the dedicated header \"connection : keep-alive\". As a consequence, by default the persistent connection is used. My client also keeps the TCP connection alive by using TCP keep-alive. I notice that the server never closes the TCP connection after 5s of HTTP inactivity (KeepAliveTimeout). I have to wait the 300s timeout (key TIMEOUT). \n\nAccording to the Apache documentations it seems that this connection should have close after no KeepAliveTimeout of HTTP Activity. I believe that the server considers the TCP Keepalive packet as HTTP message and then waits TIMEOUT instead. Thus it gives an easy scheme to consume Apache resources.  \n\nFor information my TCP keepalive are quite basic : only One byte of data set to 0."}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "text": "Can you share a binary packet capture to illustrate?  Not clear you're actually in keepalive.", "id": 177672, "time": "2014-09-09T14:30:34Z", "bug_id": 56935, "creation_time": "2014-09-09T14:30:34Z", "is_private": false}, {"count": 2, "tags": [], "creator": "frederic.roudaut@orange.com", "attachment_id": 31982, "text": "Created attachment 31982\ndump showing the pb ? The only dump I currently have ...\n\n\n\nMy timeout is 115s \nApache keepalivetimeout is set to 5s. timeout is 300s\nClient IP is 172.18.1.20\nServer IP is 172.18.15.15.\n\nWe can have a look to exchange on port 54464 for example.\nWe can see the TCP handshake, some TCP keealive after ... no HTTP request is done and finaly my client closes the TCP connexion after 115s. Timeout (300s) will apply here and not keepalivetimeout (effectively) because no request has been done. Indeed my previous comment was false. I am not sure now I have met similar problem after one HTTP request.\n\nNevertheless, it seems then possible to consume quite easily resources on Apache just by opening handshake and maintening a TCP keepalive for 300s. But perhaps you consider the problem is similar if you do request and request for 300s. If this is the case, please, reject this issue .", "id": 177684, "time": "2014-09-09T16:25:49Z", "bug_id": 56935, "creation_time": "2014-09-09T16:25:49Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 56935, "attachment_id": null, "id": 177685, "time": "2014-09-09T16:29:22Z", "creator": "covener@gmail.com", "creation_time": "2014-09-09T16:29:22Z", "is_private": false, "text": "\"We can see the TCP handshake, some TCP keealive after ... no HTTP request is done and finaly my client closes the TCP connexion after 115s.\"\n\nSince you're not in keepalive, you have to use Timeout or mod_reqtimeout to control this."}]