[{"count": 0, "tags": [], "text": "Created attachment 31995\nReset the flag nextIsString since it has been successfully used\n\nHello. My name is Arturo. I’ve been using Apache POI for a number of years. I’m now learning the Event API for reading XLSX files.\n\nI think I found a small bug on the example:\n\nhttp://svn.apache.org/repos/asf/poi/trunk/src/examples/src/org/apache/poi/xssf/eventusermodel/examples/FromHowTo.java\n\nThe example throws an Exception when reading a small xlsx file with the following contents:\n\n+-----+-----+\n|  A  |  1  |\n+-----+-----+\n|  B  |  2  |\n+-----+-----+\n\nI’ve fixed with just adding a line.\n\nSorry if the patch attachment isn't in the right format. This is my first time. I promise to learn.", "is_private": false, "bug_id": 56954, "id": 177723, "time": "2014-09-11T06:37:28Z", "creator": "arturo.nospam+poi@gmail.com", "creation_time": "2014-09-11T06:37:28Z", "attachment_id": 31995}, {"count": 1, "tags": [], "bug_id": 56954, "text": "Looks like the example on the site was updated for this case (fix slightly different), but the example in the source tree wasn't. I've brought over the fix from the site in r1624237 - can you check if that fixes it for you?\n\nIt does remind me that we should probably look at doing what a few other Apache projects have done, and have the examples only in svn as code, then pull them into the website when it gets built. That would also let us add unit tests for the examples, which'd catch things like this! Something to consider for the future...", "id": 177733, "time": "2014-09-11T09:37:17Z", "creator": "apache@gagravarr.org", "creation_time": "2014-09-11T09:37:17Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 56954, "text": "(In reply to Nick Burch from comment #1)\n> Looks like the example on the site was updated for this case (fix slightly\n> different), but the example in the source tree wasn't. I've brought over the\n> fix from the site in r1624237 - can you check if that fixes it for you?\n\nYes, it totally fixed it. Thank you!\n\n> It does remind me that we should probably look at doing what a few other\n> Apache projects have done, and have the examples only in svn as code, then\n> pull them into the website when it gets built.\n\nSounds good for people like me which don't know where is everything. :)\n\n> That would also let us add unit tests for the examples, which'd catch\n> things like this! Something to consider for the future...\n\nThis bug can be closed. Can I do it, or you do it?", "id": 177849, "time": "2014-09-14T00:13:24Z", "creator": "arturo.nospam+poi@gmail.com", "creation_time": "2014-09-14T00:13:24Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "dominik.stadler@gmx.at", "text": "Resolved as far as I see.", "id": 178377, "time": "2014-10-10T11:29:18Z", "bug_id": 56954, "creation_time": "2014-10-10T11:29:18Z", "tags": [], "is_private": false}]