[{"count": 0, "tags": [], "creator": "juanma.cvega@gmail.com", "text": "The point-to-point sampler in JMeter for request-reply messages doesn't allow to provide parameterized values. All configuration values must be hard coded into the sampler, so any attempt to create dynamic values for the jms broker host for example don't work.", "id": 178087, "time": "2014-09-24T17:26:28Z", "bug_id": 57015, "creation_time": "2014-09-24T17:26:28Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "text": "Hello,\nCan you provide a sample Test plan , describe the expected behaviour vs what you get ?\n\nIf possible make Test plan for ActiveMQ.\nThanks", "id": 178244, "time": "2014-10-02T20:06:11Z", "bug_id": 57015, "creation_time": "2014-10-02T20:06:11Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "juanma.cvega@gmail.com", "text": "Created attachment 32074\nTest plan example\n\nThe test plan provides two user defined variables that are used to specify the broker host and port. Then, inside a thread group, the test tries to change the value of the JMS_BROKER_HOST variable in a bean sampler, providing another string, before running the jms point-to-point sampler. When running the test, it's easy to see in the View Results Tree how an exception is thrown saying the sampler cannot reach the broker in the specified host, that is the one defined in the user defined variables, not in the bean sampler. It can also be checked in the Debug sampler provided that the new value is stored in the user variable.", "id": 178257, "time": "2014-10-03T09:35:03Z", "bug_id": 57015, "creation_time": "2014-10-03T09:35:03Z", "is_private": false, "attachment_id": 32074}, {"attachment_id": null, "tags": [], "bug_id": 57015, "text": "The provider URL is resolved at configuration time, i.e. before the thread runs the BeanShell Pre-processor.\n\nIt is possible to change variables using a Config test element such as the User Defined Variables element.", "count": 3, "id": 178258, "time": "2014-10-03T09:55:35Z", "creator": "sebb@apache.org", "creation_time": "2014-10-03T09:55:35Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "juanma.cvega@gmail.com", "text": "Yes, that way it works. But other elements that provide dynamic ways of changing the value don't work. I've tried using Random Variable element, CSV Data Set Config or Bean Shell sampler and those don't work. \nThe reason for this requirement is to be able to test clustered configurations. Without it, I'm forced to duplicate the test plan, providing a value for each of them.", "count": 4, "id": 178259, "time": "2014-10-03T10:19:02Z", "bug_id": 57015, "creation_time": "2014-10-03T10:19:02Z", "is_private": false}]