[{"count": 0, "tags": [], "creator": "mitko.mitev007@gmail.com", "attachment_id": null, "id": 178254, "time": "2014-10-03T08:32:15Z", "bug_id": 57053, "creation_time": "2014-10-03T08:32:15Z", "is_private": false, "text": "Hi,\n\nI have found the following bug in Tomcat 8.0.14.\n\nI am using Netbeans IDE to develop web applications for Tomcat server. I have been using this configuration for many years without any problem. With Tomcat 8.0.14 the situation has changed. It is not possible to start a Tomcat server from Netbeans IDE. The start commands ends with the following error:\n\n'127.0.0.1' is not recognized as an internal or external command,\noperable program or batch file.\n\nI have alreday found a root cause for it:\n\nIn Tomcat 8.0.14 was introduced the fix : https://issues.apache.org/bugzilla/show_bug.cgi?id=56895 coming from Tomcat 7.\n\nIf I remove the qoutation marks introduced in catalina.bat. The startup works fine.\nThe detail investigation show a problem with the following command line parameter:\n\n-Dhttp.nonProxyHosts=\"localhost|127.0.0.1|10.80.*|10.0.0.*\"\n\nIf I remove this parameter the startup works fine with quotation mark in catalina.bat."}, {"count": 1, "tags": [], "text": "Building up a command line from environment variables that contain characters with special meanings (space, pipe, equals, double quote etc.) can be extremely tricky. There are various problems and there are several workarounds. Some of these workarounds only apply to 'simple' cases and issues will still be observed with more complex cases.\n\nWhat you are seeing is a result of the change in Tomcat to better handle the more complex cases. Unfortunately this means the simple workaround (quoting the value) you were using for including the pipe character no longer works and you need to use a more complex solution where you quote the whole assignment and escape the pipe character. Something like this:\n\nSET \"CATALINA_OPTS=-Dhttp.nonProxyHosts=localhost^|127.0.0.1|^10.80.*^|10.0.0.*\"\n\nThis solution should work with or without the change in 8.0.14.", "attachment_id": null, "id": 178256, "creator": "markt@apache.org", "time": "2014-10-03T09:06:58Z", "bug_id": 57053, "creation_time": "2014-10-03T09:06:58Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 57053, "attachment_id": null, "text": "*** Bug 57918 has been marked as a duplicate of this bug. ***", "id": 182945, "time": "2015-05-11T19:38:29Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-05-11T19:38:29Z", "is_private": false}]