[{"count": 0, "tags": [], "bug_id": 57073, "text": "When running Apache 2.4.9 for Windows in a high latency environment (e.g. 100 - 200ms of latency) and using Internet Explorer 9/10/11, the web server will occasionally refuse to accept connections for a period of time, making it seem that the web server is down.\n\nI have been running the same Apache 2.4.9 server in a low latency environment (e.g. <1ms latency) and am not able to replicate the behavior.\n\nThe current work around to this issue is to use the following configuration:\n\nAcceptFilter http none\n\nThis has been reported by other sources online such as:\n\nhttp://stijndewitt.wordpress.com/2014/01/10/apache-hangs-ie11/\nhttp://stackoverflow.com/questions/9471202/website-sometimes-gets-jammedtimeout", "id": 178365, "time": "2014-10-09T12:30:05Z", "creator": "pakulas@pixia.com", "creation_time": "2014-10-09T12:30:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "m.amazirh@gmail.com", "attachment_id": null, "is_private": false, "id": 178743, "time": "2014-10-25T11:50:06Z", "bug_id": 57073, "creation_time": "2014-10-25T11:50:06Z", "text": "Hi,\nWe had the same problem at work and we used the \"AcceptFilter http none\" workaround to solve it.\n\nThe problem can be reproduced easily by opening a connection to an Apache (for example by using telnet). As long as the connection is open without any data sent, the server hangs and everybody can't connect to it.\n\nSteps I used to reproduce this outside work :\n1) Create a Windows 2008 virtual machine (in my case 64bit Win2008 Standard on VirtualBox)\n\n2) Download httpd binaries from here : https://www.apachelounge.com/download/win32/binaries/httpd-2.4.10-win32-ssl_0.9.8.zip\n\n3) (Without changing the default configuration) Start httpd on the VM\n\n4) From the vm or another machine connected to same network, connect to the httpd server with telnet (from windows : telnet httpd_address port_number), but dont send any data (dont type anything on the telnet terminal)\n\n5) Type in the address of the server in a web browser. You'll see that the browser is trying to load the page but it remains stuck for a long time (as long as no data is sent from the open telnet connection)\n\n6) wait for more than 20 seconds to be sure (you can also try loading the website from different tabs or windows)\n\n7) Go back to the open telnet connection and type something (+ ENTER) to send data to the server (or kill the telnet process to close the connection)\n8) Go back to the browser and you'll see that the page that was stuck loading, now is loaded (the moment you did step 7)\n\nNow add \"AcceptFilter http none\" to httpd's configuration file then restart :  the server behaves normally.\n\nI hope this information will help someone resolve this bug."}]