[{"count": 0, "tags": [], "bug_id": 57097, "text": "I would like a \"name\" attribute (or similar) added to the standard connectors. This name should preferably be part of the JMX ObjectName for the connector MBeans, or at least be retrievable from the MBeans.\n\nJustification:\nI'm working on an application which bundles Tomcat and makes use of several connectors (typically binding to different network interfaces). In my application I need to determine which port is set for which connector. I can easily list the connector MBeans and retrieve the information from those but I have no way of telling which connector is which.\n\nThe connectors may use the same protocol (it depends on the customer if they want to use HTTP or HTTPS) and I have no control over their ports (they're set by the customers installing the application). A simple name attribute that is reachable from JMX would solve my problem.", "id": 178478, "time": "2014-10-15T11:39:48Z", "creator": "jens.borgland@gmail.com", "creation_time": "2014-10-15T11:39:48Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 57097, "is_private": false, "id": 178479, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2014-10-15T12:45:45Z", "time": "2014-10-15T12:45:45Z", "text": "Connectors are uniquely identified by the combination of address and port. This information is already included in the JMX name. An additional name property would be redundant."}, {"count": 2, "tags": [], "text": "Well, yes that uniquely identifies the connector but since both those attributes may be set at will by the administrator when deploying the application they cannot be used to identify which connector is which (for my purposes) - I have no way of knowing which address or port that is supposed to be the \"backend\" or \"frontend\".", "is_private": false, "bug_id": 57097, "id": 178481, "time": "2014-10-15T13:11:29Z", "creator": "jens.borgland@gmail.com", "creation_time": "2014-10-15T13:11:29Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 57097, "is_private": false, "text": "I think there is a legitimate use case here.\n\nThe \"name\" shouldn't override the existing JMX name... just add another property that can be used to locate the connector, even if you have to grab the whole set of connectors and loop through them looking for it.", "id": 178541, "time": "2014-10-17T13:36:11Z", "creator": "chris@christopherschultz.net", "creation_time": "2014-10-17T13:36:11Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "(In reply to Christopher Schultz from comment #3)\n> I think there is a legitimate use case here.\n\nI disagree. The connectors already have a unique name and I have no desire to add unecessary code to provide another attribute that does exactly the same thing.\n\n> The \"name\" shouldn't override the existing JMX name... just add another\n> property that can be used to locate the connector, even if you have to grab\n> the whole set of connectors and loop through them looking for it.\n\nThe only difference between the approaches whether Tomcat provides the option for a unique name to be added to a connector as defined by some external (to Tomcat) system or if Tomcat requires the external system to use Tomcat's unique name.\n\nI'm fine with the latter approach. The connectors need less code,not more.", "attachment_id": null, "id": 178547, "creator": "markt@apache.org", "time": "2014-10-17T14:38:15Z", "bug_id": 57097, "creation_time": "2014-10-17T14:38:15Z", "is_private": false}]