[{"count": 0, "tags": [], "bug_id": 57094, "is_private": false, "text": "The number of rotatelogs instances that can be started seems significantly\nrestricted when a Windows Apache web server is started as a service as\ncompared to being started from the command-line.\n\nIn practical use, the idea was to have many VirtualHosts which each used\nrotatelogs for both the error and access logs.  However, after a certain\npoint, the error log started having many occurances of the following error\nmessage:\n AH00106: piped log program ''D:/Apache24_2410_64bit/bin/rotatelogs.exe' -l \n 'D:/Apache24_2410_64bit/Logs/http..304_%Y-%m-%d_%Hh%M.log' 360' failed \n unexpectedly\nUsing the Process Explorer tool from SysInternals to monitor the running\nprocesses, we could see that rotatelogs instances were constantly dying and \nrestarting.\n\nSo, we did some testing to try to determine the limits.  The testing was\nperformed on a Windows 2008 R2 Enterprise SP1 (64-bit) system with 8GB memory. \nFor testing purposes only, this was tested using multiple CustomLog statements \nwithin a single VirtualHost.  For example:\n\nListen 0.0.0.0:443\n<VirtualHost *:443>\nCustomLog \"|'D:/Apache24_2410_64bit/bin/rotatelogs.exe' -l 'D:/\n Apache24_2410_64bit/Logs/http..101_%Y-%m-%d_%Hh%M.log' 360\" common\nCustomLog \"|'D:/Apache24_2410_64bit/bin/rotatelogs.exe' -l 'D:/\n Apache24_2410_64bit/Logs/http..102_%Y-%m-%d_%Hh%M.log' 360\" common\nCustomLog \"|'D:/Apache24_2410_64bit/bin/rotatelogs.exe' -l 'D:/\n Apache24_2410_64bit/Logs/http..103_%Y-%m-%d_%Hh%M.log' 360\" common\n.\n.\n</VirtualHost>\n\nEach instance used a unique log name and the number of CustomLog statements\nwas increased/decreased while various config and environmental changes were\nmade to determine their effect.\n\nWhen the Apache web server was started as a service using the default \nconfiguration with the only modification being the VirtualHost and CustomLog\nstatements as shown above, then the number of rotatelogs instances that could\nbe started without error was about 54.\n\nWe tried both the 32bit and 64bit versions of Apache 2.4.10 on the 64bit OS\nbut that seemed to make no difference.\nLoading additional modules, such as all the mod_proxy* modules only decreased \nthe allowed instances by one, so had very little effect.\nWe tried changing the service 'Log on as' value from 'Local System account'\nto a specific user account (in the Administrators group), but that only\nallowed about 3 more instances, so it also had little effect.\nWe also tried testing on a 2.2.8 level web server and it behaved the same.\n\nThe one thing we found that made a big difference  was starting the Apache web\nserver from the command-line.  When started from the command-line \n(ex: D:\\Apache24_2410_64bit>bin\\httpd ) as opposed to starting as a service\nthen a very large number of rotatelogs instances can be successfully started \nand used.  This was tested up to 175 instances without error.  We did not \nproceed beyond this number so it is unknown what the limit would be in this\ncase.\n\nHowever, the desire is to start and run the Windows Apache server as a \nWindows service, and in this case, there is a significant restriction as\ncompared to starting from a command-line.", "id": 178461, "time": "2014-10-14T20:39:18Z", "creator": "kilroy155@gmail.com", "creation_time": "2014-10-14T20:39:18Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "Chaosed0@gmail.com", "attachment_id": 32435, "id": 180798, "time": "2015-02-05T14:44:29Z", "bug_id": 57094, "creation_time": "2015-02-05T14:44:29Z", "is_private": false, "text": "Created attachment 32435\nAdd note about large numbers of rotatelogs on windows\n\n\nI think we've tracked down the root cause for this; the limit appears to be caused by exhaustion of the desktop heap. Here's some info on it (that I still barely understand): http://blogs.msdn.com/b/ntdebugging/archive/2007/01/04/desktop-heap-overview.aspx\n\nI wrote up a short doc patch putting a note in the logs.xml about Windows and rotatelogs. I also removed a reference to cronolog.org, which appears to be dead."}, {"count": 2, "tags": [], "text": "Thanks -- added with formatting tweaks in 1657854", "is_private": false, "bug_id": 57094, "id": 180830, "time": "2015-02-06T15:09:03Z", "creator": "covener@gmail.com", "creation_time": "2015-02-06T15:09:03Z", "attachment_id": null}]