[{"count": 0, "tags": [], "bug_id": 5711, "attachment_id": null, "id": 9386, "time": "2002-01-06T19:37:17Z", "creator": "rasand@attglobal.net", "creation_time": "2002-01-06T19:37:17Z", "is_private": false, "text": "Hi- I have a .properties file that I use for my application configuration that I\nkeep in WEB-INF/classes.  I use getClass().getResourceAsStream\n(\"/myfile.properties\") from within a bean to load the properties into a static \nhashtable, and I have a control servlet that can tell the bean to reload the \nfile.  This just allows me to edit the properties without having to start and \nstop the application (which was a more painful process pre-Catalina).\n\nNow that I've switched from 3.2.3 to 4.0.1, what I'm seeing is that my\nchanges to the properties file are not being picked up when I reset my bean.\nI've traced through everything, and determined that my subsequent calls to\ngetResourceAsStream are still opening the original file, even though I've\nmodified and saved it.  Its as if the classloader is treating the resource\nas a class, and it is loading it once and keeping it around, so I need to\nreload the application to reload the resource.\n\nThis was not the behavior under 3.x, so my question is, is this proper\nbehavior in 4.x or a bug? If it is proper behavior, is there a workaround?\n\nThanks!\n\n-Richard"}, {"count": 1, "tags": [], "bug_id": 5711, "attachment_id": null, "id": 9394, "time": "2002-01-07T03:10:15Z", "creator": "remm@apache.org", "creation_time": "2002-01-07T03:10:15Z", "is_private": false, "text": "I'd like to handle the resources the same way classes are handled, so that every\nobject handled by the CL has the same lifecycle. To reload them, I would use\ncontext reloading."}, {"count": 2, "tags": [], "text": "This behavior doesn't leave a way for the application itself to reload these \nfiles in a standard way.  Of the five application servers that my code has to \nrun on, Tomcat is the only one that now exhibits this behavior.  I understand \nwanting to treat resources in a generic fashion, but is it really that \nimportant to take this functionality away?\n\n-Richard", "is_private": false, "id": 9399, "creator": "rasand@attglobal.net", "time": "2002-01-07T04:20:00Z", "bug_id": 5711, "creation_time": "2002-01-07T04:20:00Z", "attachment_id": null}]