[{"count": 0, "tags": [], "creator": "splinterpolo@gmail.com", "attachment_id": null, "id": 178615, "time": "2014-10-20T09:01:41Z", "bug_id": 57119, "creation_time": "2014-10-20T09:01:41Z", "is_private": false, "text": "Hello everybody,\n\nI am using Apache as a reverse proxy to access an application on a server. The application is replicate on two servers. There is a dns-resolver which supplies the ip address of only one of the server depending on which one is running at the moment of DNS name resolving. So when one server is shutting down, the reverse proxy must automatically switch to the second server.\nWhen I shut down one server, Apache doesn't switch to the second server.\nBut when I restart Apache, it  switches to the second server and it works perfectly.\nI think the reverse proxy doesn't update its IP addresses cache.\n\nHas anyone of you ever had a similiar problem of chached DNS-resolved IP\naddresses? Have you found any satisfactory solution? Any additional clues\nfor me? Any help would be greatly welcome.\n\nRegards \nBroisy"}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "text": "This reads like an email/question rather than a bug report. \n\nInstead of closing it, I've changed it to an enhancement to either lookup DNS for each new backend connection or to periodically do the same.", "id": 178618, "time": "2014-10-20T12:52:50Z", "bug_id": 57119, "creation_time": "2014-10-20T12:52:50Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 57119, "attachment_id": null, "id": 178620, "time": "2014-10-20T13:39:24Z", "creator": "rpluem@apache.org", "creation_time": "2014-10-20T13:39:24Z", "is_private": false, "text": "It does cache it for performance reasons. Have you thought about using mod_proxy_balancer instead of changing the DNS entry? Otherwise you can use the disablereuse option (http://httpd.apache.org/docs/2.4/mod/mod_proxy.html#proxypass) with ProxyPass."}, {"count": 3, "tags": [], "creator": "splinterpolo@gmail.com", "attachment_id": null, "text": "Because of my network architecture, I am obliged to use a DNS Server, so I can't use mod_proxy_balancer.\nI will try to use the disablereuse option.\nI have seen another solution that consist in changing TTL and SMAX values.\nThanks for your answers", "id": 178693, "time": "2014-10-23T07:38:19Z", "bug_id": 57119, "creation_time": "2014-10-23T07:38:19Z", "is_private": false}]