[{"text": "The windows build has atrophied over the years. The web is full of errors building on windows with a modern version of visual studio. The version of Visual Studio build that the httpd source ships with (VS 6) is quite antiquated, and my visual studio 2013 express does not even know how to upgrade it anymore. I saw some people had first installed 2008 to upgrade the config there, then opened 2012/2013 to upgrade it further to the compiler they'd like to use. This is a rather poor build process for those of us who want to ship/run on windows. \n\nI would like to propose that the httpd build should be updated to use something like cmake, or else to use a modern version of visual studio.\n\nAre there any plans to do this?", "tags": [], "bug_id": 57174, "is_private": false, "count": 0, "id": 178873, "time": "2014-10-31T18:38:07Z", "creator": "matthauck@gmail.com", "creation_time": "2014-10-31T18:38:07Z", "attachment_id": null}, {"text": "httpd 2.4, apr 1.5, and apr-util 1.5 all support cmake builds with various levels of Visual Studio.\n\nNote that there's no cmake build for apr-iconv, and the cmake build of apr-util doesn't yet support all features (interfaces to third-party libraries).  Because of that, you might have an issue.\n\n--/--\n\nThe non-cmake folks can decide if a better Visual Studio-only solution needs to be provided.", "tags": [], "bug_id": 57174, "is_private": false, "count": 1, "id": 178874, "time": "2014-10-31T19:57:40Z", "creator": "trawick@apache.org", "creation_time": "2014-10-31T19:57:40Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 57174, "attachment_id": null, "id": 178879, "time": "2014-11-01T05:40:49Z", "creator": "matthauck@gmail.com", "creation_time": "2014-11-01T05:40:49Z", "is_private": false, "text": "ah. didn't even think to check if there was already a cmake build for httpd/apr/apr-util. I assumed there wasn't since the online documentation didn't include mention of this in its guide on how to compile on windows.\n\nThe cmake build works great! Despite the gaps you point out, it actually builds everything I need to, so I am good to go!\n\nI would recommend, however, that you scrap the VS 6 project files and update the docs to use cmake as the standard way of building on windows so as to not be tied to the sln file format, and since you appear to already be moving in that direction.\n\nthanks."}, {"count": 3, "tags": [], "creator": "trawick@apache.org", "attachment_id": null, "text": "Thanks for the feedback on the cmake build.  I've updated the APR and httpd documentation to mention the cmake build and its primary limitations, pointing to the README.cmake files for detailed instructions.\n.\nThis bug will continue to track concerns with the non-cmake build.", "id": 178992, "time": "2014-11-06T14:27:21Z", "bug_id": 57174, "creation_time": "2014-11-06T14:27:21Z", "is_private": false}]