[{"count": 0, "attachment_id": null, "bug_id": 57199, "is_private": false, "id": 179045, "time": "2014-11-11T11:51:47Z", "creator": "awilkinson@pivotal.io", "creation_time": "2014-11-11T11:51:47Z", "tags": [], "text": "The fix for 43682 updated WebappClassLoaderBase to implement WebappProperties. WebappProperties is provided by tomcat-embed-logging-juli but tomcat-embed-core's dependency on tomcat-embed-logging-juli is optional. This lead to compilation failures when upgrading to Tomcat 8.0.15 (from 8.0.14) in a project that subclasses WebappClassLoader. I believe it'll also lead to failures at runtime for projects that aren't affected at compile time.\n\nI've marked the version as \"trunk\" as 8.0.15 wasn't an available choice."}, {"count": 1, "attachment_id": null, "bug_id": 57199, "is_private": false, "id": 179077, "time": "2014-11-13T10:13:14Z", "creator": "markt@apache.org", "creation_time": "2014-11-13T10:13:14Z", "tags": [], "text": "tomcat-embed-core requires exactly one of either tomcat-embed-logging-juli or tomcat-embed-logging-log4j. This was true before the change to add WebappProperties.\n\nThe change to add WebappProperties has triggered failures at compile time if no logging dependency is present but there always would have been failures at runtime (unless a very strange sub-set of functionality was used).\n\nGiven that we can't express the dependency we want to express in the pom, the aim has been to identify the least worst work-around. Given that we need Jasper and WebSocket to depend on core and to remain optional, I don't see a better solution right now.\n\nPossibilities I've considered:\n\n1. Create core+juli and core+log4j\nJust moves the problem to which should Jasper/WebSocket depend on?\nCreates a new issue for folks that want to use their own JULI impl hard-coded to their favourite logging framework.\n\n2. Create X+noJuli, X+Juli, X+log4j for each of core, jasper, websocket with appropriate dependencies between them.\nFixes the issue but doubles the number of packages and raises a number of questions about how to package them for download. My feeling is that this would create more problems than it solves.\n\nAbsent a better idea I'm leaning towards resolving this as WONTFIX."}, {"count": 2, "tags": [], "creator": "awilkinson@pivotal.io", "is_private": false, "text": "Thanks, Mark. In our case in the project with the compile problem when using 8.0.15 we had a test dependency on tomcat-embed-logging-juli so we weren't seeing a problem with 8.0.14. Furthermore, in another project that consumes embedded Tomcat for use at runtime we were also pulling in tomcat-embed-logging-juli.\n\nGiven your either/or requirement, I can't think of a better solution than what you're currently doing.", "id": 179079, "time": "2014-11-13T10:50:10Z", "bug_id": 57199, "creation_time": "2014-11-13T10:50:10Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "OK. I was hoping you might have had a better solution in mind.", "id": 179120, "time": "2014-11-15T15:49:39Z", "bug_id": 57199, "creation_time": "2014-11-15T15:49:39Z", "is_private": false, "attachment_id": null}]