[{"count": 0, "tags": [], "creator": "stephen.mccants@hcs.us.com", "attachment_id": null, "id": 179000, "time": "2014-11-07T18:51:28Z", "bug_id": 57192, "creation_time": "2014-11-07T18:51:28Z", "is_private": false, "text": "Moving a Web Application on Windows 7 to Windows 2008 caused the EL expressions to stop being evaluated.  \n\nProblem is seen on Windows Server 2008 Tomcat 7.0.56, but it works correctly on Tomcat 7.0.37 (Windows 7) and 7.0.42 (Linux).  Our web.xml file specifies:\n\n<web-app\n    xmlns=\"http://java.sun.com/xml/ns/javaee\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n    xsi:schemaLocation=\"http://java.sun.com/xml/ns/javaee http://java.sun.com/xml/ns/javaee/web-app_2_5.xsd\"\n    version=\"2.5\"> \n\nSo, I believe the correct behavior with 2.5 is that EL expressions should be evaluated.\n\nThe problem was worked around by adding the following to the JSP files:\n\n<%@ page isELIgnored=\"false\" %>\n\nI can provide bits of code upon request, but not the application as a whole.  Other people apparently have run into this problem:\n\nSee answer and comments on http://stackoverflow.com/questions/793983/jsp-el-expression-is-not-evaluated ."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 179001, "time": "2014-11-07T19:26:03Z", "bug_id": 57192, "creation_time": "2014-11-07T19:26:03Z", "is_private": false, "text": "EL expressions are evaluated with 2.5 web applications by default. We have a unit test for this. It appears that you, like the people reporting issues in that SO question, have a configuration problem. The users list is the place to seek help."}, {"count": 2, "tags": [], "bug_id": 57192, "attachment_id": null, "text": "I would be inclined to agree with you about the configuration problem, except the only thing that changed is the version of Tomcat and the OS Level.  Never-the-less, given the large amount of unhelpful confusion I found on the Internet about this \"configuration problem\", I'll post to the users list as requested.  If it is a configuration problem (that comes into play only with the latest Tomcats), the answer would at least be helpful to others.  If it isn't, then I'll reopen this ticket.", "id": 179002, "time": "2014-11-07T19:37:06Z", "creator": "stephen.mccants@hcs.us.com", "creation_time": "2014-11-07T19:37:06Z", "is_private": false}]