[{"count": 0, "tags": [], "creator": "ankitrungta001@gmail.com", "attachment_id": 32205, "text": "Created attachment 32205\nunzip the attachment to  get 3 files\n\nI have attached 3 files:\n1) Program which is used to compress width of a column if it exceeds given limit.\n2) Input excel file.\n3) Output excel file.\n\nWhen i shrunk the column width manually from excel then image is not shrunk, but when i do the same using POI image is getting shrunk.\nIf you observe the output excel properly, an image in output excel has got shrunk to size zero because of which it got totally disappeared.", "id": 179101, "time": "2014-11-14T09:50:12Z", "bug_id": 57214, "creation_time": "2014-11-14T09:50:12Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57214, "is_private": false, "text": "Up till now, images are anchored with a TwoCellAnchor, i.e. the starting col/row (incl. delta x/y coords within the cell) and same for the ending col/row.\nI think (it's already sometime ago, that I've tried it ...) if you manually introduce a OneCellAnchor, it will be independent from the ending row.\n\nMaybe we should introduce some helper method to convert twocell to onecell anchor ...?", "id": 179102, "time": "2014-11-14T14:22:38Z", "creator": "kiwiwings@apache.org", "creation_time": "2014-11-14T14:22:38Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 57214, "text": "Seems right for my case.\nHow long you think it would take to get a fixed version from your side?\n\nCan you tell me if there is a workaround for this problem that i can implement?\nMy simple requirement is that i need to decrease the width of a column,keeping everything else intact.", "id": 179150, "time": "2014-11-17T06:06:35Z", "creator": "ankitrungta001@gmail.com", "creation_time": "2014-11-17T06:06:35Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "ankitrungta001@gmail.com", "text": "It might not be a priority but the only concern i have here is what is the max timeline it would take for this issue to be resolved.\n\nI just want to make sure that this issue doesn’t go on hold forever.\n\nSo say if I want to wait to get a fix for this issue.\nThen, based on your priorities, please tell me a rough expectation of when this issue will get fixed?", "id": 179202, "attachment_id": null, "bug_id": 57214, "creation_time": "2014-11-20T10:30:45Z", "time": "2014-11-20T10:30:45Z", "is_private": false}]