[{"count": 0, "tags": [], "creator": "gregory_lundberg@gmx.com", "attachment_id": null, "id": 179095, "time": "2014-11-14T04:09:13Z", "bug_id": 57211, "creation_time": "2014-11-14T04:09:13Z", "is_private": false, "text": "Code re-use would be enhanced if each mod_lua hander allowed config-time options.\n\nAt present LuaAuthzProvider accepts config-line options.\n\nLuaQuickHandler, LuaHookTranslateName, LuaHookMapToStorage, LuaHookAccessChecker, LuaHookCheckUserID, LuaHookAuthChecker, LuaHookTypeChecker, LuaHookFixups, and LuaHookLog would benefit from similar features.\n\nI'm on the fence as to whether LuaMapHandler would benefit, but can see the case to do so since it can avoid namespace pollution encoding options in the function name.\n\nSeveral options allow 'early' and 'late' as an optional parameter. My thinking would be the add parsing of additional parameters following these, if present.\n\nLuaAuthzProvider calls a function, assigning option strings to each parameter. When you want a variable number, say, from 1 to 3 optional words on the config line, you need to add a fourth parameter then test r-TO-l for nil to verify only 1, 2, or 3 parameters appeared.\n\nMy suggestion would be to store all command-line parameters in a single function parameter, as an array. Testing the number present then becomes simply checking the array length."}, {"count": 1, "text": "Thinking more on 'early' and 'late' it might also help to add 'normal' as an optional documentation of not-early and not-late, and then pass this parameter as the first element of the array I'm suggesting.  This would allow Lua code to handle all three timing conditions, reacting as appropriate to each.\n\nI find myself doing TranslateEarly, Translate, and TranslateLate functions and simply injecting 'early', 'normal', 'late' into a call to a common local function handling all three cases.", "bug_id": 57211, "attachment_id": null, "id": 179096, "time": "2014-11-14T04:18:41Z", "creator": "gregory_lundberg@gmx.com", "creation_time": "2014-11-14T04:18:41Z", "tags": [], "is_private": false}]