[{"count": 0, "tags": [], "bug_id": 57222, "is_private": false, "id": 179138, "attachment_id": null, "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2014-11-16T13:49:06Z", "time": "2014-11-16T13:49:06Z", "text": "Comparing features and codes of the 2 listeners, I see the following:\n- Code similarity is due to SummaryReport supposed to be \"Simpler (lower memory) version of Aggregate Report (StatVisualizer)\". A comment says \"Excludes the Median and 90% columns, which are expensive in memory terms\"\n- The 2 report nearly the same thing except for Median and Percentile and also Avg Bytes being in Summary Report\n\n\nBut looking at implementation, it seems the main argument \"Excludes the Median and 90% columns, which are expensive in memory terms\" is not more valid as:\n- I don't see in StatVisualizer(Aggregate Report) high memory consumption as this class uses StatCalculator under the hood which does not accumulate values for Percentile and Median computation but counts values rather than storing them.\nNot if it was not efficient enough we could use Commons Math DescriptiveStatistics which uses an array of doubles (with a sliding window) as per sebb previous note in one of our mail discussions.\n\n\nSo I propose to add to Aggregate Report Avg. Bytes and deprecate Summary Report."}, {"count": 1, "tags": [], "bug_id": 57222, "text": "At the time when the Summary Report was created, the Aggregate Report used a different way of calculating the results, and was much more of a memory hog.\n\nThe Summary Report columns were decided based on the calculations that don't need to store multiple samples. I think it is still useful, and I don't support deprecation.\n\nEven though Aggregate now uses much less memory, it still requires more memory than the Summary.\n\nIn my opinion, what would be more useful would be to allow the Aggregate columns to be specified. Label and count should always appear, but most - if not all - the others should be optional. And the %ile values should be specifiable, as per Bug 57217", "id": 179140, "attachment_id": null, "creator": "sebb@apache.org", "creation_time": "2014-11-16T14:12:14Z", "time": "2014-11-16T14:12:14Z", "is_private": false}]