[{"count": 0, "tags": [], "bug_id": 57283, "attachment_id": null, "text": "Web Services(APIs) are accessible in browser but not opening in Soap UI when we are using tomcat 8.0.15.\nBut if we are testing with tomcat 8.0.0,then it is working fine. Can you please suggest us what need to be done?\n\nThanks,\nRaj", "id": 179365, "time": "2014-11-29T11:04:40Z", "creator": "rajdeep.raut@rediffmail.com", "creation_time": "2014-11-29T11:04:40Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57283, "attachment_id": null, "text": "There is insufficient information in this bug report for the problem to be reproduced.\n\nPlease take your questions to the Apache Tomcat users' mailing list. If the discussion there concludes that there is a bug in Tomcat then please feel free to re-open this issue to provide the necessary steps to reproduce it on a clean install of the latest stable Tomcat 8 release.", "id": 179408, "time": "2014-12-01T15:31:01Z", "creator": "markt@apache.org", "creation_time": "2014-12-01T15:31:01Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 57283, "is_private": false, "text": "Hi,\n\nFor your clarification I want to tell you that we have some web services which are running perfectly with tomcat 8.0.0(browsable in browser and in soap UI as well). The same war when we have deployed in tomcat 8.0.15, the web services(which are with basic authentication) are accessible in browser after giving the user id and password, but when we are trying to create a project with the same web services in Soap Ui it's keeps on loading without giving any error. Then we have re-deployed the same war in tomcat 8.0.14, everything is working fine again.....Please let me know anything else you want to know from my side. \n\n\n\nThanks,\nRajdeep", "id": 179429, "time": "2014-12-02T05:28:37Z", "creator": "rajdeep.raut@rediffmail.com", "creation_time": "2014-12-02T05:28:37Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 57283, "is_private": false, "id": 179430, "time": "2014-12-02T05:51:27Z", "creator": "chuck.caldarale@unisys.com", "creation_time": "2014-12-02T05:51:27Z", "tags": [], "text": "Bugzilla is not a support forum.  As Mark clearly stated, post your query on the Tomcat users' mailing list, not here."}]