[{"text": "Whenever a session is fetched from the database it is immediately saved again: (excerpt for a single request from mysql logfile)\n\n91 Execute   select value from Session where sessionkey = '1fad7788-c769-4872-aa77-00f1c7e95e50' and (expiry = 0 or expiry > 1417557643821571)\n91 Execute   update Session set value = '...', expiry = 1417558643858512, sessionkey = '1fad7788-c769-4872-aa77-00f1c7e95e50' where sessionkey = '1fad7788-c769-4872-aa77-00f1c7e95e50'\n\nWhile I understand that the expiry time has to be updated, is it really necessary to do it for _each_ request? This is especially annoying since a \"Cache-Control no-cache\" header is set and the update is done for each image, js, css, ...\n\nI propose to add a new option to allow to specify a \"no-update-period-time\" based on expiry. Basically something like:\nif (expiry + no-update-period-time < now) session_dbd_save(...);\n\nWhile this will introduce some fuzziness to session expiry time, it usually doesn't matter if the session expires a couple of seconds or minutes earlier.\n\nPlease see also:\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=57299", "tags": [], "bug_id": 57300, "attachment_id": null, "count": 0, "id": 179465, "time": "2014-12-02T22:55:13Z", "creator": "christoph.rabel@gmail.com", "creation_time": "2014-12-02T22:55:13Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57300, "text": "Created attachment 33017\nProposed new directive SessionExpiryUpdateInterval\n\nThis patch adds a new directive to mod_session, SessionExpiryUpdateInterval, similar to the description by Christoph. It defines the number of seconds that the expiry value may change in a clean session without having to save the session again.\n\nIt's added to mod_session instead of mod_session_dbd because the session submodules don't have access to the original expiry value. It also has the benefit of skipping session encoding/crypto. This change is disabled by default, meaning sessions with expiry changes will be written every request unless this directive is set.\n\nBy putting this in mod_session, it means submodules won't always receive a call to save. So the Cache-Control headers must be set on session load, which I would argue is more correct anyway, since the use of session data in processing the request (e.g. form auth) should prevent caching, regardless of whether or not the response contains session data.\n\nThe patch also includes a change to how sessions without a max age are saved. Following the same logic that we don't need to write a session if the data hasn't changed and the expiry has only changed by a small amount, we don't need to write a session if the data hasn't changed and there is no expiry at all. In this case, it's a behavior change that is not controlled by a directive. Perhaps the most noticeable effect is that new sessions that are never written to are never saved. For example, the presence of Session On without anything that uses the session will no longer result in a session cookie.\n\nI will attach a second patch containing the test changes.", "id": 184663, "time": "2015-08-19T19:21:30Z", "creator": "paul.spangler@ni.com", "creation_time": "2015-08-19T19:21:30Z", "is_private": false, "attachment_id": 33017}, {"count": 2, "tags": [], "creator": "paul.spangler@ni.com", "attachment_id": 33018, "text": "Created attachment 33018\nUpdated tests for proposed patch\n\nTest changes for the SessionExpiryUpdateInterval. It adds new tests that are skipped in 2.4 for now, and updates existing tests that do not modify the session to expect that the session will not be saved. Those tests are marked todo in 2.4 since they will fail without the changes in the proposed patch.\n\nAll tests pass against 2.4 without the patch and trunk with the patch. In my manual tests using mod_session_dbd with sqlite, I observed a 10-20x improvement in time required to make 600 requests that use mod_auth_form. That's essentially a worst-case scenario since sqlite is not optimized for writes.\n\nI also observed a MySQL installation where the same 600 requests no longer generated 600 UPDATE queries to the DB server.", "id": 184664, "time": "2015-08-19T19:28:47Z", "bug_id": 57300, "creation_time": "2015-08-19T19:28:47Z", "is_private": false}, {"count": 3, "text": "Just to be explicit about it given the size of the patches:\n\nThe code in this patchset is Copyright (c) National Instruments, licensed to the public under the Apache License 2.0.", "bug_id": 57300, "attachment_id": null, "id": 184684, "time": "2015-08-21T16:03:23Z", "creator": "paul.spangler@ni.com", "creation_time": "2015-08-21T16:03:23Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 57300, "attachment_id": null, "id": 185778, "time": "2015-10-16T22:40:02Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-10-16T22:40:02Z", "is_private": false, "text": "Thanks Paul, committed in r1709121.\nI will let others review it on trunk, commit and run the tests, and then propose a backport."}, {"count": 5, "tags": [], "bug_id": 57300, "attachment_id": null, "text": "(In reply to Yann Ylavic from comment #4)\n> Thanks Paul, committed in r1709121.\nForgot to mention that I made minor changes, like s/long/apr_time_t/ for expiry_update_time or SessionExpiryUpdateInterval directive doc/command description and validation.", "id": 185779, "time": "2015-10-16T22:47:26Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-10-16T22:47:26Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 57300, "attachment_id": null, "text": "(In reply to Yann Ylavic from comment #5)\n> (In reply to Yann Ylavic from comment #4)\n> > Thanks Paul, committed in r1709121.\n> Forgot to mention that I made minor changes, like s/long/apr_time_t/ for\n> expiry_update_time or SessionExpiryUpdateInterval directive doc/command\n> description and validation.\n\nSounds good. Thanks for taking a look at it Yann!", "id": 185780, "time": "2015-10-16T22:56:10Z", "creator": "paul.spangler@ni.com", "creation_time": "2015-10-16T22:56:10Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 57300, "attachment_id": 33187, "is_private": false, "id": 185797, "time": "2015-10-19T15:44:09Z", "creator": "paul.spangler@ni.com", "creation_time": "2015-10-19T15:44:09Z", "text": "Created attachment 33187\nUpdated tests\n\nTests updated to match changes made in r1707969 for handling large numbers. Now applies cleanly to httpd test trunk."}]