[{"count": 0, "tags": [], "creator": "nicholaspmgodfrey@gmail.com", "attachment_id": 32296, "text": "Created attachment 32296\nFiddler trace where bunching can be seen after a while\n\nI've got a fairly simple script and want to run it with 5 threads. I have data set to 'All Threads' nad a ramp up time of 120 seconds and things start of fine. But after a while, I start to see bunches of the same calls, ultimately in bunches of the number of threads - so bunches of 5 in this case. This takes a while to develop but I can clearly see it in a Fiddler trace. I tried version 2.10 and it's doing the same thing. I also have a timer in the script and tried a gaussian random timer but am still getting the same pattern developing over time. Attaching a Fiddler screenshot. I tried it with unique data as well (so not expecting any duplicates) but still get the effect.", "id": 179798, "time": "2014-12-16T15:34:39Z", "bug_id": 57357, "creation_time": "2014-12-16T15:34:39Z", "is_private": false}, {"count": 1, "tags": [], "text": "Hi,\nCan you create a simple Test plan based on Debug Sampler and CSV Dataset showing issue ?\n\nThanks", "attachment_id": null, "id": 179802, "creation_time": "2014-12-16T21:14:29Z", "time": "2014-12-16T21:14:29Z", "creator": "p.mouawad@ubik-ingenierie.com", "bug_id": 57357, "is_private": false}, {"count": 2, "tags": [], "creator": "nicholaspmgodfrey@gmail.com", "attachment_id": null, "text": "Hi, I was just about to answer you and I have found the problem. It's my code I'm afraid. I have a model I am developing (here: http://www.webwob.com/html/jmeter_raw_.html ) and I made a mistake by storing the adjusted_url in a system property. It should be in a local variable of course. I didn't think of threads at the time. I'll fix this now so don't bother downloading that project just yet. can you close this bug. Thanks. (user error).\n\nNick", "id": 179829, "time": "2014-12-17T16:08:14Z", "bug_id": 57357, "creation_time": "2014-12-17T16:08:14Z", "is_private": false}]