[{"count": 0, "tags": [], "bug_id": 57360, "text": "From the mod_ssl docs:\n\n> SSLCertificateChainFile is deprecated\n>\n> SSLCertificateChainFile became obsolete with version 2.4.8, when \n> SSLCertificateFile was extended to also load intermediate CA certificates from \n> the server certificate file.\n\nNow that this is the case, there's a very easy mistake one can make that will crash the server. When combining the CA chain and site certficate files, if one does,\n\n  $ cat chain.crt site.crt > combined.crt\n\ninstead of,\n\n  $ cat site.crt chain.crt > combined.crt\n\nthen the server will crash on the next graceful reload. It will also refuse to start; the only thing logged is a cryptic \"AH00016: Configuration Failed\" which is misleading at best.\n\nI don't know whether it's a good idea to proceed with one dead vhost -- the site in question obviously won't work with a mismatched key/cert -- but if not a better error message would be nice. I spent rather a long time searching for other problems while all of our sites were down because it never occurred to me that a key/cert mismatch could crash the whole server.", "id": 179813, "time": "2014-12-17T05:20:26Z", "creator": "michael@orlitzky.com", "creation_time": "2014-12-17T05:20:26Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "sophie@hemio.de", "attachment_id": null, "id": 186541, "time": "2015-11-25T10:38:16Z", "bug_id": 57360, "creation_time": "2015-11-25T10:38:16Z", "is_private": false, "text": "I ran into the same problem on a production system. I did not expect apache2 to crash during a reload operation. Such behavior does not really help in expanding the adoption of encryption. With imminent automation through \"Let's encrypt\" this can even break systems without an admin directly being involved.\n\nHowever, I do get a syslog entry\n\n> [ssl:emerg] [pid 10249] AH02565: Certificate and private key 127.0.0.1:443:0 from /etc/apache2/ssl/test.crt and /etc/apache2/ssl/test.key do not match\n\nwith configured \"ErrorLog syslog:user\". But I think that \"emergency\" is _not_ the correct severity level.\n\nPossible Solutions (without knowing if it is technically feasible):\n\n1. Catch the Openssl signal and disable vhost and log\n2. Catch the Openssl signal and recover with emergency key and certificate (config values) and log, disable vhost if emergency key/cert are not available or cause error with openssl\n3. Involve Openssl in the configtest and let reload fail if there is any kind of cert problem"}, {"count": 2, "tags": [], "bug_id": 57360, "text": "I only proposed 1. and 2. since I thought 3. might be complicated. However, all the tools required to do the necessary checks at configtest are in place.\n\nCurrently, the certificate/key checks are done in ssl_init_server_certs which is called as post config hook (ap_hook_post_config).\n\nProbably, moving one part of this code to a check config hook (ap_hook_check_config) would solve the problem. However, the support of encrypted private keys makes this task non-trivial (at least for me). I would have to investigation further to see if this a real problem.", "id": 186552, "time": "2015-11-25T16:00:33Z", "creator": "sophie@hemio.de", "creation_time": "2015-11-25T16:00:33Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 57360, "is_private": false, "text": "I've experienced this issue as well - I just want to share what I believe to be a common expectation among system administrators / DevOps folks out there.  When a daemon fails to load, we expect the reason for the failure to be clearly logged, ideally to syslog.  I agreed that the \"Configuration Failed\" (aka Apache initialization) and Apache returned \"1\" when it exited, but I hope everyone will admit the following two statements don't really give the administrator a good place to look for things to fix:\n\n\"AH00016: Configuration Failed\" ... and ...\n\"Syntax OK\" (from httpd -t) - which implies the configuration is OK\n\nI wish it had said something like:\n\"AH00016: Configuration Failed: Security certificate error: /path/to/file\"\nor\n\"AH00016: Configuration Failed: VHost example.com: cannot initialize SSL/TLS\"\n\nThankfully I know about strace.\n\nAny solution that puts a message that points the administrator to the source of the problem is a win in my book.\n\nThank you!", "id": 198084, "time": "2017-03-30T16:10:10Z", "creator": "unixi@freeshell.org", "creation_time": "2017-03-30T16:10:10Z", "attachment_id": null}]