[{"count": 0, "tags": [], "bug_id": 57375, "attachment_id": 32309, "id": 179877, "time": "2014-12-19T18:09:27Z", "creator": "brnrd@freebsd.org", "creation_time": "2014-12-19T18:09:27Z", "is_private": false, "text": "Created attachment 32309\nPatch for apache24 to build cleanly with LibreSSL\n\nApache 2.4 (and 2.2) can not be built when LibreSSL is used as SSL library.\nLibreSSL has (amongst others)\n  - removed RAND_egd\n  - removed CHIL engine\n  - added SSL_CTX_use_certificate_chain\nthis leads to build failures for missing and redefining functions. This patch fixes these errors by\n  - adding a check for RAND_egd and SSL_CTX_use_certificate_chain\n  - using an already available define for CHIL\n  - using defines for the added checks\n\nPatch attached, this applies without issue to a cleanly extracted httpd-2.4.10 tree.\nThis has also been submitted as a report at FreeBSD, see\nhttps://bugs.freebsd.org/bugzilla/show_bug.cgi?id=196139"}, {"count": 1, "tags": [], "bug_id": 57375, "attachment_id": null, "id": 180253, "time": "2015-01-11T11:54:55Z", "creator": "asfbugz@velox.ch", "creation_time": "2015-01-11T11:54:55Z", "is_private": false, "text": "Rewording the summary to more accurately capture the topic of this bug.\n\nI'm not really supportive of this idea, to be frank. mod_ssl is effectively mod_openssl these days. It used to have (and in 2.2.x still does) an ssl_toolkit_compat layer which allowed support for multiple toolkits, in theory, but as discussed in these two threads, the consensus in 2010/2011 was to deliberately drop support for non-OpenSSL toolkits:\n\nhttps://mail-archives.apache.org/mod_mbox/httpd-dev/201005.mbox/%3C20100525124551.GA11177%40redhat.com%3E\n\nhttps://mail-archives.apache.org/mod_mbox/httpd-dev/201107.mbox/%3C4E35065D.30104%40velox.ch%3E\n\n(see r1154683 and and r1154687)\n\nWhile the changes for supporting LibreSSL might seem small right now, it would definitely mean that mod_ssl maintenance becomes [again] more complex, assuming a scenario of LibreSSL deviating more substantially from OpenSSL in the future (consider http://www.openbsd.org/cgi-bin/man.cgi?query=tls_init&sektion=3 e.g.).\n\nMaintaining mod_ssl compatibility with all OpenSSL versions still floating around (0.9.7/0.9.8/1.0.0/1.0.1) is already quite burdensome, and I wouldn't want to make things more complicated by adding another toolkit to the mix (otherwise, next on the table would be BoringSSL, I guess). Let's draw a clear line right now, and not silently morph mod_[open]ssl into something like mod_{libre,boring,...}ssl."}, {"count": 2, "tags": [], "bug_id": 57375, "attachment_id": null, "id": 180255, "time": "2015-01-11T11:57:24Z", "creator": "asfbugz@velox.ch", "creation_time": "2015-01-11T11:57:24Z", "is_private": false, "text": "*** Bug 57395 has been marked as a duplicate of this bug. ***"}, {"count": 3, "tags": [], "bug_id": 57375, "attachment_id": null, "is_private": false, "id": 180258, "time": "2015-01-11T13:33:17Z", "creator": "brnrd@freebsd.org", "creation_time": "2015-01-11T13:33:17Z", "text": "I can see why you don't want to support that many versions/libraries...\n\nHowever, recently (Okt and Dec 2014) the OpenSSL project has released both a new version of the Roadmap and a new Release Strategy\nhttps://www.openssl.org/about/roadmap.html\nhttps://www.openssl.org/about/releasestrat.html\nindicating that some bigger change is required that will impact API etc.\n\nThe number of supported OpenSSL versions will be greatly reduced. Both 0.9.8 and 1.0.0 will be end-of-support by end of this year, and 1.0.1 is planned to be end-of-support 24 months from now.\n\nWithout a doubt OpenBSD's (and if my patches are committed) FreeBSD's ports will make it possible to compile Apache with LibreSSL. Going forward the effort to make that work will increase and other TLS libraries will start emerging (ressl/libtls). Is a strategy with regards to other TLS libraries already formulated? And if so, where can we find it?"}, {"count": 4, "tags": [], "text": "Comment on attachment 32309\nPatch for apache24 to build cleanly with LibreSSL\n\nMarking as obsolete - the SSL_CTX_use_certificate_chain changes are no longer necessary (see https://mail-archives.apache.org/mod_mbox/httpd-dev/201504.mbox/%3C20150415163613.GC15209%40fintan.stsp.name%3E).\n\nENGINE_CTRL_CHIL_SET_FORKCHECK: committed with r1673455\n\nRAND_egd: committed with r1674542 and r1675410", "attachment_id": 32309, "id": 182627, "creator": "asfbugz@velox.ch", "time": "2015-04-26T08:19:13Z", "bug_id": 57375, "creation_time": "2015-04-26T08:19:13Z", "is_private": false}, {"count": 5, "tags": [], "text": "Also, ENGINE_CTRL_CHIL_SET_FORKCHECK change already backported to 2.4.x with r1673900.", "attachment_id": null, "id": 182628, "creator": "asfbugz@velox.ch", "time": "2015-04-26T08:21:58Z", "bug_id": 57375, "creation_time": "2015-04-26T08:21:58Z", "is_private": false}, {"count": 6, "tags": [], "text": "Hi Kaspar,\n\nHappy that this is now fixed.\n\nMust say I'm pretty annoyed with the process. I do believe I've submitted a proper patch using the process as desired by the project (BugZilla). I basically get told off and that this would require a separate module since the difference between LibreSSL and OpenSSL is perceived to be to big.\n\nThen 4 months later people drop patches in via the Mailing-List (is that the proper way of supplying patches to Apache httpd?). There's no communication on this PR that there's things are changing until 4 patch-sets are being committed fixing all of the issues with LibreSSL. The patches committed are identical to the ones I committed yet there's no attribution, thanks or apologies on the process that was followed by the project. Perhaps things improve once I can mail from a @freebsd.org account?\n\nHope to hear from you regarding the change of policy with regards to non-OpenSSL toolkits.\n\nWith kindest though miffed regards and many thanks for a fine product,\n\nBernard Spil.", "is_private": false, "bug_id": 57375, "id": 182636, "time": "2015-04-26T17:16:18Z", "creator": "brnrd@freebsd.org", "creation_time": "2015-04-26T17:16:18Z", "attachment_id": null}, {"count": 7, "tags": [], "text": "Bugzilla isn't the right place for complaining, or discussing general questions about toolkit support. And don't Cc me unsolicitedly, please.\n\nI was not involved in launching the mid-April effort on LibreSSL compatibility (see https://mail-archives.apache.org/mod_mbox/httpd-dev/201504.mbox/%3C20150414135312.GA15703%40fintan.stsp.name%3E), so you're asking the wrong person. I merely updated the information in this bug to make sure that whoever looks at this issue sees relatively up-to-date information.\n\nMy opinion re: adding LibreSSL to the list of supported mod_ssl toolkits (comment 1) hasn't changed, but then I'm not the only httpd dev who has a say on this, either.", "attachment_id": null, "id": 182637, "creator": "asfbugz@velox.ch", "time": "2015-04-26T17:52:13Z", "bug_id": 57375, "creation_time": "2015-04-26T17:52:13Z", "is_private": false}, {"count": 8, "tags": [], "text": "> Then 4 months later people drop patches in via the Mailing-List (is that the\n> proper way of supplying patches to Apache httpd?). \n\nEither/both is appropriate.  I don't think 'PatchAvailable' would have helped, but I personally stay more on top of email then the list of open bugs unless they stay active [which means they stay active in my mail client]\n\n> There's no communication\n> on this PR that there's things are changing until 4 patch-sets are being\n> committed fixing all of the issues with LibreSSL. \n\nFor whatever reason, this PR didn't gather much attention, so there was no (immediate) followup here.\n\n> The patches committed are\n> identical to the ones I committed yet there's no attribution, thanks or\n> apologies on the process that was followed by the project. \n\nI will investigate to see if they were developed independently or if they were via your freebsd bugzilla patches and not properly attributed.\n\n> Perhaps things improve once I can mail from a @freebsd.org account?\n\nI don't think that is much of a factor.  \n\nStefan posted from his apache.org account where he earned his karma on a related project and is a member of the foundation looking to improve httpd.  He also posted shortly after another community member asking about the same CHIL_engine issue fixed in the first patch.    So for better or for worse, I think those things got his thread a little more attention.\n\n> Hope to hear from you regarding the change of policy with regards to\n> non-OpenSSL toolkits.\n\nThere is no policy, just the opinion whoever has time to respond, work on, and maintain things.  \n\nSorry for your bad experience, but it is largely due to volunteer resources stretched thin.", "attachment_id": null, "id": 182638, "creator": "covener@gmail.com", "time": "2015-04-26T18:19:10Z", "bug_id": 57375, "creation_time": "2015-04-26T18:19:10Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 57375, "is_private": false, "text": "Hi Eric, Kaspar,\n\nMy apologies. Reacted from the gut.\n\nThe patches are probably not even mine to begin with and may originate from OpenBSD ports or Gentoo-libressl...\n\nThanks for a fine product!", "id": 182701, "time": "2015-04-28T19:24:51Z", "creator": "brnrd@freebsd.org", "creation_time": "2015-04-28T19:24:51Z", "attachment_id": null}, {"count": 10, "tags": [], "text": "Commits relative to RAND_egd (r1674542, r1675410, and r1676842, with updated credit), proposed for backport to 2.4.x (in r1676844).\n\nThanks Bernard.", "attachment_id": null, "id": 182735, "creator": "ylavic.dev@gmail.com", "time": "2015-04-29T20:24:51Z", "bug_id": 57375, "creation_time": "2015-04-29T20:24:51Z", "is_private": false}, {"count": 11, "tags": [], "bug_id": 57375, "attachment_id": null, "id": 182762, "time": "2015-04-30T13:33:26Z", "creator": "covener@gmail.com", "creation_time": "2015-04-30T13:33:26Z", "is_private": false, "text": "(In reply to Bernard Spil from comment #9)\n> Hi Eric, Kaspar,\n> \n> My apologies. Reacted from the gut.\n> \n> The patches are probably not even mine to begin with and may originate from\n> OpenBSD ports or Gentoo-libressl...\n> \n> Thanks for a fine product!\n\nNo worries, and apologies for the patches languishing and the resulting confusion."}, {"count": 12, "text": "Backported to 2.4.13 with r1679199, released with 2.4.16.", "bug_id": 57375, "is_private": false, "id": 185505, "time": "2015-09-27T13:38:00Z", "creator": "asfbugz@velox.ch", "creation_time": "2015-09-27T13:38:00Z", "tags": [], "attachment_id": null}, {"count": 13, "tags": [], "bug_id": 57375, "attachment_id": null, "id": 185506, "time": "2015-09-28T06:56:34Z", "creator": "brnrd@freebsd.org", "creation_time": "2015-09-28T06:56:34Z", "is_private": false, "text": "Meanwhile this can be further simplified. LibreSSL 2.2.0 added an additional define so the autoconf kludge is no longer needed. The naming is in line with the OpenSSL naming of removed features\n\n#ifdef HAVE_RAND_EGD\n\nchange to \n\n#ifndef OPENSSL_NO_EGD\n\nRemove autoconf test for RAND_egd"}]