[{"text": "I have Debian 7 on my server matteosistisette.com\n# cat /etc/hostname \nmatteosistisette.com\n\nHere are the contents of my available sites at /etc/apache2/sites-available:\n\n/etc/apache2/sites-available/default:\nhttp://pastebin.com/Zee7vLw5\n\n/etc/apache2/sites-available/interferencesweb.org:\nhttp://pastebin.com/DErqjgke\n\n/etc/apache2/sites-available/matteosistisette.com\nhttp://pastebin.com/ZSqmVYpZ\n\n/etc/apache2/sites-available/sixty-seven.com\nhttp://pastebin.com/fkC9Cdfh\n\n\nIf I enable all of them EXCEPT DEFAULT, everything works as expected: if a client requests matteosistisette.com it gets matteosistisette.com, if it requests interferencesweb.org it gets interferencesweb.org, and so on. However, if a client requests directly the server's IP, or a domain that points to the server's IP but is not any of the virtual hosts, the server looks for the content in interferencesweb.org's root. Which is expected, I guess, being the first one it's the first.\n\n\nSo, IF I ENABLE all of them, INCLUDING DEFAULT the issue appears:\n* Expected behavior:\n- if the client requests matteosistisette.com it should get matteosistisette.com, if the client asks interferencesweb.org it should get interferencesweb.org, and so on, but\n- if it asks the IP directly, or a domain pointing to the IP that is not any of the virtual hosts, then it should get the content at /var/www (which is the default \"it works!\" page, but I intend to change it).\n\n* Observed behavior:\n- virtual hosts EXCEPT matteosistisette.com work as expected, i.e. if you request sixty-seven.com you get sixty-seven.com, if  you request interferencesweb.org you get interferencesweb.org, ...\n- however, if you request matteosistisette.com (I guess because it is the one that matches the host name in /etc/hostname), the default site is used instead of using the one whose ServerName or alias matches the request.", "tags": [], "bug_id": 57384, "is_private": false, "count": 0, "id": 179923, "time": "2014-12-21T23:05:31Z", "creator": "teo8976@gmail.com", "creation_time": "2014-12-21T23:05:31Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "text": "Unfortunately from a httpd perspective, this is working as designed, for the reason you suggested at the end of your report. \n\nIf you omit the servername, it's calculated from the system hostname (double-reverse DNS lookup of the system hostname).  The docs do not get this exactly right.\n\nThe alternatives as a default behavior all seem too problematic to be viable options:\n\n* httpd could look for a matching servername in a way that the default name-based vhost is not checked first (surprising change for basic function, potentially more costly at runtime)\n* httpd could use a dummy value rather than the system hostname as a default\n\nI think it is necessary for the user to explicitly provide an alternative ServerName in this case. I will take a todo to mention it in ServerName and name-based vhosting docs. \n\nEven with the debian \"default\" virtualhost structured this way, it does not seem to be a frequent problem, so I think it will have to remain the affected users providing an alt ServerName.", "id": 179924, "time": "2014-12-22T00:13:40Z", "bug_id": 57384, "creation_time": "2014-12-22T00:13:40Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "teo8976@gmail.com", "is_private": false, "count": 2, "id": 179925, "time": "2014-12-22T00:43:26Z", "bug_id": 57384, "creation_time": "2014-12-22T00:43:26Z", "text": "> If you omit the servername, it's calculated from the system hostname \n> (double-reverse DNS lookup of the system hostname).  \n\nBut I'm NOT omitting it.\nIf I do a request without any host, or with a host that does not match any virtual host, I get the default host, that's the expected part.\n\nBut I do a request to matteosistisette.com, e.g. a \"GET /\" request with \"Host: matteosistisette.com\" in the header (I've checked in the browser's developer tools and the header _is_ present). So, it should hit the virtualhost that has ServerName matteosistisette.com rather than the default one.\n\n\n> The docs do not get this exactly right.\n\nThen at least the docs must be fixed. Everything I read in the docs, and even the tutorial, are pretty clear in (wrongly) suggesting that a VirtualHost definition whose ServerName matches the host being requested will be used, and that is not the case. I still don't understand why it shouldn't prevail over the default, but alas, it's very important that it is documented.\n\n\nWait a moment,\n\"I think it is necessary for the user to explicitly provide an alternative ServerName in this case\"\nAre you talking about specifying a ServerName in the definition of the default site? How would that produce the desired result?\nSuppose the client requests the IP directly, or a host that (through DNS) points to the server but doesn't match the servername of any vhost (not even the default's one). How is it that this would hit the default vhost??"}, {"count": 3, "tags": [], "bug_id": 57384, "text": "(In reply to teo8976 from comment #2)\n> > If you omit the servername, it's calculated from the system hostname \n> > (double-reverse DNS lookup of the system hostname).  \n> \n> But I'm NOT omitting it.\n\nI meant in your default vhost, not in the HTTP request.", "id": 179926, "time": "2014-12-22T00:53:54Z", "creator": "covener@gmail.com", "creation_time": "2014-12-22T00:53:54Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "teo8976@gmail.com", "text": "> I meant in your default vhost, not in the HTTP request.\n\nYeah, later I realized.\nBut still, see my last question. (and most of my last comment)", "count": 4, "id": 180077, "time": "2014-12-30T11:48:18Z", "bug_id": 57384, "creation_time": "2014-12-30T11:48:18Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 57384, "is_private": false, "text": "\n> Are you talking about specifying a ServerName in the definition of the\n> default site? How would that produce the desired result?\n> Suppose the client requests the IP directly, or a host that (through DNS)\n> points to the server but doesn't match the servername of any vhost (not even\n> the default's one). How is it that this would hit the default vhost??\n\nThe first-listed vhost captures anything that doesn't match a servername/serveralias, even if you specify a servername.", "id": 180078, "time": "2014-12-30T12:00:28Z", "creator": "covener@gmail.com", "creation_time": "2014-12-30T12:00:28Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 57384, "text": "Ok so the workaround is pretty stright-forward, but this definitely needs to be properly documented.\nI notice the bug is set as wontFix. Is the documentation issue tracked somewhere else? This lack of documentation is a major source of waste of time, and of questions on StackOverflow/ServerFault/Whatever, most of them without answer.", "id": 180088, "time": "2014-12-30T19:34:36Z", "creator": "teo8976@gmail.com", "creation_time": "2014-12-30T19:34:36Z", "is_private": false, "attachment_id": null}, {"text": "The doc is updated for 2.4 and trunk to caution against omitting the servername\nupdated: core.html name-based.html\n\nI'd suggest opening a debian/ubuntu bug for them to consider the downside in the default virtual host not having a ServerName (can't easily override it with a later vhost which would be quite natural). They probably have more experience with the impact/options around that omitted ServerName.", "tags": [], "bug_id": 57384, "is_private": false, "count": 7, "id": 180091, "time": "2014-12-30T20:02:48Z", "creator": "covener@gmail.com", "creation_time": "2014-12-30T20:02:48Z", "attachment_id": null}]