[{"count": 0, "text": "http://svn.apache.org/viewvc/tomcat/taglibs/standard/tags/taglibs-standard-1.2.1/jstlel/src/main/java/org/apache/taglibs/standard/lang/jstl/Evaluator.java?view=markup#l70\n\nEvaluator uses a single static instance of an ELEvaluator. As a result enabling and disabling the cache would apply to all validate and evaluate operations from all threads. This will result in unexpected behaviour if validation is performed on multiple threads concurrently.\n\nThis is not an issue when the library is included with a web application as multiple copies of the Evaluator will be created for the different ClassLoaders (although that may have other unanticipated consequences).\n\nThis may be an issue if the library is shared between applications.", "bug_id": 57434, "is_private": false, "id": 180263, "time": "2015-01-11T21:52:15Z", "creator": "jboynes@apache.org", "creation_time": "2015-01-11T21:52:15Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "creator": "thofman@redhat.com", "attachment_id": null, "is_private": false, "id": 202698, "time": "2017-12-11T11:20:03Z", "bug_id": 57434, "creation_time": "2017-12-11T11:20:03Z", "text": "This concurrency issue was also hit in EAP/Wildfly. It is an issue even if the library is included inside a web application, e.g. when two different JSPs are requested and evaluated concurrently.\n\nTested with taglibs-standard-jstlel 1.2.5.\n\nI'm attaching a suggested patch."}, {"count": 2, "tags": [], "bug_id": 57434, "attachment_id": 35602, "id": 202699, "time": "2017-12-11T11:21:42Z", "creator": "thofman@redhat.com", "creation_time": "2017-12-11T11:21:42Z", "is_private": false, "text": "Created attachment 35602\nPatch"}, {"count": 3, "text": "I believe this patch reduces the window for the race but does not fully close it as another thread could still modify the field between when it is set and then read. It would be unlikely due to variable caching but still possible.", "bug_id": 57434, "is_private": false, "id": 202704, "time": "2017-12-11T13:35:22Z", "creator": "jboynes@apache.org", "creation_time": "2017-12-11T13:35:22Z", "tags": [], "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 57434, "attachment_id": null, "id": 202705, "time": "2017-12-11T13:43:05Z", "creator": "jboynes@apache.org", "creation_time": "2017-12-11T13:43:05Z", "is_private": false, "text": "The current implementation disables caching while expressions are being validated during the translation process. This has the side effect of disabling the cache for evaluations that occur concurrently i.e. if a JSP is being translated at the same time a request is occurring. I don't think this was the intent but hesitate to change the behaviour given the age of this library.\n\nIf we think this is safe, we could simply pass the flag as a parameter to parseExpressionString and eliminate the field entirely."}, {"text": "Sorry for not elaborating before - in fact my main motivation was that currently the parseExpressionString() method can throw a NPE because of the race, which breaks the request processing. Moreover when the NPE occurs, the mBypassCache flag is not reset to false by the calling method Evaluator#validate() and that affects later calls.\n\nThe patch seemed like a safe solution to prevent the NPE. The caching could still be affected by the race condition, but that seemed like a smaller problem.\n\nPassing the flag as a method parameter would be ideal. Perhaps an overloaded method with an extra parameter could be introduced while the old one is kept, to stay backward compatible in case someone is calling the methods directly. I opened a PR in that regard in our fork:\n\n  https://github.com/jboss/jboss-jstl-api_spec/pull/16/files\n\n(I overloaded also convertStaticValueToExpectedType(), which is too using the flag.)\n\nI understand the reluctance though.", "tags": [], "bug_id": 57434, "attachment_id": null, "count": 5, "id": 203070, "time": "2018-01-04T11:45:13Z", "creator": "thofman@redhat.com", "creation_time": "2018-01-04T11:45:13Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 57434, "attachment_id": null, "id": 203071, "time": "2018-01-04T11:56:14Z", "creator": "thofman@redhat.com", "creation_time": "2018-01-04T11:56:14Z", "is_private": false, "text": "Linking the JBoss issue for reference: https://issues.jboss.org/browse/JBEE-183"}]