[{"count": 0, "tags": [], "bug_id": 57458, "text": "Some of users reported that they came to be another user, after long investigation using a JMeter scripts we're able to duplicate it, we found that when stressing tomcat for a while using huge response (like download files or big pages) some users got wrong response from another users and in some cases users received images instead of html pages, in same time we got null pointer coming from the connector (we are using \"org.apache.coyote.http11.Http11NioProtocol\"), so we changed it to \"org.apache.coyote.http11.Http11Protocol\" then we could not duplicated again using the Http11Protocol protocol\n\nWe're using Tomcat 7.0.39 with JDK 1.6_10, is there is any known fix for this issue and in which version?", "id": 180355, "time": "2015-01-18T14:02:48Z", "creator": "mahmoud.alyasein@gmail.com", "creation_time": "2015-01-18T14:02:48Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 57458, "text": "7.0.39 is getting on for 2 years old and has a number of known security vulnerabilities including one that can result in response mix ups.\n\nPlease upgrade to the latest stable 7.0.x release (7.0.58 as I type this) and retest.\n\nThe more information you provide, the more likely we are to be able to help you. A copy of the stack trace for the NPE you mention would be a start. Other things of interest are does your application use any of the following:\n- Comet (I'm guessing not because you could switch to BIO)\n- WebSocket\n- Servlet 3.0 async\n- sendFile", "id": 180357, "time": "2015-01-18T16:43:19Z", "creator": "markt@apache.org", "creation_time": "2015-01-18T16:43:19Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 57458, "text": "We are not using any of mentioned items, unfortunately I don't have the stack trace just null pointer exception without stack trace, I'll try to use the latest version and see", "id": 180363, "time": "2015-01-19T08:55:46Z", "creator": "mahmoud.alyasein@gmail.com", "creation_time": "2015-01-19T08:55:46Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 57458, "is_private": false, "text": "(In reply to Mark Thomas from comment #1)\n> 7.0.39 is getting on for 2 years old and has a number of known security\n> vulnerabilities including one that can result in response mix ups.\n> \n> Please upgrade to the latest stable 7.0.x release (7.0.58 as I type this)\n> and retest.\n\n+1\n\nCorrection:\n7.0.57 is the last released version. (7.0.58 has not been tagged yet).\n\nI also recommend to add the following line to conf/catalina.properties\norg.apache.catalina.connector.RECYCLE_FACADES=true\n\nDocumentation:\nhttp://tomcat.apache.org/tomcat-7.0-doc/config/systemprops.html#Security\n\nThat settings helps to prevent and detect programming errors in web applications such as illegal access to request/response objects outside of their life cycle.", "id": 180367, "time": "2015-01-19T10:37:56Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-01-19T10:37:56Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 57458, "text": "No response in 2+ weeks. Closing on the assumption that the application is retaining a reference that it shouldn't.\n\nFeel free to re-open this if you can provide a simple test case that demonstrates this issue on the latest 7.0.x release.", "id": 180720, "time": "2015-02-03T10:53:22Z", "creator": "markt@apache.org", "creation_time": "2015-02-03T10:53:22Z", "is_private": false, "attachment_id": null}]