[{"count": 0, "tags": [], "bug_id": 57456, "attachment_id": null, "text": "I know there have been resolved cases of RecordFormatException involving SSTRecord in the past, but I think I found a new case. The stack trace looks like this:\n\norg.apache.poi.hssf.record.RecordFormatException: Not enough data (0) to read requested (2) bytes\n\tat org.apache.poi.hssf.record.RecordInputStream.checkRecordPosition(RecordInputStream.java:216)\n\tat org.apache.poi.hssf.record.RecordInputStream.readShort(RecordInputStream.java:233)\n\tat org.apache.poi.hssf.record.common.UnicodeString.<init>(UnicodeString.java:405)\n\tat org.apache.poi.hssf.record.SSTDeserializer.manufactureStrings(SSTDeserializer.java:57)\n\tat org.apache.poi.hssf.record.SSTRecord.<init>(SSTRecord.java:247)\n\nSSTDeserializer.manufactureStrings(..) is told there are strings, but the RecordInputStream has 0 bytes remaining (although there are more records that follow). I find it interesting that the code attempts to read a Unicode string when there are no bytes remaining ... it will always fail, no? \n\nGeneral Steps to Reproduce:\n\n* Create blank workbook in Excel 2010 (or later).\n* Add a web query (or any other data source) and insert into the sheet. This creates an external sheet ref.\n* In the \"Usage\" tab of the connection properties, specify \"Remove data from external data range before saving the workbook\".\n* Save workbook as XLS file.\n* Open XLS file in POI. *Boom*.\n\nUpon saving, Excel is writing the SSTRecord that claims to have strings, but it is actually empty. Odd, but it is what it is. I know POI cannot handle external data sources, but I expect to be able to open the file with POI without blowing up. There may be other sheets with useful data that I want to scrape.", "id": 180350, "time": "2015-01-18T03:18:38Z", "creator": "jpfourny@gmail.com", "creation_time": "2015-01-18T03:18:38Z", "is_private": false}, {"count": 1, "tags": [], "text": "Can you please add such a file so it becomes easier to reproduce this. Additional points if you can include a unit test as well.", "attachment_id": null, "bug_id": 57456, "id": 180351, "time": "2015-01-18T06:56:12Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-01-18T06:56:12Z", "is_private": false}, {"count": 2, "tags": [], "creator": "jpfourny@gmail.com", "attachment_id": 32376, "id": 180361, "time": "2015-01-18T22:43:00Z", "bug_id": 57456, "creation_time": "2015-01-18T22:43:00Z", "is_private": false, "text": "Created attachment 32376\nFile to reproduce the issue.\n\nThe file contains no data - just a Web Query that is populated when opened in Excel and the data is removed by Excel on save. Note: The Web Query is not reachable outside of a private intranet, so do not expect it to populate in Excel. The point is to demonstrate that Excel is saving an SSTRecord that chokes up POI. Interestingly, this file opens without error in OpenOffice, which I thought was built on POI, no?"}, {"count": 3, "tags": [], "creator": "jpfourny@gmail.com", "attachment_id": null, "id": 180598, "time": "2015-01-27T18:16:35Z", "bug_id": 57456, "creation_time": "2015-01-27T18:16:35Z", "is_private": false, "text": "I am setting the status back to \"NEW\", since I have attached an input file to reproduce the issue, as requested. Unfortunately, I do not have time to build a unit test :(."}, {"count": 4, "tags": [], "text": "The problem is caused by a SSTRecord that is not built correctly by Excel. \n\nAccording to the spec it should contain the number of strings overall in the file and the number of unique strings that then follow in the record. However in this case the number of strings overall is zero (which itself is not allowed per the spec) and the number of unique strings seems to be randomly set. So we try to read a random number of strings, which predictably fails.\n\nI have worked around this in r1659650 so that if the number of string overall is zero, the SST record is read as empty and thus parsing this file works.", "attachment_id": null, "bug_id": 57456, "id": 181059, "time": "2015-02-13T19:15:53Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-02-13T19:15:53Z", "is_private": false}]