[{"count": 0, "tags": [], "text": "Hi, I'm doing research on asynchronous programming. I found in many places, the code in Tomcat 8 invokes \"Future.get()\" immediately after starting a future task. Because \"Future.get()\" is a blocking call, the code will block immediately. \n\nFor example, in \"startInternal\" method of \"ContainerBase\" class (line 917), you invoke \"result.get()\", where \"result\" is a Future, immediately after starting it, so the code blocks immediately. Such code has the same effect as sequential code (or even worse since you need to use other threads). \n\nWhy not use Guava ListenableFuture or Java8 CompletableFuture and avoid \"Future.get()\"? These two new constructs provide callbacks to listen to the Future's result:\nhttp://docs.guava-libraries.googlecode.com/git/javadoc/com/google/common/util/concurrent/ListenableFuture.html\n\nhttps://docs.oracle.com/javase/8/docs/api/java/util/concurrent/CompletableFuture.html\n\nFor example, in \"ContainerBase\" class, you may put the code after \"result.get()\" (such as lines 924-937) into CompletableFuture.thenRunAsync.\nThen make \"startInternal\" method return this CompletableFuture, and in the callers (such as \"LifecycleBase.start()\" method) you can put more continuations into CompletableFuture.thenRunAsync. And you can also invoke \"Future.get\" somewhere in the callers, instead of immediately. \n\nDo you think such kind of change is correct and can improve the code?", "is_private": false, "bug_id": 57478, "id": 180448, "time": "2015-01-21T20:50:55Z", "creator": "yu.lin.86@gmail.com", "creation_time": "2015-01-21T20:50:55Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "Bugzilla is not a discussion for design descisions. This belongs on the dev list.\n\nFor the record, I think the kind of change you are suggesting is wrong and is based on a superficial understanding of the code.", "id": 180451, "time": "2015-01-21T21:49:34Z", "bug_id": 57478, "creation_time": "2015-01-21T21:49:34Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 57478, "is_private": false, "text": "Thanks for the reply.\n> Bugzilla is not a discussion for design descisions. This belongs on the dev\n> list.\n> \nI think this is a performance issue, so I posted it here. Or should I send it to dev@tomcat.apache.org\n\n> For the record, I think the kind of change you are suggesting is wrong and\n> is based on a superficial understanding of the code.\nCould you elaborate a bit? Don't you think invoking \"Future.get()\" immediately after starting the task has the same effect as sequential execution? Is there any better suggestions?", "id": 180453, "time": "2015-01-21T22:01:44Z", "creator": "yu.lin.86@gmail.com", "creation_time": "2015-01-21T22:01:44Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "chuck.caldarale@unisys.com", "text": "What part of \"belongs on the dev list\" was not clear?", "id": 180454, "time": "2015-01-21T22:05:46Z", "bug_id": 57478, "creation_time": "2015-01-21T22:05:46Z", "is_private": false, "attachment_id": null}]