[{"count": 0, "tags": [], "bug_id": 57483, "text": "Keep-Alive is defined for HTTP/1.0, not 1.1; sending it from a server on a 1.1 connection is just wasting bytes.\n\nIdeally, Apache wouldn't send either Connection: keep-alive or the Keep-Alive header field  on 1.1 connections at all; at the very least, it should be configurable.", "id": 180467, "time": "2015-01-22T08:41:25Z", "creator": "mnot@mnot.net", "creation_time": "2015-01-22T08:41:25Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 57483, "text": "Keep-Alive header indicates KeepAliveTimeout.\nSome browsers (at least Firefox) read it and avoid a race condition about KeepAliveTimeout.\nSo -0.5 for simply omit Keep-Alive header.", "id": 180477, "time": "2015-01-22T12:34:48Z", "creator": "takashi.asfbugzilla@tks.st", "creation_time": "2015-01-22T12:34:48Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "The Keep-Alive response header is a hint which may be used by browsers to determine how many requests (max=) and how long connections (timeout=) will be kept alive by the server.\nIt may prevent them from sending requests too late, so this is a valuable information IMHO (I don't know if browsers use it though, but they ought to...).\n\nIndeed HTTP/1.1 does not define Keep-Alive as such, but says any header Connection's token used as a header is hop-by-hop (ie. not forwardable and possibly ignored if not understood), and so is Keep-Alive.\n\n\"Connection: keep-alive\" is the default in HTTP/1.1, so it may not be needed unless the header Keep-Alive is also there.", "attachment_id": null, "id": 180478, "creator": "ylavic.dev@gmail.com", "time": "2015-01-22T12:49:39Z", "bug_id": 57483, "creation_time": "2015-01-22T12:49:39Z", "is_private": false}, {"count": 3, "tags": [], "text": "True, but FF et al don't *need* that header; some sites will want to omit the header to save bytes on the header (e.g., search StackOverflow). Some control would be nice.", "attachment_id": null, "id": 180492, "creator": "mnot@mnot.net", "time": "2015-01-23T00:50:19Z", "bug_id": 57483, "creation_time": "2015-01-23T00:50:19Z", "is_private": false}, {"count": 4, "tags": [], "text": "Some random notes I am throwing in here after doing some debugs this weekend:\n\n1. It is _not_ needed (nor \"defined by the protocol\") to send the \"Keep-Alive:\" response header - in fact other webservers don't even do that by default (IIS/Nginx)\n\n2. When building http-clients, it would be super bad practice to rely on \"headers\" and there are other better ways of knowing if a tcp connection is still live or not.\n\n3. While IIS and Nginx usually allow some milliseconds more than the timeout config, Apache usually falls a few milliseconds short, that means, if a http-client would rely on this header, it would assume still being able to use the connection while that wouldn't be anymore true.", "attachment_id": null, "id": 191396, "creator": "gunter@grodotzki.co.za", "time": "2016-06-05T16:58:54Z", "bug_id": 57483, "creation_time": "2016-06-05T16:58:54Z", "is_private": false}]