[{"count": 0, "tags": [], "bug_id": 57507, "attachment_id": null, "text": "Deploying new Context fails if the context file is already present in the catalina directory\n\nThis worked in 7.0.52, and does not work in 7.0.55 and 7.0.57.  I did not test the intervening verions to figure out which release introduced the issue.\n\nHere's how to reproduce:\n\n1) Start tomcat\n\n2) Place a new context file into the catalina context directory here:\n/var/lib/tomcat/conf/Catalina/localhost/test.xml\n\n3) Tell tomcat there's a new context:\nGoto URL: http://webserver/tomcat-manager-app/deploy?path=/test&config=file:///var/lib/tomcat/conf/Catalina/localhost/test.xml\"\n\n4) Deploy fails with this message:\nFAIL - Failed to deploy application at context path /test\n\nPreviously it would deploy fine.\n\nIt appears that deploying does not work if the source of your context file is it's final destination.  I traced a chunk of the code, and this is being caught by a generic \"something bad happened during the deploy\"... I didn't see any useful debug messages or why it's failing.  After it fails, it deletes the test.xml file.\n\nA work around would be to create a secure temporary directory to write the context files to and give that path to catalina.\n\nUnfortunately that workaround isn't terribly exciting for us for a few reasons:\n\n1) We need to be able to deploy context's when tomcat is not running, and we do that by writing the context file in directly\n\n2) Creating a single purpose secure temporary directory with the correct permissions, owner and group would be cumbersome to create and manage\n\n3) After tomcat copies the context file, we would need to manage the ownership and permissions of the context files.", "id": 180606, "time": "2015-01-28T01:03:55Z", "creator": "joekislos@gmail.com", "creation_time": "2015-01-28T01:03:55Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 57507, "text": "Hi,\n\nCan you post here also the configuration for the Host.\n\nYou can find it in server.xml Host element.\n\nThanks,\nVioleta", "id": 180636, "time": "2015-01-29T09:05:12Z", "creator": "violetagg@apache.org", "creation_time": "2015-01-29T09:05:12Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 57507, "text": "Just provide the context path to deploy (without specifying the file to deploy) and Tomcat will deploy it.", "id": 181534, "time": "2015-03-05T14:52:33Z", "creator": "markt@apache.org", "creation_time": "2015-03-05T14:52:33Z", "tags": [], "is_private": false}]