[{"count": 0, "tags": [], "text": "mod_ssl should support engine private keys, briefly -- use ENGINE_load_private_key.\n\nWe suggest when SSLCertificateKeyFile starts with \"engine:\" when it is interpreted as \"engine:%s:%s\" where first string is Crypto Device API (ENGINE) and second string is key in engine keyform.\n\nThe same functionality was recently added to nginx starting from 1.7.9, nginx patch is here: http://trac.nginx.org/nginx/changeset/2c33ed82cde140a5bc38938dbdd6e32534223925/nginx", "attachment_id": null, "id": 180619, "creator": "pdn@cryptopro.ru", "time": "2015-01-28T14:29:41Z", "bug_id": 57510, "creation_time": "2015-01-28T14:29:41Z", "is_private": false}, {"attachment_id": 32405, "tags": [], "creator": "pdn@cryptopro.ru", "is_private": false, "count": 1, "id": 180620, "time": "2015-01-28T14:32:22Z", "bug_id": 57510, "creation_time": "2015-01-28T14:32:22Z", "text": "Created attachment 32405\nEngine keyform patch"}, {"count": 2, "tags": [], "text": "Thanks for the patch - it would be a fairly superficial support for engine-based keys, though. If we really want to support this feature (so far, the SSLCryptoDevice is targeting the accelerator-only case), then we should consider adding a more flexible mechanism. See e.g.\n\nhttps://mail-archives.apache.org/mod_mbox/httpd-dev/200402.mbox/%3C1077205315.13155.15.camel%40dyn95394216.austin.ibm.com%3E\n\nand bug 42687, bug 42688 (or bug 51296, which specifically mentions SSLCryptoDeviceCtrl).", "attachment_id": null, "id": 180682, "creator": "asfbugz@velox.ch", "time": "2015-02-01T08:46:45Z", "bug_id": 57510, "creation_time": "2015-02-01T08:46:45Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 57510, "attachment_id": null, "id": 180724, "creation_time": "2015-02-03T13:00:31Z", "time": "2015-02-03T13:00:31Z", "creator": "pdn@cryptopro.ru", "text": "(In reply to Kaspar Brand from comment #2)\n> Thanks for the patch - it would be a fairly superficial support for\n> engine-based keys, though. If we really want to support this feature (so\n> far, the SSLCryptoDevice is targeting the accelerator-only case), then we\n> should consider adding a more flexible mechanism. See e.g.\n> \n> https://mail-archives.apache.org/mod_mbox/httpd-dev/200402.mbox/\n> %3C1077205315.13155.15.camel%40dyn95394216.austin.ibm.com%3E\n> \n> and bug 42687, bug 42688 (or bug 51296, which specifically mentions\n> SSLCryptoDeviceCtrl).\n\nFirst:\n\nOur patch provides exactly what is stated. Kaspar Brand said that this is \"fairly superficial support for engine-based keys\" but at this point of time Apache httpd can not load private keys from tokens at all.\n\nThis functionality is becoming more and more crucial over time. Our patch can simply add this functionality without any consequences. It can be upgraded later with a better solution if its needed.\n\nSecond:\n\nOur vision is that OpenSSL is preconfigured and SSLCertificateKeyFile just use ENGINE_by_id (and then ENGINE_load_private_key) for getting already initialized ENGINE (initialized by OpenSSL config).\n\nYour vision is that OpenSSL should be configured by Apache httpd, can you provide information why?", "is_private": false}, {"count": 4, "tags": [], "text": "Do you have an example of how this could be tested with an (open) engine?", "attachment_id": null, "id": 180800, "creator": "ylavic.dev@gmail.com", "time": "2015-02-05T15:53:21Z", "bug_id": 57510, "creation_time": "2015-02-05T15:53:21Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 57510, "text": "(In reply to Pichulin Dmitrii from comment #3)\n> at this point of time\n> Apache httpd can not load private keys from tokens at all.\n> \n> This functionality is becoming more and more crucial over time.\n\nThis is debatable. Looking at how few reactions there were to bug 42687 (and an accompanying thread on httpd-dev which ended here [1]), I remain sceptical about the urgency of such a feature. Generally speaking, I would mostly be in favor of having decent PKCS#11 support in mod_ssl, as I consider this a much less idiosyncratic way of supporting hardware-based keys than using custom per-token OpenSSL engines (I'm aware of engine_pkcs11, which at least provides indirect PKCS#11 support for OpenSSL).\n\n> Our patch\n> can simply add this functionality without any consequences. It can be\n> upgraded later with a better solution if its needed.\n\nI beg to differ. It amounts to what is sometimes called creeping featurism - from an httpd maintainer's point of view, adding such an option is not just a question of committing a few additional lines of code. It's about devising / deciding on a sensible solution for supporting token-based keys, documenting this feature, making sure it doesn't break with new httpd or OpenSSL releases etc.\n\n> Our vision is that OpenSSL is preconfigured and SSLCertificateKeyFile just\n> use ENGINE_by_id (and then ENGINE_load_private_key)\n\nRepurposing a directive which is clearly referring to \"File\" by its very name already suggests that this is a fairly hasty way of adding engine-based key support. The public-key part of the story is not addressed either - at least SSLCertificateFile would have to be taken into account, too.\n\n> Your vision is that OpenSSL should be configured by Apache httpd, can you\n> provide information why?\n\nBecause that's the approach mod_ssl takes for all other OpenSSL configuration things (SSLCipherSuite, SSLProtocol, etc., or the new SSLOpenSSLConfCmd for 1.0.2 and later). How OpenSSL is configured for the use by mod_ssl should be evident from the examination of the (self-contained) httpd configuration, and not depend on a potentially system-wide openssl.cnf file shared with other applications.\n\n[1] https://mail-archives.apache.org/mod_mbox/httpd-dev/200706.mbox/%3C46768DFB.3090708@ncipher.com%3E", "id": 180849, "time": "2015-02-08T06:34:57Z", "creator": "asfbugz@velox.ch", "creation_time": "2015-02-08T06:34:57Z", "is_private": false, "attachment_id": null}]