[{"text": "Hi,\nit seems that apache 2.4 creates a number of semaphores and shm segments larger than needed.\n\nWith a configuration of 50 virtual hosts, each having their own couple of proxy balancer pools, you can easily get more than 5000 semaphores and 5000 shm segments created.\nI had to tune the kernel parameters \"sem arrays\" and \"shmmni\" in order to accomodate that.\n\nI tried different configurations in order to understand deeply this behavior and I finally came up with the following conclusions:\n- all the vhosts containing at least one ProxyPass directive have a proportial correlation with the total amount of the above resources used.\n- all occurrences of the Proxy balancer directive have a proportial correlation with the total amount of the above resources used.\n- it doesnt seem to matter how the balancer pools are tied(configured) to each vhost. It seems enough to have any of the above conditions met one or multiple times. This is what makes me think that there's some kind of wasting reources bug here.\n\nI've came up with forumla to estimate the amount of semaphores and shm segments required to start up apache without failures:\nshm segments = (A + 1) * (B + 1)\nsemaphores = (A + 2 ) * B\nA is the number of vhosts with at least one ProxyPass directive\nB is the number of Proxy balancer pools\n\nMore observations\n- With such a configuration and fairly old box apache takes one minute to start:\nabout 30 seconds are needed to create the shm segments and additional 30 seconds are needed to create the semaphores.\n- During that time apache tries to process the incoming http requests failing, sometime crashing a child process\n\nPlease let me know if you need more information.\n\nRegards,\nFederico", "tags": [], "creator": "federico.mennite@lifeware.ch", "attachment_id": null, "count": 0, "id": 180831, "time": "2015-02-06T17:03:22Z", "bug_id": 57543, "creation_time": "2015-02-06T17:03:22Z", "is_private": false}, {"count": 1, "attachment_id": null, "bug_id": 57543, "is_private": false, "id": 181346, "time": "2015-02-26T10:43:37Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-02-26T10:43:37Z", "tags": [], "text": "Are you declaring the balancers in the main/global section (out of the virtual hosts)?\n\nIf so, I suggest moving each of them to the relevant vhost (this has been discussed in [1] on the users@ mailing list).\nYou could use mod_macro to still declare the balancers in the main section while specializing in the vhosts.\n\n[1] https://www.mail-archive.com/users%40httpd.apache.org/msg57501.html"}, {"count": 2, "tags": [], "bug_id": 57543, "text": "Hi,\nthanks for link to the interesting thread and help!\nI yes I was declaring them in the global section.\nI splitted each balancer in a separated file that I include with an Include directive in the interested vhosts.\n\nA side effect of this configuration is that I have to create a balancer manager entry fo every vhost in order to be able to manage them.\n\nQuestion. What happens if a single balancer is included by multiple vhosts (basically each vhosts point to a balancer that keeps the same name accross vhosts)? Is that going to be a sigle balancer from a logical point of view?\n\n\nThanks,\nFederico", "id": 181351, "time": "2015-02-26T15:39:53Z", "creator": "federico.mennite@lifeware.ch", "creation_time": "2015-02-26T15:39:53Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 57543, "text": "(In reply to Federico Mennite from comment #2)\n> I splitted each balancer in a separated file that I include with an Include\n> directive in the interested vhosts.\n> \n> A side effect of this configuration is that I have to create a balancer\n> manager entry fo every vhost in order to be able to manage them.\n\nI don't know how you create a \"balancer manager entry\", but something like :\n<Location /balancer-manager>\n    SetHandler balancer-manager\n    [...]\n</Location>\ncan be part of the Include'd file, it will still be per vhost.\n\nDepends on the specifics of [...] though.\nmod_macro is possibly a better alternative since it can take specific args (unlike Include).\n\n> \n> Question. What happens if a single balancer is included by multiple vhosts\n> (basically each vhosts point to a balancer that keeps the same name accross\n> vhosts)? Is that going to be a sigle balancer from a logical point of view?\n\nIndeed, the (logical) name is per vhost.", "id": 181368, "time": "2015-02-27T09:36:39Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-02-27T09:36:39Z", "tags": [], "is_private": false}, {"count": 4, "attachment_id": null, "bug_id": 57543, "is_private": false, "id": 181369, "time": "2015-02-27T09:38:29Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-02-27T09:38:29Z", "tags": [], "text": "(In reply to Yann Ylavic from comment #3)\n> I don't know how you create a \"balancer manager entry\", but something like :\n> <Location /balancer-manager>\n>     SetHandler balancer-manager\n>     [...]\n> </Location>\n> can be part of the Include'd file, it will still be per vhost.\n\nIt can even be global if there isn't any specific."}, {"count": 5, "tags": [], "bug_id": 57543, "text": "(In reply to Yann Ylavic from comment #3)\n> > Question. What happens if a single balancer is included by multiple vhosts\n> > (basically each vhosts point to a balancer that keeps the same name accross\n> > vhosts)? Is that going to be a sigle balancer from a logical point of view?\n> \n> Indeed, the (logical) name is per vhost.\n\nWhat I mean is that there will be a different balancer for each vhost, no share.", "id": 181371, "time": "2015-02-27T09:58:08Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-02-27T09:58:08Z", "is_private": false, "attachment_id": null}]