[{"count": 0, "tags": [], "bug_id": 57559, "attachment_id": null, "text": "Overview:\n\nIn a scenario where an original request contains part of the URI percent-encoded (e.g. /context/foo/%24/bar), when the request is put into asynchronous mode using ServletRequest.startAsync() and then dispatched using the no-argument AsyncContext.dispatch() method, the dispatch is incorrectly made to a percent-decoded URI (e.g. /context/foo/$/bar), not the original request URI.\n\nSteps to Reproduce:\n\nConsider the following servlet: https://gist.github.com/anonymous/957122b45ae656a5e8f1\nIt puts a request into asynchronous mode using ServletRequest.startAsync() and immediately dispatches it using the no-argument AsyncContext.dispatch() method. When the asynchronous dispatch takes place, the request URI is written to the response.\n\n1) Compile and deploy the servlet to http://localhost:8080/context\n2) Visit http://localhost:8080/context/foo/%24/bar (or any similar percent-encoded URI) in your browser\n\nActual Results:\n\nThe printed-out request URI is /context/foo/$/bar (i.e. the request has been dispatched to /context/foo/$/bar, a percent-decoded version of the original URI)\n\nExpected Results:\n\nThe printed-out request URI is /context/foo/%24/bar (i.e. the request should be dispatched to /context/foo/%24/bar, the original URI)\n\nAdditional Information:\n\nThe Java Servlet 3.0 Specification says: \"The dispatch method takes no argument. It uses the original URI as the path. If the AsyncContext was initialized via the startAsync(ServletRequest, ServletResponse) and the request passed is an instance of HttpServletRequest, then the dispatch is to the URI returned by HttpServletRequest.getRequestURI(). Otherwise the dispatch is to the URI of the request when it was last dispatched by the container.\"\n\nIt seems clear that the dispatch should be to the original request URI as obtained from HttpServletRequest.getRequestURI(), and the Javadoc of HttpServletRequest.getRequestURI() states that \"The web container does not decode this String.\" Therefore, it seems the asynchronous dispatch should not be made to a percent-decoded version of the original URI, but to the original URI as-is.", "id": 180907, "time": "2015-02-10T16:02:19Z", "creator": "cg.throwaway@mailinator.com", "creation_time": "2015-02-10T16:02:19Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57559, "text": "The specification text you quoted skips over a few things. The main one is how tricky it is to split an undecoded URI into contextPath, servletPath and pathInfo. See the getContextPath() implementation in [1] for an idea of just how messy this could get. I have no desire to see that sort of code in something that is meant to be a convenience method.\n\nElsewhere in the Servlet spec (including for async) dispatches are handled in terms of decoded paths relative to a context root. The convenience dispatch() methods needs to be handled the same way to avoid a whole pile of unnecessary complexity.\n\nIf you need the original request URI it is available via the usual request attribute.\n\nI'll raise this with the Servlet EG to see if the wording of this can be changed/improved but - as far as Tomcat is concerned - this is a WONTFIX. Note if the EG opt for the behavior you are asking for I'll re-open this issue.\n\nI've added a test case that confirms the observed behavior.\n\n\n[1] http://svn.apache.org/viewvc/tomcat/trunk/java/org/apache/catalina/connector/Request.java?view=annotate", "id": 180930, "time": "2015-02-10T22:54:01Z", "creator": "markt@apache.org", "creation_time": "2015-02-10T22:54:01Z", "is_private": false, "attachment_id": null}, {"count": 2, "text": "Previous discussion of this issue, ~8 months ago (June 2014):\n\n\"Decoded URL set on asynchronous request\"\nhttp://tomcat.markmail.org/thread/e33tqu7ayp2fguh4", "bug_id": 57559, "attachment_id": null, "id": 180935, "time": "2015-02-11T00:04:04Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-02-11T00:04:04Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 57559, "attachment_id": null, "is_private": false, "id": 181155, "time": "2015-02-18T21:17:47Z", "creator": "cg.throwaway@mailinator.com", "creation_time": "2015-02-18T21:17:47Z", "text": "(In reply to Konstantin Kolinko from comment #2)\n> Previous discussion of this issue, ~8 months ago (June 2014):\n> \n> \"Decoded URL set on asynchronous request\"\n> http://tomcat.markmail.org/thread/e33tqu7ayp2fguh4\n\nYeah, I did find this discussion but it wasn't very clear what conclusion you guys came to. There was talk of opening a bug but I couldn't find any when I searched so I figured I would open this one.\n\n(In reply to Mark Thomas from comment #1)\n> I'll raise this with the Servlet EG to see if the wording of this can be\n> changed/improved but - as far as Tomcat is concerned - this is a WONTFIX.\n> Note if the EG opt for the behavior you are asking for I'll re-open this\n> issue.\n\nThanks for the detailed reply. I'm still a bit confused about the outcome though... are you saying that this *is* a Tomcat bug but it won't be fixed (hence the WONTFIX resolution), or that it *isn't* a bug because you believe Tomcat's current behaviour is what the servlet spec intended, or something else entirely?"}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I believe - and discussions with the Servlet EG have confirmed that other EG members agree - that Tomcat's behaviour is as the specification intended. I'd normally close bugs like this as invalid but went for won't fix because the intended spec behaviour at the time was unclear.", "id": 181169, "time": "2015-02-19T08:55:30Z", "bug_id": 57559, "creation_time": "2015-02-19T08:55:30Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 57559, "text": "Thread from EG.", "id": 190493, "time": "2016-04-22T20:01:25Z", "creator": "markt@apache.org", "creation_time": "2016-04-22T20:01:25Z", "is_private": false, "attachment_id": null}, {"count": 6, "attachment_id": null, "bug_id": 57559, "is_private": false, "id": 190560, "time": "2016-04-26T13:03:17Z", "creator": "markt@apache.org", "creation_time": "2016-04-26T13:03:17Z", "tags": [], "text": "This time actually add the link.\n\nhttps://java.net/projects/servlet-spec/lists/jsr369-experts/archive/2015-02/message/18"}]