[{"count": 0, "attachment_id": null, "bug_id": 57578, "is_private": false, "id": 181020, "time": "2015-02-12T22:27:46Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2015-02-12T22:27:46Z", "tags": [], "text": "When MD5 is checked as response is not stored, no parsing can occur.\nSo checking anything in \"Embedded Resources from HTML files\" panel won't have any effect.\nI suggest we disable checkbox \"Retrieve All embedded resources\" when \"Save response as MD5 Hash\" is checked.\n\nBy the way, it seems HttpTestSampleGui uselessly implemented ItemListener as none of the addItemListeners in classes uses it. So I suggest we drop it adding this to \"Incompatible changes\" as subclasses may be impacted."}, {"count": 1, "attachment_id": null, "creator": "sebb@apache.org", "text": "(In reply to Philippe Mouawad from comment #0)\n> When MD5 is checked as response is not stored, no parsing can occur.\n\nIt could occur, but does not currently.\n\n> So checking anything in \"Embedded Resources from HTML files\" panel won't\n> have any effect.\n> I suggest we disable checkbox \"Retrieve All embedded resources\" when \"Save\n> response as MD5 Hash\" is checked.\n\nIf the user decides they then want to retrieve the embedded resources, won't this make it rather awkward for the user? They will have to disable Md5 first.\nAnd why should MD5 disable embedded but not the other way round?\n\nI think it would be better to just make a note in the manual.\n\nIt might be OK to deselect embedded (rather than disabling it) when selecting MD5 -- and vice versa.\n\nAlternatively, maybe the code _should_ still parse the responses, but replace the sample data with the MD5 when it is no longer needed. This will require more storage whilst the sample is being processed. The code should only store the full response if it needs to be parsed - i.e. images etc. would be converted to MD5 directly. It might be possible to parse the response as it is read, rather than waiting for it to be fully loaded first.\n\nHowever, this would change the test plan behaviour. There would need to be some way to disable it.\n\n> By the way, it seems HttpTestSampleGui uselessly implemented ItemListener as\n> none of the addItemListeners in classes uses it. So I suggest we drop it\n> adding this to \"Incompatible changes\" as subclasses may be impacted.\n\nThat belongs in a separate Bugzilla issue.", "id": 181032, "time": "2015-02-12T23:31:20Z", "bug_id": 57578, "creation_time": "2015-02-12T23:31:20Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 57578, "is_private": false, "text": "(In reply to Sebb from comment #1)\n> (In reply to Philippe Mouawad from comment #0)\n> > When MD5 is checked as response is not stored, no parsing can occur.\n> \n> It could occur, but does not currently.\n> \n> > So checking anything in \"Embedded Resources from HTML files\" panel won't\n> > have any effect.\n> > I suggest we disable checkbox \"Retrieve All embedded resources\" when \"Save\n> > response as MD5 Hash\" is checked.\n> \n> If the user decides they then want to retrieve the embedded resources, won't\n> this make it rather awkward for the user? They will have to disable Md5\n> first.\n> And why should MD5 disable embedded but not the other way round?\n> \n> I think it would be better to just make a note in the manual.\nOk, why not. I created this bugzilla as I was not aware of this behaviour. I still believe sometimes it's better that UI makes the right decision which in this case it to indicate in a way that embedded resources won't be downloaded.\n\n> \n> It might be OK to deselect embedded (rather than disabling it) when\n> selecting MD5 -- and vice versa.\n> \n> Alternatively, maybe the code _should_ still parse the responses, but\n> replace the sample data with the MD5 when it is no longer needed. This will\n> require more storage whilst the sample is being processed. The code should\n> only store the full response if it needs to be parsed - i.e. images etc.\n> would be converted to MD5 directly. It might be possible to parse the\n> response as it is read, rather than waiting for it to be fully loaded first.\n\nSeems better to me indeed.\n> \n> However, this would change the test plan behaviour. There would need to be\n> some way to disable it.\nWhy not when it's enabled.\n> \n> > By the way, it seems HttpTestSampleGui uselessly implemented ItemListener as\n> > none of the addItemListeners in classes uses it. So I suggest we drop it\n> > adding this to \"Incompatible changes\" as subclasses may be impacted.\n> \n> That belongs in a separate Bugzilla issue.\n\nDone in Bug 57586", "id": 181090, "time": "2015-02-15T17:39:54Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2015-02-15T17:39:54Z", "attachment_id": null}]