[{"count": 0, "tags": [], "bug_id": 5758, "text": "Hi all-\n\nI am trying to do server side includes- I've enabled them successfully in \ncatalina and have done some simple tests.  However, there are two types of <!--\ninclude virtual=\"path\"--> that are failing.  The first is when the included \nfile is an image- the binary bytes are inserted directly into the page.\n\nThe second, and most important from my perspective, is when \"path\" represents a \nservlet. Even if the servlet is in the application with the page, it won't \nlaunch.  I looked at the class org.apache.catalina.util.ssi.SsiInclude and the \ngetStream method is preventing this- before the RequestDispatcher is called, it \ndoes a check:\n\n  if(SsiMediator.servletContext.getResource(path) != null)\n\nThis prevents the dispatch from calling a servlet because it won't show up as a \nresource.\n\nBut here it gets weird- I decompiled the class and commented out this check, \nbut it still never invokes the servlet. Yet if I make my own JSP page that \ncalls a dispatcher to the exact same uri, it works perfectly. So *something* \ninside the SsiInvoker implementation prevents a dispatch to a servlet in any \ncase!\n\nThanks!\n\n-Richard", "id": 9476, "time": "2002-01-08T17:25:35Z", "creator": "rasand@attglobal.net", "creation_time": "2002-01-08T17:25:35Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 5758, "text": "Can you please try it with the latest version?  I'm not sure it\nwill work now, but I pretty much rewrote all of those classes and\nthe line you mention in SsiInclude no longer exists in the latest\nversion.\n\nBy the way, what should a direct include of an image file do?  I\ntried to keep the functionality the same as the real mod_include in \nApache, but I admit that's not a case that occurred to me.  I'm not\nsure what the expected behavior for including binary files is.\n\n-Paul", "id": 9477, "time": "2002-01-08T18:18:01Z", "creator": "pspeed@progeeks.com", "creation_time": "2002-01-08T18:18:01Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "pspeed@progeeks.com", "attachment_id": null, "is_private": false, "id": 9478, "time": "2002-01-08T18:33:18Z", "bug_id": 5758, "creation_time": "2002-01-08T18:33:18Z", "text": "Actually, I take my previous comment about not being sure back.\nThe latest version should work because the whole reason I started\nthe rewrite was to support including .shtml pages from within other\n.shtml pages.  And as you know, .shtml pages are handled by a \nservlet.  Therefore, the lastest version should work.\n\nImages will be included as raw data in the HTML output, but I\nthink this is correct behavior.  I'm not sure what the use-case\nis that a standard IMG tag doesn't cover.\n\n-Paul"}, {"count": 3, "tags": [], "bug_id": 5758, "attachment_id": null, "text": "SSI-including an image should stick binary into the resulting html.  As for the\nproblem with including servlets, that should be fixed in the head revision.", "id": 19381, "time": "2002-07-12T10:09:56Z", "creator": "x@cs.stanford.edu", "creation_time": "2002-07-12T10:09:56Z", "is_private": false}]