[{"count": 0, "tags": [], "creator": "sbuberl@gmail.com", "attachment_id": null, "text": "I'm trying to find all shapes, pictures, diagrams, etc in a Word .doc file.  I can find shapes using the escher records from my OfficeDrawing.  But there is a Smart Art digram, but that returns null from, because the parent is not a SpContainer.  Can you fix this method to handle both cases or add a new one that works with diagrams?\n\nThanks.", "id": 181156, "time": "2015-02-18T21:39:15Z", "bug_id": 57596, "creation_time": "2015-02-18T21:39:15Z", "is_private": false}, {"count": 1, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "text": "Can you attach a sample file and code that you tried? Idealy as self-sufficient unit-test.", "id": 189966, "time": "2016-04-05T12:26:39Z", "bug_id": 57596, "creation_time": "2016-04-05T12:26:39Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 57596, "attachment_id": null, "id": 189995, "time": "2016-04-06T04:07:53Z", "creator": "sbuberl@gmail.com", "creation_time": "2016-04-06T04:07:53Z", "is_private": false, "text": "(In reply to Dominik Stadler from comment #1)\n> Can you attach a sample file and code that you tried? Idealy as\n> self-sufficient unit-test.\n\nThis was 14 months ago when I was still working at my last job (and cared about this issues).  I have forgooten the exact details.  In either getting the diagram from OfficeDiagrams or getting the picture data or something, it would only allow diagram whose parents where SPContainers.  But that doesn't apply to SmartArt so whichever method was returned NULL.\n\nWe were trying to find all text in documents, no matter if paragraph, shape, whatever and order them to something resembling to top to bottom.  We tried all an API method until we discovered API was lacking things we needed so did most of the work in the OOXML itself and found a solution tht fit our needs."}, {"count": 3, "tags": [], "creator": "oytuntez@gmail.com", "text": "I think this may be about XSLFRelation class not providing a DIAGRAM relation. In PowerPoint files, SmartArt is kept under `./ppt/diagrams` and there is not relation to that in this class.\n\nInitially, for us, Tika was not parsing `./diagrams` directory. Following the trail, I came here and this may be the issue why Tika is not supporting `diagrams`.\n\nTika issue: https://issues.apache.org/jira/browse/TIKA-1945", "id": 199107, "attachment_id": null, "bug_id": 57596, "creation_time": "2017-06-08T15:14:48Z", "time": "2017-06-08T15:14:48Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 57596, "attachment_id": null, "id": 199108, "time": "2017-06-08T15:32:26Z", "creator": "apache@gagravarr.org", "creation_time": "2017-06-08T15:32:26Z", "is_private": false, "text": "If someone could create very small sample PPTX and DOC/DOCX files, with these kinds of escher drawings in, we can use those to fix the problem + add unit tests to verify the fix\n\n(Quite possibly it may need two fixes, one for PowerPoint and one for Word)"}]