[{"count": 0, "tags": [], "bug_id": 57627, "attachment_id": 32516, "text": "Created attachment 32516\nProject with nested tags\n\nWe have a setup as follows:\n- Web project, which contains the necessary JSPs.\n- Common project, which contains our common code, but also some generic tags. These tags are defined as regular JSP tagfiles. This one is included as a JAR in the web project.\n- Struts library as dependency, the Struts tags are referenced from the JSP pages, but more specifically also from our tagfiles.\n\nThe problem we experience is that our JSP pages are always recompiled. Even if nothing is changed in the backend (JSP or library).\n\nBased on our debugging session we found out that, during Java code generation of the JSP file, Tomcat correctly records the timestamp of our JSP files and the common project's JAR file. However, the Struts JARs have all a timestamp of '-1'.\n\nWe came to the point of the JspCompilationContext, the method getLastModified, which is used to get the timestamp of these JARs or JSP files. This works correctly for the JSPs, and also for the Common JAR, but not for the Struts JAR.\n\nThe metohd gets called with the path of the JAR, but the tagJar variable is filled with the Common JAR's path. It then attempts to get the timestamp of the struts JAR inside the Common JAR, which obviously won't work as that JAR is part of our WAR directly. \n\nA workaround we apply is to disable the development mode for the JSP servlet and then the problem disappears.\n\nI've attached a project which reproduces the issue at our side.\n\nWe experience this even with our older Tomcat 6 installations.", "id": 181286, "time": "2015-02-24T07:22:51Z", "creator": "kenny.moens@cipal.be", "creation_time": "2015-02-24T07:22:51Z", "is_private": false}, {"count": 1, "text": "Thanks for the report the the test case. Bug reports like this are a pleasure to work with - mainly because they take so much less time to resolve.\n\nI was able to reproduce the problem with trunk and 8.0.x and I have fixed it for both of these branches. It will be included in 8.0.21 onwards.\n\nThe test case does not demonstrate an issue on 7.0.x or 6.0.x. If you still see issues on either of these platforms with the latest stable release of each then please open a separate Bugzilla issue and we'll take a look.", "bug_id": 57627, "attachment_id": null, "id": 181560, "time": "2015-03-06T19:45:31Z", "creator": "markt@apache.org", "creation_time": "2015-03-06T19:45:31Z", "tags": [], "is_private": false}]