[{"count": 0, "tags": [], "text": "Created attachment 32519\nChange the default to something that seems valid\n\nIt passes \"all\" which is not valid if you read acinclude.m4.\n\nThis patch changes it to the undocumented maybe-all which seems to be the closest one to what I imagine \"all\" would mean.", "is_private": false, "id": 181307, "creator": "pterjan@linuxfr.org", "time": "2015-02-24T19:00:14Z", "bug_id": 57632, "creation_time": "2015-02-24T19:00:14Z", "attachment_id": 32519}, {"count": 1, "tags": [], "bug_id": 57632, "text": "This seems to have been the rationale: http://svn.apache.org/viewvc?view=revision&revision=1396440", "id": 181308, "time": "2015-02-24T19:11:25Z", "creator": "covener@gmail.com", "creation_time": "2015-02-24T19:11:25Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "pterjan@linuxfr.org", "attachment_id": null, "id": 181311, "time": "2015-02-24T20:42:01Z", "bug_id": 57632, "creation_time": "2015-02-24T20:42:01Z", "is_private": false, "text": "Anything other than \"yes|static|shared\" will have the wanted effect of setting _apmod_required=\"no\", but \"all\" is not an expected value.\n\nOther expected values are:\n- \"most\" which only tries to enable it if \"most\", \"all\" or \"reallyall\" modules are requested\n- \"maybe-all\" which only tries to enable it if \"all\" or \"reallyall\" modules are requested\n- \"no\" which only tries to enable it if \"reallyall\" modules are requested\n\nEverything else is not explicitely handled andjust going through the != \"no\". This means in particular that it is not set to $module_default (static or shared) but always shared.\n\n\"maybe-all\" is actually what is used if an empty argument is passed, and means \"disabled under default, most. enabled explicitly or with all.\"\n\nSo this patch causes a change as it will not be enabled if people request \"none\", \"few\"or \"most\" modules while it currently is (which seems wrong for \"none\" and \"few\").\n\nChanging it to \"most\" or \"\" may be better but current value is wrong."}]