[{"count": 0, "tags": [], "bug_id": 57688, "attachment_id": null, "id": 181666, "time": "2015-03-11T12:53:47Z", "creator": "dyptorden@yahoo.com", "creation_time": "2015-03-11T12:53:47Z", "is_private": false, "text": "After defining a test plan and including a Simple Data Writer to save the results to a file, the selections on the \"Sample Result Save Configuration\" are not saved with the script, and everytime values are read from jmeter.properties. Also, when runing the JMeter from command line, and writing results to a jtl we get the same result as in the previous case : jtl is created according to the properties defined in jmeter.properties.\n\nThe problem is that I need to:\n1.Run JMeter from command line.\n2.Obtain a JTL (CSV format) for successes. - due to the fact that I only need to aggregate the results.\n3.Obtain a JTL (XML format) for errors. - due to the fact that I need to debug the errors\n\nIf the checkboxes flags in \"Sample Result Save Configuration\" would be saved along with the script, for each Simple Data Writer, case would be solved.\n\nSorry for the not-so-technical description for this bug :) ."}, {"count": 1, "tags": [], "bug_id": 57688, "attachment_id": null, "id": 181667, "time": "2015-03-11T12:58:23Z", "creator": "dyptorden@yahoo.com", "creation_time": "2015-03-11T12:58:23Z", "is_private": false, "text": "My test plan consists of:\n- 4 thread groups\n- 2 jtls per thread group : 1 with successes, 1 with successes+errors\n- 2 jtls at test plan level : 1 with successes, 1 with successes+errors\n\na total of 10 files"}, {"count": 2, "tags": [], "text": "The settings ARE saved to the JMX file; I've just tried.\nBesides there would be a lot more complaints if that did not work.\n\nIt's not clear what the problem is here; I suggest you reinstall JMeter and try again. If it still does not work, please seek help on the JMeter user list first.", "attachment_id": null, "bug_id": 57688, "id": 181702, "time": "2015-03-12T15:36:06Z", "creator": "sebb@apache.org", "creation_time": "2015-03-12T15:36:06Z", "is_private": false}]