[{"count": 0, "tags": [], "bug_id": 5769, "text": "We've encountered a problem with the way jk_nt_service.c creates nt services.\n\nSpecifically, the call to CreateService uses the name passed in for the service \nas both the service name and the service display name.  This is a problem \nbecause there are restrictions on the service name that do not apply to the \ndisplay name.  The MS documentation states that neither forward nor back slashes \nare allowed but in practice I have found that other characters cause problems as \nwell.\n\nFor example, if you create a service via jk_nt_service -i \"My Service\" \nwrapper.properties the service creates just fine but it fails to start.\n\nSince the MS source is not readily available we can't check on what the REAL \nrules are for the internal service name.\n\nTo be safe, a solution I have used in the past is to treat the name passed in \nvia the command line as the display name, and then remove all non-alphanumeric \ncharacters to generate the internal service name.\n\nThis is cheap, but might cause trouble if you are unlucky enough to have \nmultiple service display names mapping to a single internal name as in \"My \nService 1.1\" and \"My Service 11\".\n\nAn alternative that fixes this is to convert non alphanumerics to their hex \nrepresentation.\n\nI will attach patches for both approaches - option1 removes non alphanumerics \nfrom the display name while option2 encodes them.", "id": 9489, "time": "2002-01-09T12:11:05Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-09T12:11:05Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 5769, "attachment_id": 983, "id": 9490, "time": "2002-01-09T12:12:15Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-09T12:12:15Z", "is_private": false, "text": "Created attachment 983\nRemoves non alphanumerics to generate internal service id"}, {"count": 2, "tags": [], "bug_id": 5769, "attachment_id": 984, "id": 9491, "time": "2002-01-09T12:12:49Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-09T12:12:49Z", "is_private": false, "text": "Created attachment 984\nencodes non alphanumerics to generate internal service id"}, {"count": 3, "tags": [], "bug_id": 5769, "text": "Ultimately, the display name and service name should be specified independently. \nThe previously posted patches were aimed at a compromise that would avoid having \nto change the command line but allow nicer display names.  However, that makes \nthe service name look a bit goofy.  An even better patch for this would modify \nthe command line arg to take both a service name and a display name.  I'll see \nif I can submit another patch along these lines.", "id": 9827, "time": "2002-01-24T00:19:24Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-24T00:19:24Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 5769, "attachment_id": 1068, "id": 9902, "time": "2002-01-25T02:02:19Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-25T02:02:19Z", "is_private": false, "text": "Created attachment 1068\nSimply adds a cmd line arg to let the display name be different from the service name."}, {"count": 5, "tags": [], "bug_id": 5769, "attachment_id": 1071, "text": "Created attachment 1071\nImproved option 3. Forgot to update the usage message.", "id": 9924, "time": "2002-01-25T17:38:10Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-25T17:38:10Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 5769, "attachment_id": null, "text": "Your latest patch has been applied and will appear in Tomcat 3.3.1-rc1.  Thanks.", "id": 11276, "time": "2002-02-28T03:34:15Z", "creator": "Larry.Isaacs@sas.com", "creation_time": "2002-02-28T03:34:15Z", "is_private": false}]