[{"count": 0, "tags": [], "bug_id": 57701, "attachment_id": null, "id": 181729, "creation_time": "2015-03-13T13:52:21Z", "time": "2015-03-13T13:52:21Z", "creator": "knst.kolinko@gmail.com", "text": "In Tomcat manager HTML interface for each web application (except the Manager app itself) there is a \"Reload\" button. I think that it would be nice to add a \"Redeploy\" button there, that will allow to trigger a redeployment of a web application.\n\nCurrently if the server is configured with autoDeploy=\"true\", the redeployment can be triggered by touching the context file of the application (or the global conf/context.xml file if the application does not have one and does not have a war file). If autoDeploy=\"false\" you are out of this option.\n\nI expect the behaviour of this feature to be effectively the same as the one caused by touching the context file.  I would like this to be available in Tomcat 7.\n\nDocumentation:\nhttp://tomcat.apache.org/tomcat-7.0-doc/config/automatic-deployment.html#Modified_files", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57701, "is_private": false, "text": "Created attachment 32741\nPatch to provide \"redeploy\" button on Tomcat Web Application Manager.", "id": 183005, "time": "2015-05-18T01:31:19Z", "creator": "boaglio@gmail.com", "creation_time": "2015-05-18T01:31:19Z", "attachment_id": 32741}, {"count": 2, "tags": [], "creator": "boaglio@gmail.com", "attachment_id": null, "is_private": false, "id": 183006, "time": "2015-05-18T01:33:40Z", "bug_id": 57701, "creation_time": "2015-05-18T01:33:40Z", "text": "Patch to provide \"redeploy\" button on Tomcat Web Application Manager. \n\nI hope you like it =)"}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 183110, "time": "2015-05-26T19:05:06Z", "bug_id": 57701, "creation_time": "2015-05-26T19:05:06Z", "is_private": false, "text": "I'm not convinced of the need for this feature but I don't object to it being added.\n\nOverall the patch looks good. There is the odd s/reload/redploy/ required but that looks like copy/paste errors and is easily fixed.\n\nI'm more concerned that the actual redeploy code is not correct. The issues I could see from a code inspection (I haven't tried applying the patch) are:\n - it assumes that the web application is deployed as a WAR\n - it assumes autoDeployment is enabled\n - it doesn't mark the web application as being serviced\n\nI'd expect to see the following:\n - the context marked as serviced\n - the context removed from the host\n - check() being used to redeploy it\n - the serviced mark removed from the host"}, {"count": 4, "tags": [], "bug_id": 57701, "attachment_id": null, "id": 184466, "time": "2015-08-11T09:28:47Z", "creator": "kinow@apache.org", "creation_time": "2015-08-11T09:28:47Z", "is_private": false, "text": ">I'm not convinced of the need for this feature but I don't object to it being added.\n\nI used to see some Spring applications keeping objects in memory, and sometimes I had to restart Tomcat or redeploy the application. It was some years ago, and I don't have any Spring application in a Tomcat server (running mostly REST apps with Jersey), but maybe it would be a valid use case for this patch? Just my 0.02 cents"}, {"count": 5, "text": "Created attachment 34076\nPatch to provide \"redeploy\" functionality in Tomcat Manager\n\nThis patch is based on the work of Fernando Boaglio but addresses the issues raised by Mark Thomas. Removing the context from the host (as in, host.removeChild) was not sufficient, as the logic invoked by check() deals with protected/private members of a hostConfig. To complete this functionality, I saw no better option than to expose a public version of HostConfig.undeploy.\n\nIn addition to redeploy support in the HTML manager, this patch adds the redeploy command to the text manager and a redeploy ant task for the ant-based text manager wrapper. Maintaining consistency between these closely related utilities seems to be a more coherent update than just literally fulfilling the feature request.\n\nSince the issue parameters state Tomcat 8.0, I worked from 8.0.x trunk. However, I share the OP's wish to see this feature in Tomcat 7. Is there a \"right\" way to try to facilitate this? For instance, would it be at all appropriate to re-mark the issue pertinent to 7 and instead provide a patch (which might be identical) for that version?", "bug_id": 57701, "is_private": false, "id": 192697, "time": "2016-07-28T17:30:57Z", "creator": "dilexie@gmail.com", "creation_time": "2016-07-28T17:30:57Z", "tags": [], "attachment_id": 34076}, {"count": 6, "tags": [], "creator": "dilexie@gmail.com", "attachment_id": 34079, "id": 192712, "time": "2016-07-29T13:16:02Z", "bug_id": 57701, "creation_time": "2016-07-29T13:16:02Z", "is_private": false, "text": "Created attachment 34079\nPatch to provide \"redeploy\" functionality in Tomcat Manager (Amended)\n\nApologies, the patch I previously uploaded was generated with the new source file for RedeployTask not added. This amendment fixes that. See above for other notes."}]