[{"count": 0, "tags": [], "bug_id": 57710, "attachment_id": null, "is_private": false, "id": 181777, "time": "2015-03-15T14:12:54Z", "creator": "peter@pramberger.at", "creation_time": "2015-03-15T14:12:54Z", "text": "I recently got the requirement to log all X-* headers in some sort of \"mass-hosting\" setup, where the header names are not known beforehand.\n\nUnfortunately this is something not possible yet. While mod_log_forensic provides the possibility to dump headers, it is limited to all the request headers (sent by client), and which headers to log is not configurable.\n\nSo it would be great to allow for the use of wildcards in the %{...}i and %{...}o log formats.\n\nFortunately find_multiple_headers() in mod_log_config.c does already most of the work required for this, so extending it is not a big issue. Please have a look at the attached patches, they should apply cleanly to the 2.4 and 2.2 branches.\n\nUsing wildcards will prefix its header value with the header name, while non-wildcard header names keep the ususal value-only output. For example using LogFormat \"\\\"%{*}o\\\"\" to log all response headers would produce something like this in the access log:\n\n\"Vary: User-Agent, Content-Length: 4330, Keep-Alive: timeout=60, max=100, Connection: Keep-Alive, Content-Type: text/html; charset=ISO-8859-1\"\n\nNote that I tried to keep the overhead as low as possible for the usual non-wildcard use case, but there is probably room for optimization.\n\nWould be great if you could review the patches (luckily the logging infrastructure in 2.2 and 2.4 is identical in this case) and maybe include them in the 2.2 and 2.4 branches."}, {"count": 1, "tags": [], "bug_id": 57710, "text": "Created attachment 32571\nPatch for 2.2", "id": 181778, "attachment_id": 32571, "creator": "peter@pramberger.at", "creation_time": "2015-03-15T14:13:39Z", "time": "2015-03-15T14:13:39Z", "is_private": false}, {"count": 2, "tags": [], "text": "Created attachment 32572\nPatch for 2.4", "is_private": false, "bug_id": 57710, "id": 181779, "time": "2015-03-15T14:14:06Z", "creator": "peter@pramberger.at", "creation_time": "2015-03-15T14:14:06Z", "attachment_id": 32572}, {"count": 3, "attachment_id": null, "creator": "peter@pramberger.at", "text": "BTW: It would also be nice to allow for case-insensitive matching, but I've no idea how to encode this in the log format options...", "id": 181781, "time": "2015-03-15T14:35:46Z", "bug_id": 57710, "creation_time": "2015-03-15T14:35:46Z", "tags": [], "is_private": false}]