[{"count": 0, "tags": [], "bug_id": 57711, "attachment_id": null, "id": 181786, "time": "2015-03-15T20:52:35Z", "creator": "slaurent@apache.org", "creation_time": "2015-03-15T20:52:35Z", "is_private": false, "text": "Tomcat should support the X-Forwarded-Host http header in order for applications to be able to output absolute URLs in their response without requiring any reverse-proxy to perform response body rewriting.\n\nHere is my motivation :\nUntil recently, I was using a reverse proxy (apache httpd) in front of tomcat and forwarding requests to tomcat on http. I was using ProxyPreserveHost=On so that the Host: header coming in tomcat was the actual host used by clients and thus request.getRequestURL() returned the URL from the initial client point of view.\nThen recently for various reasons I had to setup 2 reverse proxies in chain in front of tomcat. Because SSL is used between the two reverse proxies, the ProxyPreserveHost=On trick no longer works.\nIndeed, it would require the second reverse proxy to also have a certificate matching the first reverse proxy which is not very practical. A request for enhancement has been proposed to httpd [1] but it's still open since 2013...\n\nBack in 2011, this discussion [2] proposed to add support for X-Forwarded-Host header to tomcat and markt seemed to agree on it.\nI'll try to work on a patch to RemoteIPValve in the next weeks...\n\n[1] https://bz.apache.org/bugzilla/show_bug.cgi?id=54656\n[2] http://tomcat.10.x6.nabble.com/RemoteIpValve-advices-td2192230.html"}, {"count": 1, "attachment_id": null, "creator": "knst.kolinko@gmail.com", "is_private": false, "id": 181788, "time": "2015-03-15T21:18:06Z", "bug_id": 57711, "creation_time": "2015-03-15T21:18:06Z", "tags": [], "text": "RemoteIpFilter as well?\n\nHave you considered just setting \"proxyName\" attribute on Connector?\nhttp://tomcat.apache.org/tomcat-7.0-doc/proxy-howto.html"}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 181790, "time": "2015-03-15T23:43:01Z", "bug_id": 57711, "creation_time": "2015-03-15T23:43:01Z", "is_private": false, "text": "\n\n*** This bug has been marked as a duplicate of bug 57665 ***"}]