[{"count": 0, "tags": [], "creator": "ateles.belzebuth.hybridus+apache@gmail.com", "attachment_id": null, "id": 181825, "time": "2015-03-16T21:01:15Z", "bug_id": 57717, "creation_time": "2015-03-16T21:01:15Z", "is_private": false, "text": "The HTTP Sampler does not check the server certificate during the TLS handshake. This behavior opens the connection to man-in-the-middle attacks. While this behavior is acceptable for test scenarios where security is not a concern, it can become a serious problem in a productive environment; e.g. if JMeter is used for performance monitoring of a web application.\nCan you add a switch (checkbox or jmeter property) that allows enabling certificate checks?\n\nBest regards, @"}, {"attachment_id": null, "tags": [], "bug_id": 57717, "is_private": false, "count": 1, "id": 181827, "time": "2015-03-17T01:39:49Z", "creator": "sebb@apache.org", "creation_time": "2015-03-17T01:39:49Z", "text": "JMeter was deliberately coded to ignore SSL certificate checks (and host names) so as to allow testing more sites.\n\nJMeter is not intended for use as part of a production system, though of course it can be used to test production systems. So security is not really a concern.\n\nHaving said that, it might well be useful to enable stricter SSL checking. There are various ways that this could be implemented.\n\nThere are several checks that can be implemented:\n- hostname\n- certificate chain\n- expiry date\n- certificate type\n\nThere are also at least two ways to handle checks that fail:\n- log a warning\n- fail the sample with an error"}, {"count": 2, "tags": [], "creator": "ateles.belzebuth.hybridus+apache@gmail.com", "attachment_id": null, "id": 181852, "time": "2015-03-17T22:11:45Z", "bug_id": 57717, "creation_time": "2015-03-17T22:11:45Z", "is_private": false, "text": "(In reply to Sebb from comment #1)\n\n> JMeter is not intended for use as part of a production system, though of\n> course it can be used to test production systems. So security is not really\n> a concern.\n\nThis is what we do. We use JMeter to monitor productive servers. However, for various reasons the host running JMeter and the monitored servers aren't connected to the same LAN. So network security is a concern.\n\n> There are several checks that can be implemented:\n> - hostname\n> - certificate chain\n> - expiry date\n> - certificate type\n\nAll of them should be done. I hope Java offers library functions to perform this task, so the checks won't need to be implemented by JMeter itself.\n\n> There are also at least two ways to handle checks that fail:\n> - log a warning\n\nThis can be usefuly for debugging in a non-critical environment.\n\n> - fail the sample with an error\n\nTo obtain security, in case of an invalid certificate the connection must be shut down before any HTTP data (e.g. session cookie, login credentials) is transmitted."}]