[{"count": 0, "tags": [], "bug_id": 5773, "attachment_id": null, "id": 9495, "time": "2002-01-09T17:12:15Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-09T17:12:15Z", "is_private": false, "text": "Hi All,\n\nSome people I work with noticed that Tomcat was spitting out a web.xml \nvalidation error for their app, but only the first time they started up.  This \ngave them the impression that everything was ok the second time.\n\nWell, I looked around a bit and found that WebXmlReader writes out a \"validation \nmark\" (webxmlval.txt) in the work directory.  The timestamp of the validation \nmark is used as part of deciding whether to validate.  The thing is, this mark \nis written out even if web.xml was not valid so next time through validation is \nskipped.\n\nI'm not sure if this was done on purpose and I can even imagine an argument \nabout not nagging more than once.  Still, in our case the disappearance of the \nvalidation errors brought about false confidence.\n\nIn case this seems like a problem to anyone else, here's a patch that only \nwrites out the validation mark if the XML parsed without errors.  That way you \nkeep seeing the validation errors until you a) disable validation or b) fix the \noffending xml.\n\nInterestingly, this patch takes advantage of an unused boolean field in the \nerror handler.  Makes me wonder if somebody already thought of this but decided \nnot to deal with it.  Perhaps there was a good reason."}, {"count": 1, "tags": [], "bug_id": 5773, "attachment_id": 985, "text": "Created attachment 985\nupdates WebXmlReader so that it doesn't mask warnings", "id": 9496, "time": "2002-01-09T17:15:56Z", "creator": "dschreibman@etranslate.com", "creation_time": "2002-01-09T17:15:56Z", "is_private": false}, {"count": 2, "tags": [], "text": "As far as I can tell, this patch has already been commited. I haven't seen the\ncommit message (yet), so I don't know by whom. If my eyes are fooling me, please\nreopen.\n\nBojan", "is_private": false, "id": 9497, "creator": "bojan@binarix.com", "time": "2002-01-09T17:33:26Z", "bug_id": 5773, "creation_time": "2002-01-09T17:33:26Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "Larry.Isaacs@sas.com", "text": "I can confirm that this was committed by Bill Barker in Revision 1.16 of\nWebXmlReader.", "id": 9509, "time": "2002-01-10T06:39:35Z", "bug_id": 5773, "creation_time": "2002-01-10T06:39:35Z", "is_private": false, "attachment_id": null}]