[{"attachment_id": 32591, "tags": [], "creator": "jdh5259@gmail.com", "is_private": false, "count": 0, "id": 181995, "time": "2015-03-23T12:06:16Z", "bug_id": 57741, "creation_time": "2015-03-23T12:06:16Z", "text": "Created attachment 32591\nPatch for applying the enchancement described in the report. Adds a new init-param to the servlet configuration which will be used to trigger the error-page mechanism.\n\nA configuration parameter has been added to the CGIServlet to allow use of the error-page mechanism. Default configuration will maintain current functionality.\n\nCurrently, when the debug logging level is too low and there is an error executing the CGI script, a blank page is returned even if the corresponding error-page is configured correctly. This causes inconsistency with custom error-pages."}, {"count": 1, "tags": [], "bug_id": 57741, "is_private": false, "id": 183802, "creation_time": "2015-06-29T21:52:07Z", "time": "2015-06-29T21:52:07Z", "creator": "jdh5259@gmail.com", "text": "Is there anything additional that I need to do in order to have this patch either accepted or declined? I am curious because I have not seen any activity on this in the last three months.\n\nThanks.", "attachment_id": null}, {"count": 2, "tags": [], "text": "See http://markmail.org/message/l7d242gtzamednke\n\nIn short, this is waiting for a committer to take the time to think this request through and make sure that it makes sense.", "is_private": false, "bug_id": 57741, "id": 183803, "time": "2015-06-29T22:19:25Z", "creator": "markt@apache.org", "creation_time": "2015-06-29T22:19:25Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 57741, "text": "I'm seeing the same issue and it would be good to get this merged instead of having to build and deploy custom Tomcats", "id": 183909, "time": "2015-07-06T15:32:26Z", "creator": "philci52@aol.com", "creation_time": "2015-07-06T15:32:26Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 57741, "attachment_id": null, "id": 183913, "time": "2015-07-06T20:39:40Z", "creator": "markt@apache.org", "creation_time": "2015-07-06T20:39:40Z", "is_private": false, "text": "I've had a look at this request.\n\nI'm currently leaning towards using the debug level to determine whether to use setStatus() or sendError() rather than a new configuration setting. I'll document that setting debug >= 10 will disable custom error pages and show debug pages instead. Probably with a further comment not to use this setting in production. Looking at the docs, some further explanation of what the signfificant values for debug are (once I've worked them out) wouldn't go amiss either."}, {"count": 5, "tags": [], "creator": "markt@apache.org", "is_private": false, "id": 183962, "attachment_id": null, "bug_id": 57741, "creation_time": "2015-07-08T17:11:30Z", "time": "2015-07-08T17:11:30Z", "text": "As of 8.0.25, the CGI servlet will use the standard error page mechanism unless the debug attribute is 10 or less."}, {"count": 6, "tags": [], "bug_id": 57741, "text": "(In reply to Mark Thomas from comment #5)\n> As of 8.0.25, the CGI servlet will use the standard error page mechanism\n> unless the debug attribute is 10 or less.\n\nThanks Mark! Appreciate the help.", "id": 183968, "time": "2015-07-09T00:25:28Z", "creator": "jdh5259@gmail.com", "creation_time": "2015-07-09T00:25:28Z", "is_private": false, "attachment_id": null}]