[{"count": 0, "tags": [], "creator": "andrewlanecarr@gmail.com", "attachment_id": null, "id": 182095, "time": "2015-03-25T15:06:22Z", "bug_id": 57759, "creation_time": "2015-03-25T15:06:22Z", "is_private": false, "text": "keyAlias Definition from: \n\nhttps://tomcat.apache.org/tomcat-7.0-doc/config/http.html\n\nThe alias used to for the server certificate in the keystore. If not specified the first key read in the keystore will be used.\n\nWouldn't this lead you to believe if no alias is specified it will use the first key in the keystore?  This is not the case.\n\nSteps to recreate:\n\nCreate a keystore using the recommended method: \n\n%JAVA_HOME%\\bin\\keytool\" -genkey -alias tomcat -keyalg RSA\n\n(This will generate ${user.home}/.keystore if it does not exist.  If it does, specify the keystore value.)\n\nStart tomcat with the default SSL connector defined, no \"keyAlias\" value specified, and the keystore we created previous specified as the keystoreFile.\n\nIt will use the cert in the file.\n\nAdd another cert (specify different name and values to differentiate between the two) to the keystore with :\n\n%JAVA_HOME%\\bin\\keytool\" -genkey -alias tomcat2 -keyalg RSA\n\nShutdown and restart the tomcat instance.\n\nAccess the SSL site \"localhost:8443\", inspect the cert.  You will see it is not the first certificate in the keystore like the document leads you to believe, but the last one added, no matter how many you add."}, {"count": 1, "tags": [], "text": "(In reply to Andrew Lane Carr from comment #0)\n> keyAlias Definition from: \n> \n> https://tomcat.apache.org/tomcat-7.0-doc/config/http.html\n> \n> The alias used to for the server certificate in the keystore. If not\n> specified the first key read in the keystore will be used.\n> \n> Wouldn't this lead you to believe if no alias is specified it will use the\n> first key in the keystore?\n\nNo. The documentation states the first key read from the keystore is used. It makes no statements regarding the relationship between the order the keys were added to the store, the order the keys are stored in the store (if such a concept makes sense - depening on the keystore it may not) and the order the keys are read from the keystore. All of which will depend on the implementation.\n\nWe can add a note to the documentation to clarify the above to reduce the chances of future users making such invalid assumptions.\n\nGenerally, unless there is only a single key in the key store, it is advisable to specify an alias. This advice can be added to the docs as well.", "attachment_id": null, "bug_id": 57759, "id": 182166, "time": "2015-03-28T15:30:13Z", "creator": "markt@apache.org", "creation_time": "2015-03-28T15:30:13Z", "is_private": false}, {"count": 2, "text": "Fixed in trunk, 8.0.x (for 8.0.22 onwards), 7.0.x (for 7.0.62 onwards) and 6.0.x (for 6.0.44 onwards).", "bug_id": 57759, "is_private": false, "id": 182169, "time": "2015-03-28T17:04:55Z", "creator": "markt@apache.org", "creation_time": "2015-03-28T17:04:55Z", "tags": [], "attachment_id": null}, {"count": 3, "tags": [], "creator": "andrewlanecarr@gmail.com", "attachment_id": 32620, "id": 182171, "time": "2015-03-28T18:58:27Z", "bug_id": 57759, "creation_time": "2015-03-28T18:58:27Z", "is_private": false, "text": "Created attachment 32620\nProposed patch to the documentation.\n\nThis is my first time patching the documentation.  Should I have placed this patch somewhere else?"}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 182172, "time": "2015-03-28T20:53:35Z", "bug_id": 57759, "creation_time": "2015-03-28T20:53:35Z", "is_private": false, "text": "This is the right place and the patch looks good - it was just a couple of hours late.\n\nGenerally, patches should be against trunk and the committers will back-port them as necessary but any patch is helpful."}]