[{"attachment_id": null, "tags": [], "bug_id": 57750, "is_private": false, "count": 0, "id": 182049, "time": "2015-03-24T11:44:04Z", "creator": "roman.stobnicki@dialogic.com", "creation_time": "2015-03-24T11:44:04Z", "text": "We created a WebSocket between a browser (Chrome) and Mobicents ApacheTomcat Application Server. When network gets disconnected we expected to for our onClose() method to be called at some point now that the connection has been compromised. In the meantime we are going to implement ping-pong type of messaging but since WebSocket rides on TCP and it has its keep alive mechanism already there should be no need to do anything outside of it. Please advise and let me know if you need any additional information."}, {"attachment_id": null, "tags": [], "bug_id": 57750, "is_private": false, "count": 1, "id": 182053, "time": "2015-03-24T12:43:35Z", "creator": "markt@apache.org", "creation_time": "2015-03-24T12:43:35Z", "text": "Which WebSocket implementation?\nWhich connector?\n\nDepending on circumstances, Tomcat may not be informed of the network disconnection - in which case there is no way for Tomcat to call onClose()."}, {"count": 2, "tags": [], "creator": "chris@christopherschultz.net", "is_private": false, "text": "I seem to recall markt doing some work on this recently: you (Mark) weren't able to replicate a network drop by disconnecting your VMs network, but physically pulling the Ethernet cable from your laptop seemed to do the trick.\n\nCould this have been fixed /post/ 7.0.50?", "id": 182071, "time": "2015-03-24T19:28:15Z", "bug_id": 57750, "creation_time": "2015-03-24T19:28:15Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 57750, "attachment_id": null, "is_private": false, "id": 182074, "time": "2015-03-24T22:27:32Z", "creator": "markt@apache.org", "creation_time": "2015-03-24T22:27:32Z", "text": "Thanks Chris. I hadn't joined up those dots.\n\n*** This bug has been marked as a duplicate of bug 57546 ***"}, {"attachment_id": null, "tags": [], "bug_id": 57750, "is_private": false, "count": 4, "id": 182096, "time": "2015-03-25T17:57:30Z", "creator": "chris@christopherschultz.net", "creation_time": "2015-03-25T17:57:30Z", "text": "(In reply to Mark Thomas from comment #3)\n> Thanks Chris. I hadn't joined up those dots.\n> \n> *** This bug has been marked as a duplicate of bug 57546 ***\n\nFTR, bug #57546 was fixed in 7.0.59. Please upgrade and re-test."}, {"count": 5, "tags": [], "creator": "roman.stobnicki@dialogic.com", "text": "Sorry for late replay but update emails were caught in my spam :-)\n\nJust wanted to add that actually we did many tests and found out that TCP keep alive timers are only good between the \"hops\" and not end to end. So, implementing some sort of Ping/Pong mechanism one level higher seems to be the only way to verify if the two ends can still talk to each other or not.\n\nThe test: I have connected a Chrome client running on a laptop and called into my conferencing application running on ApacheTomcat. When connection was established after about 40 seconds I disconnected the network on the laptop and noticed that websocket was not notified that it was closed. If I attempted to send something to it at that moment then it will tell me that websocket no longer exists. Changing TCP keepalive timers on AS I could see them going back and forth from AS out and back... but did not see them on the client machine at all. That is what made me believe that these timer settings are only between the network hops.", "id": 182214, "time": "2015-04-01T12:34:59Z", "bug_id": 57750, "creation_time": "2015-04-01T12:34:59Z", "is_private": false, "attachment_id": null}]