[{"attachment_id": null, "tags": [], "bug_id": 57777, "text": "The latest official docs on AddHandler at [1] list\n\n  AddHandler cgi-script .cgi\n\nfor an example.  Why use something as dangerous for an example?\nA few lines below, the user is pointed to notes on multiple file extensions at [2]\nbut no mention of \"security\" and no example of an attack scenario\nwith remote code execution from a user file upload form.\n\nThe official FAQ at [3] mentions \"AddHandler cgi-script .cgi\", too.  Why?\n\nThe multiple file extension approach of AddHandler seems to be widely unknown:\nDangerous guides enabling CGI or PHP execution using AddHandler can be found all\naccross the internet, including documentation of webhosters and large Linux distributions.\nTherefore I believe Apache users need all the help they can get from the official\ndocumentation understanding that AddHandler is dangerous to use in many cases.\n\nIdeally, also add a big graphic warning sign in the docs to AddHandler\nand/or boldly discourage its use altogether.  That would rock the house.\n\nThanks in advance!\n\n\n[1] https://httpd.apache.org/docs/current/mod/mod_mime.html#addhandler\n[2] https://httpd.apache.org/docs/current/mod/mod_mime.html#multipleext\n[3] https://wiki.apache.org/httpd/FAQ#How_do_I_enable_CGI_execution_in_directories_other_than_the_ScriptAlias.3F\n\nPS: Bug #57584 is related and has my full support.", "count": 0, "id": 182180, "time": "2015-03-30T00:58:33Z", "creator": "sebastian@pipping.org", "creation_time": "2015-03-30T00:58:33Z", "is_private": false}, {"count": 1, "tags": [], "text": "Definitely something to change, injecting files and then get them executed is not really good. I really hope that in 2016 few people are still using mod_cgi, but improving the documentation is always a good thing.\n\nI am not an expert though about the correct settings to secure a configuration like this one (except careful validation of the files received and Options -ExecCGI in the appropriate folders), do you have any suggestion to speed up the resolution of the bug?\n\nThanks!\n\nLuca", "is_private": false, "bug_id": 57777, "id": 187701, "time": "2016-01-15T06:03:24Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-01-15T06:03:24Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 57777, "text": "Adding another possible candidate to fix/update:\n\nhttps://httpd.apache.org/docs/2.4/misc/security_tips.html#cgi", "count": 2, "id": 188282, "time": "2016-02-08T08:50:42Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-02-08T08:50:42Z", "is_private": false}]