[{"count": 0, "tags": [], "creator": "stanoev.nikolay@gmail.com", "text": "Only once controller should be executed only once (per thread) if it is under Thread Group element. This works fine if you do not use include controller in the JMX file. But if you use include controller and some of the iterations fail then the only once controller will be executed one more time in the next iteration. You can see a simple example below.\n\nTest Plan \n-> Thread Group ( 1 thread / 10 iterations) \n    -> Only Once Controller\n        -> HTTP request\n    -> Module Controller ( Refer the test fragment below with include controller)\n    -> HTTP request ( make it fail)\n       \n-> Test Fragment\n    -> Include Controller ( refer a JMX file with one test fragment and a single HTTP request)\n\nIf you run a test like the one above Only Once Controller will be executed 10 times because there are 10 iterations and due to last step every iteration will fail. \n\nCase N2:\nTest Plan \n-> Thread Group ( 1 thread / 10 iterations) \n    -> Only Once Controller\n        -> HTTP request\n    -> Module Controller \n    -> HTTP request ( make it fail)\n       \n-> Test Fragment\n    -> Copy / paste the request from Include Controller. (DO NOT USE INCLUDE CONTROLLER IN THIS STEP)\n\nIn this case Only Once controller will execute only once.\n\n\nAs you can see the only difference in both Test Plans is that in the first one I use Include Controller and in the second one that controller is not used.", "id": 182223, "time": "2015-04-02T13:20:16Z", "bug_id": 57787, "creation_time": "2015-04-02T13:20:16Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "stanoev.nikolay@gmail.com", "text": "Created attachment 32629\nIn the example.zip you can find two files which can be used to reproduce the problem\n\nHello,\n\nI have created an example which can be used in order to reproduce the problem. While I was creating it I saw that there are some changes in the initial example which I gave and the behavior is consistent ( it does not matter whether the Include Controller is used or not).\n\nSo it seems that Only Once Controller is executed every time when it is under IF Controller and some of the actions in that controller fails. You can see the attached files in order to reproduce the problem. \n\nIs this expected behavior?", "id": 182224, "time": "2015-04-02T13:41:17Z", "bug_id": 57787, "creation_time": "2015-04-02T13:41:17Z", "is_private": false, "attachment_id": 32629}, {"attachment_id": null, "tags": [], "bug_id": 57787, "is_private": false, "count": 2, "id": 182447, "time": "2015-04-16T20:36:57Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2015-04-16T20:36:57Z", "text": "Hi,\nIn fact this is a known bug, as per changes (http://jmeter.apache.org/changes.html):\nThe Once Only controller behaves correctly under a Thread Group or Loop Controller, but otherwise its behaviour is not consistent (or clearly specified).\n\nSo I don't know if it should be fixed."}]