[{"count": 0, "tags": [], "bug_id": 57819, "attachment_id": null, "id": 182405, "time": "2015-04-15T20:38:23Z", "creator": "coar@apache.org", "creation_time": "2015-04-15T20:38:23Z", "is_private": false, "text": "We should have a document that defines conventions for the documentation, and then apply & follow it.  For example, in some places <em> is used where <var> occurs elsewhere; occasionally <strong> appears *inside* code segments, \"<br />\" sometimes appears in code blocks, etc.\n\nI suggest we come up with conventions patterned after those already pioneered by books (like O'Reilly), or man pages, or *some*thing.\n\nWe probably need two documents: one for the documentation writers\ndefining how stuff should be written, and one for users explaining\nhow to interpret styles in the documentation.\n\n* Distinguish between keywords and arbitrary user-supplied text;\n* What arguments should be quoted?  (I vote for filesystem paths,\n  URLs, AuthName values, and regexes..)  Sometimes it's unclear when\n  quotation marks are optional, recommended, or required -- and when\n  they're illegal (think RAW_ARGS directive arguments).\n* When to use <em> as opposed to <var>.\n* Consistent indentation.\n\nThis is just a start.."}, {"count": 1, "attachment_id": null, "bug_id": 57819, "text": "Oh, and come up with (and use) some consistent argument-type keywords, like\n\n* FILE-PATH (and describe in the user conventions that these are ServerRoot-\n  relative if not absolute)\n* KEYWORD (like \"temp\", \"permanent\", \"ExecCGI\", ...)\n* REGEX or PATTERN\n* GLOB (do we have anything that does this?)\n* EXPRESSION\n* IDENTIFIER (like the name given to a rewrite map specification)\n* URL (local or full)\n\nThere should be a way of indicating that an argument can interpolate\nvariables or regex group values, such as the first argument to RewriteCond\nor the second argument to RewriteRule (or any of the *Match directives).\n\nNoodling in the bug report..", "id": 182409, "time": "2015-04-15T21:06:54Z", "creator": "coar@apache.org", "creation_time": "2015-04-15T21:06:54Z", "tags": [], "is_private": false}]