[{"count": 0, "tags": [], "bug_id": 57828, "text": "I am using POI for simple CRUD operations on excel files. Once such operation is deleting and shifting of rows in a sheet. Unfortunately, both these operations don't work as expected when a row that I need to delete/shift has one or more cell comments.\n\nI noticed the following line in this page https://poi.apache.org/changes.html :\n56017 - Fix shifting comments with shifted rows\n\nSince POI 3.12 beta 2 is not out yet, I used the latest stable SVN revision 1674025 to download the source code and followed the build instructions to build the 3.12 beta2 binaries.\n\nI used a simple stand alone program to shift rows with comments in an excel sheet using POI apis.\nWhen a row has only one cell comment, that row is being properly shifted. However, when a row has more than one cell with comments, only the first comment gets properly shifted along with its cell. The other remaining comments stay in that exact same cell number/row number position with only the corresponding cell's data being shifted.\n\nAttaching a simple java project with a Junit test class ShowShiftRowsWithCommentsBugTest.java . Please note all the jars needed are under libs folder of this project. The excel sheet is also in the classpath /src/resources/deletewithcomments.xlsx", "id": 182461, "time": "2015-04-17T19:37:24Z", "creator": "bvenkata@tibco.com", "creation_time": "2015-04-17T19:37:24Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 57828, "text": "Created attachment 32658\nSource folder of java project\n\nThe POI libs I used were built from SVN revision 1674025 of POI source code.", "id": 182462, "time": "2015-04-17T19:41:04Z", "creator": "bvenkata@tibco.com", "creation_time": "2015-04-17T19:41:04Z", "is_private": false, "attachment_id": 32658}, {"count": 2, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "id": 182506, "time": "2015-04-20T19:38:44Z", "bug_id": 57828, "creation_time": "2015-04-20T19:38:44Z", "is_private": false, "text": "Please provide unit tests in a way that fail as long as the bug is present. Because the unit test that you provided runs green when the bug is there, I thought it is actually fixed, loosing quite some time until I found out that your unit test is actually broken! :("}, {"count": 3, "tags": [], "bug_id": 57828, "attachment_id": 32667, "id": 182508, "time": "2015-04-20T19:54:53Z", "creator": "bvenkata@tibco.com", "creation_time": "2015-04-20T19:54:53Z", "is_private": false, "text": "Created attachment 32667\nSource folder containing corrected test class ShowShiftRowsWithCommentsBugTest\n\nSorry, I misunderstood your email. \nI have added the relevant comments in the class ShowShiftRowsWithCommentsBugTest.java.\nNow the test method bugOnlyOneCommentShiftedInRow() will fail as long as the bug exists in POI.\n\nAttaching the source folder zip again.\nThanks"}, {"count": 4, "tags": [], "bug_id": 57828, "text": "Thanks for the update, I have fixed this bug now, it's available at r1674975 and will be part of 3.12-beta2 or 3.12, whichever comes first.", "id": 182510, "time": "2015-04-20T20:16:57Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-04-20T20:16:57Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 57828, "attachment_id": null, "text": "Thank you Dominik. Much appreciated. I will check out revision r1674975.", "id": 182511, "time": "2015-04-20T20:25:29Z", "creator": "bvenkata@tibco.com", "creation_time": "2015-04-20T20:25:29Z", "is_private": false}]