[{"count": 0, "tags": [], "bug_id": 57839, "text": "The Oracle DB has 37k packages in our customer env. The issue is seen after running the below query from the program or when using DatabaseMetadata.getProcedureColumns()  in a program . We are seeing these errors  \"Exhausted Resultset (SQL Code =99999 and vendor code=17,011) \" or \"Closed Connection :next (SQL code=08003 , Vendor code=17,008)\".\n\nSomething happening to connection or resultset getting closed after running the query/getProcedureColumns call. We have investigated further and see this issue of Exhausted Resultset/Connection getting closed only when we use the datasource connection pool logic in our product.\n\nWhen we run a standalone java program with the query/getProcedureColumns  call , it took 10mins for the customer to get the output and there were no issues.We want the same behavior with datasource connection pool logic .\n\n\t\nWe are using Tomcat sevrer and org.apache.commons.pool.impl.GenericObjectPool connection pool.We have these connection pool settings done. \n\nconnectionPool.setMaxActive(25);\nconnectionPool.setMaxIdle(1);\nconnectionPool.setMinEvictableIdleTimeMillis(120000);\nconnectionPool.setTimeBetweenEvictionRunsMillis(1000);\nconnectionPool.setTestOnReturn(false);\nconnectionPool.setTestOnBorrow(true);\nconnectionPool.setTestWhileIdle(false); \n\nHence please let us know if there is any fine tuning to be done to make query or DatabaseMetadata.getProcedureColumns() to work when we use datasource connection pool logic.Please suggest us any other timeout or if there is anything else which can help us in this scenario.Thanks\n \t \n\nSQL QUERY :\nSELECT * FROM SYS.ALL_ARGUMENTS WHERE PACKAGE_NAME = 'PKG_TEST' AND OBJECT_NAME = 'PRC_INSERT' AND OWNER = 'APPS' ORDER BY SEQUENCE\n\nERROR:\njava.sql.SQLRecoverableException: Closed Connection: next\nat oracle.jdbc.driver.OracleResultSetImpl.next(OracleResultSetImpl.java:233)", "id": 182523, "attachment_id": null, "creator": "rohini.tn@in.ibm.com", "creation_time": "2015-04-21T10:19:28Z", "time": "2015-04-21T10:19:28Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57839, "is_private": false, "id": 182525, "creation_time": "2015-04-21T10:57:35Z", "time": "2015-04-21T10:57:35Z", "creator": "markt@apache.org", "text": "This is phrased very much like a support question and Bugzilla is not the best place for that sort of discussion.\n\nYou need to take your question to either the Tomcat users list or the Commons user list since DBCP is produced by the Apache Commons project. I'd recommend the Commons user list. If the discussion there concludes there is a bug at the root of this rather than that a configuration change is required, they will point you to the right place to raise that bug (Commons DBCP in the ASF Jira instance) and Tomcat will pick up the fix once it is made.", "attachment_id": null}]