[{"count": 0, "tags": [], "bug_id": 57836, "attachment_id": null, "text": "When the isapi code pulls the REMOTE_USER header from request that lacks it, it gets translated to \"\" which results in Tomcat creating an empty Principal object.\n\nHere is description of the issue:\n\nhttp://marc.info/?l=tomcat-dev&m=142921251105905&w=2\n\nEssentially\n\nGET_SERVER_VARIABLE_VALUE(\"REMOTE_USER\", s->remote_user);\n\nmacro setting s->remote_user to \"\" instead of NULL", "id": 182503, "time": "2015-04-20T18:07:47Z", "creator": "stanchev@hotmail.com", "creation_time": "2015-04-20T18:07:47Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57836, "text": "Created attachment 32678\nproposed fix\n\nAttached is proposed fix.", "id": 182581, "time": "2015-04-22T23:16:09Z", "creator": "stanchev@hotmail.com", "creation_time": "2015-04-22T23:16:09Z", "is_private": false, "attachment_id": 32678}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "I've looked at this and while I agree with the analysis and that the proposed patch would fix the issue, I'm not sure that there isn't a better way to fix this.\n\nIt seems wrong to do NULL -> \"\" -> NULL. I think either dup_server_value or jk_pool_strdup need to be modified to return NULL rather than \"\". However, I am concerned that changing either of those may have unexpected side effects. I think Rainer, Mladen or someone else who knows the code better than I needs to look at this.", "id": 184183, "time": "2015-07-27T09:22:52Z", "bug_id": 57836, "creation_time": "2015-07-27T09:22:52Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 57836, "attachment_id": null, "text": "Sounds like the ISAPI code should be detecting the \"\" and replacing it with NULL instead. I've never even looked at that code...", "id": 184209, "time": "2015-07-28T15:36:55Z", "creator": "chris@christopherschultz.net", "creation_time": "2015-07-28T15:36:55Z", "is_private": false}, {"count": 4, "tags": [], "creator": "stanchev@hotmail.com", "attachment_id": null, "text": "The thing is that ISAPI doesn't return null. You pass a buffer ptr and it fills it. In the case of absent REMOTE_USER, ISAPI sets the buffer[0]=0 and &size=0. So essentially the caller cannot differentiate NULL from \"\". But they are essentially the same thing. \n\nAlternatively the fix can go in Tomcat itself to NOT create CoyotePrincipal upon \"\" OR null string read from AJP which is also correct.\n\nIf this was my product and I was controlling it, I'd put a fix in both places. Given the difficulty in getting Tomcat Connector releases out, I would be happy to open a bug against Tomcat and get a fix there which will alleviate the issue.", "id": 184210, "time": "2015-07-28T15:53:35Z", "bug_id": 57836, "creation_time": "2015-07-28T15:53:35Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 57836, "text": "As I am unfamiliar with ISAPI, I was thinking that we'd just check for strlen=0 and replace \"\" with NULL and be done with it.\n\nI think that's exactly what your patch does. Mark didn't like it because it requires what he describes as NULL -> \"\" -> NULL which he's right is silly. But it looks like it's ISAPI that is silly and there's nothing we can do about it.\n\nI think the question is whether or not GET_SERVER_VARIABLE_VALUE will behave this way for most CGI variables and if it should ALWAYS convert \"\" to NULL, or if this is just some special case.", "id": 184211, "time": "2015-07-28T16:54:23Z", "creator": "chris@christopherschultz.net", "creation_time": "2015-07-28T16:54:23Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 57836, "text": "(In reply to George Stanchev from comment #4)\n> The thing is that ISAPI doesn't return null. You pass a buffer ptr and it\n> fills it. In the case of absent REMOTE_USER, ISAPI sets the buffer[0]=0 and\n> &size=0. So essentially the caller cannot differentiate NULL from \"\". But\n> they are essentially the same thing. \n> \n> Alternatively the fix can go in Tomcat itself to NOT create CoyotePrincipal\n> upon \"\" OR null string read from AJP which is also correct.\n> \n> If this was my product and I was controlling it, I'd put a fix in both\n> places. Given the difficulty in getting Tomcat Connector releases out, I\n> would be happy to open a bug against Tomcat and get a fix there which will\n> alleviate the issue.\n\nHi George,\n\ndocs for GetServerVariable say, the returned size is the number of bytes inlcuding the terminating '\\0' character. So an empty string should return buffer[0] = '\\0' and size 1. If you are sure, that an absent REMOTE_USER is handled by returning size 0, I would got for the general checking for size 0 in dup_server_value() and handle size 0 as return value NULL. Any chance you can check that? Also any chance to verify, that the size returned by an existing REMOTE_USER is actually the strlen od the REMOTE_USER + 1 (so including the terminating '\\0' as docs say)?\n\nI applied the change in r1701497. Slightly related is also r1701496.\n\nIt would be great if you could also test it. Keeping issue open until fix is confirmed.", "id": 184991, "time": "2015-09-06T16:16:37Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2015-09-06T16:16:37Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "text": "I could now test the behavior. Unfortunately GetServerVariable does not return size 0 but instead size 1 in this case. So it really returns an exmpty string and there's no way to make a dstinction between a NULL and an empty string.\n\nThat means we have to make a distinction based on the semantics of the various variables. I'll keep most of them as empty strings for compatibility and will replace the empty string by NULL for REMOTE_USER. We can let it control by another argument, so it will be easy to switch more variables from empty string to NULL as the need arises.", "attachment_id": null, "bug_id": 57836, "id": 185058, "time": "2015-09-09T17:39:16Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2015-09-09T17:39:16Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 57836, "attachment_id": null, "id": 185059, "time": "2015-09-09T18:25:26Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2015-09-09T18:25:26Z", "is_private": false, "text": "I implemented the overwriting of the empty string return value with an additional arg in r1702073. Especially REMOTE_USER and AUTH_TYPE will now be NULL instead of empty string. Closing this issue now. Will be part of 1.2.42."}, {"count": 9, "tags": [], "bug_id": 57836, "text": "Rainer, thanks for this fix! I apologize for not getting back to you quick but I was out of the office over the Labor Day weekend with no access to email. Let me know if you still need anything tested. Thanks again for getting the fix in!", "id": 185061, "time": "2015-09-09T19:10:50Z", "creator": "stanchev@hotmail.com", "creation_time": "2015-09-09T19:10:50Z", "is_private": false, "attachment_id": null}]