[{"count": 0, "tags": [], "bug_id": 57848, "text": "Created attachment 32679\nFurther details and strace output\n\nA JMeter load test run on a 1-CPU  VM reliably hangs in non-GUI mode.  It always completes in GUI mode. The non-GUI hanging resolved when CPU resources were added to the VM. However, seemingly random network errors occur in all scenarios.\n\nThe test was run on Linux running in a VirtualBox VM (Fedora 21 guest, Windows 7 host). The VM had 1 CPU (i5 class) and 4 GB RAM allocated initially. Run in non-GUI mode, the test always 'hung' a long time (in one case, overnight). GUI mode worked fine, with intermittent errors (the green light would blink out once the test ended). \n\nThe test uses XML/RPC samplers and HTTP samplers. Run in GUI mode, a small minority of the XML/RPC sampler threads  (about 10 out of a total of 100 threads) throw a java.net.UnknownHostException. I think similar exceptions occur in non-GUI mode, and somehow trigger the hang.\n\nStrace of the hanging Java PID (non-GUI mode test run) revealed a FUTEX_WAIT/FUTEX_WAKE loop (details below). It reported  also \"Process 8061 attached with 13 threads\" -- these 13 threads seem to correspond to PIDs (reported at  the end of strace output as \"Process 8086 detached\", \"Process 8107 detached\", etc). The interesting thing is these 13 PIDs did not exist when I ran the strace (as reported by 'ps'). \n\nSorry, a thread dump was not obtained. Poking around enough with strace seemed to cause the JVM to somehow 'recover' and terminate the test (with an incomplete log file). \n\nFirst, I increased RAM allocated to the VM in VirtualBox settings. This had no effect. Then, I tried allocating 2 more CPUs to the VM. This also enabled I/O APIC in VirtualBox (it was disabled by default earlier). \n\nAdding CPUs resolved the 'hang' problem; the test now completes reliably in non-GUI mode. But intermittent network problems persist. For e.g., in one run, one (out of 100) XML/RPC samplers returned a single 'Non HTTP response message: Network is unreachable' error. The next run passed with no errors.\n\nFor further details and strace output, see 'Detailed Information.txt' attached.", "id": 182583, "time": "2015-04-23T02:24:58Z", "creator": "sonam.chauhan@ce.com.au", "creation_time": "2015-04-23T02:24:58Z", "is_private": false, "attachment_id": 32679}, {"count": 1, "text": "\nHello,\n\nYour issue seems be a JVM Heap Size problem, increase the size of -Xmx option in bin/jmeter file.\n\nUnfortunately, Buzgilla isn't a support forum, please move your issue on the JMeter user mailing-list.\n\n(and I better if you use the latest version of JMeter -> 2.13)\n\nMilamber", "creator": "milamber@apache.org", "is_private": false, "id": 182587, "time": "2015-04-23T06:28:16Z", "bug_id": 57848, "creation_time": "2015-04-23T06:28:16Z", "tags": [], "attachment_id": null}, {"count": 2, "text": "(In reply to Milamber from comment #1)\n\n> Your issue seems be a JVM Heap Size problem, increase the size of -Xmx\n> option in bin/jmeter file.\n\nThere was no OOM, and non-GUI mode behaves different (had the problem) compared to GUI mode.\n\n> Unfortunately, Buzgilla isn't a support forum, please move your issue on the\n> JMeter user mailing-list.\n\nMy apologies. I won't bore them either ;-)", "bug_id": 57848, "attachment_id": null, "id": 182588, "time": "2015-04-23T06:52:12Z", "creator": "sonam.chauhan@ce.com.au", "creation_time": "2015-04-23T06:52:12Z", "tags": [], "is_private": false}, {"count": 3, "text": "Hi,\nMost probably your test has not set Timeouts.\n\nSee :\nhttp://jmeter.apache.org/usermanual/build-ws-test-plan.html\nFor more up to date way of load testing Webservices.\n\nIf you think it's not your issue, then please attach :\n- Your test plan\n- jmeter.log\n\nRegards", "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "id": 182633, "time": "2015-04-26T12:58:13Z", "bug_id": 57848, "creation_time": "2015-04-26T12:58:13Z", "tags": [], "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "sonam.chauhan@ce.com.au", "is_private": false, "count": 4, "id": 183052, "time": "2015-05-20T04:52:00Z", "bug_id": 57848, "creation_time": "2015-05-20T04:52:00Z", "text": "Appreciate your input Phillipe. I am sorry, I am no longer in a position to replicate, so lets keep this issue closed."}]