[{"count": 0, "tags": [], "bug_id": 57849, "attachment_id": null, "text": "Hi Apache,\n\nFirstly Thank You For Providing an Opportunity for raising bugs and mailing list.\n\nMy Issue goes like below,\n\nWhen apache is trying to connect to backend server (in my case) Tomcat at port 1188, Sometimes I hit \"Service temporarily unavailable\" issue. \n\nWhen \"Service temporarily unavailable\" issue is hit, we are seeing following below message in error_log\n\n[Mon Apr 20 14:45:06 2015] [error] (239)Connection refused: proxy: HTTPS: attempt to connect to 127.0.0.1:1188 (localhost) failed\n[Mon Apr 20 14:45:06 2015] [error] ap_proxy_connect_backend disabling worker for (localhost)\n\nBy the error message it seems that when ever apache is trying to connect to tomcat at port 1188 and if there is no service running at this port then this issue is hit.  \n\nIn google, I observed to add retry=0 at PassProxy to avoid this error. I did the same changes but still I am facing same issue \n\nProxyPass /sgmgr https://localhost:1188/sgmgr retry=0\n\nBelow are my questions,\n\n1. Who is printing “Service Temp Unavailable” message ? Is it possible to change the error message “Service Temp Unavailable” to some other meaning full sentence so that user will not be confused with this error. Since this error is temporary, can we mention workaround like press F5\n\n2. Is there any other configuration property to avoid this error like retry=0. \n\n3. In general how we can avoid \"service temporarily unavailable\" issue \n\n4. Is there any new version of apache where this issue has been fixed\n\nThanks,\nSandeep", "id": 182584, "time": "2015-04-23T04:44:57Z", "creator": "hssandeep16@gmail.com", "creation_time": "2015-04-23T04:44:57Z", "is_private": false}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "is_private": false, "id": 182596, "time": "2015-04-23T12:44:11Z", "bug_id": 57849, "creation_time": "2015-04-23T12:44:11Z", "text": "Bugzilla is for reporting bugs, not support.  Try the users mailing list or serverfault."}]