[{"count": 0, "tags": [], "creator": "mshlayen@smart-solution.com", "is_private": false, "id": 182536, "creation_time": "2015-04-21T17:11:34Z", "time": "2015-04-21T17:11:34Z", "bug_id": 57844, "text": "Created attachment 32675\nSmall java program to test SXSSFSheet.shiftRows() functionality\n\nSXSSFSheet.shiftRows() throws java.lang.RuntimeException: NotImplemented", "attachment_id": 32675}, {"count": 1, "tags": [], "text": "I'm not sure we're going to be able to add support for this in SXSSF - shifting rows generally requires updating all sorts of back-and-forth references, which SXSSF wouldn't be able to do as it won't have the required objects available\n\nIt's possible that someone could do a minimal implementation that just did a few updates on rows which were in the buffer in memory, but care would need to be taken to ensure it cleanly throws an exception if it's asked to touch anything outside of the buffer", "attachment_id": null, "id": 182543, "creator": "apache@gagravarr.org", "time": "2015-04-21T23:56:33Z", "bug_id": 57844, "creation_time": "2015-04-21T23:56:33Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 57844, "is_private": false, "text": "I understand the complexity, but in this case Apache POI API better not to offer and not to allow this method at all, rather then making impression that user (developer) is able to insert row(s) and not allowing to do it.", "id": 182557, "time": "2015-04-22T13:39:10Z", "creator": "mshlayen@smart-solution.com", "creation_time": "2015-04-22T13:39:10Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "onealj@apache.org", "attachment_id": null, "id": 186490, "creation_time": "2015-11-23T06:03:57Z", "time": "2015-11-23T06:03:57Z", "bug_id": 57844, "text": "Proposed resolution:\nUpdate the Java docs (https://poi.apache.org/apidocs/org/apache/poi/xssf/streaming/SXSSFSheet.html) and clearly state which functions are not implemented. (I'm guessing shiftRows isn't the only SXSSF* function that throws RuntimeException/UnsupportedOperationException(\"NotImplemented\").\n\nAs Nick said, shiftRows could only work if the rows to be shifted are within current window, rows that haven't yet been written probably wouldn't be able to be shifted, and any reference (formula, named range, merged region, hyperlink, chart data, tables, pivot tables, conditional formatting rules) that refers to a shifted row would probably be broken.\n\nIf someone can find a workable solution that addresses these issues, we'd be happy to implement it. Until then, the best we can do is advertise \"Not Implemented\" in the java docs. I think it'd be a step backwards to move shiftRows out of the Sheet interface so that SXSSFSheet isn't required to implement it.", "is_private": false}, {"count": 4, "tags": [], "text": "Added in r1717079.\n\nI added an annotation org.apache.poi.util.NotImplemented which should be used on any method, especially a public method, that is not implemented (either because no one has gotten around to the work or the class inherently can't support it but we want the method to be available in the interface so users can write generic code.\n\nI added these annotations on to the two shiftRows calls in SXSSFSheet.\nBefore this bug is closed, someone needs to search through the code for\nRuntimeException, UnsupportedOperationException, NotImplemented, Not Implemented and annotate those methods as well.", "is_private": false, "id": 186639, "creator": "onealj@apache.org", "time": "2015-11-29T15:35:54Z", "bug_id": 57844, "creation_time": "2015-11-29T15:35:54Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 57844, "attachment_id": null, "text": "I reviewed the SXSSF classes and added some more notes in r1738413, so this should be mostly done now, any missing entries will be fixed as we go along.", "id": 190098, "time": "2016-04-10T09:41:39Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-04-10T09:41:39Z", "is_private": false}]