[{"count": 0, "tags": [], "bug_id": 57853, "attachment_id": 32684, "id": 182612, "time": "2015-04-24T08:15:30Z", "creator": "shm-dmitry@yandex.ru", "creation_time": "2015-04-24T08:15:30Z", "is_private": false, "text": "Created attachment 32684\ntcpdump showing an error\n\nHi.\n\nI used apache with mod_proxy_http as load balancer.\nWhen client sends POST-request to my server, apache added header 'Expect: 100-continue' into it and redirect to application server (jetty).\n\nThus the body of the POST-message is sent in the same frame. \nThat is apache doesn't wait for the '100-continue'-response before sending a body of the message.\n\nBut RFC-7231 says that in this case the server can, but isn't obliged, to answer 100-continue:\n   o  A server MAY omit sending a 100 (Continue) response if it has\n      already received some or all of the message body for the\n      corresponding request, or if the framing indicates that there is\n      no message body.\n\nIf server does not respond 100-continue for this request, apache waits for a small timeout and respond to client 'server not avaiable'\n\nI started discussion with jetty about this problem, link to it: https://bugs.eclipse.org/bugs/show_bug.cgi?id=464797\n\nI reproduced this error locally and attached tcpdump, please, look at it.\n\npacket#4: client sent request.\npackat#13: apache added header 'Excpect: 100-continue' and resended it to jetty (request for 100-continue and body in same frame).\npacket#16: apache returned error to client: 'timeout awaiting 100-continue'\npacket#22: jetty returned HTTP-200 OK"}, {"count": 1, "text": "According to tcpdump, it seems you have configured either ProxyPass or BalancerMember with the parameter ping=1.\n\nThe ping parameter gives the time to wait for *any* response (timeout), hopefully a \"100 Continue\", but if another status is received instead, it will still be forwarded to the client as is (thus, mod_proxy_http does not explicitely wait for a \"100 Continue\" but for any response within the ping timeout).\nThe purpose of ping is that if a timeout occurs (before receiving any response), the same request can be retried with an other balancer member (if any).\n\nWith ping=1, this leaves only one second to the backend to respond, whereas in the trace we can see that the response takes a little more than that (the difference bewteen frame 16 and 13 is ~1.018s), hence the connection close before the (ignored) reponse.\n\nHowever, I agree that mod_proxy should not send both the HTTP header and the body (full request) when ping is configured, otherwise it cannot send the same (likely non idempotent) request to another backend, even if a timeout (or 503) occured.\nI am working on a fix regarding this (both end-to-end and ping 100-continue).\n\nBut I guess it won't fix your issue which probably requires that you use a higher ping timeout, since the backend needs more than that to generate a response.", "creator": "ylavic.dev@gmail.com", "is_private": false, "id": 182920, "time": "2015-05-10T22:14:01Z", "bug_id": 57853, "creation_time": "2015-05-10T22:14:01Z", "tags": [], "attachment_id": null}]