[{"count": 0, "tags": [], "bug_id": 57862, "is_private": false, "id": 182664, "creation_time": "2015-04-27T16:39:56Z", "time": "2015-04-27T16:39:56Z", "creator": "puntogil@libero.it", "text": "Hi,\nFedora is a popular distribution of the Linux operating system, and we wish to include the latest version of Apache POI [3] in our OS. Fedora only contains Free and Open Source licensed works.\n\nI tried to contact ETSI for the terms of the license for the XSD files\n[1] [2],\nincluded in Apache Poi [3]. but until now I have not received answers.\n\nThese XML schema files appear to have come directly from the standard documents, and look to be copyrighted by ETSI, but the copyright license terms [4] on those schema files is unclear.\n\nthanks in advance\n\n[1] http://uri.etsi.org/01903/v1.3.2/XAdES.xsd\n[2] http://uri.etsi.org/01903/v1.4.1/XAdESv141.xsd\n[3] https://bugzilla.redhat.com/show_bug.cgi?id=1146670 \n[4] http://www.etsi.org/index.php/terms-of-use", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 57862, "is_private": false, "id": 182666, "creation_time": "2015-04-27T17:52:49Z", "time": "2015-04-27T17:52:49Z", "creator": "apache@gagravarr.org", "text": "The XSDs, as part of the OOXML specification, are covered by the Microsoft Open Specification Promise - https://msdn.microsoft.com/en-gb/openspecifications/dn646765\n\nYou can find the discussions on the legal list about the licensing from back when the OOXML support was added:\nhttp://mail-archives.apache.org/mod_mbox/www-legal-discuss/200802.mbox/%3Calpine.LFD.1.00.0802041355590.7149@localhost.localdomain%3E\n\nAnd some specific bits in this email:\nhttp://mail-archives.apache.org/mod_mbox/www-legal-discuss/200802.mbox/%3Calpine.LFD.1.00.0802151053350.29904@localhost.localdomain%3E\n\nWithout knowing the Fedora rules on what is and isn't considered Free/Open, I can't comment on if that's good enough for you, only that the ASF legal affairs committee have approved them for inclusion in and distribution by an Apache project", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 57862, "is_private": false, "id": 182669, "creation_time": "2015-04-27T19:19:52Z", "time": "2015-04-27T19:19:52Z", "creator": "tcallawa@redhat.com", "text": "I guess the real question here is whether these files can be modified or not. That's not clear from the links you sent. I'd agree that they seem to be freely distributable, but without permission to modify, they're neither Free or Open Source.\n\nIf these files were purely documentation, this might not matter, but the way these files are being used to power the software means that they (imho) need to be FOSS.", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 57862, "is_private": false, "id": 182673, "creation_time": "2015-04-27T21:20:18Z", "time": "2015-04-27T21:20:18Z", "creator": "apache@gagravarr.org", "text": "Currently, we use XMLBeans to automatically generate Java source code based on the XSDs, then compile and use that resulting code. That intermediate source code is open source, available, and can be changed (if you really want to - normally fixing things in the generating XMLBeans code would be recommended if there's a bug!)\n\nUnmodifiable standards definitions are a reasonably common thing. For example, I believe a number of projects distributed in Fedora include the EPSG geodetic parameter dataset which has restrictions on modification. See https://issues.apache.org/jira/browse/LEGAL-183 for the discussions we at the ASF had about incorporating that. Maybe the Fedora rules for that (or similar) could be used as a guide here too?", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 57862, "is_private": false, "id": 189441, "creation_time": "2016-03-13T20:10:00Z", "time": "2016-03-13T20:10:00Z", "creator": "dominik.stadler@gmx.at", "text": "As far as I see there not much else that we need/can provide right now here, if this is not yet resolved the discussion should probably go to the dev-mailing list at dev@poi.apache.org until we know if there are changes required at all.", "attachment_id": null}]