[{"count": 0, "tags": [], "bug_id": 57872, "attachment_id": null, "is_private": false, "id": 182718, "time": "2015-04-29T07:49:07Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-04-29T07:49:07Z", "text": "Encountered this when migrating a legacy web application from old Tomcat 6 to current Tomcat 7(.0.61). Reproducible with current Tomcat 8 as well.\nEssential is that both Tomcat 6 and Tomcat 7 were configured with\n\norg.apache.catalina.STRICT_SERVLET_COMPLIANCE=true\n\nUser-visible symptoms:\n\nThe count of active sessions (as shown in Manager application) increases rapidly. This does not occur when the same application is deployed on Tomcat 6.\n\nDebugging:\n\n1) Configured AccessLogValve to log incoming \"cookie\" headers and outgoing \"set-cookie\" headers and the current session.Id by adding the following text to its pattern:\n\nSessionId:%S [Cookie received: %{cookie}i] [Set-Cookie sent: %{set-cookie}o]\n\n2) Disabled HttpOnly -- to bring Tomcat 7 configuration more closely to Tomcat 6 one. This is done by setting <Context useHttpOnly=\"false\"> in context file of the web application.\n\n\nCause:\n\nIn year 2009 a new feature was implemented in Tomcat 7 that a cookie is automatically switched from \"version 0\" cookie (Netscape cookie) to \"version 1\" cookie (RFC2109 cookie) when value/path/domain properties of the cookie contain a character that need to be quoted.\n\nWhen \"STRICT_SERVLET_COMPLIANCE\" is true, one of characters that triggers \"version 1\" is '/'. As every session cookie contains a Path that starts with '/' this causes all session cookies to become \"version 1\" ones.\n\n\nThe problem is when client is Internet Explorer.\n\nIf I look into access log, the set-cookie header sent by an old Tomcat 6 looks like the following:\n\nJSESSIONID=E8776ACC0C787BBAD5C7EEC4770877E1; Path=/foo\n\nThe set-cookie header sent by Tomcat 7 looks like the following:\n\nJSESSIONID=A7A0CBBF5813DF4DEADFFFD3475E09AD; Version=1; Path=\"/foo/\"\n\nThe problem is quoted value of Path. It is not understood by Internet Explorer and subsequent HTTP and Ajax requests do not include a \"cookie\" header. This is observed both with IE 8 and with current IE 11.\n\nFor a reference, an old report\n\n\nKnown solution:\n\nTomcat 7 and 8: Set the following system property:\norg.apache.tomcat.util.http.ServerCookie.FWD_SLASH_IS_SEPARATOR=false\n\nTomcat 8 (better solution): configure a <CookieProcessor> to be \"org.apache.tomcat.util.http.Rfc6265CookieProcessor\" instead of default LegacyCookieProcessor.\n\nSee\nhttp://tomcat.apache.org/tomcat-8.0-doc/config/cookie-processor.html\n\n\nProposal:\n1) '/' alone should not trigger conversion from version 0 cookie to version 1 cookie. Netscape specification (as linked from rfc6265) uses unquoted '/' in Path in its examples, so it is explicitly OK to use '/' in the Path.\n\nGenerally, there may be other safe characters, as RFC6265 allows <any CHAR except CTLs or \";\"> in path-value, but '/' is such a blatant example. Every path starts with a '/'.\n\n2) Processing of a cookie that has \"version=1\" (set explicitly, or converted due to other reasons) is unchanged. The path will be quoted here. RFC2109 quotes Path in its examples.\n\nThe FWD_SLASH_IS_SEPARATOR flag is left to control quoting in version 1 cookies. (This is why I do not propose changing the default value of FWD_SLASH_IS_SEPARATOR)."}, {"count": 1, "tags": [], "text": "> For a reference, an old report\n\nI meant to link to bug 45272 there. Just for information.", "is_private": false, "id": 182719, "creator": "knst.kolinko@gmail.com", "time": "2015-04-29T08:16:33Z", "bug_id": 57872, "creation_time": "2015-04-29T08:16:33Z", "attachment_id": null}]