[{"count": 0, "tags": [], "bug_id": 57911, "is_private": false, "text": "http://httpd.apache.org/docs/trunk/en/mod/mod_rewrite.html#rewriterule says:\n\nPattern is a perl compatible regular expression. On the first RewriteRule, it is matched against the (%-decoded) URL-path of the request, or, in per-directory context (see below), the URL path relative to that per-directory context. Subsequent patterns are matched against the output of the last matching RewriteRule.\n\nI think the second part is wrong, or at least unclear. \n\nIf \"URL path\" refers to a \"URL-path\", which is defined as \"A DocumentRoot-relative path\", there is a contradiction. If not, \"the URL path relative to that per-directory context\" is unclear.\n\nThis paragraph was changed recently (see #53153 for background).\n\nIn https://bz.apache.org/bugzilla/show_bug.cgi?id=52000#c11 I suggested\n\"the request's path relative to the directory for which the rule is defined\" but I don't know if this is clear.\n\nBy the way, in the first sentence, \"perl compatible regular expression\" could be replaced with \"regex\", defined in http://httpd.apache.org/docs/trunk/en/mod/directive-dict.html#Syntax", "id": 182908, "time": "2015-05-09T15:54:42Z", "creator": "chealer@gmail.com", "creation_time": "2015-05-09T15:54:42Z", "attachment_id": null}, {"count": 1, "tags": [], "text": "I'm going to close this ticket, because the paragraph referenced no longer exists in trunk, 2.2, or 2.4, and so the ticket no longer makes sense. Please open a new ticket if you find the confusing phrasing still exists somewhere in the existing versions of the docs.", "is_private": false, "bug_id": 57911, "id": 194977, "time": "2016-11-14T15:34:06Z", "creator": "rbowen@apache.org", "creation_time": "2016-11-14T15:34:06Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 57911, "text": "Eric Covener fixed this in r1757020 and r1757023.\n\nThanks Rich", "id": 195014, "time": "2016-11-15T21:06:32Z", "creator": "chealer@gmail.com", "creation_time": "2016-11-15T21:06:32Z", "is_private": false, "attachment_id": null}]