[{"count": 0, "tags": [], "bug_id": 57916, "text": "Created attachment 32728\nthe reentrant.php calls itself recursively n times using the 'count' parameter.\n\nOur php web site requires sometimes a reentrant call (i.e. it calls file_get_contents(http://127.0.0.1/reentrant.php).\n\nMost of the times calls are really fast (<5ms) but about 1% of the calls are over 0.5 secs\n\nWe had a hard time reproducing the bug but we finally found a php script that calls itself (see enclosure).\n\nTo test it just try http://127.0.0.1/reentrant.php?count=10 where 10 is the reentrancy level.\n\nThe script works fine with NGINX that's why we suspect apache rather than PHP.", "id": 182932, "attachment_id": 32728, "creator": "landre3567@gmail.com", "creation_time": "2015-05-11T16:10:10Z", "time": "2015-05-11T16:10:10Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 57916, "attachment_id": null, "id": 182936, "time": "2015-05-11T17:02:48Z", "creator": "christophe.jaillet@wanadoo.fr", "creation_time": "2015-05-11T17:02:48Z", "is_private": false, "text": "*** Bug 57917 has been marked as a duplicate of this bug. ***"}, {"count": 2, "tags": [], "bug_id": 57916, "attachment_id": null, "text": "This is not something the httpd project can help you troubleshoot via bugzilla.  Bugzilla is for specific bug reports, not PD/support/tuning.  You'll have to narrow this down drastically to report it as a bug..", "id": 182937, "time": "2015-05-11T17:05:00Z", "creator": "covener@gmail.com", "creation_time": "2015-05-11T17:05:00Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 57916, "text": "(In reply to Eric Covener from comment #2)\n> This is not something the httpd project can help you troubleshoot via\n> bugzilla.  Bugzilla is for specific bug reports, not PD/support/tuning. \n> You'll have to narrow this down drastically to report it as a bug..\n\nThis is not tuning, a localhost request that takes 1 second looks like a bug to me.\n\nIt looks like a locked resource problem. The problem is related to the thread/process used for the request.  \n\nSince I'm new to this bug reporting system I wont take the responsibility of reopening the bug. I'll let choose to do it or not.\n\nRegards", "id": 182938, "attachment_id": null, "creator": "landre3567@gmail.com", "creation_time": "2015-05-11T17:13:09Z", "time": "2015-05-11T17:13:09Z", "is_private": false}, {"count": 4, "attachment_id": null, "bug_id": 57916, "text": "Since there is nothing which points to a bug in this report, the best way to continue discussing this issue is the users@httpd.apache.org mailing list.\n\nThere, you should provide your the relevent configuration and error logs (eg. where the delay is observed) so to help anyone determine the problem you encounter (which may be simply a misconfiguration, or possibly a -now determined- bug requiring to reopen this report).", "id": 182939, "time": "2015-05-11T18:41:26Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-05-11T18:41:26Z", "tags": [], "is_private": false}]