[{"count": 0, "tags": [], "bug_id": 57984, "text": "Created attachment 32770\nPatch to add user-specified Diffie-Hellman parameters to Apache 2.2.29\n\nFor those users who must continue to use Apache 2.2 (we mod_perl people do not have a version that works with Apache 2.4), I have applied the patch from bug report 49559 to version 2.2.29 of Apache. The patch adds support for user-specified Diffie-Hellman parameters. This allows the use of 2048 bit user generated DH groups, which in turn improves the security of the SSL connection and makes it possible to earn a letter \"A\" grade from Entrust (entrust.ssllabs.com) and helps to secure against the Logjam attack.\n\nI am using the patch in an Apache 2.2.29 production environment and it works perfectly. An updated patch (against 2.2.29 instead of 2.2.14) is attached to this report.\n\nIn addition to installing the patch, admins must perform the following steps:\n\n1) Run \"openssl dhparam -out dhparams.pem 2048\" and copy the resulting \"dhparams.pem\" file to a private certificates directory of their server with as restrictive permissions as possible (i.e. read-only root).\n\n2) Add the following line to the SSL section of your Apache configuration:\n\n    SSLDHParametersFile \"/PATH/TO/YOUR/CERTIFICATE/FILES/dhparams.pem\"\n\nAdditional Apache configuration tips to protect against Logjam can be found at many sites on the Internet, including \"weakdh.org/sysadmin.html\".\n\nMany thanks to Erwann Abalea for the original patch. Remarkably, it was submitted in 2010.\n\nI hope this patch can be incorporated into the Apache 2.2 production stream for the benefit of all admins who cannot, for whatever reason, move to Apache 2.4 yet.\n\nBest,\n\nGeoff", "id": 183246, "time": "2015-06-01T16:17:30Z", "creator": "geoff@minaret.biz", "creation_time": "2015-06-01T16:17:30Z", "is_private": false, "attachment_id": 32770}, {"count": 1, "tags": [], "text": "The original approach in BZ 49559 was not the one actually implemented in 2.4.x. In 2.4 starting with 2.4.7, first of all the strength of the default DH params are derived from the strength of the certificate file. So if for example the certificate uses a 2048 bit key, then httpd will automatically also choose (standard) 2048 bit parameters for the ephemeral DH key exchange.\n\nFurthermore you can generate custom params like in your approach, but instead of putting them into a seperate file you configure with a new directive, you just append the params to the first configured certificate file.\n\nThis approach has been backported to 2.2.x and will be part of 2.2.30.\n\nYou can test it by building a current (non-released) 2.2.x trunk or by applying r1680916 (svn.apache.org/r1680916). Feedback on our approach is welcome. As said it works the same way as a current 2.4 version.\n\nThe official release of 2.2.30 should not be too far in the future, but it has not yet been tagged.", "is_private": false, "id": 183247, "creation_time": "2015-06-01T16:26:47Z", "time": "2015-06-01T16:26:47Z", "creator": "rainer.jung@kippdata.de", "bug_id": 57984, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 57984, "text": "Hi Rainer,\n\nThanks so much for your quick response. Your solution is totally superior and I appreciate all efforts to backport security enhancements to 2.2 for those of us who are unable to make the move to 2.4 at this time. I look forward to implementing 2.2.30 when it arrives.\n\nI withdraw my request but the patch does work for anyone who would like to use it while waiting for 2.2.30.\n\nBest,\n\nGeoff", "count": 2, "id": 183248, "time": "2015-06-01T16:37:26Z", "creator": "geoff@minaret.biz", "creation_time": "2015-06-01T16:37:26Z", "is_private": false}]