[{"count": 0, "tags": [], "bug_id": 58005, "attachment_id": 32796, "is_private": false, "id": 183333, "time": "2015-06-05T13:24:01Z", "creator": "mshlayen@smart-solution.com", "creation_time": "2015-06-05T13:24:01Z", "text": "Created attachment 32796\njava code\n\nAmount of CellStyles is still limited to 32K. When you create large enough excel file, after reaching value of 32767 of CellStyles, next CellStyleID becomes negative (-32768).\nRelated bug # 57880 - for version 3.11 final. And it has not been fixed in the version 3.12 final, despite it is written in the release notes.\nSee attached java code and resulting xlsx file (what happens from the row 10923).\n\nSame limit applies to Fonts.\n\nPS: increasing limit to 64K is not a solution! Styles are stored in the ArrayList, and max size of it is MAX_INTEGER, which is 2,147,483,647"}, {"count": 1, "tags": [], "bug_id": 58005, "attachment_id": 32797, "is_private": false, "id": 183334, "time": "2015-06-05T13:24:44Z", "creator": "mshlayen@smart-solution.com", "creation_time": "2015-06-05T13:24:44Z", "text": "Created attachment 32797\nResulting xlsx file"}, {"count": 2, "tags": [], "creator": "dominik.stadler@gmx.at", "text": "FYI, the general case up to 64k styles is fixed via bug 58260 now, it is not possible to support more than 64k of these because Excel itself limits the number of styles, files with more will be reported as corrupt by Excel! \n\nAlso note the comments about proper re-using of styles in bug 58260, due to this usually not makes sense to have so many Fonts/Styles in the first place as you should re-use the created objects as much as possible!\n\nI am closing this as DUPLICATE for now, please try with an upcoming nightly build or version 3.13-beta2 as soon as it becomes available and reopen the bug if this is still a problem for you.\n\n*** This bug has been marked as a duplicate of bug 58260 ***", "id": 184653, "time": "2015-08-19T13:42:42Z", "bug_id": 58005, "creation_time": "2015-08-19T13:42:42Z", "is_private": false, "attachment_id": null}]