[{"count": 0, "tags": [], "creator": "bo.gundersen@gmail.com", "text": "Created attachment 32795\nExample maven web application\n\nWhen a client drops the connection during a request, a ClientAbortException is thrown. If the web application caches this, and then tries to write to the request outputstream it seems that a memory leak occurs.\nI think it is a fairly general scenario where an exception is thrown while serving the request, and then the application tries to write an error response back to the client.\n\nLooking at heap dumps it seems like the bufferedWrites property in AjpNioProcessor grows each time it happens.\n\nI have attached a small web application that shows this issue. The culprit is BigStupidFileServlet that in line 36 writes to the response after having gotten an exception. To execute the sample do:\n1) Deploy the web application to a Tomcat, or execute tomcat.example.Main to use the embedded tomcat, and expose it through ajp\n2) Start an Apache HTTPD and point it to the Tomcat's ajp port\n3) Execute tomcat.example.Breaker with the url of the apache, e.g.: mvn exec:java -Dexec.mainClass=\"tomcat.example.Breaker\"  -Dexec.args=\"http://localhost:8080/tomcat-example/files/test.bin\"\n4) Observe that the Tomcat server will run out of memory quickly (on my machine around 6k requests, but it ofcause depends on heap size)\nIf you run the breaker on a http connector, it will continue running without OOM exceptions.", "id": 183331, "time": "2015-06-05T09:34:38Z", "bug_id": 58004, "creation_time": "2015-06-05T09:34:38Z", "is_private": false, "attachment_id": 32795}, {"count": 1, "tags": [], "text": "Buffering data in blocking mode seems wrong, it will be fixed in 8.0.24. However, it is really wrong to catch an IOE and expect to write some data ...", "is_private": false, "id": 183489, "creator": "remm@apache.org", "time": "2015-06-12T15:52:02Z", "bug_id": 58004, "creation_time": "2015-06-12T15:52:02Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58004, "attachment_id": null, "is_private": false, "id": 184864, "time": "2015-08-31T05:51:42Z", "creator": "anton@ctera.com", "creation_time": "2015-08-31T05:51:42Z", "text": "We upgraded to 8.0.24 and still experience high memory usage with APR connector when client downloads a large file.\nI can provide heap dumps if needed."}]