[{"attachment_id": null, "tags": [], "bug_id": 58042, "is_private": false, "count": 0, "id": 183561, "time": "2015-06-16T15:02:45Z", "creator": "kwill806@gmail.com", "creation_time": "2015-06-16T15:02:45Z", "text": "The SlowQueryReport JDBC interceptor catches Exceptions, by default logs them, and rethrows them. There is an option with the latest version not to write the message to the log, but it still sends it to JMX. It is very common in enterprise frameworks (such as Spring JDBC) to call a method, catch any exception thrown and handle the exception. All of this is normal activity. It should not be logged, it should not be sent to JMX. So first I would argue that SlowQueryReport SHOULD NOT log failed SQL statements at all. It is not documented as such, and it is a pain in the ??? that it does. :-) Second, it you will not remove the functionality, please understand that JMX and logging should \"log\" the same actions. So the setting should effect both. But again, if you want to make it hard to configure, by all means create yet another setting to control sending failed SQL to JMX. Finally, if you will not remove the functionality, please change the default to NOT log failed SQL. Minimal configuration is best. :-)"}, {"count": 1, "tags": [], "bug_id": 58042, "is_private": false, "text": "Correct component", "id": 183564, "time": "2015-06-16T15:49:36Z", "creator": "markt@apache.org", "creation_time": "2015-06-16T15:49:36Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58042, "attachment_id": null, "text": "Thanks for the report.\nI fixed to use the LogSlow attribute and the logFailed attribute as a condition to send JMX notifications.(r1688164)\n\nAs for default value of the logFailed attribute, I will change to false against trunk and tc8.0 unless there is no objections.", "id": 183788, "time": "2015-06-29T09:35:36Z", "creator": "kfujino@apache.org", "creation_time": "2015-06-29T09:35:36Z", "is_private": false}, {"count": 3, "tags": [], "text": "Fixed r1692049, r1692050.", "is_private": false, "id": 184091, "creator": "kfujino@apache.org", "time": "2015-07-21T06:22:40Z", "bug_id": 58042, "creation_time": "2015-07-21T06:22:40Z", "attachment_id": null}]