[{"count": 0, "tags": [], "bug_id": 58055, "text": "Hi -\nWe are using Tobcat as our application server and have some problems with context.xml. There are some actions that we want to do in the database when new connection is established. SQL query that we want to run is \"BEGIN DBMS_SESSION.SET_IDENTIFIER('SBM_TOMCAT'); END;\". To do this, we have added property initConnectionSqls to the Resource object in context.xml. But \";\" (semicolon) efore the END are treated as a separator between different SQL queries and cut version of query is sent to Oracle. Oracle in turn reports an error:\norg.apache.tomcat.dbcp.dbcp.SQLNestedException: Cannot create PoolableConnectionFactory (ORA-06550: line 1, column 47:\nPLS-00103: Encountered the symbol \"end-of-file\" when expecting one of the following:\n\n   := . ( % ;\n)\n\tat org.apache.tomcat.dbcp.dbcp.BasicDataSource.createPoolableConnectionFactory(BasicDataSource.java:1549)\n...\n\nWe tried to change our SQL to something that does not contain \";\", for example \n\"EXEC DBMS_SESSION.SET_IDENTIFIER('SBM_TOMCAT');\", but got another error:\nCaused by: java.sql.SQLException: ORA-00900: invalid SQL statement.\nThe interesting thing is that both SQL queries are working fine if to run them from Oracle SQL Developer.\nAnother fact is that the same functionality with the same SQL is working fine on Jboss (we are now moving from Jboss to Tomcat and faced with such a problem).\n\nPlease, help us to fix it or at least find workaround for it.\n\nThanks,\nDenys", "id": 183643, "time": "2015-06-19T13:42:35Z", "creator": "dhryvastov@serena.com", "creation_time": "2015-06-19T13:42:35Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 58055, "attachment_id": null, "id": 183644, "time": "2015-06-19T13:45:03Z", "creator": "markt@apache.org", "creation_time": "2015-06-19T13:45:03Z", "is_private": false, "text": "You need to raise this issue against Commons DBCP (https://issues.apache.org/jira/browse/DBCP) since Tomcat uses a packaged renamed (to avoid conflicts) copy of Commons DBCP to provide database connection pooling."}]