[{"count": 0, "tags": [], "text": "When the embedded container scans the classpath for the TLDs using the StandardJarScanner (line 199) it verifies if the Classpath entry is a jar or if should scanAllFiles (by default its false). On eclipse, when you have a open artifact, the classloader (WebAppClassLoader) will load its url as file://path/to/workspace/project/classes, the scanner will ignore that entry and that will generate error when accessing jsps that need the tld.\n\nIf you set the scanAllFiles to true, the scan finds the TLD, and creates the TldResourcePath without a entry name. When jasper tries to compile the JSP that uses a tag defined in the TLD, it parses the taglib it creates a TagLibraryInfoImpl. When JspUtil.getInputStream tries to load the file to determine the enconding it throws FileNotFound cause it tries to search only with relative path (Ex: /META-INF/tld.tld) instead of using the full path file://path/to/workspace/project/classes/META-INF/tld.tld\n\nShouldnt the absFileName be the complete path instead of the relative?\n\nI dont know if is a bug or a feature", "attachment_id": null, "id": 183758, "creator": "hm1rafael@gmail.com", "time": "2015-06-25T23:36:18Z", "bug_id": 58076, "creation_time": "2015-06-25T23:36:18Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 58076, "attachment_id": null, "id": 183759, "time": "2015-06-26T06:51:51Z", "creator": "markt@apache.org", "creation_time": "2015-06-26T06:51:51Z", "is_private": false, "text": "If you can provide the steps to reproduce this bug on a clean install of the latest stable Tomcat 8.0.x release then this is a Tomcat bug. Otherwise it looks like a bug in the Eclipse integration (not something the Tomcat team is involved in).\n\nWithout steps to reproduce this issue in a stand-alone Tomcat installation this issue will be resolved as invalid."}, {"count": 2, "tags": [], "bug_id": 58076, "attachment_id": null, "id": 184184, "time": "2015-07-27T09:27:59Z", "creator": "markt@apache.org", "creation_time": "2015-07-27T09:27:59Z", "is_private": false, "text": "No information provided after a month, therefore closing as INVALID."}]