[{"count": 0, "tags": [], "text": "We've just released poi-visio, an Apache 2.0 licensed .vsdx parser built on POI. It would be great to add this to the suite of parsers that POI currently has.\n\nOne blocking constraint is that the project depends on this patch that's been open for at least 6 months: https://bz.apache.org/bugzilla/show_bug.cgi?id=57484\n\nGithub link: https://github.com/BBN-D/poi-visio", "attachment_id": null, "bug_id": 58087, "id": 183817, "time": "2015-06-30T23:01:14Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-06-30T23:01:14Z", "is_private": false}, {"count": 1, "tags": [], "creator": "apache@gagravarr.org", "text": "It's certainly something we could look at doing, but you would need to push through some paperwork on your side. The process we'd need to follow is described at http://incubator.apache.org/ip-clearance/index.html - given the organisations mentioned in the readme of the project, do you think we have any hope of getting the OK + fairly simple grant form done before the heat-death of the universe? :)\n\nIn the mean time, could you do a patch for https://svn.apache.org/repos/asf/poi/site/src/documentation/content/xdocs/related-projects.xml to mention the project?", "id": 183818, "time": "2015-06-30T23:13:52Z", "bug_id": 58087, "creation_time": "2015-06-30T23:13:52Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58087, "attachment_id": null, "text": "Interestingly enough, we started the process to open source some projects last September, and finally figured out most of the red tape issues -- so this project only took about two months to get out into the open. The government doesn't own any IP in the project, so we would only need to get our legal to sign off on any CLA et al... and I think we might be able to avoid our parent company. So, maybe a month or two if I keep bothering them.\n\nI'll submit a patch for the external projects site. Also, I'd love for you to push my other patch (57484) that way I don't have to maintain a fork of POI. :)", "id": 183822, "time": "2015-07-01T03:03:22Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-07-01T03:03:22Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 58087, "attachment_id": null, "id": 184051, "time": "2015-07-16T17:17:22Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-07-16T17:17:22Z", "is_private": false, "text": "Sorry for the delay, been off vacationing... \n\nMy understanding of the documents you linked to seems to imply that there are two ways this could work out.\n\na) If my company signs the Corporate CLA, then the code can be imported under that agreement\nb) The other way is they could sign the software grant form (http://www.apache.org/licenses/software-grant.txt), no Corporate CLA required\n\nDoes that sound about right?"}, {"count": 4, "tags": [], "bug_id": 58087, "attachment_id": null, "text": "Ping?", "id": 184473, "time": "2015-08-11T18:57:01Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-08-11T18:57:01Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 58087, "attachment_id": null, "text": "Sorry, yes. Your company can either do a standalone Software Grant, or they can file a CCLA and include a Software Grant in it. Best practice is normally to pop the source code tarball/zip somewhere, take a suitable hash of it, and include the hash in the grant. That way, people can review the code before, and it's quite clear what the grant covered.\n\nYou personally should try to get an ICLA on file, so we can get you on board to help maintain the code post-contribution.\n\nWhether or not a CCLA is needed post-grant depends on the company in question. What Apache really needs after that is an ICLA, where you (as the ongoing contributor) basically confirm you've understood the Apache Software License v2, and are willing + able to contribute under it. Depending on your employment contract, you might not be able to sign that on your own, if so, a CCLA can be helpful to show that your employer is happy for you to be committing work that your employment contract says is \"theirs\" to the ASF.\n\nHope that helps? Sorry for the delay, I think everyone thought that someone else was going to reply...", "id": 184474, "time": "2015-08-11T19:08:14Z", "creator": "apache@gagravarr.org", "creation_time": "2015-08-11T19:08:14Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 58087, "attachment_id": null, "text": "A CCLA + software grant form has been filled out and emailed to the Apache Foundation secretary.", "id": 184557, "time": "2015-08-13T22:47:40Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-08-13T22:47:40Z", "is_private": false}, {"count": 7, "tags": [], "creator": "apache@gagravarr.org", "text": "Great stuff. Next step is to fill out the IP clearance template, and give the IPMC a chance to review it. http://incubator.apache.org/ip-clearance/ip-clearance-template.html . I can hopefully do that on the weekend, if no-one beats me to it!", "id": 184562, "time": "2015-08-14T06:39:36Z", "bug_id": 58087, "creation_time": "2015-08-14T06:39:36Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 58087, "attachment_id": null, "text": "I've started on the clearance template, more still to do. It's at http://incubator.apache.org/ip-clearance/poi-visio.html and the source is https://svn.apache.org/repos/asf/incubator/public/trunk/content/ip-clearance/poi-visio.xml", "id": 184660, "time": "2015-08-19T17:54:50Z", "creator": "apache@gagravarr.org", "creation_time": "2015-08-19T17:54:50Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 58087, "attachment_id": null, "text": "Thanks Nick!\n\nOne thing I neglected to add to the software grant was https://github.com/BBN-D/ooxml-visio-schemas, which is required to run the existing code.\n\nI think though, that if POI were to adopt this code, that it would make more sense to just integrate the correct XSD with the existing ooxml packages, instead of creating a new one just for visio.\n\nThe PDF download page for the visio specification (https://msdn.microsoft.com/en-us/library/hh645006%28v=office.12%29.aspx) says \"Regardless of any other terms that are contained in the terms of use for the Microsoft website that hosts this documentation, you may make copies of it in order to develop implementations of the technologies described in the Open Specifications and may distribute portions of it in your implementations using these technologies or your documentation as necessary to properly document the implementation.\".\n\nWhich is good. The XSD is in appendix A of the specification, and has a BSD style license and \"No right to create modifications or derivatives of this Specification is granted herein.\"... but I assume the download page notice takes precedence.", "id": 184662, "time": "2015-08-19T18:09:39Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-08-19T18:09:39Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 58087, "text": "Those looks like they're covered by the same terms as the other OOXML schemas we use, such as the Microsoft OSP, so I think that should be fine to use the same way", "count": 10, "id": 184760, "time": "2015-08-26T11:33:18Z", "creator": "apache@gagravarr.org", "creation_time": "2015-08-26T11:33:18Z", "is_private": false}, {"count": 11, "tags": [], "text": "On a different topic, I wonder how easy/hard it might be to replace the curves external library dependency with the same approach taken in the new common SL code, eg org.apache.poi.sl.draw.geom.Path?", "attachment_id": null, "bug_id": 58087, "id": 184761, "time": "2015-08-26T11:37:37Z", "creator": "apache@gagravarr.org", "creation_time": "2015-08-26T11:37:37Z", "is_private": false}, {"count": 12, "tags": [], "bug_id": 58087, "text": "I tried using java.awt.geom for all my drawing needs, but the one item that I could not find (and did not want to write) was a NURBS spline implementation (and splines are used in visio all over the place, it turns out). I believe that the NURBS spline is the only thing that is used from curvesapi.\n\ncurvesapi is from an apparently unmaintained package on sourceforge.", "id": 184764, "time": "2015-08-26T13:25:09Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-08-26T13:25:09Z", "is_private": false, "attachment_id": null}, {"count": 13, "tags": [], "creator": "dustin@virtualroadside.com", "text": "I've put together a first pass at integration on this branch on github:\n\nhttps://github.com/virtuald/poi/tree/xdgf\n\nUsing the XSD integration branch as a starting point (bug 58408) I first copied the original code over to src/ooxml (1st commit), and then ran the eclipse formatter on the code using POI's custom profile (2nd commit), and then added the curvesapi dependency. Compile + test seems to work.\n\nNext, I'll do some cleanup, and I'll add a text extractor + unit test. I suspect at some point some basic code review from someone would be useful, and I can do those adjustments as necessary also.", "id": 185354, "time": "2015-09-19T16:46:45Z", "bug_id": 58087, "creation_time": "2015-09-19T16:46:45Z", "is_private": false, "attachment_id": null}, {"count": 14, "tags": [], "bug_id": 58087, "attachment_id": null, "text": "Ok, added some cleanup plus some simple tests. Waiting on a light code review of some sort, then I'll \"git svn dcommit\" it to trunk.", "id": 185355, "time": "2015-09-19T19:58:27Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-09-19T19:58:27Z", "is_private": false}, {"count": 15, "tags": [], "bug_id": 58087, "text": "Now that POI 3.13 has been released, anything left to do here other than push the code in? I'll be traveling starting tomorrow, so I won't be able to push my changes in until Saturday at the earliest.", "id": 185521, "time": "2015-09-29T01:51:13Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-09-29T01:51:13Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 58087, "text": "Overall it looks good, although i did not look into the code in detail. Some more unit testing would be nice to get at least part of the code covered a bit more as otherwise overall coverage will drop a lot when this is pushed in.", "count": 16, "id": 185534, "time": "2015-09-29T12:44:44Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2015-09-29T12:44:44Z", "is_private": false}, {"count": 17, "tags": [], "bug_id": 58087, "attachment_id": null, "id": 185675, "time": "2015-10-07T03:14:18Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-10-07T03:14:18Z", "is_private": false, "text": "I guess at this point my main question is whether the IP stuff has been completed? If it is, then I'd like to push my changes in that way others can play with it and we can see what's broken (or not).\n\nI think I've figured out how to run the coverage tests... on the scale of POI, it's really not so bad. Looks like there's ~2100 lines of XDGF code, with 1400 missed lines. 30% is better than I would have guessed.\n\nI mean, one low-effort solution that I could throw together to bump up the coverage is just add a document with a lot of crazy stuff in it, and add a test to parse that."}, {"count": 18, "tags": [], "bug_id": 58087, "attachment_id": null, "id": 185680, "time": "2015-10-07T09:50:35Z", "creator": "apache@gagravarr.org", "creation_time": "2015-10-07T09:50:35Z", "is_private": false, "text": "The IP Clearance has passed (well, a week or so ago, but I've only just remembered to update the site...)\n\nYou are now clear to go ahead and import the code from Github + update the license headers\n\nTest coverage wise, we tend to test problematic/complex/confusing/key/heavily-reused parts of the code with \"true\" code-level unit tests. Most other parts get tested by doing create/save/load/read or load/modify/save/load/read or read/check type unit/basic-integration tests. \n\nCreating a handful of small test files touching key areas of functionality, then adding read+check and read+text-extract tests is probably the quickest way to increase coverage. Then look at using those for read+change+save+read+check tests, and if possible later create+save+\"ensure roughly the same as this other one\" tests!"}, {"count": 19, "tags": [], "creator": "dominik.stadler@gmx.at", "text": "Feature is imported for a long time now, unfortunately test-coverage never \"materialized\", however this bug should indicate that the feature itself is available for now, thus marking as FIXED.", "id": 201344, "time": "2017-10-08T07:24:00Z", "bug_id": 58087, "creation_time": "2017-10-08T07:24:00Z", "is_private": false, "attachment_id": null}]