[{"count": 0, "tags": [], "bug_id": 58094, "attachment_id": null, "is_private": false, "id": 183854, "time": "2015-07-02T15:37:42Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-07-02T15:37:42Z", "text": "Running tests for release candidate of Tomcat 7.0.63, I see a lot of the following messages in the logs:\n\n<some date and time> org.apache.tomcat.util.modeler.Registry registerComponent\nSEVERE: Null component Tomcat:type=Cache,host=localhost,context=/login\n\nThe above message is from org.apache.catalina.authenticator.TestSSOnonLoginAndBasicAuthenticator test, but the same message (with different context path) occurs in many test cases. When running whole testsuite with Java 7 and all 3 connectors, the message is found in 165 test result files out of 543.\n\nI am running with Access Logging enabled by the following setting in build.properties, but I think it does not matter:\n\ntest.accesslog=true\n\n\nThis message is absent from 7.0.62 test logs, so it is a regression in this specific version of Tomcat 7.\n\nLooking into Apache Gump logs, this message is present in tomcat-tc7.0.x-test-nio results for the above mentioned test case, but absent in tomcat-tc8.0.x-test-nio, tomcat-trunk-test-nio, so Tomcat 8 and trunk do not have this issue."}, {"count": 1, "tags": [], "bug_id": 58094, "attachment_id": null, "is_private": false, "id": 183857, "time": "2015-07-02T15:51:20Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2015-07-02T15:51:20Z", "text": "This log message is not observed during normal standalone use of Tomcat (e.g. smoke-testing the examples webapp). So it is something specific to embedded Tomcat configuration used by test cases."}, {"count": 2, "tags": [], "creator": "remm@apache.org", "is_private": false, "text": "I see no way this is a regression. It's just the cache that is null, probably because the resources is not the usual BaseDirContext and so the cache is null. It's harmless and could use a null check.", "id": 183858, "time": "2015-07-02T16:04:41Z", "bug_id": 58094, "creation_time": "2015-07-02T16:04:41Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "remm@apache.org", "is_private": false, "id": 183860, "creation_time": "2015-07-02T16:14:44Z", "time": "2015-07-02T16:14:44Z", "bug_id": 58094, "text": "r1688854 for a fix that removed the bad logging for me. It's really specific to the testsuite and its empty resources.", "attachment_id": null}]