[{"count": 0, "tags": [], "text": "Version 2.4.10 listed in the mandatory bug field, but appears to apply to most recent versions.\n\nIn migrating a server from one OS to another, I consulted the man pages to find the relevant differences.  However, the man pages are inaccurate and misleading.\n\nThe raw man page sources start with:\n.\\\" XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n.\\\" DO NOT EDIT! Generated from XML source.\n.\\\" XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\nEvidently something is wrong with the generation process or the \"XML source\" (or maybe XML isn't the right tool).\n\nFor example, on openSUSE Linux 13.1 with Apache 2.4.6 installed, man httpd2 says:\n\"-d serverroot\n              Set the initial value for the ServerRoot directive to serverroot. This can be overridden by the ServerRoot directive in the configuration file. The default is /usr/local/apache2.\n\n       -f config\n              Uses the directives in the file config on startup. If config does not begin with a /, then it is taken to be a path relative to the ServerRoot. The default is conf/httpd.conf.\"\n\nBut there is no \"/usr/local/apache2\" directory.  Obviously, there cannot therefore be a \"conf/httpd.conf\" relative to that nonexistent directory.\n\nOn NetBSD 6.1.5 with Apache 2.4.10 installed, man httpd says:\n\"-d serverroot\n              Set the initial value for the ServerRoot directive to\n              serverroot. This can be overridden by the ServerRoot directive\n              in the configuration file. The default is\n              /usr/pkg/share/httpd/htdocs.\n\n       -f config\n              Uses the directives in the file config on startup. If config\n              does not begin with a /, then it is taken to be a path relative\n              to the ServerRoot. The default is conf/httpd.conf.\"\n\nThe directory /usr/pkg/share/httpd/htdocs exists, but it isn't where the documents are located either before or after the configuration file is read.\nMoreover, there is no \"conf\" subdirectory under /usr/pkg/share/httpd/htdocs, so the configuration file cannot (and is not) read from \"httpd.conf\" there.\n\nOn OpenIndiana oi_151a9 with Apache 2.2.26 installed, man httpd says:\n\"-d serverroot\n          Set the initial value for the ServerRoot  directive  to\n          serverroot.  This  can  be overridden by the ServerRoot\n          directive in the configuration  file.  The  default  is\n          /usr/local/apache2.\n\n     -f config\n          Uses the directives in the file config on  startup.  If\n          config  does not begin with a /, then it is taken to be\n          a path relative  to  the  ServerRoot.  The  default  is\n          conf/httpd.conf.\"\n\nAnd again, there is no /usr/local/apache2 directory.\n\nThe only reliable way to find the (apparently hard-coded at compile-time) true defaults appears to be:\n1. locate the httpd or httpd2 executable (a little tricky on OpenIndiana (and presumably other Solaris-like systems) because it cannot be found via $PATH)\n2. run the executable with the \"-V\" flag\n3. translate the (very different) nomenclature used in -V to the corresponding nomenclature used in the man page and configuration file(s) (e.g. the equivalent of \"ServerRoot\" (man page and configuration files) is apparently \"HTTPD_ROOT\" in -V output-ese)\n\nAs the same sort of discrepancies show up across multiple OSes and distributions, this appears to be a core Apache httpd-2 issue rather than a case of distribution-specific packaging issues.\n\nAs an aside, it would be nice if the build process used the same nomenclature as the documentation and configuration (i.e. \"ServerRoot\" instead of \"HTTPD_ROOT\") to obviate the need for a translation phrasebook...", "attachment_id": null, "id": 184000, "creator": "bruce.lilly@gmail.com", "time": "2015-07-12T15:14:04Z", "bug_id": 58129, "creation_time": "2015-07-12T15:14:04Z", "is_private": false}, {"count": 1, "tags": [], "text": "Hi,\n\nI think you should file this bug to the distributions. The httpd project neither does create distributor packages nor can it support them. The paths given here are for the httpds own installation process.\n\nI'm not exactly sure, what the httpd bug here should be. Could you elaborate?", "is_private": false, "id": 184007, "creator": "nd@perlig.de", "time": "2015-07-13T07:53:09Z", "bug_id": 58129, "creation_time": "2015-07-13T07:53:09Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58129, "attachment_id": null, "id": 184019, "time": "2015-07-14T00:51:39Z", "creator": "bruce.lilly@gmail.com", "creation_time": "2015-07-14T00:51:39Z", "is_private": false, "text": "To be quite clear:\nThe default file and directory locations are established during configure prior to building from sources (e.g. via --prefix=).  These are then hard-coded into the httpd executable.\nThe default prefix, not the configured default location, is what is written in docs/man/httpd.8 as distributed in the source tarball.\n\nOne of the problems is that httpd.8 is *NOT* updated to reflect the configured default locations.\nA related problem is that 'make install' as directed in http://httpd.apache.org/docs/2.4/install.html installs -- without notice or warning -- the *unmodified* httpd.8 (as part of the generated Makefile install-man target).\nThere is certainly nothing in the generated Makefile nor in the \"Compiling and Installing\" instructions that would result in httpd.8 being \"Generated from XML source\" to reflect the actual configured and compiled-in locations.\nhttp://httpd.apache.org/docs/2.4/install.html does not even mention the documentation, the generation of which is apparently only described in a separate, well-hidden area not likely to be seen by anybody following the \"Compiling and Installing\" instructions.\n\nTo make matters worse, the gobbledygook hidden away regarding building the documentation doesn't even mention the man pages -- at all.  I refer specifically to http://mirror.symnds.com/software/Apache//httpd/docs/README.html and http://httpd.apache.org/docs-project/docsformat.html (\"Module Format and Transformation\").\nIt is unclear (to me) whether or not going following what's hidden there would result in pages being updated to reflect as-configured builds.\n\nIt is unreasonable to pin the blame for this on every single distribution, since the Apache-distributed tarballs, the \"Compiling and Installing\" procedure, and the (frankly) poorly documented procedure for building the documentation directly result in this problem."}, {"count": 3, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "id": 187753, "time": "2016-01-16T23:38:52Z", "bug_id": 58129, "creation_time": "2016-01-16T23:38:52Z", "is_private": false, "text": "Hi Bruce,\n\nI completely understand your points and indeed is not intuitive to figure out how to build the man pages. Under $YOUR_SVN_REPO_DIR/httpd-trunk/docs/manual/build there is a file called build.sh that offers various targets as stated in https://httpd.apache.org/docs-project/docsformat.html:\n\n./build.sh -projecthelp\n\n..\n..\n man-da          - builds the Dansk nroff files\n man-en          - builds the English nroff files\n man-tr          - builds the Turkish nroff files\n..\n..\n\nIt is not that clear though and we need to add a reference to it in the files that you mentioned. I am a bit new to the documentation project but I'll try to figure out how to improve the issue with the use of --prefix=\n\nI'll post in here my progress, hopefully we'll have something better soon :)\n\nLuca"}]