[{"count": 0, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "text": "We've had quite a few discussions about it on the mailing list, such as <http://mail-archives.apache.org/mod_mbox/poi-user/201103.mbox/%3CAANLkTi=mP_bQ7O+T34szv7eWq6nq1u187+gtb=Sjcnmt@mail.gmail.com%3E>, but I don't believe we have any code yet which can tell you which (if any) conditional formatting rules apply to a given cell. For some Excel -> Other use cases, that's something you'd like to be able to know\n\nIt would therefore be good to have an evaluator, which can tell you which rules apply to a given cell (including taking account of priorities / formulas / percentages), and which state within that applies (eg for a red/yellow/green format, which one it would be)\n\nIt looks like the ASFv2 licensed Vaadin has some support for this already:\nhttp://demo.vaadin.com/javadoc/com.vaadin.addon/vaadin-spreadsheet/1.0.0.beta1/com/vaadin/addon/spreadsheet/ConditionalFormatter.html - we might be able to interest them in contributing that back to speed the development effort involved!", "id": 184002, "time": "2015-07-12T15:38:59Z", "bug_id": 58131, "creation_time": "2015-07-12T15:38:59Z", "is_private": false}, {"count": 1, "tags": [], "creator": "gwoolsey@apache.org", "attachment_id": null, "text": "I implemented most of this with r1782894, see \n\nhttps://poi.apache.org/apidocs/org/apache/poi/ss/formula/ConditionalFormattingEvaluator.html\n\nThis does not currently implement any assistance in finding the applicable format bucket from partitioned formats (color, icon, etc.), but does evaluate whether that format applies to a cell or not.  Implementations can then take the applied format rule and determine which bucket the current value belongs to.\n\nAlong with this, WorkbookEvaluator has new evaluate(...) methods for non-cell formula evaluations like these.", "id": 197257, "time": "2017-02-24T19:23:19Z", "bug_id": 58131, "creation_time": "2017-02-24T19:23:19Z", "is_private": false}]