[{"count": 0, "tags": [], "creator": "bruce.lilly@gmail.com", "is_private": false, "text": "Mandatory version field in bug set to 2.4.10, but this applies to all recent versions.\n\nTraditional (e.g. UNIX v7 and later man pages, such as at https://docs.oracle.com/cd/E36784_01/html/E36871/makehtml-id-0.html#REFMAN1Mmakehtml-id-1) and standardized (e.g. The Open Group Base Specifications Issue 7, Shell & Utilities, Introduction, 1.4 Utility Description Defaults) man page layout summarizes important files used by a command or program in the \"FILES\" or \"INPUT FILES\" and/or \"OUTPUT FILES\" section(s).  Such layout makes it easy to find relevant information about important files (e.g. configuration files) simply by searching for \"FILES\".\n\nApache httpd-2 man pages, including especially the page for httpd itself, lack such structure, and consequently it is tedious to find the relevant information (lack of accuracy of the information, as reported in Bug 58129, is a separate issue).\n\nThe documents referenced above should make clear what is desired of well-organized man pages; specifically for FILES, quoting in part from a couple of the referenced documents:\n\"FILES\nThis section lists all file names referred to by the man page, files of interest, and files created or required by commands. Each is followed by a descriptive summary or explanation.\"\n\n\"INPUT FILES\n\nThe INPUT FILES section describes the files, other than the standard input, used as input by the utility. It includes files named as operands and option-arguments as well as other files that are referred to, such as start-up and initialization files, databases, and so on.\"", "id": 184003, "time": "2015-07-12T16:14:44Z", "bug_id": 58132, "creation_time": "2015-07-12T16:14:44Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 58132, "attachment_id": null, "text": "Addendum: for a vendor-specific example of useful standardized layout for Apache httpd-2, see https://docs.oracle.com/cd/E36784_01/html/E36871/apache2-1m.html#scrolltoc", "id": 184004, "time": "2015-07-12T16:24:10Z", "creator": "bruce.lilly@gmail.com", "creation_time": "2015-07-12T16:24:10Z", "is_private": false}]