[{"count": 0, "tags": [], "text": "After installation of Tomcat on NT4, the Jakart Tomcat service fails to load.  \nIt causes the following error when trying to start the service:\n\nCould not start the Jakarta Tomcat service on <hostname>.\nError 2140: An internal Windows NT error occurred.\n\nAn inspection of the event log showed that Tomcat failed to start the JVM.  \nThis led me to the registry, where I discovered the following:\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Jakarta Tomcat\\Parameters:\n\nJVM Library=\"C:\\Program\"\nJVM Option Number 0=\"Files\\Javasoft\\jdk1.3.1\\jre\\bin\\hotspot\\jvm.dll\"\n\nAs you can see, the installation crapped out on the space between \"Program \nFiles\".  As I was not 100% sure about the second parameter, I fixed both to say \nthe same thing:\n\nJVM Library=\"C:\\Program Files\\Javasoft\\jdk1.3.1\\jre\\bin\\hotspot\\jvm.dll\"\nJVM Option Number 0=\"C:\\Program Files\\Javasoft\\jdk1.3.1\\jre\\bin\\hotspot\\jvm.dll\"\n\nThis fixed the problem.  So, if you haven't done so already, you want to take a \nlook at the installation script and correct the problem.\n\n-David", "is_private": false, "id": 9565, "creator": "dvinas@mail.com", "time": "2002-01-11T12:15:32Z", "bug_id": 5815, "creation_time": "2002-01-11T12:15:32Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 5815, "text": "I have no idea why it would do that, unless there's a bug in JavaService itself\n(in which case you're out of luck) as all the paths are correctly quoted in the\nmost current script (used in HEAD and in 4.0.2-b2).\n\nI don't know which version of the script may have been broken.\n\nI'll mark the bug as invalid (relative to the current builds). If it's a\nJavaService bug, the resolution should be won't fix.", "id": 9881, "time": "2002-01-24T19:38:23Z", "creator": "remm@apache.org", "creation_time": "2002-01-24T19:38:23Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 5815, "attachment_id": null, "text": "I'm thinking that the symptom of this bug is very similar to other situations \nI've seen regarding the stupid space in \"Program Files\" which causes some \ninstall scripts to choke.  It may be necessary to enclose the full path in \nquotes within the script in order to make it work.  In any case, this may \nalready be fixed, as I'm using 4.0 b7.\n", "id": 9898, "time": "2002-01-25T00:43:17Z", "creator": "dvinas@mail.com", "creation_time": "2002-01-25T00:43:17Z", "is_private": false}, {"count": 3, "tags": [], "creator": "remm@apache.org", "is_private": false, "text": "I tried to quote the script, but I couldn't commit the changes to the bug until\nI removed it.\nHere's the link:\nhttp://cvs.apache.org/viewcvs.cgi/jakarta-tomcat-4.0/tomcat.nsi?rev=1.25&content-type=text/vnd.viewcvs-markup\nSearch for the ExecWait command with tomcat.exe. It seems quoted to me. I\nchecked it, and in version 1.12 (which was in 4.0b7) the VM DLL path was unquoted.", "id": 9901, "time": "2002-01-25T00:50:19Z", "bug_id": 5815, "creation_time": "2002-01-25T00:50:19Z", "attachment_id": null}]