[{"count": 0, "tags": [], "creator": "remi.lebastard@flexcom.lu", "text": "When using the manager to deploy a war file (using html or text version of the manager), the response sent from the tomcat manager appears before the application ends its starting. \nIt appears after deployment but before application's context is fully up. That means if the application fails in its start process, Tomcat manager will already have answered that the application has been deployed.\n\nIt was not the case with Tomcat 7.0.61.\nIt affects versions 7.0.63, and 7.0.62 of the Tomcat manager.\n\nThe parameters used are: \n- war file located on server (/home/xxx.war),\n- update = true,\n- simple context (my-context)\n\nMaybe the response has become asynchronous when Tomcat manager is deploying war file ? \nIt would be very strange since the reload is not asynchronous in all Tomcat versions.", "id": 184206, "time": "2015-07-28T14:03:14Z", "bug_id": 58187, "creation_time": "2015-07-28T14:03:14Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 184402, "time": "2015-08-07T09:27:03Z", "bug_id": 58187, "creation_time": "2015-08-07T09:27:03Z", "is_private": false, "text": "There have been no changes to the manager package in 7.0.x since 7.0.58 and the change then was to simply update the copyright year to 2015.\n\nThe Manager will not write a response until the start() event has completed for the Context. If Context.start() throws an exception, the Manager will report it.\n\nIt is possible for Context.start() to complete without exception but end up in the failed state. In this case the deployer will report successful deployment (the WAR was copied and deployed) but the Context will be listed as not running.\n\nIf you can provide a simple WAR file that demonstrates different behavior with 7.0.61 and 7.0.62 I'll take another look."}, {"count": 2, "tags": [], "creator": "remi.lebastard@flexcom.lu", "attachment_id": 32979, "id": 184410, "time": "2015-08-07T13:19:52Z", "bug_id": 58187, "creation_time": "2015-08-07T13:19:52Z", "is_private": false, "text": "Created attachment 32979\nTomcat 7.0.61 normal deploy\n\nNormal deployment process in Tomcat manager 7.0.61: application is deployed and Tomcat manager send the response after deployment."}, {"count": 3, "tags": [], "bug_id": 58187, "attachment_id": 32980, "text": "Created attachment 32980\nDisfunctional deployment on Tomcat 7.0.62\n\nDisfunctional deployment process in Tomcat manager 7.0.62: application is deployed and Tomcat manager send the response BEFORE deployment.", "id": 184411, "time": "2015-08-07T13:23:36Z", "creator": "remi.lebastard@flexcom.lu", "creation_time": "2015-08-07T13:23:36Z", "is_private": false}, {"count": 4, "attachment_id": null, "bug_id": 58187, "is_private": false, "id": 184553, "time": "2015-08-13T19:56:02Z", "creator": "markt@apache.org", "creation_time": "2015-08-13T19:56:02Z", "tags": [], "text": "The video is corrupt and can't be played (tested on multiple devices).\n\nMy previous comments stand. Without a WAR to demonstrate this issue, it will remain invalid."}, {"count": 5, "tags": [], "creator": "remi.lebastard@flexcom.lu", "attachment_id": null, "id": 184565, "time": "2015-08-14T07:34:12Z", "bug_id": 58187, "creation_time": "2015-08-14T07:34:12Z", "is_private": false, "text": "Sorry the video can be read on Chrome (I just try now) by on Firefox it seems to considered it corrupted!\n\nThe WAR doesn't matter: for the video I take the jenkins.war that can be found here http://mirrors.jenkins-ci.org/war/latest/jenkins.war.\n\nI called the URL xxxx/manager/text/deploy?path=/jenkins&war=c:/jenkins.war&update=true on Tomcat 7.0.61 and on Tomcat 7.0.62.\n\nOn Tomcat 7.0.61: application is deployed and Tomcat manager send the response after deployment.\n\nOn Tomcat 7.0.62: Tomcat send the reponse and the application is deployed after the notification."}, {"count": 6, "tags": [], "text": "Have you tried before putting it invalid and resolved ? I know that you should have plenty of bugs not accurate but here, it seems to be legitimate.\n\nI will inspect the source code to find out the bug and if I submit a patch, will you accept it ?", "is_private": false, "bug_id": 58187, "id": 184682, "time": "2015-08-21T13:50:20Z", "creator": "remi.lebastard@flexcom.lu", "creation_time": "2015-08-21T13:50:20Z", "attachment_id": null}, {"count": 7, "attachment_id": null, "bug_id": 58187, "is_private": false, "id": 184683, "time": "2015-08-21T15:33:31Z", "creator": "markt@apache.org", "creation_time": "2015-08-21T15:33:31Z", "tags": [], "text": "Yes, I have tested it. I have also spent a fair amount of time reviewing the code changes.\n\nThere are several reasons why I am resolving this as invalid.\n\n1. No steps have been provided to reproduce this on a clean Tomcat install. I've attempted to look at the videos on a range of platforms and browsers and all of them fail. Even if they did work, I doubt they would provide all of the necessary information.\n\n2. The suggested test WAR (Jenkins) deploys and starts for me on 7.0.HEAD once I increase the upload limits for the Manager and run on Java 7.\n\n3. There were no code changes to the relevant parts of the code between 7.0.61 and 7.0.62.\n\n4. The behaviour when deploying jenkins when running on Java 6 is exactly the same in 7.0.61 and 7.0.HEAD. The Manager reports OK but Jenkins is not started.\n\nNotes:\na) My previous statement that the Manager would report any excpetion thrown by context start was incorrect. It will report 'OK' for the deployment (by design and unchanged from 7.0.61) but the app will show as not started.\n\nb) The necessary changes to the upload limits is one of the steps to reproduce missing from this report.\n\nc) The requirement to use Java 7 was also missing from the report\n\n\nAt this point I would be very surprised if there was a valid bug to be found here. Please do not re-open this report unless you can provide the following:\n\n1. A WAR (as small as possible) or a link to a WAR that triggers different behaviour on Tomcat 7.0.61 compared to one of:\n- 7.0.62\n- the latest stable 7.0.x release\n- the latest 7.0.x code build from svn\n\n2. The configuration changes to apply to the clean Tomcat installs (they must be identical for both) before attempting the deployment test."}, {"count": 8, "tags": [], "creator": "remi.lebastard@flexcom.lu", "text": "Thank you for the time you spend for this report. I will try to be the more precise I can. \n\nSteps to reproduce:\n\nOn Tomcat 7.0.61:\n- Take the Tomcat v7.0.61 from the archives\n- Don't change anything to configuration (all parameters are leaved to default values (autoDeploy is true for example)) except the tomcat-users.xml file to access the manager\n- Put the WAR provided in the webapp folder to start it as soon as Tomcat starts\n- Start the Tomcat servers and wait for it completes its start (and the deployment of all applications)\n- Call the URL http://localhost:8080/manager/text/deploy?path=/sample&war=file:C:/sample.war&update=true with the same WAR that has been dropped in webapp folder (of course the paths need to be adapted)\n- See that on browser, the OK response appears AFTER the undeploy and redeploy of the WAR provided\n\nOn Tomcat 7.0.62:\n- Take the Tomcat v7.0.62 from the archives\n- Don't change anything to configuration (all parameters are leaved to default values (autoDeploy is true for example)) except the tomcat-users.xml file to access the manager\n- Put the WAR provided in the webapp folder to start it as soon as Tomcat starts\n- Start the Tomcat servers and wait for it completes its start (and the deployment of all applications)\n- Call the URL http://localhost:8080/manager/text/deploy?path=/sample&war=file:C:/sample.war&update=true with the same WAR that has been dropped in webapp folder (of course the paths need to be adapted)\n- See that on browser, the OK response appears BEFORE the undeploy and redeploy of the WAR provided\n\n\nPlatforms tested:\n- Windows 7\n- Linux Ubuntu 10.04\n- JDK 1.7.0.67\n\n\nWar file:\nhttps://tomcat.apache.org/tomcat-7.0-doc/appdev/sample/\n\n\nWhat I mean by the response appears BEFORE is that the method \"writeDeployResult\" of the \"ManagerServlet\" is called BEFORE methods \"undeploy\" and \"deployWAR\" of the HostConfig class are called.\n\nI have searched in the source code why the behaviour have changed and you are totally right: it's not the manager that have changed but the org.apache.catalina.startup.HostConfig class that causes the change of behaviour (due to correction of another bug).\n\n\nThe change in source code is this one : \n\nOn Tomcat 7.0.62:\n....\n// File.lastModified() has a resolution of 1s (1000ms). The last\n// modified time has to be more than 1000ms ago to ensure that\n// modifications that take place in the same second are not\n// missed. See Bug 57765.\nif (resource.lastModified() != lastModified && (!host.getAutoDeploy() || resource.lastModified() < currentTimeWithResolutionOffset)) {....\n\nOn Tomcat 7.0.61:\n....\nif (resource.lastModified() > lastModified) {....\n\nI will not reopen that bug but let your reopen it if you considered it as a bug but definitively, there was a change in the code that have an impact on the deployment of application.", "id": 184730, "time": "2015-08-24T15:35:54Z", "bug_id": 58187, "creation_time": "2015-08-24T15:35:54Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "text": "Yep, that is a bug. Thanks for providing the necessary detail. The call to check(String) should be triggering a redeploy but it isn't because of the additional '1s' test.", "is_private": false, "bug_id": 58187, "id": 184790, "time": "2015-08-27T18:32:56Z", "creator": "markt@apache.org", "creation_time": "2015-08-27T18:32:56Z", "attachment_id": null}, {"count": 10, "tags": [], "text": "Fixed in trunk, 8.0.x (for 8.0.27 onwards) and 7.0.x (for 7.0.65 onwards).", "attachment_id": null, "bug_id": 58187, "id": 185035, "time": "2015-09-08T10:24:57Z", "creator": "markt@apache.org", "creation_time": "2015-09-08T10:24:57Z", "is_private": false}]