[{"count": 0, "tags": [], "text": "Created attachment 32949\nDon't strip port from http Host header in httpclient 3 and use port from header in httpclient 4\n\nThe port numbers in a user defined http Host header differ by client implementations in http sampler.\n\n* httpclient 4 will replace the port number with the port number extracted from the sampler\n* httpclient 3 will remove the port number entirely\n* javaclient will leave the port number untouched\n\nThis behaviour is inconsistent and the httpclient behaviour is probably not wanted by the users (see http://jmeter.markmail.org/thread/457kefpz4cmtlqvd)\n\nThe implementation was updated in response to bug #51775. In my tests the attached patch does not exhibit the described double port number when using a proxy and specifying the host header explicitly. Maybe the httpclient implementations where changed in between.", "attachment_id": 32949, "bug_id": 58201, "id": 184258, "time": "2015-07-31T19:25:12Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2015-07-31T19:25:12Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 58201, "attachment_id": null, "id": 184268, "time": "2015-08-01T14:16:42Z", "creator": "milamber@apache.org", "creation_time": "2015-08-01T14:16:42Z", "is_private": false, "text": "\nThe patch works with HC4 but not for HC3. The removing of the replaceFirst in HC3 come back the double port in headers Host key when you record a script (when the URL uses a port different of 80)\n\nProbably the HC3 has need the method getPortFromHostHeader() like the HC4."}, {"count": 2, "tags": [], "bug_id": 58201, "attachment_id": null, "id": 184276, "time": "2015-08-02T09:45:34Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2015-08-02T09:45:34Z", "is_private": false, "text": "OK, now I see the double port with httpclient 3.x. Strange that it only shows on our internal proxy. When I use a proxy setup in http sampler it doesn't show up."}, {"count": 3, "tags": [], "creator": "felix.schumacher@internetallee.de", "attachment_id": null, "text": "As I haven't found a way to make httpclient 3 correctly, I have only committed the changes for httpclient 4.\n\nThat will not make all samplers behave consistently, but it will allow httpclient to behave similar to the java sampler and let the user specify a port number.\n\nIn my eyes httpclient 3 still shows the wrong behaviour, but can't be changed.\n\nDate: Sun Aug 23 09:39:19 2015\nNew Revision: 1697158\n\nURL: http://svn.apache.org/r1697158\nLog:\nUse the port from a given host header, if available.\n\nBugzilla Id: 58201\n\nModified:\n    jmeter/trunk/src/protocol/http/org/apache/jmeter/protocol/http/sampler/HTTPHC4Impl.java\n    jmeter/trunk/xdocs/changes.xml", "id": 184706, "time": "2015-08-23T09:42:06Z", "bug_id": 58201, "creation_time": "2015-08-23T09:42:06Z", "is_private": false}]