[{"count": 0, "tags": [], "text": "Currently, the method write() in the class MAPIMessage  return an   UnsupportedOperationException. \nIs it possible to implement this method ?\n\nI try to save an Outlook message in attachment of an Outlook msg. Right now there is no way to do this. (without having an error when opening the message)\n\nThanks.", "attachment_id": null, "bug_id": 58211, "id": 184322, "time": "2015-08-05T07:55:38Z", "creator": "alexandre.brun@C6.eu", "creation_time": "2015-08-05T07:55:38Z", "is_private": false}, {"count": 1, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "is_private": false, "id": 184324, "time": "2015-08-05T08:37:19Z", "bug_id": 58211, "creation_time": "2015-08-05T08:37:19Z", "text": "To save out an attachment, your only current route is to grab the POIFS Directory that holds it, then use EntryUtils to save that into a new empty NPOIFS instance\n\nA write method would be good though, we'd love a patch with unit tests if you have time to write one!"}, {"count": 2, "tags": [], "text": "The way you describe to save out an attachment works fine with all  kinds of documents except outlook msg files.\nMsg files saved using this method will generate an error when I try to open it in Outlook. Outlook does not recognize the file saved.\nMaybe I should open a bug about that.\n\nI would like to provide you with a patch, unfortunately I have not enough knowledge about msg format.", "attachment_id": null, "bug_id": 58211, "id": 184330, "time": "2015-08-05T09:58:34Z", "creator": "alexandre.brun@C6.eu", "creation_time": "2015-08-05T09:58:34Z", "is_private": false}, {"count": 3, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "is_private": false, "id": 184331, "time": "2015-08-05T10:11:17Z", "bug_id": 58211, "creation_time": "2015-08-05T10:11:17Z", "text": "There must be some additional changes needed / bits missing when a msg attachment gets written out\n\nWhat would be helpful is if you could create a simple small sample message, with an attachment inside it. Raise a new bug for the msg attachment saving, and upload there the outer message, the outlook-saved attachment, and the POI saved attachment. Bonus marks if you can also run some of the POI dev tools (eg org.apache.poi.poifs.dev.POIFSLister) to compare how the POI-saved and Outlook-saved attachments differ\n\nAs for learning about the file format, the latest file format specs are available publicly at: https://msdn.microsoft.com/en-us/library/cc463912%28v=exchg.80%29.aspx?f=255&MSPPError=-2147217396"}, {"count": 4, "tags": [], "bug_id": 58211, "is_private": false, "text": "Okey, i will create a new bug with required files to solve the problem.", "id": 184332, "time": "2015-08-05T11:56:15Z", "creator": "alexandre.brun@C6.eu", "creation_time": "2015-08-05T11:56:15Z", "attachment_id": null}]