[{"attachment_id": 32982, "tags": [], "bug_id": 58224, "is_private": false, "count": 0, "id": 184414, "time": "2015-08-07T21:46:31Z", "creator": "ericwest838@gmail.com", "creation_time": "2015-08-07T21:46:31Z", "text": "Created attachment 32982\nGenerates an XSSF spreadsheet with various cell alignments\n\nThis is a re-statement of bug number 56981 because 56981\nis incomplete.  This may actually be an OpenOffice/LibreOffice bug.\nHorizontal and Vertical cell alignment does not work correctly\nin XSSF spreadsheets.  I am using POI 3.13 Beta1, and both the latest\nversions of OpenOffice and LibreOffice (as of 8/7/15).  The cell alignments\n**do work correctly** with MS Excel, leading me to believe it may be\nan Open/LibreOffice bug.  The attached code generates a spreadsheet\nwith left/center/right and top/center/bottom horizontal and vertical\nalignment. (9 cells total). If you look at it with OpenOffice, it is\nobviously wrong.  With MS Excel it is correct."}, {"count": 1, "tags": [], "text": "Can you try generating a file with that alignment in Excel? If so, then try loading it in AOO/LO and see how it looks? And load it in POI, read back the alignments, and see what POI sees?", "is_private": false, "bug_id": 58224, "id": 184415, "time": "2015-08-07T21:54:44Z", "creator": "apache@gagravarr.org", "creation_time": "2015-08-07T21:54:44Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58224, "attachment_id": null, "is_private": false, "id": 184416, "time": "2015-08-07T23:13:32Z", "creator": "ericwest838@gmail.com", "creation_time": "2015-08-07T23:13:32Z", "text": "(In reply to Nick Burch from comment #1)\n> Can you try generating a file with that alignment in Excel? If so, then try\n> loading it in AOO/LO and see how it looks? And load it in POI, read back the\n> alignments, and see what POI sees?\n\nIf I read the file into Excel and then save it, it will then read correctly\nin Libreoffice.  Also, if I just read the file back into POI, the cell \nalignments are correct."}]