[{"count": 0, "tags": [], "bug_id": 58233, "attachment_id": null, "text": "We're using Tomcat 7.0.61 as servlet container in production\nenvironment. I tried to configure servlet 3.0 multipart config\nannotations with Failed Request Filter.\nI've stuck and struggling trying to configure it well with myFaces\nJSF implementation. I found that root cause of that troubles in\nmaxSwallowSize attribute and handling it in IdentityInputFilter.\nWith configured maxSwallowSize=-1 FailedRequestFilter works well  - HTTP\n400 sent and client redirected to error page.\nBut using default maxSwallowSize attribute (2mb) or any other used for\nconnector - (with filesize > 2 MB) client doesn't get any answer, may be\nserver send after connection was reset and socket was closed.\nConnection was closed, because IdentityInputFilter threw IOException -\nafter that socket was immediately closed. So on client it looks like\nCONNECTION_RESET and blank page (request was sent, but no answer received).\nMay be I've lost something in my configuration.\n\nI've read mailing list and saw some pathes of your on\nFailedRequestFilter for maxUploadSize attributes in request. May be you\ncould give me some advices for searching a good way of Handling\nmaxFileUpload size exception handling.\nIt could be fixed by setting maxSwallowSize=-1, but it looks like a\nstrange hack. It couldn't go to production config as well, because\nbehaviour with handling -1 could be changed in IdentityInputFilter.\nMay be there any other ways of configuring and handling upload size\nexceeded limit in multipartconfigelement. I'll be cheking email, looking\nforward your replies and will be truly grateful for any advices. \n\nTest project page on github https://github.com/wadzapi/learnMultipartConfig", "id": 184475, "time": "2015-08-11T19:23:22Z", "creator": "wadzapi@gmail.com", "creation_time": "2015-08-11T19:23:22Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 58233, "attachment_id": null, "id": 184476, "time": "2015-08-11T19:24:58Z", "creator": "markt@apache.org", "creation_time": "2015-08-11T19:24:58Z", "is_private": false, "text": "Bugzilla is not a support forum. This belongs on the users mailing list."}]