[{"count": 0, "tags": [], "text": "I have a reproducible case where the bytes read with ServletInputStream via a javax.servlet.ReadListener are incorrect.\n\nThe code is an experiment with layering Reactive Streams over Servlet 3.1 non-blocking I/O. I apologize for not being able to create a more focused isolated example (I did try). That said it is a very basic example that hopefully with some debugging you can zero in on the issue.\n\nTo observe the failure, clone https://github.com/spring-projects/spring-reactive, then change the following read buffer size to 4096 https://github.com/spring-projects/spring-reactive/blob/master/src/main/java/org/springframework/reactive/web/servlet/HttpHandlerServlet.java#L37, then run the test https://github.com/spring-projects/spring-reactive/blob/master/src/test/java/org/springframework/reactive/web/servlet/HttpHandlerServletTomcatIntegrationTests.java.\n\nThe test sends an HTTP request with a body of 3 * 4096 bytes. The server echoes that back. However the returned body doesn't match starting at index 4096, which happens to be the start of the second chunk.\n\nOn the server requests are delegated to an HttpHandler which accepts a (Reactive Streams) Publisher for the input and returns a Publisher for the output. In the test the HttpHandler is EchoHandler which returns the input Publisher as the response Publisher effectively piping input directly to output. Underlying that are RequestBodyPublisher and ResponseBodySubscriber which adapt the Read/WriteListener to Reactive Streams.\n\nIncreasing the size of the array into which chunks are read to 4293 makes the tests pass.", "is_private": false, "id": 184457, "creation_time": "2015-08-10T16:06:43Z", "time": "2015-08-10T16:06:43Z", "creator": "rstoyanchev@yahoo.com", "bug_id": 58230, "attachment_id": null}, {"count": 1, "tags": [], "creator": "rstoyanchev@yahoo.com", "attachment_id": null, "id": 184477, "time": "2015-08-11T20:28:28Z", "bug_id": 58230, "creation_time": "2015-08-11T20:28:28Z", "is_private": false, "text": "As the referenced project will continue to change, I've created a fork where the code will remain stable until this issue is looked at. In the original instructions simply replace \"spring-projects\" with \"rstoyanchev\" in all links."}, {"count": 2, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 184492, "time": "2015-08-12T11:28:32Z", "bug_id": 58230, "creation_time": "2015-08-12T11:28:32Z", "text": "Thanks for the test case. I've got things to the point where I can run the test case in the IDE and I can see the failure. I'll start looking into what the root cause is."}, {"count": 3, "tags": [], "text": "Great, note the code is far from perfect with the EchoHandler essentially recursing (potentially endlessly) between reading and writing. I could be wrong but to my knowledge at least it's not doing anything not allowed in the Servlet API.", "is_private": false, "id": 184502, "creation_time": "2015-08-12T12:59:22Z", "time": "2015-08-12T12:59:22Z", "creator": "rstoyanchev@yahoo.com", "bug_id": 58230, "attachment_id": null}, {"count": 4, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 184524, "time": "2015-08-12T18:04:06Z", "bug_id": 58230, "creation_time": "2015-08-12T18:04:06Z", "text": "Fixed in trunk and 8.0.x for 8.0.25 onwards.\n\nThanks again for the test case."}, {"count": 5, "tags": [], "bug_id": 58230, "is_private": false, "id": 186432, "creation_time": "2015-11-18T12:59:51Z", "time": "2015-11-18T12:59:51Z", "creator": "remm@apache.org", "text": "That was actually caused by what broke the NIO2 connector in bug 57799, available() had a side effect that it would cause an IO read.\n\nThe fix was to remove the available() call, but is it certain this won't cause useless Servlet invocation (like maybe call onDataAvailable but then available would still be false ? If unsure, it is now possible to call available(false) instead without causing concurrency related corruption.", "attachment_id": null}]