[{"count": 0, "tags": [], "creator": "cgleckman@gmail.com", "is_private": false, "text": "Created attachment 33020\nConsole Output\n\nI have no idea how this is happening but this is the third time today that we have gotten this error. It seems to be pretty random when it occurs but I cant be sure. I am not even sure what information to provide here... Attached is a screen shot and a copy and paste of the console output. \n\nPlease let me know what other information you need from me.", "id": 184685, "time": "2015-08-21T19:44:11Z", "bug_id": 58266, "creation_time": "2015-08-21T19:44:11Z", "attachment_id": 33020}, {"count": 1, "tags": [], "bug_id": 58266, "text": "Can you please attach one of the files which triggers this exception?", "id": 184690, "time": "2015-08-21T21:48:35Z", "creator": "apache@gagravarr.org", "creation_time": "2015-08-21T21:48:35Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "cgleckman@gmail.com", "is_private": false, "text": "Hi Nick,\n\nI am sorry but it seems I will not be able to meet your request. You can close the ticket if you wish but I just wanted to notify you. \n\nAs a note, the program that uses this is rather large and I cant tell which one causes the issue specifically. Additionally, however, we narrowed it down to when we try and generate more than one report and then we also try and restart the program while this is happening. Obviously this should never happen but we like to test/break things around here lol.\n\nSorry I cant be of more help.", "id": 184733, "time": "2015-08-24T19:35:22Z", "bug_id": 58266, "creation_time": "2015-08-24T19:35:22Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "One thing you could try doing - unzip the OOXML file (it's a zip of xml files), replace the contents of the main documents with just \"deleted\" (preserving the name but not the content), re-zip and see if the new file still shows the problem. If so, please attach here\n\nSadly, without a file that shows the problem, it's going to be very very tricky to investigate...", "attachment_id": null, "id": 184736, "creator": "apache@gagravarr.org", "time": "2015-08-24T21:22:24Z", "bug_id": 58266, "creation_time": "2015-08-24T21:22:24Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 58266, "text": "Without more info we likely cannot do much here, therefore I am closing this until we get a sample document which triggers this error message.", "id": 188457, "time": "2016-02-15T21:12:03Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-02-15T21:12:03Z", "is_private": false, "attachment_id": null}]