[{"count": 0, "tags": [], "bug_id": 58261, "is_private": false, "text": "Created attachment 33012\nsuppress ant test output patch\n\nThere are several tests that write the System.out when running \"ant test\", including a hex dump of Container.dat from TestEscherDump. This output isn't useful when running the entire test suite.\n\nI've modified several tests to temporarily change System.out to a NullOutputStream while the test is running to avoid this cruft. Is there a better way to hide this output unless just one test case is executed instead of the entire test suite?\n\nI understand that there are some things that POI can't test for, such as if Microsoft Office thinks a file is corrupted but POI doesn't have a problem reading the file. There are several tests that write \"Open <filename> in Excel\". Are these asking someone to manually open the files in Excel and verify that the contents are displayed correctly? If so, perhaps we should have a decoration for tests where manual verification of output files is required, and the log should indicate what a person should look for in those files.", "id": 184638, "time": "2015-08-18T20:33:37Z", "creator": "onealj@apache.org", "creation_time": "2015-08-18T20:33:37Z", "attachment_id": 33012}, {"count": 1, "tags": [], "bug_id": 58261, "is_private": false, "text": "On the whole, I don't think out tests should be outputting things to System.err or System.out as they run, in the default config\n\nHowever, I know there's some issues with getting the build to pass on at least one of the continuous integration systems, so it might be that some of those statements come from trying to track that down\n\nThere are some tests which output files for manual, visual checking. Those won't be checked on every build, but probably should be checked periodically, and especially before a release is done. If we could refactor things to make it easier to see what could be manually checked, and what to look for, that'd be great!\n\nMaybe we could look at doing the manual check bits first, then blitz through the other output ones when the entries relating to the problematic CI system have been removed?", "id": 184655, "time": "2015-08-19T14:24:56Z", "creator": "apache@gagravarr.org", "creation_time": "2015-08-19T14:24:56Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58261, "attachment_id": null, "id": 194273, "time": "2016-10-09T11:37:08Z", "creator": "onealj@apache.org", "creation_time": "2016-10-09T11:37:08Z", "is_private": false, "text": "We could also find these by adding entries System.{out|err}.{print|println} to src/resources/devtools/forbidden-apis-prod.txt"}]