[{"count": 0, "tags": [], "bug_id": 58278, "attachment_id": 33032, "id": 184727, "creation_time": "2015-08-24T10:02:30Z", "time": "2015-08-24T10:02:30Z", "creator": "prem.masarani@highq.com", "text": "Created attachment 33032\nserver status with all threads in stuck in \"w\" state\n\nWe have two application on different tomcats and both the applications interacts through apache.\nApache is configured with mod_security rules.\n\nIn this setup I have faced two scenario:\n\nScenario 1:\n---------------\nFirst application is requesting second for any resource (e.g. any document).\nIn this case apache is taking more time in sending request to the second application's tomcat.\nAs we have noticed sometimes it is taking around 30 sec to send request to the second application's tomcat.\nDue to this, response time is exceeding the the Read time out time set for the request.\n\nAnd On removing mod_security form apache we haven't faced this type of issue.\n\nScenario 2:\n---------------\nWhen scenario 1 occurs we have multiple requests that is waiting long for it's response.\nOn checking apache's server-status we found most of the worker threads in \"W\" Sending Reply state.\nAnd keep on increasing worker threads in \"W\" state.\nThis leads to a situation where the no. of request exceeds the number of worker threads in the server process since multiple threads are in their waiting state.\n\nPlease find attachment-screenshot of apache server-status\nwhere all apache's working thread in \"W\" Sending Reply state.\n\nAnd the strange thing is that even after stopping both application's tomcats their still exists threads in \"W\" Sending Reply state in apache's server-status.\nIt releases only after restarting apache.\n\nWe are facing this issue after updating from 2.4.10 to apache 2.4.12 or 2.4.16.\nHaven't faced this scenario upto apache 2.4.10.\n\nAnd On removing mod_security form apache we haven't faced this type of scenario as well.\n\nFor now, we have given solution by just removing mod_security when both application interact with each other.\nBut this does'nt seems a feasible solution as its working fine in apache 2.4.10.\n\nPlease suggest for this odd behave of apache 2.4.12 or 2.4.16 with mod_security or reason for this.", "is_private": false}, {"count": 1, "tags": [], "bug_id": 58278, "attachment_id": null, "is_private": false, "id": 185807, "time": "2015-10-20T09:29:26Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-10-20T09:29:26Z", "text": "Please provide some error log (preferably at DEBUG or TRACE level) whith the issue reproduced.\n\nIt's not clear whether it comes from mod_security or httpd."}, {"count": 2, "tags": [], "bug_id": 58278, "attachment_id": null, "text": "Please don't change the Status without providing more info, we NEEDINFO.", "id": 185902, "time": "2015-10-23T16:32:42Z", "creator": "ylavic.dev@gmail.com", "creation_time": "2015-10-23T16:32:42Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 58278, "text": "No followup in several months. If there's still some curiosity about what the server was doing in this state, re-open with periodic backtraces of the running process.  Discussion to users@httpd.apache.org.", "id": 190988, "time": "2016-05-16T14:52:47Z", "creator": "covener@gmail.com", "creation_time": "2016-05-16T14:52:47Z", "is_private": false, "attachment_id": null}]