[{"count": 0, "tags": [], "bug_id": 58295, "text": "", "id": 184809, "time": "2015-08-28T08:38:46Z", "creator": "francesco.carusi@mperience.com", "creation_time": "2015-08-28T08:38:46Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Hello!\n\nin some rare cases we are experimenting a strange behavior in our comet implementation, we only see this once or twice a day in production (with around 20.000 unique visitors from browsers and mobile devices).\nThe application gets a ClientAbortException when closing an END comet event. It seems that the END event is then dispatched again and again since it was not successfully closed.\nI attached the stack trace that the application logs on each event.close()\nThe tomcat server is behind a nginx reverse proxy, I don't know if this may help.\n\nSince we are not able to recreate the issue in our test environment we did not investigate using a debugger.\n\nThanks!\nFrancesco", "is_private": false, "id": 184810, "creator": "francesco.carusi@mperience.com", "time": "2015-08-28T08:51:51Z", "bug_id": 58295, "creation_time": "2015-08-28T08:51:51Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Created attachment 33046\nstack trace", "is_private": false, "id": 184811, "creator": "francesco.carusi@mperience.com", "time": "2015-08-28T08:52:18Z", "bug_id": 58295, "creation_time": "2015-08-28T08:52:18Z", "attachment_id": 33046}, {"count": 3, "attachment_id": null, "creator": "markt@apache.org", "text": "I'm looking at this now but haven't yet found the code path that is triggering this. A couple of questions that might help me narrow the search:\n\n1. Is the stack trace identical every time including the first?\n\n2. How often do the stack traces repeat?", "id": 185011, "time": "2015-09-07T13:53:56Z", "bug_id": 58295, "creation_time": "2015-09-07T13:53:56Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 58295, "text": "I've been through the code both manually and with a debugger triggering the ClientAbortException at the same point during END processing and I am unable to recreate an infinite loop. I also haven't been able to identify a code path that could trigger an infinite loop.\n\nMy working hypothesis is that the exception is causing the application not to register the connection as closed and the application is triggering periodic close/timeout events.\n\nWithout a test case to reproduce (a simple web app or something based on the comet chat example) or an analysis that demonstrates how this might be happening there isn't really anything further we can do here.", "id": 185013, "time": "2015-09-07T16:19:32Z", "creator": "markt@apache.org", "creation_time": "2015-09-07T16:19:32Z", "is_private": false, "attachment_id": null}]