[{"count": 0, "tags": [], "creator": "thisismike04@gmail.com", "text": "XSSF uses the priority field for conditional formatting to maintain the priority order of the conditional formatting rules. Currently, there is no way to read the priority field (private in CTCfRule) so there is no way to look through the list of conditional formatting in priority order.\n\nThis was solved in this interesting code snippet: https://github.com/vaadin/spreadsheet/blob/master/vaadin-spreadsheet/src/main/java/com/vaadin/addon/spreadsheet/ConditionalFormatter.java\n\nIt would be better if there was a way to loop through the conditional formatting in order of priority.", "id": 184884, "time": "2015-08-31T18:15:02Z", "bug_id": 58311, "creation_time": "2015-08-31T18:15:02Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 58311, "attachment_id": null, "text": "Don't suppose you know any of Vaadin Spreadsheet folks? I've tried to reach out to them about merging their support in, but didn't get anywhere\n\n\nIn terms of the bug...\n\nWhat would be good is if someone could create a small test xlsx file, with conditional formatting that has non-standard priorities. Then do a save-as as xls, so we can check that too. Upload both, along with the guts of a new junit test that checks the priority order fetching\n\nSince the existing behaviour is out there, we may not be able to change the current signature / behaviour as-is. However, once we work out where the priority is in xls files, we can look to add alternate getters in priority order too, eg\n\n ConditionalFormattingRule getRule(int idx);  // existing\n ConditionalFormattingRule getRuleByPriority(int priority); // new\n List<ConditionalFormattingRule> getRules();  // missing...\n List<ConditionalFormattingRule> getRulesByPriority(); // new, same idea\n\nWould that work for your use case?", "id": 186250, "time": "2015-11-04T18:45:50Z", "creator": "apache@gagravarr.org", "creation_time": "2015-11-04T18:45:50Z", "is_private": false}, {"count": 2, "tags": [], "text": "Marking this as resolved with the addition of ConditionalFormattingEvaluator and EvaluationConditionalFormattingRule in 3.16.  The evaluation rule class exposes the rule priority, and the evaluator class handles rules in priority order.", "attachment_id": null, "bug_id": 58311, "id": 198724, "time": "2017-05-08T16:43:16Z", "creator": "gwoolsey@apache.org", "creation_time": "2017-05-08T16:43:16Z", "is_private": false}]