[{"count": 0, "tags": [], "text": "Created attachment 33075\npatch to fix the problem\n\nProblem:\n1. if some error in a jsp tag file in a jar\n2. Server won't print out the tag compile error in neither console or returned response.\n\nFix:\nincluded patch can be applied to Tomcat 7.\n\nonly modified \"getResourceAsStream(String res)\" to use \"URL getResource(String res) throws MalformedURLException\" in order to change as little as possible.", "attachment_id": 33075, "id": 185010, "creation_time": "2015-09-07T13:28:19Z", "time": "2015-09-07T13:28:19Z", "creator": "jianpro@foxmail.com", "bug_id": 58340, "is_private": false}, {"count": 1, "tags": [], "creator": "jianpro@foxmail.com", "attachment_id": null, "is_private": false, "id": 185045, "time": "2015-09-09T01:24:41Z", "bug_id": 58340, "creation_time": "2015-09-09T01:24:41Z", "text": "Hello,\n\nis there anyone has feedback on this issue?\n\nThanks,\nJian"}, {"count": 2, "attachment_id": null, "bug_id": 58340, "is_private": false, "id": 185049, "time": "2015-09-09T08:12:30Z", "creator": "markt@apache.org", "creation_time": "2015-09-09T08:12:30Z", "tags": [], "text": "If anyone had some feedback on this issue they would have commented on this issue. Given the lack of comments it is safe to assume that - at this point - no one has any feedback.\n\nThere were less than 36 hours between you posting the bug and you asking if anyone had any feedback. You need to be more patient. The developers are aware of the bug and it will get looked at. The more impatient you are, the greater the chances of annoying the very people you want to look at this.\n\nFor some time now any bug raised against Tomact will be addressed (usually fixed or declared invalid but sometimes put in the NEEDINFO state) before the next release. Releases occur roughly monthly for 8.0.x and 7.0.x and very roughly six monthly for 6.0.x. Only if a bug appears to have been ignored for at least one release should you start to wonder if it has been overlooked."}, {"count": 3, "attachment_id": null, "bug_id": 58340, "is_private": false, "id": 185092, "time": "2015-09-10T20:17:10Z", "creator": "markt@apache.org", "creation_time": "2015-09-10T20:17:10Z", "tags": [], "text": "Thanks for the report and the patch.\n\nThis has been fixed (using a different patch that works better across all versions) for trunk, 8.0.x (8.0.27 onwards) and 7.0.x (7.0.65 onwards)."}]