[{"count": 0, "tags": [], "bug_id": 5835, "text": "Hi again.\n\nI'm still on DOM event usage, with Xerces 1.4.4.\nAfter turning on DOM MutationEvents, the event handler attached to the\ndocument node receives quite many events, but I do not get any ones\nreflecting changes within text nodes.\n\nDebugging the methods involved, I see that at DocumentImpl line 1048 that the\nMutationEvent created has a null value as target, whereas the DOM level 2\nEvents specification v1.0 says in section 1.6.4: \"The target of this event\nis the CharacterData node\". Well, maybe that value is set afterwards. I did\nnot understand all functionality in the code called afterwards.\n\nFinally I tried to register a non-capturing event-listener as well by adding\nthis line to my code:\n((org.w3c.dom.events.EventTarget)n).addEventListener(org.apache.xerces.dom.e\nvents.MutationEventImpl.DOM_CHARACTER_DATA_MODIFIED, this, false);\n.....and got the event!\nBut again the target of the event is the DeferredDocumentImpl (where I\nattached my event listener) and not the text node that was changed.\n\n- Why is the target wrong?\n- Why do I have to use a non-capturing event listener to get this event,\nwhile I am able to receive all others with capturing ones?", "id": 9604, "time": "2002-01-14T01:40:14Z", "creator": "sag@stark-verlag.de", "creation_time": "2002-01-14T01:40:14Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 5835, "attachment_id": null, "id": 9637, "time": "2002-01-14T17:00:55Z", "creator": "lehors@apache.org", "creation_time": "2002-01-14T17:00:55Z", "is_private": false, "text": "It appears that this is caused by the same pb that was reported as bug #5260 \nand fixed in version 1.66 of DocumentImpl. However, this version is only \navailable as part of Xerces2.\nWe do not have any plans to distribute any new release of Xerces1 at this time \nso, consider either upgrading to Xerces2 or alternatively you could extract the \nDOM implementation from the Xerces2 distribution and use it with Xerces1. It \nshould solve your problem.\nPlease, confirm.\n\n\n*** This bug has been marked as a duplicate of 5360 ***"}, {"count": 2, "attachment_id": null, "bug_id": 5835, "text": "Thank you for this hint. I applied the change to line 1048 of DocumentImpl, and \nthe event has the correct target now.\n\nCan you please explain why I need a noncapturing event listener to get the \nCharacterDataModified event? For all other events, capturing event listeners do \nwell.", "id": 9679, "time": "2002-01-16T00:40:52Z", "creator": "sag@stark-verlag.de", "creation_time": "2002-01-16T00:40:52Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "text": "I don't see why a capturing event handler wouldn't work for you. It works fine \nfor me. But, again, this is with regard to the latest DOM implementation that \ncomes with Xerces2. There may have been another fix than the one I previously \nreported.\nIn any case, I extended and fixed a bug in the test program dom.events.Test \nwhich seems to prove that everything works as expected. Please, try with the \nlatest version.\n", "is_private": false, "id": 9716, "creator": "lehors@apache.org", "time": "2002-01-17T15:01:38Z", "bug_id": 5835, "creation_time": "2002-01-17T15:01:38Z", "attachment_id": null}, {"count": 4, "attachment_id": null, "bug_id": 5835, "is_private": false, "id": 10122, "time": "2002-01-31T15:33:09Z", "creator": "sag@stark-verlag.de", "creation_time": "2002-01-31T15:33:09Z", "tags": [], "text": "Today I had the chance to test this behaviour agaonst Xerces 2.0.0, and it \nworks as you already said. But I was just too shy to use the beta then....\n\nThanks for your investigation, anyway."}]