[{"count": 0, "tags": [], "creator": "dustin@virtualroadside.com", "text": "Nick has suggested:\n\nIn the short term, I'd suggest we do another full jar for it, and have the key classes included in the poi-ooxml-schemas jar\n\nMedium term, we should release a full ooxml-schemas 1.2 jar, with the visio and security bits in.", "id": 185240, "time": "2015-09-15T03:51:29Z", "bug_id": 58408, "creation_time": "2015-09-15T03:51:29Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "Ok, I created a private branch with the imported XSD, which ignores the original advice. :) It seems a bit complicated to create a new jar (and my ant-fu isn't that great), so instead I elected to bump the ooxml-schemas jar version, and include the visio.xsd there.\n\nThe XSD is difficult to download in a standalone form, so I added that to the repository. It's copyright/usage notice does not reflect the usage notice on the website -- should we change it to reflect this?\n\nPatch can be found here: https://github.com/virtuald/poi/tree/xsd", "is_private": false, "id": 185347, "creator": "dustin@virtualroadside.com", "time": "2015-09-18T23:21:31Z", "bug_id": 58408, "creation_time": "2015-09-18T23:21:31Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "dominik.stadler@gmx.at", "text": "Changes look good, please note the two \"second-class\" sets of build-files in the folders maven/ and sonar/, I did a quick look and you at least should add the nex XSDs in sonar/ooxml-schema, can can run a \"mvn package\" in the sonar-folder to ensure that the Maven-Build for Sonar still runs fine.\n\nAlso check the FAQ at http://poi.apache.org/faq.html#faq-N10025, it explains how necessary pieces end up in the poi-ooxml-schemas-XX.jar when they are used in unit-tests. The related build-step is at \"compile-ooxml-lite\". So it happens automatically, but only with unit-tests which trigger the related code.", "id": 185364, "time": "2015-09-20T19:56:12Z", "bug_id": 58408, "creation_time": "2015-09-20T19:56:12Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "text": "I've added the sonar fixes to that branch. I'll rebase the other branch to use this too.\n\nThe unit tests are part of the main visio integration effort, so I'm not going to worry about adding those here.", "is_private": false, "id": 185407, "creator": "dustin@virtualroadside.com", "time": "2015-09-22T02:12:28Z", "bug_id": 58408, "creation_time": "2015-09-22T02:12:28Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Alright, I'm pushing this into trunk as a first step for integration. Bombs away?", "is_private": false, "id": 185674, "creator": "dustin@virtualroadside.com", "time": "2015-10-07T02:43:58Z", "bug_id": 58408, "creation_time": "2015-10-07T02:43:58Z", "attachment_id": null}, {"count": 5, "tags": [], "creator": "apache@gagravarr.org", "text": "If you're bumping the version number of the ooxml-schemas jar up, please add the security ones too, so people only need the one big one!\n\nOnce everyone's happy with the new jar, it'll also need pushing to Maven central", "id": 185677, "time": "2015-10-07T08:45:48Z", "bug_id": 58408, "creation_time": "2015-10-07T08:45:48Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "text": "Looks like Jenkins didn't like that the xsd doesn't have an apache header on it. Is there an exclude list for the checker somewhere? That seems more appropriate.", "is_private": false, "id": 185688, "creator": "dustin@virtualroadside.com", "time": "2015-10-07T13:05:48Z", "bug_id": 58408, "creation_time": "2015-10-07T13:05:48Z", "attachment_id": null}, {"count": 7, "attachment_id": null, "bug_id": 58408, "is_private": false, "id": 185689, "time": "2015-10-07T13:30:49Z", "creator": "dustin@virtualroadside.com", "creation_time": "2015-10-07T13:30:49Z", "tags": [], "text": "Jenkins should be happy now, found the exclude setting for the rat check.\n\nAs far as adding the security jar to the main jar, it seems like the settings are different for generating the security jars, namely that noupa/nopvr are set to true. I'm not an XMLBeans expert, will that setting be ok for the main jars?"}, {"count": 8, "attachment_id": null, "bug_id": 58408, "text": "I think this is basically fixed, further work on refactoring the different schema-jars should be handled in separate issues.", "id": 188460, "time": "2016-02-15T21:31:48Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-02-15T21:31:48Z", "tags": [], "is_private": false}]