[{"count": 0, "tags": [], "text": "Created attachment 33099\nAreaReference.java patch\n\nFrom Bug 56328 (implemented in poi-3.13-beta1) r1685101\n\nAreaReference's SpreadsheetVersion instance variable, _version is private and is unable to be modified outside of the constructors (no setters provided). This field should probably be final like the rest of the instance variables in this class.\n\nAreaReference(CellReference, CellReference) currently assumes SpreadsheetVersion is EXCEL97. I deprecated this constructor in favor of AreaReference(CellReference, CellReference, SpreadsheetVersion). I wasn't sure what the preferred argument order was here, since the other constructor is AreaReference(String, SpreadsheetVersion), but the static methods list SpreadsheetVersion as the first argument. Your call.\n\nI added a few other lines of defensive code to prevent NPEs.\n\nOne thing lead to another and I wrote unit tests for nearly all of AreaReference. Note: many of these tests currently fail. In general, this class should probably either delegate to a common cell reference string parser or remove functions that operate on strings. It seems like allowing Strings that do not match \"[A-Z]+[0-9]+(:[A-Z]+[0-9]+)?\" or perhaps even \"[A-Z]+[0-9]+:[A-Z]+[0-9]+\" should raise an IllegalArgumentException--it shouldn't be AreaReference's responsibility to strip off sheet information and know sheet (and external workbook) naming rules.\n\nNote: this patch requires further work before it can be committed.", "attachment_id": 33099, "id": 185170, "creation_time": "2015-09-13T10:31:57Z", "time": "2015-09-13T10:31:57Z", "creator": "onealj@apache.org", "bug_id": 58402, "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 58402, "text": "Applied some of the internal changes from attachment 33099 in r1710163.", "count": 1, "id": 185878, "time": "2015-10-23T10:09:45Z", "creator": "onealj@apache.org", "creation_time": "2015-10-23T10:09:45Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 58402, "attachment_id": 33198, "text": "Created attachment 33198\nAreaReference.java.patch\n\nRebased to r1710170.\n\nIn this patch:\n* deprecate AreaReference(CellReference, CellReference), in favor of AreaReference(CellReference, CellReference, SpreadsheetVersion)\n* use static constants where ever possible\n* pre-allocate a fixed-length list for getAllReferencedCells\n* add many much-needed unit tests\n\nRemaining work: fix either the unit tests or the code\nFor example, AreaReference(\"A1:B65536\", EXCEL97).isWholeColumn() is false because it doesn't include dollar signs. AreaReference(\"A:B\").isWholeColumn() is false because it doesn't include numbers. This doesn't seem like the correct behavior.", "id": 185882, "time": "2015-10-23T11:05:27Z", "creator": "onealj@apache.org", "creation_time": "2015-10-23T11:05:27Z", "is_private": false}]