[{"count": 0, "attachment_id": 33100, "bug_id": 58403, "is_private": false, "id": 185171, "time": "2015-09-13T11:32:17Z", "creator": "onealj@apache.org", "creation_time": "2015-09-13T11:32:17Z", "tags": [], "text": "Created attachment 33100\nCellRangeAddressBase.java patch plus unit tests\n\nThis patch resolves a couple TODO's in org.apache.poi.ss.util.CellRangeAddress.\n\nI see three options here:\n1) Require the caller to supply the spreadsheet version as an argument to isFullColumnRange and isFullRowRange, deprecate the zero-argument version of these methods.\n2) Add a SpreadsheetVersion instance variable to this class, set by the constructor (either a final instance variable or with a setter).\n3) Let the implementing class (org.apache.poi.hssf.util.CellRangeAddress) override the zero-argument isFullColumnRange to specify the SpreadsheetVersion.\n\nThe first method seems best, as it has the least impact on existing projects, reduces amount of RAM consumed by this object, and resembles other classes that have been modified with SpreadsheetVersion. The downside is the caller (rather than creator for Option 2) needs to know the SpreadsheetVersion.\n\nThere seems to be a lot of overlap between AreaReference and CellRangeAddress\norg.apache.poi.ss.util.AreaReference[1]. In r1685101, AreaReference took the direction of #2 above, adding a SpreadsheetVersion instance variable and deprecating constructors that don't specify the spreadsheet version. AreaReference#isWholeColumnReference() seems to behave similarly to CellRangeAddress#isFullColumnRange. Oddly, AreaReference doesn't include a isWholeRowReference method. CellRangeAddressBase stores 4 ints while AreaReference stores 2 CellReferences. Key difference: References include absolute/relative fields while Addresses do not.\n\nSeems like some refactoring is needed here, perhaps merging these classes or having these classes subclassed from a common class. Anyone have any strong opinions on what direction should be taken?\n\n[1] https://svn.apache.org/viewvc/poi/trunk/src/java/org/apache/poi/ss/util/AreaReference.java?revision=1685101&view=markup#l194"}, {"count": 1, "tags": [], "creator": "onealj@apache.org", "attachment_id": 33237, "text": "Created attachment 33237\nCellRangeAddressBase.java patch plus unit tests\n\nRebasing patch due to conflicts with bug 58441: define equals method for CellRangeAddressBase, needed for a different bug.\n\nAlso fixed broken hashCode test.", "id": 186128, "time": "2015-10-31T08:33:30Z", "bug_id": 58403, "creation_time": "2015-10-31T08:33:30Z", "is_private": false}, {"count": 2, "tags": [], "text": "Created attachment 33238\nCellRangeAddressBase.java patch plus unit tests\n\nFix whitespace and hashCode implementation.", "is_private": false, "id": 186129, "creator": "onealj@apache.org", "time": "2015-10-31T08:36:25Z", "bug_id": 58403, "creation_time": "2015-10-31T08:36:25Z", "attachment_id": 33238}]