[{"count": 0, "tags": [], "text": "Mapping redirects adding the slash on empty path info will not use the correct location header when a RemoteIpValve is configured in the engine or servlet context.\nBasically with the RemoteIpValve configured correctly, all returned Location header on redirect are using the correct protocol, host and port.\nBut each time the query is \"https://my.acme.com:5000/servlet\" it redirects to \"http://my.acme.com/servlet/\" loosing the protocol and port.", "is_private": false, "id": 185371, "creator": "freds@jfrog.org", "time": "2015-09-21T06:14:06Z", "bug_id": 58433, "creation_time": "2015-09-21T06:14:06Z", "attachment_id": null}, {"count": 1, "text": "Created attachment 33120\nPatch and test for this bug\n\nI tried different approaches for this, but the fact that CoyoteAdapter has no information about the features supported by the Valve was the biggest issue here.\nI added the \"supportsFeature(String)\" mechanism that can be used to have an easy contract between Adapter and Valves.\nI'll be happy to change my approach here if a better one is found.\nThis bug is quite critical for us.", "creator": "freds@jfrog.org", "attachment_id": 33120, "id": 185372, "time": "2015-09-21T06:18:11Z", "bug_id": 58433, "creation_time": "2015-09-21T06:18:11Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 58433, "attachment_id": null, "id": 185377, "time": "2015-09-21T07:36:02Z", "creator": "remm@apache.org", "creation_time": "2015-09-21T07:36:02Z", "is_private": false, "text": "Not convinced personally, this adds overhead."}, {"count": 3, "text": "(In reply to Remy Maucherat from comment #2)\n> Not convinced personally, this adds overhead.\n\nI totally agree.\nThe main issue is proxyName and proxyPort are way too limiting. RemoteIpValve and RemoteIpFilter are doing the job correctly.\nFrankly I think that proxy configuration should be feature of the Adapter. There are way too many ways to change the protocol, server name, port that are activated at different stages in the pipeline stack.\nWhen Tomcat is behind a load balancer, all requests should be modified correctly.", "creator": "freds@jfrog.org", "attachment_id": null, "id": 185396, "time": "2015-09-21T20:24:21Z", "bug_id": 58433, "creation_time": "2015-09-21T20:24:21Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 58433, "text": "We have encountered a similar issue. We have used the RemoteIpValve in our Context, which works well in our use cases (we didn't encounter your issue). However it does not work for error pages. It appears that error pages are handled after exiting from RemoteIpValve, in which case the Request settings have been reverted to their original values.\n\nOn our error pages we still want to be able to test request.isSecure(), for example, to know whether to output secure or insecure URLs.\n\nApologies for the tangent; I believe our issue would be solved by handling this in the adapter instead. Maybe this additional issues lends some weight to investigating that? Otherwise perhaps some advice?\n\n(We seem to be able to workaround the issue by using RemoteIpValve on the Engine instead, but we'd prefer to use it at the Context level).", "count": 4, "id": 186777, "time": "2015-12-04T03:17:17Z", "creator": "karl@xk72.com", "creation_time": "2015-12-04T03:17:17Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 58433, "attachment_id": null, "is_private": false, "id": 192865, "time": "2016-08-03T17:02:57Z", "creator": "m2roda@gmail.com", "creation_time": "2016-08-03T17:02:57Z", "text": "Perhaps there should be a new Valve to handle the root redirects, with the new Valve coming after RemoteIpValve so it redirects properly, and the existing functionality pulled out of CoyoteAdapter and Mapper."}]