[{"count": 0, "tags": [], "bug_id": 58463, "attachment_id": 33150, "id": 185510, "time": "2015-09-28T09:13:56Z", "creator": "cjbooms@gmail.com", "creation_time": "2015-09-28T09:13:56Z", "is_private": false, "text": "Created attachment 33150\nFix ServletInputStream.setReadListener implementation\n\nThe implementation of ServletInputStream.setReadListener incorrectly gates on the current state of the request. In org.apache.coyote.Request the setReadListener method checks that asynchronous processing has been started.\n\nThis is an incorrect interpretation of the specification. It should be possible to attach a readListener to the stream even if the request is not operating in asynchronous mode. \n\nThis is particularly malicious as it causes IllegalState exceptions to be thrown by tomcat when asynchronous processing is managed separately to the attaching of readListeners. An application that attaches a readListener to a stream, and later switches the request to asynchronous mode, will not work in tomcat.\n\nI have attached a patch that removes this gate."}, {"count": 1, "tags": [], "creator": "remm@apache.org", "text": "This sort of \"bug\" report is extremely bad, as it can lead to introducing bugs into Tomcat. Please research the topic before filing this.", "id": 185511, "time": "2015-09-28T09:27:52Z", "bug_id": 58463, "creation_time": "2015-09-28T09:27:52Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "cjbooms@gmail.com", "text": "(In reply to Remy Maucherat from comment #1)\n> This sort of \"bug\" report is extremely bad, as it can lead to introducing\n> bugs into Tomcat. Please research the topic before filing this.\n\nI can see the argument for the existence of this gate. The specification states:\nNon-blocking IO only works with async request processing in Servlets and Filters (as defined in Section 2.3.3.3,\n“Asynchronous processing” on page 2-10), and upgrade processing (as defined in\nSection 2.3.3.5, “Upgrade Processing” on page 2-20). Otherwise, an\nIllegalStateException must be thrown when\nServletInputStream.setReadListener or\nServletOutputStream.setWriteListener is invoked.\n\nWould checking if asyncSupported is set to true not be enough to satisfy this requirement?", "id": 185512, "time": "2015-09-28T09:52:24Z", "bug_id": 58463, "creation_time": "2015-09-28T09:52:24Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 58463, "attachment_id": null, "text": "No. This was discussed in several threads in the Servlet 3.1 expert group and users list. The request must be in async or upgrade mode before calling set[Read|Write]Listener.", "id": 185513, "time": "2015-09-28T10:04:49Z", "creator": "markt@apache.org", "creation_time": "2015-09-28T10:04:49Z", "is_private": false}]