[{"count": 0, "tags": [], "bug_id": 58464, "text": "The HTTP specification says that HTTP header names are case insensitive. However it would be nice if uppercase header names will be passed to the servlet without converting them to lowercase.", "id": 185525, "time": "2015-09-29T08:16:17Z", "creator": "tornau@gmail.com", "creation_time": "2015-09-29T08:16:17Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 58464, "text": "You can create a filter and an HttpServletRequestWrapper and convert them yourself. Your uppercase is my lowercase.", "id": 185539, "time": "2015-09-29T14:06:29Z", "creator": "stanchev@hotmail.com", "creation_time": "2015-09-29T14:06:29Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "(In reply to George Stanchev from comment #1)\n> You can create a filter and an HttpServletRequestWrapper and convert them\n> yourself. Your uppercase is my lowercase.\n\nThis will probably not help because I do not know which letters are originally uppercase and which are lowercase.", "attachment_id": null, "id": 185540, "creator": "tornau@gmail.com", "time": "2015-09-29T14:19:13Z", "bug_id": 58464, "creation_time": "2015-09-29T14:19:13Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 58464, "text": "Tomcat stores the headers with lower case names to simplfy the lookup of headers (case sensitive rather than case insenstive lookups).\n\nUnless there is something in one of the specifications that Tomcat implements that mandates header case is preserved (unlikely given that the HTTP spec states header names are case insensitive) this is going to get resolved as WONTFIX.", "id": 185568, "time": "2015-09-30T12:43:02Z", "creator": "markt@apache.org", "creation_time": "2015-09-30T12:43:02Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 58464, "attachment_id": null, "id": 185577, "time": "2015-10-01T14:44:40Z", "creator": "chris@christopherschultz.net", "creation_time": "2015-10-01T14:44:40Z", "is_private": false, "text": "I'm not sure how many people care about this kind of thing, but I have to interact with a web service that uses JSON to pass data back and forth. The service has a way of being oddly case-insensitive in certain cases, so we have to treat all key/value pairs as if the key were case-insensitive, but I do in fact like to see what the server is actually sending.\n\nSo I've implemented a simple Map that will store the original case of the key and use that for things like Map.keySet, but also stores a case-insensitive map of the names for quick comparison/lookup.\n\nI'm not sure what the performance implication of those additional lookups might be, or the extra garbage that would be generated for each request, but it's certainly possible to maintain the original case of the request headers and also treat them case-insensitively.\n\nIf anyone is super interested in this kind of thing, it seems like it would be easy to add a configuration option that would simply substitute a case-insensitive Map (like that which I described above) for the current lowercase-only Map."}]