[{"count": 0, "tags": [], "bug_id": 58471, "attachment_id": 33155, "id": 185581, "time": "2015-10-02T10:57:16Z", "creator": "cmb-apache@corefiling.co.uk", "creation_time": "2015-10-02T10:57:16Z", "is_private": false, "text": "Created attachment 33155\nPatch to format numbers more like Excel\n\nThe current DataFormatter differs slightly from Excel's formatting, which is documented at https://support.microsoft.com/en-us/kb/65903 (Summary, 3rd sentence onward) regarding when to use scientific notation and counting the decimal point towards the character limit. It also differs on rounding mode, which in Excel appears to be HALF_UP (this does not appear to be documented).\n\nI attach a patch adding and using a new ExcelGeneralNumberFormat which matches Excel in a variety of test cases. This is useful for users who want to construct an error message quoting the cell value as it would be shown in Excel.\n\nNote that this all matches the longest string Excel will display given a sufficiently wide cell. In the default cell width, it uses a smaller number of characters, and I don't know if that number and/or the cell width vary with display settings/DPI, accessibility settings, available fonts, etc., so the wide-cell value seemed the best thing to target."}, {"count": 1, "tags": [], "text": "I've belatedly noticed that POI does already use HALF_UP in at least some circumstances, but I think the rest stands.", "attachment_id": null, "id": 185582, "creator": "cmb-apache@corefiling.co.uk", "time": "2015-10-02T11:52:44Z", "bug_id": 58471, "creation_time": "2015-10-02T11:52:44Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 58471, "attachment_id": null, "is_private": false, "id": 185630, "time": "2015-10-05T10:56:16Z", "creator": "cmb-apache@corefiling.co.uk", "creation_time": "2015-10-05T10:56:16Z", "text": "Hold fire on this, my forward-port and tidying-up missed that test methods now need the @Test annotation, so TestDataFormatter.testLargeNumbersAndENotation() will not actually get run in the currently attached patch, and it fails. I will supply a replacement patch shortly."}, {"count": 3, "tags": [], "text": "Created attachment 33165\nFormat numbers more like Excel does, v2\n\nReplacement patch attached. Compared to the previous patch, it:\n\n* Adds @Test so the new test actually gets run.\n* Chooses better test decimals that are representable as ending in 5 as intended not 49999[...].\n* Adds missing invocation of DataFormatter.setExcelStyleRoundingMode() on the new formatter's child DecimalFormats.", "attachment_id": 33165, "id": 185632, "creator": "cmb-apache@corefiling.co.uk", "time": "2015-10-05T13:11:49Z", "bug_id": 58471, "creation_time": "2015-10-05T13:11:49Z", "is_private": false}, {"count": 4, "tags": [], "text": "Looks like an improvement to me\n\nCommitted in r1706971, release notes in r1706972", "is_private": false, "bug_id": 58471, "id": 185653, "time": "2015-10-06T09:57:51Z", "creator": "dtn-asfbugs@corefiling.co.uk", "creation_time": "2015-10-06T09:57:51Z", "attachment_id": null}]