[{"count": 0, "tags": [], "bug_id": 58497, "attachment_id": null, "is_private": false, "id": 185752, "time": "2015-10-14T09:49:12Z", "creator": "amit_pande@symantec.com", "creation_time": "2015-10-14T09:49:12Z", "text": "http://grepcode.com/file/repo1.maven.org/maven2/org.apache.tomcat/tomcat-coyote/7.0.54/org/apache/coyote/http11/AbstractHttp11Processor.java#AbstractHttp11Processor\n\nClass org.apache.coyote.http11.AbstractHttp11Processor is marked as a \"public abstract\" class. However:\n\n abstract boolean  [More ...] prepareSendfile(OutputFilter[] outputFilters);\n\nThe above method \"prepareSendfile\" is not marked as public ( i.e. made a package private) and thus cannot be overridden from an extending class which is outside of the \"org.apache.coyote.http11\" package.\n\nSame can be said for :   \"abstract void  actionInternal(ActionCode actionCode, Object param)\" method as well.\n\nWe have a requirement of having a custom implementation for AbstractHttp11Processor but now we cannot because these methods cannot be overridden unless we modify in the tomcat source code. Thus this is proving a blocker for us.\n\nIs there any specific reason these were made \"package private\" because the class itself is abstract & public ? \n\nAm not too sure but this might be applicable to latest tomcat (e.g.8 ) versions too."}, {"count": 1, "text": "That class is not considered part of Tomcat's public API (see the README file). It is liable to change between any point release.\n\nWhat is the underlying requirement that means you need to extend that class?\n\nNote that in 9.0.x this class no longer exists and it is likely the same changes will be back-ported to 8.x in the near future.", "creator": "markt@apache.org", "is_private": false, "id": 185760, "time": "2015-10-16T06:37:54Z", "bug_id": 58497, "creation_time": "2015-10-16T06:37:54Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58497, "attachment_id": null, "id": 185879, "time": "2015-10-23T10:30:32Z", "creator": "amit_pande@symantec.com", "creation_time": "2015-10-23T10:30:32Z", "is_private": false, "text": "Apologies Mark & Violeta for a delayed reply. Trying to explain below what we need off tomcat.\n\n\n\"Requirement is to have multiple custom Acceptor strategy and at least each\nAcceptor strategy is taken up by one thread.\n\nOne and possibly many acceptor thread could be listening for incoming\nHTTP/S request.\nOne acceptor thread would be accepting request from legacy JNI which in\nturn registers with a custom service handlers to accept incoming requests.\n\nIn  the current framework this is not possible or at least I could not\nfigure out how to do it.\n\nSo easiest way I found was to copy paste default connector code and change\nacceptor strategy.\nNow I have two connectors, default one listening for HTTP/S request.\nCustom connector acceptor thread relying on JNI library for handing over\nto it new connection from custom service handler. \"\n\n\n\nWould really appreciate if you could point to appropriate way to solve this issue."}, {"count": 3, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "Tomcat's connectors were originally designed with this sort of use in mind although it is likely that over time some changes have crept in that are unhelpful in this regard.\n\nIdeally, you should be able to do this by extending existing abstract base classes / overriding existing implementations depending on how close the current code is to what you need. If you spot changes (splitting up methods, changing visibility, adding accessors, etc.) that would make this easier we are happy to consider them. (Please open additional BZ issue for such requests.)\n\nI have made the methods in question protected in 8.0.x and 7.0.x.\n\nThe connectors were refactored further in 8.0.x and significantly so in 9.0.x. It is worth you taking a look at 9.0.x as  that is still in development and any changes you might need so enable a future upgrade to 9.0.x will be much easier to make sooner rather than later.", "id": 185927, "time": "2015-10-25T13:53:41Z", "bug_id": 58497, "creation_time": "2015-10-25T13:53:41Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Thanks a lot, Mark, all for your quick responses and invaluable suggestions.", "attachment_id": null, "id": 185960, "creator": "amit_pande@symantec.com", "time": "2015-10-26T05:37:00Z", "bug_id": 58497, "creation_time": "2015-10-26T05:37:00Z", "is_private": false}]