[{"count": 0, "tags": [], "bug_id": 58514, "text": "jmeter depends on commons-httpclient. https://hc.apache.org/httpclient-3.x/\n\nThis library has reached EOL status four years ago and was replaced by Apache httpcomponents-client:\n\nhttps://hc.apache.org/httpcomponents-client-ga/index.html\n\ncommons-httpclient was affected by multiple security issues in the past but is no longer supported by its upstream developers. This makes it difficult for Linux distributions to provide any support for applications and libraries which still depend on commons-httpclient.\n\nPlease consider to make the switch to httpcomponents-client", "id": 185825, "attachment_id": null, "creator": "apo@gambaru.de", "creation_time": "2015-10-21T15:08:57Z", "time": "2015-10-21T15:08:57Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 58514, "attachment_id": null, "text": "JMeter already uses httpcomponents-client; just make sure you use the appropriate HTTP implementation.", "id": 185828, "time": "2015-10-21T16:31:28Z", "creator": "sebb@apache.org", "creation_time": "2015-10-21T16:31:28Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 58514, "attachment_id": null, "text": "\n@sebb I not sure that the issue was an incorrect choice of the HTTP request implementation. I thinks that is to create a jmeter package for a Linux distribution, the maintainer must add dependencies of the HC3.x because JMeter offer the possibility to use HC3 HTTP request implementation.\n\nFor example Debian :\nhttps://packages.debian.org/jessie/jmeter\nhttps://packages.debian.org/jessie/libcommons-httpclient-java\n\nOne minor security issue for HC (3/4)\nhttps://security-tracker.debian.org/tracker/source-package/commons-httpclient\nhttps://bugzilla.redhat.com/show_bug.cgi?id=CVE-2015-5262", "id": 185832, "time": "2015-10-21T20:19:15Z", "creator": "milamber@apache.org", "creation_time": "2015-10-21T20:19:15Z", "is_private": false}, {"count": 3, "tags": [], "creator": "apo@gambaru.de", "text": "I'm a member of the Debian Java team and we maintain jmeter for Debian. I have reported this bug because we cannot build jmeter without build-depending on commons-httpclient. However we would like to remove commons-httpclient from Debian because it is unmaintained and its upstream developer strongly recommends to switch to httpcomponents-client. Since commons-httpclient was affected by multiple security vulnerabilities in the recent past, we would like to reduce the maintenance burden.\n\nWe would prefer that jmeter no longer requires to build-depend on commons-httpclient.", "id": 185833, "time": "2015-10-21T20:27:29Z", "bug_id": 58514, "creation_time": "2015-10-21T20:27:29Z", "is_private": false, "attachment_id": null}]