[{"count": 0, "tags": [], "bug_id": 58530, "attachment_id": 33202, "text": "Created attachment 33202\nProposed design\n\nI'm not very happy with Tomcat Manager GUI, so I tried to make something different, using Tomcat website layout. The result is in the attachment. Just unpack to empty folder and open manager.html. That is a static HTML page.\n\nIn order to remove clutter, instead of English words, I used icons for Manager commands (start, stop...). I used Famfamfam Silk icons [1]. Silk icons are distributed under CC-BY 2.5/3.0 License, which is recently categorized as \"category B\" license [2], so it is safe to include them in Tomcat, to my understanding.\n\nI like how Silk audio icons (play, stop, repeat, etc.) fit Manager commands (start, stop, reload, etc.). One good reason for using audio icons is that they come out-of-the box in both active (blue) and inactive (greyed) versions. I also used scissors icon for session expiration. Is this a bit of a stretch?\n \nI also changed the order of deployment options: first the client war deployment, and then directory or server war deployment. Most of the people I know deploy wars from client, but if others think that directory / server war deployment is used more often, I can switch back their places.\n\nWhat do you think?\n\n-Ognjen\n \n[1] http://www.famfamfam.com/lab/icons/silk/\n[2] http://www.apache.org/legal/resolved.html", "id": 185905, "time": "2015-10-23T21:32:07Z", "creator": "ognjen.d.blagojevic@gmail.com", "creation_time": "2015-10-23T21:32:07Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 58530, "attachment_id": null, "text": "Nice. No, I take that back. Very nice.\n\nI have a couple of minor comments/suggestions:\n\n1. Restore the shading of alternate lines in the list of applications to help the eye track across.\n2. Use tooltips to provide i18n descriptions of the actions\n3. Merge the deploy action with the previous column (maybe with a small gap)", "id": 185908, "time": "2015-10-24T11:22:40Z", "creator": "markt@apache.org", "creation_time": "2015-10-24T11:22:40Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 58530, "text": "(In reply to Mark Thomas from comment #1)\n> Nice. No, I take that back. Very nice.\n\nThanks. :)\n\n\n> 1. Restore the shading of alternate lines in the list of applications to\n> help the eye track across.\n\nSure, it would be easy to restore them, but...\n\nI find \"zebra stripes\" a bit of a retro. Most products I use from large companies (meaning they are probably hiring professional designers) don't use zebra stripes (YMMV). E.g:\n\n1. Mozilla Thunderbird\n2. Microsoft Windows Explorer\n3. Google GMail (*)\n4. Adobe Acrobat Reader (*)\n5. Atlassian JIRA (*)\n\nInstead they highlight the hovered row. Proposed Manager GUI design also highlights the hovered row.\n\nAlso, those marked with asterisk are using gray lines to visually separate rows. Could you try to uncomment line 249 in tomcat.css and see if separating rows with lines is viable replacement for \"zebra stripes\"?\n\n\n> 2. Use tooltips to provide i18n descriptions of the actions\n\nI will.\n\n\n> 3. Merge the deploy action with the previous column (maybe with a small gap)\n\nOk. I think gap is really necessary, to avoid accidental undeployment, since there is no confirmation dialog. But, yes, it doesn't need to be in a separate column; smaller gap will suffice.", "id": 185917, "time": "2015-10-24T22:23:46Z", "creator": "ognjen.d.blagojevic@gmail.com", "creation_time": "2015-10-24T22:23:46Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 58530, "attachment_id": null, "text": "This can easily degenerate into a holy war, but I do have a few comments:\n\n(In reply to Ognjen Blagojevic from comment #2)\n> I find \"zebra stripes\" a bit of a retro. Most products I use from large\n> companies (meaning they are probably hiring professional designers) don't\n> use zebra stripes (YMMV). E.g:\n> \n> 1. Mozilla Thunderbird\n\ntb still uses zebra stripes, though they are minimal (unless you have a theme that removes them).\n\n> 2. Microsoft Windows Explorer\n> 3. Google GMail (*)\n> 4. Adobe Acrobat Reader (*)\n> 5. Atlassian JIRA (*)\n\nI wouldn't use JIRA as an example of a good UI ;)", "id": 186028, "time": "2015-10-27T19:56:23Z", "creator": "chris@christopherschultz.net", "creation_time": "2015-10-27T19:56:23Z", "is_private": false}, {"count": 4, "tags": [], "creator": "markt@apache.org", "text": "Ah. I missed the row higlighting on hover. I'm going to blame viewing angle / lack of sleep ;)\n\nI tried uncommenting line 249 and I do think it looks better. But that is just my opinon. This is your improvement so go with what you think looks best. I'm sure it is going to be better than what we have at the moment. The highlight on hover is sufficient for the user to be sure they are working with the app they think they are.", "id": 186038, "time": "2015-10-28T02:16:43Z", "bug_id": 58530, "creation_time": "2015-10-28T02:16:43Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 58530, "attachment_id": null, "text": "I guess it looks better now.\n\nIn the \"code\" there are a lot of style left in the HTML, I suppose this will move away right ?", "id": 186044, "time": "2015-10-28T07:46:33Z", "creator": "remm@apache.org", "creation_time": "2015-10-28T07:46:33Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 58530, "attachment_id": null, "text": "(In reply to Remy Maucherat from comment #5)\n> In the \"code\" there are a lot of style left in the HTML, I suppose this will\n> move away right ?\n\nRight.", "id": 186046, "time": "2015-10-28T08:24:54Z", "creator": "ognjen.d.blagojevic@gmail.com", "creation_time": "2015-10-28T08:24:54Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 58530, "attachment_id": null, "text": "Ognjen,\n\nI think it looks great. Does the zip file have the updates that Mark suggested?  Are we going to implement this and is there a plan?", "id": 194824, "time": "2016-11-04T20:40:22Z", "creator": "andrewlanecarr@gmail.com", "creation_time": "2016-11-04T20:40:22Z", "is_private": false}, {"count": 8, "tags": [], "creator": "ognjen.d.blagojevic@gmail.com", "attachment_id": null, "id": 194850, "time": "2016-11-07T13:26:45Z", "bug_id": 58530, "creation_time": "2016-11-07T13:26:45Z", "is_private": false, "text": "It turned out more difficult then I expected. Let me have another look, and I will call for help if I get stuck again."}, {"count": 9, "tags": [], "bug_id": 58530, "attachment_id": null, "text": "Should new theme replace the old one, or should it be just one additional skin for the manager GUI, so user may decide whether to use the old GUI or the new one?\n\nI started going in the direction of skinning, and that would require:\n\n1. To have, for now, two themes, e.g. \"retro\" (existing one) and \"website\" (the one I'm working on, using website layout)\n2. To add init param in manager web.xml with the name \"skin\", or something like that, so user may specify which skin to use.\n3. To move constants with HTML and CSS fragments from classes o.a.c.manager.Constants and o.a.c.manager.host.Constants, into new \"retro skin\" class.\n4. To create another \"website skin\" class with new set of HTML and CSS fragments\n5. To add code for selection of appropriate skin class depending on the web.xml parameter.\n\nWDYT?", "id": 194853, "time": "2016-11-07T15:10:11Z", "creator": "ognjen.d.blagojevic@gmail.com", "creation_time": "2016-11-07T15:10:11Z", "is_private": false}, {"count": 10, "tags": [], "creator": "chuck.caldarale@unisys.com", "text": "(In reply to Ognjen Blagojevic from comment #9)\n> Should new theme replace the old one, or should it be just one additional\n> skin for the manager GUI, so user may decide whether to use the old GUI or\n> the new one?\n\nReplace - maintaining both is too much work.", "id": 194854, "time": "2016-11-07T15:14:26Z", "bug_id": 58530, "creation_time": "2016-11-07T15:14:26Z", "is_private": false, "attachment_id": null}]