[{"count": 0, "text": "Created attachment 33223\nAnt build script\n\nThis seems like such a fundamental problem, that I must be overlooking something obvious. If you specify a directory for an <exec> task, then that directory is not used if it happens to be the user's current working directory. In this case, the directory used is the project's base directory.", "bug_id": 58555, "is_private": false, "id": 185990, "time": "2015-10-26T20:33:01Z", "creator": "gboysko@gmail.com", "creation_time": "2015-10-26T20:33:01Z", "tags": [], "attachment_id": 33223}, {"count": 1, "text": "Place the build.xml in an empty directory. Create a new subdirectory called \"subdir\" and put a few empty files.\n\nNext, run the Ant script from the directory that contains build.xml. Observe that it shows the listing of the \"subdir\" directory.\n\nNow, invoke the Ant script from the \"subdir\" directory and observe it showing the contents of the Project's base directory.", "bug_id": 58555, "attachment_id": null, "id": 185991, "time": "2015-10-26T20:34:39Z", "creator": "gboysko@gmail.com", "creation_time": "2015-10-26T20:34:39Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 58555, "attachment_id": 33224, "text": "Created attachment 33224\nUpdated build.xml with subdirectory specified as a property.\n\nThis is an update to the original build script that uses a property to construct an absolute path to the subdirectory.", "id": 185992, "time": "2015-10-26T20:38:17Z", "creator": "gboysko@gmail.com", "creation_time": "2015-10-26T20:38:17Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 58555, "is_private": false, "text": "I see what you describe, but only with vmlauncher=\"false\" - it works as expected with vmlauncher=\"true\".  Am looking into it.", "id": 186021, "time": "2015-10-27T17:56:24Z", "creator": "bodewig@apache.org", "creation_time": "2015-10-27T17:56:24Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 58555, "attachment_id": null, "id": 186022, "time": "2015-10-27T18:25:35Z", "creator": "bodewig@apache.org", "creation_time": "2015-10-27T18:25:35Z", "is_private": false, "text": "Wow, this is old.  And nobody has ever reported it before.\n\nhttps://git-wip-us.apache.org/repos/asf?p=ant.git;a=blobdiff;f=src/main/org/apache/tools/ant/taskdefs/Execute.java;h=b43da4f68d20c7899ef4e96577496d02e751607d;hp=bc768276b914a9c6a86f83e4856d40d1f593f7e1;hb=1dfa5ca002e81a1b89dbfd0fdd172bad141b829a;hpb=fc7cfffc89d82da7426c14b0fcd48682b026a56d\n\nmade in *2001* - first introduced in Ant 1.4.\n\nAt least this is where the root problem starts.  Up until then a \"null\" dir has always been treated as \"use the CWD\" and with the change the external launchers used with vmlauncher=\"false\" started to use the project's basedir rather than the CWD if dir was null.\n\nEven in that version the value of the dir attribute has been discarded if it was the current working directory.\n\nWhile I agree the current behavior is wrong, I'm a bit scared of what I might break.\n\nIt might be best to not \"null away\" an explicit dir attribute at all.  This should keep the behavior as it is since by now all vmlaucher=\"true\" launchers happliy support executing in a different directory (now that we are in Java 1.3+ :-).\n\nThis would fix the current issue, but what remains is that an <exec> task without any dir attribute defaults to the CWD for in-VM launchers and the project's basedir for external launchers.  I'd rather document than fix this, TBH.  Will consult with the other folks on the dev list before touching anything."}, {"count": 5, "tags": [], "bug_id": 58555, "attachment_id": null, "is_private": false, "id": 186032, "time": "2015-10-27T20:50:29Z", "creator": "gboysko@gmail.com", "creation_time": "2015-10-27T20:50:29Z", "text": "So glad to hear that you've confirmed this. I, too, cannot believe no one else reported this since it's introduction in 2001. Not sure how I can explain this. We are creating a number of Ant scripts which rely on Node.js scripts, which end in \".cmd\" on Windows and have no suffix on Mac/Linux. So, we really need vmlauncher=\"false\".\n\nI also agree that if a caller sets an attribute, it should not be overridden without at least a warning message. In this case, it clearly changes the behavior. \n\nLook forward to hearing whether a fix gets into an upcoming build!"}, {"count": 6, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 186042, "time": "2015-10-28T05:12:32Z", "bug_id": 58555, "creation_time": "2015-10-28T05:12:32Z", "is_private": false, "text": "Of course it all made sense back then, at least until the change was made.\n\nPrior to that dir always defaulted to the current working directory.  Java 1.2 and earlier only had a Runtime.exec without a dir argument so we were forced to use special platform dependent tricks for changing the directory.  Setting dir to null explicitly when it was the current working directory simplified the bigger number of platform dependent hacks (no dir => use Runtime.exec)."}, {"count": 7, "tags": [], "bug_id": 58555, "attachment_id": null, "id": 186305, "time": "2015-11-07T17:29:44Z", "creator": "bodewig@apache.org", "creation_time": "2015-11-07T17:29:44Z", "is_private": false, "text": "fixed with git commit 0ca8c46 (by never ignoring the dir attribute)."}]