[{"count": 0, "text": "The concept of a cell reference and a cell address are distinct. A cell can identify itself with a cell address, such as CTCell.getR(). A cell address plus a sheet address can identify a particular cell in a workbook.\n\nA cell address does not have the concept of being (row or column) absolute or relative, nor does it need to know the sheet that it refers to.\n\nOn the other hand, a formula (cell formula, array formula, conditional formatting) needs the concept of absolute or relative because the formula may be shifted and we need to know what parts of the formula should be shifted.\n\nIn a way, a cell address is just a row-absolute column-absolute cell reference with a null sheet, printed without the dollar signs, but it seems better to have two distinct classes for this.\n\nWhy is a new class needed?\nIf I have two comments anchored at the same CellReference, but one CellReference is relative while the other is absolute, the CellReference won't *equal* each other, even though conceptually they do (since comment anchors don't have a concept of relative/absolute).\nHowever, if I could return a CellAddress for the comment anchors, the equals method on two cell comments anchored at the same location would always behave as expected (so long as I know that the two comments are on the same sheet).", "bug_id": 58637, "attachment_id": null, "id": 186493, "time": "2015-11-23T09:24:27Z", "creator": "onealj@apache.org", "creation_time": "2015-11-23T09:24:27Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 58637, "is_private": false, "id": 186496, "creation_time": "2015-11-23T09:43:45Z", "time": "2015-11-23T09:43:45Z", "creator": "onealj@apache.org", "text": "Thanks for the patch from Hannes Erven submitted in bug 58365, contained in attachment 33143.\n\nAdded in r1715743, plus unit test for new CellAddress class.\n\nJavaDocs updated r1715746.", "attachment_id": null}, {"count": 2, "tags": [], "text": "Added missing javadoc files in r1715754", "is_private": false, "bug_id": 58637, "id": 186497, "time": "2015-11-23T10:37:18Z", "creator": "onealj@apache.org", "creation_time": "2015-11-23T10:37:18Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 58637, "is_private": false, "id": 186504, "time": "2015-11-23T21:19:30Z", "creator": "apache@gagravarr.org", "creation_time": "2015-11-23T21:19:30Z", "tags": [], "text": "If someone has time - it might be worth reviewing all the uses of CellReference in the codebase, and checking if any of those could be swapped over. I have a hunch that there might be one or two places which were just using CellReference because there wasn't an alternative..."}]