[{"count": 0, "tags": [], "creator": "jmarkmurph@yahoo.com", "is_private": false, "text": "Created attachment 33286\nPatch file\n\nSetting a single CellStyle property at a time using setCellStyleProperty causes a search through all the CellStyles for each property set, and creates a new CellStyle if a match is not found, even if that specific style will never be used. When more than one property needs to be set, for example when drawing borders, it would be more efficient both in the number of styles created, and in performance, to set them all in one shot.\n\nI have included a patch to org.apache.poi.ss.util.CellUtil which adds a new method setCellStyleProperty(Cell, Workbook, Map<String, Object>) that adds a group of properties to the cell style in one shot. I also modified the existing method to call the new method with a map containing a single property. No test cases yet, just wanted to make sure I am on the right track.", "id": 186475, "time": "2015-11-22T02:00:18Z", "bug_id": 58633, "creation_time": "2015-11-22T02:00:18Z", "attachment_id": 33286}, {"count": 1, "attachment_id": null, "bug_id": 58633, "is_private": false, "id": 186476, "time": "2015-11-22T03:54:31Z", "creator": "onealj@apache.org", "creation_time": "2015-11-22T03:54:31Z", "tags": [], "text": "Thanks for the patch. Could you add a unit test and/or write some example usage code?"}, {"count": 2, "attachment_id": 33288, "bug_id": 58633, "is_private": false, "id": 186510, "time": "2015-11-23T23:05:46Z", "creator": "jmarkmurph@yahoo.com", "creation_time": "2015-11-23T23:05:46Z", "tags": [], "text": "Created attachment 33288\nPatch file with test cases\n\ngenerated from Ant"}, {"count": 3, "tags": [], "bug_id": 58633, "attachment_id": null, "id": 186669, "time": "2015-11-30T15:50:01Z", "creator": "jmarkmurph@yahoo.com", "creation_time": "2015-11-30T15:50:01Z", "is_private": false, "text": "I am finished with this patch, do I need to set the status to resolved, or does someone else do that when it is added to the project?"}, {"count": 4, "attachment_id": null, "bug_id": 58633, "text": "(In reply to Mark Murphy from comment #3)\n> I am finished with this patch, do I need to set the status to resolved, or\n> does someone else do that when it is added to the project?\n\ntldr: leave it open. A committer will close the bug once it's been committed and documented.\n\nHere's the general workflow for the Apache POI project:\n\nIndicate that your patches are finished and ready for inclusion using [PATCH] in the bug title and PatchAvailable in the keywords field (helps the committers find the bug more easily). (Already done)\n\nA committer will review your changes, identify any problems (doesn't compile, fails existing unit tests, needs new unit tests, missing javadocs) and let you know if any changes need done. Depending on how much work needs done and how busy the committer is, he or she may ask you to make the changes or will make the changes his/herself.\n\nOnly once the bug is deemed duplicate/invalid/won't fix or the suggested changes are committed and the appropriate documentation is updated do we close the bug.\n\nIt may take us a while to getting around to reviewing and committing this, so patience is key. Some bugs take a few years to get committed--please don't wait that long without politely bugging us. In general, the simpler and shorter the change, the less time it takes to be included.", "id": 186685, "time": "2015-11-30T18:10:15Z", "creator": "onealj@apache.org", "creation_time": "2015-11-30T18:10:15Z", "tags": [], "is_private": false}, {"count": 5, "text": "I'd suggest using Collections.singletonMap for the string,object setter in CellUtils\n\nTests wise, might be good to cover one or two more cases, especially if there isn't a lot of unit testing currently for that class\n\nAn example around using CellUtil for this sort of thing, for the examples package, might be good too!", "bug_id": 58633, "is_private": false, "id": 186692, "time": "2015-11-30T22:44:44Z", "creator": "apache@gagravarr.org", "creation_time": "2015-11-30T22:44:44Z", "tags": [], "attachment_id": null}, {"count": 6, "tags": [], "creator": "onealj@apache.org", "attachment_id": null, "text": "This is a nitpick from setCellStyleProperty(Cell, Workbook, String, Object), but how should this function behave if the cell does not belong to the workbook? If this is undefined, then this function should either throw an exception or not have a workbook argument.\n\nIf someone can explain a usecase where cell does not belong to workbook, and can describe what the desired behavior should be, I'll leave this as is. Otherwise, I think we should deprecate setCellStyleProperty(Cell, Workbook, String, Object) and replace with setCellStyleProperty(Cell, String, Object), and determine the workbook object inside the function with cell.getSheet().getWorkbook().", "id": 187315, "time": "2016-01-01T22:55:13Z", "bug_id": 58633, "creation_time": "2016-01-01T22:55:13Z", "is_private": false}, {"count": 7, "tags": [], "creator": "onealj@apache.org", "is_private": false, "text": "Added in r1722607 with a few minor javadoc modifications, and changed the new method to setCellStyleProperties(Cell, Map<String, Object>).", "id": 187316, "time": "2016-01-02T04:30:33Z", "bug_id": 58633, "creation_time": "2016-01-02T04:30:33Z", "attachment_id": null}, {"count": 8, "tags": [], "text": "After setCellStyleProperty or setCellStyleProperties, if any cell styles are no longer used in the workbook, there needs to be a method to remove cell styles from the workbook.\n\nI mentioned this (commented out) in the Javadocs for setCellStyleProperties [1]. If POI currently supports this, the Javadocs should refer to this. If not, the functions should be created. For example, WorkbookUtil.removeUnusedCellStyles(Workbook wb) or WorkbookUtil.removeStyleFromWorkbookIfUnused(CellStyle style, Workbook wb). Not sure if this belongs in CellUtil, WorkbookUtil, CellStyleUtil, or as methods on Workbook or the styles source (StylesTable for XSSF, not sure for HSSF).\n\nI decided against having this cleanup done in setCellStyleProperty/Properties assuming that the cleanup would run in linear time with respect to number of cells in a workbook.\n\n[1] https://svn.apache.org/viewvc/poi/trunk/src/java/org/apache/poi/ss/util/CellUtil.java?view=markup&pathrev=1722607#l187", "attachment_id": null, "bug_id": 58633, "id": 187317, "time": "2016-01-02T04:44:18Z", "creator": "onealj@apache.org", "creation_time": "2016-01-02T04:44:18Z", "is_private": false}, {"count": 9, "tags": [], "bug_id": 58633, "attachment_id": null, "id": 187321, "time": "2016-01-02T11:20:48Z", "creator": "onealj@apache.org", "creation_time": "2016-01-02T11:20:48Z", "is_private": false, "text": "(In reply to Nick Burch from comment #5)\n> Tests wise, might be good to cover one or two more cases, especially if\n> there isn't a lot of unit testing currently for that class\n\nIs r1722618 what you had in mind here, or were you thinking about more unit tests for setCellStyleProperty/Properties?\n\n> An example around using CellUtil for this sort of thing, for the examples \n> package, might be good too!\n\nWe still need to add this to examples package and/or quick guide. I think CellUtil.setCellStyleProperties is a secret to most people--it was to me until I saw this bug. I added links to this function in Cell.setCellStyle javadoc in hopes to direct more here. This utility function minimizes the need for a style optimizer, which consolidates styles, like HSSFStyleOptimizer (currently nothing available for XSSF), since duplicate styles are avoided in the first place.\n\nMark, would you like to take the task of writing example code in the examples package and a paragraph showing how to use this in the quick-guide?"}, {"count": 10, "tags": [], "creator": "jmarkmurph@yahoo.com", "attachment_id": null, "text": "I can do that add examples and quick guide paragraph.", "id": 187330, "time": "2016-01-02T23:53:03Z", "bug_id": 58633, "creation_time": "2016-01-02T23:53:03Z", "is_private": false}, {"count": 11, "attachment_id": 33450, "bug_id": 58633, "text": "Created attachment 33450\nQuick Guide Update\n\nThis is the updated Quick Guide page which adds examples for drawing a red medium weight border around cell B2, and also around and inside the range D4:F6.", "id": 187725, "time": "2016-01-16T01:59:09Z", "creator": "jmarkmurph@yahoo.com", "creation_time": "2016-01-16T01:59:09Z", "tags": [], "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 58633, "text": "Did you by any chance happen to edit the quick-guide.xml source [1], or did you make your additions to quick-guide.html [2,3]? We use Apache Forrest to convert the xml to the html site.\n\nIf not, it's no big deal to transcribe your changes to the XML file. Just a little more work for both of us :)\n\n[1] XML Source: http://svn.apache.org/viewvc/poi/site/src/documentation/content/xdocs/spreadsheet/quick-guide.xml?view=log\n[2] Generated HTML: http://svn.apache.org/viewvc/poi/site/publish/spreadsheet/quick-guide.html?view=log\n[3] Site: http://poi.apache.org/spreadsheet/quick-guide.html", "count": 12, "id": 187728, "time": "2016-01-16T04:52:14Z", "creator": "onealj@apache.org", "creation_time": "2016-01-16T04:52:14Z", "is_private": false}, {"attachment_id": 33453, "tags": [], "creator": "jmarkmurph@yahoo.com", "text": "Created attachment 33453\nThis is the patch file for the quick guide\n\nNot sure if I am doing this correctly, but I have too many changes in my project to just create a patch with Ant. I transcribed my changes from the HTML to the XML file, and created a patch file for just that one file.", "count": 13, "id": 187733, "time": "2016-01-16T06:07:51Z", "bug_id": 58633, "creation_time": "2016-01-16T06:07:51Z", "is_private": false}, {"count": 14, "attachment_id": null, "bug_id": 58633, "text": "(In reply to Mark Murphy from comment #13)\n> Created attachment 33453 [details]\n> This is the patch file for the quick guide\n\nThanks for your code and documentation contributions! Spreadsheet quick guide updated in r1724929.\n\nI left out the whitespace changes in other sections from attachment 33453. I'm not picky about inconsistent whitespace in the documentation, unlike code.\n\nChangelog updated in r1724933.\n\n> Not sure if I am doing this correctly, but I have too many changes in my project \n> to just create a patch with Ant. I transcribed my changes from the HTML to the \n> XML file, and created a patch file for just that one file.\n\n\"svn diff\" is probably easiest here.\nI have dozens of working copies of POI on my computer--each for a bug. This works when the changes are unrelated or independent, but it sounds like the changes you have are dependent on each other.\n\nI think that is everything for this bug. Please reopen if I forgot something.", "id": 187736, "time": "2016-01-16T08:07:42Z", "creator": "onealj@apache.org", "creation_time": "2016-01-16T08:07:42Z", "tags": [], "is_private": false}]