[{"count": 0, "attachment_id": null, "creator": "peterhansson_se@yahoo.com", "text": "Apache POI (XSSF) currently lacks support for IgnoredErrors feature when writing XLSX files.\n\nMore information on this official MS link:\n\nhttps://msdn.microsoft.com/en-us/library/dd944168%28v=office.12%29.aspx\n\nAs can be seen this is an element on the Sheet.\n\nOn this feature I suggest to leave XLS format in the dust and *not* implement it on the usermodel. Most people do not need XLS support anymore and I guess it is fair to say to users of Apache POI that if they need this feature then they need to use XSSF. It seems previous attempts to implement this in usermodel have failed (see bug 54868). Instead I suggest simply to add it as a setter method on the XSSFSheet.\n\nThere are other tickets (bug 54868 and bug 46136) that relate to the same issue but this RFE is more general, it is not just about specifically ignoring \"number-stored-as-text\" warning, but indeed all those warnings supported by IgnoredErrors element.\n\nPersonally I have no interest in being able to *read* this information from a XLSX file. Being able to persist the setting is far, far more important.", "id": 186505, "time": "2015-11-23T21:46:24Z", "bug_id": 58641, "creation_time": "2015-11-23T21:46:24Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 58641, "attachment_id": null, "is_private": false, "id": 186507, "time": "2015-11-23T21:50:55Z", "creator": "peterhansson_se@yahoo.com", "creation_time": "2015-11-23T21:50:55Z", "text": "*** Bug 54868 has been marked as a duplicate of this bug. ***"}, {"count": 2, "tags": [], "bug_id": 58641, "is_private": false, "id": 186508, "creation_time": "2015-11-23T21:51:23Z", "time": "2015-11-23T21:51:23Z", "creator": "apache@gagravarr.org", "text": "There's low level record support for this for HSSF, see #46136\n\nIf we can't read it back, then it's rather tricky to unit test it if nothing else!\n\nBug #56892 has one proposed usermodel implementation for this, but it really needs a bit more work and to be made more generic. Being able to roughly mirror behaviour for adding/setting and reading would be a bonus too\n\nAny thoughts on the right usermodel interface for adding this?", "attachment_id": null}, {"count": 3, "attachment_id": null, "creator": "peterhansson_se@yahoo.com", "text": "It is kinda similar in concept to DataValidations. I think the usermodel for that can be re-used as inspiration.\n\nFor information: In OOXML there are quite a few types of IgnoredErrors:\n\n   - evalError\n   - twoDigitTextYear\n   - numberStoredAsText\n   - formula\n   - formulaRange\n   - unlockedFormula\n   - emptyCellReference\n   - listDataValidation\n   - calculatedColumn\n\n\nThis is just to say that 'numberStoredAsText' is just one of many. \n\nI notice that the XSSF implementation for DataValidation has some utility code for dealing with 'sqref'. This type of code should be moved out of DataValidation and into a utils class or something as the same needs to be used for IgnoredErrors.", "id": 186636, "time": "2015-11-29T12:22:54Z", "bug_id": 58641, "creation_time": "2015-11-29T12:22:54Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 58641, "attachment_id": 33311, "is_private": false, "id": 186651, "time": "2015-11-30T08:36:30Z", "creator": "peterhansson_se@yahoo.com", "creation_time": "2015-11-30T08:36:30Z", "text": "Created attachment 33311\nProposal for usermodel implementation"}, {"count": 5, "attachment_id": null, "bug_id": 58641, "is_private": false, "id": 186652, "time": "2015-11-30T08:56:34Z", "creator": "peterhansson_se@yahoo.com", "creation_time": "2015-11-30T08:56:34Z", "tags": [], "text": "I've attached a proposal for a complete usermodel implementation. \nThe proposal is inspired by DataValidation.\n\nThe proposal adds an interface named IgnoredError and corresponding new methods in Sheet:\n\n\nsetters:\n\naddIgnoredError(IgnoredError)\nremoveIgnoredError(IgnoredError)\n\n\ngetters:\n\nList<? extends IgnoredError> getIgnoredErrors();\n\n\n\n\nI've kept it simple. It is perfectly possible to have overlap in ignore error.\n\nSuppose I add\n\n  For types twoDigitTextYear,numberStoredAsText ignore in cells A1:A5.\n\nand then in addition I add\n\n  For type numberStoredAsText ignore in cell A1.\n\n\nNow this is obviously redundant wrt to A1: I've told twice that I want 'numberStoredAsText' to be ignored for that cell. I've decided that this is perfectly acceptable for the simple reason that it is also acceptable in OOXML. This means implementers of the above shouldn't try to be clever about it and try to collapse/reduce what has been requested *unless this is specifically required by the format*.\n\n\n\n\n\n\n\n\n\n   - formula\n   - formulaRange\n   - unlockedFormula\n   - emptyCellReference"}, {"count": 6, "attachment_id": null, "creator": "dominik.stadler@gmx.at", "text": "There has been some work on this via Bug 56892, can you take a look and see how much of your proposed changes are still missing?", "id": 189507, "time": "2016-03-16T09:35:15Z", "bug_id": 58641, "creation_time": "2016-03-16T09:35:15Z", "tags": [], "is_private": false}, {"text": "there was no update here in quite some time, therefore I am setting this to WONTFIX for now. \n\nWe have support for ignoring errors for regions for XSSF via bug 56892, support for HSSF is discussed in bug 46136. \n\nIf you would like to propose more changes then please reopen this bug with an updated patch that applies to the current trunk.", "tags": [], "bug_id": 58641, "is_private": false, "count": 7, "id": 194722, "time": "2016-10-29T08:37:17Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-10-29T08:37:17Z", "attachment_id": null}]