[{"count": 0, "tags": [], "creator": "anmalyshev@mail.ru", "text": "We're using Tomcat WebSocket implementation for our product. We're using partial writing feature. Everything works as expected until any issue happens during write (TimeoutException, for example). After this happens - WsRemoteEndpointImplBase  remains in BINARY_PARTIAL_WRITING state and we can't write anything to this WS connection anymore. Following exception thrown in case we try:\n\njava.lang.IllegalStateException: The remote endpoint was in state [BINARY_PARTIAL_WRITING] which is an invalid state for called method\n\tat org.apache.tomcat.websocket.WsRemoteEndpointImplBase$StateMachine.checkState(WsRemoteEndpointImplBase.java:1148)\n\tat org.apache.tomcat.websocket.WsRemoteEndpointImplBase$StateMachine.binaryPartialStart(WsRemoteEndpointImplBase.java:1096)\n\tat org.apache.tomcat.websocket.WsRemoteEndpointImplBase.sendPartialBytes(WsRemoteEndpointImplBase.java:162)\n\tat org.apache.tomcat.websocket.WsRemoteEndpointBasic.sendBinary(WsRemoteEndpointBasic.java:56)\n\tat com.avaya.acc.wcs.transport.websocket.impl.WsClientOutbound.writeBytes(WsClientOutbound.java:48)\n\nSometimes timeout means that connection is terminated, but in other cases it would be useful to retry writing - which is not possible because of this state issue.", "id": 186524, "time": "2015-11-24T21:48:07Z", "bug_id": 58647, "creation_time": "2015-11-24T21:48:07Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 58647, "attachment_id": null, "text": "I'm tempted to resolve this as WONTFIX. My expectation is that any I/O related exception is going to be fatal to the connection, not least because it is impossible to know how many bytes have been written.\n\nWhat is your use case for wanting to re-try the write?", "id": 186548, "time": "2015-11-25T14:09:30Z", "creator": "markt@apache.org", "creation_time": "2015-11-25T14:09:30Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 58647, "attachment_id": null, "text": "Let's say I have write timeout 5 seconds and idle timeout 15 seconds.\nIn case short network outage happens first attempt to send may be timed out, but second attempt will be successful. It's not a good user experience to just close connection in  case of short network outage. Moreover, write timeout does not mean connection is terminated. At least I should be able to complete current message (no matter if it's corrupted - client will be able to detect it) and either re-send the whole message or send another one.", "id": 186562, "time": "2015-11-25T17:53:47Z", "creator": "anmalyshev@mail.ru", "creation_time": "2015-11-25T17:53:47Z", "is_private": false}, {"count": 3, "tags": [], "creator": "markt@apache.org", "text": "Sorry, no.\n\nTCP will handle short network outages. It you want to handle an outage longer than your current timeout, increase the timeout.\n\nAfter any I/O exception there are multiple unknowns:\n- unable to determine what was written successfully to the network and what was not\n- the exception will have caused some of Tomcat's internal processing to be skipped potentially leaving things like buffers in an unknown state\n\nWithout knowing how many bytes of the previous message have been written it is impossible to recover the connection.\n\nIn short, I/O exceptions are fatal to the connection and have to be treated as such.", "id": 186610, "time": "2015-11-27T20:52:20Z", "bug_id": 58647, "creation_time": "2015-11-27T20:52:20Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "anmalyshev@mail.ru", "attachment_id": null, "id": 186617, "time": "2015-11-27T21:53:27Z", "bug_id": 58647, "creation_time": "2015-11-27T21:53:27Z", "is_private": false, "text": "Ok, may be you're right. In case it's unrecoverable, though, I don't see why the connection is not closed in this case and I is left in this weird state. It's not an issue for me to close it myself or wait for idle timeout, but, anyway, it would be much better if container can do it (having in mind I may have very long idle timeout in some cases)."}]