[{"count": 0, "attachment_id": 33310, "bug_id": 58668, "text": "Created attachment 33310\nUse sqlite3_prepare_v2() for sqlite 3.5.0 and later.\n\nThis isn't strictly a problem isolated to apr, but one of the fixes is in apr.\n\nI have a web application on apache httpd 2.4.10, using mod_lua and mod_dbd against an sqlite3 database (with some prepared statements in the apache config). I want to use foreign_keys constraints; but these are (currently) default \"off\" in sqlite3, and need to be enabled using \"PRAGMA foreign_keys=ON\", which affects the connection object.\n\nThe httpd's mod_dbd module has a neat feature for initializing database connection objects called DBDInitSQL, but when I add DBDInitSQL \"PRAGMA foreign_keys=ON\", my prepared statements start failing in the web application with a \"schema has changed\" error.\n\nThe documentation for sqlite3's \"PRAGMA foreign_keys\" (https://www.sqlite.org/pragma.html#pragma_foreign_keys) stipulates that:\n\n``Changing the foreign_keys setting affects the execution of all statements prepared using the database connection, including those prepared before the setting was changed. Any existing statements prepared using the legacy sqlite3_prepare() interface may fail with an SQLITE_SCHEMA error after the foreign_keys setting is changed.''\n\nIt looks like apache httpd isn't running DBDInitSQL before the DBDPrepareSQL statements _and_ (relevant to apr) it's using sqlite3_prepare() rather than sqlite3_prepare_v2().  There seems to be two solutions; one is unrelated to apr, and the other one is using sqlite3_prepare_v2() in apr.\n\nI read that the v2 function was introduced in 3.5.0, and the SQL_VERSION_NUMBER can be used to retain compatibility with pre-3.5.0 versions.\n\n*Untested* patch attached.  Sorry for messing up the code with excessive preprocessor junk; should probably rather do something more along the line of:\n\n#if SQLITE_VERSION_NUMBER >= 3005000\n#define sqlite3_prepare sqlite3_prepare_v2\n#endif", "id": 186643, "time": "2015-11-30T01:05:09Z", "creator": "jan.m.danielsson@gmail.com", "creation_time": "2015-11-30T01:05:09Z", "tags": [], "is_private": false}]