[{"count": 0, "tags": [], "creator": "wataylor@as-st.com", "text": "Created attachment 33327\nMy web application passes this file to POI after uploading it.  That works.  When I try to write it back out, the sky falls.\n\nError writing work book org.apache.poi.openxml4j.exceptions.OpenXML4JRuntimeException: Rule M2.4 exception : this error should NEVER happen! Please raise a bug at https://bz.apache.org/bugzilla/enter_bug.cgi?product=POI and attach a file that triggers it, thanks!\n\nI have attached the file which is input and read by POI after it has been uploaded to my web application.  My program changes all of the C cells in column A to Completed and then tries to write the spread sheet to request.out.  I have attached the input file.\n\nThis first happened on the Linux production system with version 11 but it was not happening on my windows 7 test system.  Suspecting that you'd ask me to upgrade, I switched from poi 11 to poi 13 on Windows, and it started happening on windows.", "id": 186806, "time": "2015-12-06T02:21:51Z", "bug_id": 58694, "creation_time": "2015-12-06T02:21:51Z", "is_private": false, "attachment_id": 33327}, {"count": 1, "tags": [], "creator": "dominik.stadler@gmx.at", "text": "I tried to reproduce this, but could not when using the trunk version of POI. I used the following piece of code, can you provide the steps that reproduce the problem for you (reduced to the bare minimum) so we can try to reproduce it? \n\n       for(Sheet sheet : wb) {\n           for(Row row : sheet) {\n               Cell cell = row.getCell(0);\n               if(cell.getStringCellValue().equals(\"C\")) {\n                   cell.setCellValue(\"Completed\");\n               }\n           }\n       }\n       Workbook wb2 = XSSFTestDataSamples.writeOutAndReadBack(wb);\n       wb2.close();", "id": 186824, "time": "2015-12-06T22:53:59Z", "bug_id": 58694, "creation_time": "2015-12-06T22:53:59Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 58694, "text": "No response for some time on the request for more information, therefore I am setting closing this for now. Please reopen this with more information if you still have this problem with the latest version of POI.", "count": 2, "id": 188458, "time": "2016-02-15T21:13:29Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-02-15T21:13:29Z", "is_private": false}]