[{"count": 0, "tags": [], "bug_id": 58702, "is_private": false, "text": "Created attachment 33333\nwar file to demo the issue\n\nWhen a client aborts a request to a web application before the response is written no line is written to the Tomcat access log.\n\nI most recently tested this on an out-of-the-box 8.0.30 distribution but I have seen the problem occur on Tomcat 8.0.28 and 7.0.39 as well.\n\nI believe that the general repro steps are as simple as this:\n\n1) In a browser, hit any endpoint in a web application that has an AccessLogValve configured\n2) Close the browser tab that made the request before the request finishes\n3) Check the access log and note that no access log line was written for the request\n\nDemo app:\nI've attached a WAR file with a simple web application to demonstrate the problem. The source code for the application is included in the WAR.\n\nThe demo application has two servlets, one \"fast\" and one \"slow\". They both log a unique ID for the request to a logback-configured application log, then return a 200 response with a simple string. The only difference between them is that the fast servlet returns immediately while the slow servlet sleeps for 30 seconds before returning.\n\nThe unique request ID generated by these servlets is also added as a request attribute so that it can be shown in the access log.\n\nRepro steps with the demo app:\n1) Put the WAR file into a Tomcat container and load it.\n2) Open a web browser and go to localhost:<port>/missing-access-log-demo/fast\n3) Check the application and access logs at <catalina-base>/logs/missing-access-log-demo. Note that both logs generated a line for the request, and that the unique identifier for the request is the same in both files.\n4) In a web browser, go to localhost:<port>/missing-access-log-demo/slow. Watch the application log as you make the request and you should see a line quickly added with the request's unique ID.\n5) Before the request completes, close the browser tab that made the request.\n6) Wait 30 seconds and watch the access log. Note that no line for this request is ever added.\n\nExpected result:\n\nEven if the client never gets the response, a request was processed by the server so I would expect to see it appear in the access logs.\n\nDetails:\nI've stepped into the Tomcat code and it seems pretty clear this is happening in the CoyoteAdapter class:\n\nhttp://svn.apache.org/viewvc/tomcat/tc8.0.x/tags/TOMCAT_8_0_30/java/org/apache/catalina/connector/CoyoteAdapter.java?view=markup\n\nOn line 558 the CoyoteAdapter calls response.finishResponse, right before the code that will call the access log. If the client is gone the finishResponse method throws an IOException when trying to flush its OutputBuffer. This exception causes the code to skip the call to context.logAccess and is then swallowed and ignored by the subsequent catch block.", "id": 186843, "time": "2015-12-08T03:13:08Z", "creator": "zikfat@gmail.com", "creation_time": "2015-12-08T03:13:08Z", "attachment_id": 33333}, {"text": "Fixed in 9.0.x for 9.0.0.M2, 8.0.x for 8.0.31 and 7.0.x for 7.0.68.\n\nIt was not fixed in 6.0.x since 6.0.x does not have the additional access log infrastructure required.", "tags": [], "bug_id": 58702, "is_private": false, "count": 1, "id": 187039, "time": "2015-12-18T11:36:58Z", "creator": "markt@apache.org", "creation_time": "2015-12-18T11:36:58Z", "attachment_id": null}]