[{"count": 0, "tags": [], "text": "The behavior of the variable REDIRECT_URL is not properly documented, or if it is, it's practically impossible to find in the documentation.\n\nA search of \"REDIRECT_URL\" in the documentation yields only two significant results (unless more are lost in the pile of garbage results):\n\n1) this: https://httpd.apache.org/docs/2.4/custom-error.html\n\n2) this: https://httpd.apache.org/docs/2.4/mod/core.html\n\n\n1) is specific to Custom Error Responses directives. Here, the part regarding variables such as REDIRECT_URL is very poorly documented. It says:\n\n\"when the error redirect is sent, additional environment variables will be set, which will be generated from the headers provided to the original request by prepending 'REDIRECT_' onto the original header name\"\n\nNote that this does NOT explain what \"REDIRECT_URL\" is supposed to be, since there's no original variable named \"URL\". \nOne can only infer what REDIRECT_URL is by looking at the example. And it is not even very clear: it seems to suggest that REDIRECT_URL is equal to the value of REQUEST_URI prior to the redirection, and that REQUEST_URI is changed to the actual URI of the custom error page, but neither of these are stated clearly (it might be viceversa and it's CRITICAL to be able to tell which one is the case)\n\n\n2) here the only mention of REDIRECT_URL is in the explanation of the QualifyRedirectURL Directive, which only makes sense to those who already know how REDIRECT_URL is supposed to behave in the first place.\n\n\nThe above would make sense (besides the severe deficiencies in the documentations pointed out in (1)) if REDIRECT_URL was *only* generated by Custom Error Pages directives, but that is not the case.\n\n\n\nI have seen REDIRECT_URL, and REDIRECT_STATUS, populated in cases where no Custom Error Response directive was having effect, where only RewriteRule and RewriteCond directives were generating redirects (internal redirects, that is, url rewritings).\n\nSo, one must conclude that either:\nA) mod_rewrite also sets the REDIRECT_* variables when it rewrites urls. If this is the case, it's TOTALLY UNDOCUMENTED\n\nor:\nB) Apache's core or some other module also set the REDIRECT_* variables. If it is the core, there's no documentation about it in https://httpd.apache.org/docs/2.4/mod/core.html which is supposed to describe \"Apache Core Features\".\n\n\n\n---- REAL-LIFE HEADACHE EXAMPLE (which the docs fail to help figure out)  ----\n\nI'll provide an example of a real case where REQUEST_URL's behavior is apparently erratic; I guess the behavior is expected, but the documentation fails to provide the necessary information to figure out what the f**k is going on.\nI don't expect anybody to give me the answers here, this is not a support forum. What I do expect you to do is fix the documentation so that the explanation of apparently nonsense behaviors like this can be found in it.\n\n\nOn two similar (but not identical) servers, I set up an apparently identical virtual host with identical PHP scripts.\nAs you know, PHP scripts receive variables such as REQUEST_URI and REDIRECT_URL (if it exists) in the $_SERVER array.\n\nOne of the two servers runs Apache 2.4.4, the other I'm not sure (should be 2.4.x).\nThe configuration specific to the virtual host is identical on both; however the underlying whole configuration of Apache (httpd.conf and other included files) may have some differences though a glance at the most relevant .conf files hasn't revealed any.\n\nLet's say the virtual host is named mydomain1.com on server 1, and mydomain2.com on server 2.\n\nAll I describe from now on applies to both servers. \n\n\nThe .htaccess in the DocumentRoot folder of the virtual host is like this:\n\n  RewriteEngine On\n\n  #RewriteBase /\n  \n  RewriteCond %{REQUEST_FILENAME} !-f\n  RewriteCond %{REQUEST_FILENAME} !-d\n  RewriteCond %{REQUEST_FILENAME} !/(admincp|modcp|clientscript|cpstyles|images)/\n  RewriteRule ^(.+)$ vbseo.php [L,QSA]\n\n(I have tried uncommenting the RewriteBase directive and nothing changed)\n\nThat is, any url that does not correspond to an existing folder or file is routed to vbseo.php.\n\nThere exists an index.php file in the same folder. \n\nFor debugging purposes I replaced the contents of vbseo.php with a simple\n  <?php print_r($_SERVER); ?>\n\n\nOn Server 1 I observe apparently sensible behavior, but I can't quite understand the details, and the docs don't help.\nOn Server 2 I observe completely nonsense behavior, which is either due to a bug in Apache or to a serious misconfiguration; either way, the documentation doesn't give me a f***ing clue.\n\nI issue a \"GET /\" request to both servers, i.e. opening http://mydomain1.com and http://mydomain2.com from a browser.\n\n----\nHere's the output from server 1 (I'll omit the irrelevant parts):\nArray\n(\n    [REDIRECT_STATUS] => 200\n    [HTTP_HOST] => mydomain1.com\n    [HTTP_USER_AGENT] => Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/46.0.2490.86 Safari/537.36\n    [SERVER_NAME] => mydomain1.com\n    [DOCUMENT_ROOT] => /path/to/stuff/\n    [REQUEST_SCHEME] => http\n    [CONTEXT_PREFIX] => \n    [CONTEXT_DOCUMENT_ROOT] => /path/to/stuff/\n    [SCRIPT_FILENAME] => /path/to/stuff/vbseo.php\n    [REDIRECT_URL] => /index.php\n    [GATEWAY_INTERFACE] => CGI/1.1\n    [SERVER_PROTOCOL] => HTTP/1.1\n    [REQUEST_METHOD] => GET\n    [QUERY_STRING] => \n    [REQUEST_URI] => /\n    [SCRIPT_NAME] => /index.php\n    [PHP_SELF] => /index.php\n)\n\nWhat I understand should be happening here is:\n- I'm requesting /\n- because of the rewrite rules, the request is rewritten to vbseo.php\n- and indeed vbseo.php is being executed (otherwise I wouldn't be getting that output at all)\n- which explains why SCRIPT_FILENAME is /path/to/vbseo.php\n- REQUEST_URI remains / because (I infer, and it's what I'd expect, but it isn't stated anywhere in the docs) the rewrite rules don't change its value, by design  \n\nWhat I don't understand (and the docs fail to provide me the information to figure it out) is:\n- why the hell do SCRIPT_NAME and PHP_SELF equal /index.php??\n- why the hell REDIRECT_URL is /index.php\n\nAt first, I might guess that some core or default configuration dictates that, because we are requesting a folder (the document root folder) without a file name, the request should be forwarded to index.php in that same folder.\nHowever, if this was the case, then, since the RewriteRule in .htaccess is subject to the condition that the request does not match an existing file, and an index.php file DOES exist, then index.php should be executed, but that is not the case: vbseo.php is executed which produces the above output.\n\nFrom the fact that REQUEST_URI remains equal to the original requested url, I'm inclined to think that REDIRECT_URL is supposed to be the url *to which* the request is redirected (rather than the original one prior to the redirect, which is its meaning as described in the Custom Error Responses docs, but whe don't have docs about REDIRECT_URL unrelated to Custom Errors) - otherwise, in general, REDIRECT_URL wouldn't make sense when rewriting urls with mod_rewrite, because if REQUEST_URI is preserved, REDIRECT_URL, if it was supposed to be the *old* url, wouldn't be needed as it would always equal REQUEST_URI.... \nOn the other hand, here the file actually being executed is vbseo.php, and REDIRECT_URL is not /vbseo.php, so this would suggest that REDIRECT_URL actually is the \"old\" requested uri. But the original requested uri is /, so this could only be explained if there are 2 rewritings here: from \"/\" to \"/index.php\" and from \"/index.php\" to \"vbseo.php\". But this cannot be the case, because /index.php exists, so the second redirect shouldn't occur.\n\nAs you can see, nothing makes sense unless something big is missing in the docs.\n\n\n----\nThe output from server 2 is complete nonsense:\nArray\n(\n    [REDIRECT_STATUS] => 200\n    [HTTP_HOST] => mydomain2.com\n    [HTTP_USER_AGENT] => Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/46.0.2490.86 Safari/537.36\n    [SERVER_NAME] => mydomain2.com\n    [DOCUMENT_ROOT] => /path/to/stuff/\n    [REQUEST_SCHEME] => http\n    [CONTEXT_PREFIX] => \n    [CONTEXT_DOCUMENT_ROOT] => /path/to/stuff/\n    [SCRIPT_FILENAME] => /path/to/stuff/vbseo.php\n    [REDIRECT_URL] => http://mydomain2.com        // <<- W.T.F??\n    [GATEWAY_INTERFACE] => CGI/1.1\n    [SERVER_PROTOCOL] => HTTP/1.1\n    [REQUEST_METHOD] => GET\n    [QUERY_STRING] => \n    [REQUEST_URI] => /\n    [SCRIPT_NAME] => http://mydomain2.com         // <<- W.T.F??\n    [PHP_SELF] => http://mydomain2.com            // <<- W.T.F??\n)\n\n\n\n\nIn this second case, the fact that SCRIPT_NAME and PHP_SELF are absolute fully qualified URLs is a complete screw-up, which I'm sure has an explanation in some misconfiguration, but such an explanation cannot be found in the documentation.", "attachment_id": null, "bug_id": 58739, "id": 186968, "time": "2015-12-15T23:46:27Z", "creator": "teo8976@gmail.com", "creation_time": "2015-12-15T23:46:27Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 58739, "attachment_id": null, "is_private": false, "id": 192633, "time": "2016-07-25T20:56:35Z", "creator": "rbowen@apache.org", "creation_time": "2016-07-25T20:56:35Z", "text": "Where to start ...\n\nSome of the variables you mention, such as PHP_SELF, are set by third-party modules, and so are outside the scope of the documentation.\n\nBeyond that, you appear to be asking for explanations of a wide variety of environment variables. It's a little hard to get past the irate tone of the rant, but we'll try to convert this into an actual request for change, which appears to be:\n\n* Document the meaning of the REDIRECT_URL environment variable, which is set as a side-effect of the use of Redirect and Rewrite directives.\n\n* Document the meaning of the SCRIPT_NAME environment variable, which is set by modules such as mod_cgi and mod_php when dealing with \"script\" content generators.\n\nAm I correctly getting at the root of this?"}, {"count": 2, "tags": [], "bug_id": 58739, "attachment_id": null, "id": 192866, "creation_time": "2016-08-03T17:34:44Z", "time": "2016-08-03T17:34:44Z", "creator": "rbowen@apache.org", "text": "needinfo", "is_private": false}, {"count": 3, "tags": [], "text": "> Beyond that, you appear to be asking for explanations of a wide \n> variety of environment variables.\n\nNot a wide variety at all, just three\n\n\n> It's a little hard to get past the irate tone of the rant\n\nI have re-read my report, and I don't see where the \"irate tone of the rant\" becomes in any way an obstacle in understanding the description of the issue which seems pretty clear to me.\n\nAnyway,\n\n> we'll try to convert this into an actual request for change, \n\nTo be more precise, a request for FIX, of a documentation bug\n\n\n> which appears to be:\n> * Document the meaning of the REDIRECT_URL environment variable, which \n> is set as a side-effect of the use of Redirect and Rewrite directives.\n\nYep, \n\n> * Document the meaning of the SCRIPT_NAME environment variable\n\nyes, especially how on earth this can be set to an absolute url such as http://somedomain.com. Actually it's hard to see how that can not be a bug.\nRemember that two almost identical servers with the same seemingly-relevant directives exhibit different behavior here. The documentation should allow me to figure out what difference in configuration is causing the difference in behavior.\n\n\nAnd then you are leaving out PHP_SELF. Despite the fact that it's a PHP-specific variable, there's no way, according to how it's defined in PHP documentation, that it can be an absolute URL; hence it must be Apache doing something to it. And most probably this is related to mod_rewrite or some interaction between mod_rewrite and some other module, as I only observe that when rewrite rules are being applied.\nSo, there's almost certainly something that is under the responsibility of Apache (as opposed to PHP), affecting this variable, that needs to be documented.", "is_private": false, "bug_id": 58739, "id": 192871, "time": "2016-08-03T20:10:29Z", "creator": "teo8976@gmail.com", "creation_time": "2016-08-03T20:10:29Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "> > It's a little hard to get past the irate tone of the rant\n> \n> I have re-read my report, and I don't see where the \"irate tone of the rant\"\n> becomes in any way an obstacle in understanding the description of the issue\n> which seems pretty clear to me.\n\nYou'll find that volunteer documentation writers don't usually respond well to repeated profanity. YMMV.", "attachment_id": null, "bug_id": 58739, "id": 192881, "time": "2016-08-04T16:06:30Z", "creator": "rbowen@apache.org", "creation_time": "2016-08-04T16:06:30Z", "is_private": false}, {"count": 5, "tags": [], "creator": "rbowen@apache.org", "attachment_id": null, "id": 192884, "time": "2016-08-04T16:36:00Z", "bug_id": 58739, "creation_time": "2016-08-04T16:36:00Z", "is_private": false, "text": "\n> The .htaccess in the DocumentRoot folder of the virtual host is like this:\n> \n>   RewriteEngine On\n> \n>   #RewriteBase /\n>   \n>   RewriteCond %{REQUEST_FILENAME} !-f\n>   RewriteCond %{REQUEST_FILENAME} !-d\n>   RewriteCond %{REQUEST_FILENAME}\n> !/(admincp|modcp|clientscript|cpstyles|images)/\n>   RewriteRule ^(.+)$ vbseo.php [L,QSA]\n\n...\n\n> That is, any url that does not correspond to an existing folder or file is\n> routed to vbseo.php.\n\nOk, if I'm correctly understanding what you're trying to accomplish - that is, map \"unhandled\" requests to vbseo.php, what you actually want to do, instead of the entire above configuration, is:\n\nFallbackResource /vbseo.php\n\nOf course, this doesn't address the other issue - that the meanings of REDIRECT_URL is undocumented. I think the best thing to do at this point is for us to open a separate ticket requesting that additional detail - possibly in the Redirect and mod_rewrite docs? I'll go do that now."}, {"count": 6, "tags": [], "bug_id": 58739, "is_private": false, "id": 192886, "creation_time": "2016-08-04T16:40:51Z", "time": "2016-08-04T16:40:51Z", "creator": "rbowen@apache.org", "text": "See issue BZ59944", "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 58739, "attachment_id": null, "is_private": false, "id": 192892, "time": "2016-08-04T18:55:38Z", "creator": "teo8976@gmail.com", "creation_time": "2016-08-04T18:55:38Z", "text": "And SCRIPT_NAME, and any effects of mod_rewrite (or any other core module) on PHP_SELF"}]