[{"count": 0, "tags": [], "bug_id": 58788, "attachment_id": 33394, "id": 187328, "time": "2016-01-02T23:09:46Z", "creator": "jim_showalter@intuit.com", "creation_time": "2016-01-02T23:09:46Z", "is_private": false, "text": "Created attachment 33394\nProgram to reproduce this bug. See instructions for reproducing.\n\nThe same code used for all worksheets produces different results. The first few worksheets look fine but gradually colors drop off until there are no colors at all.\n\nTo reproduce:\n\nRun the attached program with one command-line arg for the output file name.\n\nIn the generated file, click from left to right on the worksheets.\n\nThe first two worksheets look fine.\n\nThe third worksheet has only one row set to blue, and no row set to yellow.\n\nThe remaining worksheets have no color.\n\nChange NUM_COLUMNS from 7 to 3 in the code.\n\nCompile and run again.\n\nClick from left to right on the worksheets.\n\nThe first four worksheets look fine.\n\nThe fifth worksheet only has yellow on the first column.\n\nThe sixth worksheet has no color.\n\nUsing poi version 3.13.\n\nSame behavior with 3.12."}, {"count": 1, "tags": [], "bug_id": 58788, "is_private": false, "text": "Styles are per Workbook and should be reused across cells, does it work when you just use two global  styles across the workbook?", "id": 187344, "time": "2016-01-03T15:13:58Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-01-03T15:13:58Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 58788, "attachment_id": null, "id": 187349, "time": "2016-01-03T17:53:27Z", "creator": "jim_showalter@intuit.com", "creation_time": "2016-01-03T17:53:27Z", "is_private": false, "text": "That was it. My mistake. Thank you!\n\nWhen creating styles for each cell, they're separate objects, so it's odd that they don't wind up with the same effect on each worksheet (is that a bug?)."}, {"count": 3, "tags": [], "bug_id": 58788, "is_private": false, "id": 187351, "creation_time": "2016-01-03T19:26:25Z", "time": "2016-01-03T19:26:25Z", "creator": "jim_showalter@intuit.com", "text": "That fixed it. Any idea why repeatedly creating cell styles would cause them to stop applying colors as defined? Also, when defining styles to be used globally, the API supports defining a user string for the style, but there's no way to look up a style by string, so the styles have to be passed as additional parameters, or assigned to globals. It would be nice to be able to look up by name.", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 58788, "attachment_id": null, "text": "Glad that it helped, I quickly tried it locally on Linux, LibreOffice shows the colors in the resulting file correctly, so it seems to be some strange behaviour with Excel. Anyway I don't see anything that we can fix here so I am closing this for now.", "id": 187352, "time": "2016-01-03T19:50:39Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-01-03T19:50:39Z", "is_private": false}]