[{"count": 0, "tags": [], "text": "Created attachment 33398\nFixes usage terminology\n\nHtpasswd has the following usage:\n\n    apr_file_printf(errfile, \"Usage:\" NL\n        \"\\thtpasswd [-cimBdpsDv] [-C cost] passwordfile username\" NL\n        \"\\thtpasswd -b[cmBdpsDv] [-C cost] passwordfile username password\" NL\n        NL\n        \"\\thtpasswd -n[imBdps] [-C cost] username\" NL\n        \"\\thtpasswd -nb[mBdps] [-C cost] username password\" NL\n        \" -c  Create a new file.\" NL\n        \" -n  Don't update file; display results on stdout.\" NL\n        \" -b  Use the password from the command line rather than prompting \"\n            \"for it.\" NL\n        \" -i  Read password from stdin without verification (for script usage).\" NL\n        \" -m  Force MD5 encryption of the password (default).\" NL\n        \" -B  Force bcrypt encryption of the password (very secure).\" NL\n        \" -C  Set the computing time used for the bcrypt algorithm\" NL\n        \"     (higher is more secure but slower, default: %d, valid: 4 to 31).\" NL\n        \" -d  Force CRYPT encryption of the password (8 chars max, insecure).\" NL\n        \" -s  Force SHA encryption of the password (insecure).\" NL\n        \" -p  Do not encrypt the password (plaintext, insecure).\" NL\n        \" -D  Delete the specified user.\" NL\n        \" -v  Verify password for the specified user.\" NL\n        \"On other systems than Windows and NetWare the '-p' flag will \"\n            \"probably not work.\" NL\n        \"The SHA algorithm does not use a salt and is less secure than the \"\n            \"MD5 algorithm.\" NL,\n        BCRYPT_DEFAULT_COST\n    );\n\nThis is reflected to the documentation as well, however encryption != hashing.\nMD5, SHA(1), Bcrypt, CRYPT(3) are not encryption functions, they are hashing functions instead.\nTerminology should be fixed and when talking about SHA, as there are multiple versions of the SHA algorithm, it should be specified that htpasswd uses the first.", "is_private": false, "id": 187364, "creator": "mpreziuso@kaosdynamics.com", "time": "2016-01-04T16:29:13Z", "bug_id": 58798, "creation_time": "2016-01-04T16:29:13Z", "attachment_id": 33398}]