[{"count": 0, "text": "URL / query string parameters with no value (technically keyless values) are not received by the destination servlet when using request.getRequestDispatcher().forward().\n\nExample:\nrequest.getRequestDispatcher(\"/newpage?P1=1&P2\").forward(request,response);\n\nThe servlet handling /newpage will have P1 in the request parameter list but not P2 even though both parameters are in the query string verified with request.getQueryString().  The order and quantity of parameters doesn't seem to make a difference, those without values are not seen by the servlet, while those with values (or even with just an = but no value) are.\n\nI believe the cause may be in ApplicationHttpRequest.mergeParameters().  Possibly the line \"if (value == null)\" should be replaced with if (queryParameters.containsKey(key)) (among other things), but I'm not 100% on that, building and debugging Tomcat is beyond my capabilities at this point.\n\nI have a pair of test servlets that show this behavior on my development server if somebody wants to see it in action.  Email me safepassing2/gmail_com and I'll provide the address.", "creator": "safepassing2@gmail.com", "is_private": false, "id": 187558, "time": "2016-01-12T04:28:46Z", "bug_id": 58836, "creation_time": "2016-01-12T04:28:46Z", "tags": [], "attachment_id": null}, {"count": 1, "text": "Thanks for the report. I have written a simple test case that demonstrates this. You are right that the issue is in ApplicationHttpRequest.mergeParameters(). The problem is that it uses RequestUtil.parseParameters() to process the query string which ignores parameters with no value.\n\nI'm currently looking into how to use the same parameter parsing code as is used for incoming requests. As well as fixing this issue, that should enable the RequestUtil code to be removed.", "creator": "markt@apache.org", "attachment_id": null, "id": 187612, "time": "2016-01-13T11:37:10Z", "bug_id": 58836, "creation_time": "2016-01-13T11:37:10Z", "tags": [], "is_private": false}, {"count": 2, "text": "This has been fixed in 9.0.x for 9.0.0.M2, 8.0.x for 8.0.31, 7.0.x for 7.0.68 and 6.0.x for 6.0.45.\n\nThanks again for the report.", "creator": "markt@apache.org", "attachment_id": null, "id": 187616, "time": "2016-01-13T15:02:57Z", "bug_id": 58836, "creation_time": "2016-01-13T15:02:57Z", "tags": [], "is_private": false}]