[{"count": 0, "tags": [], "bug_id": 58891, "is_private": false, "id": 187830, "attachment_id": 33465, "creator": "alexander.kjall@gmail.com", "creation_time": "2016-01-19T18:12:37Z", "time": "2016-01-19T18:12:37Z", "text": "Created attachment 33465\nimprove SSL/TLS documentation\n\nThe current documentation gives really bad advise about how to handle SSL/TLS certificates that might even lead to peoples websites being attacked.\n\nI have rewritten the documentation and fixed the following problems:\n\n1) Encouragement of using self signed certificates.\n2) Advise to mix SSL and non-SSL pages on the same site (this could easily lead to session cookie theft).\n3) No information about HSTS\n4) Outdated information about SNI and how the SSL/TLS handshake works.\n\nAttached is a patch that rewrites the documentation"}, {"count": 1, "tags": [], "bug_id": 58891, "is_private": false, "id": 187838, "attachment_id": null, "creator": "remm@apache.org", "creation_time": "2016-01-19T23:33:57Z", "time": "2016-01-19T23:33:57Z", "text": "IMO this howto is a quick start with running the SSL connectors and testing them, intended for developers. SSL is complex ! It could a good idea to add some \"production\" SSL information in addition to that though, but I wouldn't replace the existing content."}, {"count": 2, "tags": [], "bug_id": 58891, "attachment_id": null, "id": 187848, "time": "2016-01-20T08:49:14Z", "creator": "alexander.kjall@gmail.com", "creation_time": "2016-01-20T08:49:14Z", "is_private": false, "text": "Hi\n\nI agree that SSL is complex, and I don't think it's within the scope of the tomcat documentation to address all aspects of it, it can be very lengthy to describe how different attack vectors works for example. I feel that a good condensed version could be to give advise that doesn't expose users to security vulnerabilities.\n\nBut the SSL \"landscape\" have change significantly since the original text was written and my personal opinion is that the text needs to be a bit updated so that it reflect how the world works today.\n\nMaybe we can break down the changes that I feel are important from a security perspective and talk about them point by point, I'm of course willing to rewrite the patch again to incorporate your feedback.\n\n1) About self signed certs:\n\nThis is pretty important, as the original text portrays scenarios where end users are presented with self signed certs. \n\nA self signed cert should never be presented to end users as this doesn't offer any protection against an attacker that does a man-in-the-middle attack.\n\nThere is also no real reason to not get your certificate signed by a real CA now that Lets encrypt offers SSL/TLS certificates that are both free and automatable.\n\n2) Mixing SSL and non-SSL pages.\n\nThis advise is also important to remove, if people do SSL like this it's trivial to steal session cookies.\n\nWith todays hardware it's also not that computable expensive to make sure all content is distributed over a secure channel.\n\nI feel that it adds value to say something about not mixing SSL/non-SSL content, but that could maybe be removed.\n\n3) Information about HSTS.\n\nThis isn't that important, it's more of a nice to have.\n\n4) SNI information.\n\nThis section could maybe be phrased differently? Maybe say something about the SSL limitation to one certificate per IP not being that important now that people use IPv6?"}, {"count": 3, "tags": [], "text": "I like the idea, I don't like your re-write as it stands. A certificate, for instance, does not guarantee security of a site. The site can be full of malware designed to attack you and still have a certificate. The certificate is a part of common-deployments of TLS, and allows for the authentication of a web site (via a third party certificate authority) and the beginning of the negotiation of encryption keys for a session.\n\nPerhaps what we should say is this:\n\nTLS is complex! Go read all about it [provide links] and then come back here for the configuration details.", "is_private": false, "id": 187864, "creator": "chris@christopherschultz.net", "time": "2016-01-21T02:10:42Z", "bug_id": 58891, "creation_time": "2016-01-21T02:10:42Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 58891, "attachment_id": null, "is_private": false, "id": 187878, "time": "2016-01-21T17:25:34Z", "creator": "remm@apache.org", "creation_time": "2016-01-21T17:25:34Z", "text": "Generally, I would like to keep the SSL page as a quick start, focusing on people being able to test SSL with Tomcat as easily as possible.\n\nBTW, the session cookie should be marked secure and shouldn't be leaked (assuming it is created by auth, and if it is not, the auth is supposed to renew it).\n\nThe main thing I'd agree on is remove the segment on hosts, since now it is implemented."}, {"count": 5, "tags": [], "text": "Thanks for the suggestion. I haven't used the patch as is but I have updated the SSL how-to based on this suggestion and the subsequent discussion.\n\nThe changes will be in:\n- 9.0.0.M7 onwards\n- 8.5.3 onwards\n- 8.0.36 onwards\n- 7.0.70 onwards\n- 6.0.46 onwards", "is_private": false, "id": 191194, "creator": "markt@apache.org", "time": "2016-05-23T16:17:33Z", "bug_id": 58891, "creation_time": "2016-05-23T16:17:33Z", "attachment_id": null}]