[{"count": 0, "tags": [], "creator": "chealer@gmail.com", "text": "http://httpd.apache.org/ contains:\n>We hope that by making it easier to use our mirrors that we will be able to provide a better download experience.\nThere is an extra \"that\" there. Either:\n>By making it easier to use our mirrors, we hope that we will be able to provide a better download experience.\n...or:\n>We hope that by making it easier to use our mirrors, we will be able to provide a better download experience.\n\nThough this whole section is superfluous:\n>Great! We have updated our download page in an effort to better utilize our mirrors. We hope that by making it easier to use our mirrors that we will be able to provide a better download experience.\n\n>Please ensure that you verify your downloads using PGP or MD5 signatures\n\nWhatever effort this refers to is more than 3 years old. As for the second paragraph, it is superfluous given that the download page already contains:\n>You must verify the integrity of the downloaded files using signatures downloaded from our main distribution directory.\n\n\nThe only thing still valuable in this section is the link to the download page, but even that might not be necessary given the links in the announcements and in the left menu.", "id": 188073, "time": "2016-01-30T18:28:50Z", "bug_id": 58948, "creation_time": "2016-01-30T18:28:50Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "toscano.luca@gmail.com", "text": "Hi Filipus!\n\nUpdated the front page as suggested with:\n\n\"\"\"\nWe hope that by making it easier to use our mirrors, we will be able to provide a better download experience.\n\"\"\"\n\nI still think that it is valuable to keep that section, it reflects a bit the mood of the httpd's developers :)\n\n> Whatever effort this refers to is more than 3 years old.\n\nWhat do you mean? I updated the verification pages last week with up to date examples. Can you re-check with a cache refresh?\n\nThanks!\n\nLuca", "id": 188081, "time": "2016-01-31T16:53:29Z", "bug_id": 58948, "creation_time": "2016-01-31T16:53:29Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "chealer@gmail.com", "is_private": false, "text": "Hi Luca,\n\n(In reply to Luca Toscano from comment #1)\n> Hi Filipus!\n> \n> Updated the front page as suggested with:\n> \n> \"\"\"\n> We hope that by making it easier to use our mirrors, we will be able to\n> provide a better download experience.\n> \"\"\"\n> \n\nThank you\n\n> I still think that it is valuable to keep that section, it reflects a bit\n> the mood of the httpd's developers :)\n> \n> > Whatever effort this refers to is more than 3 years old.\n> \n> What do you mean? I updated the verification pages last week with up to date\n> examples. Can you re-check with a cache refresh?\n\nI mean that the update the first paragraph refers is more than 3 years old according to https://svn.apache.org/viewvc/httpd/site/trunk/content/index.mdtext?view=log\n\nTherefore, \"we will be able to provide a better download experience\" should in fact read \"we were able (over 3 years ago) to provide a better download experience\". Which - obviously - would be quite silly.", "id": 188091, "time": "2016-01-31T19:39:04Z", "bug_id": 58948, "creation_time": "2016-01-31T19:39:04Z", "attachment_id": null}]