[{"count": 0, "tags": [], "creator": "csutherl@apache.org", "text": "Created attachment 33569\nRough patch proposal\n\n+++ This bug was initially created as a clone of Bug #48674 +++\n\nIf one create virtual host using /host-manager application all work as\nexpected. Start/Stop/Remove actions.\nBut newly created host is not persistently added to the Tomcat configuration.\nAfter restart of Tomcat there is only localhost host listed.", "id": 188569, "time": "2016-02-18T15:07:04Z", "bug_id": 59027, "creation_time": "2016-02-18T15:07:04Z", "is_private": false, "attachment_id": 33569}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "\n\n*** This bug has been marked as a duplicate of bug 48674 ***", "id": 188570, "time": "2016-02-18T15:12:19Z", "bug_id": 59027, "creation_time": "2016-02-18T15:12:19Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 59027, "attachment_id": null, "text": "This enhancement was brought to my attention and seemed like a relatively easy thing to add, so I gave it a shot. Instead of using the patch from the original bug I re-implemented the request using StoreConfig. This makes the changes a lot smaller and prevented functional duplication of code that already existed in StoreConfig. Note that this patch isn't 100% complete; I'm looking for some feedback on how I can resolve a couple of things before I would consider it complete.\n\nMy original thought was to add a button next to each host that would be available to persist the host's configuration, however I think the StoreConfig interface Impl needs some changes to make that happen, so I'm just using storeConfig to save the complete configuration. I left the button on the host row because I couldn't figure out where else to put it (feedback please). Maybe it should be a link at the top? I also just noticed when I was doing some testing that there is no way to remove a host and persist that, so that furthers the idea that the button should be somewhere else on the page.\n\nIf StoreConfig isn't enabled when you click the persist button it will provide a failure message that suggests enabling it by catching the InstanceNotFound exception.", "id": 188572, "time": "2016-02-18T15:14:51Z", "creator": "csutherl@apache.org", "creation_time": "2016-02-18T15:14:51Z", "is_private": false}]