[{"count": 0, "tags": [], "bug_id": 59029, "attachment_id": null, "text": "looks like jmeter is using the PoolingConnectionManager default values.\nFrom PoolingConnectionManager javadoc\n* PoolingConnectionManager maintains a maximum limit of connection on\n* a per route basis and in total. Per default this implementation will\n* create no more than than 2 concurrent connections per given route\n* and no more 20 connections in total.\n\nWe should initialize the MeasuringConnectionManager with better (higher) default values.", "id": 188579, "time": "2016-02-18T17:20:43Z", "creator": "benoit.wiart@gmail.com", "creation_time": "2016-02-18T17:20:43Z", "is_private": false}, {"count": 1, "tags": [], "text": "Each JMeter thread is intended to simulate an independent user.\n\nSo I'm not sure it makes sense to pool connections across threads.\nIn fact that was one of the issues with using the Java HTTP implementation - it was not possible to control connection pooling.\n\nThe defaults seem reasonable to me for a single user.", "attachment_id": null, "bug_id": 59029, "id": 188581, "time": "2016-02-18T19:07:36Z", "creator": "sebb@apache.org", "creation_time": "2016-02-18T19:07:36Z", "is_private": false}, {"count": 2, "tags": [], "text": "a connection pool is created for each user (thread) see HTTPHC4Impl#setupClient\nSo this is not about sharing connections across threads.\n\nModern browsers use more connections than the current JMeter default.\nsee http://sgdev-blog.blogspot.fr/2014/01/maximum-concurrent-connection-to-same.html\n\nEven for a single user, current defaults are not reasonable", "attachment_id": null, "id": 188585, "creator": "benoit.wiart@gmail.com", "time": "2016-02-18T20:48:30Z", "bug_id": 59029, "creation_time": "2016-02-18T20:48:30Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 59029, "attachment_id": null, "text": "JMeter is not a browser.\n\nJMeter threads behave more like a single browser tab. A browser with a single tab does not need as many connections.\n\nUnless you can show that there is a need to change the default, I think it should be left as it is. If there is a need to change the default for a particular test, then there should be a way to configure the values.", "id": 188586, "time": "2016-02-18T21:19:10Z", "creator": "sebb@apache.org", "creation_time": "2016-02-18T21:19:10Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 59029, "attachment_id": null, "text": "> JMeter is not a browser.\nthanx I wasn't aware... \nBut, to be realist, the load should simulate a browser behavior.\n\n> A browser with a single tab does not need as many connections.\nWhere did you take this information ?\nI'm afraid that's wrong. Google for \"browser max connection per host\".\nfor example for ie 8 :\n\"The connection limit is per process, the browser will make the determination about process creation as a web site owner you can't really change that. The process may be shared between multiple tabs/windows or it may not, it depends on many factors outside your control.\"\n\n\nthe new default value will not change the \"main\" http samplers as for a given user they are executed sequentially.\nBut it will make the embedded resources parallel downloads more realistic.\n\na global parameter that let the user choose a custom value is fine BUT the default value should also be increased.\n\nBTW, did you know that JMeter is not a browser ? ;-)", "id": 188588, "time": "2016-02-18T22:47:09Z", "creator": "benoit.wiart@gmail.com", "creation_time": "2016-02-18T22:47:09Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 59029, "text": "Will be fixed within Bug 59034\n\n*** This bug has been marked as a duplicate of bug 59034 ***", "id": 188656, "attachment_id": null, "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2016-02-21T21:46:17Z", "time": "2016-02-21T21:46:17Z", "is_private": false}]