[{"count": 0, "tags": [], "bug_id": 59098, "attachment_id": null, "id": 189021, "time": "2016-03-02T13:20:03Z", "creator": "jmarkmurph@yahoo.com", "creation_time": "2016-03-02T13:20:03Z", "is_private": false, "text": "XSSFRichTextString.append(string) works correctly if the value of the XSSFRichTextString is empty. However if a different font has been applied to a section of the text, it applies a font, I believe the default font, which is wrong (different from the way Excel works). append(string) should append a string without a font which will allow the text to use the cell style to determine the font. See the following example XML generated by \n\nXSSFRichTextString rts = new XSSFRichTextString();\nrts.append(\"This is correct \");\nrts.append(\"This is Bold Red\", BoldRed);\nrts.append(\" This uses the default font rather than the cell style font\");\n\n<si>\n  <r>\n    <t xml:space=\"preserve\">This is correct </t>\n  </r>\n  <r>\n    <rPr>\n      <b/>\n      <sz val=\"11\"/>\n      <color indexed=\"10\"/>\n      <rFont val=\"Calibri\"/>\n      <family val=\"2\"/>\n    </rPr>\n    <t>This is Bold Red</t>\n  </r>\n  <r>\n    <rPr>\n      <sz val=\"11\"/>\n      <color indexed=\"8\"/>\n      <rFont val=\"Calibri\"/>\n      <family val=\"2\"/>\n      <scheme val=\"minor\"/>\n    </rPr>\n    <t xml:space=\"preserve\"> This uses the default font rather than the cell style font</t>\n  </r>\n</si>\n\nYou can clearly see the three text groupings added by the three append methods. The first does not include a font, and consequently does not include an <rPr> node. The second does include a font, and does include an <rPr> node. However, the third append does not include a font, and thus should not include an <rPr> node. In Excel If I take this string, and bold red the date string in the middle of it, the two other strings have no <rPr> nodes, which is what I expected. The result is that if the cell style uses other than the default font, only the first append(string) method will add text that uses the font in the cell style. Any append(string) methods called after an append(string, font) call will explicitly use the spreadsheet default font."}, {"count": 1, "tags": [], "bug_id": 59098, "attachment_id": null, "text": "Whoops, I change the data to protect the innocent, but did not change my description. The date string above was changed to \"This is Bold Red\". Also, I found this XML in the sharedStrings.xml in the final spreadsheet.", "id": 189022, "time": "2016-03-02T13:23:58Z", "creator": "jmarkmurph@yahoo.com", "creation_time": "2016-03-02T13:23:58Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 59098, "attachment_id": null, "text": "I could not reproduce this with a small unit-test. There was a related fix in POI 3.14 via bug 58315, so please try again with release 3.14 and reopen this bug, ideally with a standalone junit-test which reproduces the problem.\n\n*** This bug has been marked as a duplicate of bug 58315 ***", "id": 189383, "time": "2016-03-11T22:24:47Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-03-11T22:24:47Z", "is_private": false}]