[{"count": 0, "tags": [], "text": "Created attachment 33624\nA screen shot showing thread as 'r' when most of them are really 'k'.\n\nAfter downloading and installing the http2 module that fixed the problem with processes being stuck in gracefully exiting after doing a graceful restart, as\nidentified in bug #59078, while the fix did fix that problem it introduced a new\nproblem, now processes in keep-alive are instead displaying as 'R' read in the\nserver-status instead of 'K' for keep-alive.  But server-status still counts the\nnumber in keep-alive in the upper portion.", "is_private": false, "id": 189115, "creator": "nanook@eskimo.com", "time": "2016-03-04T21:03:04Z", "bug_id": 59121, "creation_time": "2016-03-04T21:03:04Z", "attachment_id": 33624}, {"count": 1, "tags": [], "creator": "stefan@eissing.org", "attachment_id": null, "text": "Sorry, for responding so late.\n\nAs I see it, the scoreboard shows 45 threads that occupy workers, most of them in R, some in W. This does *not* show the connections in keepalive stat, as in the event MPM, these connections do not occupy a worker slot.\n\nIf you see the scoreboard of a worker MPM, you indeed see 'K' workers, as keepalive handling continues to occupy worker threads.\n\nSo, I think this is a misunderstanding of how event and scoreboard display things. But maybe I misunderstood what you meant?\n\nStefan", "id": 189310, "time": "2016-03-09T15:47:27Z", "bug_id": 59121, "creation_time": "2016-03-09T15:47:27Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 59121, "attachment_id": null, "id": 189347, "time": "2016-03-10T20:42:18Z", "creator": "nanook@eskimo.com", "creation_time": "2016-03-10T20:42:18Z", "is_private": false, "text": "This server is setup with the Event MPM and WAS showing workers in the 'K' keep-alive state until the fix for this module that corrected the getting stuck in graceful existing state.  And if you look at the top, you'll see it still shows a count with a number of workers in keep-alive even though the scoreboard\ndoes not."}, {"count": 3, "tags": [], "text": "Server status behaviour has been restored in 2.4.20.", "is_private": false, "id": 193432, "creator": "stefan@eissing.org", "time": "2016-08-31T14:00:55Z", "bug_id": 59121, "creation_time": "2016-08-31T14:00:55Z", "attachment_id": null}]