[{"attachment_id": null, "tags": [], "creator": "knst.kolinko@gmail.com", "is_private": false, "count": 0, "id": 189293, "time": "2016-03-09T09:34:09Z", "bug_id": 59150, "creation_time": "2016-03-09T09:34:09Z", "text": "Continuing from my concern raised in \"Tomcat 8.next\" thread (Feb 2016)\n\n>>\n>> 2. The feature of auto-switching sslImplementationName with\n>> availability of TCNative library needs better documentation. I suspect\n>> that it may come as a surprise.\n>>\n>> There is documentation of sslImplementationName attribute on\n>> config/http.html, but the attribute of AprLifecycleListener\n>> (useAprConnector) is not documented at all.\n>>\n>\n> It is supposed to be documented as of r1729644. OTOH, I'm not that good\n> with that kind of thing, and maybe it is still confusing.\n>\n\n1) The \"useAprConnector\" attribute of AprLifecycleListener must be documented in config/listeners.html\n\nThat attribute affects what connector implementation is auto-selected when Connector protocol is specified as simple \"HTTP/1.1\" or \"AJP/1.3\". The value of \"false\" means that the NIO implementation is used. The value of \"true\" means that the implementation is either NIO or APR, depending on availability of Tomcat-Native library.\n\nSetting it to \"false\" disables autoselection of Connector protocol implementation.\n\n\n2) I think there needs to be similar attribute to control autoselection of value of sslImplementationName for a HTTPS connector. With such attribute one will be able to turn off that autoselection magic off.\n\nI do not have a good name yet, though. Maybe \"useOpensslJsseImplementation\".\n\nMotivation is that AprLifecycleListener can just be there to load the library. A person may not need the autoselection feature. E.g. one can use two explicitly configured APR and NIO connectors in parallel - the AprLifecycleListener is used to load the library and nothing more is expected.\n\n(Implementation pointer: the autoselection happens in o.a.c.connector.Connector.initInternal(). See for \"SslImplementationName\" there.)\n\n\nPart 1) is a bug to be fixed (missing documentation for the attribute).\n\nPart 2) is an enhancement request."}, {"count": 1, "tags": [], "bug_id": 59150, "attachment_id": null, "text": "Selection of the underlying crypto engine in JSSE is typically done by specifying the \"provider\". So instead of useOpensslJSSEImplementation=\"true\", perhaps we specify JSSEProvider=\"OpenSSL\" (or whatever the OpenSSL provider's name actually is). This would be more extensible, and would even allow for 3rd-party crypto providers to be used, such as Bouncy Castle.\n\nThe default would be (blank) and would not specify a provider when initializing algorithms -- giving Tomcat the JVM's default provider.", "id": 189304, "time": "2016-03-09T14:47:47Z", "creator": "chris@christopherschultz.net", "creation_time": "2016-03-09T14:47:47Z", "is_private": false}, {"count": 2, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "I've fixed 1) but not 2) for 9.0.0.M4", "id": 189309, "time": "2016-03-09T15:39:32Z", "bug_id": 59150, "creation_time": "2016-03-09T15:39:32Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 59150, "is_private": false, "text": "Thanks, I would have done it in a few hours.\n\nFor 2), it used to be an automatic switch for the APR connector so a flag is not necessarily needed, but I'll add a \"useOpenSSL\" flag anyway [the name is shorter and IMO it works as well].\n\nNote for comment 1: the JCE configuration is not related to this, Tomcat's OpenSSL \"JSSE\" simply provides an alternate SSL engine implementation.", "id": 189314, "time": "2016-03-09T17:38:51Z", "creator": "remm@apache.org", "creation_time": "2016-03-09T17:38:51Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 59150, "is_private": false, "text": "(In reply to Remy Maucherat from comment #3)\n> Thanks, I would have done it in a few hours.\n\nI know. Normally I would have waited but I'm close to tagging 9.0.0.M4 and at that point it was the only thing between me and the unit test runs before I did the tag. Of course, now those runs have completed I have a few failures to look at...", "id": 189317, "time": "2016-03-09T19:05:49Z", "creator": "markt@apache.org", "creation_time": "2016-03-09T19:05:49Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 59150, "is_private": false, "text": "I added a useOpenSSL flag, it's shorter and should be mostly equivalent to useOpensslJsseImplementation.\n\nGood luck with M4 and the forking.", "id": 189334, "time": "2016-03-10T09:40:55Z", "creator": "remm@apache.org", "creation_time": "2016-03-10T09:40:55Z", "attachment_id": null}]