[{"count": 0, "tags": [], "bug_id": 59245, "attachment_id": null, "text": "Increasing security threads force service providers to increase security levels on their backend applications to communicate across the network.\n\nPublishing and Subscribing to message queues requires more and more the use of TLS security to validate source and destination of the messages (signing). Some companies or developers has opted for including a custom header on the JMS request with a signature which is a valid approach but not possible to test it using JMeter as custom headers are not allowed yet on JMS Point to Point sampler.\n\nThe only way to test the service so far is to disable TLS or include a JSR223 Pre-processor to deal with it, but actually building a pre-processor means re-implement the whole JMS Point to Point sampler which is a bit of a nonsense.\n\nThank you,\nMaurizio", "id": 189780, "time": "2016-03-29T13:48:38Z", "creator": "mdiianni@gmail.com", "creation_time": "2016-03-29T13:48:38Z", "is_private": false}, {"count": 1, "attachment_id": null, "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "id": 189805, "time": "2016-03-29T19:39:46Z", "bug_id": 59245, "creation_time": "2016-03-29T19:39:46Z", "tags": [], "text": "Hello,\nSo that your request is clear for us, could you attach your JSR223 preprocessor code ?\nAFAIU JMS Header as of 1.1 are restricted to :\nJMSCorrelationId\nJMSMessageId\nJMSTimestamp\nJMSType\nJMSExpiration\nJMSPriority\nJMSDestination \n\n\nMessage header field references are restricted to JMSDeliveryMode, JMSPriority, JMSMessageID, JMSTimestamp, JMSCorrelationID, and JMSType.\nJMSMessageID, JMSCorrelationID, and JMSType values may be null and if so are treated as a NULL value. \n\nWhat is the Header that you need to add ?\nThanks for clarification"}, {"count": 2, "tags": [], "bug_id": 59245, "attachment_id": null, "id": 189818, "time": "2016-03-30T09:00:54Z", "creator": "mdiianni@gmail.com", "creation_time": "2016-03-30T09:00:54Z", "is_private": false, "text": "Hi Phillipe, thanks your reply,\n\nBasically I'm trying to run a test injecting messages into a JMS queue using JMeter Point-to-Point Sampler using Request Only mode (fire and forget).\n\nOn application side, provider has implemented a solution using Apache ServiceMix stack which implements ActiveMQ, Camel, CXF and Karaf. \n\nCamel in this case is handling the signing and verification on application side using camel:crypto (http://camel.apache.org/crypto.html). What is does is generate a message signature and put it into the 'CamelDigitalSignature' JMS header.\n\nSo far, I don't have yet a preprocessor to handle this yet, still work in progress.\n\nAttached there is a java snippet with the skeleton of what I have done so far to sign the message, I still need to sort out adding the header and send the jms request."}, {"count": 3, "tags": [], "bug_id": 59245, "text": "Created attachment 33711\njmsclient snippet", "id": 189819, "time": "2016-03-30T09:01:42Z", "creator": "mdiianni@gmail.com", "creation_time": "2016-03-30T09:01:42Z", "is_private": false, "attachment_id": 33711}]