[{"count": 0, "tags": [], "bug_id": 59325, "is_private": false, "text": "hi,\n\n i cannot find a way to contact anyone on the wiki so i file it here because it bitted me HARD.\n\n\nhttps://wiki.apache.org/httpd/PHP-FPM\n\nthe php-fpm wiki page state that to use php-fpm you should user proxypassmatch directive.\n\n\n Nowhere it state that this ignore all htaccess leading to things like byp^sssing all security :\n\nhttp://test.com  => pop up for authentification\nhttp://test.com/index.php  => http 200 you pass\n\nthis negate all htaccess restriction rules and all rewrites etc...\n\ni cannot edit the page, comment it or contact anyone on the wiki that i can find so sorry if it is not the good place.\n\nIs there a way to put a warnign on this page i dont want others to feel the pain i felt.\n\n\nthanks for the httpd and all your work ! :)\n\n\n\nregards,\nghislain.", "id": 190251, "time": "2016-04-14T16:57:39Z", "creator": "gadnet@aqueos.com", "creation_time": "2016-04-14T16:57:39Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "gadnet@aqueos.com", "text": "i should add that the proxypassmatch doc do not seems to indicate it will negate evry internal processing, perhaps a warning that this directive ignores htaccess tooo could be handy :)", "id": 190252, "attachment_id": null, "bug_id": 59325, "creation_time": "2016-04-14T16:58:40Z", "time": "2016-04-14T16:58:40Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 59325, "text": "This is mostly not relevant to the purpose of that recipe.\n\nhtaccess files have nothing to do with security, nor authentication. They are merely containers that can be used provided one cannot edit your config files as the root user.\n\nAdditionally, in order to complete that recipe, you *will* require root access, or whatever admin user your initial httpd process is running at.\n\nProper authn and authz can be performed in a <Location> block, if needed, as it is the case with any proxy.", "id": 190547, "time": "2016-04-25T23:42:18Z", "creator": "thumbs@apache.org", "creation_time": "2016-04-25T23:42:18Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 59325, "is_private": false, "text": "I've added a warning to this effect in the caveats section.", "id": 192634, "time": "2016-07-25T21:04:04Z", "creator": "rbowen@apache.org", "creation_time": "2016-07-25T21:04:04Z", "attachment_id": null}]