[{"count": 0, "tags": [], "creator": "ian@cybercat.ca", "attachment_id": null, "is_private": false, "id": 190415, "time": "2016-04-20T19:23:21Z", "bug_id": 59362, "creation_time": "2016-04-20T19:23:21Z", "text": "I get a MissingArgPtg when trying to analyse a cell with the following formula: \"=SUM(C9;D9;;E9)\"\n\nThe double semi-column generates that.\n\nBut Excel and LibreOffice can manage it.\n\nContext: we have people creating and testing spreadsheets in Excel. But we are using the spreadsheet programmatically to compute prices.\n\nIf it works in Excel, can we assume it should works through the POI API?\n\nThank you."}, {"count": 1, "tags": [], "creator": "onealj@apache.org", "is_private": false, "id": 190417, "creation_time": "2016-04-20T21:26:21Z", "time": "2016-04-20T21:26:21Z", "bug_id": 59362, "text": "I tried typing that formula into Excel 2013 and got a \"we found a typo in your formula and tried to correct it\" error. Semicolons are not valid separators. Use commas instead.", "attachment_id": null}, {"count": 2, "tags": [], "creator": "onealj@apache.org", "attachment_id": null, "text": "What locale of Excel are using? I suppose Excel and LibreOffice may have changed the formula argument delimiter from a comma to a semicolon for locales that use comma as the delimiter between the whole and fractional part of a number.\n\nIs POI's formula parser locale-aware?\nIf so, then this bug is really the same as SUM(C9,D9,,E9) (which is valid for Excel 2013 en-us)\nIf not, then I would expect SUM(C9;D9) to fail as well.\n\nPlease respond what locale you're using for Excel, LibreOffice, the file, and POI.\nPlease report if POI is able to parse SUM(C9;D9) on your system.", "id": 190418, "time": "2016-04-20T21:34:51Z", "bug_id": 59362, "creation_time": "2016-04-20T21:34:51Z", "is_private": false}, {"count": 3, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "is_private": false, "id": 191037, "time": "2016-05-17T19:27:01Z", "bug_id": 59362, "creation_time": "2016-05-17T19:27:01Z", "text": "No response on the questions, so no way to fix something here for now, please reopen with the required info if you are still having this problem."}]