[{"count": 0, "tags": [], "text": "In order to be able to programatically (i.e. through a variable) disable a Constant Throughput Timer it should be possible to enter a negative taget throughput, which would switch off the functionality of this element. This is congruent with the behaviour of Loop Count and Duration in the Thread Group.", "is_private": false, "bug_id": 59448, "id": 190796, "time": "2016-05-10T02:18:42Z", "creator": "jmeter@erlewein.org", "creation_time": "2016-05-10T02:18:42Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "jmeter@erlewein.org", "text": "I'd add something like this in the file ConstantThroughputTimer.java. Please note though that I am not a Java dev by any interpretation. So might be totally off. And I don't (yet) have a JMeter dev environment so can't do a feature.\n\n   // Calculate the delay based on the mode\n   private long calculateDelay() {\n      long delay = 0;\n      if (throughput < 0.0) {\n          return delay;\n          break;\n      }", "id": 190797, "time": "2016-05-10T02:30:03Z", "bug_id": 59448, "creation_time": "2016-05-10T02:30:03Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "sebb@apache.org", "is_private": false, "id": 190805, "time": "2016-05-10T09:44:26Z", "bug_id": 59448, "creation_time": "2016-05-10T09:44:26Z", "tags": [], "text": "Might make more sense to check for <= 0, as zero results in an extremely high delay. The thread runs once then waits for a very long time. Not sure there is a use case for this behaviour, though of course it would be a chnage."}, {"count": 3, "tags": [], "bug_id": 59448, "attachment_id": null, "id": 190887, "time": "2016-05-12T00:42:03Z", "creator": "jmeter@erlewein.org", "creation_time": "2016-05-12T00:42:03Z", "is_private": false, "text": "Personally I think 0.0  should be left as is. But it does have quite weird effects whn you run the test so there is a reason for actually disabling the timer. So yeah changing the behaviour of 0.0 would be good but would need to be announced as some people might actually be using it."}]