[{"count": 0, "attachment_id": null, "bug_id": 5949, "is_private": false, "id": 9768, "time": "2002-01-21T22:35:18Z", "creator": "cg@miaow.com", "creation_time": "2002-01-21T22:35:18Z", "tags": [], "text": "Use this algorithm instead (loosely inspired on how \"cook\" should work).\n\nWhen testing a file for \"out-of-dateness\", check if you have a record of this file. The simplest form of a record may be a flat file that lives in the same directory as the file, and that contains records for every file \"seen\" with three entries: timestamp, inode/device, hash fingerprint. If there is no record, assume the file is \"new\". If there is a record, and the timestamp is unchanged, assume the file is \"unchanged\". If the timestamp has changed, calculate the hash fingerprint and compare it to the registered fingerprint. If different, assume \"new\".\n\nThis enhancement would improve build and make \"ant\" usable in settings where timestamps by themselves are not reliable, or where the semantics of timestamps are different from the ones people are used to, for example when using versioned file systems like ClearCase.\n\nThe reason to key the record by inode is to allow multiple paths to exist to the same file and let ant know it is the same file."}, {"count": 1, "tags": [], "creator": "bevan.arps@clear.net.nz", "is_private": false, "text": "Keying the record by Inode restricts the functionality to *nix systems only.", "id": 9770, "time": "2002-01-21T22:45:10Z", "bug_id": 5949, "creation_time": "2002-01-21T22:45:10Z", "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 5949, "is_private": false, "id": 32761, "time": "2003-03-10T06:01:33Z", "creator": "stevel@apache.org", "creation_time": "2003-03-10T06:01:33Z", "tags": [], "text": "Ant in CVS has a <different> selector that lets you do a byte by byte comparison\non files, which you can use in the fileset for tasks such as <uptodate> and\n<copy>.  It is very fast when the file sizes are differnt, and can be configured\nto use/ignore timestamps in the comparison.\n\nIs this sufficient?"}, {"count": 3, "tags": [], "creator": "mbenson@apache.org", "is_private": false, "text": "No news is good news.", "id": 59791, "time": "2004-06-23T18:26:16Z", "bug_id": 5949, "creation_time": "2004-06-23T18:26:16Z", "attachment_id": null}]