[{"count": 0, "tags": [], "bug_id": 59633, "text": "In an opened script if you perform \"Save As\" function using a new different name the opened file does not change to the new Save As file name like it does in Window.  The old file name remains and you likely will overwrite the new changes to the old file.\n\nThis is a problem when you are creating versions of an existing baseline file, in that you perform a SAVE AS, then and have to Close the existing file WITHOUT saving it and then open the new file name.  If you save the open file the changes just made are applied corrupting the old file.\n\nHave seen this problem in version 2.13 and version 3.0.", "id": 191257, "time": "2016-05-25T14:08:11Z", "creator": "kcoppage@maricom.com", "creation_time": "2016-05-25T14:08:11Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "felix.schumacher@internetallee.de", "attachment_id": null, "text": "There are three different \"save as\" entries. Only one changes the current testplan name. It is the one named \"Save Test Plan as\" and can be invoked with Ctrl+Shift+s.\n\nFeel free to re-open this entry, if you think there is still an error.", "id": 191432, "time": "2016-06-06T19:12:43Z", "bug_id": 59633, "creation_time": "2016-06-06T19:12:43Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "kcoppage@maricom.com", "is_private": false, "count": 2, "id": 191433, "time": "2016-06-06T19:22:20Z", "bug_id": 59633, "creation_time": "2016-06-06T19:22:20Z", "text": "the resolution you suggest is not on the toolbar of functions.  So it does not default to Save As Test Plan, just Selection.  This is very confusing for normal Windows platform users.  If the function was added to the tool ribbon then ok that would help.\n\nI personally think it causes over-writes of existing scripts accidently.\n\nNow I know what to do, but I foresee problems with other team members who are new to Jmeter.  Not many people save files by going FILE first, when the ribbon show normal options.\n\nJust speaking from a clarity standpoint."}]