[{"count": 0, "text": "Created attachment 33926\nPatch making treatment of Area3DPtg and Ref3DPtg consistent\n\nSince POI 3.11, the setSheetOrder method on HSSFWorkbook changes formulas and named ranges which refer to areas rather than single cells to point to the wrong sheet.\n\nThis happens because the move now changes the external sheet indexes for sheets, but when FormulaShifter is used to update formulas and named ranges that refer to those sheets, only references which consist of a single cell (Ref3DPtg) are updated, leaving references to an area (Area3DPtg) unchanged but pointing at the wrong external sheet index.\n\nFor example:\n\n=========\nimport org.apache.poi.hssf.usermodel.HSSFSheet;\nimport org.apache.poi.hssf.usermodel.HSSFWorkbook;\nimport org.apache.poi.hssf.usermodel.HSSFName;\n\npublic class Demo {\n\n  public static void main(String ... args) throws Exception {\n    final HSSFWorkbook test = new HSSFWorkbook();\n    HSSFSheet sheetA = test.createSheet(\"A\");\n    HSSFSheet sheetB = test.createSheet(\"B\");\n\n    HSSFName name = test.createName();\n    name.setNameName(\"cellsOnA\");\n    name.setRefersToFormula(\"B!A1:A2\");\n    HSSFName name2 = test.createName();\n    name2.setNameName(\"cellOnA\");\n    name2.setRefersToFormula(\"B!A1\");\n\n    System.out.println(\"Formulas before sheet re-ordering:\"); \n    System.out.println(name.getRefersToFormula());\n    System.out.println(name2.getRefersToFormula());\n\n    test.setSheetOrder(\"B\", 0);\n\n    System.out.println(\"Formulas after sheet re-ordering:\"); \n    System.out.println(name.getRefersToFormula());\n    System.out.println(name2.getRefersToFormula());\n  }\n}\n=========\n\noutputs\n\n=========\nFormulas before sheet re-ordering:\nB!A1:A2\nB!A1\nFormulas after sheet re-ordering:\nA!A1:A2\nB!A1\n=========\n\ndemonstrating that the behaviour for references to cells and references to ranges of cells are inconsistent.\n\nAttached is a patch which changes the behaviour for FormulaShifter#adjustPtgDueToSheetMove to be consistent for Area3DPtg and Ref3DPtg, adding a unittest based on that for Bug 58746. However, I think this needs more work - it looks like HSSFWorkbook#setSheetOrder is passing *internal* sheet indexes in to FormulaShifter's constructor, but the values being passed to and from the Ptg appear to be *external* sheet indexes, and the two are not guaranteed to be in sync.", "bug_id": 59673, "attachment_id": 33926, "id": 191464, "time": "2016-06-08T09:44:06Z", "creator": "msww-asfbugs@corefiling.co.uk", "creation_time": "2016-06-08T09:44:06Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 59673, "text": "At first glance the patch looks good\n\nWould you like us to fully review it and aim to apply, or hold off while you dig into the sheet indicies handling some more?", "id": 191465, "time": "2016-06-08T12:30:01Z", "creator": "apache@gagravarr.org", "creation_time": "2016-06-08T12:30:01Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "msww-asfbugs@corefiling.co.uk", "attachment_id": null, "id": 191477, "time": "2016-06-09T08:58:35Z", "bug_id": 59673, "creation_time": "2016-06-09T08:58:35Z", "is_private": false, "text": "I have raised a new bug (Bug 59677) for the external indices issue with\nreproduction steps now I have been able to find some.\n\nDepending on the fix implemented for that bug, this patch may be\nredundant (except for the additional test case coverage), but depending\non approach taken for that bug might still be needed.\n\nAs there is not yet a patch/fix for that bug, I would advise you to\nreview and apply this patch - the external indexing issue only applies\nto some workbooks (where the two indices are not in sync), and corrects\nthe behaviour on all other workbooks.\n\nFor the workbooks with complicated external indices, the current\nbehaviour for area references is that they may end up pointing to the\nwrong sheet after a change in sheet order. This patch will change which\nsheet is incorrectly referenced, and can make some of the broken\nreferences point to no sheet at all, instead becoming #REF, but this is\nthe same as the current treatment of single cell references (as reported\non the new bug)."}, {"count": 3, "tags": [], "creator": "apache@gagravarr.org", "attachment_id": null, "text": "Having reviewed the surrounding code some more, I'm wondering if we need to change the adjustFormula method to take both the old and the new external sheet indexes. That way, we'd have more context available for the re-order case, and might make the removal case simpler too\n\nIt would then be up to the calling Workbook class to work out the new external sheet index, fixing up records as needed, before doing the shift\n\nAny thoughts?", "id": 191520, "time": "2016-06-10T08:55:07Z", "bug_id": 59673, "creation_time": "2016-06-10T08:55:07Z", "is_private": false}, {"count": 4, "text": "That sounds plausible as an approach.\n\nSorry, but I am unlikely to have any time for further investigation of\nthis issue in the near future. I believe this bug should not be marked as blocked on needing more information from me?", "bug_id": 59673, "is_private": false, "id": 192131, "time": "2016-07-05T10:23:49Z", "creator": "msww-asfbugs@corefiling.co.uk", "creation_time": "2016-07-05T10:23:49Z", "tags": [], "attachment_id": null}]