[{"count": 0, "tags": [], "creator": "alex.blume@garmin.com", "attachment_id": null, "id": 191647, "time": "2016-06-14T22:54:32Z", "bug_id": 59703, "creation_time": "2016-06-14T22:54:32Z", "is_private": false, "text": "In Tomcat 7 or Tomcat 8, we're seeing HTTP 500s in our access logs due to being sent requests with cookie values containing UTF-8 characters. \nThe corresponding catalina.out exception we see is this:\njava.lang.IllegalArgumentException: Control character in cookie value or attribute.\n        at org.apache.tomcat.util.http.LegacyCookieProcessor.isHttpSeparator(LegacyCookieProcessor.java:733)\n\nA recommended fix is to instead use Tomcat 8.0.35 with the \norg.apache.tomcat.util.http.Rfc6265CookieProcessor instead in my context. \n( https://tomcat.apache.org/tomcat-8.0-doc/config/cookie-processor.html )\n\nThis fixed that problem, but introduced a new one!\n\nMy responses are now blowing up because I'm setting a leading dot on cookie domains in my generated cookies.  I'm doing this so subdomains can see them. \n(Example: I want to set a cookie with domain '.example.com' so subdomain sites like meh.example.com & foo.example.com would both see them.) \n\nHere's the exception I'm now seeing: \njava.lang.IllegalArgumentException: An invalid domain [.example.com] was specified for this cookie at org.apache.tomcat.util.http.Rfc6265CookieProcessor.validateDomain(Rfc6265CookieProcessor.java:180) at org.apache.tomcat.util.http.Rfc6265CookieProcessor.generateHeader(Rfc6265CookieProcessor.java:122) \n\nCan someone look at fixing the validateDomain() method to allow leading dots in cookie domains???\n\nThis usage is perfectly legal and in fact necessary for compatibility with old browsers like IE8/9 that will ONLY allow these cookies to be seen by subdomains IF they have that leading dot set! \n(As far as I can tell anyways, a leading dot in cookie domains IS valid.)\n\nThanks, -Alex"}, {"count": 1, "text": "RFC 6265 does not permit domain values to begin with \".\". Tomcat correctly rejects these.\n\nFrom RFC 6265, Section 4.1.1\ndomain-av         = \"Domain=\" domain-value\ndomain-value      = <subdomain>\n                      ; defined in [RFC1034], Section 3.5, as\n                      ; enhanced by [RFC1123], Section 2.1\n\nFrom RFC 1034, Section 3.5\n<subdomain> ::= <label> | <subdomain> \".\" <label>\n<label> ::= <letter> [ [ <ldh-str> ] <let-dig> ]\n<ldh-str> ::= <let-dig-hyp> | <let-dig-hyp> <ldh-str>\n<let-dig-hyp> ::= <let-dig> | \"-\"\n<let-dig> ::= <letter> | <digit>\n<letter> ::= any one of the 52 alphabetic characters A through Z in\nupper case and a through z in lower case\n<digit> ::= any one of the ten digits 0 through 9\nNote that while upper and lower case letters are allowed in domain\nnames, no significance is attached to the case.  That is, two names with\nthe same spelling but different case are to be treated as if identical.\n\nThe labels must follow the rules for ARPANET host names.  They must\nstart with a letter, end with a letter or digit, and have as interior\ncharacters only letters, digits, and hyphen.  There are also some\nrestrictions on the length.  Labels must be 63 characters or less.\n\nFrom RFC 1123, Section 2.1\nOne aspect of host name syntax is hereby changed: the\nrestriction on the first character is relaxed to allow either a\nletter or a digit.  Host software MUST support this more liberal\nsyntax.", "bug_id": 59703, "attachment_id": null, "id": 191675, "time": "2016-06-15T13:02:09Z", "creator": "markt@apache.org", "creation_time": "2016-06-15T13:02:09Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 59703, "attachment_id": null, "is_private": false, "id": 198303, "time": "2017-04-15T01:49:01Z", "creator": "huxing.zhang@gmail.com", "creation_time": "2017-04-15T01:49:01Z", "text": "We ran into the same issue in 8.5.x, as a result, we've chosen to use org.apache.tomcat.util.http.LegacyCookieProcessor instead for compatibility.\n\n\nAs there is another one commenting on this issue (see bottom of [1]), is it worth mentioning it in the documentation?\n\n[1] https://tomcat.apache.org/tomcat-8.0-doc/config/cookie-processor.html"}, {"count": 3, "tags": [], "text": "There is also this thread:\nhttp://tomcat.markmail.org/thread/lmqxehlhuqjnleym\n\nBy all means, add something to the migration guide about the RFC 6265 processor and cookie domains.", "is_private": false, "bug_id": 59703, "id": 198353, "time": "2017-04-19T09:09:44Z", "creator": "markt@apache.org", "creation_time": "2017-04-19T09:09:44Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "It'd probably be good to have also included this as breaking backwards compatibility.  The widespread configuration documentation in the wild for cookie subdomains that says to use the .example.com definition, means when 8.5 replaces 8.0 for what a repo delivers for tomcat8, it will fail.  \n\nIn a situation where a new server is spinning up, grabs the new version of tomcat 8.x available, and it doesn't do anything but throw 500 errors:\nSome examples of implementing the legacy cookie handler in context.xml so that this continues to work would be more helpful than the blurb about the change in cookie handler that is in the migration guide.\n\nIn the current migration guide it also mentions nothing here about changes that are not fully backwards compatibile:\n\n-----\n\nTomcat 8.5.x noteable changes\n\nThe Tomcat developers aim for each patch release to be fully backwards compatible with the previous release. Occasionally, it is necessary to break backwards compatibility in order to fix a bug. In most cases, these changes will go unnoticed. This section lists changes that are not fully backwards compatible and might cause breakage when upgrading.\n\nNone.\n\n-----\n\nI found another thread about being willing to make changes to work with IE/Edge browsers.  I find it interesting that you are grudgingly willing to provide more help to have that browser working outside of spec than a common context configuration that will mitigate an issue for existing tomcat server operators and admins.\n\nStripping the . and passing this as mentioned in the referenced email thread would have been a pretty straightforward solution that would have made the documentation of \"None.\" actually true.  \n\njust do a search for information on: \"tomcat cookie subdomain\" and let me know where you find configuration examples that don't have the leading .", "attachment_id": null, "id": 201317, "creator": "jeremy@noskilz.com", "time": "2017-10-06T00:20:16Z", "bug_id": 59703, "creation_time": "2017-10-06T00:20:16Z", "is_private": false}]