[{"count": 0, "tags": [], "creator": "luke1410@gmx.de", "text": "There seem to be a couple of issues with the APR-util makefile on Windows which result in the APR-iconv testxlate test to fail to detect and load the dynamic DLLs.\n\n1. wrong APR_ICONV1_PATH\nAPR_ICONV1_PATH is used as the environment variable in APR-iconv to locate the DLLs it needs to load.\nThe iconv DLLs are always located in their shared out dirs (see apr-util/Makefile.win which builds the ccs/ces projects always in BIND_MODE=shared which is specified in API/build/modules.mk.win as Release/Debug depending on the BUILD_MODE - note that the API out dir doesn't distinguish between 32- or 64-bit).\nHence, APR_ICONV1_PATH should be set to either $(API_PATH)\\Release\\iconv or $(API_PATH)\\Debug\\iconv.\nThe attached patch defines a new macro (based on the BUILD_MODE and _DEBUG macro) and uses that to determine the APR_ICONV1_PATH.\n\n2. APR_ICONV1_PATH requires existing environment variable\nSetting APR_ICONV1_PATH in the makefile will only update/change the environment variable, if one existed already. It won't create an environment variable however, if none exists (see: https://msdn.microsoft.com/en-us/library/99at5bh3.aspx). The attached patch changes this to make use of the set-command instead of the macro-redefinition style.\n\n3.PATH is not pointing to DLL directories\nThe dynamically loaded DLLs refer to libapr-1.dll and libaprutil-1.dll. Hence, the directories these files are located in must be present in the PATH environment variable. Otherwise loading the DLLs will fail.\nAtm PATH is only set if MODEL is set to dynamic. But for the testxlate test it's required to be present in both models.\nFurthermore, it's required to point to the dynamic outdirs even in the static model, since the DLLs are located in these directories.\nThe patch sets the PATH unconditionally and modifies the provided paths to always point to their dynamic outdirs.\n\nNote that this resolves the build system issues related to the testxlate test failures. It won't completely resolve the test failure however, due some remaining (independent) issues in APR-iconv (reference to the other bug will be added).", "id": 191956, "time": "2016-06-27T00:11:51Z", "bug_id": 59755, "creation_time": "2016-06-27T00:11:51Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 59755, "is_private": false, "text": "Created attachment 33989\npatch to resolve testxlate related makefile.win issues", "id": 191957, "time": "2016-06-27T00:54:03Z", "creator": "luke1410@gmx.de", "creation_time": "2016-06-27T00:54:03Z", "attachment_id": 33989}, {"text": "Created attachment 33993\npatch to resolve testxlate related makefile.win issues\n\nupdated patch resolving the incorrectly placed comment related to the set command", "tags": [], "bug_id": 59755, "attachment_id": 33993, "count": 2, "id": 191984, "time": "2016-06-27T21:14:39Z", "creator": "luke1410@gmx.de", "creation_time": "2016-06-27T21:14:39Z", "is_private": false}, {"count": 3, "tags": [], "creator": "luke1410@gmx.de", "attachment_id": null, "id": 191986, "time": "2016-06-27T21:41:47Z", "bug_id": 59755, "creation_time": "2016-06-27T21:41:47Z", "is_private": false, "text": "The related UTF-7 issue (at least partially an APR-iconv issue): https://bz.apache.org/bugzilla/show_bug.cgi?id=59756"}, {"count": 4, "attachment_id": null, "bug_id": 59755, "text": "Further note that the path construction to create the path to the to be loaded iconv DLL is using forward slashes. According to the MSDN paths passed to LoadLirbaryEx should use backslashes: https://msdn.microsoft.com/en-us/library/windows/desktop/ms684179(v=vs.85).aspx\n\nHowever, the tests succeed in my case even when using forward slashes. Hence, correcting this would not necessarily be required to resolve the testxlate failures.", "id": 191987, "time": "2016-06-27T21:44:21Z", "creator": "luke1410@gmx.de", "creation_time": "2016-06-27T21:44:21Z", "tags": [], "is_private": false}]