[{"count": 0, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "is_private": false, "id": 191976, "time": "2016-06-27T17:42:44Z", "bug_id": 59765, "creation_time": "2016-06-27T17:42:44Z", "text": "provide a way to obfuscate/hash email addresses...\n\nSo /server-status can be more reasonably used publically.\n\nAlso, provide an option that says \"yes, this is public on purpose\"."}, {"count": 1, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "id": 191979, "time": "2016-06-27T18:28:38Z", "bug_id": 59765, "creation_time": "2016-06-27T18:28:38Z", "is_private": false, "text": "er, IP addresses :("}, {"count": 2, "text": "The implementation seems not super difficult, but I have a couple of questions:\n\n1) How would it be better to set the \"obfuscate\" mode to on? Something like ExtendedStatus in core or by other means?\n\n2) hashing every single IP address with a reasonable function could be good for a lot of reasons (no need for a shared state to assign the same value to the same IP over multiple requests, variety in the hashing functions, etc..) but it could also lead to resources waste while doing hash calculations on busy servers. Would it be reasonable just to remove the \"Client\" column from status and extended status? This concern might be not relevant with modern CPU, but it is good in my opinion to discuss it.", "bug_id": 59765, "attachment_id": null, "id": 192263, "time": "2016-07-09T15:35:50Z", "creator": "toscano.luca@gmail.com", "creation_time": "2016-07-09T15:35:50Z", "tags": [], "is_private": false}, {"count": 3, "tags": [], "bug_id": 59765, "attachment_id": null, "id": 192264, "time": "2016-07-09T15:57:54Z", "creator": "covener@gmail.com", "creation_time": "2016-07-09T15:57:54Z", "is_private": false, "text": "(In reply to Luca Toscano from comment #2)\n> The implementation seems not super difficult, but I have a couple of\n> questions:\n> \n> 1) How would it be better to set the \"obfuscate\" mode to on? Something like\n> ExtendedStatus in core or by other means?\n\nmod_status directive would be best.  \n> \n> 2) hashing every single IP address with a reasonable function could be good\n> for a lot of reasons (no need for a shared state to assign the same value to\n> the same IP over multiple requests, variety in the hashing functions, etc..)\n> but it could also lead to resources waste while doing hash calculations on\n> busy servers. Would it be reasonable just to remove the \"Client\" column from\n> status and extended status? This concern might be not relevant with modern\n> CPU, but it is good in my opinion to discuss it.\n\nI thought this too, and maybe it's fine for a first pass, but you probably would want to know how many clients were the same at any given time.   Maybe blank out the middle?"}, {"count": 4, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "id": 192398, "time": "2016-07-15T10:56:29Z", "bug_id": 59765, "creation_time": "2016-07-15T10:56:29Z", "is_private": false, "text": "(In reply to Eric Covener from comment #3)\n> \n> I thought this too, and maybe it's fine for a first pass, but you probably\n> would want to know how many clients were the same at any given time.   Maybe\n> blank out the middle?\n\nI would still prefer complete anonymity, not sure if we can avoid completely fingerprinting. If the goal is to offer to the admin a way to know clients connected, we could offer multiple views of mod-status, the privacy one available for everybody (removing the IPs completely) and the more complete one restricted for example to localhost. Maybe this is possible simply with the new directive?\n\nSomething like:\n\n<Location \"/server-status-admin\">\n    SetHandler server-status\n    Require host 127.0.0.1\n</Location>\n\n<Location \"/server-status\">\n    SetHandler server-status\n    Require all granted\n    ServerStatusPrivacyMode on\n</Location>"}, {"count": 5, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "is_private": false, "id": 192550, "time": "2016-07-20T11:16:52Z", "bug_id": 59765, "creation_time": "2016-07-20T11:16:52Z", "text": "Example of what I meant: http://apaste.info/SyZ\n\nThis is only a proof of concept and works only with Directory/Location context. The idea is to remove completely the Client IP column and add the sentence \"Client IP removed due to privacy mode set.\" on top of the table."}, {"count": 6, "tags": [], "bug_id": 59765, "attachment_id": null, "text": "(In reply to Luca Toscano from comment #5)\n> Example of what I meant: http://apaste.info/SyZ\n> \n> This is only a proof of concept and works only with Directory/Location\n> context. The idea is to remove completely the Client IP column and add the\n> sentence \"Client IP removed due to privacy mode set.\" on top of the table.\n\nlooks like progress, but I would suggest factoring out just the bit that retrieves the client ip, even if it means a dummy column.", "id": 192552, "time": "2016-07-20T13:56:18Z", "creator": "covener@gmail.com", "creation_time": "2016-07-20T13:56:18Z", "is_private": false}, {"count": 7, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "id": 192580, "time": "2016-07-22T14:07:38Z", "bug_id": 59765, "creation_time": "2016-07-22T14:07:38Z", "is_private": false, "text": "(In reply to Eric Covener from comment #6)\n\n> looks like progress, but I would suggest factoring out just the bit that\n> retrieves the client ip, even if it means a dummy column.\n\nNew diff: http://apaste.info/0le\n\nIf this is ok, the last step would be to add the possibility to specify a server config other than a per directory one. Never done it but it doesn't seem to be difficult."}, {"count": 8, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "id": 192583, "time": "2016-07-23T14:37:41Z", "bug_id": 59765, "creation_time": "2016-07-23T14:37:41Z", "is_private": false, "text": "https://lists.apache.org/thread.html/c4d7a66ca113727a1eb3f2fc3e17e367e08cd38a7fc36d5a252422df@1443710720@%3Csite-dev.apache.org%3E\n\nI'd done this without patching mod_status...\n\n<Location /server-status>\n  SetHandler server-status\n  <If \"%{CONN_REMOTE_ADDR} != '127.0.0.1'\">\n    SetOutputFilter Sed OutputSed \"s#<td>[^<]*</td><td nowrap>#<td>redacted</td><td nowrap>#g\"\n  </If>\n</Location>\n\nThis provides no client IP, unless a trusted service (e.g. the host itself) is inspecting the output.\n\nThe issue with hashing the IP is that it is reasonably reversible, being only one DWORD of data (excepting IPv6). The salt can be ascertained by examining the salt applied to the requester's own entry in the status output."}, {"count": 9, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "is_private": false, "id": 192591, "time": "2016-07-24T08:47:42Z", "bug_id": 59765, "creation_time": "2016-07-24T08:47:42Z", "text": "Really nice, didn't know about this config snippet! We could add it (or its mod_lua's version) to the mod_status' doc as quick and effective solution to this problem. I personally don't love the idea of relying on HTML matching to do the replacement, if something changes in mod_status' output for some reason then the sed replacement might stop working. This is really unlikely I know but I am always pessimistic when thinking about worst case scenarios :)\n\nEric, William: you have tons more experience than me in httpd development, please let me know the best way forward. If we want to go for William's solution I'll update the docs accordingly!"}, {"count": 10, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "is_private": false, "id": 194587, "time": "2016-10-20T16:56:43Z", "bug_id": 59765, "creation_time": "2016-10-20T16:56:43Z", "text": "Re-added a very simple patch in:\n\nhttp://home.apache.org/~elukey/httpd-trunk-mod_status-privacy_mode.patch\n\nThis one is only adds a new Server Directive, IIRC on IRC this was the first one suggested. I'd also see the value of having a new Directive working also with Location blocks, in order to allow request from localhost to display client IPs."}, {"count": 11, "tags": [], "creator": "jim@apache.org", "attachment_id": null, "id": 194588, "time": "2016-10-20T17:27:16Z", "bug_id": 59765, "creation_time": "2016-10-20T17:27:16Z", "is_private": false, "text": "I'd prefer that if instead of printing out \"\" it printed out something like \"x.x.x.x\" or \"255.255.255.255\" or something like that for those systems which may try to screen scrape (or use the XML output option)."}, {"count": 12, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": 34479, "is_private": false, "id": 195231, "time": "2016-11-26T10:05:54Z", "bug_id": 59765, "creation_time": "2016-11-26T10:05:54Z", "text": "Created attachment 34479\nMod status PrivacyMode directive (directory context aware version)"}, {"count": 13, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "id": 195232, "time": "2016-11-26T10:11:57Z", "bug_id": 59765, "creation_time": "2016-11-26T10:11:57Z", "is_private": false, "text": "The patch attached creates a new directive called \"PrivacyStatus\" that is directory context aware (previous patch was only server level). I think that this would be good for admins that need to publish an external public facing server-status while being able to consult a private one showing IPs.\n\nStill not worked on Jim's comment about replacing the IPs with x.x.x.x and not with a blank line.\n\n1) Would we need to distinguish between IPv4/6? So something like x.x.x.x vs [x:x:x:x] or similar? I guess that probably this info falls under the \"privacy\" shield that we want to offer, but at the same time it might confuse users. \n\n2) Is there an XML output option for mod_status?"}, {"count": 14, "tags": [], "creator": "toscano.luca@gmail.com", "attachment_id": null, "id": 196560, "time": "2017-01-30T12:40:00Z", "bug_id": 59765, "creation_time": "2017-01-30T12:40:00Z", "is_private": false, "text": "After a chat with Humbedooh there might be a better way to do this using mod-lua. I am going to update this task and the documentation when the lua code will be published."}]