[{"count": 0, "tags": [], "text": "There is already a method, updateHeaders(), that resets most of the instance computed/cached fields, but it doesn't unset the lazily evaluated start and end cell references for the Table.  If you want to add or remove rows from a table definition, you need to change the underlying CTTable object, and reset these cached values in the XSSFTable wrapper.\n\nCurrently, the only way to hack this is to use reflection to get at the private fields, which is not how we want to do it.\n\nThe easy fix is to just add:\n\npublic void updateReferences() {\n    startCellReference = null;\n    endCellReference = null;\n}\n\nThe next time they are requested, they are re-computed from the underlying (possibly updated) CTTable.\n\nIt is still up to the user to ensure the CTTable references match the data in the worksheet.\n\nI think this should be its own method, rather than just adding the two lines to updateHeaders(), as there are distinct use cases for changing the headers of a table and just adding/removing rows from a table.  No need to incur the overhead of recomputing one when only the other is changing.", "is_private": false, "id": 192111, "creator": "greg.woolsey@gmail.com", "time": "2016-07-04T16:47:09Z", "bug_id": 59795, "creation_time": "2016-07-04T16:47:09Z", "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 59795, "is_private": false, "id": 192113, "time": "2016-07-04T18:29:08Z", "creator": "onealj@apache.org", "creation_time": "2016-07-04T18:29:08Z", "tags": [], "text": "Applied in r1751368 with a corresponding unit test and updated documentation.\n\nI noticed that getRowCount returns toRow-fromRow. Shouldn't it be toRow-fromRow+1?"}, {"count": 2, "attachment_id": null, "creator": "greg.woolsey@gmail.com", "text": "(In reply to Javen O'Neal from comment #1)\n> Applied in r1751368 with a corresponding unit test and updated documentation.\n> \n> I noticed that getRowCount returns toRow-fromRow. Shouldn't it be\n> toRow-fromRow+1?\n\nGood catch, yes, I think it should.  Thanks for the quick turn around! (on a US holiday, no less - if that's where you are).\n\nDoesn't look like many people are using Tables yet in XSSF workbooks - maybe because the formula syntax didn't work until the recent flurry of changes we made.", "id": 192114, "time": "2016-07-04T18:46:34Z", "bug_id": 59795, "creation_time": "2016-07-04T18:46:34Z", "tags": [], "is_private": false}, {"count": 3, "text": "(In reply to Javen O'Neal from comment #1)\n> I noticed that getRowCount returns toRow-fromRow. Shouldn't it be\n> toRow-fromRow+1?\nSpun off getRowCount fix to bug 59796\n\n> (on a US holiday, no less - if that's where you are).\n2 hour road trip was a perfect opportunity to get these fixes in. I'm glad to have an XSSFTable expert to help this class mature (hoping to make getCTTable protected in the future).", "bug_id": 59795, "is_private": false, "id": 192117, "time": "2016-07-04T19:15:34Z", "creator": "onealj@apache.org", "creation_time": "2016-07-04T19:15:34Z", "tags": [], "attachment_id": null}, {"count": 4, "attachment_id": null, "creator": "greg.woolsey@gmail.com", "is_private": false, "id": 192118, "time": "2016-07-04T19:23:12Z", "bug_id": 59795, "creation_time": "2016-07-04T19:23:12Z", "tags": [], "text": "(In reply to Javen O'Neal from comment #3)\n> (hoping to make getCTTable protected in the future).\n\nThat will require some more code.  Right now I'm trying to figure out how to get the QueryTable related to a Table, so I can get the Connection for the QueryTable and then eventually have Java perform queries previously done by ODBC/ADO (that will be custom code, not part of POI, but the document object links are arcane and not documented).\n\nLearning about the OPCPackage, PackagePart, and POIXMLDocumentPart classes."}]