[{"count": 0, "tags": [], "bug_id": 59814, "attachment_id": null, "text": "Now that I've added more cached values to support Structured Reference syntax and performance improvements, I see that this method needs augmentation to clear the new caches down at the workbook and sheet level.\n\nXSSFEvaluationWorkbook has _sheetCache, which needs to be set to null\nBaseXSSFEvaluationWorkbook has _tableCache, which needs to be set to null\nXSSFEvaluationSheet has _cellCache, which needs to be set to null\n\nI'll work on a patch tomorrow, with some tests.  I have some other temp changes to strip out, though, to make current trunk work with another project that doesn't like some of the 3.15 API changes yet.\n\nMotivation for this change is that in that library (Vaadin Spreadsheet) there isn't a way currently to reset the formula evaluator in use, so I need to make sure clear really clears state.", "id": 192193, "time": "2016-07-07T02:42:17Z", "creator": "greg.woolsey@gmail.com", "creation_time": "2016-07-07T02:42:17Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 59814, "text": "This may only be an issue for cells inside a Table, referenced by Structured Reference syntax in a formula - very narrow.  It appears in this new use case the cell values are calculated from the XSSFEvaluationSheet._cellCache and not from the WorkbookEvaluator cell cache, thus the need to push the clear down.  \n\nStill a good idea though, to make it more obvious what needs changing when adding future cached data.\n\nBuilding a test case will be more work than usual, as it requires a Table and a formula cell that references something in the table that can change.", "id": 192194, "time": "2016-07-07T05:19:18Z", "creator": "greg.woolsey@gmail.com", "creation_time": "2016-07-07T05:19:18Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 59814, "attachment_id": 34022, "id": 192224, "time": "2016-07-07T19:07:49Z", "creator": "greg.woolsey@gmail.com", "creation_time": "2016-07-07T19:07:49Z", "is_private": false, "text": "Created attachment 34022\nFix and updated unit test resource\n\nAttached a patch to propagate the cache clearing through the evaluator object tree.\n\nIncludes an updated Structured References unit test and source file.  The updated test fails before the fix and passes with the fix."}, {"count": 3, "attachment_id": null, "creator": "onealj@apache.org", "is_private": false, "id": 192228, "time": "2016-07-07T23:18:36Z", "bug_id": 59814, "creation_time": "2016-07-07T23:18:36Z", "tags": [], "text": "Applied in r1751836 without modification. Added @Overrides in r1751837.\nThanks for the patch."}, {"count": 4, "tags": [], "bug_id": 59814, "attachment_id": null, "text": "This seems to be fixed based on the previous comment. Please reopen if not.", "id": 192416, "time": "2016-07-15T18:51:46Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-07-15T18:51:46Z", "is_private": false}]