[{"count": 0, "tags": [], "bug_id": 59839, "attachment_id": null, "id": 192280, "time": "2016-07-10T20:13:01Z", "creator": "twm@twmacinta.com", "creation_time": "2016-07-10T20:13:01Z", "is_private": false, "text": "When using a JNDIRealm to search for a user's roles recursively via the 'roleNested' option while also binding using that user's credentials via the 'roleSearchAsUser' option, only the first role search actually binds using the user's credentials.  Subsequent searches of the nested roles revert to the original security environment, which leads to a NamingException reporting that a successful bind must be completed first (see below).\n\nThe cause is straightforward, from looking at the code.  I will refer to the code for 7.0.68, as that is what I've tested against, but I also see the same issue in the code for 7.0.70 and 8.5.3.  In \"JNDIRealm.java\" and the method getRoles() (starting on line 1938), there are two calls to context.search().  The first call on line 2002 is wrapped in logic which adds the user's credentials beforehand and removes them afterward, if 'roleSearchAsUser' was specified.  The second call on line 2056 is not wrapped in the same logic, but I'm guessing it should be.  This second call is only reached if 'roleNested' is true, per the if-block starting on line 2039.\n\nThe net result is that when anonymous binding is not allowed, the first search succeeds (assuming the user entered the correct credentials) and then the second one fails with a stack trace like the following.  I've redacted the company name and info:\n\njavax.naming.NamingException: [LDAP: error code 1 - 000004DC: LdapErr: DSID-0C0906E8, comment: In order to perform this operation a successful bind must be completed on the connection., data 0, v1db1"}, {"count": 1, "tags": [], "creator": "felix.schumacher@internetallee.de", "attachment_id": 34069, "text": "Created attachment 34069\nBind user on nested role search, when asked for\n\nThe patch is done on tomcat 9 (trunk), but it should be appliable to tomcat 7 without problems.\n\nCan you test, whether it helps your case?", "id": 192600, "time": "2016-07-24T11:23:33Z", "bug_id": 59839, "creation_time": "2016-07-24T11:23:33Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 59839, "attachment_id": null, "id": 192614, "time": "2016-07-24T20:18:27Z", "creator": "twm@twmacinta.com", "creation_time": "2016-07-24T20:18:27Z", "is_private": false, "text": "Yes, it helps my case, thank you."}, {"count": 3, "attachment_id": null, "bug_id": 59839, "is_private": false, "id": 192707, "time": "2016-07-28T20:22:06Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2016-07-28T20:22:06Z", "tags": [], "text": "Fixed on tomcat 9 and will be in 9.0.0.M10.\n\nWill backport to tomcat 8.5 and 8.0 when no problem gets reported."}, {"count": 4, "tags": [], "bug_id": 59839, "attachment_id": null, "id": 192729, "time": "2016-07-31T10:02:00Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2016-07-31T10:02:00Z", "is_private": false, "text": "Fixed in 7, 8 and 8.5. Will be released with 7.0.71, 8.0.37 and 8.5.5.\n\nThanks for the report and your analysis."}]