[{"count": 0, "tags": [], "bug_id": 59930, "is_private": false, "id": 192813, "attachment_id": 34094, "creator": "asf-bugzilla@eric.brechemier.name", "creation_time": "2016-08-02T13:39:17Z", "time": "2016-08-02T13:39:17Z", "text": "Created attachment 34094\nAnt script to reproduce failure to save a file after download with retries=\"0\"\n\nThe retries attribute has been added in Apache Ant 1.8.0. It indicates \"the per download number of retries on error\" and defaults to 3.\n\nI have set this parameter to \"0\" and expected no retries on error. I did not expect this parameter to have any effect in case of successful download.\n\nWhat I observed instead is that the <get> task fails to save a file after a successful download when retries=\"0\".\n\nI confirmed that the download was successful by downloading a file from one of my own servers, and checking the server logs. The HTTP status was reported as 200 by the server.\n\nI have attached a minimum example of successful download with retries=\"1\" and failure with retries=\"0\".\n\nThe failure message is very cryptic and gives no hint on the cause of failure (i.e. no mention that the maximum number of retries has been reached):\n\n  Can't get http://www.apache.org/dist/ant/KEYS to /[full path]/KEYS"}, {"count": 1, "tags": [], "bug_id": 59930, "attachment_id": null, "id": 192942, "time": "2016-08-07T09:06:43Z", "creator": "bodewig@apache.org", "creation_time": "2016-08-07T09:06:43Z", "is_private": false, "text": "The name of the attribute and the documentation are misleading. It should be \"tries\" rather than \"retries\". If you set it to 0 then no download will be attempted at all. I'll clarify the doucmentation as fixing the code to make \"retries\" do what the name implies may cause unintended side effects to existing builds."}, {"count": 2, "text": "fixed the documentation with git commit 1de4dfa", "creator": "bodewig@apache.org", "is_private": false, "id": 192943, "time": "2016-08-07T09:17:51Z", "bug_id": 59930, "creation_time": "2016-08-07T09:17:51Z", "tags": [], "attachment_id": null}]