[{"count": 0, "attachment_id": 34111, "bug_id": 59958, "is_private": false, "id": 192953, "time": "2016-08-08T12:08:28Z", "creator": "tomasz@rtsoftware.com", "creation_time": "2016-08-08T12:08:28Z", "tags": [], "text": "Created attachment 34111\nGIT patch with adding the cell into the cell cache in case of a cache miss.\n\nSeen on POI 3.15 beta2.\n\nIn my use case I have a middle sized sheet populated with precalculated constant values, then for some of the columns subtotal are being dynamically added using SUMIF row by row. The index parameter (2nd parameter) to SUMIF is also being set dynamically, like\n\n...\n         B     F                       I\nRow 150  2.5   SUMIF(..., B150, ...)   SUMIF(..., B150, ...)\nRow 151  3.5   SUMIF(..., B151, ...)   SUMIF(..., B151, ...)\netc.\n\nUp to v3.14 it has worked (there was no cache!). The reason is that in v3.15 XSSFEvaluationSheet maintains a cell cache that is populated only at the first access, so evaluation of the formulae of the first dynamically created row (row 150) succeeds, yet starting with the next row (row 151) the cache misses the new values and all formulae return 0.\n\nI am aware of the workarounds: \n\n1. create all of the B column before evaluating the first formula\n2. use the new clearAllCachedResultValues method available in 3.15 beta 3.\n\nRe 1. - it seems to be not very use friendly for the evaluation to depend on the setting all constant values before evaluating the very first formula\n\nRe 2. - clearing the cache on each cell change seems to be an overkill - not only the cell cache would be recreated but also all other caches, thus causing a performance penalty. \n\nBoth to be successfully deployed require the knowledge of caching mechanism inside POI.\n\nThis is why I suggest a patch - if cache misses a cell add it if present. This way the performance gain of the cell cache would remain in place, the costly recreating of all the caches could be avoided.\n\nBut since I am new to POI and the solution seems trivial I might have missed something important so please bear with me."}, {"count": 1, "tags": [], "creator": "onealj@apache.org", "attachment_id": null, "text": "Thanks for the patch! Committed in r1760213. This will likely be included in POI 3.15 final.\n\nCould you write a test case that demonstrates the problem from comment 0? If we include a test in our test suite, it will reduce the chance of regressions.\n\nFor an example of similar unit tests, see TestXSSFBugs, TestXSSFFormulaParser, and TestFormulaParser.", "id": 193626, "time": "2016-09-11T02:04:29Z", "bug_id": 59958, "creation_time": "2016-09-11T02:04:29Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 59958, "attachment_id": null, "id": 194163, "time": "2016-10-05T20:14:52Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-10-05T20:14:52Z", "is_private": false, "text": "Added a simple unit test via r1763487."}, {"count": 3, "tags": [], "text": "I'm sorry I didn't respond - I didn't get any emails from Apache Bugzilla, don't know why, the preferences look okay :-(", "attachment_id": null, "id": 194169, "creator": "tomasz@rtsoftware.com", "time": "2016-10-06T07:36:26Z", "bug_id": 59958, "creation_time": "2016-10-06T07:36:26Z", "is_private": false}]