[{"count": 0, "tags": [], "creator": "djgraff209@gmail.com", "attachment_id": null, "text": "The change committed to tighten up permissions (https://svn.apache.org/repos/asf/tomcat/trunk@1713174) unfortunately makes it difficult to establish multi-instance configurations on unix systems.\n\n\nbin/ has been changed from 755 to 750\nconf/ has been changed from 755 to 700\nlib/ has been changed from 755 to 750\nlogs/ has been changed from 755 to 750\ntemp/ has been changed from 755 to 750\nwebapps/ has been changed from 755 to 750\nwork/ has been changed from 755 to 750\n\nThe change on 8.5.x is ideal for setting up a secure out-of-the-bag instance. When used to template out an instance using a provisioning tool (e.g. Ansible or Chef), it can make copying default files to the instance impossible without changing permissions.\n\nAlso, when running tomcat as a non-privileged user for the instance, the scripts in bin/ are either inaccessible or not configured to be read (most files are set to 600) or executed (scripts are set to 750).\n\nI would recommend reverting this change and documenting in the RUNNING.txt steps to ensure proper setup & permissions.", "id": 192986, "time": "2016-08-10T18:06:23Z", "bug_id": 59968, "creation_time": "2016-08-10T18:06:23Z", "is_private": false}, {"count": 1, "tags": [], "text": "My preference is for more secure by default and have relaxing permissions be a conscious decision by the user rather than the other way around.\n\nAt the moment, this is the only report we have had of problems with these settings. I'm therefore going to resolve this as WONTFIX for now. If we get more reports of issues as 8.5.x adoption increases then we can always re-open this issue for another look.", "attachment_id": null, "bug_id": 59968, "id": 192992, "time": "2016-08-10T23:02:15Z", "creator": "markt@apache.org", "creation_time": "2016-08-10T23:02:15Z", "is_private": false}, {"count": 2, "tags": [], "creator": "hakamairi@gmail.com", "attachment_id": null, "text": "This might be a problem for docker users (my case):\nSimilarly to tomcat 9 https://github.com/docker-library/tomcat/issues/35\nthe problem I have with 8.5.6 is that with new tightened permission I'm not able to run tomcat as non root user.\nNon root user is not able to create any files in subdirectories of tomcat, even though the chmod is 777 recursively and he owns the directories recursively (initially owned by root). This worked flawlessly with 8.0 (without any 777 or owner hacks).\n\nSource of this issue might be aufs problem mentioned here: https://github.com/docker/docker/issues/783\nNevertheless it's not possible to relax the permissions in this situation.", "id": 194893, "time": "2016-11-09T14:53:11Z", "bug_id": 59968, "creation_time": "2016-11-09T14:53:11Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 59968, "text": "It was AUFS bug for me. So you don't have to mind this report :P", "id": 194904, "time": "2016-11-10T13:23:20Z", "creator": "hakamairi@gmail.com", "creation_time": "2016-11-10T13:23:20Z", "is_private": false, "attachment_id": null}]