[{"count": 0, "tags": [], "text": "http://httpd.apache.org/docs/trunk/en/mod/mod_rewrite.html#rewriterule contains:\nWhen using the rewrite engine in .htaccess files the per-directory prefix (that is, the URI path that leads to the directory containing this .htaccess file) is removed for the RewriteRule pattern matching and added after any relative (not starting with a slash or protocol name) substitution encounters the end of a rule set.\n\nWhile the core message is correct, this implies that a single URI path leads to the directory containing a .htaccess file. As explained in ticket #53152, this is not necessarily the case (previously, this error was direct, but after a reformulation, it is now merely implied).\n\nNote that \"per-directory prefix\" is apparently not a term defined anywhere. If this has no specific meaning, in my opinion it would be clearer to simply call this a \"directory path\". A URI path comprises both a \"directory path\" and a filename. I do not see how this \"per-directory prefix\" is more a prefix than the filename is a suffix. A URI path without that \"prefix\" is not a URI path.", "is_private": false, "id": 193221, "creator": "chealer@gmail.com", "time": "2016-08-19T11:48:04Z", "bug_id": 60024, "creation_time": "2016-08-19T11:48:04Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 60024, "is_private": false, "count": 1, "id": 193223, "time": "2016-08-19T13:00:25Z", "creator": "covener@gmail.com", "creation_time": "2016-08-19T13:00:25Z", "text": "> Note that \"per-directory prefix\" is apparently not a term defined anywhere.\n> If this has no specific meaning, in my opinion it would be clearer to simply\n> call this a \"directory path\". A URI path comprises both a \"directory path\"\n> and a filename. I do not see how this \"per-directory prefix\" is more a\n> prefix than the filename is a suffix. A URI path without that \"prefix\" is\n> not a URI path.\n\nIt has a specific meaning and it's already described in the section you quoted.  Perhaps a new paragraph that expands on the paranthetical, copied to the glossary would help.\n\nI don't think there's an implication that only 1 URL leads to the directory, it's implicitly in the context of the request being processed.  Prefix here refers to the splitting of the URL by mod_rewrite prior to the evaluation of rules that will match against the part of the URL not already \"consumed\" by leading to the htaccess file."}, {"attachment_id": null, "tags": [], "bug_id": 60024, "is_private": false, "count": 2, "id": 193240, "time": "2016-08-20T15:27:31Z", "creator": "chealer@gmail.com", "creation_time": "2016-08-20T15:27:31Z", "text": "Hi Eric,\nSorry, I failed to specify that it is the parenthesis which misleads.\n\n(In reply to Eric Covener from comment #1)\n[...]\n> \n> I don't think there's an implication that only 1 URL leads to the directory,\n> it's implicitly in the context of the request being processed.\n\nI think saying \"the URL path that led\" rather than \"the URL path that leads\" would avoid confusion.\n\n> Prefix here refers to the splitting of the URL by mod_rewrite prior to the evaluation of\n> rules that will match against the part of the URL not already \"consumed\" by\n> leading to the htaccess file.\n\nI understand, but I think this could simply be called a directory path, unless there is a better term. I do not think of that as a prefix. In fact, I can go to the URL \"http://httpd.apache.org/docs/trunk/en/mod/\". Suppose there is a .htaccess in that directory, that would mean \"http://httpd.apache.org/docs/trunk/en/mod/\" would be the \"prefix\" of the URI \"http://httpd.apache.org/docs/trunk/en/mod/\", even though they are identical. I would not call a part of a word which is both mandatory and the only part as a \"prefix\"."}, {"count": 3, "tags": [], "bug_id": 60024, "attachment_id": null, "id": 193241, "time": "2016-08-20T15:45:17Z", "creator": "covener@gmail.com", "creation_time": "2016-08-20T15:45:17Z", "is_private": false, "text": "> I understand, but I think this could simply be called a directory path,\n> unless there is a better term. I do not think of that as a prefix. In fact,\n> I can go to the URL \"http://httpd.apache.org/docs/trunk/en/mod/\". Suppose\n> there is a .htaccess in that directory, that would mean\n> \"http://httpd.apache.org/docs/trunk/en/mod/\" would be the \"prefix\" of the\n> URI \"http://httpd.apache.org/docs/trunk/en/mod/\",\n\nSorry, but that example doesn't match the basic behavior and the string removed isn't a directory path, it's a part of the path component of the URL. A leading path. In other words, a prefix.  \n\nWe can't churn the docs for every request to put a phrase in a reporters own voice."}, {"count": 4, "tags": [], "text": "(In reply to Eric Covener from comment #3)\n> > I understand, but I think this could simply be called a directory path,\n> > unless there is a better term. I do not think of that as a prefix. In fact,\n> > I can go to the URL \"http://httpd.apache.org/docs/trunk/en/mod/\". Suppose\n> > there is a .htaccess in that directory, that would mean\n> > \"http://httpd.apache.org/docs/trunk/en/mod/\" would be the \"prefix\" of the\n> > URI \"http://httpd.apache.org/docs/trunk/en/mod/\",\n> \n> Sorry, but that example doesn't match the basic behavior and the string\n> removed isn't a directory path, it's a part of the path component of the\n> URL. A leading path. In other words, a prefix.  \n\nApologies and thanks. In fact:\nIn Directory and htaccess context, the Pattern will initially be matched against the filesystem path, after removing the prefix that led the server to the current RewriteRule (e.g. \"app1/index.html\" or \"index.html\" depending on where the directives are defined).\n\nWhich means the string removed is in fact a directory-path, and the parenthesis is not just misleading but wrong. I apologize, since this is the result of ticket #53152.\n\nIt remains that most people will not consider \"/usr/local/apache/htdocs/path/to/\" as a prefix in \"/usr/local/apache/htdocs/path/to/\".", "is_private": false, "id": 193242, "creator": "chealer@gmail.com", "time": "2016-08-20T16:14:52Z", "bug_id": 60024, "creation_time": "2016-08-20T16:14:52Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 60024, "attachment_id": null, "id": 193244, "time": "2016-08-20T19:25:36Z", "creator": "covener@gmail.com", "creation_time": "2016-08-20T19:25:36Z", "is_private": false, "text": "> In Directory and htaccess context, the Pattern will initially be matched\n> against the filesystem path, after removing the prefix that led the server\n> to the current RewriteRule (e.g. \"app1/index.html\" or \"index.html\" depending\n> on where the directives are defined).\n> \n> Which means the string removed is in fact a directory-path, and the\n> parenthesis is not just misleading but wrong. I apologize, since this is the\n> result of ticket #53152.\n\nOK, I see the concern now re: directory paths.  However, the paranthetical in its current state is not actually wrong.  Those are basic example of what's left after the prefix stripping.\n\nI've reverted the changes from PR53152 in trunk and made a few rounds of updates to remove some unnecessary/redundant per-dir info and try to clarify in the remaining places.\n\nPlease review current form: http://httpd.apache.org/docs/trunk/mod/mod_rewrite.html"}, {"count": 6, "tags": [], "bug_id": 60024, "attachment_id": null, "id": 193245, "time": "2016-08-21T00:19:09Z", "creator": "chealer@gmail.com", "creation_time": "2016-08-21T00:19:09Z", "is_private": false, "text": "Many thanks Eric, this solves this issue. I still have some remarks:\n\n\"In this context\" follows a paragraph which says \"In Directory and htaccess context\". This could be solved by replacing \"In Directory and htaccess context\" with \"In per-directory context\".\n\nThe Syntax defines \"directory-path\" (with a dash) rather than \"directory path\".\n\nThe phrasing sometimes assumes per-directory rules are defined in an htaccess file, for example in \"The directory path where the rule is defined is stripped before comparison (up to and including a trailing slash).\"\n\"The directory path where the rule is defined\" could be substituted with \"The directory-path of the directory to which the rule is associated\".\n\nThis uses 3 terms (\"currently mapped filesystem\", \"currently mapped path\" and \"currently mapped filesystem path\") to designate what appears to be the same thing. I think the first should be substituted with the last (\"currently mapped filesystem path\")."}, {"count": 7, "tags": [], "bug_id": 60024, "attachment_id": null, "id": 195015, "time": "2016-11-15T21:06:41Z", "creator": "chealer@gmail.com", "creation_time": "2016-11-15T21:06:41Z", "is_private": false, "text": "(In reply to Filipus Klutiero from comment #6)\n\n> \n> This uses 3 terms (\"currently mapped filesystem\", \"currently mapped path\"\n> and \"currently mapped filesystem path\") to designate what appears to be the\n> same thing. I think the first should be substituted with the last\n> (\"currently mapped filesystem path\").\n\nEric fixed this in r1757289.\n\nI reported one of the persisting issues in r60377."}]