[{"count": 0, "tags": [], "creator": "damian.frach@sun.com", "attachment_id": null, "id": 9842, "time": "2002-01-24T14:43:34Z", "bug_id": 6007, "creation_time": "2002-01-24T14:43:34Z", "is_private": false, "text": "win 2000; jdk 131; tomcat 402-b2; IE 50 (page cache is switched off)\n\n- you have two folders (c:\\temp1 and c:\\temp2)\n- there are two JSPs with same name but with different content (c:\\temp1\\a.jsp \nand c:\\temp2\\a.jsp)\n- add in the server.xml (\"<Context path=\"\" docBase=\"C:\\temp1\">\")\n- start the server\n- open the JSP in the browser (http://localhost:8080/a.jsp)\n- a page content is OK\n- stop the server\n- change the server.xml (\"<Context path=\"\" docBase=\"C:\\temp2\">\")\n- start the server\n- open the JSP in the browser (http://localhost:8080/a.jsp)\n- there is old page content; the generated servlet from the JSP is not updated"}, {"count": 1, "tags": [], "text": "There are two solutions to this:\na) Compute a CRC of the JSP on each access, and compare to a reference kept\nelsewhere (that's very slow and complex).\nb) Erase all generated classes and servlets when shutting down. This is very bad\nalso, since it voids the benefits of precompilation, and would create permanent\nmemory leaks (as javac leaks memory each time a class is compiled) and bad\nperformance.\nNeither of the solutions mentioned above are acceptable, so this (not\nlegitimate, IMO) use case won't be supported (and you'll have to delete the work\ndirectory by hand).", "attachment_id": null, "id": 9848, "creation_time": "2002-01-24T15:22:28Z", "time": "2002-01-24T15:22:28Z", "creator": "remm@apache.org", "bug_id": 6007, "is_private": false}, {"count": 2, "tags": [], "creator": "damian.frach@sun.com", "attachment_id": null, "id": 9854, "time": "2002-01-24T15:46:35Z", "bug_id": 6007, "creation_time": "2002-01-24T15:46:35Z", "is_private": false, "text": "We are working on the Tomcat integration into the Netbeans/Forte IDE.\nSolution : \"delete the work directory by hand\" is not acceptable for us and \nispecially for Netbeans/Forte users.\n\nWhy you can not use for different context folders different cache folders.\nI think, it was used by the tomcat 3.2 and it worked fine.\n"}, {"count": 3, "tags": [], "text": "I am not sure, if \"priority\" should be minor.\n\nIf a Forte/Netbeans user has two web modules and s/he has JSPs with same names \n(What is very common (index.jsp, welcome.jsp, ...).), than this is a major \nproblem for him. ", "attachment_id": null, "id": 9869, "creation_time": "2002-01-24T17:50:25Z", "time": "2002-01-24T17:50:25Z", "creator": "damian.frach@sun.com", "bug_id": 6007, "is_private": false}, {"count": 4, "attachment_id": null, "bug_id": 6007, "is_private": false, "id": 9870, "time": "2002-01-24T17:59:01Z", "creator": "damian.frach@sun.com", "creation_time": "2002-01-24T17:59:01Z", "tags": [], "text": "I think problem is: you understand the JSP as a.jsp, but you should understand \nthe JSP as c:\\temp1\\a.jsp. Than you will see, the c:\\temp2\\a.jsp is different \nthan c:\\temp1\\a.jsp.\n\n"}, {"count": 5, "attachment_id": null, "bug_id": 6007, "is_private": false, "id": 9872, "time": "2002-01-24T18:39:22Z", "creator": "remm@apache.org", "creation_time": "2002-01-24T18:39:22Z", "tags": [], "text": "Why wouldn't he mount what are two different webapps under two different\ncontexts ? Usually, that's what people do ;-)"}, {"count": 6, "tags": [], "creator": "ana.von.klopp@sun.com", "attachment_id": null, "id": 9894, "time": "2002-01-24T23:22:11Z", "bug_id": 6007, "creation_time": "2002-01-24T23:22:11Z", "is_private": false, "text": "Remy, I think your assessment is correct, but it's about situations where the\nTomcat server is used as a deployment environment. Damian is describing \na situation where a developer is using the Tomcat server as a test running tool.\nThose users will treat the server differently. \n\nIt's pretty normal to switch from executing one module to executing another in\nthat scenario (with both modules declared to be the root context). We allow\nusers to deploy multiple modules at a time, but it's usually going to be quicker\nto run first one and then the other. \n\nI understand and agree with your concerns about making the server slower.\nIdeally, we'd like it if the server used a different cache, but that sounds like\nit would be considerable extra work for the tomcat development team. Would it be\npossible to add a flag to the server which permits the behaviour that you \ndescribed in (b) above when the server is used during development, as opposed to\nwhen it is running? \n\nb) Erase all generated classes and servlets when shutting down. \n\nYou're correct about the consequences: \n\n\"This is very bad also, since it voids the benefits of precompilation,\nand would create permanent memory leaks (as javac leaks memory each\ntime a class is compiled) and bad performance.\"\n\nbut in the development scenario, those JSPs need to be recompiled\nanyway! We don't want to force the behaviour on the server at all\ntimes, we simply want it as a possibility when the server is used for\ndevelopment purposes. \n\nWould be grateful if you could assess whether you'd reconsider if this issue\ncould be resolved. It would make a big difference to my team. \n"}, {"count": 7, "tags": [], "text": "other solution is: \n\nyou re-generate a servlet from a jsp, when a jsp is newer than a servlet\n\npossible better solution is, the generated servlet will remember a date of the \nmain JSP or dates of main JSP and included JSPs (but first possibility is \nenough). Than you will see, the main JSP is different", "is_private": false, "bug_id": 6007, "id": 9909, "time": "2002-01-25T08:49:20Z", "creator": "damian.frach@sun.com", "creation_time": "2002-01-25T08:49:20Z", "attachment_id": null}, {"count": 8, "attachment_id": null, "bug_id": 6007, "is_private": false, "id": 9912, "time": "2002-01-25T11:04:21Z", "creator": "remm@apache.org", "creation_time": "2002-01-25T11:04:21Z", "tags": [], "text": "The date is used to decide to recompile, but that won't always work if you\nreplace  the webapp (unless the JSP in the other webapp is newer).\nDoing b) is not acceptable for nearly all of Tomcat users, so it's not even an\noption.\nOne solution is that you can write a container listener (for a Host) which would\ndo the JSP cleanup when getting a 'removeChild' event."}, {"count": 9, "tags": [], "text": "Isn't it better to fire up the jsp's in a context based on the directory mount \nin netbeans, instead of always using the ROOT context for it ?\nI must add that I never use jps's though..", "attachment_id": null, "id": 9914, "creator": "mvdb@mvdb.com", "time": "2002-01-25T14:32:55Z", "bug_id": 6007, "creation_time": "2002-01-25T14:32:55Z", "is_private": false}, {"count": 10, "tags": [], "text": "I do not know, but I think it is normal to use 1 web module with empty context.\nI think, it is common ispecially for IDE users, which are beginners. For \nexample basic simple web app with only index.jsp is ussualy used with empty \ncontext (localhost:8080/index.jsp).", "attachment_id": null, "id": 9918, "creator": "damian.frach@sun.com", "time": "2002-01-25T15:37:49Z", "bug_id": 6007, "creation_time": "2002-01-25T15:37:49Z", "is_private": false}, {"count": 11, "tags": [], "creator": "gus.heck@olin.edu", "attachment_id": null, "text": "I just read this bug, and it seems that there is a simple solution. The notion\nof doing checksums is calculationally intensive, and therefore unacceptable, but\nyou don't need a check sum. All you need is the date on the JSP file. Store it\nin a file called foo.class.jspdate and compare that date to the one on the JSP..\nif it differs + or - recompile. One might even be able to add this information\ndirectly into the generated .java (and thus .class) file as a constant int where\nit can be checked without another file access.\n\nIf the extra file access solution needs to be turned off for production make\nthis check only happen if tomcat is started with soemthing like a -devel flag or\nsomesuch.", "id": 29797, "time": "2003-01-21T15:59:35Z", "bug_id": 6007, "creation_time": "2003-01-21T15:59:35Z", "is_private": false}]