[{"count": 0, "tags": [], "bug_id": 60072, "text": "Created attachment 34187\nProposed patch\n\nHi all, \nit seems that adding rows on a sheet (using Sheet.shiftRows) does not trigger any update in charts anchors.\nOur proposal is to shift any chart anchor referring a cell above the start row of the shifted area.\nI've attached a patch that includes a new method in XSSFSheet, called from within the shiftRows method.", "id": 193428, "time": "2016-08-31T12:12:38Z", "creator": "lapocioni@tagetik.com", "creation_time": "2016-08-31T12:12:38Z", "is_private": false, "attachment_id": 34187}, {"count": 1, "attachment_id": null, "creator": "onealj@apache.org", "text": "Thanks for the patch! I'll review it and apply it once 3.15 is released and the trunk is unfrozen.\n\nDoes your patch also update chart data series address ranges? See bug 59306. It would be nice to have these two fixed at the same time.", "id": 193438, "time": "2016-08-31T15:41:03Z", "bug_id": 60072, "creation_time": "2016-08-31T15:41:03Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "creator": "lapocioni@tagetik.com", "is_private": false, "id": 193451, "time": "2016-09-01T16:50:45Z", "bug_id": 60072, "creation_time": "2016-09-01T16:50:45Z", "tags": [], "text": "(In reply to Javen O'Neal from comment #1)\n> Thanks for the patch! I'll review it and apply it once 3.15 is released and\n> the trunk is unfrozen.\n> \n> Does your patch also update chart data series address ranges? See bug 59306.\n> It would be nice to have these two fixed at the same time.\n\nUnfortunately no.\nI've only made some failed attempts to solve the issue related to bug 59306."}, {"attachment_id": null, "tags": [], "creator": "onealj@apache.org", "text": "Could you move the drawing (chart, picture, object, etc) shifting into the XSSFRowShifter or RowShifter class?\n\nWould you be willing to write a unit test for this class to prevent regressions on this feature in future releases? There is a class called TestXSSFSheetShiftRows or BaseTestSheetShiftRows that would be a good place for this test. This also proves to others that the behavior works as described.\n\nThanks!", "count": 3, "id": 193585, "time": "2016-09-10T05:17:32Z", "bug_id": 60072, "creation_time": "2016-09-10T05:17:32Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 60072, "is_private": false, "id": 193586, "creation_time": "2016-09-10T05:22:13Z", "time": "2016-09-10T05:22:13Z", "creator": "onealj@apache.org", "text": "You can use test-data/spreadsheet/WithChart.xlsx and WithDrawing.xlsx for unit tests or make your own test spreadsheet (or even better, write a unit test starting with a new XSSFWorkbook(), add the chart and/or drawing to the workbook, shift the rows, and verify that the chart and drawing were shifted the correct number of rows.\n\nhttps://svn.apache.org/viewvc/poi/trunk/test-data/spreadsheet/", "attachment_id": null}]