[{"count": 0, "tags": [], "creator": "mikeault@us.ibm.com", "attachment_id": null, "id": 193678, "time": "2016-09-13T14:00:22Z", "bug_id": 60127, "creation_time": "2016-09-13T14:00:22Z", "is_private": false, "text": "This is more of an inquiry than an ant bug report.\n\nMy team has begun working with Oracle's Java 9 JDK.  There does not yet appear to be any Java 9 awareness within ant, as evidenced by its inability to recognize javac arguments associated with the Java 9 module system (for example, -addmods, -limitmods, \n-modulepath, etc.). \n\nWe have unsuccessfully been trying to pass module arguments such as those listed to javac using ant's <compilerarg> attribute.  For example:\n<compilerarg value=\"-addmods my.module.name\"/>\nWhen we attempt this, an \"invalid flag\" error is reported.\n\nWhen will ant support for Java 9 become available ?\n\nAre there any early ant builds available which contain limited Java 9 support ?\n\nWe have been using ant version 1.9.7.\n\nAny info that you can supply will be greatly appreciated."}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "text": "Ant's master and 1.9.x branches contain important changes for Java9. Depending in what you want to do, Ant 1.9.7 will not work at all (javah and native2ascii are exaompes, rmic may be broken as well).\n\nSome of the options for javac have been implemented, but not all of then, In either case, you can use <compilerarg> even with 1.9.7. You just need to split them propertly, i,e.\n\n<compilerarg value=\"-addmods\"/>\n<compilerarg value=\"my.module.name\"/>\n\nor <compilerag line=\"-addmods my.module.name\"/>\n\nThere is at least one known issue that is expected to get resolved with the next build of Java9 (bug 60060).\n\nOn my personal list of things to add is support for multi-release jars before I propose a new release. I can't promise a time-line and don't know whether the rest of the team has different plans, but I'd expect a new release sometime before November.\n\nWe don't provide nightly builds but you can build Ant from source. Given that you can't boostrap the 1.9.x branch using Java9 you may prefer the master branch (1.9.x wants to compile using -target 1.5 which isn't supported in Java9). It would be good if you could check it out and provide us with feedback about missing features. -addmaods (or is it --add-mods by now?) is still not explicitly supported, for example.", "id": 193688, "time": "2016-09-14T04:19:56Z", "bug_id": 60127, "creation_time": "2016-09-14T04:19:56Z", "is_private": false}, {"count": 2, "tags": [], "creator": "bodewig@apache.org", "text": "1.9.8 and 1.10.0 make important improvements. If you feel anything is missing, please create more specific issues. Thanks.", "id": 195757, "time": "2016-12-31T11:08:15Z", "bug_id": 60127, "creation_time": "2016-12-31T11:08:15Z", "is_private": false, "attachment_id": null}]