[{"count": 0, "tags": [], "text": "Created attachment 34262\nPatch that potentially fixes the issue in TC8.5.x and trunk.\n\nThe problem is with org.apache.catalina.webresources.CachedResource.java\n\nWhile getContent() is correctly creating a byte cache if the object is small enough, getInputStream() is not. This means that if the caller never calls getContent() before calling getInputStream() no cache is created, and the data is fetched from the file every time.\n\nThis turned out to be a big issue in my performance comparison test against Tomcat 6 which was indirectly trying to load a Spring properties file that wasn't getting cached because of this bug. \n\nI could see Tomcat 8 consistently take 3x the memory and almost 1.5x times the CPU just because the JVM's young-generation space was overwhelmed with dealing with the temporary java.util.zip.inflater objects that got created while Spring (which apparently relies only on getInputStream) was trying to read the properties file.\n\nIt seems that the simplest way to fix this issue is to make getInputStream() call getContent() first to establish the cache, rather than assume that getContent() would have been already called. Considering how getContent() is written, I don't think this will lead to any extra overhead.\n\nI did test this one line change and I could see that the memory and CPU utilization in Tomcat 8 dropped back to similar levels to Tomcat 6.\n\nI have only tested against Tomcat 8.5.5 but looking at the code it seems that the issue is also present in trunk.\n\nI am attaching a patch which fixed the issue in my testing. I'm not sure if there's a better fix or if the patch is in the correct format, but I hope the patch at least illustrates the underlying issue.\n\nThanks.", "is_private": false, "id": 193786, "creator": "mohitchugh@yahoo.com", "time": "2016-09-18T17:11:15Z", "bug_id": 60146, "creation_time": "2016-09-18T17:11:15Z", "attachment_id": 34262}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "Thanks for the report and the patch.\n\nThis has been fixed in the following branches:\n- 9.0.x for 9.0.0.M11 onwards\n- 8.5.x for 8.5.6 onwards\n- 8.0.x for 8.0.38 onwards", "id": 193833, "time": "2016-09-20T10:47:55Z", "bug_id": 60146, "creation_time": "2016-09-20T10:47:55Z", "is_private": false, "attachment_id": null}]