[{"count": 0, "attachment_id": 34287, "creator": "santhanapreethi28@gmail.com", "is_private": false, "id": 193886, "time": "2016-09-21T13:04:51Z", "bug_id": 60161, "creation_time": "2016-09-21T13:04:51Z", "tags": [], "text": "Created attachment 34287\nPatch for providing detailed logging in RewriteValve\n\nThe logging provided for RewriteValve is minimal. httpd provides detailed logging support with configurable log levels. Also It would be useful while debugging, if the time taken for rewrite is logged. I've added a patch replicating apache mod_rewrite behaviour."}, {"count": 1, "tags": [], "text": "This patch is not very good. Changing the log level from debug to info is not acceptable (debug is more than appropriate given what this is, and there's also going to be a large performance impact ...), and that's what most of the patch is doing in addition to logging statistics that don't look very useful (given the precision of currentTimeMillis).", "attachment_id": null, "id": 193887, "creation_time": "2016-09-21T13:25:10Z", "time": "2016-09-21T13:25:10Z", "creator": "remm@apache.org", "bug_id": 60161, "is_private": false}, {"count": 2, "tags": [], "bug_id": 60161, "is_private": false, "text": "The switch from the container's logger to a dedicated Rewrite logger is problematic too.\n\nThere might be a case for recording the time taken to rewrite the URL but a) it should only be collected and logged when debug logging is enabled and b) should use nanoTime.\n\nAs a general rule, please keep the coding style of any patches consistent with the code being patched.", "id": 193890, "time": "2016-09-21T13:42:55Z", "creator": "markt@apache.org", "creation_time": "2016-09-21T13:42:55Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 60161, "text": "(In reply to Mark Thomas from comment #2)\n> The switch from the container's logger to a dedicated Rewrite logger is\n> problematic too.\n\nNow so? I would think this might be the one good part of this proposed patch, because it makes it easier to adjust the log level of *only* the RewriteValve. Honestly, that should have been the only thing necessary, here. Everything else would have been configuration of the log as per usual.", "id": 193893, "time": "2016-09-21T14:28:47Z", "creator": "chris@christopherschultz.net", "creation_time": "2016-09-21T14:28:47Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "If there are more than one rewrite valves used, it doesn't sound like a good idea.", "id": 193894, "time": "2016-09-21T16:16:33Z", "bug_id": 60161, "creation_time": "2016-09-21T16:16:33Z", "is_private": false}, {"count": 5, "attachment_id": null, "creator": "chris@christopherschultz.net", "text": "That's a good point, Rémy, but it's no worse than the current situation where the rewrite logs all go to the container's logger.\n\nI think there's still some useful work that can be done, here.", "id": 193896, "time": "2016-09-21T17:00:19Z", "bug_id": 60161, "creation_time": "2016-09-21T17:00:19Z", "tags": [], "is_private": false}, {"count": 6, "tags": [], "creator": "santhanapreethi28@gmail.com", "attachment_id": null, "text": "(In reply to Mark Thomas from comment #2)\n\n> The switch from the container's logger to a dedicated Rewrite logger is\n> problematic too.\n\nI don't think writing all rewrite logs to container's logger is a good idea. In the current situation, adjusting container's logger level to DEBUG is required to write rewrite logs. \n\n(In reply to Christopher Schultz from comment #3)\n\n> Now so? I would think this might be the one good part of this proposed\n> patch, because it makes it easier to adjust the log level of *only* the\n> RewriteValve. \n\nAs Christopher pointed out, this would make it easier to configure log level for RewriteValve. \n\n(In reply to Mark Thomas from comment #2)\n\n> There might be a case for recording the time taken to rewrite the URL but a)\n> it should only be collected and logged when debug logging is enabled and b)\n> should use nanoTime.\n\nI've reworked the patch with log levels DEBUG,TRACE and nanoTime. I've replicated httpd mod_rewrite logging behaviour where level 2 logs only the rewrite information and level 3 also logs all the rules that were applied before the rewrite happened.", "id": 193910, "time": "2016-09-22T07:21:57Z", "bug_id": 60161, "creation_time": "2016-09-22T07:21:57Z", "is_private": false}, {"count": 7, "tags": [], "creator": "santhanapreethi28@gmail.com", "attachment_id": 34290, "text": "Created attachment 34290\nModified patch for Rewrite Logging", "id": 193911, "time": "2016-09-22T07:23:38Z", "bug_id": 60161, "creation_time": "2016-09-22T07:23:38Z", "is_private": false}, {"count": 8, "tags": [], "bug_id": 60161, "text": "(In reply to Santhana Preethi from comment #6)\n> > Now so? I would think this might be the one good part of this proposed\n> > patch, because it makes it easier to adjust the log level of *only* the\n> > RewriteValve. \n> \n> As Christopher pointed out, this would make it easier to configure log level\n> for RewriteValve. \n\nThat's his opinion and I happen to disagree with it. You can configure the log level of the container.\nI also don't see what the processing time is used for in a sub component, this screams like a feature from 15 years ago [use a debugger instead].", "id": 193912, "time": "2016-09-22T07:29:12Z", "creator": "remm@apache.org", "creation_time": "2016-09-22T07:29:12Z", "is_private": false, "attachment_id": null}, {"count": 9, "tags": [], "creator": "remm@apache.org", "attachment_id": 34293, "is_private": false, "id": 193934, "time": "2016-09-22T16:39:21Z", "bug_id": 60161, "creation_time": "2016-09-22T16:39:21Z", "text": "Created attachment 34293\nValve logging change\n\nSince the issue is about configuring the valve logging, I have a possible patch for that. It allows creating subcategories for the container logger, and exploits the ValveBase.containerLog field to use that other logger.\nNot sure if it's really a good idea though."}, {"count": 10, "tags": [], "text": "(In reply to Remy Maucherat from comment #9)\n> \n> Since the issue is about configuring the valve logging, I have a possible\n> patch for that. It allows creating subcategories for the container logger,\n> and exploits the ValveBase.containerLog field to use that other logger.\n\nThe proposed patch does allow adjusting the log level of ONLY the RewriteValve. It is definitely better than the current situation. \n\n(In reply to Remy Maucherat from comment #8)\n>\n> I also don't see what the processing time is used for in a sub component,\n> this screams like a feature from 15 years ago [use a debugger instead].\n\nOften, Url Rewriting involves complex regex matching. Logging the processing time for the rewrite will be useful for debugging any slow requests. Also, httpd already logs the rules applied for every URI at a higher log level (3 and above).", "attachment_id": null, "id": 193951, "creation_time": "2016-09-23T10:24:31Z", "time": "2016-09-23T10:24:31Z", "creator": "santhanapreethi28@gmail.com", "bug_id": 60161, "is_private": false}, {"count": 11, "tags": [], "bug_id": 60161, "text": "Any update regarding writing RewriteValve logs based on Remy Maucherat's patch?", "id": 194036, "time": "2016-09-27T13:17:42Z", "creator": "santhanapreethi28@gmail.com", "creation_time": "2016-09-27T13:17:42Z", "is_private": false, "attachment_id": null}, {"count": 12, "tags": [], "text": "Although I didn't get feedback, I decided to include the change (with some fixes). So this is now \"fixed\".", "is_private": false, "bug_id": 60161, "id": 194428, "time": "2016-10-14T14:10:43Z", "creator": "remm@apache.org", "creation_time": "2016-10-14T14:10:43Z", "attachment_id": null}]