[{"count": 0, "tags": [], "creator": "markus.tolksdorf@sap.com", "text": "Hi, \n\nthere is a trace entry that is logging the password in clear text. This should not be done. If the user is DonaldDuck and the password is ILoveDa1sy the entry looks like this with our custom formatter:\n2016-06-01 14:57:28,329#DEBUG#org.apache.tomcat.util.http.Parameters#http-bio-443-exec-11#          #Start processing with input [j_username=DonaldDuck&j_password=ILoveDa1sy]|\n\nCould you please fix this? Thanks!\n\nBest regards,\nMarkus", "id": 194011, "time": "2016-09-27T07:18:12Z", "bug_id": 60178, "creation_time": "2016-09-27T07:18:12Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "This is simply logging request parameters, and is not the default logging configuration. I do not understand why this logging would be enabled on a production server.", "attachment_id": null, "bug_id": 60178, "id": 194012, "time": "2016-09-27T07:25:13Z", "creator": "remm@apache.org", "creation_time": "2016-09-27T07:25:13Z", "is_private": false}, {"count": 2, "tags": [], "creator": "markus.tolksdorf@sap.com", "attachment_id": null, "id": 194013, "time": "2016-09-27T07:28:08Z", "bug_id": 60178, "creation_time": "2016-09-27T07:28:08Z", "is_private": false, "text": "Hi, \n\nyes, it's not the default logging settings. But sometimes you need to check why a logon is not working and increase the levels for tomcat loggers. Then I still don't want to see a password logged in clear text. Someone who should not see it could see it.\n\nBest regards,\nMarkus"}, {"attachment_id": null, "tags": [], "bug_id": 60178, "is_private": false, "count": 3, "id": 194014, "time": "2016-09-27T07:39:10Z", "creator": "mgrigorov@apache.org", "creation_time": "2016-09-27T07:39:10Z", "text": "The problem here is how to recognize that a request parameter contains sensitive information.\n'j_password' is name defined in specs, so it is easy to handle.\nBut an application is free to use any names for its form elements and it is impossible for the web server to decide whether something contains sensitive data or not.\nSo hiding the value of `j_password` is a very special case that would solve just some of the cases.\n\nOn the other side someone may want to see the plain value of such parameter to be able to debug an issue related to the authentication."}, {"count": 4, "tags": [], "creator": "remm@apache.org", "text": "Excuse me, but why is it that every single user out there feels entitled to reopening reports all the time ? Do you not realize this is rude ? I gave an explanation, discussion can still occur but as it is this is the current resolution.\n\nThere is generic debug logging like this in a lot of places in Tomcat (parameters, obviously, cookies, request line, etc). All of them can contain sensitive data and are strictly for debug purposes.", "id": 194015, "time": "2016-09-27T07:51:00Z", "bug_id": 60178, "creation_time": "2016-09-27T07:51:00Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "text": "Hi, \n\n@Remy: didn't know that it is considered rude to re-open a bug, if I'm not satisfied with the solution. But if it is like that I continue to discuss without re-opening. Please excuse my wrong behavior.\nI'm not saying that you need to recognize arbitrary parameters that might contain sensitive data. But IMHO the ones that are well-known to tomcat should be masked. Yes, it's only when turning on trace at a higher level, but this is still a bad thing. Assume that not only the affected person is reading the logs - this means that a second one would immediately see that password, even without bad intentions this is not a good thing. Please consider revising your decision\n\nBest regards,\nMarkus", "attachment_id": null, "id": 194016, "creation_time": "2016-09-27T08:12:05Z", "time": "2016-09-27T08:12:05Z", "creator": "markus.tolksdorf@sap.com", "bug_id": 60178, "is_private": false}, {"count": 6, "tags": [], "creator": "remm@apache.org", "text": "For starters, the log you pointed out in your report is simply a full dump of the unparsed parameters as bytes. As a result, it cannot be filtered without parsing it first, so the only option if there's a decision to fix it is to remove that log.", "id": 194018, "attachment_id": null, "bug_id": 60178, "creation_time": "2016-09-27T08:42:23Z", "time": "2016-09-27T08:42:23Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 60178, "text": "Would it be so bad to parse the parameters for known sensitive ones? In such cases you could filter those out. Question is - is it easily recognizable that it's a logon request? If so, you might call a specialized routine, which is parsing the parameters and masks them if necessary\n\nBest regards,\nMarkus", "id": 194019, "time": "2016-09-27T08:47:39Z", "creator": "markus.tolksdorf@sap.com", "creation_time": "2016-09-27T08:47:39Z", "is_private": false, "attachment_id": null}, {"count": 8, "tags": [], "bug_id": 60178, "attachment_id": null, "id": 194027, "time": "2016-09-27T10:06:24Z", "creator": "markt@apache.org", "creation_time": "2016-09-27T10:06:24Z", "is_private": false, "text": "Debug logs may contain security sensitive data and should be used and protected accordingly.\n\nI am -1 on any form of filtering of debug logs. The whole point of debug logging is to show you exactly what is going on. If Tomcat starts filtering debug logs it could well filter out the critical information required to solve an issue.\n\nIf Tomcat was logging security sensitive information by default then there would be a stronger case for making a change. I'll note that in such a case, the change would likely be to log that information at debug level."}]