[{"count": 0, "tags": [], "creator": "jepp@cas.org", "attachment_id": null, "is_private": false, "id": 194093, "time": "2016-09-29T18:12:31Z", "bug_id": 60190, "creation_time": "2016-09-29T18:12:31Z", "text": "For POST requests that don't set a Content-Type, JMeter will \"helpfully\" add \"Content-Type: application/x-www-form-urlencoded\".  It does this silently and unconditionally.\n\nThis causes all of our load scenarios to fail with 415 errors, and was a major pain to track down.\n\nDistressingly, we discovered this even happens at recording time: we get the 415 response when the request is passed through the ProxyControl even though the browser doesn't send a Content-Type to be captured. (e.g. No Content-Type is recorded in the HTTPSamplerProxy's HeaderManager when this happens, either.)\n\nI'm not sure what the correct fix for this-- it looks like this behaviour has been around since at least 2007, and longer for the HttpClient. (cf. Bug #40383)"}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "text": "Hello,\nCould you provide a test plan showing the issue and how you would like it to be fixed ?\n\nWhat you sent\nWhat response you got\nWhat request was expected ?\nWhat test case is it ? \nWhat would you expect content-type to be ? \n\nThank you", "id": 194094, "time": "2016-09-29T18:24:06Z", "bug_id": 60190, "creation_time": "2016-09-29T18:24:06Z", "is_private": false}, {"count": 2, "attachment_id": 34315, "bug_id": 60190, "is_private": false, "id": 194095, "time": "2016-09-29T19:31:16Z", "creator": "jepp@cas.org", "creation_time": "2016-09-29T19:31:16Z", "tags": [], "text": "Created attachment 34315\nHTTP sample silently sent with extra header\n\n(In reply to Philippe Mouawad from comment #1)\n> Hello,\n> Could you provide a test plan showing the issue and how you would like it to\n> be fixed ?\n\nI've attached the JMX of the specific request that has the issue so you can see exactly what the structure is but, unfortunately, I don't think I can provide a whole working test plan because this is not a publicly accessible product.\n\nTo be clear:\n- This sampler should NOT be sending a Content-Type.\n- The browser request that this sampler was recorded from did NOT send a Content-Type.\n- The server does NOT need one.\n- JMeter is ADDING one even though we have not specified it in the Header Manager.\n\nAgain, I'm don't know for sure what would be a \"good\" fix for this.\n\nI can definitely say that I DISLIKE that JMeter SILENTLY changes the request.  That's definitely bad.  If nothing else, that should log some kind of warning.\n\nBut is removing the behaviour that adds a Content-Type the correct answer?  Probably not; there have been bugs in the past that were fixed by adding it.\n\nOne possibility that may have some merit is a \"HTTPSamplerVerbatim\" type or an added flag in the HTTPSamplerProxy that signals the implementation that the request is expected to be passed to the host PRECISELY as it was recorded.  No additions or cleverness.  Everything that goes through ProxyControl instance should then have that type/flag\n\nAnother possible mitigation might be to set the Content-Type to whatever comes first in the Accept header instead of always using \"application/x-www-form-urlencoded\".  I still don't like it (and it should definitely still log a warning), but it would at least not cause things to break unexpectedly. \n\nRight now, I'm going to try working around this by adding another pass to our post-processing tools to catch any instance that a 415 was recorded and forcibly set it a Content-Type, but this is really not something that should need to happen."}, {"count": 3, "tags": [], "creator": "felix.schumacher@internetallee.de", "attachment_id": 34688, "is_private": false, "id": 196523, "time": "2017-01-28T11:54:17Z", "bug_id": 60190, "creation_time": "2017-01-28T11:54:17Z", "text": "Created attachment 34688\nHTTP sample silently sent with extra header\n\nAdded a http mirror and a thread group so that this test can be run locally."}, {"count": 4, "tags": [], "text": "Hello,\nHow about not adding this anymore if not set and having a property that allows to do that ?\npost_add_content_type_if_missing=false\n\nWhat is the risk ?\n\nAs per:\nhttps://www.w3.org/Protocols/rfc2616/rfc2616-sec7.html\n\nAny HTTP/1.1 message containing an entity-body SHOULD include a Content-Type header field defining the media type of that body. If and only if the media type is not given by a Content-Type field, the recipient MAY attempt to guess the media type via inspection of its content and/or the name extension(s) of the URI used to identify the resource. If the media type remains unknown, the recipient SHOULD treat it as type \"application/octet-stream\". \n\n\nThanks", "is_private": false, "id": 200626, "creator": "p.mouawad@ubik-ingenierie.com", "time": "2017-09-03T16:46:46Z", "bug_id": 60190, "creation_time": "2017-09-03T16:46:46Z", "attachment_id": null}]