[{"count": 0, "tags": [], "text": "When the validateRequest method of a JASPIC SAM is called in Tomcat 9, the \"javax.security.auth.message.MessagePolicy.isMandatory\" key in the MessageInfo map is erroneously always set to true.\n\nThis happens in org.apache.catalina.authenticator.AuthenticatorBase.getJaspicState via the following code:\n\n    new MessageInfoImpl(request.getRequest(), response.getResponse(), true);\n\nThe \"true\" param becomes the \"authMandatory\" value in the MessageInfo map:\n\n    map.put(IS_MANDATORY, Boolean.toString(authMandatory));\n\nHowever, according to section 3.8.1.1 of the JASPIC 1.1 spec this should only be true if the target resource is protected. To be more exact when:\n\n\"... the resource identified by the HttpServletRequest is covered by a Servlet auth- constraint, or in a JSR 115 compatible runtime, if the corresponding WebResourcePermission is NOT granted to an unauthenticated caller.\"\n\nSo while the SAM should always be called (whether authentication is required or not), \"javax.security.auth.message.MessagePolicy.isMandatory\" should only be set to true when authentication is actually required (which incidentally, is also the case when HttpServletRequest#authenticate is called).", "attachment_id": null, "bug_id": 60196, "id": 194117, "time": "2016-10-02T19:10:45Z", "creator": "arjan.tijms@gmail.com", "creation_time": "2016-10-02T19:10:45Z", "is_private": false}, {"count": 1, "tags": [], "text": "This has been fixed in the following branches:\n- 9.0.x for 9.0.0.M11 onwards\n- 8.5.x for 8.5.6 onwards", "attachment_id": null, "id": 194152, "creator": "markt@apache.org", "time": "2016-10-05T13:57:40Z", "bug_id": 60196, "creation_time": "2016-10-05T13:57:40Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 60196, "is_private": false, "text": "Thanks a lot for the quick fix!\n\nps. \n\nI added a CI target for Tomcat to the Java EE samples project (https://github.com/javaee-samples/javaee7-samples.git)\n\nAfter a git clone the JASPIC tests can be started using:\n\nmvn clean install -pl \"test-utils,util\" -am\ncd jaspic\nmvn clean test -P tomcat-ci-managed\n\nTomcat versions from the Apache public and staging repositories can be tested. It currently defaults to version 8.5.6, but another version can be used via the -Dtomcat.version option. E.g.\n\nmvn clean test -P tomcat-co-managed -Dtomcat.version=8.5.5\n\nNote that for Tomcat the integration tests with EJB, JSF, JACC, etc are automatically skipped.\n\nThe staged Tomcat 8.5.6 has a perfect test result btw, all tests pass. Very impressive!", "id": 194316, "time": "2016-10-10T17:53:29Z", "creator": "arjan.tijms@gmail.com", "creation_time": "2016-10-10T17:53:29Z", "attachment_id": null}]