[{"attachment_id": 34321, "tags": [], "creator": "joly.aurelien@gmail.com", "text": "Created attachment 34321\nJava test case\n\nWhen setSheetOrder is called, and a sheet is moved, the scope of the name in the document stays on the old sheet.\n\nEx :\n I have document with 3 sheets. I have defined a name on sheet3, when I move sheet3 using setSheetOrder, the scope of the name is still the third sheet which is now sheet2\n\ncf attachement for the reproduction case", "count": 0, "id": 194122, "time": "2016-10-03T15:06:50Z", "bug_id": 60197, "creation_time": "2016-10-03T15:06:50Z", "is_private": false}, {"count": 1, "tags": [], "creator": "onealj@apache.org", "attachment_id": 34343, "text": "Created attachment 34343\nJava test case\n\nCould you please attach D:\\\\testPOI.xlsx to this bug so that we can reproduce this problem?\n\nIf this is not possible due to proprietary information, could you either manually create an Excel file that demonstrates the problem or write the unit test to create a new workbook, add the named ranges, change the sheet order, and verify that the named ranges refer to the correct sheets.", "id": 194250, "time": "2016-10-08T23:56:28Z", "bug_id": 60197, "creation_time": "2016-10-08T23:56:28Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 60197, "attachment_id": null, "is_private": false, "id": 194251, "time": "2016-10-09T00:00:31Z", "creator": "onealj@apache.org", "creation_time": "2016-10-09T00:00:31Z", "text": "Disregard comment 1. testPOI.xlsx is the output file name. The test case creates an empty workbook, adds sheets and a named range, changes sheet order, and checks whether the named range refers to the correct sheet."}, {"attachment_id": null, "tags": [], "creator": "onealj@apache.org", "text": "Thanks for finding this bug. I have fixed this bug, with unit tests, for HSSF, XSSF, and SXSSF in r1763939.\n\nWhile fixing this, I noticed another quirk in XSSF, as documented in the unit test. XSSFName objects become invalid after writing a workbook. If this is an issue for you, please open a new bug if you cannot find an already-open bug for this.", "count": 3, "id": 194253, "time": "2016-10-09T03:06:55Z", "bug_id": 60197, "creation_time": "2016-10-09T03:06:55Z", "is_private": false}]