[{"count": 0, "tags": [], "text": "We have Jsp,Java Bean,Java servlet, HTML pages in this Application. The site in \nrunning in windows environment and DB2 database which is connecting to AS400 \nsystem thru T3 line remotely. Now the application is hosted in Windows NT \nServer with IIS 4.0 and Jakarta Tomcat 3.2. Tomcat is running presently as a \nService in NT. The problem we are facing is the Serivce is automatically \nshutting down.(which is restarting itself bcoz it is set like this). When this \nshuts down for a fews seconds are restarts itself, we are loosing data.When we \nused to start Tomcat mannually thru Command prompt also, this shutdown was \noccuring. \nThe questions are \n1) Why does tomcat  shuts down abruptly ??\n2) We have included Connection pooling (in Connection Bean)\n   is it bcoz of this ???  \n3) Is it bcoz of AS400/DB2 database connecting remotely thru T3 line ???\n\nThanks in Advance \nRegards,\nHarish", "is_private": false, "id": 9907, "creator": "harish@neosoftindia.com", "time": "2002-01-25T05:37:53Z", "bug_id": 6027, "creation_time": "2002-01-25T05:37:53Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 6027, "is_private": false, "text": "This is a question better suited for tomcat-user. In case you still need a\nsolution to this problem, please post to Tomcat-user with log content.", "id": 93422, "time": "2006-09-12T16:37:01Z", "creator": "sriramnrn@gmail.com", "creation_time": "2006-09-12T16:37:01Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 6027, "attachment_id": null, "is_private": false, "id": 93473, "time": "2006-09-12T22:14:50Z", "creator": "markt@apache.org", "creation_time": "2006-09-12T22:14:50Z", "text": "This is old but I see no reason to mark it as invalid. It might be fixed in\n3.3.x but that should be confirmed before closing the bug. It shoudlo be marked\nas NEEDINFO."}, {"count": 3, "tags": [], "bug_id": 6027, "attachment_id": null, "is_private": false, "id": 114105, "time": "2008-02-28T11:46:15Z", "creator": "markt@apache.org", "creation_time": "2008-02-28T11:46:15Z", "text": "Tomcat 3 is no longer the focus of development.\n\nIt is almost certain there will be no development work on versions prior to 3.3.x and it is highly unlikely that further development will take place on 3.3.x\n\nAll open Tomcat 3 bugs are therefore being closed as WONTFIX.\n\nIf any of these issues is still a problem for you, please test the latest stable release of a supported version (http://wiki.apache.org/tomcat/TomcatVersions). If you still have the issue with the latest stable release of a supported version, please re-open this bug and change the version to the one you tested."}]