[{"count": 0, "tags": [], "bug_id": 60289, "attachment_id": 34397, "is_private": false, "id": 194616, "time": "2016-10-21T11:32:46Z", "creator": "dgonsan@gmail.com", "creation_time": "2016-10-21T11:32:46Z", "text": "Created attachment 34397\nMicrosoft Access Database to reproduce the bug\n\nHi,\n\nThe class XSSFRichTextString decodes the UTF strings that OOXML format stores in the XML that it generates, this works as expected when the file is generated from Excel as it generates the code with an uupercase hex value, eg: _x000D_ will get translated to /r. \n\nBut I have found that when you export from Microsoft Access 2010 (I haven't tested in newer versions) through a Visual Basic macro using the method DoCmd.TransferSpreadsheet (https://msdn.microsoft.com/en-us/library/office/ff844793.aspx) with the type acSpreadsheetTypeExcel12Xml to export to OOXML it generates the UTF characters with the values in lowercase, eg: _x000d_ wich are not matched by the regular expression used in XSSFRichTextString and thus get passed to the value unmodified.\n\nThat's not a problem if the value is stored back to an xslx file, as Excel understand it and decodes the character, but in my case we copy this value to a CSV file which causes the code _x000d_ to be transferred to the text file and not the expected /r. Similar results can be seen if you output the XSSFRichTextString value to a log.\n\nAttached is a simple Access Database with one table that has one rich text field that contains the character /r and a Visual Basic module that exports the contents of the tables to Excel, I have also included the Excel that results from executing the macro.\n\nRegards,\nDaniel."}, {"count": 1, "tags": [], "bug_id": 60289, "attachment_id": 34398, "text": "Created attachment 34398\nPatch that fixes the bug\n\nWe created a trivial patch changing the regular expression on XSSFRichTextString to accept lowercase hex values. I attached it in case it could be useful.", "id": 194617, "time": "2016-10-21T11:35:58Z", "creator": "dgonsan@gmail.com", "creation_time": "2016-10-21T11:35:58Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 60289, "attachment_id": null, "is_private": false, "id": 194623, "time": "2016-10-21T16:32:32Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2016-10-21T16:32:32Z", "text": "Applied in r1766065, thanks for the patch, this will be included in 3.16-beta1."}]