[{"count": 0, "tags": [], "bug_id": 60302, "is_private": false, "text": "Created attachment 34402\nSample source code\n\nWhen creating a .xlsx file using SXSSF and including a formula (SUM for example), Microsoft Office can open the generated file perfectly.\n\nHowever, when trying to open it with LibreOffice, the generated formula contains 0 as the result, even though it should have a value.\n\nSample source code in attachment\n\nPoi version: 3.15\nLibreOffice version: 5.2.2.2", "id": 194659, "time": "2016-10-24T20:17:06Z", "creator": "nicolaspohren@gmail.com", "creation_time": "2016-10-24T20:17:06Z", "attachment_id": 34402}, {"count": 1, "tags": [], "creator": "onealj@apache.org", "attachment_id": null, "text": "Formulas are not automatically evaluated in POI.\n\nYou can either force Excel/LibreOffice to recalculate formulas when the workbook is opened [1] or use POI to update the formula result before saving the file. [2,3]\n\nThat said, I believe the described behavior is expected and not a bug in POI, but rather an implementation difference in formula evaluation on workbook open in Excel versus LibreOffice.\n\n[1] https://poi.apache.org/apidocs/org/apache/poi/ss/usermodel/Workbook.html#setForceFormulaRecalculation(boolean)\n[2] https://poi.apache.org/spreadsheet/formula.html\n[3] https://poi.apache.org/spreadsheet/eval.html", "id": 194660, "time": "2016-10-24T21:09:22Z", "bug_id": 60302, "creation_time": "2016-10-24T21:09:22Z", "is_private": false}, {"count": 2, "tags": [], "creator": "nicolaspohren@gmail.com", "attachment_id": null, "text": "Makes sense being a behavior difference between Microsoft Excel and LibreOffice when updating the formulas.\n\nI tested setting \"setForceFormulaRecalculation(true)\" in my example source code, but it did not change the outcome (Still works in Microsoft Office, not in LibreOffice)\n\nHowever, I find it strange that it works with XSSF or HSSF but not with SXSSF (I forgot to mention this in the original post). So this shows that there's a way to save the .xlsx file so that LibreOffice correctly updates the formulas. I don't know how SXSSF works internally, but we are restricted to using it because of memory usage.\n\nI cannot evaluate the formulas before saving the file because our users may modify the original values and want the formulas to be updated, so it can't be a fixed value.\n\nThat said, if this is an expected behavior of SXSSF, even though is different than XSSF, I will change the bug status to resolved.\n\nThanks for the quick response!", "id": 194666, "time": "2016-10-25T10:13:00Z", "bug_id": 60302, "creation_time": "2016-10-25T10:13:00Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 60302, "text": "(In reply to nicolaspohren from comment #2)\n> I cannot evaluate the formulas before saving the file because our users may\n> modify the original values and want the formulas to be updated, so it can't\n> be a fixed value.\n\nThe OOXML format can save both a formula and a cached result (that can be re-evaluated).\nOff the top of my head, it looks like this:\n<c address=\"G6\" type=\"f\">\n  <f>SUM(A1:D3)</f>\n  <v>42</v>\n</c>\n\nCell#setCellFormula(\"SUM(A1:D3)\")  will set f to \"SUM(A1:D3)\" and v to 0. POI can evaluate the formula result and set v to 42.\n\nThat said, SXSSF formula evaluation is contingent on all formulas being accessible in the row window.", "id": 194670, "time": "2016-10-25T15:53:23Z", "creator": "onealj@apache.org", "creation_time": "2016-10-25T15:53:23Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "greg.woolsey@gmail.com", "attachment_id": null, "text": "(In reply to nicolaspohren from comment #2)\n> However, I find it strange that it works with XSSF or HSSF but not with\n> SXSSF (I forgot to mention this in the original post). So this shows that\n> there's a way to save the .xlsx file so that LibreOffice correctly updates\n> the formulas. I don't know how SXSSF works internally, but we are restricted\n> to using it because of memory usage.\n> \nSince you can see it working one way but not the other, you can compare the two outputs (XSSF/SXSSF) to see what changed for the same workbook definition.  The files are just zipped XML file trees - unzip them and compare the trees.  It could well be that somehow the \"recalculate on open\" flag is not written properly in one case, or something like that.  Having example files that are generated by the two pathways from the same Java objects would be a good start for a test case.", "id": 194671, "time": "2016-10-25T16:16:17Z", "bug_id": 60302, "creation_time": "2016-10-25T16:16:17Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 60302, "text": "The problem is that the cached values for the formula is not populated by default in POI to save the CPU cycles if not needed. You can force single cells or all formulas to be evaluated with the FormulaEvaluator which is available via \"wb.getCreationHelper().createFormulaEvaluator()\", so in your case the following makes the result of the formula also show up in LibreOffice correctly:\n\n            wb.getCreationHelper().createFormulaEvaluator().evaluateAll();\n\nTherefore I am closing this WORKSFORME now as this is currently by design and only Excel seems to somehow detect that the formulas need recalculation whereas LibreOffice seems to rely on them being populated always.", "id": 200975, "time": "2017-09-19T19:11:57Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2017-09-19T19:11:57Z", "is_private": false, "attachment_id": null}]