[{"count": 0, "tags": [], "creator": "anthony@donuts.email", "attachment_id": null, "id": 194799, "time": "2016-11-03T16:55:39Z", "bug_id": 60338, "creation_time": "2016-11-03T16:55:39Z", "is_private": false, "text": "I have a test plan which is configured for 35 threads. I run the test plan on two remote servers so the total active threads should be 70. When i look at the thread group related graphs on the dashboard i only see 35 threads being reported. I would expect that the dashboard should show 70 threads.\n\nI have attached my results.jtl file and a screenshot of the thread group related graphs on the dashboard.\n\nLet me know if you need more info....\n\nMaybe this is already addressed by bug 60171 ?"}, {"attachment_id": 34419, "tags": [], "bug_id": 60338, "is_private": false, "count": 1, "id": 194800, "time": "2016-11-03T17:12:46Z", "creator": "anthony@donuts.email", "creation_time": "2016-11-03T17:12:46Z", "text": "Created attachment 34419\nresults zip file with results.jtl"}, {"attachment_id": null, "tags": [], "bug_id": 60338, "text": "Hi,\nThis is fixed in nightly build but ensure you read the docs because you need to add to thread group something that uniquely identifies thread group per injector.\n\nFeedback is very welcome.\nRegards\n\n*** This bug has been marked as a duplicate of bug 60171 ***", "count": 2, "id": 194802, "time": "2016-11-03T18:13:42Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2016-11-03T18:13:42Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 60338, "text": "Hi, I don't really understand this comment.....\n\n\"add to thread group something that uniquely identifies thread group per injector.\"\n\nIn my case the test plan has one thread group and the plan is 35 threads. So when the plan is sent to two remote slaves each slave runs 35 threads and hence the total threads is 70 started and 70 active. If is send this results.jtl file to blaze Meter sense site it identifies correctly that there are 70 threads.\n\nMaybe I just need to update the dashboard changes to my jmeter instance to try out the changes?", "count": 3, "id": 194804, "time": "2016-11-03T19:10:45Z", "creator": "anthony@donuts.email", "creation_time": "2016-11-03T19:10:45Z", "is_private": false}, {"count": 4, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 194805, "time": "2016-11-03T19:21:01Z", "bug_id": 60338, "creation_time": "2016-11-03T19:21:01Z", "is_private": false, "text": "(In reply to anthony.kearns@ymail.com from comment #3)\n> Hi, I don't really understand this comment.....\n> \n> \"add to thread group something that uniquely identifies thread group per\n> injector.\"\n> \n> In my case the test plan has one thread group and the plan is 35 threads. So\n> when the plan is sent to two remote slaves each slave runs 35 threads and\n> hence the total threads is 70 started and 70 active.\n\nPlease read the nightly build doc about how to configure it.\nso that it works in jmeter.\nYou need for example to add ${__machineName} in the thread group name\n\n\n> If is send this\n> results.jtl file to blaze Meter sense site it identifies correctly that\n> there are 70 threads.\n\n\nI don't know how blazemeter works, but JMeter has no relation with it.\nIf you're running your test within blazemeter then report it to their support.\nIf it's plain jmeter then follow my advice and give feedback.\n\nThanks\n\n\n\n> Maybe I just need to update the dashboard changes to my jmeter instance to\n> try out the changes?"}, {"count": 5, "tags": [], "bug_id": 60338, "attachment_id": null, "is_private": false, "id": 194813, "time": "2016-11-03T22:41:56Z", "creator": "anthony@donuts.email", "creation_time": "2016-11-03T22:41:56Z", "text": "Thank you, i get it now. Will close this bug now as a dupe of the one you mentioned.\n\nthanks again"}]