[{"count": 0, "tags": [], "text": "Created attachment 34452\nPatch against 2.3.2 to fix the reported issue.\n\nThe dio_Postgresql.tcl module in Rivet 2.3.2 does not implement a Postgresql specific 'quote' proc, instead relying on the generic 'quote' proc provided by DIO which quotes single quote (ASCII 0x27) characters by prefixing them with a backslash.  However, by default Postgresql supports the SQL standard \"doubling\" quoting method for single quotes (see section 4.1.2.1 in the Posgresql docs here https://www.postgresql.org/docs/9.6/static/sql-syntax-lexical.html).  Backslash quoted single quotes cause an SQL syntax error unless the Postgresql specific symtax described in section 4.1.2.2 of the URL above is used.\n\nSince dio_Postgresql.tcl uses the default backslash quoting, this means that attempting to insert a string containing a single quote (') via DIO results in an SQL syntax error.\n\nThe fix is simple.  dio_Postgresql.tcl uses the Pgtcl interface module.  Pgtcl provides a 'pg_quote' proc for use in properly quoting strings to be inserted into SQL statements for use with Postgresql.  So modifying dio_Postgresql.tcl to use pg_quote instead of the default 'quote' method fixes the issue.  Small patch attached against 2.3.2, however the identical issue exists with Rivet 2.2.4 and the fix is identical there.", "attachment_id": 34452, "id": 195017, "creator": "asfbugzilla-email@dp100.com", "time": "2016-11-16T02:19:52Z", "bug_id": 60378, "creation_time": "2016-11-16T02:19:52Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 60378, "attachment_id": null, "id": 195018, "time": "2016-11-16T06:12:36Z", "creator": "jlawson-apache@bovine.net", "creation_time": "2016-11-16T06:12:36Z", "is_private": false, "text": "The latest version of PgTcl also now supports parameterized queries, which could be used instead of pg_quote."}, {"count": 2, "tags": [], "bug_id": 60378, "attachment_id": null, "id": 195049, "time": "2016-11-16T23:14:58Z", "creator": "mxmanghi@apache.org", "creation_time": "2016-11-16T23:14:58Z", "is_private": false, "text": "Thank you Richard for filing the bug, your patch has been applied to both the code in branches/2.3 and trunk\n\n -- Massimo Manghi"}]