[{"attachment_id": 34491, "tags": [], "bug_id": 60433, "text": "Created attachment 34491\nAn error log from Tomcat9 containing 4 records in one second, possibly covering 2 requests (2 errors each)\n\nThis bug may be similar to 60372, but I'm not strong enough in this area to know if its the same. Feel free to delete or modify if so.\n\nI am building an archival system on a LAN to host old webapps from production servers slated for decommissioning. Our business line once required us to make new Java webapps as a matter of routine, fortunately now we usually add static content to a smaller number of existing webapps.\n\nThis new system is based on Tomcat 9.0.0.M13, unlike production versions which are all various versions of Tomcat 5, 6 and 7, which are all working fine. Like our production servers, it will have a large number of webapps, unlike production servers, it will rarely if ever have more than 2 concurrent users. I have the following information about the host machine:\n\nDell OptiPlex 780USFF\nWindows 7 32 bit\nIntel Core2Duo E7500, 4GB Ram\nJava is Version 8 Update 111, build 1.8.0_111-b14\nAccessed directly by HTTP connector (e.g. http://machinename:8080), AJP is not being used here.\n\nI copied a number of webapps from a production server to this server weeks ago, but since that time have not added any more, only configured each one to adapt to the new environment, updating database drivers, editing web.xml in each etc. For reasons that are to me unclear, the whole thing began misbehaving yesterday.\n\nThe symptoms affect mainly pages that require active processing, servlets and jsp files, though static pages can be affected as well. They include, browsers complaining that the \"The connector was reset\" or simply not able to see the server at all (which can affect both static and dynamic pages), also sometimes pages do run but with images or style sheets missing, especially dynamic pages. \n\nThe error logs record extensive details in each instance, each time recording an error of type: BufferOverflowException at java.nio.HeapByteBuffer.put(Unknown Source). I've included a log file containing 4 errors that occurred in one second during testing yesterday. I think it covers 2 individual requests during that second, 2 errors each. From yesterday evening on these became regular occurrences.\n\nUnfortunately I cannot advise how to reproduce this, mainly because I have no idea what caused it.", "count": 0, "id": 195303, "time": "2016-11-30T10:03:57Z", "creator": "sean.wrynn@citylearning.com", "creation_time": "2016-11-30T10:03:57Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 60433, "attachment_id": null, "text": "Hi,\n\nThe issue is the same as 60372.\n\nRegards,\nVioleta\n\n*** This bug has been marked as a duplicate of bug 60372 ***", "id": 195304, "time": "2016-11-30T12:36:07Z", "creator": "violetagg@apache.org", "creation_time": "2016-11-30T12:36:07Z", "is_private": false}]