[{"count": 0, "tags": [], "creator": "axel@boxfuse.com", "text": "Say I have a keystore in PKCS12 format and a truststore in the default JKS format.\n\nBy setting the keystore type (PKCS12) and NOT explicitly overriding the default truststore type (JKS), the truststore type now also gets changed to PKCS12 and fails to load.\n\nThis line is the issue: https://github.com/apache/tomcat/blob/trunk/java/org/apache/tomcat/util/net/SSLHostConfig.java#L585\n\nThis behavior is currently very unintuitive and not documented anywhere. I strongly believe change the keystore type should not secretly alter the truststore type.", "id": 195388, "attachment_id": null, "bug_id": 60450, "creation_time": "2016-12-07T12:36:24Z", "time": "2016-12-07T12:36:24Z", "is_private": false}, {"count": 1, "tags": [], "text": "From the 8.5.x documentation:\n\n<quote>\ntruststoreType\t\nJSSE only.\n\nThe type of key store used for the trust store. The default is the value of the javax.net.ssl.trustStoreType system property. If that property is null, the value of keystoreType is used as the default.\n</quote>\n\nThose docs could do with an update to make clear it is the key store type of the default certificate that is used.\n\nPKCS12 is somewhat of a special case since the trust store is unlikely to be in the same format as the key store.\n\nI'm currently leaning towards WONTFIX for the original request in this report since the behaviour is documented and makes sense for key store types other than PKCS12.\n\nA possible enhancement could be for the trust store type to default to JKS if the keys store type is PKCS12. However, that would add complexity.", "is_private": false, "id": 195389, "creator": "markt@apache.org", "time": "2016-12-07T12:56:02Z", "bug_id": 60450, "creation_time": "2016-12-07T12:56:02Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "axel@boxfuse.com", "is_private": false, "text": "Or couldn't this whole setting simply default to autodetection? After all we can now simply set it to  JKS and this will autodetect both PKCS12 and JKS (see https://bugs.openjdk.java.net/browse/JDK-8062552)\n\nTherefore I believe a default of JKS should be a fine one, instead of the current behavior where setting the keystore type to PKCS12 without overriding the default truststore type almost invariably results in a cryptic and hard to debug failure.", "id": 195390, "time": "2016-12-07T13:07:58Z", "bug_id": 60450, "creation_time": "2016-12-07T13:07:58Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Auto detection is not an option. Tomcat 8.x has a minimum Java requirement of 7 where that feature is not (yet?) available. Tomcat 9 needs to run on any Java 8 version so requiring a minimum point release to support PKCS12 via auto detection is not acceptable. Finally, not everyone uses Oracle's JSSE implementation and we need to support all of those as well.\n\nWhile looking into this I discovered that Tomcat wasn't consistently using the key store type as the default trust store type so this needs fixing too.\n\nI've now fixed the inconsistencies in using the key store type as the default, ensured PKCS12 won't be used as the default and updated the docs to make clear how the default is selected.\n\nFixed in:\n- trunk for 9.0.0.M15 onwards\n- 8.5.x for 8.5.10 onwards", "id": 195421, "time": "2016-12-09T09:29:46Z", "bug_id": 60450, "creation_time": "2016-12-09T09:29:46Z", "is_private": false}]