[{"count": 0, "text": "Hi,\n\nDuring some tests, we saw a change between 2.2.31 and 2.4.23 on how the ProxyPass directives are processed when they are in a <Location> directive.\n\nFor example, taking this configuration: \n<Location /foo>                                                                                                                                                                         \n  ProxyPass         http://backend2/                                                                                                                                                    \n  ProxyPassReverse  http://backend2/                                                                                                                                                    \n</Location>                                                                                                                                                                             \n<Location />                                                                                                                                                                            \n  ProxyPass        http://backend1/                                                                                                                                                     \n  ProxyPassReverse http://backend1/                                                                                                                                                     \n</Location>   \n\nIn 2.2, when accessing to http://example.com/foo, we reach http://backend2/.\nIn 2.4, when accessing the same url, we reach http://backend1/.\n\nThis change in behaviour does not appear to be documented in the 2.2 -> 2.4 upgrade docs.\n(Very carefully) comparing the documentation for ProxyPass between 2.2 and 2.4 shows the addition of a easily-missed but important line in 2.4 near the end of the \"Ordering ProxyPass Directives\" bit about the interaction with <Location> that reads:\n\n\"In contrast, only one ProxyPass directive can be placed in a Location block, and the most specific location will take precedence.\"\n\nSince /foo is a more specific location than /, this suggests that either order of the <Location> sections in the example should result in /foo being forwarded to backend2, but this is not the case.\n\nAfter some more reflection on the issue, I realized that perhaps \"most specific location\" should instead be interpreted as \"the last <Location> section that matched the request URI\".\nIndeed, as per the merging rules outlined in the \"How the sections are merged\" documentation, <Location> blocks should generally be ordered in order from more general appearing first, followed by more specific overrides for sub-URIs.\n\nIn that sense, both meanings of \"most specific location\" align.\nHowever, this is not immediately clear to people with ProxyPass-inside-Location configs coming from 2.2, where the <Location> blocks had to be flipped around due to the behaviour of ProxyPass in 2.2.\n\nSo presumably the extra line in the \"Ordering ProxyPass directives\" block is referring to the fact that the discrepancy of the order in which ProxyPasses inside <Location>s are matched in 2.2 has now been fixed in 2.4, but then I submit that:\n  - the wording \"most specific location\" is ambiguous and not necessarily clear to people coming from 2.2\n  - this should perhaps get a mention in the 2.2 -> 2.4 upgrade docs\n\nThank you.\n\nKind regards,\n\nM. Khemir", "bug_id": 60479, "attachment_id": null, "id": 195492, "time": "2016-12-14T16:39:41Z", "creator": "khemir.med@gmail.com", "creation_time": "2016-12-14T16:39:41Z", "tags": [], "is_private": false}]