[{"count": 0, "tags": [], "bug_id": 60499, "attachment_id": 34536, "text": "Created attachment 34536\nA test PPT with an image used twice, and a java code with a main to reproduce the problem\n\nIf the same picture is referenced twice in a slide (with 2 XSLFPictureShape), deleting one of the XSLFPictureShape will corrupt the slide. By corrupted, I mean that PowerPoint won't be able to load the slide and it will replace its content with a blank slide.\nI am guessing that XSLF always deletes the image file along with the XSLFPictureShape. What should be done is deleting the image file only if it is not used by other XSLFPictureShape elements.\n\nTo create a slide with the same picture referenced twice:\n1. insert a picture in a slide,\n2. copy and past the inserted picture in the current slide.\nThe same picture should be duplicated in the slide.\n\nI have put attached a zip file with:\n- a PPT with one slide and an image used twice in that slide,\n- a java class with a small main() to reproduce the probleme.", "id": 195572, "time": "2016-12-20T10:02:57Z", "creator": "amanteaux+bzapache@gmail.com", "creation_time": "2016-12-20T10:02:57Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 60499, "attachment_id": null, "text": "I regard the original issue as invalid - if you have multiple references to the same part (e.g. a png image), you would have each time a new relationship - i.e. relationships aren't reused. I have to admit, that I haven't search the ECMA spec for this definition, but if you do the same manually via MS/Libre Office you actually get not only a copied relationship but also a second media part.\n\nAfter I adopted your sample to this handling, the resulting pptx was still corrupt as the POIXMLDocumentPart.removeRelation(POIXMLDocumentPart) method didn't handle multiple references correct.\n\nThis was fixed via r1808661", "id": 200923, "time": "2017-09-17T22:54:07Z", "creator": "kiwiwings@apache.org", "creation_time": "2017-09-17T22:54:07Z", "is_private": false}]