[{"count": 0, "tags": [], "creator": "loisel.jerome@gmail.com", "text": "1 - When creating several csv variables using the same file an unexpected behavior happens.\nLet's consider two variables named login1 and login2 using the same file (sharing mode on \"all threads\").\nDuring the first iteration login1 will use the first line of the file and login2 will use the second line of the file. As if they were two different threads requesting values from this file.\n\n2 - If I setup the same variables with two identical files named differently both variables will use the first line of the csv.\n\nThe 2nd behavior seems normal while the 1st one seems like a bug. 2x CSV Datasets are concurrently reading the same file when filename is the same since only a single Reader is shared between them.\n\nWhen looking at the code, it seems like the filename is used a key for a caching system which keeps the BufferedReader. (FileServer.getReader)", "id": 195916, "time": "2017-01-09T15:52:13Z", "bug_id": 60563, "creation_time": "2017-01-09T15:52:13Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "text": "Hello Jérôme,\nCan you provide a Test plan showing the problem ?\n\nI am a bit tired and don't understand the description :-)\n\nThanks", "id": 195997, "time": "2017-01-11T20:22:17Z", "bug_id": 60563, "creation_time": "2017-01-11T20:22:17Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Sure, i'll do. The issue is simple:\n\n1. Setup 2 CSV Dataset pointing to the same file,\n2. Use both variables one time in the script.\n\nExpected: first value of the file for each separate variable.\nActual: first value and second value seen.\n\nWhen looking at the code, it seems obvious since the filename is used as key for a caching system. I'm attaching the JMX.", "is_private": false, "bug_id": 60563, "id": 195999, "time": "2017-01-11T21:03:01Z", "creator": "loisel.jerome@gmail.com", "creation_time": "2017-01-11T21:03:01Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "loisel.jerome@gmail.com", "is_private": false, "text": "Created attachment 34611\njmx to reproduce\n\nCheck JMeter logs. It should display first=1, and second=1.", "id": 196000, "time": "2017-01-11T21:03:36Z", "bug_id": 60563, "creation_time": "2017-01-11T21:03:36Z", "attachment_id": 34611}, {"count": 4, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "is_private": false, "text": "Hello Jérôme,\nThis is the desired behaviour.\nIn your case, if you want to do what you describe, just set SharingMode to a different value for each CSV DataSet.\n\nIf we change the existing behaviour, it can break a lot of existing test plans.\nIn my particular case for example, I rely on such behaviour.\n\nFeel free to reopen if you disagree and have an idea to have a better behaviour.\nRegards", "id": 196310, "time": "2017-01-23T09:23:18Z", "bug_id": 60563, "creation_time": "2017-01-23T09:23:18Z", "attachment_id": null}]