[{"count": 0, "tags": [], "bug_id": 60571, "is_private": false, "id": 195969, "creation_time": "2017-01-11T00:05:27Z", "time": "2017-01-11T00:05:27Z", "creator": "jlwinger@us.ibm.com", "text": "Created attachment 34608\nexcel export using backslashes\n\nI'm using Apache POI in java to export an excel file with a custom currency format. I'm using Microsoft Excel for Mac 2011, and open office on the side for comparison. \n\nWhen exporting our currency values, they can contain alphabetic currency symbols: GBP for UK Pounds, JPY for yen as an example. But these currency symbols can be customized by our users before exporting.\n\nIn our excel export code, I edit the built-in formats in org.apache.poi.ss.usermodel.BuiltinFormats (6 for yen, and 8 for pounds), and replace the \"$\" with the currency symbols. I've replaced them both ways, as supported by microsoft excel: \n\"JPY\", \"GBP\", \\J\\P\\Y, \\G\\B\\P\n\nI add the format to the cellStyle, and then the cell, which has the raw value set already:\t\t\t\tcellStyle.setDataFormat(dataFormat.getFormat(\"\\\"JPY\\\"#,##0_);[Red](\\\"JPY\\\"#,##0)\"));\nor\ncellStyle.setDataFormat(dataFormat.getFormat(\"\\J\\P\\Y#,##0_);[Red](\\J\\P\\Y#,##0)\"));\nand\ncellStyle.setDataFormat(dataFormat.getFormat(\"\\\"GBP\\\"#,##0.00_);[Red](\\\"GBP\\\"#,##0.00)\"));\nor\ncellStyle.setDataFormat(dataFormat.getFormat(\"\\G\\B\\P#,##0.00_);[Red](\\G\\B\\P#,##0.00)\"));\n\n*note that I have also used CreationHelper to get the format, same results: \t\t\t\t\t\tcreationhelper.createDataFormat().getFormat(displayMask);*\n\nOnce exported, the numbers aren't formatted as such; they use $ as the currency symbol, which is in my locale. \n\nI get the following results when exporting with the backslash. Also, the positive format for JPY doesn't have the \"J\" on it, yet the negative format is fine:\n\n$55,555,555.56 \tUnited Kingdom Pounds\nPY 54,684,654,685 \tJapan Yen\n(JPY 55,555,555)\tJapan Yen\n\nIf I format the GBP cell value, I see the GBP custom format as such:\n\\G\\BP #,##0.00_);[Red](\\G\\BP #,##0.00)\n\nand if I apply it to the cell, I get the number format I wanted upon first opening the excel file:\nGBP 55,555,555.56 \tUnited Kingdom Pounds\n\nWhen using the quotation around the currency symbol abbreviation, I get a \"content is unreadable\" error, but it can be repaired. The results are:\n$55,555,555.56 \tUnited Kingdom Pounds\n54684654685\tJapan Yen\n-55555555\tJapan Yen\n\nIf I look at the custom format list, the JPY number format isn't there. For GBP, it is:\n\"GBP\"#,##0.00_);[Red](\"GBP\"#,##0.00)\n\nand when I apply it to the cell, I get the desired result:\nGBP55,555,555.56 \tUnited Kingdom Pounds\n\nAny help on this would be greatly appreciated. I'm fine with setting the number formats using backslashes. The custom formats seem to be generated, except the \"J\" in JPY is cut off. But the number format isn't applied to the cell, in which I hopefully did correctly using Apache POI. Thank you.", "attachment_id": 34608}, {"count": 1, "tags": [], "bug_id": 60571, "text": "I'm increasing the severity as the solution to this, or at least a response, is needed as soon as possible. Thanks.", "id": 196103, "time": "2017-01-16T18:06:29Z", "creator": "jlwinger@us.ibm.com", "creation_time": "2017-01-16T18:06:29Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 60571, "text": "You understand that the developers here are all volunteers, and mostly work on the things that are important to them in their free time. If you need something as soon as possible, it would be best to download the source and take a crack at it yourself. Then donate your solution back to the project. Please include examples and unit tests in your submission.", "id": 196104, "time": "2017-01-16T18:57:52Z", "creator": "jmarkmurphy@apache.org", "creation_time": "2017-01-16T18:57:52Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "jlwinger@us.ibm.com", "attachment_id": null, "id": 196105, "time": "2017-01-16T19:29:13Z", "bug_id": 60571, "creation_time": "2017-01-16T19:29:13Z", "is_private": false, "text": "Ok, thank you for your response!"}, {"count": 4, "tags": [], "bug_id": 60571, "attachment_id": null, "text": "Hello, so I have been working on this issue. I believe the change may be deeper than the package I had mentioned, and I don't see the source code for them. But more importantly, I don't quite know where the implementation for the solution would take place.\n\n\nIn the excel file, I did comparisons and looked at the cell properties, by using VBA editor. The cell properties \"NumberFormat\" and \"NumberFormatLocal\" should be set with the custom number format somehow. They aren't set currently with the custom format, except for the Japanese Yen, as I had mentioned; the others are set with a standard currency format. I also manaully added the format to a cell value, and did see this cell property update to the correct custom number format. So I believe if we have some way to set this in Apache POI, that will resolve the issue. \n\nThe following are some things I've looked into.\n\nI looked in CellUtil.setCellStyleProperty(), and those are limited. Updating this to have a setNumberFormat & setNumberFormatLocal might help. However, I've unzipped an xlsx file, and looked at the containing xml files, and it seems that the only place which has the custom number formats is in styles.xml. And as I've mentioned before, the JPY number format works mostly. So I don't know how this update would help.\n\nAnother location I looked in is in CTXF, which is used when setting the data format for cell styles. When debugging, I looked at the xml fragment generated (this is for Japanese Yen, but it looks the same for all the cells):\n\n<xml-fragment numFmtId=\"166\" fontId=\"0\" fillId=\"0\" borderId=\"0\" xfId=\"0\" applyNumberFormat=\"true\" xmlns:main=\"http://schemas.openxmlformats.org/spreadsheetml/2006/main\">\n  <main:alignment wrapText=\"true\"/>\n</xml-fragment>\n\nFrom what I've researched, this should include the \"formatCode\" attribute, which the value would be the number format. \n\nI received that from this stackoverflow, but the solution doesn't use Apache POI, nor do I think it still uses the formatCode attribute, which leads me to believe this implementation may not be fruitful. But I'd appreciate an opinion from someone else.\nhttp://stackoverflow.com/questions/23501843/applying-number-formatting-in-openxml\n\nThis package may be with a different open source product, is that right? org.openxmlformats.schemas.spreadsheetml.x2006.main\n\nIf so, maybe the issue resides in there and I should open a different ticket? \n\nThank you all for any tips or suggestions.", "id": 196382, "time": "2017-01-24T23:03:43Z", "creator": "jlwinger@us.ibm.com", "creation_time": "2017-01-24T23:03:43Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 60571, "text": "One major complicating factor with this particular issue, that I've dealt with in the past, is that Excel uses the Windows Region settings for default number formatting, and doesn't store them (as you see) in the document itself.  That's how two users can open the same file and see different grouping separators and decimal symbols, for example.\n\nThese are very deeply buried in the Windows Control Panel settings, but are the only way to change the Excel defaults.  I don't even know how different versions of Excel will handle having them explicitly set in the document XML, i.e. Excel for Mac, let alone LibreOffice.", "id": 196384, "time": "2017-01-25T00:28:02Z", "creator": "greg.woolsey@gmail.com", "creation_time": "2017-01-25T00:28:02Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 60571, "text": "(In reply to Greg Woolsey from comment #5)\n> One major complicating factor with this particular issue, that I've dealt\n> with in the past, is that Excel uses the Windows Region settings for default\n> number formatting, and doesn't store them (as you see) in the document\n> itself.  That's how two users can open the same file and see different\n> grouping separators and decimal symbols, for example.\n> \n> These are very deeply buried in the Windows Control Panel settings, but are\n> the only way to change the Excel defaults.  I don't even know how different\n> versions of Excel will handle having them explicitly set in the document\n> XML, i.e. Excel for Mac, let alone LibreOffice.\n\nThank you for your response! So please correct me if I'm wrong, but are you saying there's nothing we can write to any of the xml files in Excel which will tell Microsoft Excel to custom format a number value?", "id": 196413, "time": "2017-01-25T18:25:38Z", "creator": "jlwinger@us.ibm.com", "creation_time": "2017-01-25T18:25:38Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 60571, "is_private": false, "text": "I tried to figure that out about 6 years ago, and got nowhere.  I didn't prove it couldn't be done, but I did convince myself that Excel was too tightly integrated with Windows for that particular purpose to make it easy.  Even if you could embed something that Excel actually paid attention to, I'm not sure it would be applied consistently either, and may cause a confusing user experience, especially for users with different regional settings.\n\nYou might be better off formatting things explicitly and converting cells to text, although that won't work if they are needed for formulas elsewhere.", "id": 196414, "time": "2017-01-25T19:23:52Z", "creator": "greg.woolsey@gmail.com", "creation_time": "2017-01-25T19:23:52Z", "attachment_id": null}, {"count": 8, "tags": [], "creator": "jlwinger@us.ibm.com", "attachment_id": null, "id": 196435, "time": "2017-01-25T22:29:39Z", "bug_id": 60571, "creation_time": "2017-01-25T22:29:39Z", "is_private": false, "text": "(In reply to Greg Woolsey from comment #7)\n> I tried to figure that out about 6 years ago, and got nowhere.  I didn't\n> prove it couldn't be done, but I did convince myself that Excel was too\n> tightly integrated with Windows for that particular purpose to make it easy.\n> Even if you could embed something that Excel actually paid attention to, I'm\n> not sure it would be applied consistently either, and may cause a confusing\n> user experience, especially for users with different regional settings.\n> \n> You might be better off formatting things explicitly and converting cells to\n> text, although that won't work if they are needed for formulas elsewhere.\n\nAh yes, there could be aggregates on these values. Thank you for your help! I remember that for html files in excel, you can add  style attribute with mso-number-format=\"...\". From looking at the xml, I'm not quite certain yet, but I take it that it's not possible to use that attribute in the sheet.xml?"}, {"attachment_id": null, "tags": [], "bug_id": 60571, "text": "(In reply to Jonny from comment #8)\n> I remember that for html files in excel, you can \n> add  style attribute with mso-number-format=\"...\"\n> I take it that it's not possible to use that attribute in the sheet.xml?\n\nCheck in the OOXML schema. If you have built POI, it's in ooxml-lib/OpenOfficeXML-XMLSchema.zip, otherwise download it from ECMA International Office Open XML 1st edition part 4.\n\nI grepped through the schemas for mso and number-format and didn't see anything. Perhaps it's called something else in the schemas and sheet.xml? It's also possible that it was added after the 1st edition. If you find it, it's possible to get POI to write that attribute.", "count": 9, "id": 196436, "time": "2017-01-25T22:55:01Z", "creator": "onealj@apache.org", "creation_time": "2017-01-25T22:55:01Z", "is_private": false}, {"count": 10, "tags": [], "creator": "jlwinger@us.ibm.com", "attachment_id": null, "id": 196437, "time": "2017-01-26T01:01:02Z", "bug_id": 60571, "creation_time": "2017-01-26T01:01:02Z", "is_private": false, "text": "(In reply to Javen O'Neal from comment #9)\n> (In reply to Jonny from comment #8)\n> > I remember that for html files in excel, you can \n> > add  style attribute with mso-number-format=\"...\"\n> > I take it that it's not possible to use that attribute in the sheet.xml?\n> \n> Check in the OOXML schema. If you have built POI, it's in\n> ooxml-lib/OpenOfficeXML-XMLSchema.zip, otherwise download it from ECMA\n> International Office Open XML 1st edition part 4.\n> \n> I grepped through the schemas for mso and number-format and didn't see\n> anything. Perhaps it's called something else in the schemas and sheet.xml?\n> It's also possible that it was added after the 1st edition. If you find it,\n> it's possible to get POI to write that attribute.\n\nThank you for your response! I've looked through them, and no mention of it. I would imagine if it went by anything, it would include number or format, but none of those searches were fruitful. So this doesn't seem likely through xml files, which is fine. This doesn't need to be resolved right away, but at least now I have a legitimate reason as to why it can't be implemented right now. \n\nThank you all for your help!"}, {"attachment_id": null, "tags": [], "bug_id": 60571, "text": "Hi All,\n\nSo this actually does work. The issue was that I was reusing CellStyles for each currency field in the excel export. Thus, the last format would always override the other ones. \n\nThe solution was to use a hashmap, with the display mask as the key, to store and retrieve all the CellStyles. And if it isn't in the hashmap, make a new CellStyle.\n\nSorry for the confusion, and thank you all very much for your help!", "count": 11, "id": 196894, "time": "2017-02-10T00:41:25Z", "creator": "jlwinger@us.ibm.com", "creation_time": "2017-02-10T00:41:25Z", "is_private": false}, {"count": 12, "tags": [], "bug_id": 60571, "attachment_id": null, "id": 196896, "creation_time": "2017-02-10T02:06:56Z", "time": "2017-02-10T02:06:56Z", "creator": "onealj@apache.org", "text": "You might also try looking at CellUtil, which will look through existing CellStyles and create a new CellStyle only if one that matches your desired style exists.\n\nThis is basically the same as what your HashMap is doing, but with code maintained by POI.\nIf this class doesn't support data formats, send a pull request or patch.\n\nhttps://poi.apache.org/apidocs/org/apache/poi/ss/util/CellUtil.html", "is_private": false}]