[{"attachment_id": 34631, "tags": [], "bug_id": 60592, "is_private": false, "count": 0, "id": 196100, "time": "2017-01-16T15:14:32Z", "creator": "shenry@microautomation.com", "creation_time": "2017-01-16T15:14:32Z", "text": "Created attachment 34631\nTomcat Zip with log files and Conf\n\nUnder this version of Tomcat we have noticed the org.apache.coyote.http11.Http11Processor.service Error parsing HTTP request header error on two different servers, on two different days, that have the same version of Tomcat.  The issue was resolved on one server by rebooting, but the other server corrected itself.  When this error occurred on the servers it caused the application running to result in the follow two errors until it resolved itself a day later or it was corrected by the reboot.\n\norg.apache.coyote.http11.Http11Processor.service Error processing request\norg.apache.coyote.http11.Http11Processor.service Error finishing response\n\nWe had these servers running on Tomcat 8.0.33 64bit up until 12/15/2016, where we did not see such errors occurring with the application.  \n\nWe are not aware of what caused this error so we cannot provide a test scenario, but I have attached all of the logs that correspond to the server that corrected itself a day after the issue started occurring.  \n\nWhat we would like to know is, as I can see the issue was reported in the Tomcat 9 beta, it appears it was never resolved.  Is there any resolution for this error?  If we were to move to Tomcat 8.5.9 is there still a possibility it could still occur?  Do you have any other details about what could be causing this error to occur in your Tomcat version 8.5.6?\n\nPlease let me know if any additional logs would be helpful to investigate this issue."}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "text": "Please upgrade to the latest stable 8.5.x release (8.5.11 should be released shortly) and if the error still occurs provide the simplest possible test case to reproduce it.", "id": 196101, "time": "2017-01-16T15:28:33Z", "bug_id": 60592, "creation_time": "2017-01-16T15:28:33Z", "is_private": false}, {"count": 2, "tags": [], "creator": "shenry@microautomation.com", "is_private": false, "text": "Alright I will wait for that new version of Tomcat and report if the issue occurs using it.  Do you have an ETA on when it will be available?", "id": 196102, "time": "2017-01-16T17:52:34Z", "bug_id": 60592, "creation_time": "2017-01-16T17:52:34Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 60592, "is_private": false, "count": 3, "id": 198778, "time": "2017-05-14T15:40:20Z", "creator": "markt@apache.org", "creation_time": "2017-05-14T15:40:20Z", "text": "No further response from OP. Possible side effects of recent sendfile issues. Closing as fixed. Please reopen, with test case, if problem persists."}]