[{"count": 0, "tags": [], "bug_id": 60594, "text": "Using the protocol=\"HTTP/1.1\" connector (Coyote)\n\nAfter upgrading a site to Tomcat 7.0.73 from 7.0.72 or from anything earlier, a url with an unencoded { or } (ie. http://my.com?filter={\"search\":\"isvalid\"} ), now returns a 400 error code and logs the following error message:\n\n\"INFO: Error parsing HTTP request header\n Note: further occurrences of HTTP header parsing errors will be logged at DEBUG level.\njava.lang.IllegalArgumentException: Invalid character found in the request target. The valid characters are defined in RFC 7230 and RFC 3986\"\n\nResolution:\nSince this is a breaking change (aka regression failure), there should be an option to override and turn this off (still reporting the first occurrence as shown above), so that any existing site which experiences this can choose to ignore this failure and continue as before, so they can deal with changing their application at a later date, if they deem the security risk is appropriate.\n\nDefaulting the option to true (to enable the check) is perfectly fine, as long as there is an option in a server and/or application config file to disable it, and proper documentation on it.\n\nEither this, or you clearly state in the release notes of 7.0.73, exactly what will break, and recommend that users do not perform the Tomcat update, if they are not ready to change their applications to comply, but I think this would open up an even bigger can of worms.\n\nInstead of just saying:\n\"Add additional checks for valid characters to the HTTP request line parsing so invalid request lines are rejected sooner. (markt)\" - this tells us nothing about the impending doom we may face.\n\nBut, I would recommend just giving us the option to decide for ourselves.", "id": 196112, "time": "2017-01-17T02:33:11Z", "creator": "groskrg@versifit.com", "creation_time": "2017-01-17T02:33:11Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 60594, "text": "Given that using an unencoded '{' or '}' in a URL is contrary to the RFCs and that the fix that tightened the validation rules was in response to a security vulnerability (CVE-2016-6816) I think it is unlikely that an option will be introduced to make this validation optional.\n\nIt is quite likely that some sites could safely tolerate some characters. However, it is also likely that the 'safe' set of invalid characters will vary from site to site. That would therefore require a more complex configuration option than simply allowing or disallowing a fixed set of characters.\n\nThose interested in proposing a patch should look at lines 74-78 of org.apache.tomcat.util.http.parser.HttpParser although I'll repeat I think it is unlikely such a patch would be accepted.\n\nAll that code is static which means configuration via system properties - something I'd prefer to see less of rather than more of in Tomcat.\n\nFor completeness, '|' seems to be another character that is fairly widely used in unecoded form when it should be encoded.\n\nFinally, changes related conformance to the relevant RFCs and Java EE specifications are not treated as regressions. Therefore, I have moved this to an enhancement request.", "id": 196128, "time": "2017-01-17T22:28:23Z", "creator": "markt@apache.org", "creation_time": "2017-01-17T22:28:23Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "remm@apache.org", "text": "*** Bug 60616 has been marked as a duplicate of this bug. ***", "id": 196244, "time": "2017-01-20T13:21:45Z", "bug_id": 60594, "creation_time": "2017-01-20T13:21:45Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 60594, "text": "Created attachment 34684\npatch proposal\n\nIn response to the numerous complaints on the users list I decided to give this a shot. I added a system property which contains a blacklist that's used for validation of request targets rather than the long if statement that was there. If a users needs to allow unencoded | characters then they can just remove it from the blacklist defined in the tomcat.util.http.parser.HttpParser.blacklist property.\n\nIf this looks good to everyone I can push it to whichever versions of tomcat we want to allow an option for.", "id": 196501, "attachment_id": 34684, "creator": "csutherl@apache.org", "creation_time": "2017-01-27T18:42:03Z", "time": "2017-01-27T18:42:03Z", "is_private": false}, {"count": 4, "tags": [], "creator": "markt@apache.org", "text": "Allowing some of those (e.g. space) is extremely dangerous and should not be allowed under any circumstances.\n\nI generally dislike configuration via system property. That said, making this per Connector will be significantly more invasive.\n\nAny proposed patch needs to include documentation. That documentation needs to include a very large, very clear warning the deviating from the default is a security risk.\n\nIf this feature is implemented, I'd prefer to see the option to allow illegal characters limited to a much smaller sub-set.", "id": 196505, "time": "2017-01-27T19:46:19Z", "bug_id": 60594, "creation_time": "2017-01-27T19:46:19Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 60594, "text": "(In reply to Mark Thomas from comment #4)\n> I generally dislike configuration via system property. That said, making\n> this per Connector will be significantly more invasive.\n\nI agree on both points. The system property seemed to be the least invasive way to achieve the desired result.\n \n> Any proposed patch needs to include documentation. That documentation needs\n> to include a very large, very clear warning the deviating from the default\n> is a security risk.\n\nAlso agreed. Where would that documentation go?\n \n> If this feature is implemented, I'd prefer to see the option to allow\n> illegal characters limited to a much smaller sub-set.\n\nOther than space, which characters should absolutely be excluded in all cases? I can create a secondary list containing those and programmatically add them if a user tries to remove them from the blacklist.\n\nAlso, my initial patch used a whitelist instead of a blacklist so that the system property was either commented out by default, or contained a few characters that were the exception to the rule. I inversed it to a blacklist to remove some logic and make it perform better; do you think that a whitelist would work better here? I can provide that patch also.", "id": 196507, "attachment_id": null, "creator": "csutherl@apache.org", "creation_time": "2017-01-27T20:11:09Z", "time": "2017-01-27T20:11:09Z", "is_private": false}, {"text": "Hi, for my use cases I would like to have just a whitelist and let Tomcat handle all the RFC blacklisted chars automatically. In my case I had to whitelist curly braces and pipe.", "tags": [], "bug_id": 60594, "attachment_id": null, "count": 6, "id": 196510, "time": "2017-01-27T20:36:17Z", "creator": "eolivelli@gmail.com", "creation_time": "2017-01-27T20:36:17Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 60594, "text": "Created attachment 34687\nwhitelist patch proposal\n\nFor reference, and so I don't accidentally delete it :)", "id": 196511, "time": "2017-01-27T20:47:04Z", "creator": "csutherl@apache.org", "creation_time": "2017-01-27T20:47:04Z", "is_private": false, "attachment_id": 34687}, {"count": 8, "tags": [], "bug_id": 60594, "attachment_id": null, "id": 196512, "time": "2017-01-27T20:55:49Z", "creator": "markt@apache.org", "creation_time": "2017-01-27T20:55:49Z", "is_private": false, "text": "I think I prefer the whitelist option but I'd like to see it limited to - at this point - '{', '}' and '|'. Other characters can be considered on a case by case basis.\n\nDocumentation should go in the system properties section of the config docs although I'm still mulling over what a Connector config option might look like."}, {"count": 9, "tags": [], "bug_id": 60594, "attachment_id": 34694, "id": 196563, "time": "2017-01-30T14:54:33Z", "creator": "csutherl@apache.org", "creation_time": "2017-01-30T14:54:33Z", "is_private": false, "text": "Created attachment 34694\nwhitelist proposal limiting characters with docs\n\nOK, here's an updated whitelist patch restricting the characters that are accepted to '{', '}', and '|'. I also included documentation for the property.\n\nLet me know if that works better for you :)"}, {"count": 10, "tags": [], "creator": "markt@apache.org", "text": "Thanks for the updated patch. I like the overall design. Some detail comments:\n- I think a different name is required. We might want to override other restrictions in the future. Maybe requestTargetAllow \n- The docs need to state which characters are valid in the allowed list\n- What to do if some other invalid character is placed on the allowed list. Log a warning?\n- I'm still undecided on whether this should be per connector configuration\n\nWe also need to decide which versions to add this to. I currently thinking:\n- 7.0.x - yes\n- 8.0.x - yes\n- 8.5.x - maybe\n- 9.0.x - no", "id": 196591, "time": "2017-01-31T10:11:54Z", "bug_id": 60594, "creation_time": "2017-01-31T10:11:54Z", "is_private": false, "attachment_id": null}, {"count": 11, "tags": [], "bug_id": 60594, "attachment_id": null, "text": "Please fix it in Tomcat 8.5.X too", "id": 196592, "time": "2017-01-31T10:17:27Z", "creator": "eolivelli@gmail.com", "creation_time": "2017-01-31T10:17:27Z", "is_private": false}, {"count": 12, "tags": [], "creator": "csutherl@apache.org", "text": "Created attachment 34698\nUpdated patch proposal including a warning message for characters that aren't allowed\n\n(In reply to Mark Thomas from comment #10)\n> Thanks for the updated patch. I like the overall design. Some detail\n> comments:\n\nNo problem.\n\n> - I think a different name is required. We might want to override other\n> restrictions in the future. Maybe requestTargetAllow\n\nThat makes sense.\n\n> - The docs need to state which characters are valid in the allowed list\n\nAgreed.\n\n> - What to do if some other invalid character is placed on the allowed list.\n> Log a warning?\n\nI thought about that but since there isn't any logging there at the moment I let it go. I think it's a good idea to log a warning though, so I'll add that.\n\n> - I'm still undecided on whether this should be per connector configuration\n\nThat would be nice, but I haven't dug into the code enough to be able to quickly provide a patch for it.\n \n> We also need to decide which versions to add this to. I currently thinking:\n> - 7.0.x - yes\n> - 8.0.x - yes\n\n+1\n\n> - 8.5.x - maybe\n\nI'd vote yes on adding the option to 8.5.x because the stable version is already out and the behavior has changed. We obviously don't want to continue allowing broken clients to work, but I don't think we can change this behavior in a stable version, as evidenced by the users list complaints :)\n\n> - 9.0.x - no\n\n+1\n\nI also noticed that the property being parsed was including the quotes, so I changed the commented out example accordingly.", "id": 196611, "time": "2017-01-31T16:53:23Z", "bug_id": 60594, "creation_time": "2017-01-31T16:53:23Z", "is_private": false, "attachment_id": 34698}, {"count": 13, "tags": [], "creator": "eolivelli@gmail.com", "attachment_id": null, "id": 196762, "time": "2017-02-06T15:02:06Z", "bug_id": 60594, "creation_time": "2017-02-06T15:02:06Z", "is_private": false, "text": "Coty, the patch looks good to me, can you please add the following chars to the list of allowed characters ?\n\n'\\\"' (double quote)\n'#' (sharp)\n'<' (left angle bracket)\n'>' (right angle bracket)\n'\\\\' (backslash)\n'^' (accent)\n'`' (accent)\n\nI think in some case I would need the \"space\" too, but Mark remarked that is would be very dangerous"}, {"count": 14, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "id": 196763, "time": "2017-02-06T15:09:06Z", "bug_id": 60594, "creation_time": "2017-02-06T15:09:06Z", "is_private": false, "text": "You need to make a case for each of those to added to the potentially allowed list. Without any such justification, I am -1 on expanding it beyond the current three allowed characters."}, {"count": 15, "tags": [], "bug_id": 60594, "attachment_id": null, "id": 196764, "time": "2017-02-06T15:16:37Z", "creator": "eolivelli@gmail.com", "creation_time": "2017-02-06T15:16:37Z", "is_private": false, "text": "OK Mark at this moment I'm running a patch in production to make all the characters allowed.\n\nI have evidence only on troubles for curly braches and pipe characters so the patch looks good for me.\n\nI will wait for the release of this patch in an official 8.5.x Tomcat version and deploy it to production.\n\nIn case I need further characters a will create a new issue\n\n\nThank you"}, {"attachment_id": null, "tags": [], "bug_id": 60594, "text": "-1 as well for any additional characters. People who are that desperate to run into trouble can patch Tomcat easily.", "count": 16, "id": 196766, "time": "2017-02-06T15:36:15Z", "creator": "remm@apache.org", "creation_time": "2017-02-06T15:36:15Z", "is_private": false}, {"count": 17, "tags": [], "bug_id": 60594, "attachment_id": null, "id": 196768, "creation_time": "2017-02-06T16:23:52Z", "time": "2017-02-06T16:23:52Z", "creator": "csutherl@apache.org", "text": "OK, cool. So unless someone else objects to the patch as-is, I'll commit it to 7.0.x - 8.5.x shortly.", "is_private": false}, {"count": 18, "tags": [], "bug_id": 60594, "text": "Fixed in:\n\n- 8.5.x for 8.5.12 onwards\n- 8.0.x for 8.0.42 onwards\n- 7.0.x for 7.0.76 onwards", "id": 196824, "attachment_id": null, "creator": "csutherl@apache.org", "creation_time": "2017-02-07T18:33:01Z", "time": "2017-02-07T18:33:01Z", "is_private": false}, {"count": 19, "tags": [], "bug_id": 60594, "attachment_id": null, "id": 198811, "creation_time": "2017-05-18T07:42:52Z", "time": "2017-05-18T07:42:52Z", "creator": "zlulseged@hotmail.com", "text": "Hi\n\n We have found that we have problems with some characters that are not allowed in request URI and would like to know if any filter or valve can be applied to encode until clients get updated instead of responding with 400 Bad Request.\n\n We have millions of clients (both android and ios) that needs to follow the RFC but it will take time but until then there must be some work around that can be used.\n\nBR\nLulseged", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 60594, "text": "(In reply to Lulseged Zerfu from comment #19)\n> Hi\n> \n>  We have found that we have problems with some characters that are not\n> allowed in request URI and would like to know if any filter or valve can be\n> applied to encode until clients get updated instead of responding with 400\n> Bad Request.\n\nNo. The invalid request is rejected long before the execution reaches a Valve or Filter.\n\nAs described above, Tomcat 8.5.x and earlier have a configuration option to allow '{', '}' and '|'. If you want to add other characters to the possible whitelist values, you need to make a case for them.\n\n>  We have millions of clients (both android and ios) that needs to follow the\n> RFC but it will take time but until then there must be some work around that\n> can be used.\n\nRunning Tomcat behind a more lenient reverse proxy that encodes the invalid characters before the request is passed to Tomcat is another solution. You should be aware that generally, and for the same reasons Tomcat tightened request target parsing, other web servers will head in the same direction as Tomcat over time and start rejecting these requests.", "count": 20, "id": 198813, "time": "2017-05-18T08:40:54Z", "creator": "markt@apache.org", "creation_time": "2017-05-18T08:40:54Z", "is_private": false}, {"count": 21, "tags": [], "creator": "csutherl@apache.org", "attachment_id": null, "id": 198884, "time": "2017-05-25T14:27:33Z", "bug_id": 60594, "creation_time": "2017-05-25T14:27:33Z", "is_private": false, "text": "Can anyone see any adverse affects to adding angle brackets to the whitelist? I have a customer that is using unencoded angle brackets around their session IDs in the URL which they can't change at this point and the CVE fix broke their application. If there aren't any adverse affects I'll add them to the list for my distribution, and to tomcat if anyone else needs them."}, {"count": 22, "tags": [], "bug_id": 60594, "text": "You mean '<' and '>' ?\n\nThere is always the risk that unexpected reverse proxy behaviour will trigger a CVE-2016-6816 like issue but that risks exists for any white-listed character that should really be encoded.\n\nI don't see it affecting the URL parsing in Tomcat.\n\nIf the undecoded URL is used in any XML like output it is likely to break it. But any user that is using '<' and '>' will be facing that problem already.\n\nThey look to be higher risk in terms of breaking stuff, but not in a security sense.\n\n+1 to your approach.", "id": 198890, "attachment_id": null, "creator": "markt@apache.org", "creation_time": "2017-05-25T18:35:43Z", "time": "2017-05-25T18:35:43Z", "is_private": false}, {"count": 23, "tags": [], "bug_id": 60594, "attachment_id": null, "id": 198891, "time": "2017-05-25T19:17:30Z", "creator": "csutherl@apache.org", "creation_time": "2017-05-25T19:17:30Z", "is_private": false, "text": "(In reply to Mark Thomas from comment #22)\n> You mean '<' and '>' ?\n\nYes.\n \n> There is always the risk that unexpected reverse proxy behaviour will\n> trigger a CVE-2016-6816 like issue but that risks exists for any\n> white-listed character that should really be encoded.\n> \n> I don't see it affecting the URL parsing in Tomcat.\n> \n> If the undecoded URL is used in any XML like output it is likely to break\n> it. But any user that is using '<' and '>' will be facing that problem\n> already.\n> \n> They look to be higher risk in terms of breaking stuff, but not in a\n> security sense.\n> \n> +1 to your approach.\n\nOK, cool. Would we want to add them to tomcat then? It's a small code change, so I have no problems with Fedora/RHEL diverging a bit here if we don't want them."}, {"count": 24, "tags": [], "bug_id": 60594, "attachment_id": null, "id": 199100, "time": "2017-06-08T07:13:27Z", "creator": "zlulseged@hotmail.com", "creation_time": "2017-06-08T07:13:27Z", "is_private": false, "text": "Hi\n\n A reverse proxy is not an option and I would like to make a case where we allow double quotes in request URLs as '{', '}' and '|' are allowed today by configuring:\n\ntomcat.util.http.parser.HttpParser.requestTargetAllow=\"\n\nHow can I make this a case?\n\nBR\nLulseged Zerfu"}, {"count": 25, "tags": [], "creator": "markt@apache.org", "text": "I'm neutral on adding '<' and '>' as allowed options.\n\nI think '\"' is in the same category. i.e. there is the risk that unexpected reverse proxy behaviour will trigger a CVE-2016-6816 like issue, no parsing issues and likelihood of breakage if the URL is used in HTML or similar without escaping.", "id": 199101, "time": "2017-06-08T08:32:52Z", "bug_id": 60594, "creation_time": "2017-06-08T08:32:52Z", "is_private": false, "attachment_id": null}, {"count": 26, "tags": [], "bug_id": 60594, "attachment_id": null, "text": "Hi\n\n We don't see anyway out when millions of terminals are not working and that tomcat restricted '\"' from being a part of request URL.\n\n Terminals will not comply overnight but are starting to comply slowly. Therefore we need to allow '\"' under some transitional period before totally disallow the '\"' char in a request URL.\n\n Staying on tomcat version 8.0.36 still risky because CVE-2016-6816 can be triggered.\n\nBR\nLulseged Zerfu", "id": 199102, "time": "2017-06-08T09:56:33Z", "creator": "zlulseged@hotmail.com", "creation_time": "2017-06-08T09:56:33Z", "is_private": false}, {"count": 27, "tags": [], "bug_id": 60594, "text": "Hi\n\n Any comment if you will add '\"' to allow in our request URL? Ta the end of the day we are taking the risk.\n\nBR\nLulseged", "id": 199160, "attachment_id": null, "creator": "zlulseged@hotmail.com", "creation_time": "2017-06-12T07:48:39Z", "time": "2017-06-12T07:48:39Z", "is_private": false}, {"text": "Hi\n\n Let us know if tomcat will add the '\"' as '{', '}' and '|' are added to let us continue using latest tomcat releases.\n\n Please let us know what you think.\n\nBR\nLulseged", "tags": [], "bug_id": 60594, "attachment_id": null, "count": 28, "id": 199308, "time": "2017-06-21T06:39:31Z", "creator": "zlulseged@hotmail.com", "creation_time": "2017-06-21T06:39:31Z", "is_private": false}, {"count": 29, "tags": [], "bug_id": 60594, "attachment_id": null, "id": 201132, "time": "2017-09-25T20:33:43Z", "creator": "jeffk@quotemedia.com", "creation_time": "2017-09-25T20:33:43Z", "is_private": false, "text": "I would like to ask for the ^ character. I'm not sure how to make a case for this. Its kind of important for us because we have been using this to denote financial indexes (similar to yahoo finance) and we have a large number of client installs that would all have to change to enforce uri encoding.\n\nThis is basically holding up our migration to Tomcat.\n\nI think it would be preferable if we could select whatever characters we want to override. Its our site and we are the ones responsible for the security and functionality. Every entity that uses Tomcat might need different characters for different reasons. It would be easier to transition if they had access to an override. Clearly the default should be to override nothing but some sites are going to need this or that character to transition.\n\nI could ask to have our clients url encode everything but realistically that could take years to complete.\n\nI would prefer that this exemption be extended rather that having to hack the code base on our own as security updates would be more timely."}]