[{"count": 0, "tags": [], "bug_id": 60639, "attachment_id": null, "text": "I am setting Cache-Control in the httpd.conf where i also have Mellon SSO Configuration. I am getting two cache-control included in the response headers. So i have commented out the MellonEnable \"info\" and restarted the apache. Now my Cache-Control got reflected and now it is only mine. But this is not an exact solution to turn off/override the cache-control, so i find out that there is an option that controls whether the Cache-control header is sent back in responses in Mellon configuration.\n\nSo i have given MellonSendCacheControlHeader Off in the conf file, but the apache is throwing issue like \"Invalid command 'MellonSendCacheControlHeader', perhaps misspelled or defined by a module not included in the server configuration\"\n\nCan someone help why i am getting this issue and how to fix this ?", "id": 196385, "time": "2017-01-25T05:34:54Z", "creator": "ilayarajavs@gmail.com", "creation_time": "2017-01-25T05:34:54Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 60639, "attachment_id": null, "text": "Concerning MellonSendCacheControlHeader: that directive has not yet been implemented in mod_auth_mellon. It was suggested here:\n\nhttps://github.com/UNINETT/mod_auth_mellon/issues/2\n\nand there is a patch available here:\n\nhttps://github.com/UNINETT/mod_auth_mellon/pull/98\n\nIf you want to discuss this directive, you must proceed with the mod_auth_mellon project.\n\nConcerning duplicate headers: this will depend on how you set your own header and also on the order which module sets the header first. Since this is a typical user question, please post this part of your question to the httpd users mailing list giving specific details and do not proceed the discussion here. I will close this ticket as invalid. It can be reopened once the discussion on the users list shows that there might be a bug, but currently there is no indication for it.\n\nOn how to access the httpd users list please have a look at:\n\nhttp://httpd.apache.org/lists.html#http-users\n\nRegards,\n\nRainer", "id": 196389, "time": "2017-01-25T09:37:24Z", "creator": "rainer.jung@kippdata.de", "creation_time": "2017-01-25T09:37:24Z", "is_private": false}]