[{"attachment_id": 34681, "tags": [], "creator": "ardel.grider@elhtc.com", "is_private": false, "count": 0, "id": 196461, "time": "2017-01-26T16:59:17Z", "bug_id": 60651, "creation_time": "2017-01-26T16:59:17Z", "text": "Created attachment 34681\nThis is the file that crashes.\n\nI am having a crashing issue with excel after I add a auto filter thru java. After adding the filter to excel columns if I open the excel sheet and attempt to sort, using the drop down arrow on the column header, it crashes every time. If I first filter, like unchecking the blanks option from the drop down, then I can sort and use the sheet like normal with no crashes. If I try to sort using the Sort & Filter button in the editing section at the top of excel it will sort just fine but remove the auto filter. Also if I remove and re-add the filter it doesn't crash and works as expected. Is there a way to make it to where we can add the auto filter thru java then be able to sort before making any other changes to the sheet? I have pasted my code below and I have attached both the excel sheet that is create thru java and pre and post fixing it.\n\n\nFileInputStream fileIn = new FileInputStream(\"C:\\\\Users\\\\gria\\\\Desktop\\\\Fleet Manager Summary.xls\");\n\t\t\tHSSFWorkbook report = new HSSFWorkbook(fileIn);\n\t\t\t\n\t\t\tSheet sheet = report.getSheetAt(0);\n\t\t\tsheet.setAutoFilter(CellRangeAddress.valueOf(\"A5:O5\"));\n\t\n\t\t\tFileOutputStream fileOut = new FileOutputStream(\"C:\\\\Users\\\\gria\\\\Desktop\\\\Fleet Manager SummaryT.xls\");\n\t\t\treport.write(fileOut);\n\t\t\treport.close();\n\t\t\tfileOut.close();\n\t\t\tfileIn.close();"}, {"count": 1, "tags": [], "bug_id": 60651, "attachment_id": 34682, "text": "Created attachment 34682\nThis is the file where I removed and added the auto filter", "id": 196462, "time": "2017-01-26T17:00:10Z", "creator": "ardel.grider@elhtc.com", "creation_time": "2017-01-26T17:00:10Z", "is_private": false}, {"count": 2, "tags": [], "creator": "apache@gagravarr.org", "text": "If POI is generating a file that Excel gives warnings or errors about, that's something to report here first\n\nIf POI is generating a file that makes Excel crash, then that's something you need to report to Microsoft! They generally are quite keen to make fixes that avoids their software crashing, especially as some crashes may turn out to have security implications above and beyond the DoS effects of the crash.\n\nWe can certainly take a look at the issue on the POI side, especially if we can find out what specific bit Excel dislikes, but talking to Microsoft needs to be your top priority here!", "id": 196463, "time": "2017-01-26T17:02:28Z", "bug_id": 60651, "creation_time": "2017-01-26T17:02:28Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 60651, "attachment_id": null, "text": "Thank you for the quick reply. I have went to Microsoft's community page and posted about the crash as of now. Link: https://answers.microsoft.com/en-us/msoffice/forum/msoffice_excel-mso_other/why-is-this-excel-file-created-from-my-java-code/358e5a35-db8d-46cc-96ed-b9252a29c526?tm=1485456007886", "id": 196464, "time": "2017-01-26T18:42:44Z", "creator": "ardel.grider@elhtc.com", "creation_time": "2017-01-26T18:42:44Z", "is_private": false}]