[{"count": 0, "tags": [], "bug_id": 60667, "text": "Request : https://<server>:<port>/META-INf./template.mf\nResponse : Content of template.mf\n\n\nHere the tomcat URL filter for restricting access to META-INF and WEB-INF can be evaded using a \".\" in the end of the directory-name and one keeping at least one character lowercase.", "id": 196574, "time": "2017-01-31T03:34:12Z", "creator": "adarshdinesh@gmail.com", "creation_time": "2017-01-31T03:34:12Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 60667, "is_private": false, "id": 196581, "creation_time": "2017-01-31T08:26:59Z", "time": "2017-01-31T08:26:59Z", "creator": "markt@apache.org", "text": "Tomcat correctly returns a 404 for such requests.\n\nI suspect the root cause here is a poorly configured reverse proxy.\n\nAlso, vulnerability reports should NOT be made via a public bug tracker. The correct process is described at http://tomcat.apache.org/security.html", "attachment_id": null}, {"count": 2, "tags": [], "creator": "apache@soref.com", "attachment_id": null, "text": "mark: did you test on Windows? the `.` behavior is a Windows thing. Case folding could also happen on macOS.\n\n(I'm not endorsing the bug, just guessing about how this could be. And I don't have a tomcat instance handy to test.)", "id": 196655, "time": "2017-02-02T07:00:08Z", "bug_id": 60667, "creation_time": "2017-02-02T07:00:08Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 60667, "attachment_id": null, "id": 196658, "creation_time": "2017-02-02T08:59:50Z", "time": "2017-02-02T08:59:50Z", "creator": "markt@apache.org", "text": "(In reply to Josh Soref from comment #2)\n> mark: did you test on Windows?\n\nYes, the tests included Windows.\n\n> the `.` behavior is a Windows thing.\n\nNot with Tomcat it isn't. The '.' is enough to always trigger a 404 unless there actually is a directory with that name. I also tested without the '.'.\n\n> Case folding could also happen on macOS.\n\nTomcat has code that explicitly prevents this on any case insensitive file system. It can be disabled if allowLinking is set to true but that is why there is a huge security warning in the docs about enabling that on case insensitive file systems.\n\n> (I'm not endorsing the bug, just guessing about how this could be. And I\n> don't have a tomcat instance handy to test.)\n\nAs I previously stated, the behaviour described looks like a poorly configured reverse proxy.", "is_private": false}]