[{"attachment_id": null, "tags": [], "creator": "manmedia@gmail.com", "text": "Hi,\n\nSince the upgrade to 8.0.39 from 8.0.29 I cannot debug into any JSPs. My debug args for standalone tomcat is the following:\n\nset DEBUG_ARGS=-Xdebug -Djava.compiler=NONE -Xrunjdwp:transport=dt_socket,server=y,suspend=n,address=5005\n\n\nI have had no issues with the older versions, and compared my code base to confirm that this is the tomcat upgrade which changed the behaviour. Is there any particular setting that I need to turn on/off?", "count": 0, "id": 196809, "time": "2017-02-07T11:30:43Z", "bug_id": 60702, "creation_time": "2017-02-07T11:30:43Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 60702, "attachment_id": null, "is_private": false, "id": 196930, "time": "2017-02-11T10:25:02Z", "creator": "violetagg@apache.org", "creation_time": "2017-02-11T10:25:02Z", "text": "Hi,\n\nI tested with Tomcat 8.0.41 and a simple jsp. The debugging was working as expected.\n\nCan you test with Tomcat 8.0.41 and if the issue still occurs, please provide a reproducible scenario.\n\nThanks,\nVioleta"}, {"count": 2, "tags": [], "bug_id": 60702, "text": "This works for me as well with a clean 8.0.x build.\n\nAll the indications are that this is a configuration problem. The users list is the place to seek further help.", "id": 196993, "time": "2017-02-14T11:24:30Z", "creator": "markt@apache.org", "creation_time": "2017-02-14T11:24:30Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "creator": "manmedia@gmail.com", "text": " (In reply to Mark Thomas from comment #2)\n> This works for me as well with a clean 8.0.x build.\n> \n> All the indications are that this is a configuration problem. The users list\n> is the place to seek further help.\n\nI have specifically mentioned 8.0.39. Using 8.0.x as your example isn't valid. Try and check with 8.0.39 because I know that it stopped working immediately after I switched from 8.0.29. I have made no configuration changes which will trigger this and I have 100 developers working for me, who all have the same problems. I am sure this is not a user configuration. \n\nAdditionally, if you read Violeta's comment, she confirmed that 8.0.41 doesn't have any issue. My point is that the developers should not need to change any configuration as such when upgrading just to make normal things such as debugging work. If this needs to be done, then this hasn't been communicated in any user guide or list.", "count": 3, "id": 197018, "time": "2017-02-14T22:51:04Z", "bug_id": 60702, "creation_time": "2017-02-14T22:51:04Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 60702, "text": "Hi,\n\n8.0.39 is released and if it has this problem then it cannot be fixed in 8.0.39!\nIt can be fixed in the next release!\nBut Violeta already said that there is no such issue in 8.0.41 so there is nothing to be done by Tomcat developers! You (and your team) should upgrade to 8.0.41 (or 8.5.11).", "id": 197019, "time": "2017-02-14T23:03:21Z", "creator": "mgrigorov@apache.org", "creation_time": "2017-02-14T23:03:21Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 60702, "is_private": false, "text": "JSP debugging works perfectly with a clean 8.0.39 build as well. In addition, a review of the changelog identifies no relevant changes in this area and there have been no other reports of similar issues.\n\nAll the indications are that this is a configuration problem. And the place to get help with that is the users list.", "id": 197027, "time": "2017-02-15T09:20:05Z", "creator": "markt@apache.org", "creation_time": "2017-02-15T09:20:05Z", "attachment_id": null}]