[{"count": 0, "attachment_id": null, "bug_id": 60725, "is_private": false, "id": 196932, "time": "2017-02-11T13:46:58Z", "creator": "sebb@apache.org", "creation_time": "2017-02-11T13:46:58Z", "tags": [], "text": "Some of the test cases make assumptions about how long a Thread.sleep() will take.\n\nHowever this can vary between systems due to timer granularity and how busy the system is.\n\nIf the assumptions are wrong, then the test may fail unless the variation is allowed for.\n\nOne way to do this is to allow a margin of error in the assertion.\n\nHowever if a system runs very slowly then the error margin may have to be increased so much for the test to pass that it no longer catches broken code.\n\nThis is/was the approach taken in many of the unit tests.\n\nAn alternative is to measure the actual sleep times, and calculate the expected result accordingly.\n\nThis is what has been done in\n\nhttp://svn.apache.org/viewvc?rev=1782600&view=rev\n\nand\n\n http://svn.apache.org/viewvc?rev=1782321&view=rev\n\nNote that not all Thread.sleep() instances affect the outcome of tests.\nCare must be taken to ensure that the test will still fail if the code is broken, i.e. which sleeps are relevant to the test result.\n\nOther sleeps may be necessary to ensure the test is working, but may not directly affect the result.\n\nIn the case of TestSampleResult.testPauseTrue(), two of the sleeps represent the sampler doing work, and another is the pause time where the sampler is not supposed to record the time.\n\nAll 3 sleeps are necessary, but the pause time is not directly relevant as long as it is long enough to ensure that the test would fail if the sampler calculation were incorrect. e.g. if the pause time was too short (or zero) then the test would not show that the sampler was correctly ignoring the time spent in the paused state.\n\nI fixed the two recent examples where recent CI tests failed, but there are probably some more lurking."}, {"count": 1, "attachment_id": null, "bug_id": 60725, "is_private": false, "id": 197269, "time": "2017-02-25T14:21:52Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2017-02-25T14:21:52Z", "tags": [], "text": "hi sebb,\nCan we close this one ? \nAs issue seems to be fixed after move of nightly to another machine ?\nThanks"}, {"count": 2, "tags": [], "text": "Fixed by a move of Jenkins agent to another host.", "attachment_id": null, "bug_id": 60725, "id": 200601, "time": "2017-09-02T19:21:34Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2017-09-02T19:21:34Z", "is_private": false}]