[{"count": 0, "tags": [], "bug_id": 60779, "text": "Created attachment 34782\nClean Logs Feature integration in options menu\n\nHello,\n\nCould you please add new configurable feature into JMeter GUI, enabling possibility to clean logs in Log Viewer console automatically before test execution?\n\nMotivation:\nWhile debugging new test plans, I often end in a situation, where I was unable to clearly distinguish log entries from actual test run and previous attempts.\nThis new feature (when enabled) will clean log entries before test execution, so the logs you see after the test is done relates just to one particular attempt.\n\n\nUse case description:\n1)\tUser enabled \"log clean feature\" in JMeter options menu\n2)      User clicks on “Start” button\n3)\tLog Viewer console entries are cleaned (if there were any from previous runs)\n4)\tTest execution continues usual way\n\n\nWhen the feature is disabled, Log viewer contains logs from all tests played as it is for now..\n\nExample how this feature can be integrated into GUI in attached screenshot.\n\nThanks a lot.\n\nL.", "id": 197300, "time": "2017-02-27T13:34:42Z", "creator": "luborpetr@gmail.com", "creation_time": "2017-02-27T13:34:42Z", "is_private": false, "attachment_id": 34782}, {"count": 1, "tags": [], "bug_id": 60779, "attachment_id": null, "id": 197326, "time": "2017-02-28T21:19:28Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2017-02-28T21:19:28Z", "is_private": false, "text": "Hello,\nThis is already possible :\n\n- By double clicking on the Warning icon in upper right\n\n- Or by CTRL+E which clears it as long as all listeners\n\nRegards"}, {"count": 2, "tags": [], "creator": "luborpetr@gmail.com", "text": "(In reply to Philippe Mouawad from comment #1)\n> Hello,\n> This is already possible :\n> \n> - By double clicking on the Warning icon in upper right\n> \n> - Or by CTRL+E which clears it as long as all listeners\n> \n> Regards\n\nHello Philippe,\n\nYes, you can manually click on that button or use hot keys.\n\nWhat I would like to have is an option to call this cleaning automatically, when the \"start test\" button is pressed.\n\nHow it works now:\n1) Press \"Clean\" button - to ensure that what I see are just relevant logs\n2) Press \"Start the test\n\nWhat I would like to have:\n1) Press \"Start\", the logs are cleaned (when the automatic clean option is enabled)\n\nIt's just about removal of one annoying manual step, I have to do before each test run..\n\nIs it possible?", "id": 197330, "time": "2017-02-28T22:36:00Z", "bug_id": 60779, "creation_time": "2017-02-28T22:36:00Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 200600, "time": "2017-09-02T19:20:47Z", "bug_id": 60779, "creation_time": "2017-09-02T19:20:47Z", "is_private": false, "text": "Introducing another option for this seems too much for me.\nThis behavior might not suit everybody, I frequently find myself comparing 2 runs and I would be annoyed for example by this feature.\nThere is a shortcut which allows this on demand, so there is no loss of time IMO.\nClosing as WONTFIX"}]