[{"count": 0, "tags": [], "bug_id": 60786, "text": "Created attachment 34785\nPatch containing modifications of SXSSFSheet and SXSSFWorkbook\n\nHello,\n\nActually if you want to create a pivot table from data stored in a large SXSSFSheet (too large for XSSFSheet) you will get an exception, because row containing pivot header is vanished from memory, you can't access it. With this patch first rows are kept in memory permanently, so  creating pivot table won't cause exception anymore.\n\nI'v added a new constructor to SXSSFWorkbook which will activate this behaviour.\n\npublic SXSSFWorkbook(int rowAccessWindowSize, int rowAccessFixedTop)\n\nSecond parameter determine how many rows will be kept in memory at the top of the table. The pivot header should be in this area. \n\nExample: if your header in the 10th row, than you should call constructor with rowAccessFixedTop >= 10 to keep it in memory for pivot table creation.\n\nI hope it's useful for anybody else too.\n\nRegards,\nAttila", "id": 197314, "time": "2017-02-28T15:05:51Z", "creator": "benko.attila@freemail.hu", "creation_time": "2017-02-28T15:05:51Z", "is_private": false, "attachment_id": 34785}, {"count": 1, "tags": [], "bug_id": 60786, "text": "Thanks for the patch, any chance of a unit-test that verifies these changes so they stay in place correctly in the future?", "id": 197799, "time": "2017-03-19T08:46:42Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2017-03-19T08:46:42Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "benko.attila@freemail.hu", "attachment_id": null, "id": 197971, "time": "2017-03-24T13:24:08Z", "bug_id": 60786, "creation_time": "2017-03-24T13:24:08Z", "is_private": false, "text": "(In reply to Dominik Stadler from comment #1)\n> Thanks for the patch, any chance of a unit-test that verifies these changes\n> so they stay in place correctly in the future?\n\nHello,\n\nactually I haven't created any, because I don't know what should I do exactly. Should I create one?"}]