[{"count": 0, "tags": [], "bug_id": 60802, "is_private": false, "text": "The Tomcat specific javadoc for Servlet 3.1 is not synced with the official Servlet spec 3.1 properly.\n\nSee https://github.com/apache/tomcat85/blob/trunk/java/javax/servlet/http/Part.java#L88-L90\n\nThe official spec says ...\n\nhttp://docs.oracle.com/javaee/7/api/javax/servlet/http/Part.html#write-java.lang.String-\n\nThe use of Part.write(String) is always relative to the MultiPartConfig.location, its never absolute.\n\nIssue https://bz.apache.org/bugzilla/show_bug.cgi?id=54203 attempted to fix this.\n\nResulting in commit\n\nhttps://github.com/apache/tomcat85/commit/073b311fd4f5650c68a0c61f9baf4d195775405a\n\nwhich looks like you pulled a draft version of the Part javadoc, not the official final version.", "id": 197389, "time": "2017-03-02T13:28:35Z", "creator": "joakime@apache.org", "creation_time": "2017-03-02T13:28:35Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 60802, "attachment_id": null, "text": "It is not just the javadoc.\nAlso the behavior is different - when a File with an absolute path is passed it is used as is. When a file with relative path is passed then the config location is used as a parent.\n\nHonestly I do like this behavior!\nBut I guess it should be removed since it is against the spec.", "id": 197390, "time": "2017-03-02T13:35:53Z", "creator": "mgrigorov@apache.org", "creation_time": "2017-03-02T13:35:53Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 60802, "attachment_id": null, "text": "Tomcat can't copy the Javadoc verbatim from the reference implementation due to licencing. It is different for the text the Sun contributed back when Tomcat was the reference implementation but that doesn't apply here.\n\nI don't see any text in the referenced Javadoc that says \"The use of Part.write(String) is always relative to the MultiPartConfig.location, its never absolute.\" Where is this requirement coming from?\n\nMy reading of the Javadoc is that Tomcat's implementation is spec compliant.", "id": 197392, "time": "2017-03-02T15:15:37Z", "creator": "markt@apache.org", "creation_time": "2017-03-02T15:15:37Z", "is_private": false}, {"count": 3, "tags": [], "creator": "joakime@apache.org", "text": "Glassfish, Resin, and Jetty implement it according to the javadoc.\n\nIt's always relative to the MultiPartConfig.location\n\nGlassfish calls that location 'repository' see PartItem.java\n\nJetty calls that location `_tmpDir` see MultiPartInputStreamParser.MultiPart\n\nResin calls that location `location` see HttpServletRequestImpl.PartImpl\n\nUndertow implements it according to your interpretation (they seem to have followed your lead).\n\nThe official servlet spec 3.1 final pdf also makes no statement on the behavior of that method.  Only that the MultiPartConfig.location must have a value, and it goes through the default value and how to interpret the setting that the user has provided.\n\nI have no access to the Servlet TCK to confirm the behavior in there.\nBut seeing as Glassfish interprets it the same way as the javadoc, I would probably guess that the odds on the Glassfish/Resin/Jetty interpretation is the correct way.\n\nPerhaps this needs a SERVLET_SPEC jira issue opened on it?", "id": 197400, "time": "2017-03-02T19:23:01Z", "bug_id": 60802, "creation_time": "2017-03-02T19:23:01Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 60802, "attachment_id": null, "text": "I thought this had been discussed a little before\n\nhttps://bz.apache.org/bugzilla/show_bug.cgi?id=54971#c3\n\nFrom (rather hazy) memory, the reason for that was that Commons File Upload allowed absolute paths and Tomcat allowing it here eased the migration path.\n\nI'll add that the spec doesn't say how to handle the application passing an absolute path. You could make the case that the behaviour is undefined and in that case and the container is free to do as it chooses. Equally, you could argue anything that isn't a relative file name is an error that should trigger an IOException. At the extreme, you could argue anything that isn't a pure filename with no path is an error.\n\nI don't see any discussion around this particular point in the Servlet EG. Now is certainly the time to open an issue if you'd like clarification since the EG is fairly active at the moment.", "id": 197407, "time": "2017-03-02T22:00:03Z", "creator": "markt@apache.org", "creation_time": "2017-03-02T22:00:03Z", "is_private": false}]