[{"count": 0, "tags": [], "text": "In our setup we have global security enabled, and we're using Spring Security with a pre-authenticated scenario in the web application.\nWe're seeing a (very likely platform-indepedent) issue with unexpected javax.security.auth.Subject instances and unexpected java.security.Principal instances contained in those Subject instances. We see each request exposes a new Subject instance, and under load (same user session, concurrent requests) a Principal created by Spring is present in the set of principals of the Subject instance, whilst the Tomcat-managed one is not present.\n\nThe problem has been observed on Linux and Windows. We're using the following Java versions:\n- Linux: Java(TM) SE Runtime Environment (build 1.8.0_60-b27)\n- Windows: Java(TM) SE Runtime Environment (build 1.8.0_31-b13)\n\nTomcat Connector\nLinux:  <Connector URIEncoding=\"UTF-8\" scheme=\"http\" protocol=\"HTTP/1.1\" connectionTimeout=\"20000\" port=\"...\"/>\nWindows: Embedded Tomcat 7.0.47 via Maven Tomcat plugin\n\nTomcat is not used behind Apache HTTPD or any other web server.\n\nWe have debugged the issue and believe the cause lies in org.apache.catalina.connector.Request.setUserPrincipal(Principal)\nThe code in this method tries to cache the Subject in the user session, but (accidentally?) removes it from the session at the beginning of every request.\nThis is because the variable \"subject\" is always \"null\" when \"session.setAttribute(Globals.SUBJECT_ATTR, subject);\" is called, unless the session did not carry a subject yet.\n\nFurther code in Tomcat uses the session to obtain and cache the Subject in the session, e.g. org.apache.catalina.security.SecurityUtil.execute(Method, Object, Object[], Principal). In there, if no Subject is found in the session, a new instance is created with the Principal of the current request, stored in the session and used as the current JAAS subject.\nConcurrent requests from the same user session may cause race conditions, as the Subject is removed from the session but also cached by these parts of the code.\n\nWe have created a simple reproduceable test, see below, which verifies that the Tomcat-managed principal is found in the Principal set of the current Subject. In error cases, only a Spring-managed Principal is found.\nIn our actual real-life case, our code relies on Principal objects created by a custom login module, which are sometimes not found, thus causing the real application to fail.\n\nOverview\nIf global security is enabled and a session exists, the Subject is removed from the session at the beginning of each request.\n\nReproducer\nFind details and how to run at https://github.com/smurf667/test-tomcat-broken-subject\nThe test setup uses an integration test with an embedded Tomcat to send a number of concurrent requests for a single user session.\nA Spring filter in the application makes sure that a Tomcat-managed Principal created is present in the subject. If not, the application fails.\n\nExpected: The Subject present for each request of the same user session contains a Tomcat-managed Principal.\nActual: Sometimes the Subject only contains a Spring-managed Principal.\n\nWe're suggesting a potential fix for the issue in the README.md of the repository.\nAs we're no experts, we leave it to the person handling our bug report to judge if the fix is appropriate or not (we believe so). Please ask if you have any further questions, thanks!\n\nKind regards,\nSebastian Hähnel (sebastian.haehnel@gmail.com) and Jan Engehausen (smurf667@gmail.com)", "attachment_id": null, "id": 197485, "creator": "smurf667@gmail.com", "time": "2017-03-06T16:53:49Z", "bug_id": 60824, "creation_time": "2017-03-06T16:53:49Z", "is_private": false}, {"count": 1, "tags": [], "creator": "chuck.caldarale@unisys.com", "attachment_id": null, "text": "Tomcat 7.0.47 is over three years old, and many, many changes have gone in since then.\n\nPlease update to a current version of Tomcat and see if the problem persists.", "id": 197488, "time": "2017-03-06T17:15:26Z", "bug_id": 60824, "creation_time": "2017-03-06T17:15:26Z", "is_private": false}, {"count": 2, "tags": [], "text": "Hi Chuck,\n\nI understand. We're seeing this in production with 7.0.54, and have a standalone reproduceable scenario with 7.0.47 (embedded). We believe the issue to be in org.apache.catalina.connector.Request.setUserPrincipal(java.security.Principal) and looking at the code of 7.0.63 or 8.0.24 it seems to be still in there as well.\n\nhttp://grepcode.com/file/repo1.maven.org/maven2/org.apache.tomcat/tomcat-catalina/7.0.63/org/apache/catalina/connector/Request.java#Request.setUserPrincipal%28java.security.Principal%29\n\nhttp://grepcode.com/file/repo1.maven.org/maven2/org.apache.tomcat/tomcat-catalina/8.0.24/org/apache/catalina/connector/Request.java#Request.setUserPrincipal%28java.security.Principal%29\n\nKind regards,\nJan", "attachment_id": null, "id": 197489, "creator": "smurf667@gmail.com", "time": "2017-03-06T17:25:53Z", "bug_id": 60824, "creation_time": "2017-03-06T17:25:53Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 60824, "text": "I've now upgrade the reproduceable scenario to use Tomcat 7.0.63. The problem also manifests in this version.\n\nKind regards,\nJan", "id": 197490, "time": "2017-03-06T17:51:30Z", "creator": "smurf667@gmail.com", "creation_time": "2017-03-06T17:51:30Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "chuck.caldarale@unisys.com", "attachment_id": null, "text": "(In reply to Jan Engehausen from comment #3)\n> I've now upgrade the reproduceable scenario to use Tomcat 7.0.63. The\n> problem also manifests in this version.\n\n7.0.63 is still over 1.5 years old.  Please try with the _current_ release (7.0.75).", "id": 197491, "time": "2017-03-06T19:11:11Z", "bug_id": 60824, "creation_time": "2017-03-06T19:11:11Z", "is_private": false}, {"count": 5, "tags": [], "creator": "smurf667@gmail.com", "attachment_id": null, "text": "I've update the demonstration to use 7.0.75. The problem is showing.", "id": 197492, "time": "2017-03-06T19:20:34Z", "bug_id": 60824, "creation_time": "2017-03-06T19:20:34Z", "is_private": false}, {"count": 6, "tags": [], "creator": "markt@apache.org", "text": "Confirmed. The current code is affected.\n\nI do wonder if Request.subject is required although I can think of some (slightly odd) use cases where it might be.\n\nFixed in:\n- trunk for 9.0.0.M18 onwards\n- 8.5.x for 8.5.12 onwards\n- 8.0.x for 8.0.42 onwards\n- 7.0.x for 7.0.76 onwards", "id": 197494, "attachment_id": null, "bug_id": 60824, "creation_time": "2017-03-06T20:50:49Z", "time": "2017-03-06T20:50:49Z", "is_private": false}, {"count": 7, "tags": [], "bug_id": 60824, "text": "Hey guys, most impressive! THANK YOU!\n\nRegards,\nJan", "id": 197495, "time": "2017-03-06T20:54:20Z", "creator": "smurf667@gmail.com", "creation_time": "2017-03-06T20:54:20Z", "is_private": false, "attachment_id": null}]