[{"attachment_id": null, "tags": [], "bug_id": 60847, "text": "It has separate methods to get lists of all the different chart types it could possibly contain.  These have many overlapping/common properties.  It is really annoying to have to write code that explicitly names each list and calls the proper getXYZChartList() method, then call the same getTitle() method on each one, typed explicitly.\n\nThere should be a common interface defining the common properties, perhaps even a hierarchy of interfaces, and chart/plot wrapper/handler class, at least for XSSF, if not common with HSSF, that can return a List of all the charts as implementations of the common interface(s) defining all the common methods/properties.\n\nCallers could still get at the underlying explicit types, but in many instances wouldn't care, and this would remove the need for a lot of boilerplate in consumer code.\n\n(I'm looking in particular at Vaadin Spreadsheet Charts, and the gyrations they had to go through to get chart definitions out of POI).", "count": 0, "id": 197606, "time": "2017-03-12T04:17:59Z", "creator": "gwoolsey@apache.org", "creation_time": "2017-03-12T04:17:59Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 60847, "text": "The CT classes are auto-generated from the official OOXML schemas. They therefore can't really be changed (and only properly changed with a time machine and a seat on the specification committee...)\n\nWe generally shouldn't be exposing any CT classes through to end users, these should normally be wrapped up in friendly POI classes. If there's some missing, we should add that class, deprecate the raw CT class access, and possibly do some magic in our classes with xml processing to keep things common (if needed)", "count": 1, "id": 197607, "time": "2017-03-12T10:13:38Z", "creator": "apache@gagravarr.org", "creation_time": "2017-03-12T10:13:38Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 60847, "text": "Yes, I know about the generated classes.  I'm proposing I add the missing \"nice\" access for them", "count": 2, "id": 197608, "time": "2017-03-12T13:15:29Z", "creator": "greg.woolsey@gmail.com", "creation_time": "2017-03-12T13:15:29Z", "is_private": false}]