[{"count": 0, "attachment_id": null, "bug_id": 60887, "is_private": false, "id": 197789, "time": "2017-03-18T12:21:51Z", "creator": "jmarkmurphy@apache.org", "creation_time": "2017-03-18T12:21:51Z", "tags": [], "text": "The different First Page, and different Even/Odd header/footer attributes of XSSF spreadsheets are set automatically when the appropriate methods are called. These attributes cannot be turned off, and there is no way to set the alignWithMargins and scaleWithDoc attributes."}, {"count": 1, "tags": [], "creator": "jmarkmurphy@apache.org", "text": "In working through this feature, I have noticed that creating an XSSFEvenHeader, or an XSSFFirstHeader sets the differentOddEven or differentFirst attributes respectively. And, setting the text for a header to an empty string removes that header, but does not attempt to remove the differentOddEven or differentFirst attributes. I am thinking that setting the text on an XSSFEvenHeader to the null string should remove the differentOddEven attribute if the XSSFEvenFooter is not set, and similarly setting text on the XSSFEvenFooter should remove the differentOddEven attribute if necessary. Same thing for differentFirst with respect to XSSFFirstHeader and XSSFFirstFooter. Any objections?", "id": 197820, "time": "2017-03-20T11:38:32Z", "bug_id": 60887, "creation_time": "2017-03-20T11:38:32Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "bug_id": 60887, "text": "Sounds appropriate to me.", "id": 197886, "time": "2017-03-21T20:16:15Z", "creator": "gwoolsey@apache.org", "creation_time": "2017-03-21T20:16:15Z", "tags": [], "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 60887, "is_private": false, "id": 202052, "time": "2017-11-11T14:21:12Z", "creator": "jmarkmurphy@apache.org", "creation_time": "2017-11-11T14:21:12Z", "tags": [], "text": "Added r1814950"}, {"count": 4, "tags": [], "bug_id": 60887, "attachment_id": null, "text": "Make sure to document any surprising behavior in the javadoc. It sounds like some of this functionality would be better implemented in a different class to make the global behavior less surprising. But I am not familiar enough with printing, headers, or footers to suggest something better.", "id": 202077, "time": "2017-11-12T00:46:01Z", "creator": "onealj@apache.org", "creation_time": "2017-11-12T00:46:01Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 60887, "attachment_id": null, "text": "(In reply to Javen O'Neal from comment #4)\n> Make sure to document any surprising behavior in the javadoc. It sounds like\n> some of this functionality would be better implemented in a different class\n> to make the global behavior less surprising. But I am not familiar enough\n> with printing, headers, or footers to suggest something better.\n\nI will try to improve the documentation. I Created the XSSFHeaderFooterProperties class to handle global behavior of these properties. I can add some examples and a section in the Quick Guide as well. Is there somewhere else that you experienced unexpected behavior?", "id": 202094, "time": "2017-11-13T12:21:19Z", "creator": "jmarkmurphy@apache.org", "creation_time": "2017-11-13T12:21:19Z", "is_private": false}, {"count": 6, "tags": [], "creator": "onealj@apache.org", "text": "(In reply to Mark Murphy from comment #5)\n> Is there somewhere else that you experienced unexpected behavior?\n\nI haven't used these features or even read the existing javadocs, so no.", "id": 202101, "time": "2017-11-13T17:03:29Z", "bug_id": 60887, "creation_time": "2017-11-13T17:03:29Z", "is_private": false, "attachment_id": null}]