[{"count": 0, "tags": [], "bug_id": 61007, "attachment_id": null, "is_private": false, "id": 198366, "time": "2017-04-19T16:53:43Z", "creator": "gwoolsey@apache.org", "creation_time": "2017-04-19T16:53:43Z", "text": "It is poorly documented, but Excel supports numeric range conditions in cell format strings.  POI currently doesn't handle these.\n\nThere is a comment in DataFormatter.getFormat(double, int, String) that mentions needing to combine the Java Format compatible parsing with the general-case CellFormat logic.\n\nInterestingly, the following test passes when I change the condition in the above method that calls CellFormat in all cases where the format contains a semicolon, instead of only when it contains 2 or more.  Doing that breaks testFractions(), however, so CellFormat doesn't handle everything.\n\nNot sure the best way to handle this, perhaps just send conditional format strings to CellFormat also, with another targeted boolean expression?\n\nTest case I added to TestDataFormatter:\n\n    @Test\n    public void testConditionalRanges() {\n        DataFormatter dfUS = new DataFormatter(Locale.US);\n\n        String format = \"[>=10]#,##0;[<10]0.0\";\n        assertEquals(\"Wrong format for \" + format, \"17,876\", dfUS.formatRawCellContents(17876.000, -1, format));\n        assertEquals(\"Wrong format for \" + format, \"9.7\", dfUS.formatRawCellContents(9.71, -1, format));\n    }"}, {"count": 1, "tags": [], "bug_id": 61007, "attachment_id": null, "id": 198367, "time": "2017-04-19T17:50:03Z", "creator": "gwoolsey@apache.org", "creation_time": "2017-04-19T17:50:03Z", "is_private": false, "text": "Turns out the test that failed when I sent all segmented formats to CellFormat was checking an invalid expected result.  The value it has, which is currently returned by POI, doesn't match the value produced by Excel for the same format string.\n\nExcel produces the value returned by CellFormat.  So I will change the test to expect the correct value (\"correct\" defined as the value shown by Excel), and the logic in DataFormatter to send all multi-part formats to CellFormat.  It already has a cache of format strings, so parsing will only happen once per format string per ClassLoader hierarchy."}, {"count": 2, "tags": [], "text": "Fixed in r1791964.  Kept existing test behavior, as changing that broke other tests too.  Implemented specific logic to send formats with multiple conditional segments to CellFormat in addition to the previous logic to send anything with 3 or more segments there.  Added some tests for this.", "is_private": false, "id": 198393, "creator": "gwoolsey@apache.org", "time": "2017-04-20T05:32:05Z", "bug_id": 61007, "creation_time": "2017-04-20T05:32:05Z", "attachment_id": null}]