[{"count": 0, "tags": [], "creator": "tallison@mitre.org", "text": "Created attachment 34962\ntriggering doc from common crawl\n\nI found a handful of NPEs caused by missing built-in numfmts in some xlsb files.  According to: http://stackoverflow.com/questions/4730152/what-indicates-an-office-open-xml-cell-contains-a-date-time-value, it looks like there are some built in East-Asian formats we're missing... up through 164?!\n\nThe example file requires 57 and 58 (at least).  We currently go up to 49.  \n\nAny idea how we can find the rest?", "id": 198577, "time": "2017-04-27T19:50:50Z", "bug_id": 61053, "creation_time": "2017-04-27T19:50:50Z", "is_private": false, "attachment_id": 34962}, {"count": 1, "tags": [], "creator": "gwoolsey@apache.org", "attachment_id": null, "id": 198579, "time": "2017-04-27T21:15:30Z", "bug_id": 61053, "creation_time": "2017-04-27T21:15:30Z", "is_private": false, "text": "In the OOXML specification document starting on page 1767 (I have the 4th edition downloaded, I see the 5th edition is available [1]):\n\n18.8.30 numFmt (Number Format)\nThis element specifies number format properties which indicate how to format and render the numeric value of a cell.\n\nFollowing is a listing of number formats whose formatCode value is implied rather than explicitly saved in the file. In this case a numFmtId value is written on the xf record, but no corresponding numFmt element is written. Some of these Ids can be interpreted differently, depending on the UI language of the implementing\napplication.\n\nIds not specified in the listing, such as 5, 6, 7, and 8, shall follow the number format specified by the formatCode attribute. \n\nSo it looks like for example numFmtId=164 should have the formatCode attribute set in the XML?\n\n[1] http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-376,%20Fourth%20Edition,%20Part%201%20-%20Fundamentals%20And%20Markup%20Language%20Reference.zip"}, {"count": 2, "tags": [], "bug_id": 61053, "attachment_id": null, "text": "Thank you, Greg!\n\nIn that section of the spec, they include 57 and 58 which are the ones the attached file needs.  Problem solved!!!  \n\nWait... :)\n\nIt looks like our built in formats should include language-country variants.\n\ne.g. 33...\n\nzh-tw: hh\"時\"mm\"分\"ss\"秒\" \nzh-cn:h\"时\"mm\"分\"ss\"秒\"\nja-jp: h\"時\"mm\"分\"ss\"秒\"\nko-kr: h\"시\" mm\"분\" ss\"초\"", "id": 198584, "time": "2017-04-28T11:29:56Z", "creator": "tallison@mitre.org", "creation_time": "2017-04-28T11:29:56Z", "is_private": false}, {"count": 3, "tags": [], "creator": "tallison@mitre.org", "attachment_id": null, "id": 198586, "time": "2017-04-28T12:53:56Z", "bug_id": 61053, "creation_time": "2017-04-28T12:53:56Z", "is_private": false, "text": "In a test xlsx,  I manually set a styleid=58.  We are currently hiding this problem for xlsx:\n\nline 247 of XSSFExcelExtractor\n            if (cs != null && cs.getDataFormatString() != null) {\n\nline 364 of XSSFSheetXMLHandler\n            if (this.formatString != null && n.length() > 0) {\n\nWe could identify files for testing with a slightly modified version of XSSFSheetXMLHandler in our Common Crawl corpus.\n\n\nFor now, I'll update the xlsb parser to have the same \"silently hide\" behavior, but I'll leave this issue open."}, {"count": 4, "tags": [], "text": ">So it looks like for example numFmtId=164 should have the formatCode attribute set in the XML?\n\nY, agreed.  The first problematic numFmtId for the triggering file was 58, which is built in, according to the spec.\n\n\n> depending on the UI language of the implementing application.\n\nWhen I have some time (after Tika 1.15 is out), I'll try to find xlsx examples in our corpus numFmtId < 164 and > 49 .  With any luck the language code is somewhere in the document.", "attachment_id": null, "id": 198587, "creation_time": "2017-04-28T12:57:33Z", "time": "2017-04-28T12:57:33Z", "creator": "tallison@mitre.org", "bug_id": 61053, "is_private": false}, {"count": 5, "tags": [], "creator": "gwoolsey@apache.org", "text": "(In reply to Tim Allison from comment #4)\n> With any luck the language code is somewhere in the document.\n\nThe way the spec is worded, it sounds like the format is based on the language of the evaluating environment, not the document.  Perhaps like how Excel handles number separators in Windows at least, using the system settings.\n\nIf the document has a language somewhere, I think POI should at least offer an option to use it, though, since I know I often don't do any checking or setting of the default language in Java, and other users probably don't either.  I can see some applications offering a user language preference choices, and controlling display formatting based on that, however, so that may be the desired behavior.\n\nPerhaps a formatter flag for \"use document language if present\" or something, defaulting to Java system language?", "id": 198589, "time": "2017-04-28T18:56:49Z", "bug_id": 61053, "creation_time": "2017-04-28T18:56:49Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "creator": "apache@gagravarr.org", "text": "We've previously talked about capturing all these localised formats, and providing a way to have things rendered in them, but thus far no volunteers to help work out what they'd all be. Note that these would also apply for formats like [$$-409]#,###.00 where an explicit locale is set as part of the format. CellFormatPart has a few notes on this", "id": 198591, "time": "2017-04-28T22:18:48Z", "bug_id": 61053, "creation_time": "2017-04-28T22:18:48Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "creator": "tallison@mitre.org", "attachment_id": null, "id": 198614, "time": "2017-05-01T16:37:00Z", "bug_id": 61053, "creation_time": "2017-05-01T16:37:00Z", "is_private": false, "text": "Thank you, Nick!\n\nY, this looks like a non-trivial undertaking...\n\n>The way the spec is worded, it sounds like the format is based on the language of the evaluating environment, not the document.  \n\nGreg, I completely agree. It simply boggled my mind that MS wouldn't include the locale information that was used to generate the document _somewhere_ in the document, given what decade we're in.  However, I retain enough wariness to believe this might happen.  If I find some time, we could easily enough find .xlsm/.xlsx/.xlsb in our regression corpus to see what happens in practice."}, {"count": 8, "tags": [], "creator": "tallison@mitre.org", "text": "As of r1799345, I've aligned XSSFBSheetHandler's behavior with that of the two xlsx extractors.", "id": 199292, "time": "2017-06-20T13:00:22Z", "bug_id": 61053, "creation_time": "2017-06-20T13:00:22Z", "is_private": false, "attachment_id": null}]