[{"count": 0, "tags": [], "text": "Now that POI 3.16 supports evaluation of conditional formatting rules, DataFormatter should be extended to support formatting a cell based not only on it's style format, but the style format of the conditional formatting rule that applies, if there is one.\n\nThat is, prefer a conditional format rule cell format string over a cell style format string.\n\nI think for compatibility and transparency this should be a distinct set of API calls, new methods on DataFormatter that take a ConditionalFormattingEvaluator and FormulaEvaluator, in addition to the current methods that take a FormulaEvaluator.\n\nJavaDoc will note the two should be based on the same evaluation context for consistency and cache performance.\n\nDataFormatter will need some refactoring to abstract out retrieving the applicable format objects, to centralize logic about which one applies in what cases.", "attachment_id": null, "bug_id": 61060, "id": 198624, "time": "2017-05-02T00:48:46Z", "creator": "gwoolsey@apache.org", "creation_time": "2017-05-02T00:48:46Z", "is_private": false}, {"count": 1, "tags": [], "creator": "gwoolsey@apache.org", "is_private": false, "id": 198653, "attachment_id": null, "bug_id": 61060, "creation_time": "2017-05-03T23:07:11Z", "time": "2017-05-03T23:07:11Z", "text": "Worth noting this is easy to find for XSSFConditionalFormattingRule, via the DXF entry's NumFmt element, however I do not see any way to find the number format pattern for HSSF conditional rules, even though when I save a file as XLS in Excel, and open it, the rule number formats are still there.\n\nFor now, HSSF rules will return null for the number format, the same as XSSF will when the dxf element doesn't have a NumFmt element set.  For these, the cell style number format (and possibly a system/document default) will be used as it is currently.\n\nIf anyone needs this for HSSF, they will have to dig into the binary format to figure out where to find it.  The SS interface will have a placeholder implementation for it."}, {"count": 2, "tags": [], "creator": "gwoolsey@apache.org", "is_private": false, "id": 198701, "attachment_id": null, "bug_id": 61060, "creation_time": "2017-05-05T17:46:06Z", "time": "2017-05-05T17:46:06Z", "text": "Implemented in r1794084"}]