[{"id": 198644, "tags": [], "bug_id": 61066, "attachment_id": null, "count": 0, "text": "I have configured a thread group with 6 threads to ramp up over a period of 60 seconds. The sampler is JDBC Request. However, when I check on the server logs, I find that all the connections have been made at the same time and not at an interval of 10 seconds.  However, for HTTP Request I have noticed that the ramp up period works. Is this the expected behavior for JDBC?", "time": "2017-05-03T18:17:26Z", "creator": "ramdassk@hotmail.com", "creation_time": "2017-05-03T18:17:26Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 61066, "attachment_id": null, "text": "The server I am trying to connect is  Vertica.", "id": 198645, "time": "2017-05-03T18:18:43Z", "creator": "ramdassk@hotmail.com", "creation_time": "2017-05-03T18:18:43Z", "is_private": false}, {"id": 198648, "tags": [], "bug_id": 61066, "attachment_id": null, "count": 2, "text": "I think this question would be best asked on the user mailing list.\n\nWithout checking I think, that the connection is done on thread start by the connection pool.\n\nThat might be changed by unchecking \"Delay Thread creation until needed\" on the thread group.\n\nFeel free to reopen the bug entry, if you still think this is a bug.", "time": "2017-05-03T19:45:47Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2017-05-03T19:45:47Z", "is_private": false}, {"count": 3, "tags": [], "creator": "ramdassk@hotmail.com", "text": "I did check the forum to see if there is a resolution. Since I could not get specific help, I posted this as a bug.\n\nI tried what you suggested, but that does not help. Here are the details of my test:\n\n# of Threads =6\nRamp Up Period=60\nLoop Count=1\n\nTried by both checking and unchecking  Delay Thread Creation Until Needed. No effect. \n\nJDBC Request: Query: select  1\nServer: Vertica\n\nObservation:\n\nThis starts 6 threads over a period of 60 seconds. However, all the threads seem to be executing the query at the same time. This is what I see from the server logs (query_requests table in vertica).\n\n\n\n\nstart_timestamp\t        request\t       request_duration_ms\n2017-05-04 11:40:30\tselect  1\t12\n2017-05-04 11:40:30\tselect  1\t8\n2017-05-04 11:40:30\tselect  1\t8\n2017-05-04 11:40:30\tselect  1\t8\n2017-05-04 11:40:30\tselect  1\t8\n2017-05-04 11:40:30\tselect  1\t6\n\nAs you can see all the requests are hitting vertica at the same time though threads are created at different times as can be seen from the JMeter screen shot.", "id": 198655, "time": "2017-05-04T06:30:07Z", "bug_id": 61066, "creation_time": "2017-05-04T06:30:07Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "ramdassk@hotmail.com", "text": "Created attachment 34972\nScreen shot of the threads being created in JMeter.\n\nAs you can see, threads are created at different times with the last thread being created  at 11:40:05. But as can be seen from vertica, all queries are executed at 11:40:30. This  affects the load testing on our server.", "id": 198656, "time": "2017-05-04T06:37:03Z", "bug_id": 61066, "creation_time": "2017-05-04T06:37:03Z", "is_private": false, "attachment_id": 34972}, {"count": 5, "tags": [], "bug_id": 61066, "attachment_id": null, "id": 198662, "time": "2017-05-04T11:07:47Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2017-05-04T11:07:47Z", "is_private": false, "text": "Bugzilla is still not the right place for user questions. The type of questions belong on the users mailing list. And of you didn't find an answer to your question, you should ask the question on the mailing list, so that it can get answered.\n\nNow to your question. Have you tried to set the number of connections in the pool to \"0\" add suggested by the docs? My guess is, that you have put a \"6\" there.\n\nYou may reopen this bug, if you really think that you have found a bug, but please, discuss your problem on the users mailing list first."}]