[{"count": 0, "tags": [], "creator": "simon.bjorner@gmail.com", "attachment_id": null, "id": 198677, "creation_time": "2017-05-05T05:29:03Z", "time": "2017-05-05T05:29:03Z", "bug_id": 61072, "text": "Setting secureRandomAlgorithm to an empty string and not specifying secureRandomProvider still seems to lead to SessionIdGeneratorBase creating its SecureRandom instance using SecureRandom.getInstance(\"SHA1PRNG\"), which is contrary to the wording in the documentation saying \"To specify that the platform default should be used, do not set the secureRandomProvider attribute and set this attribute to the empty string.\". See the implementation of SessionIdGeneratorBase.createSecureRandom(), where the \"result = new SecureRandom()\" line doesn't seem to be triggered for this case (secureRandomProvider=null, secureRandomAlgorithm=\"\").\n\nGetting the platform default SecureRandom algorithm is wanted on Linux systems where /dev/random blocks or is slow, either due to misconfiguration or exhaustion. See the latest comment on http://bugs.java.com/view_bug.do?bug_id=4705093 for a description of the current SecureRandom behavior. Regardless of that problem, and the motivation it provides for being able to easily get a default algorithm SecureRandom, I believe the former paragraph describes either a documentation or implementation bug in itself, so unless requested I don't think it's necessary to prove in this bug entry that Tomcat hangs on such a system. (Though it could be argued that platform default SecureRandom would be a better default to make Tomcat never block on /dev/random out-of-the-box.)", "is_private": false}, {"count": 1, "tags": [], "text": "I agree it should do what the specification says. I made a change to only use the hardcoding if there is an error.\nIt will be in 9.0.0.M22, and it will be backported once the current release cycle is complete.", "attachment_id": null, "bug_id": 61072, "id": 198689, "time": "2017-05-05T08:36:54Z", "creator": "remm@apache.org", "creation_time": "2017-05-05T08:36:54Z", "is_private": false}, {"count": 2, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "This should be fixed. 8.5.16, 8.0.44 and 7.0.78 will have the fix.", "id": 198697, "time": "2017-05-05T15:30:34Z", "bug_id": 61072, "creation_time": "2017-05-05T15:30:34Z", "is_private": false}]