[{"count": 0, "tags": [], "bug_id": 61082, "attachment_id": null, "id": 198750, "time": "2017-05-09T23:08:31Z", "creator": "shing10170@gmail.com", "creation_time": "2017-05-09T23:08:31Z", "is_private": false, "text": "In a layman POV,\nIf I want to find to the first empty row(=getLastRowNum + 1), I would have called this method.\nby empty, I mean the row appears to be empty (or in POI language, cell type BLANK) if you open the xlsx with excel. It doesnt matter whether the cell has been created or not.\n\n\nThe current problem is, if you have used a cell but then deleted the content (that means it is blank now), that cell was created in the xlsx and getLastRowNum will not consider that as the \"last row\".\n\nI call that those created but blank or empty cells, \"invisible cells\"\n\nSuggestion:\n1. upadate the javadoc to warn developer about this (because the current lastRow wording is misleading that people would think last row = last row that is not blank but current implementation is, last row = the largest row Number among the created cells in xlsx)\n\n2. make a new method to do find the right \"last row\"\nthe new method could be called\ngetFirstBlankRowNum(column findWhichCol, row startAtRow)\n,which is, find the first blank cell's rowNum or return the current getLastRowNum if all the cells were not blank\n\n\nI know I am not a good explainer, please let me know if you want to know more or want to recruit someone to achieve this (I am looking for chances to do my-first-open-source-project)"}, {"count": 1, "tags": [], "creator": "dominik.stadler@gmx.at", "attachment_id": null, "text": "We have updated the JavaDoc via r1809988 to explain this behavior better. \n\nPlease note that for iterating over the actual valid rows/cells, you can use Sheet.rowIterator() and Row.cellIterator() which will leave out non-existing rows/cells, but still may return BLANK rows/cells.", "id": 201194, "time": "2017-09-28T13:15:45Z", "bug_id": 61082, "creation_time": "2017-09-28T13:15:45Z", "is_private": false}]