[{"count": 0, "attachment_id": 34990, "creator": "a.suarez@defensor-and.es", "is_private": false, "id": 198754, "time": "2017-05-10T10:09:06Z", "bug_id": 61083, "creation_time": "2017-05-10T10:09:06Z", "tags": [], "text": "Created attachment 34990\nApache 2.4.25 trace files with proxy-html enabled and disabled\n\nHi,\n\nWe're upgrading a site from Apache 2.2 and just found that version 2.4 seems to ignore the ProxyHTMLCharsetOut directive. \n\nOur setup:\n* Fronted: SSL site on Apache 2.4.25. Output charset should be ISO-8859-1\n* Backend: non-SSL site on Tomcat 8.5.6. Output charset is ISO-8859-1\n\nWhenever we set: \n\nSetOutputFilter        proxy-html\nProxyHTMLCharsetOut    ISO-8859-1\n\nthe output charset is always UTF-8; if SetOutputFilter is commented out, then the output charset is ISO-8859-1 as expected.\n\nThis used to work fine on version 2.2. Wrong behaviour was first found on Debian 8 builtin package (version 2.4.10), but it's also happening on version 2.4.25 (downloaded as source and built with debian/rules makefile).\n\nWe've tried playing with xml2EncDefault, ProxyHTMLMeta, AddDefaultCharset and even mod_charset_lite with no result.\n\nTrace files (error.log) with mod-proxy enabled and disabled are attached.\n\nThank you in advance. Best regards,"}, {"count": 1, "tags": [], "bug_id": 61083, "text": "I've just investigated this.\n\nThere is a buglet: a HEAD request will incorrectly show UTF-8.  However, a request that returns data works just fine for me.  I'm inclined to say WONTFIX, but now that you've pointed it out I'll add a note to the docs.\n\nYour problem is configuration.  Instead of \"SetOutputFilter\", you need to use ProxyHTMLEnable On (and have mod_xml2enc loaded) to cause mod_proxy_html to configure i18n.  I think that highlights a docs bug, and I'm thinking about how to add that prominently.", "id": 202808, "time": "2017-12-16T20:28:13Z", "creator": "nick@webthing.com", "creation_time": "2017-12-16T20:28:13Z", "is_private": false, "attachment_id": null}]