[{"attachment_id": null, "tags": [], "bug_id": 61122, "text": "We are trying to use Grafana to show plots that cover multiple performance tests we run using JMeter. We use the backend listener with GraphiteBackendListenerClient to store the stats in an influxdb.\n\nThe sampler names we used earlier for all flat names. In order to show plots across multiple tests, we would like to use hierarchical names for the samplers. For example, before, say we used \"API1\" as teh sampler name, now we want to use \"Day1Mix.HappyScenario.API1\". This should allow us to trim the name to \"API1\" in the legend of the plots in Grafana (using Alias By = $1, etc.) Grafana natively uses the period as the field separator. However, it seems the period seems to have a special meaning in the GraphiteBackendListenerClient. When I look at the measurement names in the influxdb the periods in the sampler name are replaced with an underscore. This makes grafana unable to separate out the fields in a sampler name. \n\nThe sampler name in the JTL file will be using the periods while the measurement names in the influxdb will have underscores.\n\nDo you have any ideas on how to overcome this issue?\nThanks.", "count": 0, "id": 198874, "time": "2017-05-24T15:04:19Z", "creator": "brahmad@gmail.com", "creation_time": "2017-05-24T15:04:19Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 61122, "text": "Try using last InfluxDB Client released in 3.2\nIndeed . is a reserved char for Graphite and is escaped to _", "count": 1, "id": 198883, "time": "2017-05-25T14:23:05Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2017-05-25T14:23:05Z", "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 61122, "text": "Thanks for the reply.\n\nWith InfluxDB Client I am running into other road blocks. Granted, it might be that I have to learn a little more about Grafana to overcome those. Nevertheless, I will explain the problem.\n\nWith the InfluxDB Client, they have changed the measurement name to a fixed property in the Client. With Graphite, the measurement name in the influx database would be something like \"rootPrefix.SamplerName.a.ok\" (we set rootPrefix to something like PE-1114). In Grafana, I can simply choose \"Alias By = $1\" to get the SamplreName in the legend. Switching to InfluxDB Client, the measurement name comes out as a static \"measurement\" (like, \"PE-1114\"). We end up with just one measurement in the database no matter how many samplers I have in the test. The actual sampler name is recorded in the tag value for the tag key = \"transaction\". Now, I am not sure how to read that transaction string and parse it with a period separator to pass it to the legend text in the plot.\n\nI hope this is clear.\n\nThe other option is for me to wait until an example dashboard is created by Grafana or some other expert with InfluxDB Client / JMeter combination for a test.\n\nThanks.", "id": 198888, "time": "2017-05-25T16:29:48Z", "creator": "brahmad@gmail.com", "creation_time": "2017-05-25T16:29:48Z", "tags": [], "is_private": false}]