[{"count": 0, "tags": [], "creator": "brahmad@gmail.com", "attachment_id": null, "text": "With the Graphite backend listener we were using in JMeter the following property:\n- rootMetricsPrefix = $PE_ID$\nThis would have resulted in measurement names of, say PE-1114.samplername.a.ok. There would be many measurements in the influxdb for each test. This allowed us to use Grafana, parse out the samplername (using \"Alias By = $1) and use that for the legend labels in the plots.\n\nWe are switching to influx backend listener because it allows us to use tags and some other features. In the JMeter backend listener interface we use:\n- measurement= $PE_ID$\nThis would result in a single measurement in influxdb called PE-1114. Then all of the data for all of the samplers in the JMX file get pushed into this measurement in a very organized fashion. However, when we are trying to plot, say, pct90 metric, for multiple samplers in Grafana, I have not found an easy way to display the sampler names in the legend of the plot.\n\nWe tried to put the sampler name as a variable in the measurement property of the JMeter backend listener even though we knew that was not going to work. Whichever sampler is the last one in the JMX file, the measurement name gets set to a value based on that.\n\nThe botomline is, we would like to get the samplername (which is a hierarchical name with fields separated by a period), parse it to get the last field and use it for the legend in the plot. Do you see this as a possibility with the latest versions of JMeter and Grafana or with any tricks we can do?\n\nThe other thing is, it would be nice to see a working example of a JMeter test that uses at least two samplers and Grafana display of the statistics. This would iron out any issues with the end-to-end usage of the influx backend listener and/or provide the users with a great starting point.\n\nThanks.", "id": 198876, "time": "2017-05-24T21:10:57Z", "bug_id": 61123, "creation_time": "2017-05-24T21:10:57Z", "is_private": false}]