[{"count": 0, "tags": [], "bug_id": 61171, "attachment_id": null, "id": 199126, "time": "2017-06-09T17:42:11Z", "creator": "csutherl@apache.org", "creation_time": "2017-06-09T17:42:11Z", "is_private": false, "text": "An option that would allow users to set a port offset in the configuration (or with a system property) would be great for creating new instances on the same machine. Such an option would prevent the need for manually updating the connectors, etc in the server.xml for each new installation on the same host. With this option in place, users could simply unzip multiple installs and then start each with a different offset out of the box rather than updating multiple places in the server.xml.\n\nAs an example of the implementation, setting the option to 100 would\nadd 100 to all port bindings on the server (e.g. with a vanilla\ninstall it would cause tomcat to run on 8105, 8180, and 8109 rather than 8005, 8180, and 8009). It should also be noted that this same offset should apply to ALL port bindings and references, include the redirectPort."}, {"count": 1, "tags": [], "bug_id": 61171, "attachment_id": null, "id": 199128, "time": "2017-06-10T06:17:14Z", "creator": "dev@21solutions.net", "creation_time": "2017-06-10T06:17:14Z", "is_private": false, "text": "Please see https://github.com/apache/tomcat/pull/63"}, {"count": 2, "tags": [], "bug_id": 61171, "attachment_id": null, "id": 199141, "time": "2017-06-10T17:25:04Z", "creator": "dev@21solutions.net", "creation_time": "2017-06-10T17:25:04Z", "is_private": false, "text": "Comments from Mark Thomas on Github (https://github.com/apache/tomcat/pull/63#issuecomment-307556995):\n\nI think more discussion is required on how to approach this. Specifically, when should the offset be applied? What is the impact on getters and setters? For example connector.setPort (getPort ()) should be a NO-OP. What is reported via JMX? There are all sorts of side effects that need to be thought through here else we'll end up creating some very non-intuative behaviour."}, {"count": 3, "tags": [], "text": "(moving discussion from Github to the ticket):\n\n>I think more discussion is required on how to approach this. Specifically, when should the offset be applied?\n\nI agree, and I was trying to find different options for this in order to initiate a discussion, but the way that Tomcat reads the config files and initializes objects via introspection really limits us here unless there is a major overhaul.\n\nServer has the value for portOffset, so a reference to it is required in order to calculate (port + portOffset)\n\nThe process is somewhat like this:\n\nConnectors are initialized (no reference to Service or Server)\nService is linked to the Connectors (still no reference to Server)\nServer is added to Service\nPoint (3) is point where I took the portOffset from Server and applied it to the Connectors.\n\n>What is the impact on getters and setters? For example connector.setPort (getPort ()) should be a NO-OP.\n\nAt point (1) above the Connector's setPort() is called by the IntrospectionUtils with the values from server.xml. That can not be a NO-OP at that point as that would practically disable the Connector, but we can check if Service and Server are null or not (which they are at initialization) and perhaps do something different accordingly?\n\nIs it even possible/allowed to change the port after initialization?", "attachment_id": null, "id": 199142, "creator": "dev@21solutions.net", "time": "2017-06-10T17:27:51Z", "bug_id": 61171, "creation_time": "2017-06-10T17:27:51Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 61171, "attachment_id": null, "id": 199324, "time": "2017-06-21T19:46:46Z", "creator": "dev@21solutions.net", "creation_time": "2017-06-21T19:46:46Z", "is_private": false, "text": "Can we discuss the guidelines/specification for this feature?  Anyone wants to  contribute their thoughts?"}, {"count": 5, "tags": [], "bug_id": 61171, "attachment_id": null, "id": 199526, "time": "2017-07-02T13:07:50Z", "creator": "pradip.bhattacharya@gmail.com", "creation_time": "2017-07-02T13:07:50Z", "is_private": false, "text": "port offset is a good thing to have, can help a lot in having multiple installations/resolving port conflicts.\n\nI have tried to implement it by adding portOffset attribute in Server element.\n\nBelow is the change in server.xml, portOffset as the new attribute:\n\n<Server port=\"8005\" shutdown=\"SHUTDOWN\" portOffset=\"1000\">\n...\n</Server>\n\nAdded getter/setter method portOffset in org.apache.catalina.Server interface. So StandardServer now has a member variable portOffset, and its respective getter/setter functions.\n\nNow in order to update all the port/redirectPort numbers mentioned in the server.xml, I have created a Rule, i.e. AddPortOffsetRule, which is applied after values of all the attributes have been set in the target(current) object.\n\nFor example, in Catalina::createStartDigester function,\nafter digester.addSetProperties(\"Server\"); is called,\na new is being invoked by adding the below line\ndigester.addRule(\"Server\", new AddPortOffsetRule(\"port\"));\n\nSimilarly for Connector, below 2 rules are added to update port numbers:\ndigester.addRule(\"Server/Service/Connector\",new AddPortOffsetRule(\"port\"));\ndigester.addRule(\"Server/Service/Connector\",new AddPortOffsetRule(\"redirectPort\"));\n\nThis way the port related member variables are again updated using the port offset."}, {"count": 6, "tags": [], "text": "My suggestion is as follows:\n\nAdd a new getter for every getPort() or equivalent named getPortWithOffset() and use it in place of getPort() whenever code needs to get the actual port number to open. That would ensure that getPort()/setPort() (and getOffset()/setOffset() ) remain symmetrical so they continue to work with features like configuration saving.\n\nportWithOffset should be exposed as a read-only JMX attribute everywhere port is exposed.\n\nIt does mean users using an offset will need to look at a different attribute to find the port they are actually using. That might confuse some tools but on balance I think this is lower risk than getPort()/setPort() not being symmetrical.", "attachment_id": null, "id": 199571, "creator": "markt@apache.org", "time": "2017-07-05T09:33:45Z", "bug_id": 61171, "creation_time": "2017-07-05T09:33:45Z", "is_private": false}]