[{"count": 0, "tags": [], "bug_id": 61180, "attachment_id": null, "id": 199174, "time": "2017-06-12T19:19:44Z", "creator": "csutherl@apache.org", "creation_time": "2017-06-12T19:19:44Z", "is_private": false, "text": "I was just asked a question in #tomcat about why a user's tomcat installation was taking ~36 minutes to start. After looking at their logging I immediately noticed:\n\nINFO [localhost-startStop-1] org.apache.catalina.util.SessionIdGeneratorBase.createSecureRandom Creation of SecureRandom instance for session ID generation using [SHA1PRNG] took [2,157,784] milliseconds.\n\nshowing that the machine had low entropy. I knew that from experience, however the user had no idea that was the issue because the logging looked normal to them (no WARN or ERROR messages). Can we change the log level of the sessionIdGeneratorBase.createRandom message to WARN rather than INFO so if it takes longer than 100 ms to generate a random users are made aware? A WARN message will at least make them look twice at the error line and google it as a potential issue, which should yield the wiki page (https://wiki.apache.org/tomcat/HowTo/FasterStartUp#Entropy_Source).\n\nAlso, the wording in the wiki page makes this sound like it should be a warning anyway:\n\n\"You will see warning in the logs when this happens\""}, {"text": "This is the definition of a \"Beginner\" issue IMO :)", "tags": [], "creator": "csutherl@apache.org", "attachment_id": null, "count": 1, "id": 199175, "time": "2017-06-12T19:20:20Z", "bug_id": 61180, "creation_time": "2017-06-12T19:20:20Z", "is_private": false}, {"count": 2, "tags": [], "creator": "piotrekchlebda@gmail.com", "attachment_id": null, "id": 199222, "time": "2017-06-15T20:51:07Z", "bug_id": 61180, "creation_time": "2017-06-15T20:51:07Z", "is_private": false, "text": "Hi,\nI'm newby as a tomcat contributor and I'd like to take this issue."}, {"count": 3, "tags": [], "text": "Taking another look at the code around the info message I think we may need to add another check to see if the delay time is larger than 100 ms. If we make this a warning message as-is I think that everyone's log may have a warning in it. Should we print an info message if the delay is less than some number (like 30 seconds) and a warning if the delay is greater?", "attachment_id": null, "id": 199224, "creation_time": "2017-06-16T01:42:02Z", "time": "2017-06-16T01:42:02Z", "creator": "csutherl@apache.org", "bug_id": 61180, "is_private": false}, {"count": 4, "tags": [], "creator": "markt@apache.org", "is_private": false, "text": "I don't see the message on my new(ish) desktop nor my old(ish) laptop. If the threshold is too low for some systems, we can look at increasing it. My instinct is that 100ms will be plenty of time for that block of code unless there is an entropy problem,\n\nI also took the opportunity to clean up some formatting and I added a changelog entry.\n\nThanks to Piotr Chlebda for the patch.\n \nFixed in:\n- trunk for 9.0.0.M22 onwards\n- 8.5.x for 8.5.16 onwards\n- 8.0.x for 8.0.45 onwards\n- 7.0.x for 7.0.79 onwards", "id": 199264, "time": "2017-06-18T19:57:55Z", "bug_id": 61180, "creation_time": "2017-06-18T19:57:55Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 61180, "attachment_id": null, "id": 199265, "time": "2017-06-18T20:23:02Z", "creator": "piotrekchlebda@gmail.com", "creation_time": "2017-06-18T20:23:02Z", "is_private": false, "text": "1) Would that be another bug for that ?\n2)I'd like to make sure that my PR was ok, since it was only at trunk (version 9). Are there any requirments for PR for other version(8.5.x,8.0.x,7.0.x) ?"}, {"count": 6, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 199267, "time": "2017-06-18T20:28:31Z", "bug_id": 61180, "creation_time": "2017-06-18T20:28:31Z", "text": "(In reply to Piotr Chlebda from comment #5)\n> 1) Would that be another bug for that ?\n\nMaybe. We need to wait and see if we get any such reports. I'd be surprised to get such a report where there wasn't an underlying entropy problem.\n\n\n> 2)I'd like to make sure that my PR was ok, since it was only at trunk\n> (version 9). Are there any requirments for PR for other\n> version(8.5.x,8.0.x,7.0.x) ?\n\nBug fixes to trunk are back-ported to earlier versions. The back-ports normally apply cleanly so no further work is required.\n\nIt would be helpful to include a changelog entry when you fix a bug. It saves the committers a few minutes writing it themselves."}, {"text": "Thanks Mark Thomas for a quick response.", "tags": [], "creator": "piotrekchlebda@gmail.com", "is_private": false, "count": 7, "id": 199268, "time": "2017-06-18T20:42:04Z", "bug_id": 61180, "creation_time": "2017-06-18T20:42:04Z", "attachment_id": null}]