[{"count": 0, "tags": [], "bug_id": 61205, "is_private": false, "text": "Created attachment 35065\nIt is having the log while I am trying to stop the tomcat service\n\nI have configured tomcat as windows service using Winrun4j.  I am able to start the tomcat without any issues.  However when I am trying to stop the service , It is not getting killed and continuously running.  I am also seeing some exceptions in my logs.\n\nI am really not sure why it is not getting killed.  What I have observed is , when I am invoking bootstrap.stopServer().  It is not responding back even after 2 to 3 minutes  and eventually windows service throwing 1053 error .  I am attaching the logs.  I  am really not sure whether it is causing issue.\n\nPlease look into this issue. It is blocking my application to release.", "id": 199312, "time": "2017-06-21T13:39:06Z", "creator": "veeru.mallavarapu@yahoo.com", "creation_time": "2017-06-21T13:39:06Z", "attachment_id": 35065}, {"count": 1, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 199313, "time": "2017-06-21T14:03:56Z", "bug_id": 61205, "creation_time": "2017-06-21T14:03:56Z", "text": "The log indicates some configuration problems. Bugzilla is not a support forum. Please use the users@ mailing list."}, {"count": 2, "tags": [], "text": "Is there any possibility to point out the configuration. I am clueless. \n\nWhat is users@ mailing list and how to reach it.\n\nYour help in this regard is very much appreciated.", "attachment_id": null, "bug_id": 61205, "id": 199328, "time": "2017-06-22T04:56:40Z", "creator": "veeru.mallavarapu@yahoo.com", "creation_time": "2017-06-22T04:56:40Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 61205, "attachment_id": null, "text": "Do not reopen bugzilla entries without evidence of a Tomcat problem.  The users mailing list is linked to from the Tomcat home page, on the left side under Problems.", "id": 199330, "time": "2017-06-22T11:43:26Z", "creator": "chuck.caldarale@unisys.com", "creation_time": "2017-06-22T11:43:26Z", "is_private": false}]