[{"attachment_id": 35098, "tags": [], "bug_id": 61255, "is_private": false, "count": 0, "id": 199610, "time": "2017-07-06T14:55:21Z", "creator": "csutherl@apache.org", "creation_time": "2017-07-06T14:55:21Z", "text": "Created attachment 35098\nJAR containing implementation of PropertySource\n\nWhen using a custom implementation of PropertySource I noticed that the log messages are printed to the catalina.$(date).log on startup, but on shutdown they are printed to stdout and therefore not logged anywhere (catalina.out doesn't get the redirected output on shutdown). JULI is working (the log message is correct), but it isn't logging the way it should be on shutdown.\n\nTo reproduce:\n\n1) Copy the attached JAR into $CATALINA_HOME/lib. The JAR contains a PropertySource implementation with a single log message in the constructor.\n2) Configure the PROPERTY_SOURCE system property in $CATALINA_HOME/conf/catalina.properties\n\norg.apache.tomcat.util.digester.PROPERTY_SOURCE=org.apache.tomcat.example.digester.PropertySourceImpl\n\n3) Start tomcat and observe the message is not printed to stdout\n4) Stop tomcat to observe the message is printed to stdout and not logged:\n\n~~~\n$ bin/shutdown.sh \n<snip>\nJul 06, 2017 10:20:57 AM org.apache.tomcat.example.digester.PropertySourceImpl <init>\nINFO: PropertySourceImpl constructor\n~~~"}, {"count": 1, "tags": [], "bug_id": 61255, "text": "The issue is that the logging configuration isn't set on stop by catalina.sh, so it uses the default behavior.\n\nMaybe the original rationale was that it's not useful (only used for shutdown.sh, the shutdown hook doesn't use it). A problem with fixing it is that a separate process would be opening the log files and maybe do some logging -> not a good idea, that's why it should remain on the console. Even though it is not very intuitive, it should work (a user is using shutdown.sh from a console and is might see the output).", "id": 199611, "time": "2017-07-06T17:01:38Z", "creator": "remm@apache.org", "creation_time": "2017-07-06T17:01:38Z", "is_private": false, "attachment_id": null}]