[{"count": 0, "tags": [], "creator": "jjwelch@gmail.com", "text": "When using a custom DNS resolver and running through a proxy, jmeter cannot connect to the host. Jmeter reports it cannot resolved the hostname of both the end server and the proxy server. I checked that this works in jmeter 2.13 and fails in both 3.2 and the nightly build Version r1803417.\n\nSwitching the DNS manager to \"Use system DNS resolver\" causes jmeter to work normally and route the request through the proxy successfully.\n\nTest Setup:\nDNS Manager: Clear cache each iteration: ON\nUse custom DNS resolver: ON\n\nAttached are both the JMX I used and the jmeter log it generated at DEBUG level. In the log are 10 iterations that pass and 10 iterations that fail. \nPass = \"Use system DNS resolver\"\nFail = \"Use custom DNS resolver\"", "id": 200156, "time": "2017-08-02T18:47:29Z", "bug_id": 61375, "creation_time": "2017-08-02T18:47:29Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": 35197, "bug_id": 61375, "text": "Created attachment 35197\njmeter test I used to demonstrate the defect", "id": 200157, "time": "2017-08-02T18:48:19Z", "creator": "jjwelch@gmail.com", "creation_time": "2017-08-02T18:48:19Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "felix.schumacher@internetallee.de", "attachment_id": 35198, "id": 200162, "time": "2017-08-02T20:40:46Z", "bug_id": 61375, "creation_time": "2017-08-02T20:40:46Z", "is_private": false, "text": "Created attachment 35198\nUse all custom resolvers, when more than one is given\n\nI find it strange, that only the first custom resolver get tried. So I added a loop to try them all.\n\nMy setup used localhost as a proxy and that lead to the reported bug. My first solution was to add localhost as a static host entry, but that let another bug surface ( a NPE, which I fought with a null-guard in the patch).\n\nI am not too happy with this patch, so I would be glad, if someone would take a look at the code. I think it is not completely refactored from side-effect-using code to side-effect-free code."}, {"count": 3, "tags": [], "bug_id": 61375, "text": "I think my patch doesn't help. We need more information on your setup to really reproduce your problem.\n\nWhere is your proxy located? Do you see any exceptions in the log files or in the responses?\n\nMy setup used localhost as a proxy and the custom resolver tried to resolve \"localhost\" using those. But those dns servers don't resolve \"localhost\". That is normally done by the hosts file from your computer.\n\nSo my solution was (and is) the addition of a static host resolution \"localhost\" to the static host table. That led to another failure as the \"ip\" of the static host entry was tried to be resolved.\n\nI will attach another patch, which is hopefully a bit more correct. But it introduces a lookup with the system resolver as a last resort. That is new behaviour and could introduce other problems (which at the moment I can't think of).", "id": 200201, "time": "2017-08-05T15:08:17Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2017-08-05T15:08:17Z", "is_private": false, "attachment_id": null}, {"count": 4, "text": "Created attachment 35201\ntry system dns as last resort", "bug_id": 61375, "attachment_id": 35201, "id": 200202, "time": "2017-08-05T15:08:52Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2017-08-05T15:08:52Z", "tags": [], "is_private": false}, {"count": 5, "tags": [], "bug_id": 61375, "attachment_id": null, "text": "I use the software package called \"Charles Proxy\", www.charlesproxy.com . I could try this with Fiddler on a windows machine as well.\n\nI was thinking that there could be a logical test in the code that skips DNS when the proxy is an IP address instead of a name. Not sure how hard that would be to write a method for \"isAnIP\" - the regex pattern for that might introduce some other unexpected behavior or edge cases.\n\nI do have an entry in /etc/hosts for localhost as 127.0.0.1 so I am surprised that there was an issue when I tried localhost as the proxy server name.\n\nWhat was different in jmeter 2.x that allowed the proxy and the dns manager to work so well together?", "id": 200259, "time": "2017-08-09T21:06:59Z", "creator": "jjwelch@gmail.com", "creation_time": "2017-08-09T21:06:59Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 61375, "attachment_id": null, "text": "(In reply to JJ Welch from comment #5)\n> I use the software package called \"Charles Proxy\", www.charlesproxy.com . I\n> could try this with Fiddler on a windows machine as well.\n> \n> I was thinking that there could be a logical test in the code that skips DNS\n> when the proxy is an IP address instead of a name. Not sure how hard that\n> would be to write a method for \"isAnIP\" - the regex pattern for that might\n> introduce some other unexpected behavior or edge cases.\n> \n> I do have an entry in /etc/hosts for localhost as 127.0.0.1 so I am\n> surprised that there was an issue when I tried localhost as the proxy server\n> name.\n> \n> What was different in jmeter 2.x that allowed the proxy and the dns manager\n> to work so well together?\n\nThe change was introduced with bug 57447, where it was explicitly requested to ignore the systems normal dns configuration.\n\nI think we could re-enable the usage for the static host entries as a last resort.\n\nOn a different subject. Why did you put so many dns servers in your resolver list?", "id": 200505, "time": "2017-08-29T12:13:25Z", "creator": "felix.schumacher@internetallee.de", "creation_time": "2017-08-29T12:13:25Z", "is_private": false}, {"count": 7, "tags": [], "creator": "felix.schumacher@internetallee.de", "attachment_id": null, "id": 200575, "time": "2017-09-02T11:08:15Z", "bug_id": 61375, "creation_time": "2017-09-02T11:08:15Z", "is_private": false, "text": "Fixed in version 3.3.\n\nDate: Sat Sep  2 11:04:06 2017\nNew Revision: 1807037\n\nURL: http://svn.apache.org/viewvc?rev=1807037&view=rev\nLog:\nUse system DNS resolver as last resort, when resolving entries in the static host table.\n\nBugzilla Id: 61375\n\nModified:\n    jmeter/trunk/src/protocol/http/org/apache/jmeter/protocol/http/control/DNSCacheManager.java\n    jmeter/trunk/test/src/org/apache/jmeter/protocol/http/control/TestDNSCacheManager.java\n    jmeter/trunk/xdocs/changes.xml"}]