[{"count": 0, "tags": [], "bug_id": 61383, "attachment_id": null, "id": 200191, "creation_time": "2017-08-04T16:17:32Z", "time": "2017-08-04T16:17:32Z", "creator": "bradley.meck@gmail.com", "text": "Javascript Language body is re-using the MIME for a new parse goal:\nhttps://github.com/tc39/ecma262/issues/322\n\nUsed by Node:\nhttps://github.com/nodejs/node-eps/blob/6cc060e94e56859bdb446a0820ef4704731ff0a8/002-es-modules.md\nhttps://github.com/nodejs/node/pull/14369\n\nAlready being merged into other tools:\nhttps://github.com/Microsoft/vscode/pull/25747", "is_private": false}, {"count": 1, "tags": [], "creator": "jchampion@apache.org", "attachment_id": null, "id": 200195, "time": "2017-08-04T18:46:26Z", "bug_id": 61383, "creation_time": "2017-08-04T18:46:26Z", "is_private": false, "text": "Thanks for the heads up! Based on those links, I think this needs to be baked a little bit more before we add it to the official mime.types. You've linked to a draft proposal, and IMO it belongs in httpd after it's standardized and/or in wide use.\n\nIn the meantime, server admins are welcome to adjust the mime.types themselves if they need it, so we're not obstructing the rollout."}, {"attachment_id": null, "tags": [], "bug_id": 61383, "is_private": false, "count": 2, "id": 200196, "time": "2017-08-04T19:02:53Z", "creator": "bradley.meck@gmail.com", "creation_time": "2017-08-04T19:02:53Z", "text": "What level of support are you needing. If I move the draft to accepted is that enough? Is the merged PR for node needed if not? This issue is being brought up because it was a web compatiblity concern where people cannot use the same files due to lack of MIME support.\n\nWould written statements from browser vendors sway anything?"}, {"count": 3, "tags": [], "bug_id": 61383, "attachment_id": null, "id": 200197, "time": "2017-08-04T19:36:38Z", "creator": "jchampion@apache.org", "creation_time": "2017-08-04T19:36:38Z", "is_private": false, "text": "(In reply to Bradley Farias from comment #2)\n> What level of support are you needing. If I move the draft to accepted is\n> that enough?\nNow you have me worried/confused. Is that document you linked to binding in any way on the Javascript community? Do you have the power to \"accept\" it yourself -- and if so, should we use it as proof of standardization? ;D\n\nMy point is not that we should meet an arbitrary milestone that I'd be making up on the spot, but that we should feel like the types we add are actually standards (either de facto or otherwise). The stuff you've linked to highlights relatively recent arguments over whether a new MIME suffix should be registered, whether the extension should be .mjs or .jsm, etc.\n\nIMO we should add this to httpd once the world says \"yes, *this* is how it is.\" Which does imply a slight bit of lag time.\n\n> This issue is being\n> brought up because it was a web compatiblity concern where people cannot use\n> the same files due to lack of MIME support.\nRight. Server admins have full power over their mime.types, and if they need their servers to support this, they don't have to wait for us. We're not blocking early adoption as far as I can tell.\n\n> Would written statements from browser vendors sway anything?\nSure, it'd certainly give us a better idea of who intends to make use of this.\n\nKeep in mind that I am not the sole gatekeeper for this. If, at any point, an httpd dev is convinced, then in all likelihood it's going in. I'm just saying that I'm not personally convinced *yet*."}, {"count": 4, "tags": [], "creator": "covener@gmail.com", "attachment_id": null, "id": 200200, "time": "2017-08-05T01:42:21Z", "bug_id": 61383, "creation_time": "2017-08-05T01:42:21Z", "is_private": false, "text": "IIUC the bar for httpd to list a type is registration in IANA, but the bar for adding an extension to an existing type is to show it in common use (assuming it's not already in use elsewhere) or present in some standard.\n\nhttps://www.iana.org/assignments/media-types/media-types.xml\n\nWhere we'd normally look to confirm an extension:\nhttps://www.iana.org/assignments/media-types/application/javascript\n\nI didn't find the specific references here too compelling but someone else might be more familiar/comfortable with it."}]