[{"count": 0, "tags": [], "bug_id": 6143, "text": "I am trying to upload a file using the Orielley servlet package, I am trying to \ncatch any exception that occur on the servlet that does the upload, if an error \noccur, the servlet redirects the user to another page with information on how \nto handle the error.\nWhat is happening is whenever any exception occurs no matter what, I get page \ncannot be displayed on internet explorer, if no exception occurs everything \nworks fine, but if an exception occur then I get page cannot be displayed, I \nhave some debugging code on the catch block, the code executes but internet \nexplorer doesn't get the page, I tried to output something to the page but \nstill the same error(Page caannot be displayed), I am not sure what is the \nproblem, I tried for every FAQ and bug report but I couldn't find anything \nhelpful regarding that matter, the same thing happens on another machine \nrunning Tomcat3.3, Please Help!!!!!", "id": 10104, "time": "2002-01-31T05:59:22Z", "creator": "sgabriel@brainfuse.com", "creation_time": "2002-01-31T05:59:22Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "text": "As a general rule, if the servlet gets an IOException, then the browser isn't \ntalking to you anymore (e.g. the user hits the \"stop\" button in the middle of a \nlarge upload).  As a result, there really isn't really anything you can do \n(except possibly making a note of the fact in the session).\n\nSince this looks strongly like it's not a Tomcat bug, I'll mark it as INVALID.  \nFeel free to reopen with more information (e.g. server-log stack traces) if you \nthink that there is still a problem.", "attachment_id": null, "id": 10153, "creator": "william.barker@wilshire.com", "time": "2002-02-01T05:03:12Z", "bug_id": 6143, "creation_time": "2002-02-01T05:03:12Z", "is_private": false}, {"count": 2, "tags": [], "creator": "william.barker@wilshire.com", "attachment_id": null, "text": "Reopening to change status.", "id": 10196, "time": "2002-02-02T03:28:05Z", "bug_id": 6143, "creation_time": "2002-02-02T03:28:05Z", "is_private": false}, {"count": 3, "tags": [], "text": "It seems that MSIE isn't happy with people that don't finish reading the POST \nbody.  The CVS HEAD now has a fix for this, and it should show up in the 2/2 \nnightly for 3.3 (as well as 3.3.1-B1).\n\n*** This bug has been marked as a duplicate of 5983 ***", "is_private": false, "id": 10197, "creator": "william.barker@wilshire.com", "time": "2002-02-02T03:31:06Z", "bug_id": 6143, "creation_time": "2002-02-02T03:31:06Z", "attachment_id": null}]