[{"count": 0, "tags": [], "creator": "jesse@dreamtsoft.com", "attachment_id": null, "is_private": false, "id": 200418, "time": "2017-08-22T17:03:08Z", "bug_id": 61450, "creation_time": "2017-08-22T17:03:08Z", "text": "We use tomcat-embed and we have a test that is breaking with an upgrade from 8.5.12 to 8.5.20, it seems due to the fact that we do not set the certificateKeyAlias when we configure an SSLHostConfigCertificate.\n\nThe documentation for certificateKeyAlias states \"If not specified, the first key read from the keystore will be used.\"  \n\nIt seems that the first alias is being used and there is no check that it references a key.\n\nThe result is that in JSSEUtil.getKeyManagers there is a call to KeyStore.getKey(keyAlias, keyPassArray) where keyAlias is actually an alias for a certificate, which leads to inMemoryKeyStore.setKeyEntry being passed null for the Key argument and eventually a KeyStoreException(\"Cannot store non-PrivateKeys\").\n\nThis worked previously with certificatekeyAlias being null.  I can confirm that this works just fine if I set that with the alias used when creating the KeyStore but I would rather not pass that alias around our code when I did not previously need to.\n\nWe have worked around the issue with a \"getFirstKeyAlias\" method that we use to set the certificateKeyAlias in our SSLHostConfigCertificate:\n\n   private String getFirstKeyAlias(KeyStore keyStore) {\n      try {\n         Enumeration<String> aliases = keyStore.aliases();\n         while(aliases.hasMoreElements()) {\n            String alias = aliases.nextElement();\n            if (keyStore.isKeyEntry(alias))\n               return alias;\n            }\n      } catch (KeyStoreException e) {\n          LOGGER.error(\"Failed to find first key alias in keystore\", e);\n      }\n\n      return null;\n   }\n\nI think that something like this should around line 219 of JSSEUtil, where currently it looks like this:\n\n                Enumeration<String> aliases = ks.aliases();\n                if (!aliases.hasMoreElements()) {\n                    throw new IOException(sm.getString(\"jsse.noKeys\"));\n                }\n                keyAlias = aliases.nextElement();"}, {"count": 1, "tags": [], "bug_id": 61450, "attachment_id": null, "text": "Created this bug per Mark Thomas on the tomcat users mailing list.\n\nThanks!", "id": 200419, "time": "2017-08-22T17:04:10Z", "creator": "jesse@dreamtsoft.com", "creation_time": "2017-08-22T17:04:10Z", "is_private": false}, {"count": 2, "tags": [], "creator": "remm@apache.org", "text": "I get it, the switch was made from trying \"tomcat\" to using an actual alias from the keystore, but it still needs an additional update to be accurate.\nImproved in 9M27 and 8.5.21.", "id": 200496, "attachment_id": null, "bug_id": 61450, "creation_time": "2017-08-28T12:47:17Z", "time": "2017-08-28T12:47:17Z", "is_private": false}]