[{"count": 0, "text": "- mod_authnz_fcgi uses a hard-coded 30 sec value as the socket IO timeout value to write to and read from a back end FCGI Authorizer application.\n- While this timeout value seems sufficient, in certain cases it may not be.\n- Further, instead of hard-coding this parameter, a user should have an option to be able to configure a suitable timeout of his choice.\n- If none is specified, a certain default timeout (like the request timeout of connection timeout) needs to be used.\n\nSteps-to-repro:\n\n1. Sample FCGI Authorizer application which can be started with fcgistarter: \n   fcgistarter -c <fcgi app name> -p 5555 -i 127.0.0.1 -N 1\n   (Refer to the fcgistarter documentation)\n2. Note that in the above app, a sleep of 32 secs (any value greater than 30 sec) needs to be induced to repro the issue.\n3. Configure the mod_authnz_fcgi module in httpd.conf:\n   LoadModule authnz_fcgi_module /usr/lib/apache2/modules/mod_authnz_fcgi.so\n\nActual results:\nThe httpd daemon returns an HTTP 503 Service Unavailable status code back to the client after 30 secs. However, in the back end, the authentication was handled (success or failure).\n\nExpected results:\n- The status code as returned from the FCGI application after authentication.\n- Or, HTTP 503 service unavailable if the configured timeout elapses.", "bug_id": 61464, "is_private": false, "id": 200492, "time": "2017-08-28T08:53:22Z", "creator": "farhaan.syed@gmail.com", "creation_time": "2017-08-28T08:53:22Z", "tags": [], "attachment_id": null}, {"count": 1, "tags": [], "text": "Created attachment 35263\nAn optional configurable socket io timeout parameter patch file for mod_authnz_fcgi\n\nAn optional configurable socket IO timeout parameter patch file for mod_authnz_fcgi.\n\nThis patch could be used for extending the AuthnzFcgiDefineProvider directive to include an optional socket io timeout parameter. For e.g.:\n\nAuthnzFcgiDefineProvider AuthnzFcgiDefineProvider authnz my-fcgi-app fcgi://127.0.0.1:5555/ timeout=60\n\nThe above line sets the socket IO timeout to 60 secs.\n\nIf no timeout is specified, then the standard HTTP request timeout applies.", "attachment_id": 35263, "bug_id": 61464, "id": 200493, "time": "2017-08-28T09:48:13Z", "creator": "farhaan.syed@gmail.com", "creation_time": "2017-08-28T09:48:13Z", "is_private": false}, {"count": 2, "text": "Created attachment 35264\nUse the request timeout directive value as the socket IO timeout value\n\nApproach 2:\n\nUtilise the HTTP request TimeOut directive value as the socket IO timeout instead of the current hard-coded value of 30 secs.", "bug_id": 61464, "is_private": false, "id": 200494, "time": "2017-08-28T10:31:02Z", "creator": "farhaan.syed@gmail.com", "creation_time": "2017-08-28T10:31:02Z", "tags": [], "attachment_id": 35264}]