[{"count": 0, "tags": [], "bug_id": 61466, "text": "Publishing JMeter results directly under specific format like PerfPublisher is possible from reporter elements but the test details (comment) is hardly missing (especially the one of TransactionControllers) because not available in the SampleResult class.\n\nDoes this data miss on purpose (memory or performance issues) or could it be added to enhance JMeter to provide then more accurate reporters?\n\nSorry if the question was already rised and answered, but I don't find anything about it.\n\nThanks for your feedback.\n\n--Vincent", "id": 200499, "time": "2017-08-28T13:26:41Z", "creator": "vherilier@gmail.com", "creation_time": "2017-08-28T13:26:41Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "text": "I suppose the issue is that it would be duplicated a huge number of times no ?\n\nHow do you see the feature ?\n\nThanks", "id": 200603, "time": "2017-09-02T19:34:27Z", "bug_id": 61466, "creation_time": "2017-09-02T19:34:27Z", "is_private": false, "attachment_id": null}, {"count": 2, "text": "Hi Philippe,\n\nI'm not sure for the duplication (in my case), but at least, if the Transaction Controller is able to \"save\" its comment (description) into its related SampleResult, it could be great enough.\nPerfPublisher does only work on the usecase/testcase level, so the TransactionController is the right element to deal with it; the inner steps are not relevant for it (other sampler results).\n\nSo, if the SampleResult object may have a new \"comment\" (String) property (like the name) and always initialized as an empty one and related getter/setter.\nThe TransactionSampler can save its comment in its related sampleResult with 2 constructors to keep compatibility.\nAnd the TransactionController just has to create a TransactionSampler with the name and the comment.\n\nOther Sampler elements could receive the same feature but I do not need that currently.\n\nI already have the code that I can propose in a PR.\n\nThank you for your feedbacks", "creator": "vherilier@gmail.com", "attachment_id": null, "id": 200771, "time": "2017-09-08T15:46:09Z", "bug_id": 61466, "creation_time": "2017-09-08T15:46:09Z", "tags": [], "is_private": false}]