[{"count": 0, "tags": [], "creator": "bugs-a17@moonlit-rail.com", "attachment_id": 35325, "is_private": false, "id": 200856, "time": "2017-09-13T22:05:23Z", "bug_id": 61517, "creation_time": "2017-09-13T22:05:23Z", "text": "Created attachment 35325\nPatch to fix MariaDB-10.2 detection\n\nThe configure script for APR-Util fails to detect the current \"GA\" release of MariaDB, 10.2.  This is due to a re-factoring of header files under /usr/include/mysql, introduced in mariadb-10.2.8, that move \"server\" and other internal headers into their own private subdirectories.\n\nThe actual MySQL code, in dbd/apr_dbd_mysql.c, has been written to deal with different versions of header files being loaded; it compiles just fine with the newer MariaDB.\n\nBut the autoconf script in build/dbd.m4 looks for internal header files that are not really supposed to be used by client code, specifically my_sys.h and my_global.h.  I rewrote the logic to gate inclusion of MySQL on only two client headers, mysql.h and errmsg.h.  The other header files are still tested, but do not gate inclusion of MySQL.\n\nAs the newer mariadb-10.2 changes the name of its shared library from libmysqlclient to libmariadb, I also added detection and handling for that.\n\nI have attached my patch against apr-util-1.6.0"}, {"count": 1, "tags": [], "bug_id": 61517, "text": "Created attachment 35326\nUpdated patch to compile apr-util against mariadb-10.2.8+\n\nLooks as if I spoke too soon.  Looks as if we need to remove spurious references to my_init() when dealing with mariadb-10.2+\n\nI have updated my patch to include a minor adjustment to dbd/apr_dbd_mysql.c", "id": 200858, "attachment_id": 35326, "creator": "bugs-a17@moonlit-rail.com", "creation_time": "2017-09-14T00:26:41Z", "time": "2017-09-14T00:26:41Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 61517, "attachment_id": null, "text": "This proposed patch seems to complicate the mysql m4, and may make it harder and more error-prone to maintain.\n\nWould it perhaps make sense to give mariadb its own --with-mariadb option in the config?  It can of course still use the mysql client code, and #define APR_MARIADB for use anywhere in the code that wants a distinction (like my_init).", "id": 201105, "time": "2017-09-24T10:34:27Z", "creator": "nick@webthing.com", "creation_time": "2017-09-24T10:34:27Z", "is_private": false}, {"count": 3, "tags": [], "creator": "ppc52776@gmail.com", "is_private": false, "id": 202823, "attachment_id": null, "bug_id": 61517, "creation_time": "2017-12-17T09:38:23Z", "time": "2017-12-17T09:38:23Z", "text": "According to MySQL 5.7 Reference Manual(1),\nmy_init() should be replace with mysql_library_init(0, NULL, NULL);\n\n1: https://dev.mysql.com/doc/refman/5.7/en/c-api-threaded-clients.html"}, {"count": 4, "tags": [], "bug_id": 61517, "text": "(In reply to Nick Kew from comment #2)\n> This proposed patch seems to complicate the mysql m4, and may make it harder\n> and more error-prone to maintain.\n> \n> Would it perhaps make sense to give mariadb its own --with-mariadb option in\n> the config?  It can of course still use the mysql client code, and #define\n> APR_MARIADB for use anywhere in the code that wants a distinction (like\n> my_init).\n\nHi Nick,\n\nOne of the users of both MariaDB and APR-util notified me of this problem on FreeBSD which led me to this PR.\n\nI can confirm that this issue exists with MariaDB 10.2.12 on FreeBSD 11.1 amd64 with APR 1.6.3 / APR-util 1.6.1.\n\nThe patch complicates things but most applications deal with the issue properly. As maintainer of MariaDB ports on FreeBSD, and member of the apache team for FreeBSD ports, I have seen many issues with MariaDB 10.2. In the recent versions, they've modified the headers to be more compatible with software expecting MySQL.\nAll in all I think this complicates things, but could potentially be simplified by refactoring the code in APR-util. It looks like it supports pre-5.0 versions as well.", "id": 203403, "time": "2018-01-22T16:10:06Z", "creator": "brnrd@freebsd.org", "creation_time": "2018-01-22T16:10:06Z", "is_private": false, "attachment_id": null}]