[{"count": 0, "tags": [], "text": "In a firewalled environment it is often necessary to configure your firewall to terminate SSL and to proxy via http to the internal server.\n\nTo ensure the creation of valid links it is necessary to fool the running software on the internal server that it is on ssl. thus links etc are created correctly.\n\nTo enable the process it is common for there to be a config line in your virtual server like the following\n\n# reverse proxy server that sets the \"X-Forwarded-Proto https\" flag\nSetEnvIfNoCase X-Forwarded-Proto https HTTPS=on\n\n\nUnfortunately it appears that the the environment variable set in the virtual host is not honoured in the .htaccess processing stage.\n\nTherefore as an example this snippet of code fails\n\n  # if you enable \"www.\" stripping or enforcement, in order to ensure that\n  # you don't bounce between http and https.\n  RewriteRule ^ - [E=protossl]\n  RewriteCond %{HTTPS} on\n  RewriteRule ^ - [E=protossl:s]\n\nThe above code is taken from a Drupal 8 .htaccess file\n\nI would expect that any environment variables set or replaced in the virtual server section of the config to precede the .htaccess processing and therefore the modified contents of the env be available.\n\nThis does not appear to be happening.", "attachment_id": null, "bug_id": 61518, "id": 200862, "time": "2017-09-14T03:22:26Z", "creator": "developerchris@rebel.com.au", "creation_time": "2017-09-14T03:22:26Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 61518, "attachment_id": null, "is_private": false, "id": 200872, "time": "2017-09-14T13:24:51Z", "creator": "covener@gmail.com", "creation_time": "2017-09-14T13:24:51Z", "text": "%{HTTPS} is not an environment variable lookup, so setting an\nenvironment variable by the same name does not influence the rewriterule."}, {"count": 2, "tags": [], "bug_id": 61518, "attachment_id": null, "id": 200874, "time": "2017-09-14T22:45:49Z", "creator": "developerchris@rebel.com.au", "creation_time": "2017-09-14T22:45:49Z", "is_private": false, "text": "\nThen how does one influence this variable?"}]