[{"count": 0, "tags": [], "creator": "nilabhra123@gmail.com", "attachment_id": null, "text": "Hi,\n\nI am trying to open a file using FileStream Object in C# and I am getting an error: \" \n \" Duplicate name \" SummaryInformation\" \". We are getting this file from our client to parse the file and process the information in our system.\n\nBut one scenario, I have noticed that If I open this file using Microsoft excel and at the time of closing, the excel is asking for save the file. If do no changes in the file and just click save button(or Ctrl + S), then I am not getting any error and the file is getting processed properly. Please find my code and exception details below:\n\nCode:\n\nusing (FileStream sourceStream = File.Open(filePath, FileMode.Open, FileAccess.Read))\n{\n    HSSFWorkbook Workbook = new HSSFWorkbook(sourceStream); // This statement is throwing an exception    \n}\n\nException Message: \" Duplicate name \" SummaryInformation\" \"\n\nException Source: NPOI DLL\n\nTarget Site Name: PopulatePropertyTree \n\nPlease help me with a quick resolution for this. \n\nThanks In advance.\n\nRegards,\nNilabhra Bhattacharjee", "id": 200933, "time": "2017-09-18T15:42:48Z", "bug_id": 61533, "creation_time": "2017-09-18T15:42:48Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 61533, "attachment_id": null, "id": 200934, "time": "2017-09-18T16:25:46Z", "creator": "onealj@apache.org", "creation_time": "2017-09-18T16:25:46Z", "is_private": false, "text": "NPOI is a .NET fork of POI and is maintained by the folks at https://github.com/tonyqus/npoi.\n\nHave you tried addressing your issue over there?\n\nIf you think this bug affects both POI and NPOI libraries, could you attach the file to this bug."}, {"count": 2, "tags": [], "bug_id": 61533, "attachment_id": null, "text": "Hi,\n\nI have tried only with NPOI dll. I can not attach the file as it has sensetive information of other persons.\n\nI can understand that without having the file, reproduction of the issue is not possible at your end. But it will be really helpful if you can tell me for which scenario this exception:\n \" Duplicate name \" SummaryInformation\" \" occurs generally for POI/NPOI library. I hope the file I am receiving is not generated by MS excel itself. It is written by another software. So if you can suggest those reason of this exception, I can check that at the source end of the file.\n\nPlease let me know about this.\n\nBest Regards,\nNilabhra Bhattacharjee", "id": 200935, "time": "2017-09-18T16:57:59Z", "creator": "nilabhra123@gmail.com", "creation_time": "2017-09-18T16:57:59Z", "is_private": false}, {"count": 3, "tags": [], "creator": "dominik.stadler@gmx.at", "is_private": false, "id": 201088, "attachment_id": null, "bug_id": 61533, "creation_time": "2017-09-22T15:01:42Z", "time": "2017-09-22T15:01:42Z", "text": "This is likely more related to NPOI, the only thing that I see based on your description is that there are properties in the internal structures of the workbook which have the same name and thus fail some validation when the file is loaded. \n\nPlease discuss with the NPOI project directly if you need more information on this, however you likely will need to provide more information or a sample file which reproduces the problem.\n\nAs this is more related to another library, I am closing this here."}]