[{"count": 0, "tags": [], "text": "hello,I am a Jmeter beginner, my english is poor,and i down kown the Java Programing.\n.\nrecently,when i use Jmeter to do a simplest test for learning,I got a ploblem with Jmeter.it's not an important issue and didn't affect the continue use of jmeter actually.Here are the details:\n\nEnv:i use the virtual machines which created through VMware Workstation to learn that how to do a distributed testing\n  My Host Machine:Windows 10\n  My Virtual Machine: OpenSUSE Leap 42.1 64Bit(New Installed)\n  Both use the same Jmeter version: 3.2 r1790748\n  Both use the same Java version: 1.8.0_144\n  Method of connection between host and guest machine: NAT\n\nBy the way,actually I hava another CentOS virtual machine and do the same action as follows, it works well and hasn't issue any ploblems. so, may be this issue I reporting now is only happens with OpenSUSE Virtaul Machine,in my case.or may be it just a Jmeter's or OpenSUSE's configuration ploblem and not a issue at all(but i hasn't find any similiaar ploblems as mime on google search and i don't know hot to resolve it)  \n\nstep:\n1、create a simplest test plan(only a thead group contains an http request sampler and a tree view report). request url: any url can be acceessed normaly\n2、On Jmeter Client side, add my remote host's ip with \"192.168.xxx.xxx\" to jmeter.properties, then start Jmeter Client\n3、On Jmeter Slave side, start the jmeter-server\n   result:Jmeter Server start normally, but according to the startup message that the screen print ,it use my public ip, not the private ip(192.168.xxx,xxx)\n4、I hope it use private ip,so i modify the startup script file named \"jmeter-server\" which in bin dir on slave server, at line 30,i change \"Djava.rmi.server.hostname' field with a value as follow:\n  Djava.rmi.server.hostname=`ifconfig | grep -A eth0 | grep inet | awk '{print $2}' | awk -F: '{print $2}'\nuncomment the line and save file\n5、re-run jmeter-server command to startup\n  result:it start normally, and using private ip(192.168.xxx.xxx) as expected according to what the screen print\n6、perform a remote distributed test action, the jmeter server work as expected and return the result to the jmeter clent\n7、now perform a \"remote Exit\" action to this slave server, and then exception raised\n  the jmeter server did't exit at all\n8、in Jmter Clent's jmeter.log file,I found the error message:\n---------------------------start-----------------------------------------\n   2017-09-19 15:41:46,849 INFO o.a.j.e.ClientJMeterEngine: about to exit remote server on 192.168.109.133\n2017-09-19 15:42:09,062 WARN o.a.j.e.ClientJMeterEngine: Could not perform remote exit: java.rmi.ServerException: RemoteException occurred in server thread; nested exception is: \n\tjava.rmi.ConnectException: Connection refused to host: 221.1xx.xxx.xxx; nested exception is: \n\tjava.net.ConnectException: Connection refused (Connection refused)\n2017-09-19 15:42:09,062 INFO o.a.j.e.DistributedRunner: Remote engines have been exited\n----------------------------end,no any more message----------------------\nas you can see, it seems that it reurn my public address somewhere, rahter my private ip(192.168.xxx.xxx). I think,may be this bring about the exception ?(on my CentOS env, I didn't see the exception when I do the same action as above)\n\nrepecting a reply, thanks!", "is_private": false, "id": 200946, "creator": "mengligxuan@gmail.com", "time": "2017-09-19T09:55:25Z", "bug_id": 61535, "creation_time": "2017-09-19T09:55:25Z", "attachment_id": null}, {"count": 1, "text": "Bugzilla is not a support forum.\nPlease ask on user mailing list.", "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 200998, "time": "2017-09-20T11:53:08Z", "bug_id": 61535, "creation_time": "2017-09-20T11:53:08Z", "tags": [], "is_private": false}]