[{"count": 0, "tags": [], "bug_id": 61541, "is_private": false, "id": 200984, "creation_time": "2017-09-20T05:36:23Z", "time": "2017-09-20T05:36:23Z", "creator": "ganeshsurfs@gmail.com", "text": "Hello,\n\nThis is partial bug + partial performance issue. Did not find a feature request site or contact.\n\nThe Apache Server seems to be parsing codes of PHP, Perl, or other FastCGI/CGI JIT. Here are some thoughts over the potential problems that are generated:\n\n1. If a code is changed then the new code is parsed. This might be advantageous since we wont need restart of server. However, a potential problem is code hacks due to internal or external threats will lead to wrong code being parsed.\n2. If a code is parsed everytime there is a request then there is potential lag for reading code by server even if minimal. This can be avoided.\n\nProbable Solution by change in Code Parsing:\n\n* Server start will load the entire web application in the memory. This will avoid/reduce above two problems.\n* This mode is present in Java app servers and NodeJS already and can be a real benefit.\n\nPotential Disadvantages of the Solution:\n\n* Server restart will be needed everytime there is a code base change and a mere FTP push will not enable the new code in the web app. This disadvantage can be resolved by providing it as an option to load web app to memory through the http.conf file. The default may be one that is chosen by the community.\n\nRegards,\nGanesh B", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 61541, "attachment_id": null, "is_private": false, "id": 201546, "time": "2017-10-20T07:40:18Z", "creator": "ganeshsurfs@gmail.com", "creation_time": "2017-10-20T07:40:18Z", "text": "Anyone has any thoughts on this. I am unsure of the support or work involved with this. But can be a big change the way scripting languages work.\n\nRegards,\nGanesh B"}, {"count": 2, "tags": [], "bug_id": 61541, "attachment_id": null, "text": "Hi! \n\nAs far as I know modules like mod_perl, mod_php, etc.. are not part of the default Apache httpd distribution, they are (old) third party contributions, so the parsing issues that you are describing do not apply for a bug report. \n\nUsually mod_cgi or mod_proxy_fcgi are the suggested options (CGI/FCGI protocols) but they don't involve parsing any perl|php|python|etc.. code.\n\nGoing to close this task as invalid :)\n\nLuca", "id": 201547, "time": "2017-10-20T07:55:32Z", "creator": "toscano.luca@gmail.com", "creation_time": "2017-10-20T07:55:32Z", "is_private": false}, {"count": 3, "tags": [], "creator": "ganeshsurfs@gmail.com", "text": "Hello,\n\nRight, I understand the FCI/CGI modes. Makes sense. I see where the problem lies. How difficult would it be to change that with current working functionality. Would this ownus lie on the language's executable?\n\nRegards,\nGanesh", "id": 201551, "time": "2017-10-20T12:03:28Z", "bug_id": 61541, "creation_time": "2017-10-20T12:03:28Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "toscano.luca@gmail.com", "is_private": false, "text": "My point is that since with FCGI/CGI no interpreter is directly embedded/used by httpd your observations about JIT etc.. in my opinion are not applicable. All the work is done by the backend application server or script, nothing more.", "id": 201552, "time": "2017-10-20T12:12:15Z", "bug_id": 61541, "creation_time": "2017-10-20T12:12:15Z", "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 61541, "attachment_id": null, "text": "Fair enough. I do see the point. \n\nWhat is the possibility of integrating this with the httpd server and not just work with fcgi, rather, work with the application as in-memory applications and objects when defined as a server/virtual server in the HTTPD config server? Or is this stupidly insane? ;-)\n\nRegards,\nGanesh", "id": 201553, "time": "2017-10-20T12:31:58Z", "creator": "ganeshsurfs@gmail.com", "creation_time": "2017-10-20T12:31:58Z", "is_private": false}]