[{"count": 0, "tags": [], "bug_id": 61562, "attachment_id": 35373, "id": 201126, "time": "2017-09-25T14:09:45Z", "creator": "jonathan.trichereau@cgi.com", "creation_time": "2017-09-25T14:09:45Z", "is_private": false, "text": "Created attachment 35373\nInformation indicated in Bug Description\n\nHello,\n\nWhen addwe add custom properties to a Microsoft Office Word 97 - 2003 document with POI, it works fine. But when we try to open Word document with Office 2007, a warning about Office file validation appears.\n\nIf we click on \"Open\", we can see our custom properties added.\n\nIs there a way to modify code to avoid this message when we open the file in Office ?\n\nWe reproduce the issue with POI 3.15, 3.16 and 3.17.\n\nCurrently, we use POI 3.10 and we don't have this issue but we need to upgrade POI to resolve other issues in our application.\n\nAlso, we passed Office validation tool (BFFValidator) and we have the following results :\n- Before modify custom properties, file passed in validator\n- After modify custom properties, file failed in validator.\n\nAs attachment, you can find in ZIP file :\n- Code that we use to reproduce the issue : PbWarningValidationOffice.java\n- The original file : beforePOI.doc\n- The file modified with custom properties : afterPOI.doc\n- XML File returned by Office validation tool when the validation failed : afterPOI.doc.bffvalidator.09-25-17_15-54-22.xml\n- Warning when we open file modified in Office : WarningOfficeValidation.jpg\n\nThanks you for your help.\n\nBest Regards,\nJonathan TRICHEREAU."}, {"count": 1, "tags": [], "creator": "dominik.stadler@gmx.at", "is_private": false, "text": "As far as I see the number of custom properties is mainly limited inside Word here. I.e. your sample works with 50 custom properties, but leads to a corrupt file with 100, the actual limit is somewhere between. \n\nI could not find anything in the spec detailing what the limit is exactly, though, so it is hard to put in some limits in Apache POI as it seems to be specific to Microsoft Word itself...\n\nExplorer does show 1000 properties fine, so I don't see anything that we can do inside Apache POI for now until there is some specification from Microsoft that explains how many properties are possible for certain types of documents.", "id": 201385, "time": "2017-10-10T13:03:24Z", "bug_id": 61562, "creation_time": "2017-10-10T13:03:24Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 61562, "text": "Created attachment 35409\nDocument that work with 1000 custom properties", "id": 201390, "time": "2017-10-10T16:33:57Z", "creator": "jonathan.trichereau@cgi.com", "creation_time": "2017-10-10T16:33:57Z", "is_private": false, "attachment_id": 35409}, {"count": 3, "tags": [], "creator": "jonathan.trichereau@cgi.com", "attachment_id": null, "is_private": false, "id": 201391, "time": "2017-10-10T16:45:52Z", "bug_id": 61562, "creation_time": "2017-10-10T16:45:52Z", "text": "Hello Dominik, \n\nThanks you for your reply.\n\nFor me, it doesn't look like a Word limitation but a issue with POI and NPOIFSFileSystem object: for example, with the document that I put in attachment (afterPOI.doc), if we open this document in Word, we have the Office validation warning. But if we do \"save as\" on this document in a new file (for example afterPOI2.doc), this file can be open in Word without warning and we have all the custom properties.\n\nAlso, if we launch the java program with the file that I added in new attachment (docDoc03.doc), new file can be open without warning and we have all the custom properties.\n\nIt seems that the structure of the new Word generated with POI does not necessarily follow the specifications checked in the Office validation module."}]