[{"attachment_id": null, "tags": [], "bug_id": 61566, "text": "The Tomcat Manager has a page to display all the configured TLS ciphers\n\nIt would be nice if it could also show:\n * What certificate is active for a connector\n * What certificate authorities, if any, are trusted for a connector\n\nAt the very least, it'd be good to report the fingerprint and expiry date. Even better would be to show nearly as much as \"openssl x509 text\" would show, and/or allow downloading of the pem-encoded certificate\n\n(The downloading is especially handy for sysadmins used to pem certificates / openssl / gnutls style certificates and tools, fighting with a java keystore. You can get the certificate via openssl s_client or similar, the trusted CAs you can't easily get externally)\n\nTBD - If you're in the middle of a graceful deployment of a new certificate for a connector (via JMX or via #61565), should it show details of both certs, or just the latest one? (I don't have a strong feeling either way)", "count": 0, "id": 201140, "time": "2017-09-26T15:41:56Z", "creator": "apache@gagravarr.org", "creation_time": "2017-09-26T15:41:56Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 61566, "attachment_id": null, "text": "This doesn't look as if it will be as easy as I'd hoped.\n\nWhile the information is fairly easy to get at for NIO and NIO2, it isn't for APR/native. Additional methods would need to be added to the JNI API and I'm not 100% sure the required information is accessible via the OpenSSL API.\n\nGiven that it is possible the APR/native connector will be removed in Tomcat 10, just providing this information for NIO and NIO2 could be considered.", "id": 201543, "time": "2017-10-19T14:33:06Z", "creator": "markt@apache.org", "creation_time": "2017-10-19T14:33:06Z", "is_private": false}, {"count": 2, "tags": [], "creator": "chris@christopherschultz.net", "attachment_id": null, "id": 201824, "time": "2017-10-31T15:40:25Z", "bug_id": 61566, "creation_time": "2017-10-31T15:40:25Z", "is_private": false, "text": "(In reply to Mark Thomas from comment #1)\n> Given that it is possible the APR/native connector will be removed in Tomcat\n> 10, just providing this information for NIO and NIO2 could be considered.\n\n+1\n\nEven if the APR connector remains, exposing this information for Java-based connectors is worthwhile.\n\nIf we get desperate, we can re-read the configuration from the <Connector> and re-load the certificates from the cert store. It won't always be 100% accurate (because you'll be reading the config and not the active cert from memory) but it will get the job done much of the time."}, {"count": 3, "tags": [], "bug_id": 61566, "attachment_id": null, "text": "This has been implemented for connectors that use either the JSSE or OpenSSL implementation that are configured with key stores.\n\nProviding the information for OpenSSL style configuration would require changes to Tomcat Native and, as previously stated, I'm not sure OpenSSL exposes the information.", "id": 202752, "time": "2017-12-13T11:35:01Z", "creator": "markt@apache.org", "creation_time": "2017-12-13T11:35:01Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 61566, "text": "(In reply to Mark Thomas from comment #3)\n> This has been implemented for connectors that use either the JSSE or OpenSSL\n> implementation that are configured with key stores.\n> \n> Providing the information for OpenSSL style configuration would require\n> changes to Tomcat Native and, as previously stated, I'm not sure OpenSSL\n> exposes the information.\n\nCan you please clarify this?\n\nI think the issue is whether the certificate information is available to the Java components instead of coming from native/APR right? So the information should be available to any Java-based connector (NIO, NIO2) regardless of the \"configuration style\" that is being used, and the APR connector won't report this information (at least, not yet).", "count": 4, "id": 202774, "time": "2017-12-13T22:18:06Z", "creator": "chris@christopherschultz.net", "creation_time": "2017-12-13T22:18:06Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 61566, "attachment_id": null, "text": "For the feature to work, all of the following must be true:\n- HTTP connector\n- NIO or NIO2 implementation\n- JSSE style TLS configuration (key stores) used\n\nIt does not work for the HTTP APR/native connector.\nIt does not work if OpenSSL style configuration is used.\n\nWhether or not it works is independent of the TLS implementation (JSSE or OpenSSL) used.\n\nIt does not apply to AJP connectors.\n\nThe TLS information is extracted during the configuration phase. Hence the configuration style is important.\n\nWhen the OpenSSL configuration style is used, the same information isn't available in the same form at the same point. Rather than extracting it in the right form from OpenSSL (which would require JNI changes) it should be possible to derive it from the configuration files and cache it.", "id": 202776, "time": "2017-12-14T11:13:38Z", "creator": "markt@apache.org", "creation_time": "2017-12-14T11:13:38Z", "is_private": false}]