[{"count": 0, "tags": [], "creator": "odoma04@ca.com", "text": "Running our proxied request via mod_jk we are seeing the returned content-type being changing to all lowercase: \n\neg:\n  Content-Type: application/xxx.yyyy.dddd+JSON; charset=utf-8\nto:\n  Content-Type: application/xxx.yyyy.dddd+json; charset=utf-8\n\n\nWe thought this was tomcat at first, but turns out to be mod_jk.c that is the cause : \n\nhttp://svn.apache.org/repos/asf/tomcat/jk/trunk/native/apache-2.0/mod_jk.c\n \nfor (h = 0; h < num_of_headers; h++) {\n        if (!strcasecmp(header_names[h], \"Content-type\")) {\n            char *tmp = apr_pstrdup(r->pool, header_values[h]);\n            ap_content_type_tolower(tmp);\n            /* It should be done like this in Apache 2.0 */\n            /* This way, Apache 2.0 will be able to set the output filter */\n            /* and it make jk useable with deflate using */\n            /* AddOutputFilterByType DEFLATE text/html */\n            ap_set_content_type(r, tmp);\n        }\n\n\nNow on the validity of upper vs lower - it seems a little bit of a grey area:\n\nhttps://www.w3.org/Protocols/rfc1341/4_Content-Type.html\n  \nThe type, subtype, and parameter names are not case sensitive. For example, TEXT, Text, and TeXt are all equivalent. Parameter values are normally case sensitive, but certain parameters are interpreted to be case- insensitive, depending on the intended use. (For example, multipart boundaries are case-sensitive, but the \"access- type\" for message/External-body is not case-sensitive.)\n \n \nIn our usage we are acting as a proxy, and as a proxy we dont have an opinion on if it should be forced to lower case or allow mixed case - we just want to pass on what we get :-) - but certainly some JkOption may be useful way to retain original behaviour but allow overwriting. \n\nAlso if we run the request via mod_proxy/mod_proxy_ajp.c instead then the returned content-type header is not changed.", "id": 201476, "time": "2017-10-15T23:07:08Z", "bug_id": 61621, "creation_time": "2017-10-15T23:07:08Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "markt@apache.org", "text": "It is worth noting that ap_content_type_to_lower() only changes the type and sub-type. Parameter names and values remain unchanged.\n\nRemoving this call in mod_jk breaks the use of AddOutputFilterByType.\n\nTesting with mod_proxy confirms that it doesn't change the case of the Content-type but also demonstrates that the use of AddOutputFilterByType is broken with mod_proxy if the Content-type is not lower case.\n\nI looked, but could not find, any bug reports against mod_proxy for AddOutputFilterByType not working.\n\nI don't have any objections to making the mod_jk behaviour configurable although I do think that the current behaviour should remain the default. I am therefore moving this issue to an enhancement request.", "id": 202340, "time": "2017-11-22T14:15:48Z", "bug_id": 61621, "creation_time": "2017-11-22T14:15:48Z", "is_private": false, "attachment_id": null}]