[{"count": 0, "tags": [], "creator": "scott-apache@shambarger.net", "text": "I have a reverse proxy to my cable modem.  The modem returns an invalid header field \"Cache-Control : no-cache\".  So, to work around the problem, I enabled ProxyBadHeader Ignore in my configuration.\n\nHowever, apache returns the same 500 Internal Server Error I receive when ProxyBadHeader is the default IsError (and not even the 502 Bad Gateway documented for that setting)\n\nTracking the issue through the source, the problem appears that ap_proxy_read_headers() only applies ProxyBadHeader if the header is missing a \":\".  When the proxied header is passed as a response to the request, http_filters.c:check_header() fails for the header, and the connection is aborted with 500.\n\nThe solution is that the same key/value checks that check_header() performs should be done in ap_proxy_read_headers() before the header is considered valid and added to r->headers_out (and could provide better trace logging when a bad header is encountered there).\n\nNOTE: Ideally, there should be a new value for ProxyBadHeader which would allow a distinction between \"ignore and discard\" and \"ignore and pass through\" (so bad headers could be filtered)\n\nTo summarize:\n* IsError should return 502 on any header that fails check_header()\n* Ignore should probably discard bad headers as documented (better name would be \"Discard\" :).\n* StartBody should start body based on the same check_header() check..\n\n...and I would suggest a new value:\n* Pass which should actually allow the header to be filtered (so the original values might be fixed and retained, but only if configured to do so!).\n\nI could provide a patch if needed for the above, but perhaps there's another preferred alternative?\n\nFor references, here's my proxy configuration:\n\nProxyBadHeader Ignore                                                           \n<Location \"/cable/\">                                                            \n  ProxyPass http://192.168.100.1/                                               \n</Location>", "id": 201827, "time": "2017-10-31T19:59:46Z", "bug_id": 61706, "creation_time": "2017-10-31T19:59:46Z", "is_private": false, "attachment_id": null}]