[{"count": 0, "attachment_id": null, "bug_id": 61722, "text": "We did some changes in bug #57840 to use \"new Integer()\" instead of \"Integer.valueOf()\", because the caching for reduced memory use in \"valueOf()\" comes with a slight CPU penalty, see r1747837.\n\nHowever later on, these were reverted again as some code cleanup tools flag these as \"sub-optimal\" and suggest to change them to \"valueOf()\". \n\nBefore re-applying this again, let's do some research if there are better ways to do this as it seems we create lots of objects, mostly to look up values in maps. \n\nMaybe we should use something like Trove Maps which allows to use primitives in maps directly without the cost of converting to objects, see https://bitbucket.org/trove4j/trove for details.\n\nSee the performance test added in r1747878 for a starting point of an evaluation of the effect of changes.", "id": 201891, "time": "2017-11-03T22:21:08Z", "creator": "dominik.stadler@gmx.at", "creation_time": "2017-11-03T22:21:08Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "bug_id": 61722, "attachment_id": null, "text": "This article[1] has an interesting set of tests, results, and summary info for multiple primitive collections frameworks, including Trove.\n\nMost interesting points to me:\n * Trove isn't under active development, and hasn't been for a few years.  It was also slowest.\n * Fastutil is the overall winner for performance, although memory wasn't a consideration in these tests.\n * Fastutil is a 28M JAR file (!)\n\nIf we are only interested in Map<int, ? extends Object> type maps, perhaps a slimmed-down version of a stable build of Fastutil could be used.  It appears license compatible, and we could investigate an AutoJar or similar step added to the build to create an artifact bundled/released with POI.\n\n[1] http://java-performance.info/hashmap-overview-jdk-fastutil-goldman-sachs-hppc-koloboke-trove-january-2015/", "id": 201892, "time": "2017-11-03T23:32:18Z", "creator": "gwoolsey@apache.org", "creation_time": "2017-11-03T23:32:18Z", "is_private": false}, {"count": 2, "tags": [], "creator": "dominik.stadler@gmx.at", "text": "FYI, some quick and dirty test with the file from bug #57840, not representative as not done in clean environment:\n* Origin: 3m35s\n* With new Integer(): 3m22s\n* With Trove and new Integer(): 2m28s", "id": 201893, "time": "2017-11-04T09:10:45Z", "bug_id": 61722, "creation_time": "2017-11-04T09:10:45Z", "is_private": false, "attachment_id": null}]