[{"count": 0, "tags": [], "bug_id": 61740, "attachment_id": 35509, "is_private": false, "id": 202010, "time": "2017-11-08T23:13:55Z", "creator": "david.frankson@infinitecampus.com", "creation_time": "2017-11-08T23:13:55Z", "text": "Created attachment 35509\nscreenshot of bug, code to reproduce (hopefully)\n\nI’m trying to troubleshoot an intermittent response error using Tomcat 8.5.23 or 9.0.1 when using HTTP/2.  Basically we noticed that when running in HTTP/2 random css, js or html pages would error out causing small bugs that would go away on refresh.  We were finally able to isolate it to a test case that \"usually\" reproduces the error. \n\nThe test case uses 100 iframes to draw 10 table cells that each get colored green by a seperate css file so in total it makes 1101 requests.  If some of those requests don't make it and then it displays red on that cell.  (See attached image in the zip of the error in action).  I reproduced it using the latest version of Firefox with caching disabled so that it makes every request independently.  It is very hard to reproduce in Chrome since it tends to ignore no-caching settings.  I've also found it easier to reproduce using a client that has Windows 10 and a powerful computer.  A less powerful client running Windows 7 had difficulty reproducing the error but still could after enough tries.\n\nSo Tomcat running on Windows x64 and fresh download of either 9.0.1 or 8.5.23 with stock configuration I enable HTTP/2 with:\n\n    <Connector port=\"8443\" protocol=\"org.apache.coyote.http11.Http11NioProtocol\"\n               maxThreads=\"150\" SSLEnabled=\"true\" >\n        <UpgradeProtocol className=\"org.apache.coyote.http2.Http2Protocol\" />\n        <SSLHostConfig>\n            <Certificate \n                certificateKeystoreFile=\"xxx.pfx\"\n                certificateKeystorePassword=\"xxx\"\n                certificateKeystoreType=\"PKCS12\"\n                type=\"RSA\" />\n        </SSLHostConfig>\n    </Connector>\n\nAnd put the test files in the ROOT app and then hit https://localhost:8443/newtest.html until the error happens.\n\nAs you can see in the image, some of the responses have 0 bytes and they will display in red, some of the responses have response bodies but no HTTP status code, some have HTTP 200 but no response body.  When there is no http status returned the access log records these as 500 errors.  I can't find any meaningful exception with catalina debug logging turned on."}, {"count": 1, "tags": [], "bug_id": 61740, "attachment_id": null, "id": 202014, "time": "2017-11-09T08:29:45Z", "creator": "remm@apache.org", "creation_time": "2017-11-09T08:29:45Z", "is_private": false, "text": "According to my testing, this demonstrates some amount of reliability issues and possible fixes pretty much everywhere, but more with NIO2. Lots of things to work on and debug, thanks for keeping us busy ;)"}, {"count": 2, "tags": [], "text": "I fixed the NIO2 specific issue (it will be in 9.0.2) pending possible further improvements. The behavior is now the same as with NIO, I can reproduce that very few of the static requests fail and I don't see where the root cause can be at the moment.", "is_private": false, "id": 202024, "creator": "remm@apache.org", "time": "2017-11-09T14:51:47Z", "bug_id": 61740, "creation_time": "2017-11-09T14:51:47Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 61740, "is_private": false, "id": 202171, "time": "2017-11-16T11:45:22Z", "creator": "markt@apache.org", "creation_time": "2017-11-16T11:45:22Z", "tags": [], "text": "A huge thank you for the test case. This bug has all the hallmarks of being very tricky to track down the root cause. Having a reliable test case is an enormous help.\n\nI'm able to reproduce the problem and, with debug logging for HTTP/2 enabled, I can see an exception relating to HPACK decoding. I'm looking into this now."}, {"count": 4, "attachment_id": null, "bug_id": 61740, "is_private": false, "id": 202172, "time": "2017-11-16T12:25:10Z", "creator": "markt@apache.org", "creation_time": "2017-11-16T12:25:10Z", "tags": [], "text": "Fixed in:\n- trunk for 9.0.2 onwards\n- 8.5.x for 8.5.24 onwards\n\nAgain, many, many thanks for the test case."}, {"count": 5, "tags": [], "creator": "david.frankson@infinitecampus.com", "is_private": false, "text": "Thanks for the speedy fixes!", "id": 202177, "time": "2017-11-16T13:39:50Z", "bug_id": 61740, "creation_time": "2017-11-16T13:39:50Z", "attachment_id": null}]