[{"count": 0, "tags": [], "creator": "gaspardzebear@hotmail.fr", "attachment_id": null, "is_private": false, "id": 202035, "time": "2017-11-10T14:39:23Z", "bug_id": 61743, "creation_time": "2017-11-10T14:39:23Z", "text": "When doing remote testing, remote nodes may send lot of datas to master. \nWhen remote node are in different geographical location, the bandwidth consumption is high.\n\nNone of the current mode is satisfying : \n- The statistical mode is not really usefull as it gives too few informations.\n- Stripped mode truncate datas.\n- Diskstore just postpones the sending of datas : the whole file is still sent as-is at the end of test.\n\nIn order to reduce the amount of data, compress the flow would limit the requested bandwith could be a good approach (for example, Diskstore mode + compression) : as most of the flow is text, it could save 70-80% bandwitdh."}, {"count": 1, "tags": [], "bug_id": 61743, "is_private": false, "text": "(In reply to gaspardzebear from comment #0)\n> When doing remote testing, remote nodes may send lot of datas to master. \n> When remote node are in different geographical location, the bandwidth\n> consumption is high.\n> \n> None of the current mode is satisfying : \n> - The statistical mode is not really usefull as it gives too few\n> informations.\n> - Stripped mode truncate datas.\n> - Diskstore just postpones the sending of datas : the whole file is still\n> sent as-is at the end of test.\n> \n> In order to reduce the amount of data, compress the flow would limit the\n> requested bandwith could be a good approach (for example, Diskstore mode +\n> compression) : as most of the flow is text, it could save 70-80% bandwitdh.\n\nHello,\nFor me stripped mode + Batch or Async does a correct job and would be better if we also stripped request content.\nI don't share the thinking that Strip truncates datas, it does but not useful data  during a load test.\n\n\nZipping has some drawbacks:\n- It is very costly in terms of CPU on servers\n- It will not make things better as we use RMI\n\nBut if you have a working patch that shows I'm wrong, I'll be more than happy :-)\n\nRegards", "id": 202038, "time": "2017-11-10T15:28:09Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2017-11-10T15:28:09Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "Hi,\n\nNice to read from you (I got your book)\n\nSorry but I don't have a patch ;).\n\nWe have noticed this problem when trying to use Jmeter instead of the commercial product we use in my company. The generated traffic was the root cause of a network incident with impact on production. Bad news as I'm try to promote a Jmeter strategy !\n\nWe tested and at the same time monitored the traffic in various cases, and could not find a relevant solution with the different native modes in Jmeter.\n \nZip a file at the end of the test would not be a probleme in terms of CPU as the test would be over.\n\nWe'll go on exploring what we can do (maybe write a specific sample sender)\n\nRegards", "is_private": false, "id": 202042, "creator": "gaspardzebear@hotmail.fr", "time": "2017-11-10T18:24:48Z", "bug_id": 61743, "creation_time": "2017-11-10T18:24:48Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 61743, "text": "(In reply to gaspardzebear from comment #2)\n> Hi,\n> \n> Nice to read from you (I got your book)\n\nThanks for the kind words, I'm sure the other authors will be happy to hear that !\n> \n> Sorry but I don't have a patch ;).\n> \n> We have noticed this problem when trying to use Jmeter instead of the\n> commercial product we use in my company. The generated traffic was the root\n> cause of a network incident with impact on production. Bad news as I'm try\n> to promote a Jmeter strategy !\n> \n> We tested and at the same time monitored the traffic in various cases, and\n> could not find a relevant solution with the different native modes in Jmeter.\n>  \n> Zip a file at the end of the test would not be a probleme in terms of CPU as\n> the test would be over.\n\nThat would be an option.\n> \n> We'll go on exploring what we can do (maybe write a specific sample sender)\n\nYou can also have a look at Bug 61087\n> \n> Regards", "id": 202043, "time": "2017-11-10T19:32:43Z", "creator": "p.mouawad@ubik-ingenierie.com", "creation_time": "2017-11-10T19:32:43Z", "is_private": false, "attachment_id": null}]