[{"count": 0, "tags": [], "creator": "lazar.kirchev@gmail.com", "text": "When AuthConfigFactoryImpl.doRegisterConfigProvider() tries to load the class of the provider it does not check for null. However, according to the javadoc in the jaspic specification null could be passed as provider name.\n\nTherefore a check for null is necessary in this place. And if it is null, according to the spec the registration ID should be returned, but subsequent calls to getConfigProvider() should return null.\n \nThe only thing which shoud be added to the current implementation in order to support this behavior is in case of null provider class name, only to return the registration ID without modifying the provider registration structures \nor the persistent storage. \n\nIn this way it will actually return a non-existing registration ID, but if getConfigProvider() is called with non-existing registration ID it returns null, so it behaves according to the spec.", "id": 202231, "time": "2017-11-18T14:11:35Z", "bug_id": 61784, "creation_time": "2017-11-18T14:11:35Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 61784, "text": "This pull request contains a test case which illustrates the problem and a fix for it: https://github.com/apache/tomcat/pull/92", "id": 202232, "time": "2017-11-18T14:12:46Z", "creator": "lazar.kirchev@gmail.com", "creation_time": "2017-11-18T14:12:46Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 61784, "text": "the suggested patch addresses the NPE but doesn't handle the case of an existing persistent registration for the given registration ID. My reading of the spec that such a registration should be removed.", "id": 202286, "time": "2017-11-20T20:08:01Z", "creator": "markt@apache.org", "creation_time": "2017-11-20T20:08:01Z", "tags": [], "is_private": false}, {"count": 3, "attachment_id": null, "bug_id": 61784, "text": "Thanks Mark!  I overlooked this case. The persistent registration definitely should be removed, because otherwise the subsequent call to getConfigProvider() will return it instead of null.\n\nI will update the patch with this.", "id": 202297, "time": "2017-11-21T07:58:31Z", "creator": "lazar.kirchev@gmail.com", "creation_time": "2017-11-21T07:58:31Z", "tags": [], "is_private": false}, {"count": 4, "tags": [], "bug_id": 61784, "text": "Now here comes the question what should getRegistrationIds(null) return if there is an auth config provider with null class name registered. \n\nAccording to the spec, if a provider with a null class name is registered, a subsequent call to getCofigProvider() with this layer and app context should return null, but it does not specify if its registration id should be returned in the list of all registration ids. \n\nIt seems reasonable to be included. However, in this case it should be possible to persist providers with null class names and also it should be stored in the in-memory registration structures. \n\nOr, we may assume that this is no actual registration as functionally it does not bring any value and not store it in-memory or persist it.\n\nMarc, what do you think about this? How do you interpret the spec?", "id": 202303, "time": "2017-11-21T12:52:00Z", "creator": "lazar.kirchev@gmail.com", "creation_time": "2017-11-21T12:52:00Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "markt@apache.org", "text": "My reading of the spec leans towards the ID being returned in getRegistrationIds() and all that that implies.", "id": 202312, "time": "2017-11-21T20:06:04Z", "bug_id": 61784, "creation_time": "2017-11-21T20:06:04Z", "is_private": false, "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 61784, "text": "Thanks Mark! Agree.\n\nHere is a pull request with patch + tests: https://github.com/apache/tomcat/pull/94", "id": 202341, "time": "2017-11-22T15:13:10Z", "creator": "lazar.kirchev@gmail.com", "creation_time": "2017-11-22T15:13:10Z", "is_private": false, "attachment_id": null}, {"count": 7, "attachment_id": null, "bug_id": 61784, "is_private": false, "id": 202346, "time": "2017-11-22T20:19:07Z", "creator": "markt@apache.org", "creation_time": "2017-11-22T20:19:07Z", "tags": [], "text": "Thanks for the updated patch and test cases.\n\nFixed in:\n- trunk for 9.0.2 onwards\n- 8.5.x for 8.5.24 onwards"}]