[{"count": 0, "tags": [], "bug_id": 61795, "text": "As discussed in the mailing list, it could be useful to provide a property of the authenticator with which to specify the name of a custom JASPIC callback handler implementation.\n\nThis pull request https://github.com/apache/tomcat/pull/93 illustrates the idea.\n\nIf we agree that this is OK and this will be the name of the property, I will also add it to the documentation.\n\nI have not included a test because I had some concerns. I want to test only the instantiation of the Callback Handler instance, but this is done in a private method. So I see several approaches:\n\n- in such cases I sometimes make the method package private so that it can be accessed by the test. However, I see that this is not an accepted practice in the Tomcat code, so I do not want to use it\n\n- call the method with reflection - I see that in some Tomcat tests reflection is actually used\n\n- use a lot of mocking and test via the authenticate method of a child class of the AuthenticatorBase\n\n- go for a test with a Tomcat instance and and a sample application and test the whole scenario of JAPSIC authentication with custom callback handler \n\nWhich of these approaches do you prefer?", "id": 202307, "time": "2017-11-21T13:17:06Z", "creator": "lazar.kirchev@gmail.com", "creation_time": "2017-11-21T13:17:06Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": null, "bug_id": 61795, "text": "The approach looks good to me.\n\na) The package private approach has been used in a few places. It is correct that it isn't often the preferred approach.\n\nb) Reflection might be the simplest option here.\n\nc) Mocking is also an option although not one that is used very often.\n\nd) A test with a Tomcat instance is often used - especially when the amount of re-use possible means minimal additional test code needs to be written.\n\nUltimately it is your call. My own preference would be for b) or d) followed by c) then a) but I'm not the one implementing this. If you have a strong preference, go with that.", "id": 202315, "time": "2017-11-21T21:25:51Z", "creator": "markt@apache.org", "creation_time": "2017-11-21T21:25:51Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "creator": "lazar.kirchev@gmail.com", "attachment_id": null, "text": "Thanks Mark! As I want to test only the creation logic, I also prefer b). \n\nI updated the pull request with tests and added the property to the documentation.", "id": 202328, "time": "2017-11-22T08:30:59Z", "bug_id": 61795, "creation_time": "2017-11-22T08:30:59Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 61795, "attachment_id": null, "id": 202347, "time": "2017-11-22T20:49:42Z", "creator": "markt@apache.org", "creation_time": "2017-11-22T20:49:42Z", "is_private": false, "text": "Yet again, many thanks. Patch applied.\n\nFixed in:\n- trunk for 9.0.2 onwards\n- 8.5.x for 8.5.24 onwards"}]