[{"count": 0, "tags": [], "creator": "dan.hawkes@fissara.com", "attachment_id": null, "id": 202363, "time": "2017-11-23T11:44:35Z", "bug_id": 61804, "creation_time": "2017-11-23T11:44:35Z", "is_private": false, "text": "I'm seeing the manager prematurely close the connection when calling the /text/deploy API. The deployment itself is eventually successful, but this means the's no reliable way of telling if the deployment is succeeding.\n\nWhen the connection is closed, the manager appears to stop accepting connections for a while - I suspect until the deployed application is running. \n\n- Approximately 50% of requests fail with the connection being closed.\n- There doesn't appear to be a constant amount of time before these failures - anything from 20 - 200 seconds.\n- Both the manager and other apps are served on the same port.\n- I'm testing this with curl on localhost, so can rule out proxy-related issues\n\n\nAny thoughts on what might be causing this?"}, {"count": 1, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "id": 202370, "time": "2017-11-23T14:11:03Z", "bug_id": 61804, "creation_time": "2017-11-23T14:11:03Z", "is_private": false, "text": "This is too early to file a bug, you need to investigate the deploy time behavior described on the user list first. IMO the root \"cause\" is that there is no progress feedback during the deployment, and the deploy method is synced (= \"the manager appears to stop accepting connections for a while\"). The outcome of the deploy operation is not tied to the http connection timing out as well (that's a good thing). Thus, it is likely the webapp deploy simply takes a very long time [which might or might not be caused by a bug]."}, {"count": 2, "tags": [], "bug_id": 61804, "attachment_id": null, "text": "+1\n\nI've confirmed that the Manager application continues to be responsive to other commands (e.g. list) while a deployment is in progress.\n\nI have also been unable to replicate the broken connection (with curl on localhost) with an app that takes 5+ minutes to deploy.\n\nTo save an iteration on the users list, I recommend you look at the traffic with Wireshark to see exactly what is going on.\n\nAlso, when you do post, please ensure you provide the full <Connector ... /> configuration from server.xml", "id": 202373, "time": "2017-11-23T14:55:49Z", "creator": "markt@apache.org", "creation_time": "2017-11-23T14:55:49Z", "is_private": false}]