[{"count": 0, "tags": [], "bug_id": 61805, "attachment_id": null, "text": "In JMeter to execute you must create and run Thread Group with configuration and other elements, also for newbies reading the getting started can be a bit too much information.\n\nIn Postman (or curl) you can just enter request details and submit\n\nIn Blazemeter you can Creating a URL/API Test similarly.\n\nI suggest to add a button as Submit/Send/Test in HTTP request (Or any Sampler) that will send the Request as is (optional loading variables/properties beforehand)", "id": 202367, "time": "2017-11-23T12:56:03Z", "creator": "orimarko@gmail.com", "creation_time": "2017-11-23T12:56:03Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 61805, "attachment_id": null, "id": 202368, "creation_time": "2017-11-23T13:58:10Z", "time": "2017-11-23T13:58:10Z", "creator": "p.mouawad@ubik-ingenierie.com", "text": "Hello Orimarko (I'd be happy to know your real name :-) ),\nThanks for your ideas.\n\nCould you be more clear on how you see this feature ?\n- Does it mean that user has only to enter an URL somewhere and run ? If so what about  POST body for example ? \n- Or will entering an URL have the effect of creating the Test plan ?\n- Or something else ?\n\nThanks", "is_private": false}, {"id": 202371, "tags": [], "bug_id": 61805, "is_private": false, "count": 2, "text": "The basic is to put all URL in path and click Send, \n\nBut better solution is to be able to load all attributes of HTTP request (Or other Sampler) with all the available variables and properties in Test plan level and send request as it'll executed as a single Sampler (in Thread group with threads number 1 and loop count 1)\n\nA \"medium\" solution is to submit request as is without evaluating any variables/functions", "time": "2017-11-23T14:29:36Z", "creator": "orimarko@gmail.com", "creation_time": "2017-11-23T14:29:36Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 61805, "is_private": false, "id": 202374, "creation_time": "2017-11-23T14:57:17Z", "time": "2017-11-23T14:57:17Z", "creator": "orimarko@gmail.com", "text": "The feauture ( need to update to enhancement) will be a button in GUI In HTTP Request (and maybe other Samplers)", "attachment_id": null}]