[{"count": 0, "tags": [], "creator": "raffaele.sandrini@origammi.co", "attachment_id": null, "id": 202417, "time": "2017-11-26T12:57:08Z", "bug_id": 61818, "creation_time": "2017-11-26T12:57:08Z", "is_private": false, "text": "This will be a somewhat fuzzy issue because I don't have much data. Please accept my apologies for that.\n\nToday our production site went offline because it was impossible to connect to it using TLS. The httpd error log just showed this error: \n\nAH01941: stapling_renew_response: responder error\n\nwithout any supporting information. There was no indication that some name could not be resolved or some IP not be reached.\n\nThe server is using the event MPM and pretty quickly all slots were in status \"R\" and the server reported:\n\nAH00484: server reached MaxRequestWorkers setting, consider raising the MaxRequestWorkers setting\nand\nAH03490: scoreboard is full, not at MaxRequestWorkers.Increase ServerLimit.\n\nHence, the site was offline.\n\nOur stapling configuration:\n\nSSLUseStapling on\nSSLStaplingResponderTimeout 5\nSSLStaplingReturnResponderErrors off\nSSLStaplingCache shmcb:/var/run/ocsp(128000)\n\nI am not an export but from this configuration and the supporting documentation I conclude that this situation should never have happened. Even with the OCSP server not being available it should have just continued without \"stapling\" the response.\n\nHence, this bug report.\n\nNote 1: The certificate in question is issued by GoDaddy EV CA and I could personally not confirm any issue with their OCSP service.\n\nNote 2: At the same time vhosts using Let's Encrypt certificates still worked with stapling enabled leading to the conclusion that there was something up with GoDaddy. However as stated above, the error log did not indicate anything."}, {"count": 1, "tags": [], "creator": "christophe.jaillet@wanadoo.fr", "attachment_id": null, "text": "This is odd.\nAll paths that lead to this error (AH01941) seem to have some additional information logged at APLOG_ERR level.", "id": 202419, "time": "2017-11-26T15:20:51Z", "bug_id": 61818, "creation_time": "2017-11-26T15:20:51Z", "is_private": false}, {"count": 2, "tags": [], "creator": "raffaele.sandrini@origammi.co", "attachment_id": null, "is_private": false, "id": 202420, "time": "2017-11-26T16:50:53Z", "bug_id": 61818, "creation_time": "2017-11-26T16:50:53Z", "text": "I just rescanned the log files, vhost specific and server log file, and I could not find any other related messages than the ones mentioned above (AH01941, AH00484 and AH03490).\n\nAlso to add, I restarted Apache several times and consistently got into that state until I eventually disabled OCSP stapling (setting \"SSLUseStapling off\")."}]