[{"count": 0, "tags": [], "creator": "helene@loveknitting.com", "text": "Created attachment 35592\nloadTestSample\n\nHello,\n\nI have done a load test to test our api and I am simulating endpoints normally triggered by user action. The jmeter file I have attached can be resumed like that:\n\nFor each thread:\n- login a user\n- get a list of free patterns (it's an entity like another)\n- add a random number of patterns to user's library with a while controller\n\nI am not sure what is causing the problem, but when I start to have like 2 & 3 thread & I configure the thread to loop 3 times, jmeter just stop doing anything after a number of patterns added to the user's library. But no error reported on the log, it didn't reach the end of the script and the timer continued to run as it is still running but doing something else than continuing my samplers. And Nothing can stop the test, I have to kill jmeter in order to stop it.\n\nI have attached a clean example of what my jmeter file looks like.\n\nI think the problem is inside the controller \"Add internal patterns to library\" as I have done lots of test today and everything is fine if I remove this controller.\n\nAny help, suggestion is welcome.\n\nThank you.", "id": 202624, "time": "2017-12-07T17:58:07Z", "bug_id": 61870, "creation_time": "2017-12-07T17:58:07Z", "is_private": false, "attachment_id": 35592}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "text": "Hello,\nBugzilla is not a support forum.\nFor questions like this, please use mailing list.\nAnyway I cannot help much on this as I don't have access to server and cannot run test, but you should check by adding debug samplers that the condition is valid:\n${__javaScript(\"${community_create_library_item_finished}\"!=\"true\")} \n\nAlso ensure you follow best practices in your plan:\n\n\n- http://jmeter.apache.org/usermanual/best-practices.html", "id": 203066, "time": "2018-01-04T10:50:15Z", "bug_id": 61870, "creation_time": "2018-01-04T10:50:15Z", "is_private": false, "attachment_id": null}]