[{"count": 0, "tags": [], "bug_id": 61894, "attachment_id": null, "text": "Trying to see what the status or usefulness of old Jakarta projects still in use in Apache ant. Seems the following are still in use\n\njakarta-oro retired 2010\nhttps://attic.apache.org/projects/jakarta-oro.html\n\njakarta-regex retried 2011\nhttps://attic.apache.org/projects/jakarta-regexp.html\n\nBoth still seem needed for ant 1.10.1. I assume those portions of ant can be omitted to drop the following dependencies. Just seems strange for them to remain in use many years after retirement.\n\nThanks!", "id": 202744, "time": "2017-12-12T19:26:28Z", "creator": "wlt-ml@o-sinc.com", "creation_time": "2017-12-12T19:26:28Z", "is_private": false}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "attachment_id": null, "id": 202746, "time": "2017-12-12T20:59:57Z", "bug_id": 61894, "creation_time": "2017-12-12T20:59:57Z", "is_private": false, "text": "They are dependencies for optional parts of Ant. Much of it became obsolete with Java 1.4 even though at least ORO used to be technically superior to java.util.regex. Even with Java 10 users can explicitly ask for the jakarta implementatins over java.util.regex.\n\nWe simply never saw any reason to remove working code that may be used by some people and can be ignored by all others.\n\nAre they causing any problems for you?"}, {"count": 2, "tags": [], "text": "No they are not causing any problems. I was just packing stuff on Gentoo, or migrating away from in my overlay. I noticed they were very old. Just wondering if its worth while to keep offering such packages. I can remove them from the ant package, and delete referencing classes. I have done that with some other stuff, like jaxen and jdom. That have circular dependencies. But rather see people stop using jaxen, and if jdom, jdom2. They do not want to update, and its just all legacy stuff that should be avoided IMHO. Which I guess jakarta stuff falls into that category.\n\nThe only problem I see in general is propagating old stuff, and allowing others to continue to use rather than move on to more current stuff. There is so much legacy cruft in the Java world. Anywhere it can be shed I am happy to see such. Not my personal mission per se. But would be nice to move past stuff no longer being developed. I do modify packages to use newer stuff at times. Rather see things move forward than keep on with the old.\n\nWhat you said about it being superior makes sense. Though if people felt that way and continued using it. I would assume they would want to further the code, be an active project, etc. If nothing else update it to generics, lambda, and other stuff. Though that may effect its performance.\n\nEither way no worries. I had assumed it was optional just wanted to understand why it was in ant still. I can address it for now. Welcome to close or leave open. Thank you for clarifying!", "attachment_id": null, "id": 202747, "creation_time": "2017-12-12T23:01:02Z", "time": "2017-12-12T23:01:02Z", "creator": "wlt-ml@o-sinc.com", "bug_id": 61894, "is_private": false}, {"count": 3, "tags": [], "text": "Looking around more, seems other things are still using it. I think most all are apache prodjects, castor-xml, jmeter-components, jmeter-core, and some other stuff. Not all apache. There does seem to be an issue with legacy Java code around Apache. Not sure if I can help to improve that.", "is_private": false, "id": 202748, "creator": "wlt-ml@o-sinc.com", "time": "2017-12-12T23:06:04Z", "bug_id": 61894, "creation_time": "2017-12-12T23:06:04Z", "attachment_id": null}]