[{"attachment_id": null, "tags": [], "bug_id": 61895, "text": "The DefaultTempFileCreationStrategy uses File.deleteOnExit() which holds on to temporary files until the JVM exists. This causes the JVM heap size to grow indefinitely until you run into an OutOfMemory error. More problematically, this queue of files cannot be cleaned manually. So code that writes to spreadsheets regularly, MUST restart every once and a while. Hence all File.deleteOnExit calls should be removed.\n\nSee also: https://puneeth.wordpress.com/2006/01/23/filedeleteonexit-is-evil/", "count": 0, "id": 202753, "time": "2017-12-13T12:05:17Z", "creator": "janwillem.meyling@athenastudies.nl", "creation_time": "2017-12-13T12:05:17Z", "is_private": false}, {"count": 1, "tags": [], "text": "Apache POI provides a plugable temp file creation strategy for exactly this, so you can easily write your own which does not use File.deleteOnExit() and define it as the strategy to use in your application. \n\nIf you succeed and think your approach would be useful for POI overall, then please share it here.", "is_private": false, "id": 202757, "creator": "dominik.stadler@gmx.at", "time": "2017-12-13T14:35:55Z", "bug_id": 61895, "creation_time": "2017-12-13T14:35:55Z", "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 61895, "text": "Would it be an idea to just remove all associated temp files whenever the workbook gets disposed?", "count": 2, "id": 202759, "time": "2017-12-13T15:15:07Z", "creator": "janwillem.meyling@athenastudies.nl", "creation_time": "2017-12-13T15:15:07Z", "is_private": false}, {"count": 3, "tags": [], "text": "(In reply to Jan-Willem Gmelig Meyling from comment #2)\n> Would it be an idea to just remove all associated temp files whenever the\n> workbook gets disposed?\n\nNo, because the user may create more than 1 temporary workbook at a time.\nDeleting all temporary workbooks would be particularly bad if one of the open workbooks referenced another workbook in a formula or name reference.\nThis wouldn't make for a very good default strategy.\n\nAs suggested in the JavaDocs, you probably want to implement a FileCreationStrategy that is better suited to long-running JVM processes (such as in a Tomcat container). The default strategy is not suitable for your application. I think this is clear in the documentation.\n\nSee bug 59166 comment 4\nhttps://poi.apache.org/apidocs/org/apache/poi/util/TempFileCreationStrategy.html\n\nIf you'd like to write a LongRunningJVMFileCreationStrategy class with the appropriate unit tests, we'd be happy to review and merge it.", "is_private": false, "id": 202764, "creator": "onealj@apache.org", "time": "2017-12-13T18:22:42Z", "bug_id": 61895, "creation_time": "2017-12-13T18:22:42Z", "attachment_id": null}, {"count": 4, "tags": [], "text": "Closing this issue for now, please reopen if you want to contribute a strategy that is useful in your case.", "is_private": false, "id": 202904, "creator": "dominik.stadler@gmx.at", "time": "2017-12-24T11:37:26Z", "bug_id": 61895, "creation_time": "2017-12-24T11:37:26Z", "attachment_id": null}]