[{"count": 0, "tags": [], "bug_id": 61891, "text": "Sometimes I see the error \"AH01323: Purge of LDAP cache failed\" repeated many times. Only restarting the HTTPD could stop it.\n\nAfter some investigation I think the marktime set when the cache is 3/4 full is the problem: \nIf we have a cache with a short TTL-time many entries are renewed before the maxentries are reached. If the purge-run could only delete less than 1/4 of the entries (cause more than 1/2 are renewed meanwhile) we don't pass the place where the marktime is set again. After this we could not add any new item into the cache. Any try to add an item will cause the error \"AH01323: Purge of LDAP cache failed\".", "id": 202714, "time": "2017-12-11T15:19:18Z", "creator": "hendrik.harms@gmail.com", "creation_time": "2017-12-11T15:19:18Z", "is_private": false, "attachment_id": null}, {"count": 1, "attachment_id": 35608, "bug_id": 61891, "text": "Created attachment 35608\nmod_ldap TTL patch\n\nWe have a TTL-time for each cache. So why don't use it for recalculating the best marktime before purging.", "id": 202715, "time": "2017-12-11T15:28:15Z", "creator": "hendrik.harms@gmail.com", "creation_time": "2017-12-11T15:28:15Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 61891, "attachment_id": null, "is_private": false, "id": 202760, "time": "2017-12-13T15:49:32Z", "creator": "hendrik.harms@gmail.com", "creation_time": "2017-12-13T15:49:32Z", "text": "A small example to make the issue more clear:\n\nImagine we have a cache that could store 20 items -> maxentries=20\nand the TTL for the items is 10 seconds.\nmarkentries = maxentries*3/4 = 15\nWe have 11 power users sending a request every 5 seconds\nWe have 20 lazy users sending a request once a minute (average 1 per 5 seconds)\n\nWe start with an empty cache at 0 sec\nat  5 sec 12 items a taken (11 power + 1 lazy)\nat 20 sec 15 items a taken (11 power + 4 lazy)\n  -> markentries reatched -> set marktime = 20\nat 45 sec 20 items a taken (11 power + 9 lazy)\nat 50 sec a new lazy entry should be added into the cache but cache is full\n  -> a purge starts\n    The purge could only delete the 4 lazy entries older than marktime\n    cause the power entries are already renewed. (TTL=10)\n    So we left with 16 entries in our cache.  \n    16 is greater than 15 ! So we never set a new marktime and\n    all following purges could not delete any item. -> bang -> AH01323"}, {"count": 3, "attachment_id": null, "bug_id": 61891, "text": "Thank for the report, patch, and followup (it helped).\n\nI committed the patch with minor changes r1818040 and have proposed it for backport to 2.4.x.", "id": 202763, "time": "2017-12-13T16:59:46Z", "creator": "covener@gmail.com", "creation_time": "2017-12-13T16:59:46Z", "tags": [], "is_private": false}]