[{"count": 0, "attachment_id": 35609, "bug_id": 61901, "is_private": false, "id": 202769, "time": "2017-12-13T20:11:43Z", "creator": "jeremy@arnoldzoo.org", "creation_time": "2017-12-13T20:11:43Z", "tags": [], "text": "Created attachment 35609\nPatch to support the https.cipherSuites system property\n\nI ran an HTTPS-based JMeter test (using JMeter 3.1) with several hundred users against one of my servers.  I then switched to a different server to run a similar test, but the results were terrible. The issue turned out to be that the new server supported stronger encryption cipher suites, and the stronger encryption was driving up the CPU on the JMeter client so that it could no longer support as many users.  In my particular case, it wasn't important to test with the stronger encryption -- it was more important to be able to scale up the large number of users.\n\nBoth HttpsURLConnection and Apache HttpClient support the https.cipherSuites system property to allow configuration of what cipher suites are supported by the client.  But JMeter uses a custom SSLSocketFactory that doesn't use this property.\n\nJMeter should support the https.cipherSuites system property so that users can set this value in system.properties when needed.\n\nI've written a patch (generated by Eclipse) against the current trunk code to add this support.  This fix addressed the issue for my test."}, {"count": 1, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "id": 202770, "time": "2017-12-13T20:25:45Z", "bug_id": 61901, "creation_time": "2017-12-13T20:25:45Z", "is_private": false, "text": "Hello Jeremy,\nthanks for your patch.\nYou mention System property in your comment but in your code you use a JMeter property set through:\n\n-Jhttps.cipherSuites=\n\nMaybe it would be better to make JMeter also accept definition through System property no ?\n\nRegarding the performance issue , what exactly was the cause ? the negotiation of cipher  ?\nThanks"}, {"count": 2, "tags": [], "text": "I apologize for the confusion between System property vs JMeter property.  I intended for this to be a System property (set in system.properties) to match the behavior of HttpsURLConnection / HttpClient.  But when I wrote the patch I was following the example of https.socket.protocols, and thus used JMeterUtils.getPropDefault.\n\nSince JMeterUtils.loadJMeterProperties initializes its local properties using \"Properties p = new Properties(System.getProperties())\", I believe the code does work with System properties in addition to JMeter properties.  (In my testing, I set the value in the system.properties file.)\n\nI'd be happy to update the patch to use System.getProperty instead so this value can only be set as a System property and not a JMeter property.  Please let me know if that's your preference.\n\n\nI haven't gotten completely to the bottom of the performance issue.  In my test the JMeter system CPU was maxed out, primarily performing SSL handshakes.  I wouldn't expect quite as big of a difference in CPU utilization between the two cipher suites that were being used.  My suspicion was that one of them was being hardware accelerated and the other not, but I have not yet confirmed that.", "is_private": false, "id": 202771, "creator": "jeremy@arnoldzoo.org", "time": "2017-12-13T20:40:11Z", "bug_id": 61901, "creation_time": "2017-12-13T20:40:11Z", "attachment_id": null}, {"count": 3, "tags": [], "creator": "p.mouawad@ubik-ingenierie.com", "attachment_id": null, "is_private": false, "id": 202772, "time": "2017-12-13T20:50:16Z", "bug_id": 61901, "creation_time": "2017-12-13T20:50:16Z", "text": "(In reply to Jeremy Arnold from comment #2)\n> I apologize for the confusion between System property vs JMeter property.  I\n> intended for this to be a System property (set in system.properties) to\n> match the behavior of HttpsURLConnection / HttpClient.  But when I wrote the\n> patch I was following the example of https.socket.protocols, and thus used\n> JMeterUtils.getPropDefault.\n\nOk\n> \n> Since JMeterUtils.loadJMeterProperties initializes its local properties\n> using \"Properties p = new Properties(System.getProperties())\", I believe the\n> code does work with System properties in addition to JMeter properties.  (In\n> my testing, I set the value in the system.properties file.)\n\nYou are right.\n\n> \n> I'd be happy to update the patch to use System.getProperty instead so this\n> value can only be set as a System property and not a JMeter property. \n> Please let me know if that's your preference.\n\nIt looks fine.\nFor your information if you submit future patches, documentation is in xdocs, docs html are generated from there.\n> \n> \n> I haven't gotten completely to the bottom of the performance issue.  In my\n> test the JMeter system CPU was maxed out, primarily performing SSL\n> handshakes.  I wouldn't expect quite as big of a difference in CPU\n> utilization between the two cipher suites that were being used.  My\n> suspicion was that one of them was being hardware accelerated and the other\n> not, but I have not yet confirmed that.\n\n\nThanks"}, {"count": 4, "tags": [], "bug_id": 61901, "is_private": false, "text": "Changing status back to NEW as I believe I've addressed all of the questions.  If any additional info is needed, please let me know.", "id": 202844, "time": "2017-12-19T18:58:17Z", "creator": "jeremy@arnoldzoo.org", "creation_time": "2017-12-19T18:58:17Z", "attachment_id": null}, {"count": 5, "tags": [], "text": "Author: pmouawad\nDate: Wed Dec 20 17:50:52 2017\nNew Revision: 1818839\n\nURL: http://svn.apache.org/viewvc?rev=1818839&view=rev\nLog:\nBug 61901 - Support for https.cipherSuites property\nContributed by  Jeremy Arnold\nBugzilla Id: 61901\n\nModified:\n    jmeter/trunk/src/core/org/apache/jmeter/util/HttpSSLProtocolSocketFactory.java\n    jmeter/trunk/xdocs/changes.xml\n    jmeter/trunk/xdocs/usermanual/properties_reference.xml", "is_private": false, "id": 202870, "creator": "p.mouawad@ubik-ingenierie.com", "time": "2017-12-20T17:51:16Z", "bug_id": 61901, "creation_time": "2017-12-20T17:51:16Z", "attachment_id": null}]