[{"count": 0, "tags": [], "bug_id": 61918, "attachment_id": null, "is_private": false, "id": 202842, "time": "2017-12-19T17:44:34Z", "creator": "ryan.fong@workday.com", "creation_time": "2017-12-19T17:44:34Z", "text": "CentOS 6.6\nTomcat 8.5.16\nConnector protocol: org.apache.coyote.http11.Http11Nio2Protocol\n\nWe have noticed that the connectionCount jmx value for the nio2 connector trends upwards on our servers during the week and never drops down to 1. \n\nWhen we used netstat to trace these connections, we found the expected handful of connections active but not the value shown by jmx. We also enabled tomcat debug logging to see if any exceptions occurred during socket operations but found nothing of interest.\n\nWe believe that our data center's network configuration is causing sockets to be closed independently of the Tomcat Coyote handling but do not know what specifically is triggering it. We also found a suspicious line in Nio2Endpoint connector which could explain this false floor that keeps rising. \n\nI can artificially re-create this situation by forcefully closing the socket in a Spring MVC controller handling. Every time this endpoint is called, we prevent Tomcat from decrementing the connection count upon close. See Nio2Endpoint.closeSocket, line 358, only decrements the connection limit latch when the socket is open. \n\nPlease see the attachment for:\n* MyController.java - artificial recreation using Spring mvc and test framework (easily placed in a servlet if you also include org.springframework:spring-test module from maven)\n* jmx.png - screenshot of jmx statistic we are monitoring\n* connectionCounts.png - dashboard view of our server pool connection count for a week\n* Nio2Endpoint.java.patch - proposed patch for this situation"}, {"count": 1, "tags": [], "text": "Created attachment 35619\ndata and patch", "is_private": false, "id": 202843, "creator": "ryan.fong@workday.com", "time": "2017-12-19T17:45:15Z", "bug_id": 61918, "creation_time": "2017-12-19T17:45:15Z", "attachment_id": 35619}, {"count": 2, "tags": [], "bug_id": 61918, "attachment_id": null, "is_private": false, "id": 202845, "time": "2017-12-19T20:04:52Z", "creator": "remm@apache.org", "creation_time": "2017-12-19T20:04:52Z", "text": "I'm not convinced closing sockets like this is a really good idea. The patch may reintroduce more serious problems, but adding a closed flag seems possible.\nThis will be in 9.0.3 and 8.5.25."}]