[{"count": 0, "tags": [], "bug_id": 61959, "text": "I need an API that performs following functionality -\n\nGiven multi slides SlideShow, create a new SlideShow with given slide numbers.", "id": 203030, "time": "2018-01-03T09:42:19Z", "creator": "praful.vaishnav@gmail.com", "creation_time": "2018-01-03T09:42:19Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 61959, "is_private": false, "text": "Please provide links to any documentation needed to start contributing to it. Also, for PowerPoint File format, what specification is being followed.", "id": 203031, "time": "2018-01-03T09:44:11Z", "creator": "praful.vaishnav@gmail.com", "creation_time": "2018-01-03T09:44:11Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 61959, "attachment_id": null, "text": "Please see http://poi.apache.org/guidelines.html for details on how to contribute, links to the official file format specs etc\n\nHowever... I think you can do what you want with POI already. Just copy the master slideshow to a new file, open it, and delete all the slides you don't want", "id": 203032, "time": "2018-01-03T09:46:16Z", "creator": "apache@gagravarr.org", "creation_time": "2018-01-03T09:46:16Z", "is_private": false}, {"attachment_id": null, "tags": [], "creator": "praful.vaishnav@gmail.com", "is_private": false, "count": 3, "id": 203033, "time": "2018-01-03T09:52:17Z", "bug_id": 61959, "creation_time": "2018-01-03T09:52:17Z", "text": "Thanks Nick for the suggestion. But the problem with this approach is redundancy and time/resource consuming. For eg, I have 20 slides SlideShow file and I want to get 20 new SlideShow having a single slide. So, performing 19 delete operations for every SlideSHow is not efficient."}, {"count": 4, "tags": [], "bug_id": 61959, "attachment_id": null, "text": "The alternative would be to copy each slide to a new presentation, by creating a new slide in the new presentation and importing the content of the original slide into the newly created slide.\nhttps://poi.apache.org/apidocs/org/apache/poi/xslf/usermodel/XSLFSlide.html#importContent-org.apache.poi.xslf.usermodel.XSLFSheet-\n\nBut then you would have to copy the master style sheet and some other details, from the original presentation to the newly created presentation.\n\nIf your slides have charts or notes and you want to copy them along, you would face bug #57835 for which I implemented only part of the fix: charts in the same presentation.\nhttps://bz.apache.org/bugzilla/show_bug.cgi?id=57835\n\nNot wanting to scare you, but Nick might have given the path to the solution with less code to write...", "id": 203114, "time": "2018-01-06T03:41:55Z", "creator": "Alain.Bearez@cua.li", "creation_time": "2018-01-06T03:41:55Z", "is_private": false}]