[{"count": 0, "text": "Created attachment 35684\nContains the Excel file with 5000 OLE objects in it, and the source code of the program I've written.\n\nHi:\n\nI have attached a test program that triggers the error. Basically, this is how I trigger the error:\n\n - The program create more than 1024 OLE objects and anchors in an Excel sheet;\n - The generated file is opened and saved with Excel - in this process, the Excel file size shrinks;\n - When loading the Excel file, errors are thrown.\n\nThis is a sample of the error:\n\nFailed to add a shape to the collection, row no [0], shape will be ignored [org.apache.poi.POIXMLException: Ole object not found in sheet container - it's probably a control element]\norg.apache.poi.POIXMLException: Ole object not found in sheet container - it's probably a control element\n\tat org.apache.poi.xssf.usermodel.XSSFObjectData.getOleObject(XSSFObjectData.java:132)\n\tat org.apache.poi.xssf.usermodel.XSSFObjectData.getObjectPart(XSSFObjectData.java:151)\n\tat com.emerald_associates.spreadsheetimpexp.sketch_board.ApachePoiMultipleOleObjectsBug.lambda$testRead$0(ApachePoiMultipleOleObjectsBug.java:137)\n\tat java.util.ArrayList.forEach(ArrayList.java:1249)\n\tat com.emerald_associates.spreadsheetimpexp.sketch_board.ApachePoiMultipleOleObjectsBug.testRead(ApachePoiMultipleOleObjectsBug.java:131)\n\tat com.emerald_associates.spreadsheetimpexp.sketch_board.ApachePoiMultipleOleObjectsBug.main(ApachePoiMultipleOleObjectsBug.java:90)\n\nThe problem occurs for each OLE object added above 1024. So if I add 1050 OLE Objects, I will get 26 errors.\n\nI am using Apache POI 3.17, Java 8, and Excel 2017 from Office 365. To me, it appears that the file is generated with some sort of error that Excel clears up when it opens the file.\n\nWe also created a sample file where 5000 OLE objects were created with Excel - I am attaching that file here - in this example, there are no errors when the OLE objects are read with the test program.\n\nAttached I am sending the test program I've written, and the Excel file with the 5000 OLE objects. Running the program should trigger the error, just follow the instructions on it.", "bug_id": 62017, "is_private": false, "id": 203348, "time": "2018-01-18T19:45:33Z", "creator": "raviaw@gmail.com", "creation_time": "2018-01-18T19:45:33Z", "tags": [], "attachment_id": 35684}, {"count": 1, "tags": [], "text": "This problem appears only when there are more than 1024 OLE objects in a sheet. In the new version of the test program attached, I write 1024 OLE objects in 3 different sheets (3072 in total) and the issue does not occur.", "attachment_id": null, "id": 203376, "creator": "raviaw@gmail.com", "time": "2018-01-19T18:34:02Z", "bug_id": 62017, "creation_time": "2018-01-19T18:34:02Z", "is_private": false}, {"count": 2, "attachment_id": 35689, "bug_id": 62017, "is_private": false, "id": 203378, "time": "2018-01-19T18:58:58Z", "creator": "raviaw@gmail.com", "creation_time": "2018-01-19T18:58:58Z", "tags": [], "text": "Created attachment 35689\nThis version of the programs writes 3072 OLE objects across 3 different sheets - the problem does not occur\n\nHi:\n\nThis version writes the notebook contents across 3 sheets, with 3072 OLE objects in total - the issue does not occur here, which means that the problem occurs only with more than 1024 objects in a single sheet."}]