[{"count": 0, "tags": [], "bug_id": 62016, "attachment_id": null, "is_private": false, "id": 203344, "time": "2018-01-18T14:54:20Z", "creator": "boec0025@gmail.com", "creation_time": "2018-01-18T14:54:20Z", "text": "i am running fc 27.  i just upgraded from fc 24.  everything worked perfect in 24 but after upgrading to 27, i cannot write to my dav site.  i used the same config file and it didnt work so i went through and updated my config file and it wouldnt work...i keep getting the error...\n\n[Wed Jan 17 04:39:28.449595 2018] [dav:error] [pid 6908:tid 140437503338240] [client XXX.XXX.XXX.XXX:56270] The locks could not be queried for verification against a possible \"If:\" header.  [500, #0]\n[Wed Jan 17 04:39:28.449606 2018] [dav:error] [pid 6908:tid 140437503338240] [client XXX.XXX.XXX.XXX:56270] Could not open the lock database.  [500, #400]\n[Wed Jan 17 04:39:28.449610 2018] [dav:error] [pid 6908:tid 140437503338240] (20019)DSO load failed: [client XXX.XXX.XXX.XXX:56270] Could not open property database.  [500, #1] \n\ni have tried every variant of creating this including setting the lock db directory to 777 and cannot get it to work.  i have taken down selinux and still not luck.  after spending hours and hours trying everything to isolate it, i can only think it must just be dav fs failing to create the lock db only.  \n\ni can find no other way to troubleshoot this further.  if there is a way please let me know..."}, {"count": 1, "tags": [], "creator": "boec0025@gmail.com", "attachment_id": null, "text": "after searching for what seemed like years and years and years and years i finally fingered it out. APPARENTLY, apache uses apr-util to build a berkeley db for the dav lock db...of course, right?! well, the issue with that is httpd does NOT have a dependency of apr-util-bdb. why is that important, well those are the drivers for the apr-util. without those apr-util was not working right and not building the davlockdb. once i installed those and restarted the pc, dav once again works. HOORAY FOR ME!\n\nit is related to...\n\nhttps://bugzilla.redhat.com/show_bug.cgi?id=1491151", "id": 203610, "time": "2018-02-02T12:25:00Z", "bug_id": 62016, "creation_time": "2018-02-02T12:25:00Z", "is_private": false}]