[{"count": 0, "tags": [], "bug_id": 6397, "text": "We are performing a stress test session, using the following architecture:\n- Apache JMeter 1.6.1 as the virtual user generator;\n- Tomcat 3.2.3 (but the 3.2.4 version is not able to add value on this) as the \nservlet engine;\n- Oracle 8.0.5 as the referenced RDBMS (through a custom connection pool);\n- CriticalPath InJoin Directory Server 4.0 as the referenced LDAP srv.\n\nDuring the stress test the number of threads handled by the java virtual \nmachine on both Solaris 2.7 and Linux Red Hat (kernel 2.4.16-xfs) is constantly \ngrowing and leads to a freeze of the entire server. Finally even stopping the \ntest generator the threads are not released (a 'ps' command on linux is able to \nshow the entire set of these lightweight processes), and the server needs to be \nrestarted.\n\nWe guess is a simple misconfiguration of the server, but please give an aid \ncause the system is going to be extended to a high amount of users, and this \ntrouble is critical. It would be useful to know how to set up the pool of \nconcurrent connections entering Tomcat, as well as to know how to control the \nthread management parameters, if any.\n\nThx, \nAntongiulio La Corte.\n\nPS the same stress test on other apps servers (such as Allaire Jrun) is \ncompleted with success. However Apache/Tomcat is the preferred solution, if \nfeasible.", "id": 10583, "time": "2002-02-12T14:44:44Z", "creator": "lacortea2@tiscali.it", "creation_time": "2002-02-12T14:44:44Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "hgomez@slib.fr", "attachment_id": null, "is_private": false, "id": 10593, "time": "2002-02-12T16:18:24Z", "bug_id": 6397, "creation_time": "2002-02-12T16:18:24Z", "text": "The current Tomcat engine are Tomcat 3.3 for 2.2/1.1\nand Tomcat 4.0 for 2.3/1.2 and there is little or no\neffort on 3.2.x branch which is known to be unstable\nunder heavy load.\n\nI recommand you to redo your stress tests against TC 3.3\nor TC 4.0.2 which are the current RI for 2.2/1.1 and 2.3/1.2\nand are well maintened and supported"}]