[{"count": 0, "attachment_id": null, "bug_id": 6634, "text": "Tar archives that are encoded using the original BSD format, rather than the \nnewer POSIX format, are not properly supported by the Ant <untar> task because \nthey lack the \"ustar\" magic header.\n\nHere is a test script to demonstrate the problem:\n\n<project default=\"test.untar\" basedir=\"test\">\n  <target name=\"test.untar\">\n    <get src=\"http://www.sleepycat.com/update/4.0.14/db-4.0.14.tar.gz\" \n        dest=\"db-4.0.14.tar.gz\"/>\n    <gunzip src=\"db-4.0.14.tar.gz\"/>\n    <untar src=\"db-4.0.14.tar\" dest=\".\"/>\n  </target>\n</project>\n\nI originally contacted Sleepycat Software to get them to change their tarball \nrolling program, but they told me this is desired behaviour from their point of \nview:\n\n> We're deliberately using the \"original\" tar archive format, as\n> distributed with the BSD software releases.  The problem with\n> defaulting to the ustar format is that tar binaries on older\n> systems may not be able to read our release archives.\n\nIn case you think that this is some strange, otherwise unsupported format, they \nalso said this:\n\n> I know that the standard tar and pax\n> commands distributed with the major vendors can all read old\n> tar formats, it surprises me that Ant can't.\n\nThe GNU project apparently agrees that this is correct behaviour even though \nthey don't seem to follow it much. Consider this from \nhttp://www.gnu.org/manual/tar/html_mono/tar.html#SEC111:\n\n> On the other hand, most modern tars are\n> able to read old format archives, so it might be safer for\n> you to always use --old-archive (-o) for your distributions.\n\nThe GNU tar manual gives more details about compatibility issues between the \ntwo in the sections which follow.", "id": 11078, "time": "2002-02-21T23:58:40Z", "creator": "bruce@callenish.com", "creation_time": "2002-02-21T23:58:40Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "conor@apache.org", "attachment_id": null, "text": "I have removed the ustar check. I have checked this on the archive you gave and\nit worked without issue. \n\nNote that Ant generated tar files are still in ustar format (for now).\n\nPlease try the next nightly build and see if it works for you.", "id": 11098, "time": "2002-02-22T13:04:34Z", "bug_id": 6634, "creation_time": "2002-02-22T13:04:34Z", "is_private": false}]