[{"count": 0, "tags": [], "creator": "jemiller@uchicago.edu", "attachment_id": null, "text": "In Tomcat 4.0.2 release a change was made in AuthenticatorBase.java on lines  \n484-486 so that it includes the following lines.\n\nsresponse.setHeader(\"Pragma\", \"No-cache\");\nsresponse.setHeader(\"Cache-Control\", \"no-cache\");\nsresponse.setDateHeader(\"Expires\", 1);\n\nThis has the affect of turning caching off for applications that use a \n<security-constraint>. For example, if they were protected by SSL.\n\nI understand that this change was made so that caching/proxy servers would \nknow not to cache these pages.\n\nHowever, IMHO, one should be able to set \"Cache-Control\" to \"private\" to \nacheive the same thing but still allow caching on the client. i.e. I think \nthere should be a way for the developer to override the default behavior.\n\nThe problem is that the Servlet API provides no means for removing headers \nthat have already been set in the HttpServletResponse short of clearing all \nthe headers which is something that you normally wouldn't want to do because \nthere might be other important headers that shouldn't be cleared, for example, \nthe jsessionid cookie. Note, you can set headers, but not remove them. Also, \nunlike for a HttpServletRequest object, you can't query and enumerate what \nheaders have been set, in this case by the Web server itself.\n\nOne potential fix IMHO would be to make it so that if you call \nHttpServletResponse.setHeader() with a value of null that it remove the header.\n\nAnother possibility would be to make the behavior configurable via a \nconfiguration file (preferrable).\n\nAlso, why is the \"expires\" header being set? As far as I know, you \nsetting \"Pragma\" (for backwards compatibility) and \"Cache-Control\" should be \nsufficient to disable caching.", "id": 11236, "time": "2002-02-27T17:47:35Z", "bug_id": 6732, "creation_time": "2002-02-27T17:47:35Z", "is_private": false}, {"count": 1, "tags": [], "creator": "remm@apache.org", "text": "Please don't file duplicates on purpose. ALso, it's an enhancement (security\ncomes first, sorry).\nIf you don't agree, feel free to modify your TC copy and rebuild.\n\n*** This bug has been marked as a duplicate of 6709 ***", "id": 11239, "time": "2002-02-27T18:09:28Z", "bug_id": 6732, "creation_time": "2002-02-27T18:09:28Z", "is_private": false, "attachment_id": null}]