[{"count": 0, "tags": [], "creator": "timothyreaves@westfieldgrp.com", "is_private": false, "id": 11237, "attachment_id": null, "bug_id": 6734, "creation_time": "2002-02-27T17:53:02Z", "time": "2002-02-27T17:53:02Z", "text": "There are two different types of variables needed: simple variables used to replace a value, and a \nmore dynamic variable can can obtain a new value with each interation & thread.\n\nThe first one \nis simply a means of doing a replacement for the entire test run.  An example of this would be the \nserver name (which probably should be a variable by default) and port.  I might want to change the \nserver the test goes against, but I would waqnt the entire test to go against that machine.\n\nThe \nsecond type would read it's values from some data source (text file, properties, whatever, with \nmaybe a JTable to enter / edit them) and would change it's value each time a new thread or interation \nis started.  This would be for things like usernames & passwords.  In a lot of applications, \ndifferent users will have different web pages, and you would want to ensure that the basic \nfunctionality to all users works regardless of which user is logged in."}, {"count": 1, "tags": [], "creator": "mstover1@apache.org", "is_private": false, "text": "The first one: done.  You can attach a configuration element at the Thread \nGroup level with just the domain specified, and leave the domain field blank in \nall your test samples.  Thus, you can test two servers by changing only a \nsingle field.\n\nThe second one: you are describing a Modifier element.  Yes, it should be \nimplemented, and I believe there are people out there who have.  I will be \nmaking more Modifiers and ResponseModifiers for 1.8", "id": 11393, "time": "2002-03-03T01:50:57Z", "bug_id": 6734, "creation_time": "2002-03-03T01:50:57Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "mstover1@apache.org", "text": "Both types now exist.  However, further development could produce a greater\nvariety of such modifier tools.  I'll close this request and seek submissions\nfor more specific requests.", "id": 18734, "time": "2002-06-28T17:51:22Z", "bug_id": 6734, "creation_time": "2002-06-28T17:51:22Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 6734, "text": "Marking all bugs RESOLVED before JMeter 1.8's release date as VERIFIED.\nYes, it's pretty poor QA procedure, but there's bugs here lingering since JMeter\n1.6, and we need to clean up a little.", "id": 28410, "attachment_id": null, "creator": "jsalvata@atg.com", "creation_time": "2002-12-27T16:17:44Z", "time": "2002-12-27T16:17:44Z", "is_private": false}, {"count": 4, "tags": [], "text": "Bulk-closing all bugs RESOLVED before JMeter 1.8 release date.", "is_private": false, "id": 28632, "creator": "jsalvata@atg.com", "time": "2002-12-29T14:22:57Z", "bug_id": 6734, "creation_time": "2002-12-29T14:22:57Z", "attachment_id": null}]