[{"count": 0, "tags": [], "bug_id": 6749, "attachment_id": null, "text": "When removing a Context through the manager or programmatically through the \nDeployer interface on a Host, the work directory(ies) corresponding to that \napplication are not deleted.  The reason I care about this: bizarre behavior \noccurs when you remove a context and then add a context with the same \ncontextPath within a running Tomcat instance.  For instance, certain pages \nremain as if they were the original pre-removal context, tag library \ndeclarations begin to cause exceptions, etc.  These issues cease if you stop \nand restart the server, indicating to me that Tomcat does something on startup \nto clear stuff out or reinitialize/create some internal data structures such \nthat the context then works.  These things do not happen when removing a \nContext programmatically, but they should.  Clearing the work directory would \nhopefully resolve these issues.", "id": 11264, "time": "2002-02-27T22:49:19Z", "creator": "anewberger@plumbdesign.com", "creation_time": "2002-02-27T22:49:19Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 6749, "is_private": false, "count": 1, "id": 11278, "time": "2002-02-28T04:02:33Z", "creator": "remm@apache.org", "creation_time": "2002-02-28T04:02:33Z", "text": "I don't think it is the cause for the problems you describe, which look a bit\nmore like bug 6594. Can you confirm if it looks similar ?"}, {"count": 2, "tags": [], "text": "I verified that the fix for bug 6594 fixes this problem as well (at least on Unix \nplatforms). I was able to create a war file, deploy it using the manager webapp's \n\"install\" action. Then, I updated a JSP page in the war file, undeployed it using \nthe manager webapp's \"remove\" action and then redeployed the updated war file \nusing the \"install\" action. After this, the modified JSP page was visible.\n\nWhat I have noticed is that web caches can sometimes give the appearance of a \nstale content as some webcaches don't always check to see if their cached content \nis the most current content available. In fact, many older webcaches (sold when \ndisk was still expensive) may wait to their cached content is over a week old.\n", "attachment_id": null, "bug_id": 6749, "id": 11283, "time": "2002-02-28T06:17:15Z", "creator": "patrick.luby@planamesa.com", "creation_time": "2002-02-28T06:17:15Z", "is_private": false}, {"count": 3, "tags": [], "creator": "anewberger@plumbdesign.com", "attachment_id": null, "id": 11321, "time": "2002-02-28T20:13:30Z", "bug_id": 6749, "creation_time": "2002-02-28T20:13:30Z", "is_private": false, "text": "This probably was the same problem as bug 6594; I confirmed that redeployment \nworks fine on a build of the current tomcat_40_branch in CVS.\n"}, {"attachment_id": null, "tags": [], "bug_id": 6749, "is_private": false, "count": 4, "id": 17258, "time": "2002-06-06T01:11:57Z", "creator": "remm@apache.org", "creation_time": "2002-06-06T01:11:57Z", "text": "Resolving according to the previous comments.\n\n*** This bug has been marked as a duplicate of 6594 ***"}]