[{"attachment_id": null, "tags": [], "bug_id": 6857, "is_private": false, "count": 0, "id": 11442, "time": "2002-03-04T18:53:06Z", "creator": "ms@speakeasy.net", "creation_time": "2002-03-04T18:53:06Z", "text": "I have a manifest file\n\nManifest-Version: 1.0\nMIDlet-Version: 1.0\nMicroEdition-Configuration: CLDC-1.0\nMIDlet-Vendor: Sun Microsystems\nMIDlet-1: Downhill, /ASDimages/icon.png, com.jamdat.downhill.midp.GameMIDlet\nMicroEdition-Profile: MIDP-1.0\nMIDlet-Name: Downhill\n\nthat when added with <jar manifest=\"..\"> it gets added as\n\nManifest-Version: 1.0\nMIDlet-Name: Downhill\nMIDlet-1: Downhill, /ASDimages/icon.png, com.jamdat.downhill.midp.Game\n MIDlet\nMIDlet-Version: 1.0\nMIDlet-Vendor: Sun Microsystems\nCreated-By: Ant 1.4.1\nMicroEdition-Configuration: CLDC-1.0\nMicroEdition-Profile: MIDP-1.0\n\nOne annoying thing I request, since motorola sucks, is that the items be kept \nin the order they appear. I assume you slurp the mf file into a hash and print \nthem out later rather then do a file copy, but the j2me device im workign with \nrequires the properties to be in order! Yeah, it's poop. Anyway the newline in \nthe MIDlet-1 property is just a bug. It cuts off the property at a certain \nlength, I tested it withMIDlet-Vendor: Sun \nMicrosystemsSDFasdfasdfasdfasdfadsfasdfasdfasdfasdf\n lkajsdlkfajlskdfjlkadsa\n\nsame problem.\n\nfyi:  FLASH/~/j2me/apps/Downhill/bin/tmp  $ant -version\nAnt version 1.4.1 compiled on October 11 2001"}, {"count": 1, "tags": [], "creator": "conor@apache.org", "attachment_id": null, "id": 12069, "time": "2002-03-20T13:25:18Z", "bug_id": 6857, "creation_time": "2002-03-20T13:25:18Z", "is_private": false, "text": "OK, I have just committed an update to the Manifest code to maintain the order\nor sections of attributes. Strictly speaking, according to the spec, this is not\nrequired, but it makes for nicer looking manifests.\n\nThe truncation is actually a requirement of the spec. Lines longer than 72 must\nbe wrapped onto a \"continuation\" line, which starts with a space. Anything which\nmanipulates jars, and hence implements the jar spec should handle that. Can you\ncheck if this is really an issue with your toolkit.\n\nI am considering a nowrap flag since this causes so many issues and so many\nsystems don't implement the spec correctly. Let me know.\n\nPlease try the next nightly build.\n\n"}, {"count": 2, "tags": [], "creator": "danap@dhptech.com", "attachment_id": null, "id": 12078, "time": "2002-03-20T14:27:29Z", "bug_id": 6857, "creation_time": "2002-03-20T14:27:29Z", "is_private": false, "text": "My experience is that the trunction is occurring in the middle of words.  My \nsituation is a web archive in a J2EE ear file with a classpath listing six or \nseven jar files that I placed in a \"lib\" subdirectory in the ear file.  The \nresulting manifest file contains the classpath but with one of the jar file \nnames truncated in the middle and continued on the next line with a space.\n\nI tried breaking up the line myself but weblogic choked on it.  ( threw a \nStringIndexOutOfBoundsException. ).  One thought I just had was that I may \nhave put tabs in as the first character of the next line not a space.  Maybe \nthat is the problem.  I will consult the spec.  Hope this helps."}, {"count": 3, "tags": [], "creator": "umagesh@apache.org", "attachment_id": null, "id": 12093, "time": "2002-03-20T16:32:42Z", "bug_id": 6857, "creation_time": "2002-03-20T16:32:42Z", "is_private": false, "text": "Ant's Jar task splits long lines based on the Jar file specification from Sun.\nIf you package your ear file using the external jar utility, it will split\nthe long line in the same way, even if it is in the middle of a word and\ncontinue it on the next line starting with a space (which is the continuation\ncharacter)\nThe problem might very well be with WebLogic not able to understand the manifest\nbuilt according to specs.  Please reopen the bug if you find that this task\nbehaves differently when compared to the Jar utility provided by Sun.\n"}, {"count": 4, "tags": [], "creator": "sbailliez@apache.org", "text": "Weblogic (6.1sp2 j2ee13 afaik) has a known bug about manifest that contains a \nclass-path entry and that contains reference to jars that are not in lib \n(StringIndexOut...) so I would not be surprised about a weblogic issue.", "id": 12096, "time": "2002-03-20T17:18:54Z", "bug_id": 6857, "creation_time": "2002-03-20T17:18:54Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "bug_id": 6857, "attachment_id": null, "text": "Can we make sure that our own code actually understand the jars as you are \nconstructing them? Does this works with AntClassLoader? How about \nURLClassLoader?\n\nI also think it is important to have a way to request that at least the \nclasspath be left alone as a long line. There is too much code outthere that t \ndoes not follow this obscure spec. Can anyone give me a good reason why there \nis this need for 72 char lines in manifests? Is someone concerned about overrun \nbuffers in java? (just a retorical question).\n\nHow about a \"strict='true'\" attribute that when true follows the 72 char split\nand lives lines alone when false.\n\nI know this is changing the subject a little, but it would be fantastic if we \ncould add a <classpathset> fileset element that constructs the Class-Path line\nfrom a list of jars. I could provide a patch if people think it would be a good \nidea.", "id": 12114, "time": "2002-03-21T08:29:16Z", "creator": "j_a_fernandez@yahoo.com", "creation_time": "2002-03-21T08:29:16Z", "is_private": false}]