[{"count": 0, "tags": [], "bug_id": 7021, "attachment_id": null, "is_private": false, "id": 11651, "time": "2002-03-11T09:37:12Z", "creator": "ladislav.skokan@ird.eds.com", "creation_time": "2002-03-11T09:37:12Z", "text": "The PVCS tag is primarly targeted to PVCS versioning system from Merant. There \nis similar product from Merant called \"PVCS Dimension\" that is extended PVCS by \nCRM functionality. The PVCS tag from optional library does not work with the \nPVCS Dimension product. I have written new tag that we use on daily basis. I \nwould like to add the tag into the optional library to be used by other \ndevelopers. If you want the source code and doc please contact me."}, {"count": 1, "tags": [], "creator": "bodewig@apache.org", "is_private": false, "text": "A while ago, Michael Rousey has submitted a bunch of tasks for PVCS dimensions\nto ant-dev, see http://marc.theaimsgroup.com/?l=ant-dev&m=101433859413135&w=2\n\nYou could do us a big favor if you gave them a try and come back to tell us\nwhether they work - so we have at least a second user confirming the stuff, which\nmakes it a lot more likely that it gets committed.", "id": 12120, "time": "2002-03-21T10:55:02Z", "bug_id": 7021, "creation_time": "2002-03-21T10:55:02Z", "attachment_id": null}, {"count": 2, "tags": [], "creator": "ladislav.skokan@ird.eds.com", "attachment_id": null, "id": 12286, "creation_time": "2002-03-25T11:28:30Z", "time": "2002-03-25T11:28:30Z", "bug_id": 7021, "text": "I am unable to download attachement from Michael Rousey in the conference \narchive. There is a problem with the zip file.\nWhat I have seen from the discussion, Michael's PVCS Dimension extensions uses \nthe \"download.exe\" utility. The utility has a bug and does checks out files \nproperly from PVCS. It does not case of filename properly. So if you \nfetch \"DifferentCaseFile.java\" , you will get on your \ndrive \"differentcasefile.java\". Of course Java and Apache Ant have problem with \nthis. \nBecause of the bug, I have used another command-line utility in my extension. I \nhave used the \"cmdclient.exe\" that does not have this bug. My utility does not \nhave additional functionality likeMichaels does. It just checks-out (fetches) \ncode from the repository. On the other hand, it is state-of-art fetching, \nbecause you can set-up which directories to fetch, what files to fetch etc. It \nalso comapres modified date and fetches just changes agaits repository. It is \nnot build-in function of PVCS Dimensions. In our project, there is several tens \nof developers who use it on daily bases.\n\nIf you can manage to get the Michaels attachement out of mail archive, I would \nbe please to review them.", "is_private": false}, {"count": 3, "tags": [], "bug_id": 7021, "attachment_id": null, "id": 12287, "time": "2002-03-25T11:40:41Z", "creator": "bodewig@apache.org", "creation_time": "2002-03-25T11:40:41Z", "is_private": false, "text": "sent Michael's code via private mail (noted here so that Ladislav doesn't get\nmultiple copies)."}, {"count": 4, "tags": [], "bug_id": 7021, "attachment_id": null, "id": 12296, "time": "2002-03-25T14:55:57Z", "creator": "ladislav.skokan@ird.eds.com", "creation_time": "2002-03-25T14:55:57Z", "is_private": false, "text": "Thanks to Stefan I was able to test the dimenson utilities.\nI have tested it on PVCS Dimensions 6.0 and 7.0 on Windows NT against PVCS \nDimensions Server 6 on Unix database. It generally works, but have some major \nissues, that I think needs to be clarified:\n- the \"download\" utility does not keep proper filename. A \nfile \"MixesCaseFile.java\" will be extracted to local drive with \nfilename \"mixedcasefile.java\". I would set this as a highest priority issue, \nbecause it is vital for Java compiler to have proper file name. \n- somewhere in doc has to be mentioned, that enviroment variable MCX_SLAVE has \nto be set to point to a login helper. Without the set the \"download\" utility \ndoes not login and the task fails.\n- for each command from PVCS a GUI window prompts for a password, that I think \ndoes not match to the Apache Ant strategy of command-line utility. And it is a \nbit annoying ...\n- the design of the module is more like to be written for PVCS Dimension \nexpert. Tasks like DimensionsFI or DimensionsSCWS reflects to diemnsions \ncommands \"fi\" (fetch item) and \"swcs\" (set workset) but not to a user who wants \nto use the version manager from a \"high-level\" perspective. I would suggest to \nredesign the tags to us them like:\n<PvcsDimensions>\n     <Workset name=\"MyWorkset@/>\n     <Fetch path=\"/\" baseline=\"MyBeasline\">\n</PvcsDimensions>\n     \n\n\n"}, {"count": 5, "tags": [], "text": "I sent a mail to Michael, asking him to come here and comment.\n", "attachment_id": null, "id": 12300, "creator": "bodewig@apache.org", "time": "2002-03-25T15:55:41Z", "bug_id": 7021, "creation_time": "2002-03-25T15:55:41Z", "is_private": false}, {"count": 6, "text": "Set to WONTFIX due to lack of interest. Feel free to reopen and attach the \ntasks here if you can agree about their design and implementation.", "creator": "sbailliez@apache.org", "is_private": false, "id": 18510, "time": "2002-06-24T21:50:28Z", "bug_id": 7021, "creation_time": "2002-06-24T21:50:28Z", "tags": [], "attachment_id": null}]