[{"count": 0, "tags": [], "bug_id": 710, "attachment_id": null, "text": "Problem:\n========\n(The goal is similiar to bug #649 but different results:  I am trying to get \nthe DOM parser to use a custom DocumentImpl in order to get the parser to \ncreate my subclasses of the defalt ElementImpl used by Xerces - I want to add \nin my own business API's to these elements as well as keep track of what's \ngetting created as the DOM is being built.  ( Sun's ProjectX parser has an \nElementFactory interface which does this well)\n\nChecking the docs, I should be able to do this by:\n\n1) Write a class that derives from DocumentImpl and override the implementation \nof createElement(String tagName)\n2) Write a class that extends the DOMParser class and calls setDocumentClassName\n(\"dom.CustomApacheDocumentImpl\") on the super class.\n3) Parse the document using my Parser \"wrapper\".\n\nAlso, I've noticed a reference to setting the \nproperty \"http://apache.org/xml/properties/dom/document-class-name\" on the \nparser so I'm doing that too in my test client.  I'm not sure why there are two \nways to specify this - perhaps one is being depricated?\n\nIn any case, the DOM parser is not using my custom DocumentImpl during the \nparse (although it does create one).\n\nTest case is attached - simply compile src/dom/*.java and run \ndom.CustomDomTest - you might need to modify the URL location string of the \npersonal.xml files that are used (they have no other significance, just the \nnearest ones to hand when testing:)", "id": 856, "time": "2001-02-26T06:57:59Z", "creator": "osheajohn@eircom.net", "creation_time": "2001-02-26T06:57:59Z", "is_private": false}, {"count": 1, "tags": [], "text": "Created attachment 23\nTest shows no invocation on custom DocumentImpl.createElement()", "is_private": false, "id": 857, "creator": "osheajohn@eircom.net", "time": "2001-02-26T07:07:49Z", "bug_id": 710, "creation_time": "2001-02-26T07:07:49Z", "attachment_id": 23}, {"count": 2, "tags": [], "creator": "lehors@apache.org", "attachment_id": null, "text": "Because Namespaces are on, the parser creates the elements with createElementNS \ninstead of createElement, as expected.\nThe user need to override createElementNS or turn namespaces off.\n", "id": 862, "time": "2001-02-26T12:11:54Z", "bug_id": 710, "creation_time": "2001-02-26T12:11:54Z", "is_private": false}]