[{"count": 0, "tags": [], "bug_id": 7146, "text": "I am using the v1.49 docbook xsl style sheets to create the fo that are \nprocessed by fop to make a pdf.\n\nWhen I make a pdf file with bookmarks the top level bookmarks show in \nAcrobat but there is no action when they are clicked.  Secondary \nbookmarks work properly.\n\nNorman Walsh, the stylesheet author wrote:\n  I think this is a FOP bug. FOP appears not to correctly handle the\n  links if the target is an fo:page-sequence. It works if the ID is on\n  an fo:block, but it would be very difficult to make the ID for a\n  chapter (for example) appear on the first block in that chapter, so I\n  don't think this is going to be fixed except by FOP.\n\nI've created a very simple docbook xml file toshow this error.\n\nCopies of the xml, fo, and pdf are on a web page: http://concord.org/\n~stephen/fop-bugs/", "id": 11838, "time": "2002-03-15T10:13:16Z", "creator": "stephen@concord.org", "creation_time": "2002-03-15T10:13:16Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "carlos@cvc.edu", "attachment_id": null, "text": "I have the same problem. Using Docbook's XSL stylesheets to generate \nFOP I can't seem to be able to get bookmarks to work on certain types of \ndocuments. The explanation given to me was:\n\n>FOP appears not to correctly handle the links if the target is an fo:page-\n>sequence. It works if the ID is on an fo:block, but it would be very difficult\n> to make the ID for a chapter (for example) appear on the first block in\n> that chapter, so I don't think this is going to be fixed except by FOP.\n\nI've tested this on Mac OS X, Linux and Windows 2000", "id": 11848, "time": "2002-03-15T16:19:27Z", "bug_id": 7146, "creation_time": "2002-03-15T16:19:27Z", "is_private": false}, {"count": 2, "tags": [], "creator": "j3322ptm@yahoo.de", "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of 635 ***", "id": 17057, "time": "2002-06-03T07:41:35Z", "bug_id": 7146, "creation_time": "2002-06-03T07:41:35Z", "is_private": false}, {"count": 3, "tags": [], "creator": "gadams@apache.org", "attachment_id": null, "id": 156547, "time": "2012-04-01T13:49:39Z", "bug_id": 7146, "creation_time": "2012-04-01T13:49:39Z", "is_private": false, "text": "batch transition to closed remaining pre-FOP1.0 resolved bugs"}]