[{"count": 0, "tags": [], "bug_id": 7266, "is_private": false, "text": "I am running Apache HTTP server 1.3.23 on my Windows 2000 machine.\nI did not compile it myself. I am using Apache's binaries.\nLately I have been noticing what seems to be corruptions in the log file\nThe first few hundred entries are fine. Then suddenly there are strange\nASCII chars. At times I've even seen fragments of the HTML code of some of\nmy own webpages appearing in the log file. At other places I see what looks\nlike compiled machine code with symbolic names and some string data.\nFor example, here's a few legible snipets of text in my log files:\n\nuint16  Units  Percent  MappingStrings\nuint32  Units  Minutes  MappingStrings\nuint32  Units  Millivolts  Override  Range1InputVoltageHigh  Range1Input\nWin32API|Printing and Print Spooler Structures|PRINTER_INFO_2|pDriverName\nSMBIOS|Type 4|Processor Information|Status  CurrentVoltage\nSMBIOS|Type 4|Processor Information|Socket Designation  Version\nC I M _ D i s c r e t e S e n s o r\nint32  Override  NominalReading  Units  Milliamps  MappingStrings\nWin32Registry|SYSTEM\\CurrentControlSet\\Services\\Tcpip\\Parameters|NameServer \nMappingStrings\nDomainDNSRegistrationEnabled  boolean\n\nThat last string appears in c:\\WINNT\\system32\\wbem\\Repository\\CIM.REP\nOther strings are definitely from my own HTML files.\nI see the HTML code before it's processed by PHP.\n\nAt other places there's no readable text. Just the same strange ASCII\nstring repeated over and over.\nIt's really strange. The same corruptions \nappear in all 3 log files that I am generating. I have the usual access.log\nand error.log files. I also have a custom log file called request.log.\nThe .conf line for this log file is:\nCustomLog logs\\request.log \"%h|%s|%{%Y|%m|%d|%H|%M|%S}t|%l|%u|%T|%b|%{Host}i|%\n{User-Agent}i|{Accept-Language}i|%{Referer}i|||%U\"\n\nThe strange ASCII characters are the same in all 3 files, but they can\nbe most easily seen in the error.log file.\n\nI can tell that the strange ASCII chars aren't part of a malicious request\nbecause of where the chars start. They start at the beginning of a line\ninstead of where the raw request data would go.\nThe log files are rather big so I'd like to\nemail them to whoever gets assigned to this case. Plus pasting in strange ASCII\nchars in Bugzilla could have some side-effects. And oh yeah, I'm not running\nMS IIS, just in case you were wondering. I get a lot of worm probes looking\nfor IIS and they show up in my log files too. Scandisk didn't find any hard\ndrive problems. The hard drive is brand new. It looks to me like Apache is\nreading bytes from random locations in memory and is writing the data back to\nthe log files. But it's the same messed up chars at every file. Maybe a\nstream operator isn't working right. \n\nIs it possible that this is caused by a\nanother program running at the same time? I am also running DNS2GO by\nDeerfield http://dns2go.deerfield.com/ and a DirectPlay video game server.\nThe game is Hardwar and I am using version 2.04 - which is the latest version. \nIt was programmed by the people at http://www.softwarerefinery.com/\nand it was published by Interplay.\n\nThanks,\nSteven Borkman\nborkman@buffalo.edu\nhttp://borkman.mygamesite.net/", "id": 12053, "time": "2002-03-20T07:57:39Z", "creator": "borkman@buffalo.edu", "creation_time": "2002-03-20T07:57:39Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "text": "First, noone else has observed this behavior - presume it's your machine.\n\nThree thoughts;\n\n. is your filesystem already corrupted?  chkdsk /f should help here.\n\n. do you run CGI's that might be generating output to stderr?  The\n  stderr messages are sent to the log files.  Any other non-standard\n  modules loaded in the machine?\n\n. Of course try to disable the other programs you think could be\n  conflicting and see if it clears up.\n", "id": 14074, "time": "2002-04-19T18:29:35Z", "bug_id": 7266, "creation_time": "2002-04-19T18:29:35Z", "is_private": false}, {"count": 2, "tags": [], "creator": "borkman@buffalo.edu", "attachment_id": null, "text": "Thanks Mr. Rowe. I ran chkdsk /f and there was indeed a problem.\nAll fixed now.\n\nSteven Borkman\n", "id": 14558, "time": "2002-04-23T22:59:16Z", "bug_id": 7266, "creation_time": "2002-04-23T22:59:16Z", "is_private": false}]