[{"count": 0, "tags": [], "bug_id": 7287, "attachment_id": null, "text": "Problem Description:\n--------------------\n\nRapid succession of page reloads will eventually cause Tomcat to have a very \nslow response time. Use the page at: \n\n     http://www.jeministries.org/tomerror.jsp\n\nUsing Internet Explorer (see NOTE below), reload this page over and over in \nrapid succession by clicking the reload button on the toolbar while holding \nthe control key. This forces the browser to not use the items in its cache, \nvery important. Also, hit the reload button before the page completely loads. \n\nWarning, you may need to reload a lot, but it will eventually happen. The \nsecret is to reload before all the images load.\n\nNOTE: I tried to get this to happen using Internet Explorer on Win98, but I \ncould only get it to happen using my Windows XP Professional IE (completely \ndifferent underlying threading schemes?). Either way, once the server gets \ninto the bad state, requests from any OS's browser hang or are very slow.\n\nPlatform details:\n-----------------\n\nRedhat 7.2 Kernel 2.4.7-10\nTomcat 4.0.3\nSun JDK 1.3.1\n\nNo other processes are up but kernel stuff and tomcat.", "id": 12083, "time": "2002-03-20T14:49:06Z", "creator": "btwebb_flaco@yahoo.com", "creation_time": "2002-03-20T14:49:06Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 7287, "attachment_id": null, "text": "I think I reproduced it on your site, BUT it looks like an IE bug (I tried IE \n6). If I open my Moz on a second machine and connect to the server, it looks \nlike it behaves fine. If I close IE, and retry a little bit later, it also \nlooks like it's fine.\n\nThere may be some info in the logs (other than the IOExceptions caused by the \nclient disconnect) if you think it's not a browser bug.", "id": 12091, "time": "2002-03-20T16:15:07Z", "creator": "remm@apache.org", "creation_time": "2002-03-20T16:15:07Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 7287, "attachment_id": null, "text": "Wow, quick reply, thanks.\n\nI was thinking it's an IE bug too, but when I got the error to occur using XP, \nI went to my Win98 machine and it loaded very slow as well. I didn't do the \nrapid reloads on Win98, just accessed the page after I initiated the error.\n\nI looked through the logs and there were no exceptions. I'm using STRUTS too, \nalthough I make no references to it in the tomerror.jsp page you tested.\n\nI've reopened the bug, but if you don't have any other ideas on what I can do, \njust close it. The problem happens very infrequently.", "id": 12095, "time": "2002-03-20T17:08:52Z", "creator": "btwebb_flaco@yahoo.com", "creation_time": "2002-03-20T17:08:52Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 7287, "attachment_id": null, "id": 13391, "time": "2002-04-12T15:51:06Z", "creator": "remm@apache.org", "creation_time": "2002-04-12T15:51:06Z", "is_private": false, "text": "I still don't understand why or how the problem would happen. It could be a bug \nin the VM network stack. It doesn't look very likely it would be a bug in \nTomcat as the logs don't contain any relevant information. If you find more \nconclusive information, submit it."}]