[{"count": 0, "tags": [], "bug_id": 7470, "attachment_id": null, "is_private": false, "id": 12326, "time": "2002-03-26T02:45:48Z", "creator": "hlein@progressive-comp.com", "creation_time": "2002-03-26T02:45:48Z", "text": "apachectl contains a hardcoded PIDFILE reference, based on what the log dir is\nexpected to be at compile time.  This is suboptimal; a user may modify\nhttpd.conf's PidFile option to point foo.pid elsewhere.  Since the location of\nhttpd.conf is known (hard-coded) at compile time, apachectl can make a best\neffort to learn the current PidFile location by reading httpd.conf.\n\nA real diff is munged by this text box's width, but here's a zero context diff\nof a vaguely tested, fugly but believed to be portable implementation of this:\n\n--- apache_1.3.24/Makefile.tmpl.orig    Wed Mar 13 16:05:27 2002\n+++ apache_1.3.24/Makefile.tmpl Mon Mar 25 21:33:57 2002\n@@ -359 +359 @@\n-       sed -e 's;PIDFILE=.*;PIDFILE=$(runtimedir)/$(TARGET).pid;' \\\n+       sed -e 's;PIDFILE=.*;PIDFILE=`awk '\\''/^ *PidFile /{print $$2}'\\'\"  \\ \t\n\t\t\t\t\t$(sysconfdir)/$(TARGET).conf\"'`;' \\\n\nUnmolested diff at http://www.theaimsgroup.com/~hlein/haqs/#apachectl-pidfile"}, {"count": 1, "tags": [], "bug_id": 7470, "attachment_id": null, "is_private": false, "id": 12327, "time": "2002-03-26T03:25:28Z", "creator": "slive@apache.org", "creation_time": "2002-03-26T03:25:28Z", "text": "Thanks for your suggestion.  This has been brought up before.\nIt has been rejected each time, because apachectl is supposed to be just\na simple shell script.  (Admittedly, it has gotten more and more complicated\nover time.)  What it needs to know about configuration should be either\nprovided at compile time, or manually provided by the administrator.  It should\nbe thought of more as an example than as the be-all and end-all of apache\nmanagement.\n\nYour solution fails not only in the obvious case where httpd.conf is moved,\nbut also in the case where Include (or ResourceConfig or AccessConfig) is used\nto bring in other configuration files.\n\nWe prefer to keep the dumb solution that will fail in obvious ways, rather\nthan the fancier solution that could fail in subtle ways.\n\nA better solution would be to port the httpd command line options that are\nused in windows to signal a running server to shutdown or restart.  httpd\nknows everything about the configuration, and is therefore in a much better\nposition than a shell script to do this work.\n\nThanks again."}, {"count": 2, "tags": [], "bug_id": 7470, "attachment_id": null, "text": "Hm, AFAIK the location of httpd.conf is fixed at compile time, so the only way\nto change that is with an -f option, which already implies manually modifying\napachectl.  OTOH, \"then just make httpd.conf a variable in apachectl\" is\nadmittedly gratuitous complexity, and still this fails utterly to handle the\nInclude case.  So I agree it's not worth it.  Withdrawn ;)  Thanks.", "id": 12330, "time": "2002-03-26T05:16:02Z", "creator": "hlein@progressive-comp.com", "creation_time": "2002-03-26T05:16:02Z", "is_private": false}]