[{"count": 0, "tags": [], "bug_id": 7486, "attachment_id": null, "text": "This is much more a discussion of what I think is a serious design problem than\na bug which it almost certainly is not.\n\nApache interprets the browser's \"AcceptLanguage\" as refusing a file if the\nlanguage of that file is known to the browser and that language is not in the\nAcceptLanguage list. In such a case the servers sends back 406.\n\nThat seems reasonable as stated, but in practice I find it strange.\n\nAs a consumer, I interpret the presence of a language (and its rank in the\nlanguage list) as a preference. In my case a broswer had as the only language in\nthe list \"de\". The browser asked for a file which existed in both English and\nFrench. English is defined as the default language. Since there was no file in\nGerman the server sent back the 406. If the server had not known what the\nlanguage was (say no negotiation installed, or negotiation installed by file did\nnot have \"en\" in its name) it would have served it up.\n\nI hope no one reading will find me sneaky, but my file names are of the form\nfilename.en.html and filename.fr.html (for compatiblity with file creation\nsoftware (Dreamweaver) which doesn't understand Apache content negotiation).\n\nI could understand this behaviour in the case of incompatibility of scripts for\ntwo languages, but it seems to me that the user has asked for a given page and\neven if the user's preferebces can not be satisfied the user should be allowed\nto reject the page by  not reading it.\n\nI apologize if there's a better place for making these comments...", "id": 12343, "time": "2002-03-26T16:13:19Z", "creator": "higonnet@world.std.com", "creation_time": "2002-03-26T16:13:19Z", "is_private": false}, {"attachment_id": null, "tags": [], "bug_id": 7486, "is_private": false, "count": 1, "id": 12345, "time": "2002-03-26T16:29:38Z", "creator": "slive@apache.org", "creation_time": "2002-03-26T16:29:38Z", "text": "Many people agree with you.  The problem is really that nobody configures their\nbrowser correctly.  If you can read english, you should have \"en\" in your\nAccept-Language header.\n\nIn Apache 2.0, the configuration you want is available\nthrough the ForceLanguagePriority directive.  In Apache 1.3, there are\nwork-arounds available to implement something similar.  See:\nhttp://ppewww.ph.gla.ac.uk/~flavell/www/lang-neg.html\nfor an excellent discussion of all the issues involved."}]