[{"count": 0, "tags": [], "bug_id": 7527, "attachment_id": null, "id": 12407, "time": "2002-03-27T18:12:40Z", "creator": "feahmed@hotmail.com", "creation_time": "2002-03-27T18:12:40Z", "is_private": false, "text": "I have a WAR file named \"MyAppl.war\". I dont define anything about this WAR \nfile in \"server.xml\", just place the file in CATALINA_HOME/webapps directory \nfrom where it is automatically unpacked and everything works fine.  Now I want \nto be able to access other servlet contexts from it, and as it turns out by \ndefault crosscontext defaults to false for Tomcat 4.0.2 as opposed to the 3.x \nreleases. So I go ahead and add the following to my server.xml :\n\n<Context path=\"/MyAppl\"  docBase=\"MyAppl\" crossContext=\"true\"/>\n\nNow, the WAR file is NOT automaticlly expanded. The log indicates that it \nerrors out because the directory \"MyAppl\" does not exist. Shouldnt this \ndirectory be automatically created by Tomcat? If I manually expand the WAR \nfile, everything works fine."}, {"count": 1, "tags": [], "bug_id": 7527, "text": "The deployer doesn't work like that, actually.\n\n*** This bug has been marked as a duplicate of 4829 ***", "id": 12408, "time": "2002-03-27T18:22:12Z", "creator": "remm@apache.org", "creation_time": "2002-03-27T18:22:12Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "feahmed@hotmail.com", "attachment_id": null, "text": "Can you please elaborate on the comment \"The deployer doesn't work like that, \nactually\". Do you think what I claimed to be happening does not happen in \nreality? or whatever I have claimed is the right behavior?\n\nI have read details of Bug 4829 (this bug is marked as duplicate of 4829) and I \nstrongly believe we have a problem. Just think about it, \"a WAR file is \nautomatically expanded by Tomcat, but if I just want to enable crosscontext \nsupport, it will not be expanded automatically.\" Doesnt it sound like a bug? \nJust because I want the crosscontext property enabled for the application and I \nadd a line in server.xml I would not be able to distribute it in a WAR file, \nbut would have to distribute it in expanded form?", "id": 12418, "time": "2002-03-27T20:20:03Z", "bug_id": 7527, "creation_time": "2002-03-27T20:20:03Z", "is_private": false}]