[{"count": 0, "tags": [], "creator": "uli@medallia.com", "attachment_id": null, "is_private": false, "id": 12470, "time": "2002-03-28T20:07:19Z", "bug_id": 7588, "creation_time": "2002-03-28T20:07:19Z", "text": "I ran into the problem using IE 6.0 and the following sequence of events:\n* completed first session using http://foo.org.\n* later, from the same browser window, I could not establish a new session \nusing http://www.foo.org.\n\nIE stores two JSESSIONID cookies in this case, for both 'foo.org' \nand 'www.foo.org'.  (The first session had been ended with a call to invalidate\n(), but this call does not cause the session cookie to be deleted.)  Tomcat \nseems to look at the old session cookie only, causing the failure to establish \na new session.  So a fix might be to have Tomcat check all session cookies?\n\nThe problem also occurs with Tomcat 4.0.3, but not with Tomcat 3.3a."}, {"count": 1, "tags": [], "bug_id": 7588, "text": "This is a Bug, that manifests itself in Bug #10419. Only the first cookie with \na session-id is taken from the response, but it is not checked, whether this \nis a valid session within that context. ", "id": 18863, "time": "2002-07-02T17:23:50Z", "creator": "H.Zeller@acm.org", "creation_time": "2002-07-02T17:23:50Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "peter@sigent.com", "attachment_id": null, "text": "Yes, this is a BUG, and it seems that it is a serious bug, because probably at \n1% of sessions are lost with IE, when the session for some circumstances is \ninvalidated but cookie is left non-expired, and after that the new session is \ngenerated and IE(6 and 5 for me) _ALWAYS_ sends two cookies JSESSIONID; but the \nfirst cookie is for invalid session, so tomcat treats that the session is new, \nalthough the second cookie contains the actual session id.\n\nAlso, I have read in Netscape Standard for Cookies \n(http://wp.netscape.com/newsref/std/cookie_spec.html for your reference):\n----------\nInstances of the same path and name will overwrite each other, with the latest \ninstance taking precedence. Instances of the same path but different names will \nadd additional mappings. \n----------\nWell, I suppose this document is pretty old, but nor later RFCs (2109,2965) nor \nServlet 2.3 Specification  does not contain any information about cookie \npriority, so it is a good thing to think about.\n\nAnd I am very frustrated that this bug remains NEW for about a year - isn't it \na buglist?? Yes, I know that Mr.Maucherat in a similar bug 10419 \n(http://nagoya.apache.org/bugzilla/show_bug.cgi?id=10419) resolved this as \nWONTFIX, saying that he doesn't see any real use cases. Please, reconsider \nabout this or at least say something.\n\nCinecerly,\n  Peter.", "id": 33619, "time": "2003-03-21T20:14:07Z", "bug_id": 7588, "creation_time": "2003-03-21T20:14:07Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 7588, "text": "\n\n*** This bug has been marked as a duplicate of 10419 ***", "id": 51867, "time": "2004-02-07T14:43:54Z", "creator": "funkman@joedog.org", "creation_time": "2004-02-07T14:43:54Z", "is_private": false, "attachment_id": null}]