[{"count": 0, "tags": [], "text": "Occasionally, some of my visitors who use Microsoft Internet Explorer\nget a \"Download File\" dialog instead of viewing the static html page\non my website (www.hot-deals.org).  I have been trying to track down\nthis problem for months now, but no one seems to have any idea why\nthis happens.\n\nThis happened occasionally to my users when I was using Apache 1.3.20,\nand is not occuring a little more frequently under Apache 1.3.23.\n\nThe visitors that reported this problem to me, say that when it\nhappens they get the \"Download File, Save To Disk\" dialog.  Hitting\nthe site again repeats the download dialog.  After a little while, the\ndialog goes away, and the page is served normally.  Those users say\nthat the webpage works fine for several weeks, then for no reason the\n\"Download File\" dialog reappears.\n\nIt appears to be user-specific, not site-wide.  Meaning, a single user\nmay report that they are currently getting the \"Download\" dialog\ninstead of viewing my page's static HTML screen, and no other user\nwill report problems during that time.\n\nI believe this is a bug related to how Apache talks to a Microsoft\nInternet Explorer browser, when Apache delivers gzipped static html.\nThis bug happens very infrequently compared to the amount of traffic\nthat I get.  However it happens enough to warrant me spending my time\nin attempt to get to the bottom of this issue.\n\nIf a user chooses to download the file, it appears that the gzipped\nversion of the html is sent from Apache.  What's even more weird is\nonce a user downloads & saves the file, they can successfully view the\nwebpage with no problems.\n\nPLEASE HELP!  I have been trying to track down this problem for months\nnow!\n\nI fear that this problem is related to the gzip module within Apache.\nI really want to keep the gzip module there, because my front page is\n188 KBytes of HTML, but users only download 42 KBytes because the gzip\nmodule sends the user the compressed version of the html.  The pages\nare served over http (port 80), not SSL-encrypted https.  The front\npage of my website is static html text, not CGI or Perl or PHP or\nother dynamic html generator.\n\nI am currently running Apache 1.3.23, compiled by me (not using RPMs).\nMy linux kernel is 2.4.17 SMP, also compiled by me.  Apache DSO (not\nstatic) modules that I am using within Apache:\n\n- Mod_SSL 2.8.6 with OpenSSL 0.9.6c\n- Mod GZIP 1.3.19.1a\n- PHP 4\n- FastCGI\n- mod_unique_id\n- mod_headers\n- mod_auth\n- mod_access\n- mod_alias\n- mod_userdir\n- mod_actions\n- mod_imap\n- mod_cgi\n- mod_dir\n- mod_autoindex\n- mod_include\n- mod_status\n- mod_negotiation\n- mod_mime\n- mod_log_config\n- mod_env\n\nPLEASE HELP!  I have been stumped for months now, with no leads as to\nthe cause of the problem.", "is_private": false, "id": 12489, "creator": "jon2@modem.org", "time": "2002-03-29T14:23:16Z", "bug_id": 7604, "creation_time": "2002-03-29T14:23:16Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 7604, "attachment_id": null, "id": 12493, "time": "2002-03-29T16:11:51Z", "creator": "slive@apache.org", "creation_time": "2002-03-29T16:11:51Z", "is_private": false, "text": "I'm sorry, but this certainly look like a problem with mod_gzip.  Since we\ndon't distribute that module, we really can't help you with problems\ninvolving its use.  Please report this to the authors of mod_gzip.\n\nThanks for using Apache."}]