[{"count": 0, "tags": [], "bug_id": 7681, "attachment_id": null, "text": "This bug exists also in version 4.01, so it is much possible it exists in all \n4.x versions.\nI found that Tomcat has a quite serious bug, that causes it not working \ncorrectly when more than one thread is processing requests.\nThe bug appears when the welcome file is a FRAMESET definition file, which\ndoes not access session object nor use beans - the first access of session is \nby session-scope bean definition in pages, that are loaded in frames from this \nframeset.\nNow, since browser makes requests for frames concurrently, each frame is \nusually processed by different Tomcat thread. And there is a problem: if two \nframes uses the same bean (of session scope), it often gets initialized \ntwice !!! (it usually happens when the bean communicates with database during \ninit, or makes other time-consumpting operation).\nThe workaround is to make welcome file access the session (e.g. by setting some \nattribute or by reading session ID) - then the bean gets instantiated only once.\n\nThe reason for this bug is in servlet generated from JSP: there are parts that \nare synchronized on \"session\" object - it does not make any sense, since \nsession is an instance of StandardSessionFacade, which is a page-level object - \nit is created as new object on every page, and every time the page is accessed \n(just print it on System.out - every time, different address is printed); it \nwould make sense if the synchronization was on HttpSession object encapsulated \nby StandardSessionFacade.", "id": 12655, "time": "2002-04-02T07:50:42Z", "creator": "marcin_ol@poczta.onet.pl", "creation_time": "2002-04-02T07:50:42Z", "is_private": false}, {"count": 1, "tags": [], "text": "This is invalid, because by definition if your object instance is to be shared\nbetween two threads, it must be synced (or at least, the init must be synced here).", "attachment_id": null, "id": 12704, "creation_time": "2002-04-02T19:08:51Z", "time": "2002-04-02T19:08:51Z", "creator": "remm@apache.org", "bug_id": 7681, "is_private": false}, {"count": 2, "tags": [], "creator": "marcin_ol@poczta.onet.pl", "attachment_id": null, "id": 12729, "time": "2002-04-03T06:46:13Z", "bug_id": 7681, "creation_time": "2002-04-03T06:46:13Z", "is_private": false, "text": "Of course, I agree. \nBut it is not the case: my bean is a session bean, so the object should be \ncreated only once per user session, while now, its constructor often gets \ncalled twice per one user session (two objects are created, and the second one \nreplaces the first one in session object. \nThat means, any state preserved by a page in first frame will then be discarded \nby a second frame, that also created such object. Synchronization won't help \nunless I made all bean methods static synchronized, but then I won't need any \nbean. (Actually, I do have my methods synchronized; but I see no reason why \nsession beans should be created more than once per user session). \n\nAlso, as I said, in generated servlet there is a \"synchronized (session)\" \nblock - and session object is always different (see \nHttpRequestFacade.getSession method - it always created a new \nStandardSessionFacade), so there is no use to make that block synchronized, and \nsynchronization pays significant role in performance decrease...\n\nI'm leaving the state of this bug as it is - if You accept the explanation, \nplease reopen it."}]