[{"count": 0, "tags": [], "text": "The attached zip file, ant-test.zip, shows that running ant against the \nbuild.xml file results in a test.jar file that has files in a web-inf \ndirectory, instead of the WEB-INF directory.  The web.xml file and all files \nadded to web-inf (one-level deep in the jar file) using the webinf nested \nelement exhibit this behavior.  I looked at the source code and it looks \nright... the code adds the WEB-INF path to a File object and adds it to a \nZipFileSet.  May be a platform specific issue.  Adding files using the webinf \nnested element that are > one level deep in the jar file fixes the problem.\n\nThe issue is that JBoss 2.4.4 rejects the war file if the web.xml files is not \nfound in WEB-INF (case sensitive).  So the war utility is unusable for this \napp server and the jar core task will be have to be used as a workaround.", "is_private": false, "id": 12659, "creation_time": "2002-04-02T09:32:07Z", "time": "2002-04-02T09:32:07Z", "creator": "tim_d_wilson@bigfoot.com", "bug_id": 7683, "attachment_id": null}, {"count": 1, "attachment_id": 1461, "bug_id": 7683, "text": "Created attachment 1461\nAnt Test that displays War case sensitivity issue with WEB-INF", "id": 12660, "time": "2002-04-02T09:33:21Z", "creator": "tim_d_wilson@bigfoot.com", "creation_time": "2002-04-02T09:33:21Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 7683, "text": "Have you actually experienced a JBoss rejection from a <war> generated WAR \nfile?  If so, could you paste in the errors you're seeing.  Its an age-old FAQ \nabout <war> and lowercase web-inf because WinZip shows it lowercase but it \nextracts uppercase.  Could that be the problem?  I'm marking as INVALID since \nwe've seen this same issue brought up many times and its not a bug, just a \nviewer issue.  If you have more info that shows a bug then re-open.", "id": 12665, "time": "2002-04-02T10:44:12Z", "creator": "jakarta@ehatchersolutions.com", "creation_time": "2002-04-02T10:44:12Z", "tags": [], "is_private": false}]