[{"count": 0, "tags": [], "bug_id": 7686, "attachment_id": null, "text": "This is a strange behaviour in Tomcat 4.0.3.\n\nWhen using inclusion like \n\nrequestDispatcher().include() in servlets or \n<jsp:include page=\"...\" /> in JSP pages, \n\npathInfo parameters don't work as expected, and should probably not be used.\n\nThis problem appears when you create a servlet that uses the pathInfo part of \nthe request to include another resource from the context, especially a JSP \npage. \n\nExample: \nYou have a context \"test\" and a servlet \"test02\" that is called \nlike \"/test/test02/somefile\". Then in \"test02\" you use the pathInfo \"/somefile\" \nto do something like \nrequestDispatcher(\"/test02/somefile\").include(request, response).\nNow let's say \"somefile\" can be \"some.jsp\" and \"test.html\", which are pages in \nthe context.\nIf in \"some.jsp\" there is a statement <jsp:include page=\"/test02/test.html\">, \nand you call \"/test/test02/some.jsp\" in the browser, inclusion won't work, and \nyou will even run in an ugly endless inclusion loop. HOWEVER if you change from \nusing pathInfo to \"old style\" parameters (like /test/test02?file=some.jsp\" and  \n<jsp:include page=\"test02?file=test.html\"> it works fine. However, I see no \nreason for the pathInfo parameter case not working as well.\n\nI have created a small war archive (http://www.sysmics.de/download/test.war) \nthat illustrates the problem and gives plenty of cases. Please have a look at \nthe \"/index.html\" page for an overview.", "id": 12673, "time": "2002-04-02T14:02:11Z", "creator": "a.kandzior@alkacon.de", "creation_time": "2002-04-02T14:02:11Z", "is_private": false}, {"count": 1, "text": "I think your test is incorrect. Your included servlet can access the path\ninformation of the outer request, and has access to the \"included\" paths through\nthe attributes (which your servlet is never using). If you were doing the\nincludes based on the pathInfo attribute, it apparently would be working ok.\n\nNote: The fix for bug 8092 may be needed for this to work (only available in the\nnightlies at the moment).", "bug_id": 7686, "is_private": false, "id": 14639, "time": "2002-04-24T16:21:20Z", "creator": "remm@apache.org", "creation_time": "2002-04-24T16:21:20Z", "tags": [], "attachment_id": null}]