[{"count": 0, "tags": [], "bug_id": 7689, "attachment_id": null, "id": 12700, "time": "2002-04-02T17:35:07Z", "creator": "osvaldo@visionnaire.com.br", "creation_time": "2002-04-02T17:35:07Z", "is_private": false, "text": "I noticed a severe performance problem with the Xerces parser.  Tomcat was\ntaking longer to initialize after I started using Sun XMLPack/Spring02 for\nXML parsing (includes Xerces 2.0.0).  Time went up in ~1,5s for a 1500MHz\nmachine (Windows 2000, JDK 1.4.0, Tomcat 4.0.4-beta2).  I investigated it\nwith OptimizeIt! and found that Xerces was spending virtually all of this\nadditional time by calling java.util.zip.InflaterInputStream.read() -- i.e.,\nit's reading data from a compressed file (I guess Tomcat stores XML config\nfiles in jars) one byte at a time, instead of using buffered reads, here:\nXMLEntityManager.RewindableInputStream.read() is reading data without any\nbuffering.  This is usually slow in any stream, but particularly slow in\nthe zipped streams.  There is a lot of memory management / GC overhead, as\nthe InflaterInputStream.read() method is allocating 600,000 'byte[1]' objs.\nBack to JDK1.4.0's built-in parser (Crimson), the performance is OK again\nand the abnormal time and allocation behaviors disappear.  Xerces 2.0.1\nbehaves the same. The root of all evil seems to be places like:\norg.apache.catalina.startup.ContextConfig.defaultConfig(XMLMapper) which\nis clearly building an unbuffered FileInputStream and starting to parse\nthe XML data from this stream.  Maybe adding a buffered stream to this\npipeline wouldn't hurt here, and help a lot when using Xerces.  I wonder\nif the time savings wouldn't be very important for complex Tomcat setups\n(my config is extremely simple, basically the default Tomcat install).\n\nI believe the problem doesn't happen with older parsers like Crimson\nbecause these parsers may extract the data from compressed files before\nparsing it, or maybe they add some buffer streams in the pipeline, while\nXerces2 is obviously not doing any; each single byte is read individually\nand pays the full I/O pipeline overhead."}, {"count": 1, "tags": [], "text": "I see startup taking about 1s longer using xerces 2.5.0 rather than the JDK \n(JDK 1.4.2_05, TC4-CVS, WinXP, 866MHz P4) but this doesn't change with your \nsuggested patch.", "attachment_id": null, "id": 61018, "creation_time": "2004-07-22T23:33:24Z", "time": "2004-07-22T23:33:24Z", "creator": "markt@apache.org", "bug_id": 7689, "is_private": false}]