[{"count": 0, "attachment_id": null, "bug_id": 8026, "text": "The value of \"Method.invoke()\" is not debatable.  However, it has its issues,\noutside of pure performance questions.  one annoyance with it is the\n\"InvocationTargetException\" that it can throw.  The meaning of this is that the\ncalled method threw an exception.  It doesn't note WHAT the exception was, just\nthat it threw an exception.  If the called method didn't log or print the\nexception in some way, there's no way to know what happened.\n\nThis is what can happen when the Digester is parsing the Tomcat configuration files.\n\nI made a mistake in merging changes from my old 4.0.4b2 \"server.xml\" into the\nCVS latest \"server.xml\".  I ended up putting the \"manager\" Context into the new\n\"server.xml\".  I didn't notice the \"manager.xml\" in webapps.  I guess that\nsomehow takes the place of the Context in the \"server.xml\" (although I can't\nquite get \"manager\" to work yet).  Anyway, when Tomcat starts up with the bad\n\"manager\" Context, I eventually get an error from \"MethodUtils.invokeMethod\",\nbeing an InvocationTargetException.  This is all I get.  I don't even know what\nmethod it was invoking.\n\nI eventually had to build the latest Tomcat from CVS, and I added a print\nstatement in that method, showing every method it was calling.  I noticed the\nlast one before it died, which was \"StandardHostDeployer.addChild()\".  When I\nbroke in that method in the debugger, it pointed out the problem to me, as it\nattempted to throw an IllegalStateException, which would have been thrown away.\n\nI'm not certain whether this should be reported against Tomcat, or Commons.  The\nreal problem is that \"Method.invoke()\" can't record exceptions thrown from the\ncalled method, but I doubt that'll be changed anytime soon.\n\nIn Tomcat, you could try to log all exceptions that \"might\" be called from the\nDigester, which is probably impractical.\n\nI would guess the best fix would be to have the direct or indirect caller of\n\"MethodUtils.invokeMethod()\" to log the ITE exception, indicating the method\nthat was called.  That would at least point someone to the method, which is\nbetter than nothing.", "id": 13396, "time": "2002-04-12T16:50:01Z", "creator": "dmkarr@earthlink.net", "creation_time": "2002-04-12T16:50:01Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "is_private": false, "id": 13431, "time": "2002-04-12T23:09:13Z", "bug_id": 8026, "creation_time": "2002-04-12T23:09:13Z", "text": "Thanks for the feedback. This is definitely an enhancement, though."}, {"count": 2, "tags": [], "bug_id": 8026, "attachment_id": null, "text": "The offending StandardHostDeployer is no longer present in 5.5.x onwards.", "id": 142668, "time": "2010-12-13T18:19:19Z", "creator": "markt@apache.org", "creation_time": "2010-12-13T18:19:19Z", "is_private": false}]