[{"count": 0, "tags": [], "text": "*** There is a diff at the bottom of the mail ***\n\n\nI'm using Batik's svggen package to draw with java2d\nand output an SVG. Everything is going great, but I'm\nhaving problems with missing glyphs in the generated\nSVGs at times. This is running in a servlet engine, so\nI don't have much control over threading unless I\nsynchronize things, which I'd rather not do. I am using\nSVG Fonts (i.e. I call setEmbeddedFonts(true) on the\nSVGGeneratorContext).\n\nI dug into the batik code to see what's up and I believe\nthe problem is in SVGFont. The fontStringMap (which is\na hashmap) is statically defined. It gets newed at\nclass load time (there is a = new HashMap() in the\ndeclaration) and is also gets newed in the constructor.\nIt seems very odd to me to be both using this class as\na static (like in drawString which calls recordFontUsage\nstatically) and also non-statically (the \nSVGGraphicContextConverter instantiates a new SVGFont and\nuses it as a converter to output svg when needed).\nThe SVGGraphicsContextConverter looks like it's being\ninstantiated when I make a new SVGGraphics2D.\n\nThe fontStringMap really shouldn't be static. If I\ninstantiate two SVGGraphics2D objects, I'd expect\nthem to have separate fontStringMaps, so I'd expect\nfontStringMap to be somehow associated with the\nSVGGraphics2D instance that I called drawString on.\n\nWhat I did was move the fontStringMap instance \nvariable to SVGGraphicsContext and change the call to\nrecordFontUsage in SVGGraphics2D.drawString to \ncall graphicsContext.recordSVGFontUsage, then I \nfixed up SVGFont to take in the Map to record\nto in its recordFontUsage and kept it static and\nmade toSVG use the fontStringMap on the\nSVGGraphicsContext.\n\nI did this against 1.1.1 and the diff is below. I\ndon't have CVS right now, so I didn't make the diff\nagainst the latest code. I also have no idea where the\ndiff executable I used came from. Hopefully the changes are\nappropriate and simple enough to apply to the latest\ncode easily. This fixed my missing font glyphs for\nSVG Fonts.", "is_private": false, "bug_id": 8151, "id": 13735, "time": "2002-04-16T07:50:20Z", "creator": "tkormann@apache.org", "creation_time": "2002-04-16T07:50:20Z", "attachment_id": null}, {"count": 1, "tags": [], "creator": "vincent.hardy@sun.com", "attachment_id": null, "id": 13761, "time": "2002-04-16T13:14:46Z", "bug_id": 8151, "creation_time": "2002-04-16T13:14:46Z", "is_private": false, "text": "Fixed in a slightly different manner than suggested by Chad.\nMade the map non-static (that was a mistake). Access to SVGFont\nmap is done through the SVGGraphicContextConverter."}]