[{"count": 0, "tags": [], "bug_id": 8187, "attachment_id": null, "text": "Using MS Access 97 database and tomcat 3.2.2, I receive 2 particular errors \nthat repeats often when worked for more than 1/2 an hour, continously.\n\n1. Error 500 - Cannot open any more tables. \nIn this case, i shutdown the tomcat server & then restart it. Is there any \nother method to overcome this problem or any check to be made in the tomcat \nserver timer.\n\n2. Object Invalid or not set.\nI also get this message often and it deals with javax.servletexception. But \nthis doesn't have to do anything with my JSP codes. Because, the same page when \nworked again, gives me proper results. But after sometime, this error throws up.", "id": 13831, "time": "2002-04-17T07:02:33Z", "creator": "swarnapuri@hotmail.com", "creation_time": "2002-04-17T07:02:33Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 8187, "attachment_id": null, "text": "Your first problem is better suited for the Tomcat-User mailing list.\n\nYour second problem needs a better bug report - one that includes a stack trace\nand some sample code. In case you would like a resolution to your problem,\nplease file a fresh and specific bug report. Please also test against the latest\nstable Tomcat, if possible. See http://tomcat.apache.org/whichversion.html for\nmore info", "id": 93411, "time": "2006-09-12T16:00:08Z", "creator": "sriramnrn@gmail.com", "creation_time": "2006-09-12T16:00:08Z", "is_private": false}, {"count": 2, "text": "Marking bug as NEEDINFO, since we need more information from the person\nreporting the bug.", "bug_id": 8187, "is_private": false, "id": 93750, "time": "2006-09-18T17:21:09Z", "creator": "sriramnrn@gmail.com", "creation_time": "2006-09-18T17:21:09Z", "tags": [], "attachment_id": null}, {"count": 3, "tags": [], "creator": "markt@apache.org", "attachment_id": null, "is_private": false, "id": 114108, "time": "2008-02-28T11:46:16Z", "bug_id": 8187, "creation_time": "2008-02-28T11:46:16Z", "text": "Tomcat 3 is no longer the focus of development.\n\nIt is almost certain there will be no development work on versions prior to 3.3.x and it is highly unlikely that further development will take place on 3.3.x\n\nAll open Tomcat 3 bugs are therefore being closed as WONTFIX.\n\nIf any of these issues is still a problem for you, please test the latest stable release of a supported version (http://wiki.apache.org/tomcat/TomcatVersions). If you still have the issue with the latest stable release of a supported version, please re-open this bug and change the version to the one you tested."}]