[{"count": 0, "tags": [], "bug_id": 8190, "attachment_id": null, "is_private": false, "id": 13834, "time": "2002-04-17T07:53:55Z", "creator": "j_a_fernandez@yahoo.com", "creation_time": "2002-04-17T07:53:55Z", "text": "Hi, if I specify a <ejb-client-jar> entry in the <ejb-jar>\ndescriptor, the file is created in the current directory instead\nof relative to where the ejbjars are created.\n\nAdditionally, is there any way to control what gets put there or\nwhat will happen if multiple ejbjars especify the same client-jar\nname?"}, {"count": 1, "tags": [], "bug_id": 8190, "attachment_id": 1992, "is_private": false, "id": 17092, "time": "2002-06-03T17:16:50Z", "creator": "pkrause@soundbite.com", "creation_time": "2002-06-03T17:16:50Z", "text": "Created attachment 1992\nant -debug output for a CMP EJB"}, {"count": 2, "tags": [], "bug_id": 8190, "attachment_id": null, "is_private": false, "id": 17808, "time": "2002-06-14T16:04:42Z", "creator": "conor@apache.org", "creation_time": "2002-06-14T16:04:42Z", "text": "The creation of the client jar is done by ejbc and not Ant. It seems that ejbc\nputs the jar in the current directory which is usually not where the generate\ndjars end up. That isn't very helpful but it probably needs an option on ejbc to\nmake it go somewhere else."}, {"count": 3, "tags": [], "creator": "j_a_fernandez@yahoo.com", "is_private": false, "id": 17964, "creation_time": "2002-06-18T08:01:39Z", "time": "2002-06-18T08:01:39Z", "bug_id": 8190, "text": "Some comments on this issue:\n\n1) If I understand correctly WL's ejbc is run in a separate VM, clould it be \npossible to specify a different directory in which to run the command so that \nthe jars get put there? something like clientdir=\"lib/clients\".\n\n2) Weblogic will recreate this files once you actually deploy on the server,\nmy main problem with the current behaviour is that it polutes my top directory \nwith this useless (at this time) jar files. Maybe an option of \npreserveClientJars=\"false\" could be use for the task to delete the generated \njars.\n\n3) It is not clear what WL will do if you have several ejb-jar.xml files that \nmention the same client-jar entry (I would like to get all them combined bt I \ndoubt that will happen) maybe we should have our own <clientjar/> task that \nknows how to pick the right classes and puts them in the right places.\n\nFood for thought.\n", "attachment_id": null}]