[{"count": 0, "tags": [], "bug_id": 8261, "attachment_id": null, "id": 13982, "creation_time": "2002-04-18T15:59:39Z", "time": "2002-04-18T15:59:39Z", "creator": "psychosos@gmx.at", "text": "the Customlog directive is not allowed within the Directory*, Location* and Files* containers (only in global and vhost)\nThough it is possible to get a similar result using environment variables and conditional logging it would be easier if Customlog was simply allowed within these containers. (And I can't see any reason why it is not)\n\nThough I guess this applies to all systems and platforms I only added W2k/PC since this is where I am testing.\n\nAs far as I can judge from the documentation it applies to Apache 2 as well.\n\nSteps to Reproduce: Add a valid CustomLog directive inside a <Directory>, <Location> or <Files> container in your configuration file. Restart Apache.\n\nActual Results: Apache refuses to start and put the following message to stdout:\n\"Syntax error on line xxx of c:/program files/apache/conf/httpd.conf: CustomLog not allowed here\"\n\nExpected Results: Apache should start up as normal and log all requests to the directories/locations/files into the appropriate log file specified by CustomLog.", "is_private": false}, {"count": 1, "tags": [], "bug_id": 8261, "attachment_id": null, "id": 14079, "time": "2002-04-19T19:06:08Z", "creator": "wrowe@apache.org", "creation_time": "2002-04-19T19:06:08Z", "is_private": false, "text": "While not impossible, this is a reasonably complex change.  It is unlikely\nto be considered for Apache 1.3 due to the rearrangement of internal structures\nrequired that would break binary compatibility with recent versions.\n\nI'm reassigning to Apache 2.0 since developers are more willing to consider\nnew features and improvements to that branch of the development effort."}, {"count": 2, "tags": [], "bug_id": 8261, "attachment_id": null, "id": 17852, "time": "2002-06-15T06:10:30Z", "creator": "rbb@apache.org", "creation_time": "2002-06-15T06:10:30Z", "is_private": false, "text": "The best way to do this type of thing, is to run a script on the log files\nafter they have been written, or to use piped logs.  The biggest problem with\nthis idea, is that EVERY CustomLog directive requires a separate file.\nIf we allow a CustomLog inside of <directory>, <location>, and <files> containers,\nit will be very easy to run out of file descriptors very quickly.\n\nBeyond that, the logging modules are not designed to solve every possible problem,\nthey are designed to do as little as possible, and allow for external programs\nto solve the harder problems.\n"}]