[{"count": 0, "tags": [], "text": "When a CGI script runs for a long time and the user clicks the \"Stop\" or \"Back\" \nbutton in the browser before it ends, the server fails to terminate the CGI \nprocess on the server, even if the CGI script is frequently writing back \nlines.  Here's a sample partial CGI script:\n\n$| = 1;\nprint \"<pre>\\n\":\nforeach (1 .. 50)\n{\n    print \"line $_\\n\";\n    sleep (1);\n}\n\nThis script continues to run even if the user has clicked \"Stop\" in the browser \n5 seconds into the process.\n\nI remember fixing this problem in Apache 1.3 by closing the right process \nhandle.  But since 1.3 was not able to have unbuffered I/O to write back to the \nHTTP server process immediately, the fix was not useful for 1.3 anyway.  Now \nthat 2.0 seems to be able to have unbuffered IO for CGI output (finally!), \nfixing this bug would be extremely helpful, especially in defeating MS.  This \nis a killer shortcoming of IIS where a run-away CGI script can never be \nterminated except the pre-defined \"cut-off\" time for all scripts.", "is_private": false, "id": 14381, "creator": "qwan@seatab.com", "time": "2002-04-23T01:02:41Z", "bug_id": 8388, "creation_time": "2002-04-23T01:02:41Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 8388, "attachment_id": null, "id": 14952, "time": "2002-04-28T17:08:52Z", "creator": "slive@apache.org", "creation_time": "2002-04-28T17:08:52Z", "is_private": false, "text": "I wonder if this is caused by the same thing as bug 8253 (r->connection->aborted\nnot set)?"}, {"count": 2, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "is_private": false, "id": 24722, "time": "2002-10-17T02:34:53Z", "bug_id": 8388, "creation_time": "2002-10-17T02:34:53Z", "text": "[This is a mass bug update.]\nThis bug reports a problem in an older version of Apache 2.\nCould you please update to the most recent version and see\nif you can reproduce this problem.  If the bug still exists,\nplease update the bug with the latest version number.  If \nthe bug no longer exists, please close the bug report.\n\nSorry for this impersonal response, but we get many more bug\nreports than our volunteers can keep up with.\nThanks for using Apache!"}, {"count": 3, "tags": [], "bug_id": 8388, "attachment_id": null, "id": 25425, "creation_time": "2002-10-31T11:57:40Z", "time": "2002-10-31T11:57:40Z", "creator": "trawick@apache.org", "text": "With some fixes committed this morning to mod_cgi.c and server/protocol.c,\nthe CGI script is normally terminated when using mod_cgi.\n\nThere may be some paths in mod_cgi that aren't fixed, and mod_cgid is\ndefinitely still broken.\n", "is_private": false}, {"count": 4, "tags": [], "bug_id": 8388, "attachment_id": null, "id": 25931, "time": "2002-11-08T14:11:40Z", "creator": "bo@kase.se", "creation_time": "2002-11-08T14:11:40Z", "is_private": false, "text": "I don't know why this bug is not being considered. I now try to post it as a\nLinux/Apache 2.0 bug, since it is to be found there too, in case that will draw\nmore interest. I would think it is a major problem that Apache can not run\ncgi-scripts with keep-alive, and I would like our technical department to be\nable to upgrade our apache installations (for security fixes etc) without me\nhaving to patch it first. I am not sufficiently aware of the purpose of the\nproblematic code to propose a final solution - in my own case, it is quite OK to\njust throw it out, but I would think it serves some purpose - perhaps to stop\nfaulty cgi-scripts from running endlessly. Perhaps it could be specified in the\nconfiguration file whether this action is wanted or not."}, {"count": 5, "tags": [], "text": "In general you can't assume that a PR is not being considered if there\nis no update in the last several days.\n\nAs already noted in the PR, it now works with mod_cgi with current code\nfrom CVS.  I am still working on getting it working with mod_cgid.  (I have\nit working in a patch posted to dev@httpd yesterday, but the patch needs \nsome further work before committing.)\n\nI'm confused about your statement\n\n  \"Apache can not run cgi-scripts with keep-alive\"\n\nWhat is the connection between keep-alive and this PR?\n", "is_private": false, "bug_id": 8388, "id": 25935, "time": "2002-11-08T14:20:53Z", "creator": "trawick@apache.org", "creation_time": "2002-11-08T14:20:53Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 8388, "attachment_id": null, "is_private": false, "id": 25936, "time": "2002-11-08T14:25:11Z", "creator": "trawick@apache.org", "creation_time": "2002-11-08T14:25:11Z", "text": "looks like bo@kase.se complained on the wrong PR by mistake...  ignore the last\ntwo updates :)"}, {"count": 7, "tags": [], "bug_id": 8388, "attachment_id": null, "id": 26108, "creation_time": "2002-11-11T23:10:28Z", "time": "2002-11-11T23:10:28Z", "creator": "trawick@apache.org", "text": "A fix has just been committed to mod_cgid to terminate scripts which the\nconnection drops.  Hopefully it will be in the next stable Apache 2 release\n(2.0.x).  The mod_cgi fixes will almost definitely be in the next\nstable Apache 2 release.\n\n\n", "is_private": false}]