[{"count": 0, "tags": [], "bug_id": 853, "text": "I have setup a url that is protected by tomcat.  The url showen in the browser \nwhen the loging page is rendered is the url that I was trying to reach, BUT, \nthe url shown after successfully logging in is j_security_check.  This causes \nall links on the page to be broken.  The workaround is to include the full url \nfrom the root.", "id": 998, "attachment_id": null, "creator": "mayank.shah@gs.com", "creation_time": "2001-03-05T14:58:16Z", "time": "2001-03-05T14:58:16Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 853, "text": "What does your login page look like?  It should be submitting to \n\"j_security_check\" (as the servlet spec requires) so that the ultimate URL \npresented will be relative to the correct directory.\n\nFor example, if your protected area is \"/protected/*\" and the user issues a \nrequest for \"/protected/index.html\", the form login process wil get initiated.  \nAfter successful authentication, the redirected URL will be \n\"/protected/j_security_check\" so that any relative references in the \n\"index.html\" page will still be resolved correctly.\n", "id": 1602, "time": "2001-03-26T12:39:37Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-03-26T12:39:37Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 853, "text": "But if you execute a reload on the browser, you get an error. I think that, \nlike tomcat 3, a correct authentication should send a page redirect to the \noriginal page who fires the login form page.", "id": 2369, "time": "2001-05-09T15:12:21Z", "creator": "vicentesalvador@netscape.net", "creation_time": "2001-05-09T15:12:21Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 853, "text": "I've analized what's the matter with this bug.\n\n1. First what is doing now Tomcat 4\n\nWhen accessing a protected URL then the session and request objects are stored,\nthen the session and request objects are cleared and initialized the request URI\nto the login page URI.\n\nThe login page post to /j_security_check constant and then the original request\nand session objects are retrieved and let the server continue, so the browser\nthinks that the URL is /j_security_check but the content received corresponds to\nthe original page.\n\n2. What we should do\nStoring the request and session objects, clear then and send the login page.\n\nWhen /j_security_check is received then redirect the browser to the original\nURL. Also we should set a flag into the session object.\n\nWait to the browser to request the original page, then if the flag is setted\nthen unset it and restore the original request and session objects and let the\nserver continue.\n\nThis allows the browser to know than the URL it's retrieving corresponds relly\nto the content that the browser is receiving.", "id": 3167, "time": "2001-06-21T10:10:49Z", "creator": "vicentesalvador@netscape.net", "creation_time": "2001-06-21T10:10:49Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 853, "text": "Fixed as recommended by Vincente Salvador.  Catalina now uses a redirect to\nreturn control to the original request URI, as was done in Tomcat 3.x (and as is\nrequired by Servlet 2.3 PFD2, Section 12.5.3).\n\n", "id": 3658, "time": "2001-07-11T16:42:09Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2001-07-11T16:42:09Z", "is_private": false, "attachment_id": null}]