[{"count": 0, "tags": [], "bug_id": 8571, "attachment_id": null, "id": 14880, "time": "2002-04-26T21:53:27Z", "creator": "daishi@cs.berkeley.edu", "creation_time": "2002-04-26T21:53:27Z", "is_private": false, "text": "I'm not sure from the spec what the intended behavior here is,\nbut the current implementation appears to behave a bit inconsistently.\n\nFrom a jsp at the top dir of my webapp, if I try to:\na) <c:import url=\"WEB-INF/somefile\" var=\"foo\"/>\nor\nb) <c:import url=\"/WEB-INF/somefile\" var=\"foo\"/>\n\nfoo does not get bound to anything. However,\nif i do:\nc) <c:import url=\"./WEB-INF/somefile\" var=\"foo\"/>\n\nThen things \"work\".\n\nFrom a user perspective you'd expect a) and c) to both\nbe considered relative and either work or not work together,\nwhile b) is absolute and could be different. I would prefer\nthat the contents of WEB-INF be visible in all cases, but\nI'm not sure I understand what the specs say on this.\n\nFrom examining org/apache/taglibs/standard/tag/common/core/ImportSupport.java\nit looks like targetUrl gets normalized to be absolute in acquireString by\nprefixing the servlet path, causing this.\n\nThis problem is particular to the WEB-INF directory;\nall other directories have behaved fine."}, {"count": 1, "tags": [], "bug_id": 8571, "attachment_id": null, "is_private": false, "id": 15071, "time": "2002-04-29T19:52:10Z", "creator": "bayern@essentially.net", "creation_time": "2002-04-29T19:52:10Z", "text": "Hi there.  Thanks for the report.\n\nI agree that the behavior you describe is somewhat awkward, but this one's not\nours.  In the first two cases, we're acquiring a RequestDispatcher for\n\"/WEB-INF/foo.txt\"; in the final one, we're acquiring one literally for\n\"/./WEB-INF/foo.txt\", which I believe is acceptable to the JSTL spec.  The\nproblem is that the underlying container (Tomcat in my case, and probably in\nyours too if you experience the same behavior) treats these differently.  I'm\nnot 100% sure which is the bug; I believe it depends on how you read the Servlet\nspec, though others claim they're sure that RequestDispatcher *should* be able\nto retrieve content from within /WEB-INF.  Either way, the inconsistency isn't\nours; it's the underlying container's.  Sorry.\n\nIf this is a show-stopper for you, I suggest you submit a bug report to the\nTomcat team, in terms of the behavior of ServletContext.getRequestDispatcher()\n(not in terms of <c:import>, with which they might not be familiar).  I'd submit\nthe bug report myself, but I'm swamped and don't have time to test on the\nvarious Tomcat versions at the moment.\n\nPlease let me know if you have some additional reason, contrary to what I have\nsuggested here, indicating this is indeed a JSTL bug.  Thanks again for the\nreport."}, {"count": 2, "tags": [], "bug_id": 8571, "attachment_id": null, "text": "By the way, it could also just be a configuration issue:  can your security\nmanager be made less restrictive?", "id": 15255, "time": "2002-05-01T16:59:06Z", "creator": "bayern@essentially.net", "creation_time": "2002-05-01T16:59:06Z", "is_private": false}, {"count": 3, "tags": [], "creator": "bayern@essentially.net", "attachment_id": null, "id": 15256, "creation_time": "2002-05-01T17:17:15Z", "time": "2002-05-01T17:17:15Z", "bug_id": 8571, "text": "Ignore that last comment; it was for a different bug.", "is_private": false}]