[{"count": 0, "tags": [], "bug_id": 8705, "attachment_id": null, "id": 15262, "creation_time": "2002-05-01T18:09:13Z", "time": "2002-05-01T18:09:13Z", "creator": "rmisek@tangosol.com", "text": "org.apache.catalina.SessionListener does not extend java.util.EventListener\n\nTo meet the Javabean event spec, it must. This should not break anything, since \n(a) it currently does not extend anything and (b) the EventListener interface \ndoes not contain any methods.", "is_private": false}, {"count": 1, "tags": [], "bug_id": 8705, "text": "Just as a note, doing something like this *would* break binary compatibility for\ncode compiled against the old version of the interface :-(.  Could be worked\naround by a recompile, but that is not always guaranteed to be possible.\n\nTherefore, I don't think this should be considred an option for a 4.0.x release.\n It could perhaps be considered in a 4.1.x release.\n", "id": 15266, "time": "2002-05-01T19:09:33Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2002-05-01T19:09:33Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 8705, "text": "I don't believe that it would break binary compatibility. Could you please \nprovide an explanation as to how that would occur?", "id": 15271, "time": "2002-05-01T19:44:27Z", "creator": "rmisek@tangosol.com", "creation_time": "2002-05-01T19:44:27Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 8705, "attachment_id": null, "text": "We ran into this case in one of the proposed changes to Servlet 2.3, which added\nFilterConfig.  Conceptually, it made sense to abstract out the common features\nof FilterConfig and the existing ServletConfig interfaces into a new Config\ninterface that both would inherit from.  Alas, when you do that, code compiled\nagainst the \"old\" version cannot run against implementations compiled against\nthe \"new\" version -- and vice versa.  So, we had to back away from doing this.\n\nThe reason this happens is that the compiler remembers the whole inheritance\ntree at compile time, and the JVM uses that at runtime as part of the matching\ncriteria to see if the class you are requesting is compatible with the way it is\nbeing used.  Unfortunately, introducing an additional parentage to an interface\n(even though it doesn't affect the available methods) can trigger this\nincompatibility check.\n\nAdmittedly, there is probably not a lot of code in the world that would be\naffected by this in the case of SessionListener -- but it is still a real issue.\n", "id": 15272, "time": "2002-05-01T20:06:42Z", "creator": "craig.mcclanahan@sun.com", "creation_time": "2002-05-01T20:06:42Z", "is_private": false}, {"count": 4, "attachment_id": null, "bug_id": 8705, "text": "This took rather too long but is now implemented in Tomcat 7.0.x and will be included in 7.0.6 onwards.\n\nIt can't be back-ported for the reasons outlined above.", "id": 142318, "time": "2010-12-02T15:50:28Z", "creator": "markt@apache.org", "creation_time": "2010-12-02T15:50:28Z", "tags": [], "is_private": false}]