[{"count": 0, "tags": [], "bug_id": 8709, "attachment_id": null, "is_private": false, "id": 15274, "time": "2002-05-01T20:18:24Z", "creator": "robert.priest@bentley.com", "creation_time": "2002-05-01T20:18:24Z", "text": "Using: \nTomcat 4.0.3.\nSlide 1.0.16.\nISAPI Filter from J-T-C\nWebDrive 5.1 (Client)\nIIS 5.0\nOn Windows 2K\n\nI have been having an issue where the ISAPI Filter does not pass an OPTIONS \nrequest properly when it receives one from a DAV client.\nIt looks like HttpFilterProc gets called and does its work, but somewhere\nbetween IIS doing something and the call to HttpExtensionProc, the server sends \nback a \"500 Internal Server Error\"\n\nThe request never goes as far as to get passed on to tomcat. The\ncommunication (when the problem occurs), is only between IIS and the\nisapi_redirect.dll.\n\nTo further debug, I set iis up on one box with the filter and tomcat on another.\nI then proceeded to do network trace. The result was that the request was never \nforwarded to the box running tomcat. The box running iis/isapi_redirect never \nforwarded the request on. Nothing was ever sent out on the wire. IIS (or the \nfilter) sent simply sent back a \"500 Server Error\".\n\n\nJust to test what would happen, I hacked the HttpFilterProc method to to\ncatch when an OPTIONS request is received and return a OPTIONS response.  I \nmade the HttpFilterProc method, at that point, return with \na \"SF_STATUS_REQ_FINISHED\". With that, I can connect to the server and\nget a list of folders and files through the client. I can even copy out from\nthe client to my desktop. However, I do encounter another \"500 Internal\nServer Error\" when I attempt a \"PUT\" (to add a file). \n\nThe problem is most likely in the filter with it not passing headers (the \nmethod in particular) back to IIS or from IIS to the\nHttpExtensionProc method. As I am not that proficient is IIS dev so I have\nnot  a clue what is happening. Is an IIS  header missing or something?\n\nIt should be noted that everything works as it should if one does not use the \nisapi filter (i.e. submitting requests directly to http://localhost:8080)"}, {"count": 1, "tags": [], "bug_id": 8709, "attachment_id": null, "id": 50094, "time": "2004-01-05T19:19:21Z", "creator": "serg@sierra.auriga.ru", "creation_time": "2004-01-05T19:19:21Z", "is_private": false, "text": "Hi!\n\nI have absolutely the same problem! I have nothing to add.\n\nI use\nWindows 2K \nIIS 5.0 \nTomcat 4.1.18 (with BroadVision WebDAV servlet) \n\nCould it be IIS configuration problem?\nAny idea would be much appreciated.\n\nThanks. \nSergey Tormozov (serg@sierra.auriga.ru)"}, {"count": 2, "tags": [], "text": "I have the same problem, the thing is it is very intermittent. I have the log \nlevel set to error. I checked the ISAPI log file and didn't see anything in \nthere at the time the error occurred. \nI have IIS 5.0, Tomcat 5 with ajp13. \n\nI know this doesn't add much help but hopefully help you guys realize that this \nproblem happens.", "is_private": false, "id": 50923, "creator": "sgabriel@brainfuse.com", "time": "2004-01-21T23:06:38Z", "bug_id": 8709, "creation_time": "2004-01-21T23:06:38Z", "attachment_id": null}, {"text": "This component is now deprecated. If you still experience this issue, please \nupgrade to the Coyote JK2 connector.\n\nNo further work will take place against this bug report.\n\n", "tags": [], "creator": "markt@apache.org", "attachment_id": null, "count": 3, "id": 59494, "time": "2004-06-18T18:42:51Z", "bug_id": 8709, "creation_time": "2004-06-18T18:42:51Z", "is_private": false}]