[{"count": 0, "tags": [], "text": "Hello-\n\nThis defect may be related to:\n\nhttp://nagoya.apache.org/bugzilla/show_bug.cgi?id=7932\n\nMy config:\n\nP4 1.6 MHZ\nWindows XP (version 5.1 Build 2600.xpclnt_qfe.010827-1803)\nApache 2.0.35 (apache_2.0.35-win32-x86-no_ssl.msi)\nSygate Personal Firewall Pro 5.0 (build 956) \n(http://soho.sygate.com/default.htm)\n\nI recently (last night) downloaded and installed Apache2 as a service.  \nThings went beautifully.  I modified the httpd.conf to change\nthe DocumentRoot and started creating a test index.html.\nThat worked perfectly as well.\n\nThen, I noticed that the machine was slowing considerably.\nI ran taskmgr and to my amazement I noticed that CPU \nutilization was steadily climbing (a linear progression) until\nit eventually reached 100% utilization at which point the\nsystem became almost unusable.\n\nUnlike bug #7932, I never got a BSoD however.  I managed to\nrestart XP and again started the taskmgr.  Again the gradual \nlinear progression to 100% CPU utilization (took about 45 seconds to\nhit 100%).\n\nI tried to disable the service but it seemed to ignore the request.\nThis may have been due to the CPU being pegged.I then restarted again\nand immediately uninstalled Apache2 and the machine \nreturned to normal.\n\nI couldn't help but notice the similarities with bug #7932, so \nthis may be characterized as a duplicate, except that\nI am using a firewall from a different vendor.\n\nI am a developer w/ 2 years experience developing servlet-based \napps using JServ and Apache 1.3.  FWIW, my instinct tells me that \nfor some reason Apache began spawning threads that were each \nperforming some moderately intensive job and the cumulative \neffect of these threads caused the linear rampup to complete \nCPU saturation. Without knowing the Apache2 codebase, however, \nthis is a total guess on my part.", "attachment_id": null, "bug_id": 8729, "id": 15309, "time": "2002-05-02T05:31:21Z", "creator": "cdowns@austin.rr.com", "creation_time": "2002-05-02T05:31:21Z", "is_private": false}, {"count": 1, "tags": [], "creator": "slive@apache.org", "text": "I don't know if we really care about the \"Severity\", but \"blocker\" certainly\ndoesn't apply to a bug with a known workaround (remove the firewall).", "id": 15338, "time": "2002-05-02T15:38:38Z", "bug_id": 8729, "creation_time": "2002-05-02T15:38:38Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "creator": "wrowe@apache.org", "attachment_id": null, "id": 16122, "time": "2002-05-15T03:38:39Z", "bug_id": 8729, "creation_time": "2002-05-15T03:38:39Z", "is_private": false, "text": "\n  You can see how many threads an app has open, choose View ... Select Columns\n  in Task Manager and add threads to your list.  Yes, we spin up the configured\n  number of threads, and one per listener.  If those are growing, we have a bug.\n\n  However, please try upgrading to 2.0.36 and see if you can repeat the problem.\n\n  And as we point out in bug #7932, the vendor has open access to our source code\n  to reproduce the problem in a debugging environment with full symbols and code,\n  while we don't have the same luxury.  Ergo, I'm marking this bug as INVALID as\n  debugging on our side is near impossible.\n"}, {"count": 3, "tags": [], "creator": "cdowns@austin.rr.com", "attachment_id": null, "id": 16290, "time": "2002-05-17T02:08:13Z", "bug_id": 8729, "creation_time": "2002-05-17T02:08:13Z", "is_private": false, "text": "Thanks for the reply.  I've since fallen back to Apache 1.3.24, which is \nworking flawlessly with the Sygate firewall.  However, I will give Apache2 \nanother try when it becomes expedient.  Thanks for making such awesome \nsoftware freely available.  Cheers."}]