[{"count": 0, "tags": [], "bug_id": 8745, "attachment_id": null, "is_private": false, "id": 15343, "time": "2002-05-02T16:15:35Z", "creator": "dsmith@hywy.com", "creation_time": "2002-05-02T16:15:35Z", "text": "I use Ant programmatically and I made my own BuildListener to capture the Ant \nevents, however compilation errors are not passed back as events.  Previously, \nI made my own PrintStream and set the System.err to it so that I could\ncatch the compile errors.\n\nWhen I moved to Java 1.4 and Ant 1.4.1 in order to compile 1.4 specific code, \nthis stopped working.  If I switch back the compiler, it works again, so I know \nit isn't something that Ant is doing. \n \nI noticed that in the old compiler the Main() javac costructor can take an \nOutputStream (PrintStream) as a parameter.  If the user could define a print \nstream to use, that would be good."}, {"count": 1, "tags": [], "bug_id": 8745, "attachment_id": null, "is_private": false, "id": 18434, "time": "2002-06-23T21:27:04Z", "creator": "sbailliez@apache.org", "creation_time": "2002-06-23T21:27:04Z", "text": "You can do what you want by specifying your own CompilerAdapter class.\n\ncom.sun.* API is not supported and is therefore subject to change, and as this \nis Sun specific this won't help people to have different output behavior if \nthey switch compiler... so I think this is difficult to support this for all \ncompilers...\n\nIn the same topic, you may have noticed that compiler uses a mix of stdout and \nstderr to detail a compile error and it's pretty challenging to read each \ninput and associate one to another.\n\nDo you think you could submit a patch for all compilers ?"}, {"attachment_id": null, "tags": [], "bug_id": 8745, "text": "Ant has no way to tell compiler errors from other output of the compiler.\n\nThe compilation errors do get emitted as messages to the build listener.", "count": 2, "id": 72587, "time": "2005-03-17T15:00:04Z", "creator": "bodewig@apache.org", "creation_time": "2005-03-17T15:00:04Z", "is_private": false}]