[{"count": 0, "attachment_id": null, "creator": "fine@head-cfa.harvard.edu", "is_private": false, "id": 15360, "time": "2002-05-02T21:22:27Z", "bug_id": 8755, "creation_time": "2002-05-02T21:22:27Z", "tags": [], "text": "The value I got for ScriptSock was based on the compiled in DocumentRoot,\nnot the one from the config file. I'm running 2.0.35\n\nAlso, you should document that ScriptAlias no longer has a default value\non the Upgrading document, since I didn't know to change that part of the\nconfig, CGIs were down for half a day.  (And then for another hour due to\nthe first bug above)."}, {"count": 1, "attachment_id": null, "bug_id": 8755, "is_private": false, "id": 15361, "time": "2002-05-02T21:39:29Z", "creator": "slive@apache.org", "creation_time": "2002-05-02T21:39:29Z", "tags": [], "text": "I'm confused about the problem you are reporting.  Why would you expect the\ndefault value for ScriptSock to be based on the value for DocumentRoot.\nDo you mean ServerRoot?\n\nPlease be more specific about exactly what configuration you are using, what\nyou expect to happen, and what is actually happening.\n\nRegarding ScriptAlias, the documentation implies that there is no default\nin either version.  In any case, if you want to follow-up on that,\nplease file a separate bug.  It is impossible to track two issues in\none bug."}, {"count": 2, "tags": [], "creator": "slive@apache.org", "is_private": false, "id": 15448, "creation_time": "2002-05-03T20:45:05Z", "time": "2002-05-03T20:45:05Z", "bug_id": 8755, "text": "No response to questions.  Please reopen this report if you can provide\nthe requested information.", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 8755, "attachment_id": null, "id": 16258, "time": "2002-05-16T19:09:35Z", "creator": "fine@head-cfa.harvard.edu", "creation_time": "2002-05-16T19:09:35Z", "is_private": false, "text": "Yes, I meant ServerRoot.  I compiled with the path as --prefix:\n  /proj/sg/src/apache/httpd-2.0.35-worker\nI configured with this path:\n  ServerRoot /export1/www/httpd/\n\nI failed to set ScriptSock in the config file, this is the error I got:\n[Tue Apr 30 14:11:51 2002] [error] (13)Permission denied: Couldn't bind unix dom\nain socket /proj/sg/src/apache/httpd-2.0.35-worker/logs/cgisock\n\nSo ServerRoot was ignored in selecting the default value for ScriptSock.\n\n(Apologies for the delay, I went out of town, came back, and was suddenly\nway behind on work)."}, {"count": 4, "tags": [], "creator": "slive@apache.org", "attachment_id": null, "is_private": false, "id": 16263, "time": "2002-05-16T20:48:00Z", "bug_id": 8755, "creation_time": "2002-05-16T20:48:00Z", "text": "What options did you use when you configured the apache compilation?  The\ndefault of SERVERROOT/logs applies only if you don't mess with any paths\nduring compilation.  Otherwise, ScriptSock will go in runtimedir."}, {"count": 5, "tags": [], "bug_id": 8755, "attachment_id": null, "id": 16267, "time": "2002-05-16T21:01:28Z", "creator": "fine@head-cfa.harvard.edu", "creation_time": "2002-05-16T21:01:28Z", "is_private": false, "text": "This is the exact command I used when during the build:\n\n./configure --with-mpm=worker --enable-layout=Apache\n--prefix=/proj/sg/src/apache/httpd-2.0.35-worker\n\nI hope you don't consider specifying the apache layout to be messing\nwith paths.  Changing ServerRoot should change the default for all\ncompiled values which are based on prefix, which includes runtimedir.\n"}, {"count": 6, "text": "Actually, yep.  I bet it will work properly if you drop the layout and just\nlet it use the defaults (which are the same as the apache layout anyway).\n\nPersonally, I agree that that really sucks.  Let me adjust this bug a little\nto reflect the real problem: absolute paths are getting compiled in whenever\na layout is used.", "creator": "slive@apache.org", "attachment_id": null, "id": 16268, "time": "2002-05-16T21:15:30Z", "bug_id": 8755, "creation_time": "2002-05-16T21:15:30Z", "tags": [], "is_private": false}, {"count": 7, "tags": [], "text": "I am marking this bug fixed.  The underlying problem was that the server wasn't\nevaluating the ServerRoot directive when it was encountered in the config file.\nInstead, the server would read in the entire file, and use the compiled in \nServerRoot for most of the directives.  This has been fixed by evaluating the\nServerRoot as soon as it is encountered in the configuration file.\n\nThe bottom line is that we keep a minimal number of hard-coded paths in the server,\nbut only the ServerRoot is absolute, and we are much better about respecting that\nvalue when it is replaced.\n", "is_private": false, "id": 17853, "creator": "rbb@apache.org", "time": "2002-06-15T06:37:07Z", "bug_id": 8755, "creation_time": "2002-06-15T06:37:07Z", "attachment_id": null}]