[{"count": 0, "tags": [], "text": "I would like the ability to be able to enable browser caching of pages that are\nauthenticated (for instance with BASIC authentication).  At present,\nAuthenticatorBase prevents this from occurring.\n\n\nWhy do I want this?\n\n1. I like being able to use container based \"security\" (realms and\nsecurity-constraints) as it makes development simpler.\n\n2. The content of my site does not need to be truly secure, just passworded.\nThis is a conscious decision I have made.\n\n\nWhy I can't do this (without hacking the source)?\n\norg.apache.catalina.authenticator.AuthenticatorBase prevents this by adding\nheaders (Pragma: No-cache, Cache-Control: no-cache, Expires: 1 (1970ish)) to the\nHttpResponse, disabling my ability to set expiry times and return 304 statuses\n(and stops the browser from caching effectively).  This adds significantly to\nthe overhead for my site (which is an electronic photoalbum where the photos are\nserved via servlets) - most users are on modems and the imposition of 15 x 5k\nthumbnails is excessive and unnecessary on every page view.\n\nI've removed these lines from my TomCat, but this does not represent a viable\nlong-term solution.  I didn't  even realise that caching was disabled until I\nwent searching through to determine why expiry wasn't working.  I'm sure there\nare others out there in this situation.\n\n\nEnhancement?\n\nI'm not sure.  I think this behaviour should be optional (and probably on the\nSecurityConstraint), but I couldn't see anywhere appropriate within\nsecurity-constraint dtd to put this kind of option. I believe it should also be\nconfigurable at a per servlet level, although the added security that this gives\nis minimal.\n\nIn the meantime, I'll just have to \"fix\" AuthenticatorBase.", "is_private": false, "bug_id": 8773, "id": 15404, "time": "2002-05-03T12:10:30Z", "creator": "tomcat@walding.com", "creation_time": "2002-05-03T12:10:30Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 8773, "attachment_id": null, "text": "\n\n*** This bug has been marked as a duplicate of 6709 ***", "id": 15616, "time": "2002-05-07T10:01:36Z", "creator": "vicentesalvador@netscape.net", "creation_time": "2002-05-07T10:01:36Z", "is_private": false}]