[{"count": 0, "tags": [], "creator": "time@vccomputers.ie", "is_private": false, "id": 15486, "attachment_id": null, "bug_id": 8811, "creation_time": "2002-05-05T01:45:19Z", "time": "2002-05-05T01:45:19Z", "text": "In the Licensing and Copyright section of the Ant Task Design Guidelines, the\nauthor outlines several of the reasons that the APL and the GPL are\nincompatible, but at line 232 he includes an erroneous statement.\n\n> Their license requires all changes to the source to be made public\n\nThis is not true, of course. I'm sure the original author just misunderstood, or\nwas a victim of disinformation, however it's best to clear these things up :-)\nFor the real story you could investigate\n\nhttp://www.gnu.org/licenses/gpl-faq.html#GPLRequireSourcePostedPublic"}, {"count": 1, "tags": [], "creator": "steve_l@iseran.com", "is_private": false, "id": 15487, "attachment_id": null, "bug_id": 8811, "creation_time": "2002-05-05T03:47:15Z", "time": "2002-05-05T03:47:15Z", "text": "ok. I do think I understand GPL and LGPL, and have even released code under \nit; I have even sat through talks where RMS explained why we should call linux \nGNU/Linux, but not GNU/MIT/XFree86/Linux for reasons he never covered. But \nclearly you think I got that phrase wrong. Feel free to add the \nword \"effectively\" in there and submit the patch.\n\nThe doc tries to send the message that we dont care what license you release \nyour task under, but we can only link to non-(L)GPL stuff in the apache \nmanaged codebase. The moment we link to one library or class that propagates \nto the rest of the ant product, which would fundamentally change the ant \nlicense, and have negative impact on the product Sun wouldnt include it in the \nJWS dev pack; IntelliJ wouldnt include it in IDEA, etc, etc. Now, from a free \nsoftware perspective stopping proprietary systems from leveraging voluteers \nhard work is the exact purpose of the GPL, and popularity without freedom is \nnothing, but apache is playing a slightly different game: freedom from IIS, \nand with, ant freedom from IDEs. Note also the recent issues regarding \nparticipation in the JAva Community Program as a sign of Apache's commitments, \nnot just to Apache hosted projects, but to the needs of open and free software \ndevelopers such as the JBoss team.\n\n\nAnyhows, like I said, if you want to submit a patch we can put it in the next \nbeta release of ant1.5."}, {"count": 2, "tags": [], "creator": "steve_l@iseran.com", "attachment_id": null, "is_private": false, "id": 15601, "time": "2002-05-07T00:54:29Z", "bug_id": 8811, "creation_time": "2002-05-07T00:54:29Z", "text": "pulled all specifics of the LGPL out, left that we cant link directly or via \nreflection to this stuff in the ant codebase, but we are happy to point to \nexternal stuff that does"}]