[{"count": 0, "tags": [], "creator": "bslesins@best.com", "attachment_id": null, "id": 15695, "time": "2002-05-08T02:14:24Z", "bug_id": 8895, "creation_time": "2002-05-08T02:14:24Z", "is_private": false, "text": "It would be useful if either ant or antcall (or both) supported a fork parameter\nand a classpath element.  This would allow ant to restart itself with a\ndifferent classpath.\n\nIn particular, I'd like to restart ant with a different classpath to run junit\ntests.  Setting fork=true in the junit task causes a new VM to be created for\neach test, when I'd rather restart the VM once and run all of the unit tests in\nthe same VM.\n\nA workaround is to use a TestSuite, but then the test suite can't be interrupted\nin the middle, and you don't get the same summary lines.  Also, perhaps the java\ntask could be used to restart ant, but that's less than obvious."}, {"count": 1, "tags": [], "bug_id": 8895, "attachment_id": null, "text": "Fantastic idea. \n \nUnfortunately we have just recently added the ability which allowed references to be inherited by sub-ants. So we \nwould need to make sure inheritRefs=false before allowing ant to be forked. \n \nFeel free to send a patch to enable this funcitonality. ", "id": 15707, "time": "2002-05-08T09:47:42Z", "creator": "donaldp@apache.org", "creation_time": "2002-05-08T09:47:42Z", "is_private": false}, {"count": 2, "tags": [], "creator": "tquas@yahoo.com", "text": "I'd like to see this, too. I have a bunch of homegrown tasks that access a\ndatabase which error out if not forked. Hmm, couldn't figure out why.\n\nAn <antcall> supporting fork would be great!", "id": 37398, "time": "2003-05-18T10:42:08Z", "bug_id": 8895, "creation_time": "2003-05-18T10:42:08Z", "is_private": false, "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 8895, "is_private": false, "id": 75477, "time": "2005-05-27T02:29:44Z", "creator": "jglick@apache.org", "creation_time": "2005-05-27T02:29:44Z", "tags": [], "text": "In most (all?) cases where I thought I needed this for scripts I work on, I\nfound some other way around it. But it could make some things easier.\n\nForking a new VM might not be necessary for some uses. E.g. sometimes you want\nto invoke a child Ant script *without* user-set (-D...) properties.\ninherit*=\"false\" does not help here; you just cannot get rid of them.\n\nShould the child script inherit the parent's listeners and loggers?\n\nProbably should be deferred until a more concrete set of use cases is collected,\nwith reasons why you cannot solve the problem in a straightforward way without\nthe enhancement."}, {"count": 4, "tags": [], "creator": "trejkaz@trypticon.org", "attachment_id": null, "id": 117952, "time": "2008-06-24T16:27:51Z", "bug_id": 8895, "creation_time": "2008-06-24T16:27:51Z", "is_private": false, "text": "One use case: setting a different memory for a sub-build without requiring setting of ANT_OPTS from the outside.\n"}]