[{"count": 0, "attachment_id": null, "creator": "cebert@pocketthis.com", "is_private": false, "id": 15734, "time": "2002-05-08T19:56:32Z", "bug_id": 8917, "creation_time": "2002-05-08T19:56:32Z", "tags": [], "text": "The parameters documentation is mildly broken: e.g. 'rootThe' instead \nof 'root'. The parameter list for 'createNodeIterator' looks like this:\n\nParameters:\nrootThe - node which will be iterated together with its children. The iterator \nis initially positioned just before this node. The whatToShow flags and the \nfilter, if any, are not considered when setting this position. The root must \nnot be null.\nwhatToShowThis - flag specifies which node types may appear in the logical view \nof the tree presented by the iterator. See the description of NodeFilter for \nthe set of possible SHOW_ values.These flags can be combined using OR.\nfilterThe - NodeFilter to be used with this TreeWalker, or null to indicate no \nfilter.\nentityReferenceExpansionThe - value of this flag determines whether entity \nreference nodes are expanded.\n\nI looked around in the rest of the documentation and it looked like a general \nproblem. Perhaps a global search and replace strayed?\n\nChris"}, {"count": 1, "tags": [], "bug_id": 8917, "text": "This was a formatting error in the orginal DOM Level 2 REC version of the Java \nbindings. Fixed in the DOM errata (for W3C policy reasons, they can't update \nthe version in the REC itself without releasing a new version of the REC). The \nfixed version has been checked into xml-commons. It _should_ have been checked \ninto Xerces as well. If it hasn't been, that's a trivial and desirable fix.", "id": 15736, "time": "2002-05-08T20:35:31Z", "creator": "keshlam@us.ibm.com", "creation_time": "2002-05-08T20:35:31Z", "is_private": false, "attachment_id": null}, {"count": 2, "attachment_id": null, "creator": "elena@apache.org", "is_private": false, "id": 15737, "time": "2002-05-08T20:54:46Z", "bug_id": 8917, "creation_time": "2002-05-08T20:54:46Z", "tags": [], "text": "The W3C DOM interfaces in Xerces2 have been updated per DOM L2 Errata.\nWe have not yet modified the documentation in the implemetation classes."}]