[{"count": 0, "tags": [], "creator": "exmarouane2@hotmail.com", "attachment_id": null, "is_private": false, "id": 15863, "time": "2002-05-10T02:39:33Z", "bug_id": 8961, "creation_time": "2002-05-10T02:39:33Z", "text": "I was trying to use jmeter to test our new Arabic web search engine, but things \nwere not working well until I found out that the arabic \"arguments\" that are in \nutf8 were not encoded correctly. the URLEncoder/URLDecoder (in jdk's older than \n1.4) use the default system encoding. jdk1.4 supports new versions of this \nmethods that take two parameters: String to be encoded and the encoding to use \nfor encoding.\nI just didn't have time to figure out which source file to edit to make the \nneeded changes."}, {"count": 1, "tags": [], "bug_id": 8961, "attachment_id": null, "id": 16954, "creation_time": "2002-05-30T18:03:08Z", "time": "2002-05-30T18:03:08Z", "creator": "mstover1@apache.org", "text": "I don't know what to do with this one.  I would think JMeter should use the \nlocal encoding.  You are putting in utf-8 codes to simulate Arabic characters \nbecause you are on a non-arabic machine?  If JMeter used utf-8 rather than the \nlocal encoding, wouldn't that also create problems for some people?  The only \nother option is to give people a choice of encodings in the GUI...\n\nI'm just not sure how to resolve your problem that will also work for everyone \nelse.", "is_private": false}, {"count": 2, "tags": [], "bug_id": 8961, "attachment_id": null, "id": 22580, "creation_time": "2002-09-10T09:07:26Z", "time": "2002-09-10T09:07:26Z", "creator": "ronnc@acm.org", "text": "This comments may or may not be applicable since this bug is already several \nmonths old.\n\nI've run in to this problem with my application in the past. The way i got \naround the problem is to set file.encoding system property to ISO8859_1 \n(because jdk makes that assumption).", "is_private": false}, {"count": 3, "tags": [], "bug_id": 8961, "attachment_id": null, "text": "Can someone be more specific on what this bug is about?\n\nProvide a way to reproduce it, explain what the expected results are, and where\nactual results deviate from them?\n\nI'll currently reduce severity from Blocker to Normal (can't be a blocker if\nit's been open for so long!), and I'll close as INVALID if we don't get more\ninfo in a week or so. (Of course it can always be reopened).\n", "id": 29146, "time": "2003-01-10T18:55:27Z", "creator": "jsalvata@atg.com", "creation_time": "2003-01-10T18:55:27Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 8961, "attachment_id": null, "text": "If you have a web app which expects the client requests to be in a specific\ncharacter encoding (e.g. it is an arabic web site and the servlet expects the\nrequests to be utf-8) you need a way to tell JMeter which encoding to use to\nsimulate clients using that encoding.\n\nThe solution would be to provide a way to set the character encoding to be used\nby an http request (text field or combo box for example). But this would also\nrequire a full switch to J2SE 1.4, because there is no way to set the character\nset for url encoding in earlier java releases.", "id": 29382, "time": "2003-01-15T00:58:04Z", "creator": "oros@apache.org", "creation_time": "2003-01-15T00:58:04Z", "is_private": false}, {"count": 5, "tags": [], "bug_id": 8961, "attachment_id": null, "id": 37653, "creation_time": "2003-05-23T03:57:57Z", "time": "2003-05-23T03:57:57Z", "creator": "matt@rairyu.tk", "text": "I'm using JMeter against a utf-8 website with alot of Japanese content. Using\nthe latest tar ball (20/05/2003) this doesn't work. The posted values aren't\nencoded correctly. Thus I've temporarily altered the following file(in my\nsource) until I can find or do a more complete solution:\n\"org.apache.jmeter.protocol.http.util.EncoderCache.java\"\nI changed: \nencodedValue = URLEncoder.encode(k);\n\nTo:\ntry{\n  encodedValue = URLEncoder.encode(k, \"utf8\");\n   }\ncatch (UnsupportedEncodingException e)\n   {\n     System.out.println(\"Don't support utf8 encoding??\");\n     e.printStackTrace();\n   }\n\nYes - I know my exception handling here is bad :-p", "is_private": false}]