[{"attachment_id": null, "tags": [], "bug_id": 8969, "text": "In dependence on the Bugs ID6749 and ID6594 I've got the problem, that the \nmanager command <remove> does not remove the application directory in the \nwebapps-dir (inclusive all files in the directory).\nI had just a short look at the Catalina-Sources and it seems, that <remove> \nonly removes the application from the tomcat management (removes application-\nkey from a mangement HashMap). \nThere is as well a method which could removes the hole directory but it seems \nthis method isn't called (but there I'm not sure).", "count": 0, "id": 15883, "time": "2002-05-10T08:53:23Z", "creator": "steinbis@orisa.de", "creation_time": "2002-05-10T08:53:23Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 8969, "text": "I've been having the same problem.  I copy a .war file into webapps directory \nand deploy it using the manager \"install\" command, after which point tomcat \nunpacks the .war file into a directory in webapps. If I modify and update \nthe .war file, neither the manager \"reload\" nor the manager \"remove\"/\"install\" \ncauses the updated .war file to be unpacked. Doing a \"remove\" should remove the \nunpacked directory (shouldn't it?), but it doesn't. Doing a \"remove\", then \nremoving the directory manually, followed by \"install\" of the updated .war \nfile, does the trick, but it's pretty inconvenient to have to remove the \nunpacked directory manually when \"remove\" should do it automatically.", "id": 17069, "time": "2002-06-03T13:10:52Z", "creator": "John.A.Costigan@saic.com", "creation_time": "2002-06-03T13:10:52Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "text": "The manager has been patched so that it will remove the web application\ndirectory and/or war file if it exists in the Host appBase and either\nthe Host autoDeploy=true or liveDeploy=true.\n\nThanks for reporting this.\n\nThe bug fix will be in the next Tomcat 4.1 release.", "is_private": false, "bug_id": 8969, "id": 29327, "time": "2003-01-14T03:00:27Z", "creator": "glenn@apache.org", "creation_time": "2003-01-14T03:00:27Z", "attachment_id": null}, {"count": 3, "tags": [], "text": "*** Bug 7207 has been marked as a duplicate of this bug. ***", "is_private": false, "bug_id": 8969, "id": 50854, "time": "2004-01-20T23:08:47Z", "creator": "markt@apache.org", "creation_time": "2004-01-20T23:08:47Z", "attachment_id": null}]