[{"count": 0, "tags": [], "creator": "tkormann@apache.org", "text": "Using xerces instead of crimson, the security manager seems to block the access \nto our own resources like the SVG dtd.\n\nTo reproduce the problem:\n\n1. download xerces2_0_1\n2. copy xercesImpl into the lib/ directory\n3. change the line into resources/org/apache/batik/util/XMLResourceDescriptor\n   to org.xml.sax.driver = org.apache.xerces.parsers.SAXParser\n4. launch batik with the security options 'on'\n\nThe error will be in SAXSVGDocumentFactory and the reason is because:\ngetClass().getResource(\"resources/svg10.dtd\") returns 'null'.\n\nWith crimson + security, it works. xerces with security, it works.\n\nBTW: Additional RFE, see if with security options 'on', it's possible to \ndownload a DTD somewhere on the web (if that makes sense to do that).", "id": 15901, "attachment_id": null, "bug_id": 8978, "creation_time": "2002-05-10T16:03:01Z", "time": "2002-05-10T16:03:01Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 8978, "is_private": false, "text": "typo: xerces with security, it does not work\n\n", "id": 16149, "time": "2002-05-15T12:56:50Z", "creator": "tkormann@apache.org", "creation_time": "2002-05-15T12:56:50Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 8978, "is_private": false, "id": 16152, "attachment_id": null, "creator": "vincent.hardy@sun.com", "creation_time": "2002-05-15T13:35:52Z", "time": "2002-05-15T13:35:52Z", "text": "This is not a bug. Security is implemented in the sample \nBatik applications. Security is working with a given packaging, \nthe one with are shipping with: development mode and jar mode, \nas well as with the 3rd jars we are shipping with (crimson for the parser).\n\nWe cannot make the policy files generic as they have to reference\nthe jars to which permissions are granted explicitly. Therefore,\nif people want to use a different packaging (such as a different \nparser), they'll have to create their own policy file. When you use xerces, \nyou are using a different packaging so you have to use a different policy file.\n\nSo, to use xerces, you can do one or the other:\n\na. Modify the \nresources/org/apache/batik/apps/svgbrowser/resources/svgbrowser.policy\nor svgbrowser.bin.policy file to grant permissions to the xerces jar\ninstead of the crimson jar.\n\nb. Create your own policy file and use the -Djava.security.policy\nsystem property to point to it when running the application. This\nwill take precedence over the policy file expected by the application\nin the packaging we are delivering.\n\nBoth methods are easy if you look at the existing policy files."}, {"count": 3, "tags": [], "bug_id": 8978, "is_private": false, "text": ">> BTW: Additional RFE, see if with security options 'on', it's possible to \n>> download a DTD somewhere on the web (if that makes sense to do that).\n\nThis will fail if the document is loaded from a getURL (because the security \nrestrictions of the requester (the script) will apply and by default, it is \nnot allowed to get something from anywhere but the server the document \nreferencing it came from). \n\nFor a straight document load, it will not fail. I think it makes sense to get \nthe DTD from anywhere, but the security\nrestrictions apply (and it is sometime a pain, but better be safe than \nsorry :-). I am working on more fine grained security options and I am thinking\nof doing the xlink:href control at the same time. Feel free to create a \nseparate RFE if you'd like.\n\n", "id": 16153, "time": "2002-05-15T13:40:47Z", "creator": "vincent.hardy@sun.com", "creation_time": "2002-05-15T13:40:47Z", "attachment_id": null}]