[{"count": 0, "attachment_id": null, "bug_id": 9101, "is_private": false, "id": 16135, "time": "2002-05-15T06:23:27Z", "creator": "Jonas.Olsson@cambiosys.com", "creation_time": "2002-05-15T06:23:27Z", "tags": [], "text": "Attached are new base-classes I coded to extend the existing (e.g. \nAbstractGenerativeController, LogicController).\nThe code is uncommented (so much to do, so little time), but the common trait \nis that the constructor takes the arguments required for proper jMeter \nintegration (providing a more automatic check for \"validity\").\nAlso note that ConfigElementBase and ConfigElementBaseGui provides a dynamic \nGUI for parameter setting (for those of us who don't need a flashy layout, just \nthe fields to enter values)."}, {"count": 1, "tags": [], "bug_id": 9101, "text": "Created attachment 1862\nJAR", "id": 16136, "time": "2002-05-15T06:24:05Z", "creator": "Jonas.Olsson@cambiosys.com", "creation_time": "2002-05-15T06:24:05Z", "is_private": false, "attachment_id": 1862}, {"count": 2, "tags": [], "bug_id": 9101, "text": "It appears you made base classes for yourself to make extending JMeter easier.  \nI have two comments:\n\n1. In the new src_1 sources, extending JMeter should be quite a bit easier to \ndo.  Please take a look (it's nearly fully functional - remote testing is the \nonly thing I haven't tested much yet).\n\n2. I'd prefer it if you helped me make improvements to the existing base \nclasses rather than adding another layer.  They are there to make it as easy as \npossible, so if you have ideas on how to make it easier, I'd like to put those \nchanges directly into the existing classes.  ", "id": 16436, "time": "2002-05-20T19:32:30Z", "creator": "mstover1@apache.org", "creation_time": "2002-05-20T19:32:30Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "Jonas.Olsson@cambiosys.com", "attachment_id": null, "is_private": false, "id": 16527, "time": "2002-05-22T06:47:31Z", "bug_id": 9101, "creation_time": "2002-05-22T06:47:31Z", "text": "1. I downloaded the latest version and worked from that, I'm not able to keep \nup-to-date with development.\n2. My intention was to produce a thin \"add-on\" for internal use (i.e. install \njMeter, add this JAR and go for it). On a \"hunch\" I also submitted it here for \nevaluation. Of course these additions (if found valuable) should become part of \nthe JMeter classes, but they're not as I deliberately did not change the \noriginal installation.\n\nOn the whole I have not enough time (on or off work) to play an active role in \njMeter, I just wanted to submit what I'd done for you to evaluate. The jMeter \nuser list suggested an RFE ...\nMy base-classes addresses some points I found lacking:\n\n- No uniform naming of base-classes (Logic vs Generative)\n- No easy way of making a simple ConfigElement without doing your own GUI\n- Explicit setting required for compulsory items (e.g. class label)\n  (I put them in constructors instead)"}, {"count": 4, "tags": [], "bug_id": 9101, "text": "Taking one of Jonas' suggestions, I'm converting this request to be a request\nfor a config GUI class that shows a simplistic UI for dealing with the data of a\ntest element.  Anyone creating a new test element could use it to test their\ncode in JMeter's GUI framework. \n\nThe rest of Jonas' suggestions are essentially done in current code.", "id": 18740, "time": "2002-06-28T18:00:18Z", "creator": "mstover1@apache.org", "creation_time": "2002-06-28T18:00:18Z", "is_private": false, "attachment_id": null}, {"count": 5, "tags": [], "creator": "mstover1@apache.org", "attachment_id": null, "text": "Default config contributed by ElanChezhiyan", "id": 34245, "time": "2003-04-01T14:48:55Z", "bug_id": 9101, "creation_time": "2003-04-01T14:48:55Z", "is_private": false}]