[{"count": 0, "tags": [], "bug_id": 9120, "attachment_id": null, "is_private": false, "id": 16181, "time": "2002-05-15T17:35:40Z", "creator": "ps@psncc.at", "creation_time": "2002-05-15T17:35:40Z", "text": "I have several JSP pages specified in the XML view. Viewing them with the\nvery same GET arguments they sometimes \"hangs\" for a short period of time. I\n\"instrumented\" the page to find out where it hangs (thinking it hangs in my\nown code somewhere), but I found that it \"hangs\" in different places within \nthe page. \n\nWhen no such \"hang\" occurs, the thing takes 10ms max to complete. With the\nhang I get a consistent hang time ddepending on the page only. On some pages\nit is around 3 seconds, on another it is 5 seconds. The hangs occur _anwhere_\nwithin the page.\n\nI already tried two different VMs: Blackdown 1.3.1_02a and Sun 1.3.1_03, both\nshow the same problem.\n\nThe pages are part of a very complex application, making heavy use of custom \ntag libraries, JDBC, JNDI (LDAP), Filters and about 200 custom classes.\n\nI tried to use a java profiling tool to attach to tomcat, but for some reason \nthat doesn't work.\n\nI cannot deploy this application with the bug present, that is why I marked it\n\"major\".\n\nI should note that I have tried it on two completly different systems: A RH 6.2\nbased system and a RH7.3 based system (one running a 2.2 Kernel, the other\nrunning a recent 2.4 kernel). They have different glibc library versions but\nuse the same java stuff. Both systems behave in the very same strange way. \nThis makes me believe that it must be a tomcat problem.\n\nI could not come up with a simple test case. However, if I strip parts of the \nJSP page (reducing complexity) hanging occurs less often and does not take that\nmuch time. I honestly do not know what can cause this, however after taking\nthe time measurements, I do not think it is my code...\n\nThe problem exists with both the WARP (through apache) and the HTTP connector,\nBTW."}, {"count": 1, "tags": [], "text": "As being demonstrated by bug 8290, there are performance issues with Jasper 1\nwhen running with tag libraries, caused by a bug in the JVM. This looks like\nit's the thing causing your problem here.\nJasper 2 fixes it, and is currently under testing.\n\nYou can get the latest version of it in Tomcat 4.1.x milestones if you'd like to\ntest it, like 4.1.2\n(http://jakarta.apache.org/builds/jakarta-tomcat-4.0/test/v4.1.2/).\n\n*** This bug has been marked as a duplicate of 8290 ***", "is_private": false, "id": 16184, "creator": "remm@apache.org", "time": "2002-05-15T17:46:35Z", "bug_id": 9120, "creation_time": "2002-05-15T17:46:35Z", "attachment_id": null}, {"count": 2, "tags": [], "text": "OK, I believe this to be the same issue as in bug 8290. I did not test 4.1.x\nfor the fix, but rather did something I wanted to do for a long time: I \nwrote a standalone JSP compiler capable of using taglibs to precompile\nall the JSPs. As I took care to not overuse \"try .. catch .. finally\" blocks,\nthe issue went away.\n\nThanks for pointing me into the right direction!\n", "is_private": false, "id": 16326, "creator": "ps@psncc.at", "time": "2002-05-17T13:55:49Z", "bug_id": 9120, "creation_time": "2002-05-17T13:55:49Z", "attachment_id": null}]