[{"attachment_id": null, "tags": [], "bug_id": 920, "text": "I am porting a heavy traffic servlet application from Weblogic to Tomcat 3.2.1 \non Solaris 2.7.  After 2 hours of great execution, Tomcat grinds to a halt.  I \nnotice that I am getting a few exceptions: \"SocketException reading request, \nignored\".  At the time of java process has a CPU time of 30:18, Memory of 55M, \n62 threads.  In my server.xml I am specifying 50 Max_threads, 35 \nMax_spare_threads, and 20 min_spare_threads.  I am also connecting to an Oracle \nDatabase with connection pool of 35 connections.\n\nI will be more than happy to test any builds that address this bug.\n\nI tried running the Tomcat 3.3 milestone build, but ran into the same problem.", "count": 0, "id": 1141, "time": "2001-03-09T18:30:18Z", "creator": "fwang@cheerful.com", "creation_time": "2001-03-09T18:30:18Z", "is_private": false}, {"count": 1, "tags": [], "text": "Can you give more info - \"halt\" means the java process dies ( stops ) or \nis it hanged ? Are you using standalone or which connect ? Can you attach a\ndebugger ? \nPlease help, it's very important to fix it", "attachment_id": null, "id": 1155, "creator": "cmanolache@yahoo.com", "time": "2001-03-10T00:11:12Z", "bug_id": 920, "creation_time": "2001-03-10T00:11:12Z", "is_private": false}, {"count": 2, "tags": [], "creator": "fwang@cheerful.com", "text": "I am running Tomcat in standalone mode. Not in conjuction with Apache.  It's \npurpose is a servlet container which runs one servlet, queries an Oracle \ndatabase and serves back a web page.  Currently we are running 3 load balanced \nWeblogic servers.  I added the Tomcat server in the pool and it ran fine.  We \nstress tested it by directing all the traffic to the Tomcat server and removed \nthe Weblogic servers from the pool and it was doing great.  Very fast response \ntimes and CPU usage never got above 40%.  Memory usage was fairly stable as it \nslowly crept up from 40M to 55M.  We were very impressed.  I monitored the \nprogress by tailing my log file that is generated by the servlet.  After about \n2 hours of receiving all the traffic, it started sputtering, meaning that it \nseemed to have a hard time serving up the files.  It would hang for a second, \nthen seem to recover, and then hang again.  At this point we added the weblogic \nservers back into the pool and it seemed to recover itself momentarily.  We \nthen removed the weblogic servers again from the pool at which point it \npermanently hung.  The java process did not die, it was hung.  The java process \nat time of hanging had a CPU time of 30:18, memory of 55M, and 62 threads.  \nPlease let me know what additional information I can provide.", "id": 1159, "time": "2001-03-10T08:06:37Z", "bug_id": 920, "creation_time": "2001-03-10T08:06:37Z", "is_private": false, "attachment_id": null}, {"attachment_id": null, "tags": [], "bug_id": 920, "is_private": false, "count": 3, "id": 1409, "time": "2001-03-19T22:11:59Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-03-19T22:11:59Z", "text": "Damn, that's hard to debug... Can you help reproduce it somehow ? Can you \nrun a simulated load ( with \"ab -n 1000... -c 100 \" ) and find a page \nwhere the server will hung ? If not, can you at least attach a debugger or \nget a stacktrace and/or memory trace ? Please understand we're in an impossible\nsituation here, I believe you and this is very serious - but there's nothing \nI can do. I run load tests all the time and I never hunged ( I do get JVM\ncrashes, but that's with buggy VMs)."}, {"count": 4, "text": "This may be the same problem that is described in bug 1006.", "bug_id": 920, "is_private": false, "id": 1456, "time": "2001-03-20T12:28:39Z", "creator": "marc.saegesser@apropos.com", "creation_time": "2001-03-20T12:28:39Z", "tags": [], "attachment_id": null}, {"count": 5, "tags": [], "text": "I'm marking this one as resolved=LATER.  Hopefully the fix that went in for \n1006 will fix this problem.  If not we'll investigate further for a later \nrelease.", "attachment_id": null, "id": 1522, "creator": "marc.saegesser@apropos.com", "time": "2001-03-21T12:22:30Z", "bug_id": 920, "creation_time": "2001-03-21T12:22:30Z", "is_private": false}, {"count": 6, "tags": [], "bug_id": 920, "text": "Can't reproduce the bug in 3.3 ( I let an \"ab\" in background for few hours ),\nplease verify and if you can still can reproduce it send a test case\nor try with a different VM. I'll close the bug  if you can't \nreproduce it.", "id": 1820, "time": "2001-04-10T00:13:36Z", "creator": "cmanolache@yahoo.com", "creation_time": "2001-04-10T00:13:36Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "text": "Close - can't reproduce. Please add more data to debug. Tomcat works fine\nin similar load cases on different platforms - it may be a bug in the vm or \na os config problem. ", "attachment_id": null, "id": 2033, "creator": "cmanolache@yahoo.com", "time": "2001-04-22T18:18:40Z", "bug_id": 920, "creation_time": "2001-04-22T18:18:40Z", "is_private": false}]