[{"count": 0, "tags": [], "bug_id": 9231, "text": "P4Counter task violates the rules we have imposed on ANT and\nallows the modification of the value of properties even if they are\nalready set.\n\nThe following patch makes sure properties are set only once.\n\nI cannot check the fix since I do not have perforce, but it should\nbe quite uncontrovertial (in principle).\n\nJose Alberto", "id": 16383, "time": "2002-05-19T12:14:44Z", "creator": "j_a_fernandez@yahoo.com", "creation_time": "2002-05-19T12:14:44Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 9231, "attachment_id": 1893, "id": 16384, "time": "2002-05-19T12:15:34Z", "creator": "j_a_fernandez@yahoo.com", "creation_time": "2002-05-19T12:15:34Z", "is_private": false, "text": "Created attachment 1893\nPatch to disallow p4counter to mutate properties"}, {"count": 2, "tags": [], "text": "Not happy with this one. The whole point of P4Counter is to obtain a value from \nperforce and set or reset a property. If the counter has been changed \nexternally to Ant then that allows scope for the wrong value to be used in the \nbuild.\n\nGuess this is going to re-open the whole mutable-props arg again :-)\n\nLes", "attachment_id": null, "id": 16398, "creator": "leslie.hughes@rubus.com", "time": "2002-05-20T10:16:07Z", "bug_id": 9231, "creation_time": "2002-05-20T10:16:07Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 9231, "text": "Jose Alberto - I intentionally skipped modifying this task for the very reason \nLes mentions here.  I'm marking as WONTFIX.  I agree that consistency is \nneeded, but at least in the 1.x versions backwards compatibility is more \nimportant.", "id": 16401, "attachment_id": null, "creator": "jakarta@ehatchersolutions.com", "creation_time": "2002-05-20T12:01:24Z", "time": "2002-05-20T12:01:24Z", "is_private": false}, {"count": 4, "tags": [], "bug_id": 9231, "text": "Sorry for the delay on this response but I was out of net connection.\nI see no merit on Les argument about an external program changing the counter \nin the middle of the build. If that where the case, no matter how often one \nruns this task there is always the posibility the value will be wrong.\n\nThe only limitation here is that if you run the task 10 times you would have to \nuse either 10 different properties OR doit from within an <antcall> which \nresets the value when one goes out of the scope. \n\nWith respect to Erik comment about backward compatibility, I just have to say \nthat I hope committers were more strict one the assesment of contributed tasks \nand whether they follow the rules that were decided. Several times we have been \nat the same point where the answer is: \"Ups, we did not notice before the \nrelease, too late now, we are screwed for life\". And then Stefan has to come up \nwith a complete new machinery for parameter properties just because of one \nmisbehaved task. We dig ourselves deeper and deeper.\n\nFor the ANT2 team, I hope that you guys will review these and other tasks and \nmake them stick to the rules (whatever they are from ANT2) no backward \ncompatibility argument there. In the mean time can someone please at least \ndeprecate Project.setProperty().", "id": 16530, "attachment_id": null, "creator": "j_a_fernandez@yahoo.com", "creation_time": "2002-05-22T07:43:34Z", "time": "2002-05-22T07:43:34Z", "is_private": false}]