[{"count": 0, "tags": [], "bug_id": 9330, "attachment_id": null, "text": "It would be nice to be able to tell JMeter to use *different* cookies for each\nthread even if they're pinging from the same URL. So each thread can have a\ndifferent session on a cookie-session based server.\n\nI made a little patch that does this. Its not terribly elegant and it doesn't\nhave any GUI code. But take a look:\n\nhttp://www.cybercom.net/~slater/jmeter/\n\nEnjoy. Feel free to email me with any questions.\n\n-aj\n\nIs this really an Enhancement?", "id": 16573, "time": "2002-05-22T21:14:46Z", "creator": "ajslater@attbi.com", "creation_time": "2002-05-22T21:14:46Z", "is_private": false}, {"count": 1, "tags": [], "bug_id": 9330, "attachment_id": null, "text": "JMeter clones the Cookie Manager so that each thread gets it's own cookies.  \nAlways has.", "id": 16947, "time": "2002-05-30T17:47:13Z", "creator": "mstover1@apache.org", "creation_time": "2002-05-30T17:47:13Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 9330, "attachment_id": null, "text": "I am testing a registration process that uses cookies to maintain session\n(WebLogic).  If I run a single thread, JMeter behaves as expected, and I get\nnormal results.  If I turn up the number of threads, I start to see a\npredictable error that seems to be related to cookie management.\n\nThe registration process has 2 steps.  The first step records a unique string\nsubmitted by the user in the session.  The second step gathers all the user's\ntypical data (name, email, etc.)  The error I am having is that the data\nsubmitted is failing as it does not match the unique string from step 1 (in\nother words, the step 1 unique string is getting paired with another thread's\nstep 2 data.)  If I run 8 test machines simultaneously, I do not see the error,\nif I run 8 threads simultaneously, I do.\n\nI suspect that JMeter is not properly cloning the Cookie Manager and therefore,\nall the threads are sharing one.   I have not yet tried the patch offered by\najslater@attbi.com", "id": 17023, "time": "2002-06-01T00:15:56Z", "creator": "swaziloo@monkeymind.com", "creation_time": "2002-06-01T00:15:56Z", "is_private": false}, {"count": 3, "tags": [], "creator": "jsalvata@atg.com", "text": "Marking all bugs RESOLVED before JMeter 1.8's release date as VERIFIED.\nYes, it's pretty poor QA procedure, but there's bugs here lingering since JMeter\n1.6, and we need to clean up a little.", "id": 28356, "time": "2002-12-27T16:16:03Z", "bug_id": 9330, "creation_time": "2002-12-27T16:16:03Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Bulk-closing all bugs RESOLVED before JMeter 1.8 release date.", "is_private": false, "id": 28578, "creator": "jsalvata@atg.com", "time": "2002-12-29T14:21:12Z", "bug_id": 9330, "creation_time": "2002-12-29T14:21:12Z", "attachment_id": null}]