[{"count": 0, "tags": [], "bug_id": 9375, "text": "I have created an own tag that is derived from the standard struts <html:form> \ntag. If i use this tag on a JSP page, the generated servlet class sometimes \nwill not be loaded because of a:\njava.lang.VerifyError: (class: org/apache/jsp/flogon$jsp, method: _jspService \nsignature: \n(Ljavax/servlet/http/HttpServletRequest;Ljavax/servlet/http/HttpServletResponse;\n)V) Incompatible object argument for method call\nat java.lang.Class.newInstance0(Native Method)\nat java.lang.Class.newInstance(Class.java:254)\nat org.apache.jasper.servlet.JspServlet$JspServletWrapper.load \n(JspServlet.java:139)\nI tried to isolate the cause and after i added overrides for the used \ngetXxx/setXxx functions of the tag (simply calling the superfunction), the \nverify passed and everything worked (so the classloader must have been always \nable to locate the used classes - in fact, if i used \"simple\" tags of the same \npackages, the problem never occured). Unfortunately the error does not appear \nalways, so i am not sure that i found the cause or if it's some side effect \nworkaround. What exactly is verified by which class loader on the load of a JSP \nservlet class?", "id": 16629, "time": "2002-05-24T08:42:16Z", "creator": "stutte@interfree.it", "creation_time": "2002-05-24T08:42:16Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "remm@apache.org", "attachment_id": null, "text": "I didn't know this could also happen with Jasper 1.\nIt is caused because Jasper uses the classic compiler to compile the generated \nclasses. Compiling with the modern compiler (which is the default on JDK 1.3 \nand 1.4) by hand should fix the issue.\n\nJasper 2 now fixes it by using Ant.", "id": 16671, "time": "2002-05-24T15:30:03Z", "bug_id": 9375, "creation_time": "2002-05-24T15:30:03Z", "is_private": false}, {"count": 2, "text": "Tomcat uses the JDK 1.3 from IBM on my machine. Does its compiler have the same \ndifferences between \"modern\" and \"classic\"? Or do i have to use Suns JDK (which \nwith my applications is much slower due to the garbage collector). Is there a \npossibility to use IBMs JDK for execution, but Suns javac for jaspers compiling \nand how do i set this up?\nThank you,\nJens Stutte", "creator": "stutte@interfree.it", "is_private": false, "id": 16764, "time": "2002-05-27T08:01:12Z", "bug_id": 9375, "creation_time": "2002-05-27T08:01:12Z", "tags": [], "attachment_id": null}]