[{"count": 0, "tags": [], "creator": "noel_osullivan@amp.com.au", "is_private": false, "text": "It is common when creating an EAR for deployment under certain containers (e.g. \nWeblogic) to want to add some extra information to the EJB Jar Manifests. A \nperfect example is when a utility JAR is to be included in the EAR and you want \neach EJB to reference it using the Class-Path: directive.\n\nIt would be god to be able to do this in either the EJB Jar task and/or the EAR \ntask. After all, the ejbjar task is meant to be an extension of the jar task - \nand it supports specification of a manifest file ...", "id": 16762, "time": "2002-05-27T02:10:32Z", "bug_id": 9431, "creation_time": "2002-05-27T02:10:32Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 9431, "is_private": false, "id": 16973, "attachment_id": null, "creator": "conor@apache.org", "creation_time": "2002-05-31T01:56:09Z", "time": "2002-05-31T01:56:09Z", "text": "The <ejbjar> task supports adding two methods of adding manifests to the\ngenerated jars. \n\n1. <ejbjar> will automatically pickup manifest files which are associated with\nthe deployment descriptors <ejbjar> is processing. The association will depend\non the naming scheme you are using. If you are using descriptor naming, eg your\ndescriptor is Bean-ejb-jar.xml, the manifest will be Bean-manifest.mf. For the\nother naming schemes, where the desciptor has the vanilla name ejb-jar.xml, the\nmanifest will be named manifest.mf. In all cases the manifest file should be\ncolocated with the desriptor\n\n2. You can specify a manifest attribute in the <ejbjar> task itself identifiying\na file to be used as the manifest for all generated jars. \n\nWhere both methods are used the first takes precedence.\n\nThe effect of specifying these manifests is to add the manifest to the generic\njar which is subsequently fed into the vendor specific tool (ejbc in weblogic's\ncase). I'm pretty sure that earlier versions of ejbc did not propagate this\nmanifest into the generated output jar.\n\nI'd suggest trying out the next beta (1.5 Beta2)\n\nAnd finally, just to clear up a misconception, <ejbjar> is not strictly\nconsidered an extension of <jar>. "}]