[{"attachment_id": null, "tags": [], "creator": "larsga@garshol.priv.no", "text": "external-parameter-entities I absolutely must have support for, or find a different parser which supports it (unfortunately no other SAX 2.0 parsers in Java support it). The reason is that my application has no need for the DTD,\nand will quite often be given XML documents to read that contain <!DOCTYPE \ndeclarations which point to nowhere sensible. Currently parsing will then fail, and I need to turn DTD reading off to avoid this problem.\n\nIf Xerces does not add support for this I will need to hack support into Michael Kay's version of David Brownell's version of Microstar's Ælfred, and I really would like to avoid that.", "count": 0, "id": 1217, "time": "2001-03-12T10:07:46Z", "bug_id": 944, "creation_time": "2001-03-12T10:07:46Z", "is_private": false}, {"count": 1, "text": "I checked on the code and it appears that while we recognize the feature we \nonly let one set it to true, or raise a not supported exception. I would think \nthat supporting a feature implies we support both states...\nThis said, we have a \"proprietary\" feature that allows one to turn off external \nDTD loading. See 'load-external-dtd' in the features doc.\nI agree that it be good to implement external-parameter-entities and it should \nbe made so that setting it also sets load-external-dtd accordingly.\nGiven that we have a solution to the specific problem reported I'm changing the \npriority to Medium.", "bug_id": 944, "is_private": false, "id": 1373, "time": "2001-03-19T10:06:37Z", "creator": "lehors@apache.org", "creation_time": "2001-03-19T10:06:37Z", "tags": [], "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 944, "text": "What you have is a proprietary solution. The whole point of SAX was that it\nwas supposed to make applications parser-independent. This feature is essential for anyone who wants to make parser-independent applications, since <!DOCTYPE declarations pointing out into nowhere are very common.", "id": 7384, "time": "2001-10-31T10:25:13Z", "creator": "larsga@garshol.priv.no", "creation_time": "2001-10-31T10:25:13Z", "is_private": false, "attachment_id": null}]