[{"count": 0, "attachment_id": null, "creator": "paulmcferrin@worldnet.att.net", "is_private": false, "id": 16992, "time": "2002-05-31T14:29:51Z", "bug_id": 9540, "creation_time": "2002-05-31T14:29:51Z", "tags": [], "text": "In moving my existing Apache 1.3.22 [bindist] (Cygwin based) to my Windows XP \nplatform (Cygwin based), I have encountered two problems.  The first problem \n(can't fork) was due to a cygwin problem that required me to rebase all of the \nDLLs.  After rebasing the DLLs, the httpd now starts.  First problem is solved.\n\nSecond problem...\n\nWhen viewing any page that has elements over approx 32KB in size, all bytes \nbeyond the 32KB boundary is garbage.  If you have images on the page, only the \n1st 32KB of the image is intact.  The rest is garbage.  The total downloaded \nimage size is correct!  If you download a file (http) and save it, only the 1st \n32KB will be correct, the remainder of correct size will be garbage.\n\nWhen I compare the download images & files with the source file, the diffeence \nbegins at byte offset 32769.  Files & elemments less than 32KB in size are \nloaded correctly.  If the HTML page itself is over 32KB (no graphics), the page \nis corrupted beyond the 32KB boundary.\n\nI then upgraded to the latest httpd release for Cygwin [bindist] (1.3.24) and \nthe same problem appears.  When I look at the error_log file, there is nothing \nof consequence being logged.  I'm running Cygwin DLL version 1.3.6.\n\nAt least one other user on the Cygwin mailing list is having the same problem \nwith data corruption beyond 32K on Win XP.  I have made several posts to the \ncygwin mailing lists but no one has taken the bite as it is not clear it is a \nCygwin problem.  This problem is present only on the Win XP system.  I'm running \nthe Professional version.\n\nYou can access my webserver on port 81 to see the problem at:\n\n        http://pmcferrin.Ugate.Net:81/photos/Live_Nature/\n\nThese images are loaded correctly when using the httpd server on my Win 98 \nsystem or if I point my browser to the hard disk.\n\nIn the first problem, the following rebase command was executed (a requirement):"}, {"count": 1, "tags": [], "creator": "paulmcferrin@worldnet.att.net", "is_private": false, "text": "Oops!  I accidentally clicked the submit button!  The COMPLETE bug report can be \nfound in Bug ID #9541.  Feel free to close out #9540", "id": 16994, "time": "2002-05-31T15:09:16Z", "bug_id": 9540, "creation_time": "2002-05-31T15:09:16Z", "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 9540, "is_private": false, "text": "\n  This is quite possibly related to the afd.sys bug described on the\n  \"XP Users Read Me First\" entry in the www.apache.org/dist/httpd/binaries/win32/\n  distribution page.  Please give that a shot, since you can't reproduce on 2K\n  or NT, correct?\n", "id": 16995, "time": "2002-05-31T15:37:50Z", "creator": "wrowe@apache.org", "creation_time": "2002-05-31T15:37:50Z", "attachment_id": null}, {"count": 3, "attachment_id": null, "bug_id": 9540, "text": "\n\n*** This bug has been marked as a duplicate of 9541 ***", "id": 16997, "time": "2002-05-31T15:41:57Z", "creator": "wrowe@apache.org", "creation_time": "2002-05-31T15:41:57Z", "tags": [], "is_private": false}]