[{"count": 0, "attachment_id": null, "bug_id": 9614, "is_private": false, "id": 17155, "time": "2002-06-05T01:59:37Z", "creator": "jnr8375@garnet.acns.fsu.edu", "creation_time": "2002-06-05T01:59:37Z", "tags": [], "text": "First off, I would like to say that this issue did not appear in 2.0.35 (which \nI am currently using on another machine).\n\nThe problem: I have Apache installed on the C drive of my machine (Win2k \nProfessional system with two physical hard disk drives).  The web files \n(.html, .pl, images, etc.) of the web sites are located on the D drive.  Any \nDocumentRoot or <Directory> that is on the D drive will make Apache fail to \nstart (in /logs/error.log, it says \"DocumentRoot must be a directory\").  An \nexample of what is currently working on Apache 2.0.35 in this configuration but \nnot in 2.0.36 is the following:\n\n  DocumentRoot \"D:/Apache Web Sites/default/inet_pub\"\n- later in httpd.conf -\n  <Directory \"D:/Apache Web Sites/default/inet_pub\">\n\n(That is in the 'Main' Server Configuration Section of the http.conf file, it \nalso doesn't work in any Virtual Hosts)\n\nIf I copy the files to the C drive and change the conf file to look like this \nit will start just fine:\n\n  DocumentRoot \"C:/Apache Web Sites/default/inet_pub\"\n- later in httpd.conf -\n  <Directory \"C:/Apache Web Sites/default/inet_pub\">\n\nI have narrowed it down to the drive letter causing the problems after \nextensive trial and error.  I even tried mounting the drive currently mounted \nas \"D\" to a directory on C called \"D-Drive\" to see if it worked that way.  It \ndid not, so it has something to do with it physically BEING another drive.  \nThat, however, shouldn't be a necessary solution to this... especially \nconsidering that it worked just fine in all previous versions of Apache I have \nrun on these systems (1.3.22, 1.3.24, 2.0.28 (beta), and 2.0.35).\n\nI also tried to put Drive D in the path (a long shot, but just to see if it \nwould work, and THAT didn't work either).\n\nDo you have any cleaner ideas than re-mounting my drives (which did NOT work) \non how to get this to work the way it used to on Apache Win32 2.0.35?"}, {"count": 1, "attachment_id": null, "bug_id": 9614, "text": "\n  Sorry, does work.  Who has permission to access D: files?  (Including \n  directory listing privilage from the root of D: through the content\n  directories, which is required for Apache to 'correct' the aliases and\n  filename case.)  SYSTEM (e.g. LocalSystem)?  This is the default for\n  the Apache service.  If you have changed the \"Run as User\"... option,\n  that user better have list directory/read files privilage to the content.\n\n\n\n", "id": 17158, "time": "2002-06-05T05:18:35Z", "creator": "wrowe@apache.org", "creation_time": "2002-06-05T05:18:35Z", "tags": [], "is_private": false}, {"count": 2, "attachment_id": null, "bug_id": 9614, "text": "Thank you Will,\n\nYou were correct.  I was approaching it with a bit of tunnel vision.  The \nservice simply needed to be started as another user.\n\nI appreciate the objective help!\n\n-Joseph", "id": 17312, "time": "2002-06-06T13:20:10Z", "creator": "jnr8375@garnet.acns.fsu.edu", "creation_time": "2002-06-06T13:20:10Z", "tags": [], "is_private": false}]