[{"count": 0, "tags": [], "text": "I think it would be very useful to be able to specify a log file where\nstderr and stdout would be stored. This is now possible by redirecting\nthese streams externally when starting Tomcat but it would be much more\nuseful if it was integrated with the already present logging features\nof Tomcat.\nThe benefits would be, IMHO, quite important especially during the\nproduction phase, as these logs are very important when debugging \napplications. Rotating them would also be very important and as this\nfeature would be incorporated in future enhancements of the Tomcat logging\nsystem, it will will be incorporated without much effort.\nThe proposed sytax for the configuration file would be very similar to the \nalready present logging facilities. Extracted from a Ignacio J. Ortega\nproposal, it would be something like...\n<Logger name=\"System.out\"\n        path=\"logs/out.log\"\n        verbosityLevel = \"DEBUG\" />\n<Logger name=\"System.err\"\n        path=\"logs/out.log\"\n        verbosityLevel = \"DEBUG\" />\nThe implementation shouldn't be very difficult, as redirecting these streams can \nbe done very easily through the calls System.setErr and System.setOut.\nAs this is a RFE and affects all platforms, I don't include any reference to \noperating systems...", "is_private": false, "bug_id": 962, "id": 1248, "time": "2001-03-13T06:11:22Z", "creator": "D.Lopez@uib.es", "creation_time": "2001-03-13T06:11:22Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 962, "attachment_id": null, "id": 1466, "time": "2001-03-20T13:15:16Z", "creator": "marc.saegesser@apropos.com", "creation_time": "2001-03-20T13:15:16Z", "is_private": false, "text": "Won't be addressed for Tomcat 3.2.2 but will be evaluated for later releases."}, {"count": 2, "tags": [], "bug_id": 962, "text": "Regardless of this option, the original stderr and stdout should still go somewhere, so we cannot get rid of those streams being redirected externally by whatever runs Tomcat.\n\nIn current versions of Tomcat there is \"swallowOutput\" option on Context [1], that will cause stderr and stdout of a webapp being caught and redirected to the proper logging subsystem -- for those webapps that are still using System.err and System.out.\n\n[1] http://tomcat.apache.org/tomcat-6.0-doc/config/context.html\n\nThe <Logger> element is no longer used in the configuration.\n\nI am changing resolution of this issue from \"RESOLVED LATER\" to \"RESOLVED WONTFIX\".", "id": 143257, "time": "2011-01-10T18:56:01Z", "creator": "knst.kolinko@gmail.com", "creation_time": "2011-01-10T18:56:01Z", "is_private": false, "attachment_id": null}]