[{"count": 0, "tags": [], "creator": "epugh@upstate.com", "attachment_id": null, "is_private": false, "id": 17181, "time": "2002-06-05T14:36:55Z", "bug_id": 9633, "creation_time": "2002-06-05T14:36:55Z", "text": ">I want to put a board around the edge of a merged cell..  I don't really\n>want to get the region dimension and then figure out which cells need which\n>boards...  Right now, I put a complete box boarder around the original cell,\n>then merge it, and the outer edges of the original cell show through...  It\n>would be nice to apply styles to regions...\n>  \n>\nI checked, and it does appear that you can do this in excel.  My next \nquestion will of course be \"Is excel actually\ndoing this or just setting the format to the boarder for each of the \ncells\" but I'll not have time to look at this for a little while.\n(swamped).  Please put this in bugzilla with [RFE] in the subject, and \ntarget for 2.0-dev and I'll look at it more later."}, {"count": 1, "tags": [], "creator": "glens@apache.org", "attachment_id": null, "id": 19888, "time": "2002-07-20T12:40:12Z", "bug_id": 9633, "creation_time": "2002-07-20T12:40:12Z", "is_private": false, "text": "Okay, I've done some research on this.  What excel does is create blank and\nmulblank records in the merged cells so that it can apply the styles for the\nborders.  As a workaround you could probably use blank cells do this yourself\nbut POI should probably:\n\n1. provide some sort of ability to apply these sorts of operations to ranges.\n2. (maybe) extend existing styles to the merged cells."}, {"count": 2, "tags": [], "bug_id": 9633, "attachment_id": null, "id": 127837, "creation_time": "2009-06-10T13:28:07Z", "time": "2009-06-10T13:28:07Z", "creator": "markt@apache.org", "text": "Reset assignee.", "is_private": false}, {"count": 3, "tags": [], "creator": "dfisher@jmlafferty.com", "text": "Hi,\n\n(1) This feature is available in HSSF in POI 3.5 using HSSFRegionUtil.\n\n(2) It is not yet available on XSSF. This was noted by someone on the user list. They attached a patch to their email, and I have reattached it here.\n\nHere is the text of the email and the self-reply.\n\nHi\n\nI did not find any utility classes for XSSF , hence I just took the two classes for HSSF and migrated them so that they can be used with both XSSF and HSSF using the ss usermodel.\n\nI have included the source code here if anyone wants to use it and if the primary authors would like to add this \nto the next POI distribution.I do not know how can I get this into the codebase but I think this might be useful to someone working with merged regions in the new XML styled workbooks.\n\n\nI think these classes can replace the HSSFRegionUtil and HSSFCellUtil class.\n\nRegards\nA\n\n\n-----Original Message-----\nFrom: Avinash Kewalramani [mailto:AKewalramani@accelrys.com] \nSent: Thursday, January 22, 2009 10:17 AM\nTo: POI Users List\nSubject: Setting boreders types and colors around merged regions\n\nHi\n\nIs there a utility class for setting border color and styles around a merged region of cells in XSSF?\nI see from the documentation that there are utility classes like HSSFRegionUtil and HSSFCellutil\nfor doing this on the HSSF side. Is there something parallel/similar for working with XSSF worksheets?\n\nThanks and Regards\nA", "id": 127849, "time": "2009-06-10T14:09:22Z", "bug_id": 9633, "creation_time": "2009-06-10T14:09:22Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "text": "Created attachment 23790\nA contribution from someone on the user list", "is_private": false, "bug_id": 9633, "id": 127850, "time": "2009-06-10T14:10:37Z", "creator": "dfisher@jmlafferty.com", "creation_time": "2009-06-10T14:10:37Z", "attachment_id": 23790}, {"attachment_id": null, "tags": [], "creator": "josh@apache.org", "text": "(In reply to comment #4)\n> Created an attachment (id=23790) [details]\n> A contribution from someone on the user list\n\nThanks Dave.\n\napplied in svn r783554\n\nThis code is still part of the contrib sub-project.  It seems like it is stable (and well understood) enough to be moved into src/java", "count": 5, "id": 127851, "time": "2009-06-10T15:36:17Z", "bug_id": 9633, "creation_time": "2009-06-10T15:36:17Z", "is_private": false}]