[{"count": 0, "tags": [], "bug_id": 9688, "is_private": false, "text": "I've just written a new Ant task that wraps the JavaNCSS library\n(http://www.kclee.com/clemens/java/javancss/) for determining source code\nmetrics and would like to propose it be added to Ant's optional.jar.\n\nThe task enables metrics about a project's source code to be collected during a \nbuild. Metrics can be collected globally and at class and function level and \ninclude the number of non-commenting source statements (NCSS) and function \nCyclomatic Complexity Number (McCabe metric). Packages, classes, functions and \ninner classes are counted and average values calculated. Javadoc coverage can \nalso be determined.\n\nI have already spent some time looking at Steve Jernigan's existing Ant task\nfor JavaNCSS on SourceForge (http://sourceforge.net/projects/javancss2ant/)\nwith a view to combining the functionality his task provides (metrics\nthreshold checking) with mine (report generation). Clemens Lee, the author\nof JavaNCSS, has also been involved in this discussion. In the end we\ndecided this would not be possible as Steve's code requires the JavaNCSS\nlibraries be present at compile time which appears to be in conflict with\nthe principle that all Ant optional tasks should stand alone from external\nlibraries.", "id": 17396, "time": "2002-06-07T10:29:39Z", "creator": "phillip.wells@drkw.com", "creation_time": "2002-06-07T10:29:39Z", "attachment_id": null}, {"count": 1, "tags": [], "bug_id": 9688, "attachment_id": 2025, "id": 17397, "creation_time": "2002-06-07T10:30:50Z", "time": "2002-06-07T10:30:50Z", "creator": "phillip.wells@drkw.com", "text": "Created attachment 2025\nSource code and documentation (zip file)", "is_private": false}, {"count": 2, "tags": [], "bug_id": 9688, "text": "don't you think it should be better to have this task parts of JavaNcss rather \nthan Ant ?", "id": 17566, "time": "2002-06-11T10:29:13Z", "creator": "sbailliez@apache.org", "creation_time": "2002-06-11T10:29:13Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "creator": "phillip.wells@drkw.com", "is_private": false, "text": "You could make the same argument for any of the other optional tasks that \ndepend on third-party Java libraries, such as the JDepend task or even the \nJUnit task. Having these tasks as part of Ant, however, increases awareness of \nthese tools within the Java community as I would imagine most Ant users will \nscan through the lists of core and optional tasks after each release to see \nwhat's new. \n\nHowever, I understand the concern with the growing size of the optional jar. \nPerhaps an alternative would be to include a section containing links to \nexternal tasks in the Ant manual (in the same format as the current lists of \ncore and optional tasks), rather than just having it as another page on the \nwebsite.\n\nIn the longer term perhaps it would be worth considering pushing *all* optional \ntasks that could be bundled with the tools they wrap back into those tools. \nThere would then be little distinction between the remaining optional tasks \n(such as the Visual Source Safe tasks) and the core tasks - perhaps it would \nthen make sense to merge the two?", "id": 17567, "time": "2002-06-11T11:02:59Z", "bug_id": 9688, "creation_time": "2002-06-11T11:02:59Z", "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 9688, "attachment_id": null, "id": 17572, "time": "2002-06-11T12:12:29Z", "creator": "sbailliez@apache.org", "creation_time": "2002-06-11T12:12:29Z", "is_private": false, "text": "Since from what you say, the author of JavaNcss has been part of the \ndiscussion, I assume it would be much better to add this to JavaNcss rather \nthan to Ant especially since JavaNcss is under GNU GPL.\n\nConsidering the amount of work put into antlib/ant 2 it is unnecessary to me to \nadd another external dependency like this especially since we will have to deal \nwith backward compatibility problems while the author of the external does not \nnecessarily. (plus an Ant task already exists and could be donated back to the \nproject...)\n\n"}, {"count": 5, "tags": [], "bug_id": 9688, "is_private": false, "text": "I'm sorry but I'm setting this bug as invalid as from your comments it is \nmainly to increase awareness of JavaNcss. Plus there is already an existing \ntask doing so, there is no reason to create a new task and to store it in \nanother location and thus increase chaos.\n\nAFAIK, in the metrics topic, JDepend has an Ant task in its jar and awareness \nlooks good so far so IMHO the task being in Ant optional jar is not a real \nproblem.", "id": 18429, "time": "2002-06-23T20:28:18Z", "creator": "sbailliez@apache.org", "creation_time": "2002-06-23T20:28:18Z", "attachment_id": null}, {"count": 6, "tags": [], "bug_id": 9688, "text": "Sorry Stephane - I guess I've not done a very good job of explaining myself. \nLet me try again.\n\nThe existing JavaNCSS Ant task does not provide the same functionality as the \none I wrote. The existing task allows boundary checking to be performed on \nmetrics but does not enable the generation of a report; mine generates a report \nbut does not allow boundary checking. The existing task uses the JavaNCSS API \nand so requires JavaNCSS libraries to be present at compile time; the task I \nsubmitted here just calls the commandline interface so the libraries are \nrequired only at runtime. This should also avoid any issues with JavaNCSS being \nGNU GPL.\n\nI still don't quite understand why you're unhappy with a JavaNCSS task in \noptional.jar yet are comfortable with the JDepend one. Both tasks are just \nwrappers for the commandline tool. Both JDepend and JavaNCSS are distributed as \njar files. Both underlying tools use a different licence from the Apache one. I \nreally can't see any difference between the two. What set of criteria must a \ntask meet for it to be included in optional.jar? ", "id": 18448, "time": "2002-06-24T09:06:33Z", "creator": "phillip.wells@drkw.com", "creation_time": "2002-06-24T09:06:33Z", "is_private": false, "attachment_id": null}, {"count": 7, "tags": [], "bug_id": 9688, "attachment_id": null, "id": 18450, "time": "2002-06-24T09:32:26Z", "creator": "sbailliez@apache.org", "creation_time": "2002-06-24T09:32:26Z", "is_private": false, "text": "I'm not confortable because the maintenance and support cost is very high and \ndistracting while all the effort could be on the core and let people plug in \ntheir tasks. So it won't help at all if we accept all tasks that are available.\n\nI will copy/paste what Steve Loughran already explained well concerning this \nparticular issue:\n\n\"FYI we are trying to move away from putting everything in optional.jar and \nmove to a world where we can load stuff from jars more easily; once that is \ndone we can break up optional jar into pieces anyway. Adding more tasks to ant \njust adds diversionary work.\n\nIn particular, for other open source projects we like the tasks to go with the \nprojects themselves, if at all possible.\"\n\nWe went through a path that we feel is not good from our own experience and we \nwould like to change it so that it benefits to everyone.\n\nNote: I apologize since I did not mean to take JDepend as an example since this \none has been part of our mistake mission :-). You'll find a number of packages \nwith their own tasks in their jar here:\nhttp://jakarta.apache.org/ant/external.html\n\nHope this clarify the situation. I understand your concern but please try to \nunderstand ours. Keep in mind that the task explosion is an issue because it \nforce committers to have dozen and dozen of packages they are not confortable \nwith and they are unable to test. So the overall quality suffer from this.\n"}]