[{"count": 0, "tags": [], "creator": "bjs@ivorix.com", "attachment_id": null, "id": 17438, "time": "2002-06-08T12:19:28Z", "bug_id": 9714, "creation_time": "2002-06-08T12:19:28Z", "is_private": false, "text": "We are running Apache 2.0.36 on several 2-processor Windows 2000 and XP \nProfessional machines. On Windows XP (even freshly installed without any other \nsoftware or operating system fixes) the Apache service cannot be started. On \nsingle processor machines everything is fine.\n\nWhen I attempt to start the properly installed service using the services \nconsole the following error is reported:\n\n\"Could not start the Apache2 service on Local Computer\nError 1053: The service did not respond to the start or control request in a \ntimely fashion.\"\n\nI was able to reproduce the problem on 2 different SMP machines - one with all \nthe operating system security fixes applied, one with no fixes applied (fresh \ninstall). On Windows 2000 SMP everything works fine. When started from the \ncommand line under XP everything works as expected.\n\nUnfortunately I was unable to debug the service init in order to find the line \nwith the failing call.\n\nIf you need any assistance on Windows XP SMP please let me know. I'd be glad to \nsupport the developer(s)."}, {"count": 1, "tags": [], "creator": "wrowe@apache.org", "text": "\n  Clarification; can you install as a console app (not a shared service)\n  and run under XP SMP?\n\n  Also, please check the error.log file AND the Application Event Log\n  for additional details of why the service would not start.\n\n  Many thanks for your offer of support.", "id": 18405, "time": "2002-06-23T08:54:55Z", "bug_id": 9714, "creation_time": "2002-06-23T08:54:55Z", "is_private": false, "attachment_id": null}, {"count": 2, "tags": [], "bug_id": 9714, "attachment_id": null, "id": 18427, "time": "2002-06-23T20:04:35Z", "creator": "bjs@ivorix.com", "creation_time": "2002-06-23T20:04:35Z", "is_private": false, "text": "I CAN run the server from the console. It starts the two client processes, and \neverything works as expected besides the fact that there is now way other than \nkill to stop these processes.\n\nNOTHING appears in the error.log! Strange... Although the ap_log* calls are in \nplace and executed, no log is written.  \n\nFrom the Application event log:\n\n\"The Apache service named  reported the following error:\n>>> (23563)The service process could not connect to the service controller.  : \nError starting service control dispatcher   \"\n\nI managed to debug the service startup:\n\nStartServiceCtrlDispatcher at service.c:577 fails with rv = 23563. GetLastError\n() reports 1063.\n\nIn general it seems to be against the rules to call StartServiceCtrlDispatcher \nfrom a thread in a DLL (libhttpd.dll). According to the docs the function \nshould be called from the main thread of the application. I also see that the \nservice entry function should have WINAPI (_cdecl) linkage type. I changed the \nlatter with no effect.\n\nWe have a lot to do with services. And what happens in the Apache2 code seems a \nlittle bit strange to me. I would help to come to a more general solution that \nwill work (like our services). I could supply a sample (unfortunately C++) \npointing out how you could forever get rid of the service problems (we can also \nnot install the service with dependencies on other services like a database). \nIf C++ is a no-go for this project, the class may help to refactor the service \nstuff in C. Just send me a mail (bjs@ivorix.com) and I send the code (single \nC++ class plus sample service).\n\nregards benjamin"}, {"count": 3, "tags": [], "bug_id": 9714, "text": "\n  I have two suspicions.  The first is easier to walk than the other.\n\n  1. there is a race in the service mpm code when creating the \"SCM thread\",\n     a seperate thread that manages communications and args from the Service\n     Control Manager.\n\n  2. WinXP won't tolerate the SCM thread starting on a different CPU than the\n     original invocation.  This is probably unlikely, but serious enough to\n     consider processor affinity issues.\n\n  I will look for the race, and give you an update.  Have you checked .39?\n  [update the bug Version if you have.]", "id": 18430, "time": "2002-06-23T20:37:53Z", "creator": "wrowe@apache.org", "creation_time": "2002-06-23T20:37:53Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "bug_id": 9714, "text": "Updated to 2.0.39 -> problem gone. Thanx.", "id": 18441, "time": "2002-06-23T23:53:15Z", "creator": "bjs@ivorix.com", "creation_time": "2002-06-23T23:53:15Z", "is_private": false, "attachment_id": null}, {"text": "\n  Problem in SMP processing was resolved with the MPM rewrite following 2.0.36.\n\n  Thanks for your report and follow up!", "tags": [], "bug_id": 9714, "attachment_id": null, "count": 5, "id": 18442, "time": "2002-06-24T00:41:59Z", "creator": "wrowe@apache.org", "creation_time": "2002-06-24T00:41:59Z", "is_private": false}]