[{"count": 0, "tags": [], "bug_id": 9808, "attachment_id": null, "is_private": false, "id": 17684, "time": "2002-06-12T16:18:31Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-06-12T16:18:31Z", "text": "I am putting this in bugzilla because it seems people are too busy to look at \nthis during the 1.5 beta cycle and I don't want it to be forgotten.\n\nI have written a symlink task which should be useful for managing websites on \nunix or any other case where the symlinks in a directory may constitute valuable \ninformation.\nThis task allows one to quickly and easily record the symlinks in an entire \ndirectory structure in a properties file. \n\nThis makes it possible to have a directory that consists entirely of symlinks, \nand can be recreated without shell script and without typing in the links by \nhand.\n\nThe way I plan to use this is to record the links, and check the properties \nfiles into CVS. This way when cvs checks them out it creates the directories \ntoo. Then ant can\ncome along and read the properties file making all the links I need.\n\nI hope others will find this taks useful as well.\n\nThe symlink task highlights:\n - make a symlink\n - delete a symlink without deleting the target file/directory\n - record all the symlinks in a directory tree in a properties file\n - recreate the symlinks in a directory tree from the properties file\n - failonerror or not\n - overwrite existing symlinks or not.\n - symlink deletion method is exposed as a static utility function for use by \ndevelopers\n - I have chosen not to expose the properites file creation method in this task \nbut both it and the symlink deletetion method might be transportable to \nFileUtils.java (the\nmethod in the PropertyFile task that I mostly copied is private). I will let the \ncommiters decide on this one however.\n\nCode and Testcases compiled and run on sun jdk 1.4.0 and ibm jdk 1.1.8_v1 \nunder linux 2.4 kernel\n\nEnjoy,\nGus"}, {"count": 1, "tags": [], "text": "Created attachment 2069\nThe submitted code/patch", "is_private": false, "id": 17685, "creator": "gus.heck@olin.edu", "time": "2002-06-12T16:21:17Z", "bug_id": 9808, "creation_time": "2002-06-12T16:21:17Z", "attachment_id": 2069}, {"count": 2, "tags": [], "text": "Don't put this in just yet.. I just fed a very large fileset to an action=record \non my machine (>6500 matches) and it did (not so) funny things, including \ngenerating false positives in a way that makes no sense. Not sure the size of \nthe fileset is the issue either. Tracking it down, and will submit a new \nattachment when I get it working again.", "is_private": false, "bug_id": 9808, "id": 18621, "time": "2002-06-26T21:22:58Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-06-26T21:22:58Z", "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 9808, "attachment_id": null, "id": 18815, "time": "2002-07-01T19:24:07Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-07-01T19:24:07Z", "is_private": false, "text": "Ok ready again. It was just me trying to use Enumerations like Iterators, and\nskipping an item each time I removed one. Nasty thing was I got \"lucky\" with my\ntest case and things were happening in an order that masked the problem, but is\nnot a guaranteed order, and obviously some conditions still slipped through.\n\nI have updated the testcase so it fails with the old version, and fixed my code\nso this version passes the test.  I Simplified the logic while I was at it. This\nshould be ready for ant 1.6 branch whenever that becomes active.\n\nAlso fixed a few typos in my doc page, and javadocs.\n\nAttaching updated submission next.\n\nEnjoy,\nGus"}, {"count": 4, "tags": [], "bug_id": 9808, "attachment_id": 2227, "is_private": false, "id": 18816, "time": "2002-07-01T19:26:52Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-07-01T19:26:52Z", "text": "Created attachment 2227\nUpdated submission."}, {"count": 5, "tags": [], "bug_id": 9808, "attachment_id": null, "id": 19873, "time": "2002-07-20T01:27:12Z", "creator": "gus.heck@olin.edu", "creation_time": "2002-07-20T01:27:12Z", "is_private": false, "text": "So, any1 got time to look at submissions and maybe commit them... like this \none, or the chmod/chgrp/chown one (9809) now that 1.5 is released? I know \nthere are several other submissions besides mine waiting for review.\n"}, {"count": 6, "tags": [], "bug_id": 9808, "attachment_id": null, "id": 25791, "time": "2002-11-06T15:09:29Z", "creator": "bodewig@apache.org", "creation_time": "2002-11-06T15:09:29Z", "is_private": false, "text": "I've committed the task (but moved it to optional.unix)."}]