[{"count": 0, "tags": [], "creator": "gus.heck@olin.edu", "text": "I am putting this in bugzilla because it seems people are too busy to look at \nthis during the 1.5 beta cycle and I don't want it to be forgotten.\n\nI have written two new tasks, chgrp and chown. They work exactly like \nthe existing chmod task. In fact the way I wrote them was to split \nChmod.java into AbstractAccessTask.java  and a new Chmod.java which \nsubclasses this. Then it was extremly easy to tweak the new chmod task \ninto the two new tasks. The documentation I provide is basically the \nchmod docs with the appropriate search/replaces too.\n\nI have done this (and my symlink task previously submitted) because I \nwant to (insofar as possible) be able to store the contents of a \ndirectory in CVS, delete the directory and then recreate an (almost) \nexact copy of the directory by calling an ant target that checks stuff \nout of cvs, recreates the links, and resets all the perms/ownerships\n\nWith these tasks this is now possible on unix platforms at least, with \nthe exception that the symlinks will get converted to canonical forms, \nbut this is as best I can tell an insurmountable limitation of java.\n\nI hope you like these tasks and will want to include them.\n\nGus\n\n(P.S. I'm not sure I like the name AbstractAccessTask even though I \npicked it. Feel free to think of a better one.)", "id": 17686, "time": "2002-06-12T16:29:12Z", "bug_id": 9809, "creation_time": "2002-06-12T16:29:12Z", "is_private": false, "attachment_id": null}, {"count": 1, "tags": [], "creator": "gus.heck@olin.edu", "attachment_id": 2070, "id": 17687, "time": "2002-06-12T16:29:54Z", "bug_id": 9809, "creation_time": "2002-06-12T16:29:54Z", "is_private": false, "text": "Created attachment 2070\nThe submitted code/patch"}, {"count": 2, "tags": [], "bug_id": 9809, "attachment_id": null, "text": "I've made some major changes, but the tasks as such are in now (in optional.unix).\n\nThe main changes:\n\n* I did not touch <chmod> at all.\n\n* I removed the implicit fileset and even more the inner magic of the dir\n  attribute from AbstractAccessTask - those are left-overs from Ant 1.1 and I see\n  little reason to add this cruft to new tasks.\n", "id": 25873, "time": "2002-11-07T16:00:47Z", "creator": "bodewig@apache.org", "creation_time": "2002-11-07T16:00:47Z", "is_private": false}, {"count": 3, "tags": [], "creator": "bodewig@apache.org", "text": "and it is in CVS now, errm.", "id": 25874, "time": "2002-11-07T16:01:07Z", "bug_id": 9809, "creation_time": "2002-11-07T16:01:07Z", "is_private": false, "attachment_id": null}]