[{"count": 0, "attachment_id": null, "creator": "dadams@ignitesports.com", "text": "Add the following task to your build.xml (substitute all ${} items):\n\t<!-- Check in file -->\n\t<target name=\"checkin\">\n\t\t<stcheckin URL=\"${ST.url}\"\n\t\t\tusername=\"${username}\"\n\t\t\tpassword=\"${password}\"\n\t\t\trootstarteamfolder=\"${starteamtarget}\"\n\t\t\trootlocalfolder=\"${localsource}\"\n\t\t\tincludes=\"${filename}\"\n\t\t/>\n\t</target>\n\nRegardless of the rootlocalfolder location or status of the file to checkin, \nthe file will be checked into StarTeam, adding to the file history. \nIn the Starteam GUI, if a file is to be checked in and that file has a status \nof Current, the file is not checked in. This is true if the Default or \nAlternate (GUI terms) working folders are set. \nThe expectation is that the Ant version works the same way. If the \nrootlocalfolder is set (or not set), the checkin process should verify the \nstatus of the file and then determine if the file should be checked in.", "id": 17752, "time": "2002-06-13T19:53:08Z", "bug_id": 9849, "creation_time": "2002-06-13T19:53:08Z", "tags": [], "is_private": false}, {"count": 1, "tags": [], "creator": "stevec@ignitesports.com", "attachment_id": null, "text": "After having looked into the matter, I remember the painful process by which I\ncame to implement this task in this half-baked manner.  Unfortunately, the\nfunctionality you wish for cannot be implemented given the tools we have to work\nwith.\n\nIn developing all of these StarTeam tasks we are constrained by what is\navailable in the starteam sdk.  Unfortunately in the starteam sdk, in the\ncom.starbase.starteam.File class, there are two getStatus() methods.  One takes\nno parameters and uses the file pointed to by the user-selected default path\nwithin the StarTeam GUI.  This method has public access.  Another, deeper method\ntakes a an arbitrary java.io.File as a parameter and compute's that file's\nstatus, but this method does not have public access and therefore cannot be\ncalled by ant code.  This is why the ant task will always compute status\nrelative to the default file unless forced is set true to override the status check.\n\n\nI consider this a bug in the starteam sdk, but since this sdk is entirely\nundocumented, it is not clear what can be done about it, although there may be\nsome way to do it that I have not been able to find.  \nI considered a possible workaround from an ant perspctive that would use the\n<exec> task around a call to the stcmd executable which may somehow work around\nthe problem.  Unfortunately, looking at the source code for stcmd, it seems that\nhere too, the status check around an arbitrary file is not implemented so I\ndoubt this workaround would work, though you are welcome to try it and prove me\nwrong.  If proven wrong, I will dig deeper into this.", "id": 17883, "time": "2002-06-16T15:10:28Z", "bug_id": 9849, "creation_time": "2002-06-16T15:10:28Z", "is_private": false}, {"count": 2, "tags": [], "bug_id": 9849, "text": "This is actually a duplicate of 14208 and I want to mark it fixed.", "id": 25786, "time": "2002-11-06T14:58:55Z", "creator": "stevec@ignitesports.com", "creation_time": "2002-11-06T14:58:55Z", "is_private": false, "attachment_id": null}, {"count": 3, "tags": [], "bug_id": 9849, "text": "This bug was fixed as a part of the more general fix implemented in CR 14208\n\n*** This bug has been marked as a duplicate of 14208 ***", "id": 25787, "time": "2002-11-06T14:59:53Z", "creator": "stevec@ignitesports.com", "creation_time": "2002-11-06T14:59:53Z", "is_private": false, "attachment_id": null}, {"count": 4, "tags": [], "creator": "stevec@ignitesports.com", "text": "Uh, that's \"Bug 14208\".  CR is Starteam terminology. :-)", "id": 25789, "attachment_id": null, "bug_id": 9849, "creation_time": "2002-11-06T15:00:31Z", "time": "2002-11-06T15:00:31Z", "is_private": false}]