[{"count": 0, "tags": [], "bug_id": 9960, "attachment_id": null, "id": 17993, "time": "2002-06-18T15:14:12Z", "creator": "peterj@liberate.com", "creation_time": "2002-06-18T15:14:12Z", "is_private": false, "text": "If a webapp is not present when Tomcat is started, but a local file\nwebapps/MyApp.xml exists, the <Context> in the xml file will be added to\nserver.xml when MyApp is deployed.  Although the <Context> is added to\nserver.xml, the deploy fails, reporting \"Application already exists at path\n/MyApp\"--in other words, the configuration for the application is present but\nthe app itself isn't.  (The parameters not listed in MyApp.xml that may exist in\nweb.xml are also not added, but this may be simply because MyApp.war is not\nbeing accepted.)\n\nIn order to get MyApp.war file onto the server, it's necessary to undeploy the\nwebapp, which removes the <Context> from server.xml, and deploy it again...\nexcept the new deployment ignores the <Context> in MyApp.xml and uses only the\ndefaults in the webapp's web.xml file.\n\nThis appears to be a Catch-22 situation: either you have the local configuration\nand no app, or the app and no local configuration."}, {"count": 1, "attachment_id": null, "bug_id": 9960, "text": "I don't understand your configuration or what you are trying to do.\nI have the impression you don't know how to use the deploy command (the XML \nfile should be put inside the WAR you deploy; it shouldn't be deployed to \nTomcat separately).", "id": 17995, "time": "2002-06-18T15:24:22Z", "creator": "remm@apache.org", "creation_time": "2002-06-18T15:24:22Z", "tags": [], "is_private": false}, {"count": 2, "tags": [], "bug_id": 9960, "attachment_id": null, "text": "Perhaps the context (pun not intended) was lost in the bug report; I've\npreviously posted information about the environment on tomcat-user and thought\nthis was a sufficiently-detailed bug report.  So here's what I'm trying to do.\n\nAs I understand it, Servlet 2.3 allows parameters set inside web.xml to be\noverridden \"locally\" on a remote server by the addition of a context fragment in\nthe webapps directory.  In fact, this is exactly how the \"manager\" and \"admin\"\nserver webapps are configured.  This behaviour is referred to in \"Automatic\nApplication Deployment\" in the Tomcat documentation:\n\n<blockquote>\nIf you are using the standard Host implementation, the following actions take\nplace automatically when Catalina is first started, if the autoDeploy property\nis set to true (which is the default value:\n\n- Any XML file in this directory [appBase] is assumed to contain a Context\nelement (and its associated subelements) for a single web application.  The\ndocBase attribute of this <Context> element will typically be the absolute\npathname to a web application directory, or the absolute pathname of a web\napplication archive (WAR) file (which will not be expanded).\n\n[...]\n\nIn addition to the automatic deployment that occurs at startup time, you can\nalso request that new XML configuration files, WAR files, or subdirectories\n(containing web applications) that are dropped in to the appBase directory while\nTomcat is running will be automatically deployed, according to the rules\ndescribed above.\n\n</blockquote>\n\nI'm aware that WEB-INF/web.xml must be placed inside the deployed .war file--a\nwebapp won't even work without it.  This is about overriding or adding\nparameters for a specific instance of a webapp.\n\nIf there's a parameter for the <deploy/> task that allows one to upload a\nseparate configuration file for an instance without changing the contents of the\n.war file itself, I'm not familiar with it.  Please point out the documentation\nthat I've obviously missed.", "id": 17998, "time": "2002-06-18T15:43:47Z", "creator": "peterj@liberate.com", "creation_time": "2002-06-18T15:43:47Z", "is_private": false}, {"count": 3, "tags": [], "bug_id": 9960, "attachment_id": null, "id": 18009, "time": "2002-06-18T21:39:09Z", "creator": "peterj@liberate.com", "creation_time": "2002-06-18T21:39:09Z", "is_private": false, "text": "Ian Darwin correctly pointed out in e-mail that I have confused the servlet spec\nwith Tomcat's configuration extensions.  (I should have figured this out from\nthe case discrepancies--the Servlet 2.3 descriptor DTD is entirely lowercase,\nwhile Tomcat's XML tags are in mixed case.)\n\nHowever, even though it's not in the servlet specification, my observation\ndoesn't seem to match what's been documented in Tomcat (quoted previously).  If\nthis (expected/desired) behaviour is incorrect, perhaps it could be clarified in\nthe documentation.\n\nThanks, Ian and Remy (and Jacob on tomcat-user), for your comments."}, {"count": 4, "tags": [], "text": "I have added some clarification to the docs that should help. This will be \nincluded in the next release. I have also included it here.\n\nWhen using automatic deployment, the docBase defined by an XML Context file \nshould be outside of the appBase directory. If this is not the case \ndifficulties may be experienced deploying the web application or the \napplication may be deployed twice.", "is_private": false, "id": 49619, "creator": "medthomas@ntlworld.com", "time": "2003-12-23T16:53:24Z", "bug_id": 9960, "creation_time": "2003-12-23T16:53:24Z", "attachment_id": null}]